 /*       SIST ENDRET 22/01-86 15.41.29 AV   HERMAN                   */00000000
 /*       SIST ENDRET 01/10-82 13.42.28 AV   FARVIK                   */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0014155 - FAI_GRENSER_FRAVIK - INTERN PROC I PLI.             */00000040
 /*    PROGRAMMERER: KRISTENSEN, MAI 1982.                            */00000050
 /*    ENDRET AV KARIN I JULI 82.                                     */00000060
 /*HENSIKT:                                                           */00000070
 /*    RUTINE FOR BEREGNING AV W_FAI_MAX I SPES. TILFELLE.            */00000080
 /*PROGRAMTILKNYTNING:                                                */00000090
 /*    PROGRAMMET BLIR INKLUDERT I R0014136 - ÅTTI_PROSENT_REGELEN.   */00000100
 /*                                   4101                            */00000110
 /*                                   4201                            */00000120
 /*                                   7001                            */00000130
 /*BRUK:                                                              */00000140
 /*    CALL FAI_GRENSER_FRAVIK(W_APD, W_FAI_MAX);                     */00000150
 /*ENDRET:                                                            */00000160
 /*    21.1.86 - HL : FEILRAPP 291 - DET SKALIKKE REGNES 10% TILLEGG  */00000170
 /* ***************************************************************** */00000180
 FAI_GRENSER_FRAVIK: PROC(W_APD,W_FAI_MAX);                             00000190
                                                                        00000200
 DCL                                                                    00000210
    W_APD             FIXED DEC(7,3),                                   00000220
    W_FAI_MAX         FIXED DEC(7);                                     00000230
                                                                        00000240
                                                                        00000250
 /* VI SKAL LAGE TEKST OM AT PENSJONISTER MÅ MELDE FRA OM ENDRET        00000260
    INNTEKT, VED LAVE INNTEKTER GJELDER GRENSENE I DENNE RUTINE  */     00000270
                                                                        00000280
 IF W_APD = 100 THEN                                                    00000290
                            /* W_FAI_MAX = 0.5 * G * 1.1;  */           00000300
                                                                        00000310
 /* ENDRET 21.1.86 HL. - DET SKAL IKKE GIS 10 % MARGIN     */           00000320
                                                                        00000330
       W_FAI_MAX = 0.5 * G;                                             00000340
                                                                        00000350
 ELSE IF W_APD = 75 THEN                                                00000360
                            /* W_FAI_MAX = G * 1.1;        */           00000370
    W_FAI_MAX = G;                                                      00000380
                                                                        00000390
 ELSE IF W_APD = 50 THEN                                                00000400
                            /* W_FAI_MAX = 1.5 * G * 1.1;  */           00000410
    W_FAI_MAX = 1.5 * G;                                                00000420
                                                                        00000430
 ELSE  /* W_APD = 25 */                                                 00000440
                            /* W_FAI_MAX = 2 * G * 1.1;    */           00000450
    W_FAI_MAX = 2 * G;                                                  00000460
                                                                        00000470
 /* FORHØYNING TIL NÆRMESTE HELE HUNDRE KRONER   */                     00000480
 W_FAI_MAX = ROUND(W_FAI_MAX + 49, -2);                                 00000490
                                                                        00000500
                                                                        00000510
 END FAI_GRENSER_FRAVIK;                                                00000520
