 /*       SIST ENDRET 29/08-97 12.28.41 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/08-97 08.53.10 AV   SPA7339                  */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /*    R0014327 - PROSEDYRE I PLI                                     */00000030
 /*    PROGRAMMERER:    HERMAN - AUGUST 1997                          */00000040
 /* *****************************************                         */00000050
 /*HENSIKT:                                                           */00000060
 /*    PROSEDYREN BEHANDLER UNGE DØDE (TP_GAR_KODE KAN BLI 'E')       */00000070
 /* ****************************************************************  */00000080
 /*PROGRAMTILKNYTNING:                                                */00000090
 /*    PROSEDYREN INCLUDES I R0014101(CALL I     ),4301(CALL I 4323) */ 00000100
 /*                          4501 (CALL I                             */00000110
 /*BRUK:                                                              */00000120
 /*    CALL UNGE_DØDE_E                                               */00000130
 /*    VIRK_ÅM                                                        */00000140
 /*    FNR_ÅR                                                         */00000150
 /*    ALDER                                                          */00000160
 /*    RETUR_POENG                                                    */00000170
 /* ***************************************************************** */00000180
                                                                        00000190
 %SKIP(2);                                                              00000200
 UNGE_DØDE_E:                                                           00000210
   PROC(VIRK_ÅM,FNR_ÅR,ALDER,RETUR_POENG);                              00000220
                                                                        00000230
   DCL VIRK_ÅM                         PIC      '(4)9';                 00000240
   DCL FNR_ÅR                          PIC        '99';                 00000250
   DCL ALDER                           PIC    'S99999';                 00000260
   DCL RETUR_POENG                     FIXED DEC (3,2);                 00000270
                                                                        00000280
   DCL VIRK_ÅM_HL                      PIC      '(4)9';                 00000290
   DCL FNR_ÅR_HL                       PIC        '99';                 00000300
   DCL ALDER_HL                        PIC    'S99999';                 00000310
   DCL RETUR_POENG_HL                  FIXED DEC (3,2);                 00000320
   VIRK_ÅM_HL = VIRK_ÅM;                                                00000330
   FNR_ÅR_HL = FNR_ÅR;                                                  00000340
   ALDER_HL = ALDER;                                                    00000350
   RETUR_POENG_HL = RETUR_POENG;                                        00000360
                                                                        00000370
   RETUR_POENG = 0;                                                     00000380
   IF VIRK_ÅM > 9706                 THEN                               00000390
      DO;                                                               00000400
         IF FNR_ÅR < 41                     THEN                        00000410
            DO;                                                         00000420
               IF ALDER < 2601                   THEN                   00000430
                  IF FNR_ÅR > 30                     THEN               00000440
                     RETUR_POENG = 3.30;                                00000450
                  ELSE                                                  00000460
                  IF ALDER < 2401                  THEN                 00000470
                     IF FNR_ÅR > 25                  THEN               00000480
                        RETUR_POENG = 3.00;                             00000490
                     ELSE                                               00000500
                     IF ALDER < 2201                  THEN              00000510
                        IF FNR_ÅR = 25                  THEN            00000520
                           RETUR_POENG = 2.00;                          00000530
                        ELSE                                            00000540
                        IF FNR_ÅR = 23             !                    00000550
                           FNR_ÅR = 24                  THEN            00000560
                           RETUR_POENG = 1.60;                          00000570
            END;                                                        00000580
      END;                                                              00000590
   ELSE  /*VIRKDATO 9705 ELLER 9706 :*/                                 00000600
   IF VIRK_ÅM > 9704                 THEN                               00000610
      DO;                                                               00000620
         IF FNR_ÅR < 43                   THEN                          00000630
            DO;                                                         00000640
               IF ALDER < 2401                THEN                      00000650
                  DO;                                                   00000660
                     IF FNR_ÅR > 30                     THEN            00000670
                        RETUR_POENG = 3.30;                             00000680
                     ELSE                                               00000690
                     IF FNR_ÅR > 25                  THEN               00000700
                        RETUR_POENG = 3.00;                             00000710
                     ELSE                                               00000720
                     IF ALDER < 2201                      THEN          00000730
                        IF FNR_ÅR = 25                  THEN            00000740
                           RETUR_POENG = 2.00;                          00000750
                        ELSE                                            00000760
                        IF FNR_ÅR = 23             !                    00000770
                           FNR_ÅR = 24                  THEN            00000780
                           RETUR_POENG = 1.60;                          00000790
                  END;                                                  00000800
            END;                                                        00000810
      END;                                                              00000820
   ELSE  /*VIRKDATO ER 9205-9704*/                                      00000830
   IF VIRK_ÅM > 9204                 THEN                               00000840
      DO;                                                               00000850
         IF FNR_ÅR < 43                   THEN                          00000860
            DO;                                                         00000870
               IF ALDER < 2401                THEN                      00000880
                  DO;                                                   00000890
                     IF FNR_ÅR > 25                     THEN            00000900
                        RETUR_POENG = 3.00;                             00000910
                     ELSE                                               00000920
                     IF ALDER < 2201                      THEN          00000930
                        IF FNR_ÅR = 25                  THEN            00000940
                           RETUR_POENG = 2.00;                          00000950
                        ELSE                                            00000960
                        IF FNR_ÅR = 23             !                    00000970
                           FNR_ÅR = 24                  THEN            00000980
                           RETUR_POENG = 1.60;                          00000990
                  END;                                                  00001000
            END;                                                        00001010
      END;                                                              00001020
   ELSE  /*VIRKDATO ER 9201-9204*/                                      00001030
   IF VIRK_ÅM > 9200                 THEN                               00001040
      DO;                                                               00001050
         IF FNR_ÅR < 45                   THEN                          00001060
            DO;                                                         00001070
               IF ALDER < 2201                THEN                      00001080
                  DO;                                                   00001090
                     IF FNR_ÅR > 25                     THEN            00001100
                        RETUR_POENG = 2.50;                             00001110
                     ELSE                                               00001120
                     IF FNR_ÅR = 25                  THEN               00001130
                        RETUR_POENG = 2.00;                             00001140
                     ELSE                                               00001150
                     IF FNR_ÅR = 23             !                       00001160
                        FNR_ÅR = 24                  THEN               00001170
                        RETUR_POENG = 1.60;                             00001180
                  END;                                                  00001190
            END;                                                        00001200
      END;                                                              00001210
   ELSE  /*VIRKDATO ER 9101-9112*/                                      00001220
   IF VIRK_ÅM > 9100                 THEN                               00001230
      DO;                                                               00001240
         IF FNR_ÅR < 45                   THEN                          00001250
            DO;                                                         00001260
               IF ALDER < 2201                 THEN                     00001270
                  DO;                                                   00001280
                     IF FNR_ÅR > 24                     THEN            00001290
                        RETUR_POENG = 2.00;                             00001300
                     ELSE                                               00001310
                     IF FNR_ÅR = 23             !                       00001320
                        FNR_ÅR = 24                  THEN               00001330
                        RETUR_POENG = 1.60;                             00001340
                  END;                                                  00001350
            END;                                                        00001360
      END;                                                              00001370
   ELSE  /*VIRKDATO 8907-9012 :*/                                       00001380
   IF VIRK_ÅM > 8906                 THEN                               00001390
      DO;                                                               00001400
         IF FNR_ÅR < 45                   THEN                          00001410
            DO;                                                         00001420
               IF ALDER < 2201                 THEN                     00001430
                  DO;                                                   00001440
                     IF FNR_ÅR > 22                     THEN            00001450
                        RETUR_POENG = 1.60;                             00001460
                  END;                                                  00001470
            END;                                                        00001480
      END;                                                              00001490
      RETUR_POENG_HL = RETUR_POENG;                                     00001500
 END UNGE_DØDE_E;                                                       00001510
