 /*       SIST ENDRET 12/02-97 09.08.10 AV   JDA7339                  */00000000
 /*       SIST ENDRET 24/01-96 13.16.00 AV   JDA0310                  */00000010
 /*       SIST ENDRET 12/10-95 14.07.42 AV   JDA0310                  */00000020
 /*       SIST ENDRET 01/11-94 08.56.30 AV   HLB0310                  */00000030
 /*       SIST ENDRET 15/03-94 13.55.16 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 25/02-94 14.01.30 AV   HERMAN                   */00000050
 /*       SIST ENDRET 25/02-94 13.00.44 AV   HERMAN                   */00000060
 /*       SIST ENDRET 29/03-93 09.04.17 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 26/03-93 10.20.19 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 26/04-91 12.37.01 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 16/10-89 13.02.14 AV   DYBVIK                   */00000100
                                                                        00000110
 R001048:                                                               00000120
   PROC (COMMAREA_PEKER) OPTIONS(MAIN);                                 00000130
                                                                        00000140
 /* ***************************************************************** */00000150
 /*                                                                   */00000160
 /*  PROGRAMMET ER MED I STYRINGEN AV MENYEN VED VENTETRANSBEHANDLING.*/00000170
 /*                                                                   */00000180
 /*  PROGRAMMET LESER INN DATA FRA VENTETRANSBILDET.                  */00000190
 /*                                                                   */00000200
 /*  PROGRAMMETS TRANSKODER ER R048,R48A,R48B.                        */00000210
 /*                                                                   */00000220
 /*  PROGRAMMERER ROLF FARVIK, MAI 1983.                              */00000230
 /*                                                                   */00000240
 /* ***************************************************************** */00000250
 /*                                                                   */00000260
 /*ENDRET: 14.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000270
 /*ENDRET: 13.10.89 AV TRUDE FOR UNGE-UFØRE-FØR 1967                  */00000280
 /* ******                                                            */00000290
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000300
 /*    OM FNR ER ENDRET (R0019906).                                   */00000310
 /* ***************************************************************** */00000320
 %PAGE;                                                                 00000330
      %INCLUDE S00101  ;   /*  BL.MAPSETTENE   (BASED) */               00000340
                                                                        00000350
 %PAGE;                                                                 00000360
      %INCLUDE S001V1;     /*  VENTEMAPSET1    (BASED) */               00000370
                                                                        00000380
 %PAGE;                                                                 00000390
      %INCLUDE S001V2;     /*  VENTEMAPSET2    (BASED) */               00000400
                                                                        00000410
 %PAGE;                                                                 00000420
      %INCLUDE S001V3;     /*  VENTEMAPSET3    (BASED) */               00000430
 %PAGE;                                                                 00000440
      %INCLUDE P0012001;   /*  TRANS_SEGM_OMR  (BASED) */               00000450
                                                                        00000460
 %PAGE;                                                                 00000470
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */            00000480
 %PAGE;                                                                 00000490
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                    00000500
 %PAGE;                                                                 00000510
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */               00000520
 %PAGE;                                                                 00000530
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */              00000540
 %PAGE;                                                                 00000550
      %INCLUDE P0019959;   /*  OMRAADE FOR FUNKTAB      */              00000560
 %PAGE;                                                                 00000570
      %INCLUDE P0019924;    /*  G_V_TAB                  */             00000580
      %INCLUDE P0019925;    /*  G_TAB                    */             00000590
 %PRINT;                                                                00000600
   DCL                                                                  00000610
       MAP_MELDING              CHAR(78)      INIT((78)' '),            00000620
       1  FEIL_STRUC,                                                   00000630
          2  FEIL_NR               FIXED DEC(5),                        00000640
          2  FEIL_MELDING          CHAR     (78),                       00000650
          2  KOM_OMR_PEKER         POINTER;                             00000660
    %PAGE;                                                              00000670
    /* ************************************************************** */00000680
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00000690
    /* ************************************************************** */00000700
                                                                        00000710
       DCL PLIXOPT CHAR(27) VAR STATIC EXTERNAL                         00000720
                                           INIT('NOSTAE NOSPIE');       00000730
       DCL                                                              00000740
         ( ONCODE,ADDR,CSTG,LOW,STG,SUBSTR,VERIFY,NULL)  BUILTIN;       00000750
       DCL                                                              00000760
         PLITDLI ENTRY,                                                 00000770
              BMSMAPBR  PTR;                                            00000780
                                                                        00000790
    /* ************************************************************** */00000800
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000810
    /* ************************************************************** */00000820
                                                                        00000830
    %INCLUDE DLIUIB;                                                    00000840
                                                                        00000850
       DCL                                                              00000860
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00000870
                                                                        00000880
       DCL                                                              00000890
         ( COMMAREA_PEKER , W01_HJELPE_PEKER , TRANS_SEGM_PEKER )       00000900
                                                             POINTER,   00000910
           ONKODE                PIC'9999',                             00000920
                                                                        00000930
           CURSOR_POS      FIXED BIN(15) INIT(-1),                      00000940
                                                                        00000950
           ONK             DEF ONKODE CHAR(4),                          00000960
                                                                        00000970
           FEILKODE              CHAR(4),                               00000980
                                                                        00000990
           DSNAVN                CHAR(8);                               00001000
                                                                        00001010
       DCL LINJENR               PIC '(2)9';                            00001020
                                                                        00001030
       DCL ANTALL_LEST           FIXED DEC (3);                         00001040
                                                                        00001050
       DCL W_REGDATO             PIC '(6)9';                            00001060
                                                                        00001070
       DCL W_REGDATO_CHAR        CHAR(6);                               00001080
                                                                        00001090
       DCL W_REGDATO_NUM DEF W_REGDATO_CHAR POS(1) PIC '(6)9';          00001100
                                                                        00001110
       DCL MAP_OMR               CHAR(1500) BASED (BMSMAPBR);           00001120
                                                                        00001130
       DCL BEH_KODE              CHAR (1);                              00001140
                                                                        00001150
    /* DCL W01_IDENT             CHAR (4); */                           00001160
   DCL 01 W01_IDENT_DEF,                                                00001170
          02 W01_IDENT_1_4                  CHAR (4),                   00001180
          02 W01_IDENT_5                    CHAR (1),                   00001190
       01 W01_IDENT DEF W01_IDENT_DEF      CHAR(05) ;                   00001200
                                                                        00001210
                                                                        00001220
                                                                        00001230
       DCL IDENT_PEKER           POINTER ;                              00001240
                                                                        00001250
       DCL IDENT_BIT             BIT  (32) BASED (IDENT_PEKER);         00001260
                                                                        00001270
       DCL CICSINFO              CHAR (16);                             00001280
                                                                        00001290
       DCL FATAL_FEIL            CHAR (1) INIT ('S');                   00001300
                                                                        00001310
       DCL W_BLTYPE              CHAR (2);                              00001320
                                                                        00001330
       DCL TRANS_KODE_VED_START  CHAR (4);                              00001340
                                                                        00001350
       DCL PIC_4                 PIC '(4)9';                            00001360
                                                                        00001370
       DCL PIC_6                 PIC '(6)9';                            00001380
                                                                        00001390
       DCL PIC_11                PIC '(11)9';                           00001400
                                                                        00001410
       DCL GRUNN_OMR1            CHAR      (1202);                      00001420
       DCL GRUNN_OMR2            CHAR      (1202);                      00001430
       DCL GRUNN_IDENT           CHAR      ( 8);                        00001440
                                                                        00001450
       DCL 1 FNR_REG,                                                   00001460
             2 FNR1              FIXED DEC(11),                         00001470
             2 FNR2              FIXED DEC(11),                         00001480
             2 BRUKERID          CHAR     ( 4);                         00001490
                                                                        00001500
    /* ************************************************************** */00001510
    /*   OPPTELINGS- OG LOOP-PARAMETRE M.M                            */00001520
    /* ************************************************************** */00001530
                                                                        00001540
       DCL 1  W01                       UNALIGNED,                      00001550
              2   MER_DATA                    BIT  (1)   INIT ('1'B),   00001560
              2   BARN_IKKE_LEST              BIT  (1)   INIT ('1'B),   00001570
              2   FEILMELDING_SATT            BIT  (1)   INIT ('0'B),   00001580
              2   PERSON_IKKE_FUNNET          BIT  (1)   INIT ('1'B),   00001590
 /*YS*/       2   TO_GRUNNBYP_LEST            BIT  (1)   INIT ('0'B),   00001600
 /*YS*/       2   GRUNNBYP_IKKE_LEST          BIT  (1)   INIT ('1'B),   00001610
              2   NAVN                        CHAR (25)  INIT ((25)' '),00001620
              2   VIRK_DATO_ÅM                PIC '9999' INIT ( 0  ),   00001630
              2   I                    FIXED  BIN  (15)  INIT (1),      00001640
              2   J                    FIXED  BIN  (15)  INIT (1);      00001650
                                                                        00001660
    /* ************************************************************** */00001670
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00001680
    /* ************************************************************** */00001690
                                                                        00001700
       DCL 1  W01_DLI_PARAM,                                            00001710
              2   W02_GET                 CHAR (4)   INIT ('    '),     00001720
              2   W02_GHU                 CHAR (4)   INIT('GHU '),      00001730
              2   W02_DLET                CHAR (4)   INIT('DLET'),      00001740
              2   W02_GU                  CHAR (4)   INIT ('GU  '),     00001750
              2   W02_GN                  CHAR (4)   INIT ('GN  '),     00001760
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),     00001770
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00001780
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00001790
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),          00001800
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');  00001810
                                                                        00001820
       DCL    W01_IO                CHAR (280)       INIT ( (280) ' ' ),00001830
              W01_HJELPE_IO         CHAR (280) BASED (W01_HJELPE_PEKER);00001840
                                                                        00001850
    /* ************************************************************** */00001860
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00001870
    /* ************************************************************** */00001880
                                                                        00001890
       DCL    SSA_UQUAL_ROT      UNALIGNED    CHAR (9) INIT             00001900
                                                      ('VT0PERSN ');    00001910
                                                                        00001920
  /*   DCL 1  SSA_UQUAL_TRANHIST   UNALIGNED    CHAR (9) INIT           00001930
                                                      ('TRANHIST ');    00001940
  */                                                                    00001950
                                                                        00001960
       DCL 1  SSA1_TRANHIST_CMD               ,                         00001970
              2    HDEL                       CHAR (17)  INIT           00001980
                                                ('TRANHIST(GRBLKODE'),  00001990
              2    REL_OP_1                   CHAR (2)   INIT ('^='),   00002000
              2    GRBLKODE                   CHAR (2)   INIT ('US'),   00002010
              2    HP                         CHAR (1)   INIT (')');    00002020
                                                                        00002030
                                                                        00002040
                                                                        00002050
       DCL 1  SSA1_VT0PERSN          UNALIGNED,                         00002060
              2    HDEL                       CHAR (17)  INIT           00002070
                   ('VT0PERSN(FNR     '),                               00002080
              2    REL_OP                     CHAR (2)   INIT (' ='),   00002090
              2    PKEY               FIXED   DEC  (11),                00002100
              2    HP                         CHAR (1)   INIT (')');    00002110
                                                                        00002120
       DCL 1  SSA1_TRANHIST          UNALIGNED,                         00002130
              2    HDEL                       CHAR (19)  INIT           00002140
                                               ('TRANHIST*P(REGDATO '), 00002150
              2    REL_OP                     CHAR (2)   INIT (' <'),   00002160
              2    REGDATO           FIXED    DEC  (6)   INIT (999999), 00002170
              2    HP                         CHAR (1)   INIT (')');    00002180
                                                                        00002190
       DCL 1  SSA3_TRANHIST          UNALIGNED,                         00002200
              2    HDEL                       CHAR (17) INIT            00002210
                                                ('TRANHIST(VTPBLKOD'),  00002220
              2    REL_OP                     CHAR (2)  INIT (' ='),    00002230
              2    VTP_KEY            FIXED   DEC  (4)  INIT ( 0 ),     00002240
              2    BLTYPE                     CHAR (2)  INIT ('  '),    00002250
              2    HP                         CHAR (1)  INIT (')');     00002260
                                                                        00002270
                                                                        00002280
    /* ************************************************************** */00002290
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00002300
    /* ************************************************************** */00002310
                                                                        00002320
    %PAGE;                                                              00002330
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00002340
    %PAGE;                                                              00002350
                                                                        00002360
       DCL 1  B01              BASED (B01_PEKER),                       00002370
    %INCLUDE P0019921;                         /* B01_OMR (BASED)     */00002380
                                                                        00002390
                                                                        00002400
    %PAGE;                                                              00002410
       DCL 1  B02              BASED (B02_PEKER),                       00002420
    %INCLUDE P0019921;                         /* B02_OMR (BASED)     */00002430
                                                                        00002440
    %PAGE;                                                              00002450
       DCL 1  VT1              BASED (VT1_PCB_PEKER),                   00002460
    %INCLUDE P0012003;                         /* PCB                 */00002470
                                                                        00002480
                                                                        00002490
                                                                        00002500
    /* ************************************************************** */00002510
    /*                                                                */00002520
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00002530
    /*     ---------------------------------------------------        */00002540
    /*                                                                */00002550
    /*                                                                */00002560
    /*      INITIERING AV PARAMETRE TIL DIV OMR.     .                */00002570
    /*                                                                */00002580
    /*                                                                */00002590
    /* ************************************************************** */00002600
                                                                        00002610
 /*ON ERROR SNAP BEGIN       ;                                          00002620
      ON ERROR SYSTEM        ;                                          00002630
      ONKODE=ONCODE          ;                                          00002640
      FEILKODE   = ONK       ;                                          00002650
      DSNAVN     = EIBDS     ;                                          00002660
      GO TO FEILBEH          ;                                          00002670
   END;*/                                                               00002680
                                                                        00002690
    EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                          00002700
                                                                        00002710
                                                                        00002720
  ALLOCATE  TRANS_SEGM_OMR;                                             00002730
  ALLOCATE GV_TAB_RE ;                                                  00002740
  ALLOCATE G_TAB_RE  ;                                                  00002750
  ALLOCATE B01, B02  ;                                                  00002760
                                                                        00002770
  TRANS_SEGM_OMR                        = ''                           ;00002780
  TRANS_KODE_VED_START                  = TRANS_OPPL_OMR.TRANSKODE;     00002790
  KOM_OMR.PEKER_LISTE.STYRINGS_PEKER    = ADDR(KOM_OMR.STYRINGS_OMR)   ;00002800
  KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER  = ADDR(KOM_OMR.TRANS_OPPL_OMR) ;00002810
  KOM_OMR.PEKER_LISTE.TRANS_PEKER       = ADDR(KOM_OMR.TRANS_OMR)      ;00002820
  KOM_OMR.PEKER_LISTE.TRANS_LISTE_PEKER = ADDR(KOM_OMR.TRANS_LISTE_OMR);00002830
  KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER   = ADDR(KOM_OMR.DIV_PARAM_OMR)  ;00002840
  KOM_OMR.GV_PEKER                      = ADDR (GRUNN_OMR1           ) ;00002850
  KOM_OMR.G_PEKER                       = ADDR (GRUNN_OMR2           ) ;00002860
                                                                        00002870
                                                                        00002880
  PROGRAM_ID        = 'R0010480'                   ;                    00002890
  DB_STATUS_KODE    = '  '                         ;                    00002900
  ANTALL_LEST       = 0                            ;                    00002910
  FEIL_MELD_NR      = 0                            ;                    00002920
  GV_TAB_RE         =  ''                          ;                    00002930
  G_TAB_RE          =  ''                          ;                    00002940
  B01               =  ''                          ;                    00002950
  B02               =  ''                          ;                    00002960
  DIV_PERIODE       =  ''                          ;  /*HL*/            00002970
                                                                        00002980
    GRUNN_IDENT                     = 'P0019924';                       00002990
                                                                        00003000
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                      00003010
                                                                        00003020
    GRUNN_IDENT                     = 'P0019925';                       00003030
                                                                        00003040
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                      00003050
                                                                        00003060
    FNR_REG.BRUKERID  =  DIV_PARAM_OMR.CICS_IND;                        00003070
 /* CICSINFO          =  F_CICSINFO(DIV_PARAM_OMR.CICS_IND) ; */        00003080
                                                                        00003090
   IF SUBSTR(CICS_NAVN,1,4) = 'HELP'  THEN                              00003100
            SSA1_TRANHIST_CMD.REL_OP_1 = ' =' ;                         00003110
                                                                        00003120
                                                                        00003130
  /**********    H O V E D S T Y R I N G   S T A R T   *************/   00003140
                                                                        00003150
  IF TRANSKODE = 'R048' THEN                                            00003160
                                                                        00003170
     /***  LESER INN DATA FRA VENTEMENYBILDET.   *************/         00003180
                                                                        00003190
     DO;                                                                00003200
        EXEC CICS RECEIVE MAP('S001481') MAPSET ('S001V13')             00003210
                                                        SET(BMSMAPBR);  00003220
        B02.STATUS.VIRK_DATO_ÅM(13) = 0;                                00003230
        B02.STATUS.DØDSDATO_ÅMD(13) = 0;                                00003240
     END;                                                               00003250
  ELSE                                                                  00003260
     IF TRANSKODE = 'R48A' THEN                                         00003270
        DO;                                                             00003280
           ALLOCATE S001481O;                                           00003290
           ALLOCATE S001481I;                                           00003300
           EXEC CICS LOAD PROGRAM('S001V13');                           00003310
           S001481O.CICS_INFOO = CICS_NAVN;                             00003320
                                                                        00003330
           IF B02.STATUS.DØDSDATO_ÅMD(13) > 0 THEN                      00003340
              DO;                                                       00003350
                 S001481O.REGDATOO  =                                   00003360
                            F_SNU_DØDSDATO(B02.STATUS.DØDSDATO_ÅMD(13));00003370
                 S001481I.REGDATOI  = S001481O.REGDATOO;                00003380
                 S001481I.REGDATOL  = 1;                                00003390
              END;                                                      00003400
           ELSE                                                         00003410
              DO;                                                       00003420
                 S001481O.VIRKDATOO =                                   00003430
                                F_SNU_DATO(B02.STATUS.VIRK_DATO_ÅM(13));00003440
                 S001481I.VIRKDATOI = S001481O.VIRKDATOO               ;00003450
                 S001481I.BLTYPEI   = TRANS_OPPL_OMR.BLANKETTYPE       ;00003460
                 S001481I.VIRKDATOL = 1;                                00003470
              END;                                                      00003480
        END;                                                            00003490
     ELSE                                                               00003500
        IF TRANSKODE = 'R48B' THEN                                      00003510
           DO;                                                          00003520
              ALLOCATE S001481O;                                        00003530
              ALLOCATE S001481I;                                        00003540
              EXEC CICS LOAD PROGRAM('S001V13');                        00003550
              S001481O.CICS_INFOO = CICS_NAVN;                          00003560
              S001481O.FNRO     = FØDSNUMMER;                           00003570
              S001481I.FNRI     = S001481O.FNRO;                        00003580
              S001481I.FNRL     = 1;                                    00003590
           END;                                                         00003600
                                                                        00003610
                                                                        00003620
  IF S001481I.RETURL > 0 THEN                                           00003630
     DO;                                                                00003640
        FUNKSJONSKODE = S001481I.RETURI;                                00003650
        CALL OVER_OG_UT(FUNKSJONSKODE);                                 00003660
     END;                                                               00003670
                                                                        00003680
  FEILMELDING_SATT = '1'B;                                              00003690
  W01.MER_DATA     = '1'B;                                              00003700
                                                                        00003710
  IF S001481I.FNRL > 0 THEN                                             00003720
     DO;                                                                00003730
        CALL FNR_BEHANDLING;                                            00003740
                                                                        00003750
        IF FEIL_MELD_NR > 0 !                                           00003760
           FEILMELDING_SATT THEN                                        00003770
           DO;                                                          00003780
                                                                        00003790
              CALL DATABASE('CLOSE');   /* ENDRET 16.5.88 BRITT */      00003800
                                        /* PGA. CICS 1.7  */            00003810
              GO TO L999;                                               00003820
           END;                                                         00003830
                                                                        00003840
                                                                        00003850
        /***  BYGGER OPP NØKKEL FOR BASELESING.  ***/                   00003860
                                                                        00003870
                                                                        00003880
        TRANS_OPPL_OMR.FØDSNUMMER      = SSA1_VT0PERSN.PKEY;            00003890
        TRANS_OPPL_OMR.VIRKNINGSDATO   = F_SNU_DATO(9999 -              00003900
                                               SSA3_TRANHIST.VTP_KEY);  00003910
        TRANS_OPPL_OMR.BLANKETTYPE     = W_BLTYPE;                      00003920
        SSA3_TRANHIST.BLTYPE           = W_BLTYPE;                      00003930
     END;                                                               00003940
                                                                        00003950
  ELSE                                                                  00003960
     IF S001481I.REGDATOL > 0 THEN                                      00003970
        DO;                                                             00003980
           CALL REGDATO_BEHANDLING;                                     00003990
                                                                        00004000
           IF FEIL_MELD_NR > 0 !                                        00004010
              FEILMELDING_SATT THEN                                     00004020
           DO;                                                          00004030
                                                                        00004040
              GO TO L999;                                               00004050
           END;                                                         00004060
                                                                        00004070
                                                                        00004080
           TRANSKODE  = 'R48B'    ;                                     00004090
           FØDSNUMMER = SEARCH_FNR;                                     00004100
                                                                        00004110
           GO TO L999;                                                  00004120
        END;                                                            00004130
                                                                        00004140
     ELSE                                                               00004150
        IF S001481I.VIRKDATOL > 0 THEN                                  00004160
           DO;                                                          00004170
              CALL VIRKDATO_BEHANDLING;                                 00004180
                                                                        00004190
              IF FEIL_MELD_NR > 0 !                                     00004200
                 FEILMELDING_SATT THEN                                  00004210
           DO;                                                          00004220
                                                                        00004230
              GO TO L999;                                               00004240
           END;                                                         00004250
                                                                        00004260
                                                                        00004270
              TRANSKODE  = 'R48B';                                      00004280
              FØDSNUMMER = SEARCH_FNR;                                  00004290
                                                                        00004300
              GO TO L999;                                               00004310
           END;                                                         00004320
        ELSE                                                            00004330
           DO;                                                          00004340
              MAP_MELDING        = 'EN AV FELTENE MÅ UTFYLLES';         00004350
              FEILMELDING_SATT   = '1'B;                                00004360
              S001481I.FNRL      = -1;       /* CURSOR POS */           00004370
              S001481O.MELDINGO    = MAP_MELDING;                       00004380
              S001481O.CICS_INFOO  = CICS_NAVN;                         00004390
              EXEC CICS SEND MAP('S001481')                             00004400
                             MAPSET('S001V13') CURSOR ERASE;            00004410
              GO TO L999;                                               00004420
           END;                                                         00004430
                                                                        00004440
                                                                        00004450
                                                                        00004460
  /***  ÅPNER VT_BASEN,HVIS DEN ER LUKKET.        *********/            00004470
                                                                        00004480
                                                                        00004490
  IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                                 00004500
     DO;                                                                00004510
      CALL DATABASE('OPEN');                                            00004520
     END;                                                               00004530
  ELSE                                                                  00004540
     DO;                                                                00004550
      UIBPTR     = PCB_UIB_PEKER_OMR.UIB_PEKER;                         00004560
     END;                                                               00004570
                                                                        00004580
  IF FEIL_MELD_NR > 0   THEN                                            00004590
           DO;                                                          00004600
                                                                        00004610
              GO TO L999;                                               00004620
           END;                                                         00004630
                                                                        00004640
  /***  FLYTTER BASEOPPLYSNINGER OVER                                   00004650
                                  I BLANKETT-OMR.            ***/       00004660
                                                                        00004670
  CALL  FLYTT_BASEDATA_TIL_BILDE_OMR;                                   00004680
                                                                        00004690
                                                                        00004700
  IF FEIL_MELD_NR > 0 THEN                                              00004710
           DO;                                                          00004720
                                                                        00004730
              GO TO L999;                                               00004740
           END;                                                         00004750
                                                                        00004760
                                                                        00004770
                                                                        00004780
  /*** LUKKER VT_BASEN                            *********/            00004790
                                                                        00004800
  CALL DATABASE('CLOSE');                                               00004810
                                                                        00004820
  IF FEIL_MELD_NR > 0   THEN                                            00004830
           DO;                                                          00004840
                                                                        00004850
              GO TO L999;                                               00004860
           END;                                                         00004870
                                                                        00004880
                                                                        00004890
  CALL VELG_BEHANDLINGSKODE;                                            00004900
                                                                        00004910
                                                                        00004920
                                                                        00004930
 L999:                                                                  00004940
                                                                        00004950
  IF FEIL_MELD_NR > 0 THEN                                              00004960
     DO;                                                                00004970
                                                                        00004980
       GO TO FEILBEH;                                                   00004990
     END;                                                               00005000
                                                                        00005010
                                                                        00005020
                                                                        00005030
  EXEC CICS XCTL PROGRAM('R0010480')                                    00005040
                                       COMMAREA(KOM_OMR);               00005050
                                                                        00005060
                                                                        00005070
                                                                        00005080
  /**********    H O V E D S T Y R I N G   S L U T T   *************/   00005090
                                                                        00005100
                                                                        00005110
  FNR_BEHANDLING:                                                       00005120
     PROC;                                                              00005130
                                                                        00005140
  /* **************************************************************** */00005150
  /*HENSIKT:                                                          */00005160
  /*    BYGGER OPP SKJÆRMBILDE FOR ØNSKET FØDSELSNUMMER.              */00005170
  /*                                                                  */00005180
  /*                                                                  */00005190
  /*BRUK:                                                             */00005200
  /*    CALL FNR_BEHANDLING;                                          */00005210
  /*                                                                  */00005220
  /* **************************************************************** */00005230
                                                                        00005240
   FEILMELDING_SATT = '1'B;                                             00005250
                                                                        00005260
   DO UNTIL (^FEILMELDING_SATT);                                        00005270
      FEILMELDING_SATT = '0'B;                                          00005280
                                                                        00005290
      CALL SJEKK_FNR;                                                   00005300
                                                                        00005310
   END;                                                                 00005320
                                                                        00005330
   SSA1_VT0PERSN.PKEY = PIC_11;                                         00005340
                                                                        00005350
   ALLOCATE S001482O;                                                   00005360
   EXEC CICS LOAD PROGRAM('S001V23');                                   00005370
   S001482O.CICS_INFOO = CICS_NAVN;                                     00005380
                                                                        00005390
   /***  LESER ALLE FOREKOMSTENE I VT-BASEN   *********/                00005400
   /***  MED ØNSKET FØDSELSNUMMER.            *********/                00005410
                                                                        00005420
   LINJENR     = 0;                                                     00005430
   ANTALL_LEST = 0;                                                     00005440
                                                                        00005450
                                                                        00005460
  /***  ÅPNER VT_BASEN                            *********/            00005470
                                                                        00005480
                                                                        00005490
   IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                                00005500
       CALL DATABASE('OPEN');                                           00005510
   ELSE                                                                 00005520
       UIBPTR     = PCB_UIB_PEKER_OMR.UIB_PEKER;                        00005530
                                                                        00005540
                                                                        00005550
   IF FEIL_MELD_NR > 0   THEN                                           00005560
           DO;                                                          00005570
                                                                        00005580
              GO TO L999;                                               00005590
           END;                                                         00005600
                                                                        00005610
                                                                        00005620
   DO WHILE (LINJENR = 0);                                              00005630
                                                                        00005640
                                                                        00005650
      CALL BYGG_VENTEBILDE_OPPL_FNR;                                    00005660
                                                                        00005670
      IF FEIL_MELD_NR > 0 THEN                                          00005680
           DO;                                                          00005690
                                                                        00005700
              GO TO RETUR;                                              00005710
           END;                                                         00005720
      ELSE                                                              00005730
         IF FEILMELDING_SATT   THEN                                     00005740
           DO;                                                          00005750
                                                                        00005760
              GO TO RETUR;                                              00005770
           END;                                                         00005780
                                                                        00005790
      IF LINJENR > 0 THEN                                               00005800
         DO;                                                            00005810
            /*** LUKKER VT_BASEN                            *********/  00005820
                                                                        00005830
            CALL DATABASE('CLOSE');                                     00005840
                                                                        00005850
            IF FEIL_MELD_NR > 0   THEN                                  00005860
           DO;                                                          00005870
                                                                        00005880
              GO TO L999;                                               00005890
           END;                                                         00005900
         END;                                                           00005910
                                                                        00005920
                                                                        00005930
      /***  SKRIVER UT VENTETRANSBILDET MED  DATA.**/                   00005940
                                                                        00005950
      S001482I.FNRL      = 0 ; /* CURSOR POS NULLES*/                   00005960
      S001482I.LINJENRL  = -1; /* CURSOR POS */                         00005970
                                                                        00005980
      EXEC CICS SEND MAP('S001482')                                     00005990
                               MAPSET('S001V23')  CURSOR ERASE;         00006000
                                                                        00006010
      CALL SSA_BEHANDLING;                                              00006020
                                                                        00006030
   END;                                                                 00006040
  RETUR:                                                                00006050
                                                                        00006060
                                                                        00006070
                                                                        00006080
  END FNR_BEHANDLING;                                                   00006090
                                                                        00006100
                                                                        00006110
                                                                        00006120
 SJEKK_FNR:                                                             00006130
   PROC;                                                                00006140
     IF ^F_NUMERISK(S001481I.FNRI) THEN                                 00006150
        DO;                                                             00006160
           MAP_MELDING = 'TEGN SOM IKKE ER NUMERISK I FØDSELSNUMMER';   00006170
           FEILMELDING_SATT   = '1'B;                                   00006180
           S001481I.FNRL      = -1; /* CURSOR POS       */              00006190
           S001481O.MELDINGO  = MAP_MELDING;                            00006200
           S001481O.CICS_INFOO  = CICS_NAVN;                            00006210
                                                                        00006220
           EXEC CICS SEND MAP('S001481')                                00006230
                                     MAPSET('S001V13')ERASE CURSOR;     00006240
                                                                        00006250
           /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/    00006260
                                                                        00006270
           EXEC CICS RECEIVE MAP('S001481') MAPSET ('S001V13')          00006280
                                                        SET(BMSMAPBR);  00006290
           IF S001481I.RETURL > 0 THEN                                  00006300
              DO;                                                       00006310
                 FUNKSJONSKODE = S001481I.RETURI;                       00006320
                                                                        00006330
                 CALL OVER_OG_UT(FUNKSJONSKODE);                        00006340
                                                                        00006350
              END;                                                      00006360
           GO TO RETUR;                                                 00006370
        END;                                                            00006380
                                                                        00006390
     ELSE                                                               00006400
        IF ^F_GYLDIG_FNR(S001481O.FNRO) THEN  /* FNRO ER PIC'(11)9' */  00006410
           DO;                                                          00006420
              MAP_MELDING = 'UGYLDIG FØDSELSNUMMER';                    00006430
              FEILMELDING_SATT   = '1'B;                                00006440
              S001481I.FNRL      = -1; /* CURSOR POS       */           00006450
              S001481O.FNRO      = S001481I.FNRI;                       00006460
              S001481O.MELDINGO  = MAP_MELDING;                         00006470
              S001481O.CICS_INFOO = CICS_NAVN ;                         00006480
                                                                        00006490
              EXEC CICS SEND MAP('S001481')                             00006500
                                     MAPSET('S001V13')ERASE CURSOR;     00006510
                                                                        00006520
              /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/ 00006530
                                                                        00006540
              EXEC CICS RECEIVE MAP('S001481') MAPSET ('S001V13')       00006550
                                                        SET(BMSMAPBR);  00006560
              IF S001481I.RETURL > 0 THEN                               00006570
                 DO;                                                    00006580
                    FUNKSJONSKODE = S001481I.RETURI;                    00006590
                                                                        00006600
                    CALL OVER_OG_UT(FUNKSJONSKODE);                     00006610
                                                                        00006620
                 END;                                                   00006630
              GO TO RETUR;                                              00006640
           END;                                                         00006650
                                                                        00006660
     ELSE                                                               00006670
        DO;                                                             00006680
           FNR_REG.FNR1 = S001481O.FNRO;                                00006690
                                                                        00006700
           EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);        00006710
                                                                        00006720
           IF FNR_REG.FNR2 > 0 THEN                                     00006730
              DO;                                                       00006740
                 MAP_MELDING = S001481I.FNRI !!                         00006750
                           ' ER ET FØDSELSNUMMER SOM ER ENDRET' !!      00006760
                                                       ' TRYKK ENTER!'; 00006770
                 S001481O.FNRO      = FNR_REG.FNR2;                     00006780
                 S001481O.MELDINGO  = MAP_MELDING;                      00006790
                 S001481O.CICS_INFOO = CICS_NAVN ;                      00006800
                                                                        00006810
                 EXEC CICS SEND MAP('S001481') MAPSET('S001V13')ERASE;  00006820
                                                                        00006830
                 GO TO RETUR;                                           00006840
              END;                                                      00006850
           ELSE                                                         00006860
              DO;                                                       00006870
                 SEARCH_FNR = S001481O.FNRO;                            00006880
                 PIC_11     = SEARCH_FNR;                               00006890
                 IF F_KJØNN(PIC_11) = 'K' THEN                          00006900
                    SØKER_IND = 1;                                      00006910
                 ELSE                                                   00006920
                    SØKER_IND = 2;                                      00006930
              END;                                                      00006940
       END;                                                             00006950
 RETUR:                                                                 00006960
 END SJEKK_FNR;                                                         00006970
                                                                        00006980
                                                                        00006990
                                                                        00007000
 BYGG_VENTEBILDE_OPPL_FNR:                                              00007010
   PROC;                                                                00007020
                                                                        00007030
    IF ANTALL_LEST  < 15 THEN                                           00007040
       DO;                                                              00007050
          W02_GET      = W02_GU;                                        00007060
          CALL P005_LES_ROT_QUAL;                                       00007070
                                                                        00007080
          IF W01.MER_DATA THEN                                          00007090
             DO;                                                        00007100
                                                                        00007110
                SUBSTR (ADDR            (B02.RF0PERSN (14))             00007120
                  ->  W01_HJELPE_IO,1,STG (B02.RF0PERSN (14))) = W01_IO;00007130
                                                                        00007140
                S001482O.FNRO            = PIC_11;                      00007150
                S001482O.NAVNO           = B02.RF0PERSN (14).NAVN;      00007160
                S001482O.TKNRO           = B02.RF0PERSN (14).TKNR;      00007170
                S001482O.SPRÅKO          = B02.RF0PERSN (14).SPRÅK;     00007180
                S001482O.FUNKSJONSKODEO  = ' ';                         00007190
                S001482O.DUMMYO          = ' ';                         00007200
                S001482O.CICS_INFOO      = CICS_NAVN;                   00007210
             END;                                                       00007220
          ANTALL_LEST  = 1;                                             00007230
       END;                                                             00007240
    ELSE                                                                00007250
       DO;                                                              00007260
          ANTALL_LEST  = 1;                                             00007270
                                                                        00007280
          CALL FLYTT_BASEOPPL_TIL_BL_OMR_FNR;                           00007290
                                                                        00007300
          ANTALL_LEST  = ANTALL_LEST + 1;                               00007310
       END;                                                             00007320
                                                                        00007330
    DO WHILE(W01.MER_DATA &                                             00007340
                           ANTALL_LEST < 15);                           00007350
                                                                        00007360
                                                                        00007370
       /*******    LES VENTE_BASE   *********/                          00007380
                                                                        00007390
       CALL P020_LES_NESTE_TRANHIST;                                    00007400
                                                                        00007410
       IF W01.MER_DATA     THEN                                         00007420
          DO;                                                           00007430
             SUBSTR (ADDR                (TRANHIST)                     00007440
                     ->  W01_HJELPE_IO,1,STG (TRANHIST)) =  W01_IO;     00007450
                                                                        00007460
             CALL FLYTT_BASEOPPL_TIL_BL_OMR_FNR;                        00007470
                                                                        00007480
                                                                        00007490
             ANTALL_LEST = ANTALL_LEST + 1;                             00007500
          END;                                                          00007510
    END;                                                                00007520
                                                                        00007530
    IF    ANTALL_LEST > 14 THEN                                         00007540
          DO;                                                           00007550
             /*******    LES VENTE_BASE   *********/                    00007560
                                                                        00007570
             CALL P020_LES_NESTE_TRANHIST;                              00007580
                                                                        00007590
             IF W01.MER_DATA     THEN                                   00007600
                DO;                                                     00007610
                   SUBSTR (ADDR                (TRANHIST)               00007620
                          ->  W01_HJELPE_IO,1,STG (TRANHIST)) =  W01_IO;00007630
                   MAP_MELDING =                                        00007640
            'FLERE EN 14 TRANSAKSJONER.TRYKK ENTER ELLER VELG LINJENR.';00007650
                                                                        00007660
                   S001482O.MELDING6O = MAP_MELDING;                    00007670
                                                                        00007680
                END;                                                    00007690
             ELSE                                                       00007700
                ANTALL_LEST = 14;                                       00007710
          END;                                                          00007720
                                                                        00007730
    IF    ^W01.MER_DATA & FEIL_MELD_NR = 0 &                            00007740
                          ANTALL_LEST = 1 THEN                          00007750
          DO;                                                           00007760
             FEILMELDING_SATT   = '1'B;                                 00007770
             IF B02.STATUS.VIRK_DATO_ÅM(13) > 0 !                       00007780
                B02.STATUS.DØDSDATO_ÅMD(13) > 0 THEN                    00007790
                TRANSKODE = 'R48A';                                     00007800
             ELSE                                                       00007810
                DO;                                                     00007820
                   MAP_MELDING =                                        00007830
                        'PERSONEN MED FØDSELSNUMMER: ' !! PIC_11 !!     00007840
                                ' HAR IKKE FLERE VENTETRANSAKSJONER ';  00007850
                   ALLOCATE S001481O;                                   00007860
                   ALLOCATE S001481I;                                   00007870
                                                                        00007880
                   EXEC CICS LOAD PROGRAM('S001V13');                   00007890
                                                                        00007900
                   S001481I.FNRL      = -1; /* CURSOR POS       */      00007910
                   S001481O.FNRO      = PIC_11;                         00007920
                   S001481O.MELDINGO  = MAP_MELDING;                    00007930
                   S001481O.CICS_INFOO = CICS_NAVN  ;                   00007940
                                                                        00007950
                                                                        00007960
                   EXEC CICS SEND MAP('S001481')                        00007970
                                      MAPSET('S001V13') CURSOR ERASE;   00007980
                                                                        00007990
                   TRANSKODE = 'R048';                                  00008000
                END;                                                    00008010
          END;                                                          00008020
                                                                        00008030
  END BYGG_VENTEBILDE_OPPL_FNR;                                         00008040
                                                                        00008050
                                                                        00008060
                                                                        00008070
                                                                        00008080
                                                                        00008090
  FLYTT_BASEOPPL_TIL_BL_OMR_FNR:                                        00008100
     PROC;                                                              00008110
     SELECT(ANTALL_LEST);                                               00008120
        WHEN(1)                                                         00008130
            DO;                                                         00008140
               S001482O.RDATO1O = F_SNU_DØDSDATO(                       00008150
                                   TRANHIST.REGDATO_ÅMD);               00008160
               S001482O.BLT1O   = TRANHIST.GRBLKODE;                    00008170
               S001482O.VDATO1O = F_SNU_DATO(TRANHIST.VIRK_DATO_ÅM);    00008180
            END;                                                        00008190
        WHEN(2)                                                         00008200
            DO;                                                         00008210
               S001482O.RDATO2O = F_SNU_DØDSDATO(                       00008220
                                   TRANHIST.REGDATO_ÅMD);               00008230
               S001482O.BLT2O   = TRANHIST.GRBLKODE;                    00008240
               S001482O.VDATO2O = F_SNU_DATO(TRANHIST.VIRK_DATO_ÅM);    00008250
            END;                                                        00008260
        WHEN(3)                                                         00008270
            DO;                                                         00008280
               S001482O.RDATO3O = F_SNU_DØDSDATO(                       00008290
                                   TRANHIST.REGDATO_ÅMD);               00008300
               S001482O.BLT3O   = TRANHIST.GRBLKODE;                    00008310
               S001482O.VDATO3O = F_SNU_DATO(TRANHIST.VIRK_DATO_ÅM);    00008320
            END;                                                        00008330
        WHEN(4)                                                         00008340
            DO;                                                         00008350
               S001482O.RDATO4O = F_SNU_DØDSDATO(                       00008360
                                   TRANHIST.REGDATO_ÅMD);               00008370
               S001482O.BLT4O   = TRANHIST.GRBLKODE;                    00008380
               S001482O.VDATO4O = F_SNU_DATO(TRANHIST.VIRK_DATO_ÅM);    00008390
            END;                                                        00008400
        WHEN(5)                                                         00008410
            DO;                                                         00008420
               S001482O.RDATO5O = F_SNU_DØDSDATO(                       00008430
                                   TRANHIST.REGDATO_ÅMD);               00008440
               S001482O.BLT5O   = TRANHIST.GRBLKODE;                    00008450
               S001482O.VDATO5O = F_SNU_DATO(TRANHIST.VIRK_DATO_ÅM);    00008460
            END;                                                        00008470
        WHEN(6)                                                         00008480
            DO;                                                         00008490
               S001482O.RDATO6O = F_SNU_DØDSDATO(                       00008500
                                   TRANHIST.REGDATO_ÅMD);               00008510
               S001482O.BLT6O   = TRANHIST.GRBLKODE;                    00008520
               S001482O.VDATO6O = F_SNU_DATO(TRANHIST.VIRK_DATO_ÅM);    00008530
            END;                                                        00008540
        WHEN(7)                                                         00008550
            DO;                                                         00008560
               S001482O.RDATO7O = F_SNU_DØDSDATO(                       00008570
                                   TRANHIST.REGDATO_ÅMD);               00008580
               S001482O.BLT7O   = TRANHIST.GRBLKODE;                    00008590
               S001482O.VDATO7O = F_SNU_DATO(TRANHIST.VIRK_DATO_ÅM);    00008600
            END;                                                        00008610
        WHEN(8)                                                         00008620
            DO;                                                         00008630
               S001482O.RDATO8O = F_SNU_DØDSDATO(                       00008640
                                   TRANHIST.REGDATO_ÅMD);               00008650
               S001482O.BLT8O   = TRANHIST.GRBLKODE;                    00008660
               S001482O.VDATO8O = F_SNU_DATO(TRANHIST.VIRK_DATO_ÅM);    00008670
            END;                                                        00008680
        WHEN(9)                                                         00008690
            DO;                                                         00008700
               S001482O.RDATO9O = F_SNU_DØDSDATO(                       00008710
                                   TRANHIST.REGDATO_ÅMD);               00008720
               S001482O.BLT9O   = TRANHIST.GRBLKODE;                    00008730
               S001482O.VDATO9O = F_SNU_DATO(TRANHIST.VIRK_DATO_ÅM);    00008740
            END;                                                        00008750
        WHEN(10)                                                        00008760
            DO;                                                         00008770
               S001482O.RDATO10O = F_SNU_DØDSDATO(                      00008780
                                   TRANHIST.REGDATO_ÅMD);               00008790
               S001482O.BLT10O   = TRANHIST.GRBLKODE;                   00008800
               S001482O.VDATO10O = F_SNU_DATO(TRANHIST.VIRK_DATO_ÅM);   00008810
            END;                                                        00008820
        WHEN(11)                                                        00008830
            DO;                                                         00008840
               S001482O.RDATO11O = F_SNU_DØDSDATO(                      00008850
                                   TRANHIST.REGDATO_ÅMD);               00008860
               S001482O.BLT11O   = TRANHIST.GRBLKODE;                   00008870
               S001482O.VDATO11O = F_SNU_DATO(TRANHIST.VIRK_DATO_ÅM);   00008880
            END;                                                        00008890
        WHEN(12)                                                        00008900
            DO;                                                         00008910
               S001482O.RDATO12O = F_SNU_DØDSDATO(                      00008920
                                   TRANHIST.REGDATO_ÅMD);               00008930
               S001482O.BLT12O   = TRANHIST.GRBLKODE;                   00008940
               S001482O.VDATO12O = F_SNU_DATO(TRANHIST.VIRK_DATO_ÅM);   00008950
            END;                                                        00008960
        WHEN(13)                                                        00008970
            DO;                                                         00008980
               S001482O.RDATO13O = F_SNU_DØDSDATO(                      00008990
                                   TRANHIST.REGDATO_ÅMD);               00009000
               S001482O.BLT13O   = TRANHIST.GRBLKODE;                   00009010
               S001482O.VDATO13O = F_SNU_DATO(TRANHIST.VIRK_DATO_ÅM);   00009020
            END;                                                        00009030
        WHEN(14)                                                        00009040
            DO;                                                         00009050
               S001482O.RDATO14O = F_SNU_DØDSDATO(                      00009060
                                   TRANHIST.REGDATO_ÅMD);               00009070
               S001482O.BLT14O   = TRANHIST.GRBLKODE;                   00009080
               S001482O.VDATO14O = F_SNU_DATO(TRANHIST.VIRK_DATO_ÅM);   00009090
            END;                                                        00009100
        OTHERWISE;                                                      00009110
     END;                                                               00009120
  END FLYTT_BASEOPPL_TIL_BL_OMR_FNR;                                    00009130
                                                                        00009140
                                                                        00009150
                                                                        00009160
                                                                        00009170
  BYGG_SSA_FNR:                                                         00009180
     PROC;                                                              00009190
     SELECT(LINJENR);                                                   00009200
        WHEN(1)                                                         00009210
            DO;                                                         00009220
               SSA1_TRANHIST.REGDATO   =                                00009230
                                         F_SNU_DATO(S001482O.RDATO1O);  00009240
               W_BLTYPE                =                                00009250
                                         S001482O.BLT1O;                00009260
                                                                        00009270
               SSA3_TRANHIST.VTP_KEY   = 9999 - F_SNU_DATO(             00009280
                                                 S001482O.VDATO1O);     00009290
            END;                                                        00009300
        WHEN(2)                                                         00009310
            DO;                                                         00009320
               SSA1_TRANHIST.REGDATO   =                                00009330
                                         F_SNU_DATO(S001482O.RDATO2O);  00009340
               W_BLTYPE                =                                00009350
                                         S001482O.BLT2O;                00009360
                                                                        00009370
               SSA3_TRANHIST.VTP_KEY   = 9999 - F_SNU_DATO(             00009380
                                                 S001482O.VDATO2O);     00009390
            END;                                                        00009400
        WHEN(3)                                                         00009410
            DO;                                                         00009420
               SSA1_TRANHIST.REGDATO   =                                00009430
                                         F_SNU_DATO(S001482O.RDATO3O);  00009440
               W_BLTYPE                =                                00009450
                                         S001482O.BLT3O;                00009460
                                                                        00009470
               SSA3_TRANHIST.VTP_KEY   = 9999 - F_SNU_DATO(             00009480
                                                 S001482O.VDATO3O);     00009490
            END;                                                        00009500
        WHEN(4)                                                         00009510
            DO;                                                         00009520
                SSA1_TRANHIST.REGDATO  =                                00009530
                                         F_SNU_DATO(S001482O.RDATO4O);  00009540
                W_BLTYPE               =                                00009550
                                         S001482O.BLT4O;                00009560
                                                                        00009570
                SSA3_TRANHIST.VTP_KEY  = 9999 - F_SNU_DATO(             00009580
                                                  S001482O.VDATO4O);    00009590
            END;                                                        00009600
        WHEN(5)                                                         00009610
            DO;                                                         00009620
               SSA1_TRANHIST.REGDATO   =                                00009630
                                         F_SNU_DATO(S001482O.RDATO5O);  00009640
               W_BLTYPE                =                                00009650
                                         S001482O.BLT5O;                00009660
                                                                        00009670
               SSA3_TRANHIST.VTP_KEY   = 9999 - F_SNU_DATO(             00009680
                                                 S001482O.VDATO5O);     00009690
            END;                                                        00009700
        WHEN(6)                                                         00009710
            DO;                                                         00009720
               SSA1_TRANHIST.REGDATO   =                                00009730
                                         F_SNU_DATO(S001482O.RDATO6O);  00009740
               W_BLTYPE                =                                00009750
                                         S001482O.BLT6O;                00009760
                                                                        00009770
               SSA3_TRANHIST.VTP_KEY   = 9999 - F_SNU_DATO(             00009780
                                                 S001482O.VDATO6O);     00009790
            END;                                                        00009800
        WHEN(7)                                                         00009810
            DO;                                                         00009820
               SSA1_TRANHIST.REGDATO   =                                00009830
                                         F_SNU_DATO(S001482O.RDATO7O);  00009840
               W_BLTYPE                =                                00009850
                                         S001482O.BLT7O;                00009860
                                                                        00009870
               SSA3_TRANHIST.VTP_KEY   = 9999 - F_SNU_DATO(             00009880
                                                 S001482O.VDATO7O);     00009890
            END;                                                        00009900
        WHEN(8)                                                         00009910
            DO;                                                         00009920
               SSA1_TRANHIST.REGDATO   =                                00009930
                                         F_SNU_DATO(S001482O.RDATO8O);  00009940
               W_BLTYPE                =                                00009950
                                         S001482O.BLT8O;                00009960
                                                                        00009970
               SSA3_TRANHIST.VTP_KEY   = 9999 - F_SNU_DATO(             00009980
                                                 S001482O.VDATO8O);     00009990
            END;                                                        00010000
        WHEN(9)                                                         00010010
            DO;                                                         00010020
               SSA1_TRANHIST.REGDATO   =                                00010030
                                         F_SNU_DATO(S001482O.RDATO9O);  00010040
               W_BLTYPE                =                                00010050
                                         S001482O.BLT9O;                00010060
                                                                        00010070
               SSA3_TRANHIST.VTP_KEY   = 9999 - F_SNU_DATO(             00010080
                                                 S001482O.VDATO9O);     00010090
            END;                                                        00010100
        WHEN(10)                                                        00010110
            DO;                                                         00010120
               SSA1_TRANHIST.REGDATO   =                                00010130
                                         F_SNU_DATO(S001482O.RDATO10O); 00010140
               W_BLTYPE                =                                00010150
                                         S001482O.BLT10O;               00010160
                                                                        00010170
               SSA3_TRANHIST.VTP_KEY   = 9999 - F_SNU_DATO(             00010180
                                                 S001482O.VDATO10O);    00010190
            END;                                                        00010200
        WHEN(11)                                                        00010210
            DO;                                                         00010220
               SSA1_TRANHIST.REGDATO   =                                00010230
                                         F_SNU_DATO(S001482O.RDATO11O); 00010240
               W_BLTYPE                =                                00010250
                                         S001482O.BLT11O;               00010260
                                                                        00010270
               SSA3_TRANHIST.VTP_KEY   = 9999 - F_SNU_DATO(             00010280
                                                 S001482O.VDATO11O);    00010290
            END;                                                        00010300
        WHEN(12)                                                        00010310
            DO;                                                         00010320
               SSA1_TRANHIST.REGDATO   =                                00010330
                                         F_SNU_DATO(S001482O.RDATO12O); 00010340
               W_BLTYPE                =                                00010350
                                         S001482O.BLT12O;               00010360
                                                                        00010370
               SSA3_TRANHIST.VTP_KEY   = 9999 - F_SNU_DATO(             00010380
                                                 S001482O.VDATO12O);    00010390
            END;                                                        00010400
        WHEN(13)                                                        00010410
            DO;                                                         00010420
               SSA1_TRANHIST.REGDATO   =                                00010430
                                         F_SNU_DATO(S001482O.RDATO13O); 00010440
               W_BLTYPE                =                                00010450
                                         S001482O.BLT13O;               00010460
                                                                        00010470
               SSA3_TRANHIST.VTP_KEY   = 9999 - F_SNU_DATO(             00010480
                                                 S001482O.VDATO13O);    00010490
            END;                                                        00010500
        WHEN(14)                                                        00010510
            DO;                                                         00010520
               SSA1_TRANHIST.REGDATO   =                                00010530
                                         F_SNU_DATO(S001482O.RDATO14O); 00010540
               W_BLTYPE                =                                00010550
                                         S001482O.BLT14O;               00010560
                                                                        00010570
               SSA3_TRANHIST.VTP_KEY   = 9999 - F_SNU_DATO(             00010580
                                                 S001482O.VDATO14O);    00010590
            END;                                                        00010600
        OTHERWISE;                                                      00010610
     END;                                                               00010620
  END BYGG_SSA_FNR;                                                     00010630
                                                                        00010640
                                                                        00010650
                                                                        00010660
  REGDATO_BEHANDLING:                                                   00010670
     PROC;                                                              00010680
                                                                        00010690
  /* **************************************************************** */00010700
  /*HENSIKT:                                                          */00010710
  /*    BYGGER OPP SKJÆRMBILDE MED PERSONER SOM ER REGISTRERT         */00010720
  /*    FØR EN OPPGITT REGDATO.                                       */00010730
  /*                                                                  */00010740
  /*BRUK:                                                             */00010750
  /*    CALL REGDATO_BEHANDLING;                                      */00010760
  /*                                                                  */00010770
  /* **************************************************************** */00010780
                                                                        00010790
  FEILMELDING_SATT = '1'B;                                              00010800
  DO UNTIL (^FEILMELDING_SATT);                                         00010810
     FEILMELDING_SATT = '0'B;                                           00010820
     CALL SJEKK_REGDATO1;                                               00010830
  END;                                                                  00010840
                                                                        00010850
  ALLOCATE S001483O;                                                    00010860
  EXEC CICS LOAD PROGRAM('S001V33');                                    00010870
  S001483O.CICS_INFOO = CICS_NAVN  ;                                    00010880
                                                                        00010890
  /***  LESER ALLE FOREKOMSTENE                                         00010900
                                 I VT-BASEN     ********/               00010910
  /***  MED REGDATO                                                     00010920
                                  ETTER OPPGITT DATO.        ********/  00010930
                                                                        00010940
  W_REGDATO = F_SNU_DØDSDATO(PIC_6);                                    00010950
  SSA1_TRANHIST.REGDATO = W_REGDATO;                                    00010960
                                                                        00010970
  LINJENR     = 0;                                                      00010980
  ANTALL_LEST = 0;                                                      00010990
                                                                        00011000
                                                                        00011010
  IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                                 00011020
      CALL DATABASE('OPEN');                                            00011030
  ELSE                                                                  00011040
      UIBPTR     = PCB_UIB_PEKER_OMR.UIB_PEKER;                         00011050
                                                                        00011060
                                                                        00011070
  IF FEIL_MELD_NR > 0   THEN                                            00011080
           DO;                                                          00011090
                                                                        00011100
              GO TO L999;                                               00011110
           END;                                                         00011120
                                                                        00011130
                                                                        00011140
  DO WHILE (LINJENR = 0);                                               00011150
                                                                        00011160
      /***  ÅPNER VT_BASEN                            *********/        00011170
                                                                        00011180
     CALL BYGG_VENTEBILDE_OPPL_REGDATO;                                 00011190
     IF FEIL_MELD_NR > 0 THEN                                           00011200
           DO;                                                          00011210
                                                                        00011220
              GO TO RETUR;                                              00011230
           END;                                                         00011240
     ELSE                                                               00011250
        IF FEILMELDING_SATT   THEN                                      00011260
           GO TO RETUR;                                                 00011270
                                                                        00011280
                                                                        00011290
     IF LINJENR > 0 THEN                                                00011300
        DO;                                                             00011310
           /***  LUKKER VT_BASEN                            *********/  00011320
                                                                        00011330
           CALL DATABASE('CLOSE');                                      00011340
                                                                        00011350
           IF FEIL_MELD_NR > 0   THEN                                   00011360
           DO;                                                          00011370
                                                                        00011380
              GO TO L999;                                               00011390
           END;                                                         00011400
        END;                                                            00011410
                                                                        00011420
     S001483I.RDATOI    = PIC_6;                                        00011430
     S001483I.TEKST1I   = 'REGDATO FØR :';                              00011440
     S001483I.TEKST2I   = LOW(15);                                      00011450
     S001483I.LINJENRL  = -1; /* CURSOR POS */                          00011460
                                                                        00011470
     /***  SKRIVER UT VENTETRANSBILDET MED DATA.**/                     00011480
                                                                        00011490
                                                                        00011500
     EXEC CICS SEND MAP('S001483')                                      00011510
                               MAPSET('S001V33') CURSOR ERASE;          00011520
                                                                        00011530
     CALL SEARCH_FNR_BEHANDLING;                                        00011540
                                                                        00011550
  END;                                                                  00011560
                                                                        00011570
  RETUR:                                                                00011580
                                                                        00011590
  END REGDATO_BEHANDLING;                                               00011600
                                                                        00011610
                                                                        00011620
                                                                        00011630
 SJEKK_REGDATO1:                                                        00011640
  PROC;                                                                 00011650
      IF ^ F_NUMERISK(S001481I.REGDATOI) THEN                           00011660
         DO;                                                            00011670
            MAP_MELDING = 'TEGN SOM IKKE ER NUMERISK I REGDATO';        00011680
            FEILMELDING_SATT          = '1'B;                           00011690
            S001481I.REGDATOL         = -1; /* CURSOR POS */            00011700
            S001481I.FNRL             =  0; /* CURSOR POS NULLES */     00011710
            S001481O.REGDATOA         = 'I';                            00011720
            S001481O.MELDINGO         = MAP_MELDING;                    00011730
            S001481O.CICS_INFOO       = CICS_NAVN ;                     00011740
                                                                        00011750
            EXEC CICS SEND MAP('S001481')                               00011760
                                   MAPSET('S001V13')ERASE CURSOR;       00011770
                                                                        00011780
            /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/   00011790
                                                                        00011800
            EXEC CICS RECEIVE MAP('S001481') MAPSET ('S001V13')         00011810
                                                        SET(BMSMAPBR);  00011820
            IF S001481I.RETURL > 0 THEN                                 00011830
               DO;                                                      00011840
                  FUNKSJONSKODE = S001481I.RETURI;                      00011850
                                                                        00011860
                  CALL OVER_OG_UT(FUNKSJONSKODE);                       00011870
                                                                        00011880
               END;                                                     00011890
            GO TO RETUR;                                                00011900
         END;                                                           00011910
      ELSE                                                              00011920
         IF ^F_GYLDIG_DATO_DMÅ(S001481O.REGDATOO) THEN                  00011930
            DO;                                                         00011940
               MAP_MELDING               = 'UGYLDIG REGDATO';           00011950
               FEILMELDING_SATT          = '1'B;                        00011960
               S001481I.REGDATOL         = -1; /* CURSOR POS */         00011970
               S001481I.FNRL             =  0; /* CURSOR POS NULLES */  00011980
               S001481O.REGDATOA         = 'I';                         00011990
               S001481O.REGDATOO         = S001481I.REGDATOI;           00012000
               S001481O.MELDINGO         = MAP_MELDING;                 00012010
               S001481O.CICS_INFOO       = CICS_NAVN ;                  00012020
                                                                        00012030
               EXEC CICS SEND MAP('S001481')                            00012040
                                   MAPSET('S001V13')ERASE CURSOR;       00012050
                                                                        00012060
            /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/   00012070
                                                                        00012080
               EXEC CICS RECEIVE MAP('S001481') MAPSET ('S001V13')      00012090
                                                        SET(BMSMAPBR);  00012100
               IF S001481I.RETURL > 0 THEN                              00012110
                  DO;                                                   00012120
                     FUNKSJONSKODE = S001481I.RETURI;                   00012130
                                                                        00012140
                     CALL OVER_OG_UT(FUNKSJONSKODE);                    00012150
                                                                        00012160
                  END;                                                  00012170
               GO TO RETUR;                                             00012180
            END;                                                        00012190
         ELSE                                                           00012200
            DO;                                                         00012210
               PIC_6                       = S001481O.REGDATOO;         00012220
               B02.STATUS.VIRK_DATO_ÅM(13) = 0;                         00012230
               B02.STATUS.DØDSDATO_ÅMD(13) = F_SNU_DØDSDATO(PIC_6);     00012240
            END;                                                        00012250
                                                                        00012260
 RETUR:                                                                 00012270
 END SJEKK_REGDATO1;                                                    00012280
                                                                        00012290
                                                                        00012300
                                                                        00012310
                                                                        00012320
 BYGG_VENTEBILDE_OPPL_REGDATO:                                          00012330
   PROC;                                                                00012340
                                                                        00012350
                                                                        00012360
                                                                        00012370
    IF ANTALL_LEST < 21 THEN                                            00012380
       DO;                                                              00012390
          W02_GET      = W02_GU;                                        00012400
                                                                        00012410
          CALL P005_LES_ROT_UQUAL;                                      00012420
                                                                        00012430
          ANTALL_LEST               = 1;                                00012440
       END;                                                             00012450
    ELSE                                                                00012460
       DO;                                                              00012470
          ANTALL_LEST               = 1;                                00012480
                                                                        00012490
          CALL FLYTT_DBOPPL_TIL_BL_OMR_REGDATO;                         00012500
                                                                        00012510
          ANTALL_LEST = ANTALL_LEST + 1;                                00012520
                                                                        00012530
          W02_GET      = W02_GN;                                        00012540
                                                                        00012550
          CALL P005_LES_ROT_UQUAL;                                      00012560
       END;                                                             00012570
                                                                        00012580
                                                                        00012590
    DO WHILE(W01.MER_DATA &                                             00012600
                            ANTALL_LEST < 21);                          00012610
                                                                        00012620
       SUBSTR (ADDR            (B02.RF0PERSN (14))                      00012630
                  ->  W01_HJELPE_IO,1,STG (B02.RF0PERSN (14))) = W01_IO;00012640
                                                                        00012650
       SSA1_VT0PERSN.PKEY         = B02.RF0PERSN(14).FNR;               00012660
                                                                        00012670
       /*******    LES VENTE_BASE   *********/                          00012680
                                                                        00012690
       CALL P030_LES_TRANHIST_GNP_QUAL_REG;                             00012700
                                                                        00012710
                                                                        00012720
       IF W01.MER_DATA  THEN                                            00012730
          DO;                                                           00012740
             SUBSTR (ADDR            (TRANHIST)                         00012750
                       ->  W01_HJELPE_IO,1,STG (TRANHIST)) = W01_IO;    00012760
                                                                        00012770
             CALL FLYTT_DBOPPL_TIL_BL_OMR_REGDATO;                      00012780
                                                                        00012790
                                                                        00012800
             ANTALL_LEST = ANTALL_LEST + 1;                             00012810
                                                                        00012820
          END;                                                          00012830
       W02_GET      = W02_GN;                                           00012840
       CALL P005_LES_ROT_UQUAL;                                         00012850
    END;                                                                00012860
                                                                        00012870
                                                                        00012880
    IF    ANTALL_LEST > 20 THEN                                         00012890
          DO;                                                           00012900
             IF W01.MER_DATA  THEN                                      00012910
                DO;                                                     00012920
                   SUBSTR (ADDR            (B02.RF0PERSN (14))          00012930
                  ->  W01_HJELPE_IO,1,STG (B02.RF0PERSN (14))) = W01_IO;00012940
                                                                        00012950
                   SSA1_VT0PERSN.PKEY         = B02.RF0PERSN(14).FNR;   00012960
                                                                        00012970
                   /*******    LES VENTE_BASE   *********/              00012980
                                                                        00012990
                   CALL P030_LES_TRANHIST_GNP_QUAL_REG;                 00013000
                                                                        00013010
                                                                        00013020
                   IF W01.MER_DATA  THEN                                00013030
                      DO;                                               00013040
                         SUBSTR (ADDR            (TRANHIST)             00013050
                          ->  W01_HJELPE_IO,1,STG (TRANHIST)) = W01_IO; 00013060
                         MAP_MELDING =                                  00013070
                'FLERE EN 20 PERSONER.TRYKK ENTER ELLER VELG LINJENR.'; 00013080
                                                                        00013090
                         S001483O.MELDING6O = MAP_MELDING;              00013100
                                                                        00013110
                      END;                                              00013120
                   ELSE                                                 00013130
                      ANTALL_LEST = 20;                                 00013140
                END;                                                    00013150
             ELSE                                                       00013160
                ANTALL_LEST = 20;                                       00013170
          END;                                                          00013180
                                                                        00013190
                                                                        00013200
    IF    ^W01.MER_DATA & FEIL_MELD_NR = 0 &                            00013210
                          ANTALL_LEST = 1 THEN                          00013220
                                                                        00013230
          DO;                                                           00013240
             MAP_MELDING =                                              00013250
                       'DET FINNES INGEN TRANSAKSJONER ' !!             00013260
                                        'MED REGDATO FØR: ' !! PIC_6;   00013270
             FEILMELDING_SATT   = '1'B;                                 00013280
             TRANSKODE = 'R048';                                        00013290
             ALLOCATE S001481O;                                         00013300
             ALLOCATE S001481I;                                         00013310
                                                                        00013320
             EXEC CICS LOAD PROGRAM('S001V13');                         00013330
                                                                        00013340
             S001481O.MELDINGO  = MAP_MELDING;                          00013350
             S001481I.FNRL      = 0; /*CURSOR POS NULLES */             00013360
             S001481I.REGDATOL  = -1; /* CURSOR POS       */            00013370
             S001481O.REGDATOA  = 'I';                                  00013380
             S001481O.REGDATOO  = PIC_6;                                00013390
             S001481O.CICS_INFOO  = CICS_NAVN  ;                        00013400
                                                                        00013410
             EXEC CICS SEND MAP('S001481')                              00013420
                                    MAPSET('S001V13')ERASE CURSOR;      00013430
                                                                        00013440
          END;                                                          00013450
                                                                        00013460
  END BYGG_VENTEBILDE_OPPL_REGDATO;                                     00013470
                                                                        00013480
                                                                        00013490
                                                                        00013500
                                                                        00013510
                                                                        00013520
  FLYTT_DBOPPL_TIL_BL_OMR_REGDATO:                                      00013530
     PROC;                                                              00013540
     SELECT(ANTALL_LEST);                                               00013550
        WHEN(1)                                                         00013560
          DO;                                                           00013570
            S001483O.FNR1O             = B02.RF0PERSN(14).FNR;          00013580
            S001483O.NAVN1O            = B02.RF0PERSN (14).NAVN;        00013590
          END;                                                          00013600
        WHEN(2)                                                         00013610
          DO;                                                           00013620
            S001483O.FNR2O             = B02.RF0PERSN(14).FNR;          00013630
            S001483O.NAVN2O            = B02.RF0PERSN (14).NAVN;        00013640
          END;                                                          00013650
        WHEN(3)                                                         00013660
          DO;                                                           00013670
            S001483O.FNR3O             = B02.RF0PERSN(14).FNR;          00013680
            S001483O.NAVN3O            = B02.RF0PERSN (14).NAVN;        00013690
          END;                                                          00013700
        WHEN(4)                                                         00013710
          DO;                                                           00013720
            S001483O.FNR4O             = B02.RF0PERSN(14).FNR;          00013730
            S001483O.NAVN4O            = B02.RF0PERSN (14).NAVN;        00013740
          END;                                                          00013750
        WHEN(5)                                                         00013760
          DO;                                                           00013770
            S001483O.FNR5O             = B02.RF0PERSN(14).FNR;          00013780
            S001483O.NAVN5O            = B02.RF0PERSN (14).NAVN;        00013790
          END;                                                          00013800
        WHEN(6)                                                         00013810
          DO;                                                           00013820
            S001483O.FNR6O             = B02.RF0PERSN(14).FNR;          00013830
            S001483O.NAVN6O            = B02.RF0PERSN (14).NAVN;        00013840
          END;                                                          00013850
        WHEN(7)                                                         00013860
          DO;                                                           00013870
            S001483O.FNR7O             = B02.RF0PERSN(14).FNR;          00013880
            S001483O.NAVN7O            = B02.RF0PERSN (14).NAVN;        00013890
          END;                                                          00013900
        WHEN(8)                                                         00013910
          DO;                                                           00013920
            S001483O.FNR8O             = B02.RF0PERSN(14).FNR;          00013930
            S001483O.NAVN8O            = B02.RF0PERSN (14).NAVN;        00013940
          END;                                                          00013950
        WHEN(9)                                                         00013960
          DO;                                                           00013970
            S001483O.FNR9O             = B02.RF0PERSN(14).FNR;          00013980
            S001483O.NAVN9O            = B02.RF0PERSN (14).NAVN;        00013990
          END;                                                          00014000
        WHEN(10)                                                        00014010
          DO;                                                           00014020
            S001483O.FNR10O             = B02.RF0PERSN(14).FNR;         00014030
            S001483O.NAVN10O            = B02.RF0PERSN (14).NAVN;       00014040
          END;                                                          00014050
        WHEN(11)                                                        00014060
          DO;                                                           00014070
            S001483O.FNR11O             = B02.RF0PERSN(14).FNR;         00014080
            S001483O.NAVN11O            = B02.RF0PERSN (14).NAVN;       00014090
          END;                                                          00014100
        WHEN(12)                                                        00014110
          DO;                                                           00014120
            S001483O.FNR12O             = B02.RF0PERSN(14).FNR;         00014130
            S001483O.NAVN12O            = B02.RF0PERSN (14).NAVN;       00014140
          END;                                                          00014150
        WHEN(13)                                                        00014160
          DO;                                                           00014170
            S001483O.FNR13O             = B02.RF0PERSN(14).FNR;         00014180
            S001483O.NAVN13O            = B02.RF0PERSN (14).NAVN;       00014190
          END;                                                          00014200
        WHEN(14)                                                        00014210
          DO;                                                           00014220
            S001483O.FNR14O             = B02.RF0PERSN(14).FNR;         00014230
            S001483O.NAVN14O            = B02.RF0PERSN (14).NAVN;       00014240
          END;                                                          00014250
        WHEN(15)                                                        00014260
          DO;                                                           00014270
            S001483O.FNR15O             = B02.RF0PERSN(14).FNR;         00014280
            S001483O.NAVN15O            = B02.RF0PERSN (14).NAVN;       00014290
          END;                                                          00014300
        WHEN(16)                                                        00014310
          DO;                                                           00014320
            S001483O.FNR16O             = B02.RF0PERSN(14).FNR;         00014330
            S001483O.NAVN16O            = B02.RF0PERSN (14).NAVN;       00014340
          END;                                                          00014350
        WHEN(17)                                                        00014360
          DO;                                                           00014370
            S001483O.FNR17O             = B02.RF0PERSN(14).FNR;         00014380
            S001483O.NAVN17O            = B02.RF0PERSN (14).NAVN;       00014390
          END;                                                          00014400
        WHEN(18)                                                        00014410
          DO;                                                           00014420
            S001483O.FNR18O             = B02.RF0PERSN(14).FNR;         00014430
            S001483O.NAVN18O            = B02.RF0PERSN (14).NAVN;       00014440
          END;                                                          00014450
        WHEN(19)                                                        00014460
          DO;                                                           00014470
            S001483O.FNR19O             = B02.RF0PERSN(14).FNR;         00014480
            S001483O.NAVN19O            = B02.RF0PERSN (14).NAVN;       00014490
          END;                                                          00014500
        WHEN(20)                                                        00014510
          DO;                                                           00014520
            S001483O.FNR20O             = B02.RF0PERSN(14).FNR;         00014530
            S001483O.NAVN20O            = B02.RF0PERSN (14).NAVN;       00014540
          END;                                                          00014550
        OTHERWISE;                                                      00014560
     END;                                                               00014570
  END FLYTT_DBOPPL_TIL_BL_OMR_REGDATO;                                  00014580
                                                                        00014590
                                                                        00014600
                                                                        00014610
  VIRKDATO_BEHANDLING:                                                  00014620
     PROC;                                                              00014630
                                                                        00014640
  /* **************************************************************** */00014650
  /*HENSIKT:                                                          */00014660
  /*    BYGGER OPP SKJÆRMBILDE MED PERSONER SOM ER REGISTRERT         */00014670
  /*    PÅ EN OPPGITT VIRKDATO.                                       */00014680
  /*                                                                  */00014690
  /*BRUK:                                                             */00014700
  /*    CALL VIRKDATO_BEHANDLING;                                     */00014710
  /*                                                                  */00014720
  /* **************************************************************** */00014730
                                                                        00014740
  FEILMELDING_SATT = '1'B;                                              00014750
                                                                        00014760
  DO UNTIL (^FEILMELDING_SATT);                                         00014770
     FEILMELDING_SATT = '0'B;                                           00014780
                                                                        00014790
     CALL SJEKK_VIRKDATO_BLTYPE;                                        00014800
                                                                        00014810
  END;                                                                  00014820
                                                                        00014830
  ALLOCATE S001483O;                                                    00014840
  EXEC CICS LOAD PROGRAM('S001V33');                                    00014850
  S001483O.CICS_INFOO = CICS_NAVN  ;                                    00014860
                                                                        00014870
  SSA3_TRANHIST.BLTYPE           =                                      00014880
                                   W_BLTYPE;                            00014890
                                                                        00014900
  SSA3_TRANHIST.VTP_KEY   = 9999 - F_SNU_DATO(                          00014910
                                              PIC_4);                   00014920
                                                                        00014930
  /***  LESER ALLE FOREKOMSTENE                                         00014940
                                 I VT-BASEN     ********/               00014950
  /***  MED ØNSKET VIRKDATO OG BLANKETTYPE.                             00014960
                                                             ********/  00014970
                                                                        00014980
  LINJENR     = 0;                                                      00014990
  ANTALL_LEST = 0;                                                      00015000
                                                                        00015010
                                                                        00015020
   /***  ÅPNER VT_BASEN                            *********/           00015030
                                                                        00015040
                                                                        00015050
  IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                                 00015060
      CALL DATABASE('OPEN');                                            00015070
  ELSE                                                                  00015080
      UIBPTR     = PCB_UIB_PEKER_OMR.UIB_PEKER;                         00015090
                                                                        00015100
                                                                        00015110
  IF FEIL_MELD_NR > 0   THEN                                            00015120
           DO;                                                          00015130
                                                                        00015140
              GO TO L999;                                               00015150
           END;                                                         00015160
                                                                        00015170
  DO WHILE (LINJENR = 0);                                               00015180
                                                                        00015190
                                                                        00015200
     CALL BYGG_VENTEBILDE_OPPL_VIRKDATO;                                00015210
                                                                        00015220
     IF FEIL_MELD_NR > 0 THEN                                           00015230
           DO;                                                          00015240
                                                                        00015250
              GO TO RETUR;                                              00015260
           END;                                                         00015270
     ELSE                                                               00015280
        IF FEILMELDING_SATT   THEN                                      00015290
           GO TO RETUR;                                                 00015300
                                                                        00015310
     IF LINJENR > 0 THEN                                                00015320
        DO;                                                             00015330
           /*** LUKKER VT_BASEN                            *********/   00015340
                                                                        00015350
           CALL DATABASE('CLOSE');                                      00015360
                                                                        00015370
           IF FEIL_MELD_NR > 0   THEN                                   00015380
           DO;                                                          00015390
                                                                        00015400
              GO TO L999;                                               00015410
           END;                                                         00015420
        END;                                                            00015430
                                                                        00015440
     S001483O.RDATOO    =  PIC_4            ;                           00015450
     S001483I.TEKST1I   =  'VIRKDATO     :' ;                           00015460
     S001483I.TEKST2I   =  'BLANKETTTYPE :' ;                           00015470
     S001483I.BLTYPEI   =  W_BLTYPE         ;                           00015480
     S001483I.LINJENRL  =                -1 ; /* CURSOR POS */          00015490
                                                                        00015500
     /***  SKRIVER UT VENTETRANSBILDET MED DATA.**/                     00015510
                                                                        00015520
                                                                        00015530
     EXEC CICS SEND MAP('S001483')                                      00015540
                               MAPSET('S001V33') CURSOR ERASE;          00015550
                                                                        00015560
     CALL SEARCH_FNR_BEHANDLING;                                        00015570
                                                                        00015580
  END;                                                                  00015590
                                                                        00015600
  RETUR:                                                                00015610
                                                                        00015620
  END VIRKDATO_BEHANDLING;                                              00015630
                                                                        00015640
                                                                        00015650
 SJEKK_VIRKDATO_BLTYPE:                                                 00015660
  PROC;                                                                 00015670
      IF ^ F_NUMERISK(S001481I.VIRKDATOI) THEN                          00015680
         DO;                                                            00015690
            MAP_MELDING = 'TEGN SOM IKKE ER NUMERISK I VIRKDATO';       00015700
            FEILMELDING_SATT          = '1'B;                           00015710
            S001481I.VIRKDATOL        = -1; /* CURSOR POS */            00015720
            S001481I.FNRL             =  0; /* CURSOR POS NULLES */     00015730
            S001481O.VIRKDATOA        = 'I';                            00015740
            S001481O.BLTYPEO          = S001481I.BLTYPEI  ;             00015750
            S001481O.MELDINGO         = MAP_MELDING;                    00015760
            S001481O.CICS_INFOO       = CICS_NAVN ;                     00015770
                                                                        00015780
            EXEC CICS SEND MAP('S001481')                               00015790
                                   MAPSET('S001V13')ERASE CURSOR;       00015800
                                                                        00015810
            /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/   00015820
                                                                        00015830
            EXEC CICS RECEIVE MAP('S001481') MAPSET ('S001V13')         00015840
                                                        SET(BMSMAPBR);  00015850
            IF S001481I.RETURL > 0 THEN                                 00015860
               DO;                                                      00015870
                  FUNKSJONSKODE = S001481I.RETURI;                      00015880
                                                                        00015890
                  CALL OVER_OG_UT(FUNKSJONSKODE);                       00015900
                                                                        00015910
               END;                                                     00015920
            GO TO RETUR;                                                00015930
         END;                                                           00015940
      ELSE                                                              00015950
         IF ^F_GYLDIG_DATO(S001481O.VIRKDATOO) THEN                     00015960
            DO;                                                         00015970
               MAP_MELDING               = 'UGYLDIG VIRKDATO.';         00015980
               FEILMELDING_SATT          = '1'B;                        00015990
               S001481I.VIRKDATOL        = -1; /* CURSOR POS */         00016000
               S001481I.FNRL             =  0; /* CURSOR POS NULLES */  00016010
               S001481O.VIRKDATOA        = 'I';                         00016020
               S001481O.VIRKDATOO        = S001481I.VIRKDATOI;          00016030
               S001481O.BLTYPEO          = S001481I.BLTYPEI  ;          00016040
               S001481O.MELDINGO         = MAP_MELDING;                 00016050
               S001481O.CICS_INFOO       = CICS_NAVN ;                  00016060
                                                                        00016070
               EXEC CICS SEND MAP('S001481')                            00016080
                                   MAPSET('S001V13')ERASE CURSOR;       00016090
                                                                        00016100
            /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/   00016110
                                                                        00016120
               EXEC CICS RECEIVE MAP('S001481') MAPSET ('S001V13')      00016130
                                                        SET(BMSMAPBR);  00016140
               IF S001481I.RETURL > 0 THEN                              00016150
                  DO;                                                   00016160
                     FUNKSJONSKODE = S001481I.RETURI;                   00016170
                                                                        00016180
                     CALL OVER_OG_UT(FUNKSJONSKODE);                    00016190
                                                                        00016200
                  END;                                                  00016210
               GO TO RETUR;                                             00016220
            END;                                                        00016230
         ELSE                                                           00016240
            DO;                                                         00016250
               PIC_4                       = S001481O.VIRKDATOO;        00016260
               B02.STATUS.VIRK_DATO_ÅM(13) = F_SNU_DATO(PIC_4);         00016270
               B02.STATUS.DØDSDATO_ÅMD(13) = 0;                         00016280
               IF ^(S001481I.BLTYPEI = 'AP' !                           00016290
                   S001481I.BLTYPEI = 'A1' !                            00016300
                   S001481I.BLTYPEI = 'UP' !                            00016310
                   S001481I.BLTYPEI = 'U2' !                            00016320
                   S001481I.BLTYPEI = 'U3' !                            00016330
                   S001481I.BLTYPEI = 'AF' !                            00016340
                   S001481I.BLTYPEI = 'KF' !                            00016350
                   S001481I.BLTYPEI = 'UF' !                            00016360
                   S001481I.BLTYPEI = 'EP' !                            00016370
                   S001481I.BLTYPEI = 'E3' !                            00016380
                   S001481I.BLTYPEI = 'EF' !                            00016390
                   S001481I.BLTYPEI = 'EE' !                            00016400
                   S001481I.BLTYPEI = 'E4' !                            00016410
                   S001481I.BLTYPEI = 'FB' !                            00016420
                   S001481I.BLTYPEI = 'BP' !                            00016430
                   S001481I.BLTYPEI = 'B6' !                            00016440
                   S001481I.BLTYPEI = 'FT' !                            00016450
                   S001481I.BLTYPEI = 'F7' !                            00016460
                   S001481I.BLTYPEI = 'FO' !                            00016470
                   S001481I.BLTYPEI = 'O1' !                            00016480
                   S001481I.BLTYPEI = 'O2' !                            00016490
                   S001481I.BLTYPEI = 'E1' !                            00016500
                   S001481I.BLTYPEI = 'EN' !                            00016510
                   S001481I.BLTYPEI = 'E2') THEN                        00016520
                   DO;                                                  00016530
                      MAP_MELDING = 'UGYLDIG BLANKETTYPE.';             00016540
                      FEILMELDING_SATT   = '1'B      ;                  00016550
                      S001481I.BLTYPEL   = -1; /* CURSOR POS */         00016560
                      S001481I.FNRL      =  0; /* CURSOR POS NULLES */  00016570
                      S001481I.VIRKDATOL =  0; /* CURSOR POS NULLES */  00016580
                      S001481O.BLTYPEA   = 'I'       ;                  00016590
                      S001481O.VIRKDATOO = S001481I.VIRKDATOI;          00016600
                      S001481O.BLTYPEO   = S001481I.BLTYPEI  ;          00016610
                      S001481O.MELDINGO  = MAP_MELDING       ;          00016620
                      S001481O.CICS_INFOO   = CICS_NAVN ;               00016630
                                                                        00016640
                      EXEC CICS SEND MAP('S001481')                     00016650
                                   MAPSET('S001V13')ERASE CURSOR;       00016660
                                                                        00016670
            /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/   00016680
                                                                        00016690
                      EXEC CICS RECEIVE MAP('S001481') MAPSET           00016700
                                            ('S001V13') SET(BMSMAPBR);  00016710
                      IF S001481I.RETURL > 0 THEN                       00016720
                         DO;                                            00016730
                            FUNKSJONSKODE = S001481I.RETURI;            00016740
                                                                        00016750
                            CALL OVER_OG_UT(FUNKSJONSKODE);             00016760
                                                                        00016770
                         END;                                           00016780
                   END;                                                 00016790
                ELSE                                                    00016800
                   DO;                                                  00016810
                      W_BLTYPE                    = S001481I.BLTYPEI;   00016820
                      TRANS_OPPL_OMR.BLANKETTYPE  = W_BLTYPE        ;   00016830
                   END;                                                 00016840
            END;                                                        00016850
                                                                        00016860
 RETUR:                                                                 00016870
 END SJEKK_VIRKDATO_BLTYPE;                                             00016880
                                                                        00016890
                                                                        00016900
 BYGG_VENTEBILDE_OPPL_VIRKDATO:                                         00016910
   PROC;                                                                00016920
                                                                        00016930
                                                                        00016940
                                                                        00016950
    IF ANTALL_LEST < 21 THEN                                            00016960
       DO;                                                              00016970
          W02_GET      = W02_GU;                                        00016980
                                                                        00016990
          CALL P005_LES_ROT_UQUAL;                                      00017000
                                                                        00017010
          ANTALL_LEST               = 1;                                00017020
       END;                                                             00017030
    ELSE                                                                00017040
       DO;                                                              00017050
          ANTALL_LEST               = 1;                                00017060
                                                                        00017070
          CALL FLYTT_DBOPPL_TIL_BL_OMR_REGDATO;                         00017080
                                                                        00017090
          ANTALL_LEST = ANTALL_LEST + 1;                                00017100
                                                                        00017110
          W02_GET      = W02_GN;                                        00017120
                                                                        00017130
          CALL P005_LES_ROT_UQUAL;                                      00017140
       END;                                                             00017150
                                                                        00017160
                                                                        00017170
    DO WHILE(W01.MER_DATA &                                             00017180
                            ANTALL_LEST < 21);                          00017190
                                                                        00017200
       SUBSTR (ADDR            (B02.RF0PERSN (14))                      00017210
                  ->  W01_HJELPE_IO,1,STG (B02.RF0PERSN (14))) = W01_IO;00017220
                                                                        00017230
       SSA1_VT0PERSN.PKEY         = B02.RF0PERSN(14).FNR;               00017240
                                                                        00017250
       /*******    LES VENTE_BASE   *********/                          00017260
                                                                        00017270
       CALL P030_LES_TRANHIST_GN_QUAL_VTP;                              00017280
                                                                        00017290
                                                                        00017300
       IF W01.MER_DATA  THEN                                            00017310
          DO;                                                           00017320
             SUBSTR (ADDR            (TRANHIST)                         00017330
                       ->  W01_HJELPE_IO,1,STG (TRANHIST)) = W01_IO;    00017340
                                                                        00017350
             CALL FLYTT_DBOPPL_TIL_BL_OMR_REGDATO;                      00017360
                                                                        00017370
                                                                        00017380
             ANTALL_LEST = ANTALL_LEST + 1;                             00017390
                                                                        00017400
          END;                                                          00017410
       W02_GET      = W02_GN;                                           00017420
       CALL P005_LES_ROT_UQUAL;                                         00017430
    END;                                                                00017440
                                                                        00017450
                                                                        00017460
    IF    ANTALL_LEST > 20 THEN                                         00017470
          DO;                                                           00017480
             IF W01.MER_DATA  THEN                                      00017490
                DO;                                                     00017500
                   SUBSTR (ADDR            (B02.RF0PERSN (14))          00017510
                  ->  W01_HJELPE_IO,1,STG (B02.RF0PERSN (14))) = W01_IO;00017520
                                                                        00017530
                   SSA1_VT0PERSN.PKEY         = B02.RF0PERSN(14).FNR;   00017540
                                                                        00017550
                   /*******    LES VENTE_BASE   *********/              00017560
                                                                        00017570
                   CALL P030_LES_TRANHIST_GN_QUAL_VTP;                  00017580
                                                                        00017590
                                                                        00017600
                   IF W01.MER_DATA  THEN                                00017610
                      DO;                                               00017620
                         SUBSTR (ADDR            (TRANHIST)             00017630
                          ->  W01_HJELPE_IO,1,STG (TRANHIST)) = W01_IO; 00017640
                         MAP_MELDING =                                  00017650
                'FLERE EN 20 PERSONER.TRYKK ENTER ELLER VELG LINJENR.'; 00017660
                                                                        00017670
                         S001483O.MELDING6O = MAP_MELDING;              00017680
                                                                        00017690
                      END;                                              00017700
                   ELSE                                                 00017710
                      ANTALL_LEST = 20;                                 00017720
                END;                                                    00017730
             ELSE                                                       00017740
                ANTALL_LEST = 20;                                       00017750
          END;                                                          00017760
                                                                        00017770
                                                                        00017780
    IF    ^W01.MER_DATA & FEIL_MELD_NR = 0 &                            00017790
                          ANTALL_LEST = 1 THEN                          00017800
                                                                        00017810
          DO;                                                           00017820
             MAP_MELDING =                                              00017830
                       'DET FINNES INGEN TRANSAKSJONER ' !!             00017840
                                        'MED VIRKDATO = ' !! PIC_4;     00017850
             FEILMELDING_SATT   = '1'B;                                 00017860
             TRANSKODE = 'R048';                                        00017870
             ALLOCATE S001481O;                                         00017880
             ALLOCATE S001481I;                                         00017890
                                                                        00017900
             EXEC CICS LOAD PROGRAM('S001V13');                         00017910
                                                                        00017920
             S001481O.MELDINGO   = MAP_MELDING;                         00017930
             S001481I.FNRL       = 0; /*CURSOR POS NULLES */            00017940
             S001481I.VIRKDATOL  = -1; /* CURSOR POS       */           00017950
             S001481O.VIRKDATOA  = 'I';                                 00017960
             S001481O.VIRKDATOO  = PIC_4;                               00017970
             S001481O.BLTYPEO    = S001481I.BLTYPEI;                    00017980
             S001481O.CICS_INFOO = CICS_NAVN  ;                         00017990
                                                                        00018000
             EXEC CICS SEND MAP('S001481')                              00018010
                                    MAPSET('S001V13')ERASE CURSOR;      00018020
                                                                        00018030
          END;                                                          00018040
                                                                        00018050
  END BYGG_VENTEBILDE_OPPL_VIRKDATO;                                    00018060
                                                                        00018070
                                                                        00018080
                                                                        00018090
                                                                        00018100
                                                                        00018110
  /* **************************************************************** */00018120
  /*                                                                  */00018130
  /*  PROCEDURE FOR Å ÅPNE OG LUKKE VENTEDATABASEN.                   */00018140
  /*                                                                  */00018150
  /*                                                                  */00018160
  /* **************************************************************** */00018170
  /*                                                                    00018180
  */                                                                    00018190
  DATABASE:                                                             00018200
   PROC(STYRING);                                                       00018210
                                                                        00018220
   DCL                                                                  00018230
     STYRING                               CHAR(5),                     00018240
     NULL                                  BUILTIN,                     00018250
     UNSPEC                                BUILTIN,                     00018260
     PLITDLI                               ENTRY;                       00018270
                                                                        00018280
  %SKIP;                                                                00018290
  /*                                                                  */00018300
  /***** DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-****/00018310
  /*     KALL                                                         */00018320
  /*                                                                  */00018330
     DCL                                                                00018340
       W01_PSB_NAVN                CHAR (8)       INIT('B001R001');     00018350
     DCL                                                                00018360
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');         00018370
     DCL                                                                00018380
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00018390
  %PAGE;                                                                00018400
  /*                                                                  */00018410
  /****  DLI CALL-PARAMETRE                               *************/00018420
  /*                                                                  */00018430
  %SKIP(2);                                                             00018440
     DCL 1  W01_DLI_PARAM,                                              00018450
            2   W02_GU             CHAR (4)       INIT('GU  '),         00018460
            2   W02_PARM_CT_1      FIXED BIN(31)  INIT(1),              00018470
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT(3);              00018480
                                                                        00018490
  %PAGE;                                                                00018500
                                                                        00018510
                                                                        00018520
       W01_PSB_NAVN    = DIV_PARAM_OMR.PSB_NAVN;                        00018530
     IF STYRING = 'OPEN' THEN                                           00018540
        DO;                                                             00018550
           CALL   PLITDLI                        (W02_PARM_CT_3,        00018560
                                                  W01_PCB_FUNCTION,     00018570
                                                  W01_PSB_NAVN,         00018580
                                                  UIBPTR);              00018590
                                                                        00018600
                                                                        00018610
           IF DLIUIB.UIBFCTR                 = '00000000'B THEN         00018620
              DO;                                                       00018630
                 ALLOCATE PCB_UIB_PEKER_OMR;                            00018640
                 KOM_OMR.PCB_UIB_PEKER       = ADDR (PCB_UIB_PEKER_OMR);00018650
                 ALLOCATE PCB_PEKER_OMR;                                00018660
                 PCB_UIB_PEKER_OMR.UIB_PEKER = UIBPTR;                  00018670
                 PCB_UIB_PEKER_OMR.PCB_PEKER = UIBPCBAL;                00018680
              END;                                                      00018690
           ELSE                                                         00018700
              DO;                                                       00018710
                 FEIL_MELD_NR      =  500;                              00018720
 L555:           FEIL_VED_LABEL    = '555';                             00018730
                 MAP_MELDING =                                          00018740
                         'NOE ER GALT MED DATABASEN, KODE: ' !!         00018750
                           UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);   00018760
              END;                                                      00018770
        END;                                                            00018780
     ELSE                                                               00018790
        DO;                                                             00018800
           CALL   PLITDLI                        (W02_PARM_CT_1,        00018810
                                                  W01_TERM_FUNCTION);   00018820
           KOM_OMR.PCB_UIB_PEKER = NULL;                                00018830
        END;                                                            00018840
                                                                        00018850
  END DATABASE;                                                         00018860
                                                                        00018870
                                                                        00018880
                                                                        00018890
                                                                        00018900
  /* **************************************************************** */00018910
  /*                                                                  */00018920
  /*  PROCEDURE FOR Å HENTE SVAR OG BEKREFTELSE PÅ FJERNING           */00018930
  /*                                                                  */00018940
  /*                                                                  */00018950
  /* **************************************************************** */00018960
  /*                                                                    00018970
  */                                                                    00018980
  HENT_SVAR_OG_BEKREFT:                                                 00018990
     PROC;                                                              00019000
                                                                        00019010
                                                                        00019020
     S001482O.MELDING6O = LOW(78);                                      00019030
     EXEC CICS SEND    MAP('S001482') MAPSET('S001V23');                00019040
                                                                        00019050
     S001484O.MELDINGO  = 'BEKREFT FJERNING MED: B   VENNLIGST VæR ' !! 00019060
                         'SNAR DA DETTE OPPTAR STORE RESSURSER';        00019070
                                                                        00019080
     EXEC CICS SEND    MAP('S001484') MAPSET('S001V23');                00019090
                                                                        00019100
     EXEC CICS RECEIVE MAP('S001484')                                   00019110
                           MAPSET('S001V23') INTO (S001484I);           00019120
                                                                        00019130
  END HENT_SVAR_OG_BEKREFT;                                             00019140
                                                                        00019150
                                                                        00019160
                                                                        00019170
  /* **************************************************************** */00019180
  /*                                                                  */00019190
  /*  PROCEDURE FOR Å LESE VENTEBASE OG FLYTTE OPPLYSNINGENE INN      */00019200
  /*  I RIKTIG BLANKETTOMRÅDE.                                        */00019210
  /*                                                                  */00019220
  /* **************************************************************** */00019230
                                                                        00019240
  FLYTT_BASEDATA_TIL_BILDE_OMR:                                         00019250
    PROC;                                                               00019260
                                                                        00019270
    IF   SEARCH_FNR                         =    0                 THEN 00019280
         DO;                                                            00019290
            /* ********************************************** */        00019300
            /* NULL I FNR . KJØRING AVBRYTES                  */        00019310
            /* ********************************************** */        00019320
  L100:                                                                 00019330
            FEIL_MELD_NR                 =   498;                       00019340
            FEIL_VED_LABEL               =  '100';                      00019350
            GO TO RETUR;                                                00019360
         END;                                                           00019370
                                                                        00019380
                                                                        00019390
                                                                        00019400
 /*YS*/ GRUNNBYP_IKKE_LEST = '1'B;                                      00019410
 /*YS*/ TO_GRUNNBYP_LEST   = '0'B;                                      00019420
                                                                        00019430
    W02_GET = W02_GU;                                                   00019440
    CALL P005_LES_ROT_QUAL;                                             00019450
                                                                        00019460
                                                                        00019470
 /*YS*/ DO   WHILE  (W01.MER_DATA  &  W01.BARN_IKKE_LEST &              00019480
 /*YS*/              ^TO_GRUNNBYP_LEST);                                00019490
                                                                        00019500
      IF FEIL_MELD_NR                    >    0                THEN     00019510
         DO;                                                            00019520
           /* ********************************************** */         00019530
           /*  FEIL VED LES                                  */         00019540
           /* ********************************************** */         00019550
                                                                        00019560
           GO TO RETUR;                                                 00019570
         END;                                                           00019580
                                                                        00019590
                                                                        00019600
      SELECT ( VT1.SEGM_NAVN );                                         00019610
                                                                        00019620
        WHEN ( 'VT0PERSN' )                                             00019630
          /* **************************************************** */    00019640
          /*  FÅTT INN :    V T 0 P E R S N                       */    00019650
          /* **************************************************** */    00019660
          DO;                                                           00019670
                                                                        00019680
             SUBSTR (ADDR            (B02.RF0PERSN (14))                00019690
                  ->  W01_HJELPE_IO,1,STG (B02.RF0PERSN (14))) = W01_IO;00019700
                                                                        00019710
             W01.NAVN            =    B02.RF0PERSN (14).NAVN      ;     00019720
                                                                        00019730
             TRANS_OPPL_OMR.FØDSNUMMER             =  SEARCH_FNR;       00019740
             CALL P030_LES_TRANHIST_GN_QUAL_VTP;                        00019750
          END;                                                          00019760
                                                                        00019770
        WHEN ( 'TRANHIST' )                                             00019780
          /* **************************************************** */    00019790
          /*  FÅTT INN :    T R A N H I S T                       */    00019800
          /* **************************************************** */    00019810
          DO;                                                           00019820
            SUBSTR (ADDR                (TRANHIST)                      00019830
                ->  W01_HJELPE_IO,1,STG (TRANHIST)) =  W01_IO;          00019840
            CALL    P010_LES_SEGM;                                      00019850
          END;                                                          00019860
                                                                        00019870
        WHEN ( 'GRUNNBAP' )                                             00019880
          /* **************************************************** */    00019890
          /*  FÅTT INN :    G R U N N B A P                       */    00019900
          /*  GRUNNBAP KAN VÆRE AVTALEFESTET PENSJON OGSÅ' DA SKAL*/    00019910
          /*  LESTE DATA LEGGES I OMRÅDET GRUNNBAF                */    00019920
          /*  ENDRET SATISH 17.01.89                              */    00019930
          /* **************************************************** */    00019940
          DO;                                                           00019950
            IF TRANHIST.GRBLKODE = 'AP' THEN                            00019960
               SUBSTR (ADDR                (GRUNNBAP)                   00019970
                     ->  W01_HJELPE_IO,1,STG (GRUNNBAP)) =  W01_IO;     00019980
                                                                        00019990
            IF TRANHIST.GRBLKODE = 'AF' THEN                            00020000
               SUBSTR (ADDR                (GRUNNBAF)                   00020010
                     ->  W01_HJELPE_IO,1,STG (GRUNNBAF)) =  W01_IO;     00020020
                                                                        00020040
                                                                        00020050
            IF TRANHIST.GRBLKODE = 'KF' THEN                            00020060
               SUBSTR (ADDR                (GRUNNBKF)                   00020070
                     ->  W01_HJELPE_IO,1,STG (GRUNNBKF)) =  W01_IO;     00020080
            CALL    P010_LES_SEGM;                                      00020090
                                                                        00020100
          END;                                                          00020110
                                                                        00020120
        WHEN ( 'GRUNNBA1' )                                             00020130
          /* **************************************************** */    00020140
          /*  FÅTT INN :    G R U N N B A P                       */    00020150
          /*  GRUNNBAP KAN VÆRE AVTALEFESTET PENSJON OGSÅ' DA SKAL*/    00020160
          /*  LESTE DATA LEGGES I OMRÅDET GRUNNBAF                */    00020170
          /*  ENDRET SATISH 17.01.89                              */    00020180
          /* **************************************************** */    00020190
          DO;                                                           00020200
            IF TRANHIST.GRBLKODE = 'A1' THEN                            00020210
               SUBSTR (ADDR                (GRUNNBA1)                   00020220
                     ->  W01_HJELPE_IO,1,STG (GRUNNBA1)) =  W01_IO;     00020230
            CALL    P010_LES_SEGM;                                      00020240
          END;                                                          00020250
        WHEN ( 'GRUNNBUP' )                                             00020260
          /* **************************************************** */    00020270
          /*  FÅTT INN :    G R U N N B U P                       */    00020280
          /* **************************************************** */    00020290
          DO;                                                           00020300
            IF TRANHIST.GRBLKODE      =  'UP'  THEN                     00020310
                                                                        00020320
              SUBSTR (ADDR                (GRUNNBUP)                    00020330
                  ->  W01_HJELPE_IO,1,STG (GRUNNBUP)) =  W01_IO;        00020340
                                                                        00020350
            IF TRANHIST.GRBLKODE      =  'UF'  THEN                     00020360
  /*UF*/      SUBSTR (ADDR                (GRUNNBUF)                    00020370
  /*UF*/          ->  W01_HJELPE_IO,1,STG (GRUNNBUF)) =  W01_IO;        00020380
            CALL    P010_LES_SEGM;                                      00020390
          END;                                                          00020400
                                                                        00020410
        WHEN ( 'GRUNNBU2' )                                             00020420
          /* **************************************************** */    00020430
          /*  FÅTT INN :    G R U N N B U P                       */    00020440
          /* **************************************************** */    00020450
          DO;                                                           00020460
                                                                        00020470
            IF TRANHIST.GRBLKODE      =  'U2'  THEN                     00020480
                                                                        00020490
              SUBSTR (ADDR                (GRUNNBU2)                    00020500
                  ->  W01_HJELPE_IO,1,STG (GRUNNBU2)) =  W01_IO;        00020510
                                                                        00020520
            CALL    P010_LES_SEGM;                                      00020530
          END;                                                          00020540
                                                                        00020550
        WHEN ( 'GRUNNBU3' )                                             00020560
          /* **************************************************** */    00020570
          /*  FÅTT INN :    G R U N N B U P                       */    00020580
          /* **************************************************** */    00020590
          DO;                                                           00020600
                                                                        00020610
            IF TRANHIST.GRBLKODE      =  'U3'  THEN                     00020620
                                                                        00020630
              SUBSTR (ADDR                (GRUNNBU3)                    00020640
                  ->  W01_HJELPE_IO,1,STG (GRUNNBU3)) =  W01_IO;        00020650
                                                                        00020660
            CALL    P010_LES_SEGM;                                      00020670
          END;                                                          00020680
                                                                        00020690
        WHEN ( 'GRBLUFST' )                                             00020700
          /* **************************************************** */    00020710
          /*  FÅTT INN :    G R B L U F S T                       */    00020720
          /* **************************************************** */    00020730
          DO;                                                           00020740
            SUBSTR (ADDR                (GRBLUFST)                      00020750
                ->  W01_HJELPE_IO,1,STG (GRBLUFST)) =  W01_IO;          00020760
            CALL    P010_LES_SEGM;                                      00020770
          END;                                                          00020780
                                                                        00020790
        WHEN ( 'GRBLFORS' )                                             00020800
          /* **************************************************** */    00020810
          /*  FÅTT INN :    G R B L F O R S                       */    00020820
          /* **************************************************** */    00020830
          DO;                                                           00020840
            SUBSTR (ADDR                (GRBLFORS)                      00020850
                ->  W01_HJELPE_IO,1,STG (GRBLFORS)) =  W01_IO;          00020860
            CALL    P010_LES_SEGM;                                      00020870
          END;                                                          00020880
                                                                        00020890
        WHEN ( 'GRUNNBIF' )                                             00020900
          /* **************************************************** */    00020910
          /*  FÅTT INN :    G R B L F O R S                       */    00020920
          /* **************************************************** */    00020930
          DO;                                                           00020940
            SUBSTR (ADDR                (GRUNNBIF)                      00020950
                ->  W01_HJELPE_IO,1,STG (GRUNNBIF)) =  W01_IO;          00020960
            CALL    P010_LES_SEGM;                                      00020970
          END;                                                          00020980
                                                                        00020990
        WHEN ( 'GRUNNBFO' )                                             00021000
          /* **************************************************** */    00021010
          /*  FÅTT INN :    G R B L F O R S                       */    00021020
          /* **************************************************** */    00021030
          DO;                                                           00021040
            SUBSTR (ADDR                (GRUNNBFO)                      00021050
                ->  W01_HJELPE_IO,1,STG (GRUNNBFO)) =  W01_IO;          00021060
            CALL    P010_LES_SEGM;                                      00021070
          END;                                                          00021080
                                                                        00021090
        WHEN ( 'GRUNNBEP' )                                             00021100
          /* **************************************************** */    00021110
          /*  FÅTT INN :    G R U N N B E P                       */    00021120
          /* **************************************************** */    00021130
          DO;                                                           00021140
            SUBSTR (ADDR                (GRUNNBEP)                      00021150
                ->  W01_HJELPE_IO,1,STG (GRUNNBEP)) =  W01_IO;          00021160
            CALL    P010_LES_SEGM;                                      00021170
          END;                                                          00021180
                                                                        00021190
        WHEN ( 'GRUNNBEE' )                                             00021200
          /* **************************************************** */    00021210
          /*  FÅTT INN :    G R U N N B E P                       */    00021220
          /* **************************************************** */    00021230
          DO;                                                           00021240
            SUBSTR (ADDR                (GRUNNBEE)                      00021250
                ->  W01_HJELPE_IO,1,STG (GRUNNBEE)) =  W01_IO;          00021260
            CALL    P010_LES_SEGM;                                      00021270
          END;                                                          00021280
                                                                        00021290
        WHEN ( 'GRUNNEES' )                                             00021300
          /* **************************************************** */    00021310
          /*  FÅTT INN :    G R U N N B E P                       */    00021320
          /* **************************************************** */    00021330
          DO;                                                           00021340
            SUBSTR (ADDR                (GRUNNEES)                      00021350
                ->  W01_HJELPE_IO,1,STG (GRUNNEES)) =  W01_IO;          00021360
            CALL    P010_LES_SEGM;                                      00021370
          END;                                                          00021380
                                                                        00021390
        WHEN ( 'GRUNNBE3' )                                             00021400
          /* **************************************************** */    00021410
          /*  FÅTT INN :    G R U N N B E 3                       */    00021420
          /* **************************************************** */    00021430
          DO;                                                           00021440
            SUBSTR (ADDR                (GRUNNBE3)                      00021450
                ->  W01_HJELPE_IO,1,STG (GRUNNBE3)) =  W01_IO;          00021460
            CALL    P010_LES_SEGM;                                      00021470
          END;                                                          00021480
                                                                        00021490
        WHEN ( 'GRBLFAMP' )                                             00021500
          /* **************************************************** */    00021510
          /*  FÅTT INN :    G R B L F A M P                       */    00021520
          /* **************************************************** */    00021530
          DO;                                                           00021540
            SUBSTR (ADDR                (GRBLFAMP)                      00021550
                ->  W01_HJELPE_IO,1,STG (GRBLFAMP)) =  W01_IO;          00021560
            CALL    P010_LES_SEGM;                                      00021570
          END;                                                          00021580
                                                                        00021590
        WHEN ( 'GRBLFAE4' )                                             00021600
          /* **************************************************** */    00021610
          /*  FÅTT INN :    G R B L F A M P                       */    00021620
          /* **************************************************** */    00021630
          DO;                                                           00021640
            SUBSTR (ADDR                (GRBLFAE4)                      00021650
                ->  W01_HJELPE_IO,1,STG (GRBLFAE4)) =  W01_IO;          00021660
            CALL    P010_LES_SEGM;                                      00021670
          END;                                                          00021680
                                                                        00021690
        WHEN ( 'GRBLEBEN' )                                             00021700
          /* **************************************************** */    00021710
          /*  FÅTT INN :    G R B L E B E N                       */    00021720
          /* **************************************************** */    00021730
          DO;                                                           00021740
            SUBSTR (ADDR                (GRBLEBEN)                      00021750
                ->  W01_HJELPE_IO,1,STG (GRBLEBEN)) =  W01_IO;          00021760
            CALL    P010_LES_SEGM;                                      00021770
          END;                                                          00021780
                                                                        00021790
        WHEN ( 'GRBLEBB6' )                                             00021800
          /* **************************************************** */    00021810
          /*  FÅTT INN :    G R B L E B B 6                       */    00021820
          /* **************************************************** */    00021830
          DO;                                                           00021840
            SUBSTR (ADDR                (GRBLEBB6)                      00021850
                ->  W01_HJELPE_IO,1,STG (GRBLEBB6)) =  W01_IO;          00021860
            CALL    P010_LES_SEGM;                                      00021870
          END;                                                          00021880
                                                                        00021890
        WHEN ( 'GRBLEBBE' )                                             00021900
          /* **************************************************** */    00021910
          /*  FÅTT INN :    G R B L E B B E                       */    00021920
          /* **************************************************** */    00021930
          DO;                                                           00021940
            SUBSTR (ADDR                (GRBLEBBE)                      00021950
                ->  W01_HJELPE_IO,1,STG (GRBLEBBE)) =  W01_IO;          00021960
            CALL    P010_LES_SEGM;                                      00021970
          END;                                                          00021980
                                                                        00021990
 /*YS*/ WHEN ( 'GRUNNBYP' )                                             00022000
 /*YS*/   /* **************************************************** */    00022010
 /*YS*/   /*  FÅTT INN :    G R U N N B Y P                       */    00022020
 /*YS*/   /* **************************************************** */    00022030
 /*YS*/   DO;                                                           00022040
 /*YS*/     IF GRUNNBYP_IKKE_LEST THEN                                  00022050
 /*YS*/        DO;                                                      00022060
 /*YS*/           SUBSTR (ADDR                (GRUNNBYP)                00022070
 /*YS*/               ->  W01_HJELPE_IO,1,STG (GRUNNBYP)) =  W01_IO;    00022080
 /*YS*/           CALL    P010_LES_SEGM;                                00022090
 /*YS*/           GRUNNBYP_IKKE_LEST = '0'B;                            00022100
 /*YS*/        END;                                                     00022110
 /*YS*/     ELSE                                                        00022120
 /*YS*/        TO_GRUNNBYP_LEST = '1'B;                                 00022130
 /*YS*/   END;                                                          00022140
                                                                        00022150
        WHEN ( 'ENDRBLAN' )                                             00022160
          /* **************************************************** */    00022170
          /*  FÅTT INN :    E N D R B L A N                       */    00022180
          /* **************************************************** */    00022190
          DO;                                                           00022200
            SUBSTR (ADDR                (ENDRBLAN)                      00022210
                ->  W01_HJELPE_IO,1,STG (ENDRBLAN)) =  W01_IO;          00022220
            CALL    P010_LES_SEGM;                                      00022230
          END;                                                          00022240
                                                                        00022250
        WHEN ( 'ENBLAN1 ' )                                             00022260
          /* **************************************************** */    00022270
          /*  FÅTT INN :    E N -   B L A N K E T T               */    00022280
          /* **************************************************** */    00022290
          DO;                                                           00022300
            SUBSTR (ADDR                (EN_BLAN)                       00022310
                ->  W01_HJELPE_IO,1,STG (EN_BLAN)) =  W01_IO;           00022320
            CALL    P010_LES_SEGM;                                      00022330
          END;                                                          00022340
                                                                        00022350
        WHEN ( 'OPPHBL1 ' )                                             00022360
          /* **************************************************** */    00022370
          /*  FÅTT INN :    O P P H B L 1                         */    00022380
          /* **************************************************** */    00022390
          DO;                                                           00022400
            SUBSTR (ADDR                (OPPHBL1)                       00022410
                ->  W01_HJELPE_IO,1,STG (OPPHBL1)) =  W01_IO;           00022420
            CALL    P010_LES_SEGM;                                      00022430
          END;                                                          00022440
                                                                        00022450
        WHEN ( 'OPPHBL2 ' )                                             00022460
          /* **************************************************** */    00022470
          /*  FÅTT INN :    O P P H B L 2                         */    00022480
          /* **************************************************** */    00022490
          DO;                                                           00022500
            SUBSTR (ADDR                (OPPHBL2)                       00022510
                ->  W01_HJELPE_IO,1,STG (OPPHBL2)) =  W01_IO;           00022520
            CALL    P010_LES_SEGM;                                      00022530
          END;                                                          00022540
                                                                        00022550
        WHEN ( 'BARN    ' )                                             00022560
          /* **************************************************** */    00022570
          /*  FÅTT INN :    B A R N                               */    00022580
          /* **************************************************** */    00022590
          DO;                                                           00022600
            W01.BARN_IKKE_LEST                  =  '0'B;                00022610
          END;                                                          00022620
                                                                        00022630
        OTHERWISE                                                       00022640
          /* **************************************************** */    00022650
          /*  FÅTT INN : ET UKJENT SEGMENT                        */    00022660
          /* **************************************************** */    00022670
          DO;                                                           00022680
  L105:                                                                 00022690
            FEIL_MELD_NR                        =  500;                 00022700
            FEIL_VED_LABEL                      = '105';                00022710
            GO TO RETUR;                                                00022720
          END;                                                          00022730
                                                                        00022740
      END;/*   SELECT    :  VT1.SEGM_NAVN                       */      00022750
                                                                        00022760
    END;  /*   DO WHILE  (  W01.MER_DATA & W01.BARN_IKKE_LEST ) */      00022770
                                                                        00022780
                                                                        00022790
    /* ************************************************************** */00022800
    /*                                                                */00022810
    /* SJEKKER OM ET TRANHIST-SEGM. ER LEST INN .                     */00022820
    /* ER DET DET OVERFØRES OPPLYSNINGENE TIL BLANKETTEN .            */00022830
    /*                                                                */00022840
    /* HVIS IKKE SJEKKES OM DET LEST INN NOEN I POS 1,2,3 I B02       */00022850
    /* ER DET IKKE DET BLANKES DEN OPPDATERTE POS 14 I B02 .          */00022860
    /*                                                                */00022870
    /* ************************************************************** */00022880
                                                                        00022890
                                                                        00022900
    IF TRANHIST.REGDATO_ÅMD        >        0     THEN                  00022910
       CALL    P40_OVERFØR_TIL_BLANKETT;                                00022920
    ELSE                                                                00022930
                                                                        00022940
       B02.RF0PERSN.FNR (14)   =        0;                              00022950
                                                                        00022960
 RETUR:                                                                 00022970
                                                                        00022980
                                                                        00022990
   END FLYTT_BASEDATA_TIL_BILDE_OMR;                                    00023000
                                                                        00023010
                                                                        00023020
    %PAGE;                                                              00023030
    /* ************************************************************** */00023040
    /*                                                                */00023050
    /* PROCEDURE FOR LESE ROT-SEGM GU QUAL.                           */00023060
    /*                                                                */00023070
    /* ************************************************************** */00023080
                                                                        00023090
    P005_LES_ROT_QUAL:                                                  00023100
      PROC;                                                             00023110
                                                                        00023120
      CALL PLITDLI                              (W02_PARM_CT_4,         00023130
                                                 W02_GET,               00023140
                                                 VT1,                   00023150
                                                 W01_IO,                00023160
                                                 SSA1_VT0PERSN);        00023170
                                                                        00023180
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00023190
        DO;                                                             00023200
          SELECT  ( VT1.STATUS_KODE );                                  00023210
                                                                        00023220
            WHEN  ( '  ' )                                              00023230
              W01.MER_DATA                 =    '1'B;                   00023240
                                                                        00023250
            WHEN  ( 'GE' )                                              00023260
              W01.MER_DATA                 =    '0'B;                   00023270
                                                                        00023280
            OTHERWISE                                                   00023290
              DO;                                                       00023300
                /* ************************************************** */00023310
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00023320
                /* ************************************************** */00023330
  L210:                                                                 00023340
                FEIL_MELD_NR               =     500;                   00023350
                FEIL_VED_LABEL             =    '210';                  00023360
                DB_STATUS_KODE             =     VT1.STATUS_KODE;       00023370
                W01.MER_DATA               =    '0'B;                   00023380
              END;                                                      00023390
          END;                                                          00023400
        END;                                                            00023410
      ELSE                                                              00023420
        DO;                                                             00023430
          /* ************************************************** */      00023440
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00023450
          /* ************************************************** */      00023460
  L220:                                                                 00023470
          FEIL_MELD_NR               =     500;                         00023480
          FEIL_VED_LABEL             =    '220';                        00023490
          W01.MER_DATA               =    '0'B;                         00023500
        END;                                                            00023510
    END P005_LES_ROT_QUAL;                                              00023520
                                                                        00023530
                                                                        00023540
                                                                        00023550
    %PAGE;                                                              00023560
    /* ************************************************************** */00023570
    /*                                                                */00023580
    /* PROCEDURE FOR LESE ROT-SEGM  GN UQUAL.                         */00023590
    /*                                                                */00023600
    /* ************************************************************** */00023610
                                                                        00023620
    P005_LES_ROT_UQUAL:                                                 00023630
      PROC;                                                             00023640
                                                                        00023650
      CALL PLITDLI                              (W02_PARM_CT_4,         00023660
                                                 W02_GET,               00023670
                                                 VT1,                   00023680
                                                 W01_IO,                00023690
                                                 SSA_UQUAL_ROT);        00023700
                                                                        00023710
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00023720
        DO;                                                             00023730
          SELECT  ( VT1.STATUS_KODE );                                  00023740
                                                                        00023750
            WHEN  ( '  ' )                                              00023760
              W01.MER_DATA                 =    '1'B;                   00023770
                                                                        00023780
            WHEN  ( 'GB' )                                              00023790
              W01.MER_DATA                 =    '0'B;                   00023800
                                                                        00023810
            OTHERWISE                                                   00023820
              DO;                                                       00023830
                /* ************************************************** */00023840
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00023850
                /* ************************************************** */00023860
  L230:                                                                 00023870
                FEIL_MELD_NR               =     500;                   00023880
                FEIL_VED_LABEL             =    '230';                  00023890
                DB_STATUS_KODE             =     VT1.STATUS_KODE;       00023900
                W01.MER_DATA               =    '0'B;                   00023910
              END;                                                      00023920
          END;                                                          00023930
        END;                                                            00023940
      ELSE                                                              00023950
        DO;                                                             00023960
          /* ************************************************** */      00023970
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00023980
          /* ************************************************** */      00023990
  L240:                                                                 00024000
          FEIL_MELD_NR               =     500;                         00024010
          FEIL_VED_LABEL             =    '240';                        00024020
          W01.MER_DATA               =    '0'B;                         00024030
        END;                                                            00024040
    END P005_LES_ROT_UQUAL;                                             00024050
                                                                        00024060
                                                                        00024070
    /* ************************************************************** */00024080
    /*                                                                */00024090
    /* PROCEDURE FOR LESE NESTE SEGMENT UNDER TRANHIST                */00024100
    /*                                                                */00024110
    /* ************************************************************** */00024120
                                                                        00024130
    P010_LES_SEGM:                                                      00024140
      PROC;                                                             00024150
                                                                        00024160
      CALL PLITDLI                              (W02_PARM_CT_3,         00024170
                                                 W02_GNP,               00024180
                                                 VT1,                   00024190
                                                 W01_IO);               00024200
                                                                        00024210
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00024220
        DO;                                                             00024230
          SELECT ( VT1.STATUS_KODE );                                   00024240
            WHEN ( '  ' , 'GA' , 'GK' )                                 00024250
              DO;                                                       00024260
                     W01.MER_DATA                 =    '1'B;            00024270
              END;                                                      00024280
            WHEN ( 'GE' , 'GB' )                                        00024290
              DO;                                                       00024300
                  W01.MER_DATA                 =    '0'B;               00024310
              END;                                                      00024320
            OTHERWISE                                                   00024330
              DO;                                                       00024340
                /* ************************************************** */00024350
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00024360
                /* ************************************************** */00024370
  L130:                                                                 00024380
                FEIL_MELD_NR               =     500;                   00024390
                FEIL_VED_LABEL             =    '130';                  00024400
                DB_STATUS_KODE             =     VT1.STATUS_KODE;       00024410
                W01.MER_DATA               =    '0'B;                   00024420
              END;                                                      00024430
          END;                                                          00024440
        END;                                                            00024450
      ELSE                                                              00024460
        DO;                                                             00024470
          /* ************************************************** */      00024480
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00024490
          /* ************************************************** */      00024500
  L140:                                                                 00024510
          FEIL_MELD_NR               =     500;                         00024520
          FEIL_VED_LABEL             =    '140';                        00024530
          W01.MER_DATA               =    '0'B;                         00024540
        END;                                                            00024550
    END P010_LES_SEGM;                                                  00024560
                                                                        00024570
                                                                        00024580
                                                                        00024590
    /* ************************************************************** */00024600
    /*                                                                */00024610
    /* PROCEDURE FOR LESE NESTE TRANHIST (GN    UKVALIFISERT  )       */00024620
    /*                                                                */00024630
    /* ************************************************************** */00024640
                                                                        00024650
    P020_LES_NESTE_TRANHIST:                                            00024660
      PROC;                                                             00024670
                                                                        00024680
      CALL PLITDLI                              (W02_PARM_CT_4,         00024690
                                                 W02_GNP,               00024700
                                                 VT1,                   00024710
                                                 W01_IO,                00024720
                                                 SSA1_TRANHIST_CMD);    00024730
                 /* ENDERET SATISH 10.10.95      SSA_UQUAL_TRANHIST); */00024740
                                                                        00024750
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00024760
        DO;                                                             00024770
          SELECT ( VT1.STATUS_KODE );                                   00024780
                                                                        00024790
            WHEN ( '  ' )                                               00024800
              W01.MER_DATA                 =    '1'B;                   00024810
                                                                        00024820
            WHEN ( 'GE' , 'GB' )                                        00024830
              W01.MER_DATA                 =    '0'B;                   00024840
                                                                        00024850
            OTHERWISE                                                   00024860
              DO;                                                       00024870
                /* ************************************************** */00024880
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00024890
                /* ************************************************** */00024900
  L150:                                                                 00024910
                FEIL_MELD_NR               =     500;                   00024920
                FEIL_VED_LABEL             =    '150';                  00024930
                DB_STATUS_KODE             =     VT1.STATUS_KODE;       00024940
                W01.MER_DATA               =    '0'B;                   00024950
              END;                                                      00024960
          END;                                                          00024970
        END;                                                            00024980
      ELSE                                                              00024990
        DO;                                                             00025000
          /* ************************************************** */      00025010
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00025020
          /* ************************************************** */      00025030
  L160:                                                                 00025040
          FEIL_MELD_NR               =     500;                         00025050
          FEIL_VED_LABEL             =    '160';                        00025060
          W01.MER_DATA               =    '0'B;                         00025070
        END;                                                            00025080
    END P020_LES_NESTE_TRANHIST;                                        00025090
                                                                        00025100
                                                                        00025110
                                                                        00025120
                                                                        00025130
    /* ************************************************************ */  00025140
    /*                                                              */  00025150
    /*  LESER NESTE TRANS MED :         REGDATO  <  OPPGITT DATO    */  00025160
    /*                                                              */  00025170
    /* ************************************************************ */  00025180
                                                                        00025190
    P030_LES_TRANHIST_GNP_QUAL_REG:                                     00025200
      PROC;                                                             00025210
                                                                        00025220
      CALL PLITDLI                              (W02_PARM_CT_4,         00025230
                                                 W02_GNP,               00025240
                                                 VT1,                   00025250
                                                 W01_IO,                00025260
                                                 SSA1_TRANHIST);        00025270
                                                                        00025280
      IF   UIBFCTR                        ^=     UIB_RC_OK    THEN      00025290
        DO;                                                             00025300
          /* ************************************************** */      00025310
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00025320
          /* ************************************************** */      00025330
  L170:                                                                 00025340
          FEIL_MELD_NR               =     500;                         00025350
          FEIL_VED_LABEL             =    '170';                        00025360
          W01.MER_DATA               =    '0'B;                         00025370
          GO   TO  RETUR;                                               00025380
        END;                                                            00025390
                                                                        00025400
      SELECT ( VT1.STATUS_KODE );                                       00025410
                                                                        00025420
        WHEN ( '  ' )                                                   00025430
          DO;                                                           00025440
            /* ************************************** */                00025450
            /*  TRANHIST FUNNET.                      */                00025460
            /* ************************************** */                00025470
                                                                        00025480
            W01.MER_DATA                   =    '1'B;                   00025490
          END;                                                          00025500
                                                                        00025510
        WHEN ( 'GE' , 'GB' )                                            00025520
          DO;                                                           00025530
            /* ************************************** */                00025540
            /*  FINNES INGEN TRANS                    */                00025550
            /* ************************************** */                00025560
                                                                        00025570
            W01.MER_DATA         =   '0'B;                              00025580
          END;                                                          00025590
                                                                        00025600
        OTHERWISE                                                       00025610
          DO;                                                           00025620
            /* ************************************************** */    00025630
            /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */    00025640
            /* ************************************************** */    00025650
                                                                        00025660
  L180:                                                                 00025670
            FEIL_MELD_NR               =     500;                       00025680
            FEIL_VED_LABEL             =    '180';                      00025690
            W01.MER_DATA               =    '0'B;                       00025700
          END;                                                          00025710
                                                                        00025720
      END;  /*      SELECT  (VT1.STATUS_KODE)                      */   00025730
                                                                        00025740
  RETUR:                                                                00025750
    END P030_LES_TRANHIST_GNP_QUAL_REG;                                 00025760
                                                                        00025770
                                                                        00025780
                                                                        00025790
    /* ************************************************************ */  00025800
    /*                                                              */  00025810
    /*  LESER NESTE TRANS MED :         VTPKEY = 9999 - VDATO.      */  00025820
    /*                                                              */  00025830
    /* ************************************************************ */  00025840
                                                                        00025850
    P030_LES_TRANHIST_GN_QUAL_VTP:                                      00025860
      PROC;                                                             00025870
                                                                        00025880
      CALL PLITDLI                              (W02_PARM_CT_5,         00025890
                                                 W02_GN,                00025900
                                                 VT1,                   00025910
                                                 W01_IO,                00025920
                                                 SSA1_VT0PERSN,         00025930
                                                 SSA3_TRANHIST);        00025940
                                                                        00025950
      IF   UIBFCTR                        ^=     UIB_RC_OK    THEN      00025960
        DO;                                                             00025970
          /* ************************************************** */      00025980
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00025990
          /* ************************************************** */      00026000
  L190:                                                                 00026010
          FEIL_MELD_NR               =     500;                         00026020
          FEIL_VED_LABEL             =    '190';                        00026030
          W01.MER_DATA               =    '0'B;                         00026040
          GO   TO  RETUR;                                               00026050
        END;                                                            00026060
                                                                        00026070
      SELECT ( VT1.STATUS_KODE );                                       00026080
                                                                        00026090
        WHEN ( '  ' )                                                   00026100
          DO;                                                           00026110
            /* ************************************** */                00026120
            /*  ØNSKET TRANHIST FUNNET.               */                00026130
            /* ************************************** */                00026140
                                                                        00026150
            W01.MER_DATA                   =    '1'B;                   00026160
          END;                                                          00026170
                                                                        00026180
        WHEN ( 'GE' , 'GB' )                                            00026190
          DO;                                                           00026200
            /* ************************************** */                00026210
            /*  FINNES INGEN TRANS                    */                00026220
            /* ************************************** */                00026230
                                                                        00026240
            W01.MER_DATA         =   '0'B;                              00026250
          END;                                                          00026260
                                                                        00026270
        OTHERWISE                                                       00026280
          DO;                                                           00026290
            /* ************************************************** */    00026300
            /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */    00026310
            /* ************************************************** */    00026320
                                                                        00026330
  L195:                                                                 00026340
            FEIL_MELD_NR               =     500;                       00026350
            FEIL_VED_LABEL             =    '195';                      00026360
            W01.MER_DATA               =    '0'B;                       00026370
          END;                                                          00026380
                                                                        00026390
      END;  /*      SELECT  (VT1.STATUS_KODE)                      */   00026400
                                                                        00026410
  RETUR:                                                                00026420
    END P030_LES_TRANHIST_GN_QUAL_VTP;                                  00026430
                                                                        00026440
                                                                        00026450
                                                                        00026460
    /* ********************************************************* */     00026470
    /*                                                           */     00026480
    /* *****  PROC SOM KALLER RIKTIG BLANKETT-OMRÅDET  *******   */     00026490
    /*                                                           */     00026500
    /* ********************************************************* */     00026510
                                                                        00026520
    P40_OVERFØR_TIL_BLANKETT:                                           00026530
      PROC;                                                             00026540
                                                                        00026550
                                                                        00026560
      W01.VIRK_DATO_ÅM                  =  TRANHIST.VIRK_DATO_ÅM    ;   00026570
      TRANS_OPPL_OMR.FØDSNUMMER         =  SEARCH_FNR               ;   00026580
      TRANS_OPPL_OMR.BLANKETTYPE        =  TRANHIST.GRBLKODE        ;   00026590
      TRANS_OPPL_OMR.VIRKNINGSDATO      =  F_SNU_DATO                   00026600
                                            (W01.VIRK_DATO_ÅM)      ;   00026610
                                                                        00026620
      SELECT ( TRANHIST.GRBLKODE );                                     00026630
                                                                        00026640
        WHEN ( 'AP' )                                                   00026650
          /* **************************************************** */    00026660
          /*  ALDERSPENSJON                                       */    00026670
          /* **************************************************** */    00026680
          DO;                                                           00026690
             CALL P050_LES_AP_TRANS;                                    00026700
                                                                        00026710
             IF   FEIL_MELD_NR              >      0       THEN         00026720
               DO;                                                      00026730
                  /* ******************************************** */    00026740
                  /* FEIL VED SKRIV AV :  TRANS                   */    00026750
                  /* ******************************************** */    00026760
                                                                        00026770
                  GO TO RETUR;                                          00026780
               END;                                                     00026790
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R051';                      00026800
          END;                                                          00026810
                                                                        00026820
        WHEN ( 'A1' )                                                   00026830
          /* **************************************************** */    00026840
          /*  ALDERSPENSJON                                       */    00026850
          /* **************************************************** */    00026860
          DO;                                                           00026870
             CALL P050_LES_A1_TRANS;                                    00026880
                                                                        00026890
             IF   FEIL_MELD_NR              >      0       THEN         00026900
               DO;                                                      00026910
                  /* ******************************************** */    00026920
                  /* FEIL VED SKRIV AV :  TRANS                   */    00026930
                  /* ******************************************** */    00026940
                                                                        00026950
                  GO TO RETUR;                                          00026960
               END;                                                     00026970
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RN51';                      00026980
          END;                                                          00026990
                                                                        00027000
        WHEN ( 'UP' )                                                   00027010
          /* **************************************************** */    00027020
          /*  UFØREPENSJON                                        */    00027030
          /* **************************************************** */    00027040
          DO;                                                           00027050
             CALL P060_LES_UP_TRANS;                                    00027060
                                                                        00027070
             IF   FEIL_MELD_NR              >      0       THEN         00027080
               DO;                                                      00027090
                  /* ******************************************** */    00027100
                  /* FEIL VED SKRIV AV TRANS                      */    00027110
                  /* ******************************************** */    00027120
                                                                        00027130
                  GO TO RETUR;                                          00027140
               END;                                                     00027150
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R061';                      00027160
          END;                                                          00027170
                                                                        00027180
        WHEN ( 'U2' )                                                   00027190
          /* **************************************************** */    00027200
          /*  UFØREPENSJON                                        */    00027210
          /* **************************************************** */    00027220
          DO;                                                           00027230
             CALL P060_LES_U2_TRANS;                                    00027240
                                                                        00027250
             IF   FEIL_MELD_NR              >      0       THEN         00027260
               DO;                                                      00027270
                  /* ******************************************** */    00027280
                  /* FEIL VED SKRIV AV TRANS                      */    00027290
                  /* ******************************************** */    00027300
                                                                        00027310
                  GO TO RETUR;                                          00027320
               END;                                                     00027330
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RN61';                      00027340
          END;                                                          00027350
                                                                        00027360
        WHEN ( 'U3' )                                                   00027370
          /* **************************************************** */    00027380
          /*  UFØREPENSJON                                        */    00027390
          /* **************************************************** */    00027400
          DO;                                                           00027410
             CALL P060_LES_U3_TRANS;                                    00027420
                                                                        00027430
             IF   FEIL_MELD_NR              >      0       THEN         00027440
               DO;                                                      00027450
                  /* ******************************************** */    00027460
                  /* FEIL VED SKRIV AV TRANS                      */    00027470
                  /* ******************************************** */    00027480
                                                                        00027490
                  GO TO RETUR;                                          00027500
               END;                                                     00027510
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RU61';                      00027520
          END;                                                          00027530
                                                                        00027540
        WHEN ( 'UF' )                                                   00027550
          /* **************************************************** */    00027560
          /*  UFØREPENSJON                                        */    00027570
          /* **************************************************** */    00027580
          DO;                                                           00027590
             CALL P183_LES_UF_TRANS;                                    00027600
                                                                        00027610
             IF   FEIL_MELD_NR              >      0       THEN         00027620
               DO;                                                      00027630
                  /* ******************************************** */    00027640
                  /* FEIL VED SKRIV AV TRANS                      */    00027650
                  /* ******************************************** */    00027660
                                                                        00027670
                  GO TO RETUR;                                          00027680
               END;                                                     00027690
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R183';                      00027700
          END;                                                          00027710
                                                                        00027720
        WHEN ( 'US' )                                                   00027730
          /* **************************************************** */    00027740
          /*                                                      */    00027750
          /* **************************************************** */    00027760
          DO;                                                           00027770
             CALL P070_LES_US_TRANS;                                    00027780
                                                                        00027790
             IF   FEIL_MELD_NR              >      0       THEN         00027800
               DO;                                                      00027810
                  /* ******************************************** */    00027820
                  /* FEIL VED SKRIV AV TRANS                      */    00027830
                  /* ******************************************** */    00027840
                                                                        00027850
                  GO TO RETUR;                                          00027860
               END;                                                     00027870
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R071';                      00027880
          END;                                                          00027890
                                                                        00027900
        WHEN ( 'EP' )                                                   00027910
          /* **************************************************** */    00027920
          /*  ETTERLATT-PENSJON                                   */    00027930
          /* **************************************************** */    00027940
          DO;                                                           00027950
             CALL P080_LES_EP_TRANS;                                    00027960
                                                                        00027970
             IF   FEIL_MELD_NR              >      0       THEN         00027980
               DO;                                                      00027990
                  /* ******************************************** */    00028000
                  /* FEIL VED SKRIV AV TRANS                      */    00028010
                  /* ******************************************** */    00028020
                                                                        00028030
                  GO TO RETUR;                                          00028040
               END;                                                     00028050
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R081';                      00028060
          END;                                                          00028070
                                                                        00028080
        WHEN ( 'E3' )                                                   00028090
          /* **************************************************** */    00028100
          /*  ETTERLATT-PENSJON                                   */    00028110
          /* **************************************************** */    00028120
          DO;                                                           00028130
             CALL P080_LES_E3_TRANS;                                    00028140
                                                                        00028150
             IF   FEIL_MELD_NR              >      0       THEN         00028160
               DO;                                                      00028170
                  /* ******************************************** */    00028180
                  /* FEIL VED SKRIV AV TRANS                      */    00028190
                  /* ******************************************** */    00028200
                                                                        00028210
                  GO TO RETUR;                                          00028220
               END;                                                     00028230
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RN81';                      00028240
          END;                                                          00028250
                                                                        00028260
        WHEN ( 'EE' )                                                   00028270
          /* **************************************************** */    00028280
          /*  ETTERLATT-PENSJON                                   */    00028290
          /* **************************************************** */    00028300
          DO;                                                           00028310
             CALL P080_LES_EE_TRANS;                                    00028320
                                                                        00028330
             IF   FEIL_MELD_NR              >      0       THEN         00028340
               DO;                                                      00028350
                  /* ******************************************** */    00028360
                  /* FEIL VED SKRIV AV TRANS                      */    00028370
                  /* ******************************************** */    00028380
                                                                        00028390
                  GO TO RETUR;                                          00028400
               END;                                                     00028410
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RU81';                      00028420
          END;                                                          00028430
                                                                        00028440
        WHEN ( 'EF' )                                                   00028450
          /* **************************************************** */    00028460
          /*  ETTERLATT FAMILIEPLEIER                             */    00028470
          /* **************************************************** */    00028480
          DO;                                                           00028490
             CALL P090_LES_EF_TRANS;                                    00028500
                                                                        00028510
             IF   FEIL_MELD_NR              >      0       THEN         00028520
               DO;                                                      00028530
                  /* ******************************************** */    00028540
                  /* FEIL VED SKRIV AV TRANS                      */    00028550
                  /* ******************************************** */    00028560
                                                                        00028570
                  GO TO RETUR;                                          00028580
               END;                                                     00028590
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R091';                      00028600
          END;                                                          00028610
                                                                        00028620
        WHEN ( 'E4' )                                                   00028630
          /* **************************************************** */    00028640
          /*  ETTERLATT FAMILIEPLEIER                             */    00028650
          /* **************************************************** */    00028660
          DO;                                                           00028670
             CALL P090_LES_E4_TRANS;                                    00028680
                                                                        00028690
             IF   FEIL_MELD_NR              >      0       THEN         00028700
               DO;                                                      00028710
                  /* ******************************************** */    00028720
                  /* FEIL VED SKRIV AV TRANS                      */    00028730
                  /* ******************************************** */    00028740
                                                                        00028750
                  GO TO RETUR;                                          00028760
               END;                                                     00028770
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RN91';                      00028780
          END;                                                          00028790
                                                                        00028800
        WHEN ( 'FB' )                                                   00028810
          /* **************************************************** */    00028820
          /*  FORELDRELØSE BARN                                   */    00028830
          /* **************************************************** */    00028840
          DO;                                                           00028850
             CALL P100_LES_FB_TRANS;                                    00028860
                                                                        00028870
             IF   FEIL_MELD_NR              >      0       THEN         00028880
               DO;                                                      00028890
                  /* ******************************************** */    00028900
                  /* FEIL VED SKRIV AV TRANS                      */    00028910
                  /* ******************************************** */    00028920
                                                                        00028930
                  GO TO RETUR;                                          00028940
               END;                                                     00028950
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R101';                      00028960
          END;                                                          00028970
                                                                        00028980
                                                                        00028990
        WHEN ( 'BP' )                                                   00029000
          /* **************************************************** */    00029010
          /*  BANEPENSJONIST                                      */    00029020
          /* **************************************************** */    00029030
          DO;                                                           00029040
             CALL P110_LES_BP_TRANS;                                    00029050
                                                                        00029060
             IF   FEIL_MELD_NR              >      0       THEN         00029070
               DO;                                                      00029080
                  /* ******************************************** */    00029090
                  /* FEIL VED SKRIV AV TRANS                      */    00029100
                  /* ******************************************** */    00029110
                                                                        00029120
                  GO TO RETUR;                                          00029130
               END;                                                     00029140
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R111';                      00029150
          END;                                                          00029160
                                                                        00029170
        WHEN ( 'B6' )                                                   00029180
          /* **************************************************** */    00029190
          /*  BANEPENSJONIST                                      */    00029200
          /* **************************************************** */    00029210
          DO;                                                           00029220
             CALL P110_LES_B6_TRANS;                                    00029230
                                                                        00029240
             IF   FEIL_MELD_NR              >      0       THEN         00029250
               DO;                                                      00029260
                  /* ******************************************** */    00029270
                  /* FEIL VED SKRIV AV TRANS                      */    00029280
                  /* ******************************************** */    00029290
                                                                        00029300
                  GO TO RETUR;                                          00029310
               END;                                                     00029320
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RNB1';                      00029330
          END;                                                          00029340
                                                                        00029350
        WHEN ( 'FT' )                                                   00029360
          /* **************************************************** */    00029370
          /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */    00029380
          /* **************************************************** */    00029390
          DO;                                                           00029400
             CALL P120_LES_FT_TRANS;                                    00029410
                                                                        00029420
             IF   FEIL_MELD_NR              >      0       THEN         00029430
               DO;                                                      00029440
                  /* ******************************************** */    00029450
                  /* FEIL VED SKRIV AV TRANS                      */    00029460
                  /* ******************************************** */    00029470
                                                                        00029480
                  GO TO RETUR;                                          00029490
               END;                                                     00029500
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R121';                      00029510
          END;                                                          00029520
                                                                        00029530
        WHEN ( 'F7' )                                                   00029540
          /* **************************************************** */    00029550
          /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */    00029560
          /* **************************************************** */    00029570
          DO;                                                           00029580
             CALL P120_LES_F7_TRANS;                                    00029590
                                                                        00029600
             IF   FEIL_MELD_NR              >      0       THEN         00029610
               DO;                                                      00029620
                  /* ******************************************** */    00029630
                  /* FEIL VED SKRIV AV TRANS                      */    00029640
                  /* ******************************************** */    00029650
                                                                        00029660
                  GO TO RETUR;                                          00029670
               END;                                                     00029680
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RNC1';                      00029690
          END;                                                          00029700
                                                                        00029710
        WHEN ( 'FO' )                                                   00029720
          /* **************************************************** */    00029730
          /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */    00029740
          /* **************************************************** */    00029750
          DO;                                                           00029760
             CALL P120_LES_FO_TRANS;                                    00029770
                                                                        00029780
             IF   FEIL_MELD_NR              >      0       THEN         00029790
               DO;                                                      00029800
                  /* ******************************************** */    00029810
                  /* FEIL VED SKRIV AV TRANS                      */    00029820
                  /* ******************************************** */    00029830
                                                                        00029840
                  GO TO RETUR;                                          00029850
               END;                                                     00029860
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RUC1';                      00029870
          END;                                                          00029880
                                                                        00029890
        WHEN ( 'E1' )                                                   00029900
          /* **************************************************** */    00029910
          /*  ENDRINGSBLANKETT                                    */    00029920
          /* **************************************************** */    00029930
          DO;                                                           00029940
             CALL P140_LES_E1_TRANS;                                    00029950
                                                                        00029960
             IF   FEIL_MELD_NR              >      0       THEN         00029970
               DO;                                                      00029980
                  /* ******************************************** */    00029990
                  /* FEIL VED SKRIV AV TRANS                      */    00030000
                  /* ******************************************** */    00030010
                                                                        00030020
                  GO TO RETUR;                                          00030030
               END;                                                     00030040
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R141';                      00030050
          END;                                                          00030060
                                                                        00030070
        WHEN ( 'EN' )                                                   00030080
          /* **************************************************** */    00030090
          /*  ENDRINGSBLANKETT                                    */    00030100
          /* **************************************************** */    00030110
          DO;                                                           00030120
             CALL P140_LES_EN_TRANS;                                    00030130
                                                                        00030140
             IF   FEIL_MELD_NR              >      0       THEN         00030150
               DO;                                                      00030160
                  /* ******************************************** */    00030170
                  /* FEIL VED SKRIV AV TRANS                      */    00030180
                  /* ******************************************** */    00030190
                                                                        00030200
                  GO TO RETUR;                                          00030210
               END;                                                     00030220
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RUE1';                      00030230
          END;                                                          00030240
                                                                        00030250
        WHEN ( 'O1' )                                                   00030260
          /* **************************************************** */    00030270
          /*  OPPHØRSBLANKETT .   DØD                             */    00030280
          /* **************************************************** */    00030290
          DO;                                                           00030300
             CALL P160_LES_O1_TRANS;                                    00030310
                                                                        00030320
             IF   FEIL_MELD_NR              >      0       THEN         00030330
               DO;                                                      00030340
                  /* ******************************************** */    00030350
                  /* FEIL VED SKRIV AV TRANS                      */    00030360
                  /* ******************************************** */    00030370
                                                                        00030380
                  GO TO RETUR;                                          00030390
               END;                                                     00030400
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R161';                      00030410
          END;                                                          00030420
                                                                        00030430
        WHEN ( 'O2' )                                                   00030440
          /* **************************************************** */    00030450
          /*  ANDRE OPPHØRSÅRSAKER                                */    00030460
          /* **************************************************** */    00030470
          DO;                                                           00030480
             CALL P170_LES_O2_TRANS;                                    00030490
                                                                        00030500
             IF   FEIL_MELD_NR              >      0       THEN         00030510
               DO;                                                      00030520
                  /* ******************************************** */    00030530
                  /* FEIL VED SKRIV AV TRANS                      */    00030540
                  /* ******************************************** */    00030550
                                                                        00030560
                  GO TO RETUR;                                          00030570
               END;                                                     00030580
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R171';                      00030590
          END;                                                          00030600
        WHEN ( 'AF' )                                                   00030610
          /* **************************************************** */    00030620
          /*  AVTALEFESTET PENSJON (AFP)                          */    00030630
          /* **************************************************** */    00030640
          DO;                                                           00030650
             CALL P190_LES_AF_TRANS;                                    00030660
                                                                        00030670
             IF   FEIL_MELD_NR              >      0       THEN         00030680
               DO;                                                      00030690
                  /* ******************************************** */    00030700
                  /* FEIL VED SKRIV AV TRANS                      */    00030710
                  /* ******************************************** */    00030720
                                                                        00030730
                  GO TO RETUR;                                          00030740
               END;                                                     00030750
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R191';                      00030760
          END;                                                          00030770
        WHEN ( 'KF' )                                                   00030780
          /* **************************************************** */    00030790
          /*  AVTALEFESTET PENSJON (AFP)                          */    00030800
          /* **************************************************** */    00030810
          DO;                                                           00030820
             CALL P190_LES_KF_TRANS;                                    00030830
                                                                        00030840
             IF   FEIL_MELD_NR              >      0       THEN         00030850
               DO;                                                      00030860
                                                                        00030870
                  /* ******************************************** */    00030880
                  /* FEIL VED SKRIV AV TRANS                      */    00030890
                  /* ******************************************** */    00030900
                                                                        00030910
                  GO TO RETUR;                                          00030920
               END;                                                     00030930
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RUJ1';                      00030940
          END;                                                          00030950
                                                                        00030960
        OTHERWISE                                                       00030970
          /* **************************************************** */    00030980
          /*  FÅTT EN UKJENT TRANS-TYPE . KJØRING AVBRYTES        */    00030990
          /* **************************************************** */    00031000
          DO;                                                           00031010
   L190:                                                                00031020
             FEIL_MELD_NR           =   497;                            00031030
             FEIL_VED_LABEL         =  '190';                           00031040
          END;                                                          00031050
                                                                        00031060
      END;   /* *****      SELECT ( TRANSTYPE )            ****** */    00031070
                                                                        00031080
  RETUR:                                                                00031090
                                                                        00031100
  END P40_OVERFØR_TIL_BLANKETT;                                         00031110
                                                                        00031120
                                                                        00031130
  BLANKSTILL_VENTETRANS_LINJE:                                          00031140
     PROC;                                                              00031150
     SELECT(LINJENR);                                                   00031160
        WHEN(1)                                                         00031170
            DO;                                                         00031180
               S001482I.RDATO1I = LOW(6);                               00031190
               S001482I.BLT1I   = LOW(2);                               00031200
            END;                                                        00031210
        WHEN(2)                                                         00031220
            DO;                                                         00031230
               S001482I.RDATO2I = LOW(6);                               00031240
               S001482I.BLT2I   = LOW(2);                               00031250
            END;                                                        00031260
        WHEN(3)                                                         00031270
            DO;                                                         00031280
               S001482I.RDATO3I = LOW(6);                               00031290
               S001482I.BLT3I   = LOW(2);                               00031300
            END;                                                        00031310
        WHEN(4)                                                         00031320
            DO;                                                         00031330
               S001482I.RDATO4I = LOW(6);                               00031340
               S001482I.BLT4I   = LOW(2);                               00031350
            END;                                                        00031360
        WHEN(5)                                                         00031370
            DO;                                                         00031380
               S001482I.RDATO5I = LOW(6);                               00031390
               S001482I.BLT5I   = LOW(2);                               00031400
            END;                                                        00031410
        WHEN(6)                                                         00031420
            DO;                                                         00031430
               S001482I.RDATO6I = LOW(6);                               00031440
               S001482I.BLT6I   = LOW(2);                               00031450
            END;                                                        00031460
        WHEN(7)                                                         00031470
            DO;                                                         00031480
               S001482I.RDATO7I = LOW(6);                               00031490
               S001482I.BLT7I   = LOW(2);                               00031500
            END;                                                        00031510
        WHEN(8)                                                         00031520
            DO;                                                         00031530
               S001482I.RDATO8I = LOW(6);                               00031540
               S001482I.BLT8I   = LOW(2);                               00031550
            END;                                                        00031560
        WHEN(9)                                                         00031570
            DO;                                                         00031580
               S001482I.RDATO9I = LOW(6);                               00031590
               S001482I.BLT9I   = LOW(2);                               00031600
            END;                                                        00031610
        WHEN(10)                                                        00031620
            DO;                                                         00031630
               S001482I.RDATO10I = LOW(6);                              00031640
               S001482I.BLT10I   = LOW(2);                              00031650
            END;                                                        00031660
        WHEN(11)                                                        00031670
            DO;                                                         00031680
               S001482I.RDATO11I = LOW(6);                              00031690
               S001482I.BLT11I   = LOW(2);                              00031700
            END;                                                        00031710
        WHEN(12)                                                        00031720
            DO;                                                         00031730
               S001482I.RDATO12I = LOW(6);                              00031740
               S001482I.BLT12I   = LOW(2);                              00031750
            END;                                                        00031760
        WHEN(13)                                                        00031770
            DO;                                                         00031780
               S001482I.RDATO13I = LOW(6);                              00031790
               S001482I.BLT13I   = LOW(2);                              00031800
            END;                                                        00031810
        WHEN(14)                                                        00031820
            DO;                                                         00031830
               S001482I.RDATO14I = LOW(6);                              00031840
               S001482I.BLT14I   = LOW(2);                              00031850
            END;                                                        00031860
        OTHERWISE;                                                      00031870
     END;                                                               00031880
  END BLANKSTILL_VENTETRANS_LINJE;                                      00031890
                                                                        00031900
                                                                        00031910
  FJERN_VT_TRANS:                                                       00031920
     PROC;                                                              00031930
                                                                        00031940
  /* **************************************************************** */00031950
  /*HENSIKT:                                                          */00031960
  /*    FJERNER TRANHIST MED ØNSKET KEY.                              */00031970
  /*                                                                  */00031980
  /*                                                                  */00031990
  /*BRUK:                                                             */00032000
  /*    CALL FJERN_VT_TRANS;                                          */00032010
  /*                                                                  */00032020
  /* **************************************************************** */00032030
                                                                        00032040
                                                                        00032050
                                                                        00032060
  /***  ÅPNER VT_BASEN                            *********/            00032070
                                                                        00032080
                                                                        00032090
  IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                                 00032100
      CALL DATABASE('OPEN');                                            00032110
  ELSE                                                                  00032120
      UIBPTR     = PCB_UIB_PEKER_OMR.UIB_PEKER;                         00032130
                                                                        00032140
                                                                        00032150
  IF FEIL_MELD_NR > 0   THEN                                            00032160
     GO TO L999;                                                        00032170
                                                                        00032180
                                                                        00032190
                                                                        00032200
                                                                        00032210
                                                                        00032220
                                                                        00032230
    /* ************************************************************** */00032240
    /*                                                                */00032250
    /* TAR ET GHU-KALL,FØR DLET.                                      */00032260
    /*                                                                */00032270
    /* ************************************************************** */00032280
                                                                        00032290
    CALL PLITDLI                        (W02_PARM_CT_5,                 00032300
                                         W02_GHU,                       00032310
                                         VT1,                           00032320
                                         W01_IO,                        00032330
                                         SSA1_VT0PERSN,                 00032340
                                         SSA3_TRANHIST);                00032350
                                                                        00032360
    IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                      00032370
      ! VT1.STATUS_KODE         ^=       '  '         THEN              00032380
        DO;                                                             00032390
           /* ******************************************** */           00032400
           /* FEIL VED LES   AV :  TRANHIST                */           00032410
           /* ******************************************** */           00032420
  L110:                                                                 00032430
           FEIL_MELD_NR             =       500 ;                       00032440
           FEIL_VED_LABEL           =      '110';                       00032450
           DB_STATUS_KODE           =       VT1.STATUS_KODE;            00032460
           GO   TO  RETUR;                                              00032470
        END;                                                            00032480
                                                                        00032490
                                                                        00032500
        /* ******************************************** */              00032510
        /* KALLET GHU GIKK OK . DELETER TRANHIST.       */              00032520
        /* ******************************************** */              00032530
                                                                        00032540
    CALL PLITDLI                        (W02_PARM_CT_3,                 00032550
                                         W02_DLET,                      00032560
                                         VT1,                           00032570
                                         W01_IO);                       00032580
                                                                        00032590
    IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                      00032600
      ! VT1.STATUS_KODE         ^=       '  '         THEN              00032610
        DO;                                                             00032620
           /* ******************************************** */           00032630
           /* FEIL VED DELETE  AV :  TRANHIST              */           00032640
           /* ******************************************** */           00032650
  L120:                                                                 00032660
           FEIL_MELD_NR             =       500 ;                       00032670
           FEIL_VED_LABEL           =      '120';                       00032680
           GO   TO  RETUR;                                              00032690
        END;                                                            00032700
  RETUR:                                                                00032710
                                                                        00032720
                                                                        00032730
                                                                        00032740
  /*** LUKKER VT_BASEN                            *********/            00032750
                                                                        00032760
  CALL DATABASE('CLOSE');                                               00032770
                                                                        00032780
  IF FEIL_MELD_NR > 0   THEN                                            00032790
     GO TO L999;                                                        00032800
                                                                        00032810
                                                                        00032820
  END FJERN_VT_TRANS;                                                   00032830
                                                                        00032840
  OVER_OG_UT:                                                           00032850
     PROC(KODE);                                                        00032860
                                                                        00032870
  /* **************************************************************** */00032880
  /*HENSIKT:                                                          */00032890
  /*    HOPPER TIL ØNSKET FUNKSJON.     .                             */00032900
  /*                                                                  */00032910
  /*                                                                  */00032920
  /*BRUK:                                                             */00032930
  /*    CALL OVER_OG_UT;                                              */00032940
  /*                                                                  */00032950
  /* **************************************************************** */00032960
                                                                        00032970
                                                                        00032980
                                                                        00032990
     DCL KODE                 CHAR (1);                                 00033000
                                                                        00033010
     SELECT(KODE);                                                      00033020
        WHEN('E')                                                       00033030
          DO;                                                           00033040
             TRANSKODE = 'R045';                                        00033050
             ALLOCATE S00101EO ;                                        00033060
             S00101EO.CICS_INFOO = CICS_NAVN ;                          00033070
             EXEC CICS SEND MAP('S00101E') MAPSET('S001013')            00033080
                                           ERASE;                       00033090
          END;                                                          00033100
        WHEN('R')                                                       00033110
          DO;                                                           00033120
             TRANSKODE = 'R040';                                        00033130
             ALLOCATE S001014O ;                                        00033140
             S001014O.CICS_INFOO = CICS_NAVN ;                          00033150
             EXEC CICS SEND MAP('S001014') MAPSET('S001013')            00033160
                                           ERASE;                       00033170
          END;                                                          00033180
        WHEN('F')                                                       00033190
          DO;                                                           00033200
                                                                        00033210
             TRANSKODE       = 'F410';                                  00033220
                                                                        00033230
             ALLOCATE S001015O;                                         00033240
             S001015O.FNRO              = DIV_PARAM_OMR.SEARCH_FNR;     00033250
             S001015O.CICS_INFOO        = CICS_NAVN ;                   00033260
                                                                        00033270
            /*---------------------------------------------------*/     00033280
            /* SJEKKER FNR OG NULLSTILLER DERSOM UGYLDIG         */     00033290
            /*---------------------------------------------------*/     00033300
                                                                        00033310
             IF ^F_GYLDIG_FNR(S001015O.FNRO) THEN                       00033320
                DO;                                                     00033330
                   S001015I.FNRI = LOW(11) ;                            00033340
                   S001015I.FNRL =  -1  ;                               00033350
                END;                                                    00033360
                                                                        00033370
             ELSE                                                       00033380
                DO;                                                     00033390
                   S001015O.OPPLYSNINGSTYPEO  =  'S' ;                  00033400
                   S001015I.FNRL =  -1  ;                               00033410
                END;                                                    00033420
                                                                        00033430
            /*---------------------------------------------------*/     00033440
            /* SKRIVER UT FORESPØRSEL-BILDET M/ OVERFØRT FNR     */     00033450
            /*---------------------------------------------------*/     00033460
                                                                        00033470
             EXEC CICS SEND MAP('S001015') MAPSET('S001013')            00033480
                                           CURSOR  ERASE;               00033490
                                                                        00033500
          END;                                                          00033510
                                                                        00033520
        WHEN('I')                                                       00033530
          DO;                                                           00033540
               IF STYRINGS_OMR.BRUKERID ^= 'TEST' THEN                  00033550
                  DO;                                                   00033560
                     IF SUBSTR(DIV_PARAM_OMR.CICS_NAVN,1,4 ) =          00033570
                                                            'HELP' THEN 00033580
                        W01_IDENT_5                = 'H';               00033590
                      ELSE                                              00033600
                        W01_IDENT_5                = ' ';               00033610
                                                                        00033620
                     W01_IDENT_1_4       = STYRINGS_OMR.BRUKERID;       00033630
                     IDENT_PEKER         = ADDR(W01_IDENT);             00033640
                     EXEC CICS READ DATASET ('FUNKTAD')                 00033650
                                    INTO    (FUNKTAD)                   00033660
                                    RIDFLD  (IDENT_BIT);                00033670
                  END;                                                  00033680
               IF SUBSTR(FUNKSJON,4,1) = 'I' !                          00033690
                  STYRINGS_OMR.BRUKERID = 'TEST' THEN                   00033700
                  DO;                                                   00033710
                                                                        00033720
               /* SKRIVER MENY-SKJERMBILDE FOR JUSTERING AV */          00033730
               /* INNTEKTER                                 */          00033740
                                                                        00033750
                     TRANSKODE = 'R0I1';                                00033760
                     EXEC CICS SEND MAP('S001I01') MAPSET('S001I13')    00033770
                                                       MAPONLY ERASE;   00033780
                  END;                                                  00033790
              ELSE                                                      00033800
                 DO;                                                    00033810
             /* SKRIVER BILDE FOR FUNKSJONSVALG */                      00033820
                                                                        00033830
                    EXEC CICS SEND MAP('S001013')                       00033840
                                                       MAPSET('S001013')00033850
                                                  MAPONLY SET(BMSMAPBR);00033860
                    ALLOCATE S001013O;                                  00033870
                                                                        00033880
                    S001013O.MELDINGO = 'BRUKERID IKKE ' !!             00033890
                                               'AUTORISERT FOR "I".';   00033900
                    S001013O.FUNKSJONSKODEA =                           00033910
                                          'I'; /* MDT SET, HIGH INT  */ 00033920
                    S001013I.FUNKSJONSKODEL = -1;                       00033930
                                                                        00033940
                    S001013O.FUNKSJONSKODEO = FUNKSJONSKODE;            00033950
                                                                        00033960
             /* SKRIVER FEILMELDING PÅ BILDE FOR FUNKSJONSVALG */       00033970
                                                                        00033980
                    EXEC CICS SEND MAP('S001013')                       00033990
                                        MAPSET('S001013') ERASE CURSOR; 00034000
                    TRANSKODE = 'R030';                                 00034010
                 END;                                                   00034020
          END;                                                          00034030
        WHEN('V')                                                       00034040
          DO;                                                           00034050
             IF B02.STATUS.VIRK_DATO_ÅM(13) > 0 !                       00034060
                B02.STATUS.DØDSDATO_ÅMD(13) > 0 THEN                    00034070
                DO;                                                     00034080
                   TRANSKODE = 'R48A';                                  00034090
                   CALL DATABASE('CLOSE');                              00034100
                   EXEC CICS XCTL PROGRAM('R0010480')                   00034110
                                                 COMMAREA(KOM_OMR);     00034120
                END;                                                    00034130
             ELSE                                                       00034140
                DO;                                                     00034150
                   TRANSKODE = 'R048';                                  00034160
                   ALLOCATE S001481O ;                                  00034170
                   S001481O.CICS_INFOO = CICS_NAVN ;                    00034180
                   EXEC CICS SEND MAP('S001481') MAPSET('S001V13')      00034190
                                                   MAPONLY ERASE;       00034200
                END;                                                    00034210
          END;                                                          00034220
        WHEN('X')                                                       00034230
          DO;                                                           00034240
             EXEC CICS SEND MAP('S001012') MAPSET('S001013')            00034250
                                                       MAPONLY ERASE;   00034260
             EXEC CICS RETURN ;                                         00034270
          END;                                                          00034280
        OTHERWISE                                                       00034290
          DO;                                                           00034300
             EXEC CICS SEND MAP('S001013')                              00034310
                                                       MAPSET('S001013')00034320
                                                  MAPONLY SET(BMSMAPBR);00034330
             ALLOCATE S001013O;                                         00034340
                                                                        00034350
             S001013O.MELDINGO =                                        00034360
                                              'UGYLDIG FUNKSJONSKODE';  00034370
             S001013O.FUNKSJONSKODEA =                                  00034380
                                          'I'; /* MDT SET, HIGH INT  */ 00034390
             S001013I.FUNKSJONSKODEL = -1;                              00034400
                                                                        00034410
             S001013O.FUNKSJONSKODEO = FUNKSJONSKODE;                   00034420
                                                                        00034430
             S001013O.CICS_INFOO     = CICS_NAVN    ;                   00034440
                                                                        00034450
             EXEC CICS SEND MAP('S001013')                              00034460
                                     MAPSET('S001013') ERASE CURSOR;    00034470
             TRANSKODE = 'R030';                                        00034480
                                                                        00034490
          END;                                                          00034500
     END;                                                               00034510
                                                                        00034520
     CALL DATABASE('CLOSE');                                            00034530
                                                                        00034540
     EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);             00034550
                                                                        00034560
                                                                        00034570
                                                                        00034580
  END OVER_OG_UT;                                                       00034590
                                                                        00034600
                                                                        00034610
                                                                        00034620
                                                                        00034630
                                                                        00034640
                                                                        00034650
                                                                        00034660
  SSA_BEHANDLING:                                                       00034670
     PROC;                                                              00034680
                                                                        00034690
  /* **************************************************************** */00034700
  /*HENSIKT:                                                          */00034710
  /*    BYGGER OPP SSA FOR LES AV TRANHIST.                           */00034720
  /*                                                                  */00034730
  /*                                                                  */00034740
  /*BRUK:                                                             */00034750
  /*    CALL SSA_BEHANDLING;                                          */00034760
  /*                                                                  */00034770
  /* **************************************************************** */00034780
                                                                        00034790
                                                                        00034800
                                                                        00034810
   FEILMELDING_SATT = '1'B;                                             00034820
   LINJENR          = 0;                                                00034830
                                                                        00034840
   DO UNTIL (^FEILMELDING_SATT);                                        00034850
                                                                        00034860
      FEILMELDING_SATT = '0'B;                                          00034870
                                                                        00034880
   /***  LESER INN DATA FRA VENTETRANSBILDET.  */                       00034890
                                                                        00034900
                                                                        00034910
      EXEC CICS RECEIVE MAP('S001482')                                  00034920
                               MAPSET('S001V23')SET (BMSMAPBR);         00034930
                                                                        00034940
      EXEC CICS SEND TEXT FROM(S001482I.FUNKSJONSKODEI)ACCUM;           00034950
      EXEC CICS SEND TEXT FROM(S001482I.LINJENRI      )ACCUM;           00034960
      EXEC CICS PURGE MESSAGE;                                          00034970
                                                                        00034980
      IF S001482I.FUNKSJONSKODEL > 0 THEN                               00034990
         DO;                                                            00035000
            FUNKSJONSKODE = S001482I.FUNKSJONSKODEI;                    00035010
            CALL OVER_OG_UT(FUNKSJONSKODE);                             00035020
         END;                                                           00035030
      /***  SJEKKER OM LINJENR                                          00035040
                                ER GYLDIG. ******/                      00035050
                                                                        00035060
      IF S001482I.LINJENRL > 0 THEN                                     00035070
         DO;                                                            00035080
                                                                        00035090
            IF ^ F_NUMERISK(S001482I.LINJENRI) THEN                     00035100
               DO;                                                      00035110
                  MAP_MELDING =                                         00035120
                               'TEGN SOM IKKE ER NUMERISK I LINJENR';   00035130
                  FEILMELDING_SATT      = '1'B;                         00035140
                  S001482I.LINJENRL     = -1; /*CURSOR POS*/            00035150
                  S001482O.LINJENRA     = 'I';                          00035160
                  S001482O.MELDING6O    = MAP_MELDING;                  00035170
                  EXEC CICS SEND MAP('S001482')                         00035180
                                       MAPSET('S001V23') CURSOR;        00035190
               END;                                                     00035200
            ELSE                                                        00035210
               DO;                                                      00035220
                  LINJENR  = S001482I.LINJENRI;                         00035230
                  IF LINJENR < 1 !                                      00035240
                            (LINJENR + 1 > ANTALL_LEST &                00035250
                             ANTALL_LEST < 14) !                        00035260
                                           LINJENR > 14  THEN           00035270
                     DO;                                                00035280
                        MAP_MELDING = 'UGYLDIG LINJENUMMER';            00035290
                        FEILMELDING_SATT   = '1'B;                      00035300
                        S001482I.LINJENRL  =                            00035310
                                             -1; /* CURSOR POS */       00035320
                        S001482O.MELDING6O = MAP_MELDING;               00035330
                        EXEC CICS SEND MAP('S001482')                   00035340
                                          MAPSET('S001V23') CURSOR;     00035350
                     END;                                               00035360
               END;                                                     00035370
         END;                                                           00035380
      ELSE                                                              00035390
         DO;                                                            00035400
            S001482O.FNRO            = PIC_11;                          00035410
            S001482O.NAVNO           = B02.RF0PERSN (14).NAVN;          00035420
            S001482O.TKNRO           = B02.RF0PERSN (14).TKNR;          00035430
            S001482O.SPRÅKO          = B02.RF0PERSN (14).SPRÅK;         00035440
            S001482O.CICS_INFOO = CICS_NAVN;                            00035450
         END;                                                           00035460
  END;                                                                  00035470
  IF LINJENR > 0 THEN                                                   00035480
     CALL BYGG_SSA_FNR;                                                 00035490
                                                                        00035500
                                                                        00035510
  END SSA_BEHANDLING;                                                   00035520
                                                                        00035530
                                                                        00035540
  SEARCH_FNR_BEHANDLING:                                                00035550
     PROC;                                                              00035560
                                                                        00035570
  /* **************************************************************** */00035580
  /*HENSIKT:                                                          */00035590
  /*    BYGGER OPP SEARH_FNR.                                         */00035600
  /*                                                                  */00035610
  /*                                                                  */00035620
  /*BRUK:                                                             */00035630
  /*    CALL SEARCH_FNR_BEHANDLING;                                   */00035640
  /*                                                                  */00035650
  /* **************************************************************** */00035660
                                                                        00035670
   FEILMELDING_SATT = '1'B;                                             00035680
                                                                        00035690
   DO UNTIL (^FEILMELDING_SATT);                                        00035700
                                                                        00035710
      FEILMELDING_SATT = '0'B;                                          00035720
                                                                        00035730
      /***  LESER INN DATA FRA VENTETRANSBILDET.  */                    00035740
                                                                        00035750
                                                                        00035760
      EXEC CICS RECEIVE MAP('S001483')                                  00035770
                                 MAPSET('S001V33')SET (BMSMAPBR);       00035780
                                                                        00035790
                                                                        00035800
      IF S001483I.FUNKSJONSKODEL > 0 THEN                               00035810
         DO;                                                            00035820
            FUNKSJONSKODE = S001483I.FUNKSJONSKODEI;                    00035830
                                                                        00035840
            IF FUNKSJONSKODE = 'V' THEN                                 00035850
               DO;                                                      00035860
                  B02.STATUS.VIRK_DATO_ÅM(13) = 0;                      00035870
                  B02.STATUS.DØDSDATO_ÅMD(13) = 0;                      00035880
               END;                                                     00035890
                                                                        00035900
            CALL OVER_OG_UT(FUNKSJONSKODE);                             00035910
         END;                                                           00035920
                                                                        00035930
                                                                        00035940
      /***  SJEKKER OM LINJENR                                          00035950
                                       ER GYLDIG. ******/               00035960
                                                                        00035970
                                                                        00035980
      IF S001483I.LINJENRL > 0 THEN                                     00035990
         DO;                                                            00036000
                                                                        00036010
            IF ^F_NUMERISK(S001483I.LINJENRI) THEN                      00036020
               DO;                                                      00036030
                  MAP_MELDING =                                         00036040
                               'TEGN SOM IKKE ER NUMERISK I LINJENR';   00036050
                  FEILMELDING_SATT      = '1'B;                         00036060
                  S001483I.LINJENRL     = -1; /*CURSOR POS*/            00036070
                  S001483O.LINJENRA     = 'I';                          00036080
                  S001483O.MELDING6O    = MAP_MELDING;                  00036090
                                                                        00036100
                  EXEC CICS SEND MAP('S001483')                         00036110
                                     MAPSET('S001V33') CURSOR;          00036120
               END;                                                     00036130
            ELSE                                                        00036140
               DO;                                                      00036150
                  LINJENR  = S001483I.LINJENRI;                         00036160
                  IF LINJENR < 1 !                                      00036170
                                (LINJENR + 1 > ANTALL_LEST &            00036180
                                ANTALL_LEST < 20) !                     00036190
                                             LINJENR > 20  THEN         00036200
                     DO;                                                00036210
                        MAP_MELDING = 'UGYLDIG LINJENUMMER';            00036220
                        FEILMELDING_SATT   = '1'B;                      00036230
                        S001483I.LINJENRL  =                            00036240
                                             -1; /* CURSOR POS*/        00036250
                        S001483O.MELDING6O = MAP_MELDING;               00036260
                                                                        00036270
                        EXEC CICS SEND MAP('S001483')                   00036280
                                             MAPSET('S001V33') CURSOR;  00036290
                     END;                                               00036300
               END;                                                     00036310
         END;                                                           00036320
                                                                        00036330
      END;                                                              00036340
                                                                        00036350
   /***  BYGGER SEARCH_FNR.  ***/                                       00036360
                                                                        00036370
   IF LINJENR > 0 THEN                                                  00036380
      CALL BYGG_SEARCH_FNR;                                             00036390
                                                                        00036400
   RETUR:                                                               00036410
                                                                        00036420
                                                                        00036430
   END SEARCH_FNR_BEHANDLING;                                           00036440
                                                                        00036450
                                                                        00036460
                                                                        00036470
  BYGG_SEARCH_FNR:                                                      00036480
     PROC;                                                              00036490
     SELECT(LINJENR);                                                   00036500
        WHEN(1)                                                         00036510
            SEARCH_FNR    = S001483O.FNR1O;                             00036520
        WHEN(2)                                                         00036530
            SEARCH_FNR    = S001483O.FNR2O;                             00036540
        WHEN(3)                                                         00036550
            SEARCH_FNR    = S001483O.FNR3O;                             00036560
        WHEN(4)                                                         00036570
            SEARCH_FNR    = S001483O.FNR4O;                             00036580
        WHEN(5)                                                         00036590
            SEARCH_FNR    = S001483O.FNR5O;                             00036600
        WHEN(6)                                                         00036610
            SEARCH_FNR    = S001483O.FNR6O;                             00036620
        WHEN(7)                                                         00036630
            SEARCH_FNR    = S001483O.FNR7O;                             00036640
        WHEN(8)                                                         00036650
            SEARCH_FNR    = S001483O.FNR8O;                             00036660
        WHEN(9)                                                         00036670
            SEARCH_FNR    = S001483O.FNR9O;                             00036680
        WHEN(10)                                                        00036690
            SEARCH_FNR    = S001483O.FNR10O;                            00036700
        WHEN(11)                                                        00036710
            SEARCH_FNR    = S001483O.FNR11O;                            00036720
        WHEN(12)                                                        00036730
            SEARCH_FNR    = S001483O.FNR12O;                            00036740
        WHEN(13)                                                        00036750
            SEARCH_FNR    = S001483O.FNR13O;                            00036760
        WHEN(14)                                                        00036770
            SEARCH_FNR    = S001483O.FNR14O;                            00036780
        WHEN(15)                                                        00036790
            SEARCH_FNR    = S001483O.FNR15O;                            00036800
        WHEN(16)                                                        00036810
            SEARCH_FNR    = S001483O.FNR16O;                            00036820
        WHEN(17)                                                        00036830
            SEARCH_FNR    = S001483O.FNR17O;                            00036840
        WHEN(18)                                                        00036850
            SEARCH_FNR    = S001483O.FNR18O;                            00036860
        WHEN(19)                                                        00036870
            SEARCH_FNR    = S001483O.FNR19O;                            00036880
        WHEN(20)                                                        00036890
            SEARCH_FNR    = S001483O.FNR20O;                            00036900
        OTHERWISE;                                                      00036910
     END;                                                               00036920
  END BYGG_SEARCH_FNR;                                                  00036930
                                                                        00036940
                                                                        00036950
                                                                        00036960
                                                                        00036970
  VELG_BEHANDLINGSKODE:                                                 00036980
     PROC;                                                              00036990
                                                                        00037000
  /* **************************************************************** */00037010
  /*HENSIKT:                                                          */00037020
  /*    UTFØRER BEHANDLING ETTER VALGT KODE.                          */00037030
  /*                                                                  */00037040
  /*                                                                  */00037050
  /*BRUK:                                                             */00037060
  /*    CALL VELG_BEHANDLINGSKODE;                                    */00037070
  /*                                                                  */00037080
  /* **************************************************************** */00037090
                                                                        00037100
  FEILMELDING_SATT = '1'B;                                              00037110
                                                                        00037120
  DO UNTIL (^FEILMELDING_SATT);                                         00037130
                                                                        00037140
     FEILMELDING_SATT = '0'B;                                           00037150
     BEH_KODE = S001482I.BEHKODEI;                                      00037160
                                                                        00037170
     SELECT(BEH_KODE);                                                  00037180
       WHEN('E')                                                        00037190
                                                                        00037200
       /***  FJERNING AV VENTETRANSOPPLYSNIGER    ***********/          00037210
                                                                        00037220
         DO;                                                            00037230
            CALL HENT_SVAR_OG_BEKREFT;                                  00037240
                                                                        00037250
            IF S001484I.FJERNEI = 'B' THEN                              00037260
               DO;                                                      00037270
                                                                        00037280
                  /***  FJERNER ØNSKEDE DATA                            00037290
                                        FRA VENTEDATABASE  ***********/ 00037300
                                                                        00037310
                                                                        00037320
                  CALL FJERN_VT_TRANS;                                  00037330
                  IF FEIL_MELD_NR > 0 THEN                              00037340
                 DO;                                                    00037350
                     GO TO RETUR;                                       00037360
                 END;                                                   00037370
                                                                        00037380
                  /***  SKRIVER DET SOM ER                              00037390
                                    FJERNET UT PÅ SKRIVER. *********/   00037400
                                                                        00037410
                  EXEC CICS LINK PROGRAM('R0010470')                    00037420
                                                     COMMAREA(KOM_OMR); 00037430
                  IF FEIL_MELD_NR > 0 THEN                              00037440
                 DO;                                                    00037450
                     GO TO RETUR;                                       00037460
                 END;                                                   00037470
                                                                        00037480
                                                                        00037490
                                                                        00037500
               END;                                                     00037510
                                                                        00037520
           /***  BYGGER SEARCH_FNR.  ***/                               00037530
                                                                        00037540
            FØDSNUMMER = PIC_11;                                        00037550
                                                                        00037560
            TRANSKODE  = 'R48B';                                        00037570
                                                                        00037580
         END;                                                           00037590
                                                                        00037600
       WHEN('R')                                                        00037610
                                                                        00037620
         /***  ENDRING/REG. AV VENTETRANSOPPLYSNIGER  ********/         00037630
                                                                        00037640
         DO;                                                            00037650
            /***  GÅR VIDERE MED VENTETRANSOPPLYSNINGENE                00037660
                        INN I HOVEDSYSTEMET SOM NY-REG.        ***/     00037670
                                                                        00037680
                                                                        00037690
            /* INITIERING AV DIV. STYREPARAMETERE    */                 00037700
                                                                        00037710
            DIV_PARAM_OMR.FRA_CICS        = '0'B;                       00037720
            DIV_PARAM_OMR.HENT_FRAM_MAP   = '1'B;                       00037730
            DIV_PARAM_OMR.FRA_MED_DIALOG  = '0'B;                       00037740
            DIV_PARAM_OMR.FRA_UTEN_DIALOG = '0'B;                       00037750
                                                                        00037760
            STYRINGS_OMR.STYREKODE = TRANS_OPPL_OMR.BLANKETTYPE ;       00037770
                                                                        00037780
                                                                        00037790
            /* SAKSBEHANDLERDIALOGEN : DIALOG OG KONTROLL AV */         00037800
            /* REGISTRERT BLANKETT, DVS TRANS FRA VENTEBASEN */         00037810
                                                                        00037820
            EXEC CICS LINK PROGRAM('R0013301')                          00037830
                                               COMMAREA(KOM_OMR);       00037840
                                                                        00037850
                                                                        00037860
            IF FEIL_MELD_NR > 0 THEN                                    00037870
                 DO;                                                    00037880
                     GO TO RETUR;                                       00037890
                 END;                                                   00037900
                                                                        00037910
                                                                        00037920
            IF FUNKSJONSKODE    ^= 'B' THEN                             00037930
               DO;                                                      00037940
                  /***  FJERNER ØNSKEDE DATA                            00037950
                                      FRA VENTEDATABASE  ***********/   00037960
                                                                        00037970
                  CALL FJERN_VT_TRANS;                                  00037980
                                                                        00037990
                                                                        00038000
                  IF FEIL_MELD_NR > 0 THEN                              00038010
                 DO;                                                    00038020
                     GO TO RETUR;                                       00038030
                 END;                                                   00038040
                                                                        00038050
                  /***  SKRIVER DET SOM ER                              00038060
                                    FJERNET UT PÅ SKRIVER. *********/   00038070
                                                                        00038080
               /* EXEC CICS LINK PROGRAM('R0010470')                    00038090
                                               COMMAREA(KOM_OMR);       00038100
                  IF FEIL_MELD_NR > 0 THEN                              00038110
                     GO TO RETUR;*/                                     00038120
                                                                        00038130
                  /* KONTROLLEN GÅR TIL BEHANDLE_TRANS */               00038140
                                                                        00038150
                  EXEC CICS XCTL PROGRAM('R0012001')                    00038160
                                               COMMAREA(KOM_OMR);       00038170
         END;                                                           00038180
                                                                        00038190
            KOM_OMR.PEKER_LISTE.STYRINGS_PEKER    =                     00038200
                                          ADDR(KOM_OMR.STYRINGS_OMR);   00038210
                                                                        00038220
            TRANSKODE = 'R48B';                                         00038230
                                                                        00038240
            STYREKODE = BLANKETTYPE;                                    00038250
                                                                        00038260
            FØDSNUMMER = PIC_11;                                        00038270
                                                                        00038280
            FUNKSJONSKODE = 'V';                                        00038290
                                                                        00038300
         END;                                                           00038310
                                                                        00038320
       WHEN('F')                                                        00038330
                                                                        00038340
         /*----------------------------------------------------------*/ 00038350
         /*    FORESPØRSEL PÅ VENTETRANSOPPLYSNIGER                  */ 00038360
         /*    SKRIVER OPPLYSNINGENE UT PÅ SKJERM                    */ 00038370
         /*----------------------------------------------------------*/ 00038380
         DO;                                                            00038390
            EXEC CICS LINK PROGRAM('R0010470')                          00038400
                                               COMMAREA(KOM_OMR);       00038410
            IF FEIL_MELD_NR > 0 THEN                                    00038420
                 DO;                                                    00038430
                     GO TO RETUR;                                       00038440
                 END;                                                   00038450
                                                                        00038460
                                                                        00038470
            FØDSNUMMER = PIC_11;                                        00038480
                                                                        00038490
            TRANSKODE = 'R48B';                                         00038500
                                                                        00038510
                                                                        00038520
        END;                                                            00038530
                                                                        00038540
      OTHERWISE                                                         00038550
        DO;                                                             00038560
           MAP_MELDING        = 'UGYLDIG BEHANDLINGSKODE';              00038570
           FEILMELDING_SATT   = '1'B;                                   00038580
           S001482I.BEHKODEL  = -1; /* CURSOR POS */                    00038590
           S001482I.LINJENRL  =  0; /* CURSOR POS NULLES */             00038600
           S001482O.MELDING6O = MAP_MELDING;                            00038610
                                                                        00038620
           EXEC CICS SEND MAP('S001482')                                00038630
                                         MAPSET('S001V23') CURSOR;      00038640
                                                                        00038650
           EXEC CICS RECEIVE MAP('S001482')                             00038660
                                  MAPSET('S001V23')   SET(BMSMAPBR);    00038670
           IF S001482I.FUNKSJONSKODEL > 0 THEN                          00038680
              DO;                                                       00038690
                 FUNKSJONSKODE = S001482I.FUNKSJONSKODEI;               00038700
                 CALL OVER_OG_UT(FUNKSJONSKODE);                        00038710
              END;                                                      00038720
        END;                                                            00038730
     END;                                                               00038740
  END;                                                                  00038750
                                                                        00038760
  RETUR:                                                                00038770
  END VELG_BEHANDLINGSKODE;                                             00038780
                                                                        00038790
                                                                        00038800
  FEILBEH:                                                              00038810
                                                                        00038820
   EXEC CICS SYNCPOINT ROLLBACK;                                        00038830
                                                                        00038840
   S001481I.FNRL      = -1;       /* CURSOR POS */                      00038850
                                                                        00038860
   S001481O.MELDINGO  = 'FEIL HAR OPPSTÅTT.PRØV PÅNYTT.HVIS FORTSATT'   00038870
                                                 !!' FEIL,SØK HJELP.';  00038880
   S001481O.CICS_INFOO = CICS_NAVN ;                                    00038890
                                                                        00038900
   EXEC CICS SEND MAP('S001481')                                        00038910
                             MAPSET('S001V13') CURSOR ERASE;            00038920
                                                                        00038930
   KOM_OMR.PCB_UIB_PEKER = NULL;                                        00038940
                                                                        00038950
                                                                        00038960
   IF  S001481I.REGDATOL  > 0 !                                         00038970
       S001481I.VIRKDATOL  > 0 THEN                                     00038980
                                                                        00038990
       TRANSKODE = 'R48A';                                              00039000
                                                                        00039010
   ELSE                                                                 00039020
      IF S001481I.FNRL > 0 THEN                                         00039030
                                                                        00039040
         TRANSKODE = 'R48B';                                            00039050
                                                                        00039060
      ELSE                                                              00039070
                                                                        00039080
         TRANSKODE = 'R048';                                            00039090
                                                                        00039100
                                                                        00039110
  EXEC CICS XCTL PROGRAM('R0010480')                                    00039120
                                       COMMAREA(KOM_OMR);               00039130
                                                                        00039140
                                                                        00039150
                                                                        00039160
  %INCLUDE R0019901;             /*  DATO_KONTROLL_MÅ             */    00039170
                                                                        00039180
  %INCLUDE R0019902;             /*  F_KJØNN                      */    00039190
                                                                        00039200
  %INCLUDE R0019904;             /*  FNR_KONTROLL                 */    00039210
                                                                        00039220
  %INCLUDE R0019910;             /*  NUMERISK-KONTROLL            */    00039230
                                                                        00039240
  %INCLUDE R0019913;             /*  F_SNU_DATO                   */    00039250
                                                                        00039260
  %INCLUDE R0019942;             /*  F_SNU_DØDSDATO(DMÅ)          */    00039270
                                                                        00039280
  %INCLUDE R0019911;             /*  DATO_KONTROLL                */    00039290
                                                                        00039300
  %INCLUDE R0019912;             /*  NUM-> CHAR                   */    00039310
                                                                        00039320
  %INCLUDE R0019956;             /*  P9956_BER_G_CICS             */    00039330
                                                                        00039340
   /* %INCLUDE R0019960;             F_CICSINFO                   */    00039350
                                                                        00039360
  %INCLUDE R0015205;             /*  P050_LES_AP_TRANS            */    00039370
  %INCLUDE R00152N5;             /*  P050_LES_A1_TRANS            */    00039380
                                                                        00039390
  %INCLUDE R0015206;             /*  P060_LES_UP_TRANS            */    00039400
  %INCLUDE R00152N6;             /*  P060_LES_U2_TRANS            */    00039410
  %INCLUDE R00152U6;             /*  P060_LES_U3_TRANS            */    00039420
                                                                        00039430
  %INCLUDE R0015207;             /*  P070_LES_US_TRANS            */    00039440
                                                                        00039450
  %INCLUDE R0015208;             /*  P080_LES_EP_TRANS            */    00039460
  %INCLUDE R00152N8;             /*  P080_LES_E3_TRANS            */    00039470
  %INCLUDE R00152U8;             /*  P080_LES_EE_TRANS            */    00039480
                                                                        00039490
  %INCLUDE R0015209;             /*  P090_LES_EF_TRANS            */    00039500
  %INCLUDE R00152N9;             /*  P090_LES_E4_TRANS            */    00039510
                                                                        00039520
  %INCLUDE R0015210;             /*  P090_LES_FB_TRANS            */    00039530
                                                                        00039540
  %INCLUDE R0015211;             /*  P110_LES_BP_TRANS            */    00039550
  %INCLUDE R00152NB;             /*  P110_LES_B6_TRANS            */    00039560
                                                                        00039570
  %INCLUDE R0015212;             /*  P120_LES_FT_TRANS            */    00039580
  %INCLUDE R00152NC;             /*  P120_LES_F7_TRANS            */    00039590
  %INCLUDE R00152UC;             /*  P120_LES_FO_TRANS            */    00039600
                                                                        00039610
  %INCLUDE R0015214;             /*  P140_LES_E1_TRANS            */    00039620
  %INCLUDE R00152UE;             /*  P140_LES_EN_TRANS            */    00039630
                                                                        00039640
  %INCLUDE R0015216;             /*  P160_LES_O1_TRANS            */    00039650
                                                                        00039660
  %INCLUDE R0015217;             /*  P170_LES_O2_TRANS            */    00039670
                                                                        00039680
  %INCLUDE R0015219;             /*  P190_LES_AF_TRANS            */    00039690
  %INCLUDE R00152UJ;            /*   P190_LES_KF_TRANS            */    00039700
                                                                        00039710
  %INCLUDE R0015220;             /*  P183_LES_UF_TRANS     UF !!  */    00039720
                                                                        00039730
  %PRINT;                                                               00039740
 END R001048;                                                           00039750
