 /*       SIST ENDRET 05/12-97 12.18.07 AV   JDA7339                  */00000000
 /*       SIST ENDRET 27/11-97 10.42.22 AV   JDA7339                  */00000010
 /*       SIST ENDRET 20/03-91 13.24.21 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 21/01-91 13.47.44 AV   DYBVIK                   */00000030
 /* ***************************************************************** */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /* **********************                                            */00000060
 /*  PROGRAM-IDENT : R001NN11  UNDERPROGRAM SOM BRUKES AV R001NO10    */00000070
 /*                            KONTROLL A1-BLANKETT.                  */00000080
 /*  PROGRAM-SPRÅK : PLI                                              */00000090
 /*  PROGRAMMERER  : TRUDE SPONBERG                                   */00000100
 /*  PROGRAMMET BLE LAGET : NOV 1990                                  */00000110
 /*                                                                   */00000120
 /* ***************************************************************** */00000130
 /*  ENDRINGERSDATO :                                                 */00000140
 /*  ENDRINGEN GJELDER:                                               */00000150
 /*                                                                   */00000160
 /*                                                                   */00000170
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000180
 /*                                                                   */00000190
 /* ***************************************************************** */00000200
 /*BRUK:                                                              */00000210
 /* ********                                                          */00000220
 /*                                                                   */00000230
 /*  %INCLUDE R001NN11                                                */00000240
 /*                                                                   */00000250
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */00000260
 /*                                                                   */00000270
 /*    R001N502   BLANK TRANSOMR                                      */00000280
 /*    R001N503   KONTR A1 SØKER                                      */00000290
 /*    R001N504   KONTR A1 BARN                                       */00000300
 /*    FUNKSJONER SOM BRUKES ER INCLUDET I HOVEDPROGRAMMET.           */00000310
 /*                                                                   */00000320
 /* ***************************************************************** */00000330
 /*                                                                   */00000340
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR A1 OG FLYTTER DERETTER        */00000350
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */00000360
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */00000370
 /*  NUMRE TATT VARE PÅ.                                              */00000380
 /*                                                                   */00000390
 /* ***************************************************************** */00000400
                                                                        00000410
 P105_BEHANDLE_A1: PROC;                                                00000420
                                                                        00000430
                                                                        00000440
 %INCLUDE P001N501;                      /* TRANSOMRÅDE A1 */           00000450
                                                                        00000460
                                                                        00000470
          CALL BLANK_A1_SØKER;                         /* R001N502 */   00000480
          CALL BLANK_A1_BARN;                          /* R001N502 */   00000490
          CALL BLANK_A1_MELDNR;                        /* R001N502 */   00000500
          CALL OVERF_A1_BLANKETT;                    /* INTERN PROC */  00000510
          CALL KONTROLL_A1_SØKER(FEIL_FUNNET);         /* R001N503 */   00000520
                                                                        00000530
          IF ^FEIL_FUNNET                         &                     00000540
             F_FELT_PIC_CHAR2(A1S.BT_ANT) ^= '00' THEN                  00000550
             DO;                                                        00000560
                CALL OVERF_A1_BARN;                                     00000570
                CALL KONTROLL_A1_BARN(FEIL_FUNNET);    /* R001N504 */   00000580
             END;                                                       00000590
                                                                        00000600
          IF A1S.NORSK_BOSATT = 'N'   THEN                              00000610
             DO;                                                        00000620
                FEIL_I_BOSATT = TRUE;                                   00000630
                FEIL_FUNNET   = TRUE;                                   00000640
             END;                                                       00000650
                                                                        00000660
          IF FEIL_FUNNET      THEN                                      00000670
             CALL FINN_FEIL_A1;                                         00000680
                                                                        00000690
                                                                        00000700
                                                                        00000710
                                                                        00000720
 /* ***************************************************************** */00000730
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */00000740
 /*    RECORDEN TIL A1 TRANSOMRÅDE FOR A1 SØKER.                      */00000750
 /* ***************************************************************** */00000760
 OVERF_A1_BLANKETT:PROC;                                                00000770
                                                                        00000780
          A1S.REGDATO      =  BLANKETT_RECORD.TRANS_DATO_ÅMD;           00000790
          A1S.TERMID       = 'NORT';                                    00000800
          A1S.VIRK_DATO_MÅ =  A1_BLANKETT.VIRK_DATO_MÅ;                 00000810
          A1S.NAVN         =  BLANKETT_RECORD.NAVN;                     00000820
          A1S.FNR          =  BLANKETT_RECORD.FNR;                      00000830
          A1S.TKNR         =  BLANKETT_RECORD.TKNR;                     00000840
          A1S.SPRÅK        =  A1_BLANKETT.SPRÅK;                        00000850
          A1S.SIVILSTAND   =  A1_BLANKETT.SIVILSTAND;                   00000860
          A1S.TILL_EK      =  A1_BLANKETT.EKTEFELLETILLEGG;             00000870
                                                                        00000880
          IF F_FELT_PIC_CHAR3 (A1_BLANKETT.ANT_BARN) ^= '   '    THEN   00000890
             A1S.BT_ANT    =  A1_BLANKETT.ANT_BARN;                     00000900
                                                                        00000910
          A1S.NORSK_BOSATT =  A1_BLANKETT.NORSK_BOSATT;                 00000920
                                                                        00000930
          IF F_FELT_PIC_CHAR5 (A1_BLANKETT.FAI) ^= '     '       THEN   00000940
             A1S.FAI       =  A1_BLANKETT.FAI * 100;                    00000950
                                                                        00000960
          IF F_FELT_PIC_CHAR5 (A1_BLANKETT.INNTEKT_EK) ^= '     '  THEN 00000970
             A1S.INNT_EK   =  A1_BLANKETT.INNTEKT_EK ; /*   * 100 ?? */ 00000980
                                                                        00000990
          IF F_FELT_PIC_CHAR7                                           00001000
                    (A1_BLANKETT.PENSJONS_BELØP) ^= '     ' THEN        00001010
             A1S.PENSJON_BELØP =  A1_BLANKETT.PENSJONS_BELØP;           00001020
                                                                        00001030
          IF F_FELT_PIC_CHAR3 (A1_BLANKETT.APD) ^= '   '         THEN   00001040
             A1S.APD       =  A1_BLANKETT.APD;                          00001050
                                                                        00001060
          IF F_FELT_PIC_CHAR11 (A1_BLANKETT.FNR_EK) ^= (11)' '   THEN   00001070
             A1S.FNR_EK    =  A1_BLANKETT.FNR_EK;                       00001080
                                                                        00001090
          A1S.NAVN_EK      =  A1_BLANKETT.NAVN_EK;                      00001100
          A1S.MINST4G      =  A1_BLANKETT.MINST4G;                      00001110
          A1S.EK_INNT_OVER_2G  =  A1_BLANKETT.EK_INNT_OVER_2G; /*HL*/   00001120
                                                                        00001130
                                                                        00001140
    END OVERF_A1_BLANKETT;                                              00001150
                                                                        00001160
                                                                        00001170
 /* ***************************************************************** */00001180
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */00001190
 /*    RECORDEN TIL A1 TRANSOMRÅDE FOR A1 BARN.                       */00001200
 /* ***************************************************************** */00001210
 OVERF_A1_BARN:PROC;                                                    00001220
                                                                        00001230
                                                                        00001240
          DO I = 1 TO 12 WHILE (F_FELT_PIC_CHAR11                       00001250
                               (A1_BLANKETT.FNR_BARN (I)) ^= (11)' ');  00001260
             A1B.FNR_BARN(I) = A1_BLANKETT.FNR_BARN(I);                 00001270
 /*NB!       A1B.RBT_BARN(I) = A1_BLANKETT.RED_BT(I);   */              00001280
          END;                                                          00001290
                                                                        00001300
                                                                        00001310
    END OVERF_A1_BARN;                                                  00001320
                                                                        00001330
                                                                        00001340
                                                                        00001350
 /* ***************************************************************** */00001360
 /*    PROCEDURE SOM FINNER OG TAR VARE PÅ FEIL_MELD_NR NÅR DET ER    */00001370
 /*    FEIL I DEN OVERFØRTE RECORDEN.                                 */00001380
 /* ***************************************************************** */00001390
 FINN_FEIL_A1:PROC;                                                     00001400
                                                                        00001410
    DCL ANT_BARN              FIXED BIN (15);                           00001420
                                                                        00001430
          FEIL_IND = 1;                                                 00001440
                                                                        00001450
          IF A1S.FNRNR ^= 0 &                                           00001460
             A1S.FNRNR ^= 999 THEN                                      00001470
             DO;                                                        00001480
                W01_FEIL_NR(FEIL_IND) = A1S.FNRNR;                      00001490
                FEIL_IND = FEIL_IND + 1;                                00001500
             END;                                                       00001510
                                                                        00001520
          IF A1S.TKNRNR ^= 0 &                                          00001530
             A1S.TKNRNR ^= 999 THEN                                     00001540
             DO;                                                        00001550
                W01_FEIL_NR(FEIL_IND) = A1S.TKNRNR;                     00001560
                FEIL_IND = FEIL_IND + 1;                                00001570
             END;                                                       00001580
                                                                        00001590
          IF A1S.NAVNNR ^= 0 &                                          00001600
             A1S.NAVNNR ^= 999 THEN                                     00001610
             DO;                                                        00001620
                W01_FEIL_NR(FEIL_IND) = A1S.NAVNNR;                     00001630
                IF FEIL_IND ^= 3 THEN                                   00001640
                   FEIL_IND  = FEIL_IND + 1;                            00001650
             END;                                                       00001660
                                                                        00001670
          IF A1S.SPRÅKNR ^= 0 &                                         00001680
             A1S.SPRÅKNR ^= 999 THEN                                    00001690
             DO;                                                        00001700
                W01_FEIL_NR(FEIL_IND) = A1S.SPRÅKNR;                    00001710
                IF FEIL_IND ^= 3 THEN                                   00001720
                   FEIL_IND  = FEIL_IND + 1;                            00001730
             END;                                                       00001740
                                                                        00001750
          IF A1S.SIVILSTANDNR ^= 0 &                                    00001760
             A1S.SIVILSTANDNR ^= 999 THEN                               00001770
             DO;                                                        00001780
                W01_FEIL_NR(FEIL_IND) = A1S.SIVILSTANDNR;               00001790
                IF FEIL_IND ^= 3 THEN                                   00001800
                   FEIL_IND  = FEIL_IND + 1;                            00001810
             END;                                                       00001820
                                                                        00001830
          IF A1S.TILL_EKNR ^= 0 &                                       00001840
             A1S.TILL_EKNR ^= 999 THEN                                  00001850
             DO;                                                        00001860
                W01_FEIL_NR(FEIL_IND) = A1S.TILL_EKNR;                  00001870
                IF FEIL_IND ^= 3 THEN                                   00001880
                   FEIL_IND  = FEIL_IND + 1;                            00001890
             END;                                                       00001900
                                                                        00001910
          IF A1S.NORSK_BOSATTNR ^= 0 &                                  00001920
             A1S.NORSK_BOSATTNR ^= 999 THEN                             00001930
             DO;                                                        00001940
                W01_FEIL_NR(FEIL_IND) = A1S.NORSK_BOSATTNR;             00001950
                IF FEIL_IND ^= 3 THEN                                   00001960
                   FEIL_IND  = FEIL_IND + 1;                            00001970
             END;                                                       00001980
                                                                        00001990
          IF A1S.BT_ANTNR ^= 0 &                                        00002000
             A1S.BT_ANTNR ^= 999 THEN                                   00002010
             DO;                                                        00002020
                W01_FEIL_NR(FEIL_IND) = A1S.BT_ANTNR;                   00002030
                IF FEIL_IND ^= 3 THEN                                   00002040
                   FEIL_IND  = FEIL_IND + 1;                            00002050
             END;                                                       00002060
                                                                        00002070
          IF A1S.FAINR ^= 0 &                                           00002080
             A1S.FAINR ^= 999 THEN                                      00002090
             DO;                                                        00002100
                W01_FEIL_NR(FEIL_IND) = A1S.FAINR;                      00002110
                IF FEIL_IND ^= 3 THEN                                   00002120
                   FEIL_IND  = FEIL_IND + 1;                            00002130
             END;                                                       00002140
                                                                        00002150
  /*NY*/  IF A1S.INNT_EKNR ^= 0 &                                       00002160
             A1S.INNT_EKNR ^= 999 THEN                                  00002170
             DO;                                                        00002180
                W01_FEIL_NR(FEIL_IND) = A1S.INNT_EKNR;                  00002190
                IF FEIL_IND ^= 3 THEN                                   00002200
                   FEIL_IND  = FEIL_IND + 1;                            00002210
             END;                                                       00002220
                                                                        00002230
  /*NY*/  IF A1S.PENSJON_BELØPNR ^= 0 &                                 00002240
             A1S.INNT_EKNR ^= 999 THEN                                  00002250
             DO;                                                        00002260
                W01_FEIL_NR(FEIL_IND) = A1S.PENSJON_BELØPNR;            00002270
                IF FEIL_IND ^= 3 THEN                                   00002280
                   FEIL_IND  = FEIL_IND + 1;                            00002290
             END;                                                       00002300
                                                                        00002310
          IF A1S.APDNR ^= 0 &                                           00002320
             A1S.APDNR ^= 999 THEN                                      00002330
             DO;                                                        00002340
                W01_FEIL_NR(FEIL_IND) = A1S.APDNR;                      00002350
                IF FEIL_IND ^= 3 THEN                                   00002360
                   FEIL_IND  = FEIL_IND + 1;                            00002370
             END;                                                       00002380
                                                                        00002390
          IF A1S.VIRK_DATO_MÅNR ^= 0 &                                  00002400
             A1S.VIRK_DATO_MÅNR ^= 999 THEN                             00002410
             DO;                                                        00002420
                W01_FEIL_NR(FEIL_IND) = A1S.VIRK_DATO_MÅNR;             00002430
                IF FEIL_IND ^= 3 THEN                                   00002440
                   FEIL_IND  = FEIL_IND + 1;                            00002450
             END;                                                       00002460
                                                                        00002470
          IF A1S.FNR_EKNR ^= 0 &                                        00002480
             A1S.FNR_EKNR ^= 999 THEN                                   00002490
             DO;                                                        00002500
                W01_FEIL_NR(FEIL_IND) = A1S.FNR_EKNR;                   00002510
                IF FEIL_IND ^= 3 THEN                                   00002520
                   FEIL_IND  = FEIL_IND + 1;                            00002530
             END;                                                       00002540
                                                                        00002550
          IF A1S.NAVN_EKNR ^= 0 &                                       00002560
             A1S.NAVN_EKNR ^= 999 THEN                                  00002570
             DO;                                                        00002580
                W01_FEIL_NR(FEIL_IND) = A1S.NAVN_EKNR;                  00002590
                IF FEIL_IND ^= 3 THEN                                   00002600
                   FEIL_IND  = FEIL_IND + 1;                            00002610
             END;                                                       00002620
                                                                        00002630
          IF A1S.MINST4GNR ^= 0 &                                       00002640
             A1S.MINST4GNR ^= 999 THEN                                  00002650
             DO;                                                        00002660
                W01_FEIL_NR(FEIL_IND) = A1S.MINST4GNR;                  00002670
                IF FEIL_IND ^= 3 THEN                                   00002680
                   FEIL_IND  = FEIL_IND + 1;                            00002690
             END;                                                       00002700
                                                                        00002710
          IF A1S.EK_INNT_OVER_2GNR ^= 0 &                               00002720
             A1S.EK_INNT_OVER_2GNR ^= 999 THEN                          00002730
             DO;                                                        00002740
                W01_FEIL_NR(FEIL_IND) = A1S.EK_INNT_OVER_2GNR;          00002750
                IF FEIL_IND ^= 3 THEN                                   00002760
                   FEIL_IND  = FEIL_IND + 1;                            00002770
             END;                                                       00002780
                                                                        00002790
          IF A1S.INNT_EKNR ^= 0 &                                       00002800
             A1S.INNT_EKNR ^= 999 THEN                                  00002810
             DO;                                                        00002820
                W01_FEIL_NR(FEIL_IND) = A1S.INNT_EKNR;                  00002830
                IF FEIL_IND ^= 3 THEN                                   00002840
                   FEIL_IND  = FEIL_IND + 1;                            00002850
             END;                                                       00002860
                                                                        00002870
          IF A1S.PENSJON_BELØPNR ^= 0 &                                 00002880
             A1S.PENSJON_BELØPNR ^= 999 THEN                            00002890
             DO;                                                        00002900
                W01_FEIL_NR(FEIL_IND) = A1S.PENSJON_BELØPNR;            00002910
                IF FEIL_IND ^= 3 THEN                                   00002920
                   FEIL_IND  = FEIL_IND + 1;                            00002930
             END;                                                       00002940
                                                                        00002950
                                                                        00002960
          DO ANT_BARN = 1 TO 12 WHILE (F_FELT_PIC_CHAR11                00002970
                                   (A1B.FNR_BARN(ANT_BARN)) ^= (11)'0');00002980
                                                                        00002990
             IF A1B.FNR_BARNNR(ANT_BARN) ^= 0   &                       00003000
                A1B.FNR_BARNNR(ANT_BARN) ^= 999 THEN                    00003010
                DO;                                                     00003020
                   W01_FEIL_NR(FEIL_IND) = A1B.FNR_BARNNR(ANT_BARN);    00003030
                   IF FEIL_IND ^= 3 THEN                                00003040
                      FEIL_IND  = FEIL_IND + 1;                         00003050
                END;                                                    00003060
                                                                        00003070
        /*   IF APB.RBT_BARNNR(ANT_BARN) ^= 0   &                       00003080
                APB.RBT_BARNNR(ANT_BARN) ^= 999 THEN                    00003090
                DO;                                                     00003100
                   W01_FEIL_NR(FEIL_IND) = APB.RBT_BARNNR(ANT_BARN);    00003110
                   IF FEIL_IND ^= 3 THEN                                00003120
                      FEIL_IND  = FEIL_IND + 1;                         00003130
                END;                                                    00003140
          */                                                            00003150
          END;                                                          00003160
                                                                        00003170
                                                                        00003180
                                                                        00003190
    END FINN_FEIL_A1;                                                   00003200
                                                                        00003210
                                                                        00003220
                                                                        00003230
 %PAGE;                                                                 00003240
 /* ***************************************************************** */00003250
 /*          E K S T E R N E    P R O C E D U R E R                   */00003260
 /* ***************************************************************** */00003270
                                                                        00003280
 %PAGE;                                                                 00003290
 %INCLUDE R001N502;          /*     BLANK A1 TRANSOMR   */              00003300
 %PAGE;                                                                 00003310
 %INCLUDE R001N503;          /*     KONTR A1 SØKER      */              00003320
 %PAGE;                                                                 00003330
 %INCLUDE R001N504;          /*     KONTR A1 BARN       */              00003340
                                                                        00003350
                                                                        00003360
 END P105_BEHANDLE_A1;                                                  00003370
                                                                        00003380
                                                                        00003390
