 /*       SIST ENDRET 29/03-88 13.25.40 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 08/10-82 14.03.53 AV   LUNDEBY                  */00000010
 /*       SIST ENDRET 20/09-82 11.37.12 AV   OLSEN                    */00000020
 /*       SIST ENDRET 10/09-82 12.00.39 AV   HELEN                    */00000030
 /*       SIST ENDRET 09/09-82 14.27.10 AV   HELEN                    */00000040
 /*       SIST ENDRET 23/08-82 09.57.08 AV   OLAV                     */00000050
 /* **************************************************************** */ 00000060
 /* IDENTIFIKASJON:   R0017301                                       */ 00000070
 /* PROGRAMMERER:  HELEN    JULI, 1982                              */  00000080
 /* HENSIKT:                                                         */ 00000090
 /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT     */ 00000100
 /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER         */ 00000110
 /*        HVER AJOURFØRT TRANSAKSJON.                               */ 00000120
 /* PROGRAMTILKNYTNING:                                              */ 00000130
 /*        PROGRAMMET KALLES OPP AV R0017001                         */ 00000140
 /*                                                                  */ 00000150
 /* **************************************************************** */ 00000160
 LAG_BARNEP_BEGGE_HEND:                                                 00000170
      PROC (BA_IND) ;                                                   00000180
 DCL  BA_IND       FIXED BIN(15);                                       00000190
 DCL  IND          FIXED BIN(15);                                       00000200
 DCL  Y_BARN_IND   FIXED BIN(15);                                       00000210
 /* **************************************************************** */ 00000220
 /* PROGRAMMET BEGYNNER HER.                                         */ 00000230
 /* VI BLANKER W_HENDELSE OG  FINNER YNGSTE BARN.                    */ 00000240
 /* **************************************************************** */ 00000250
    W_HENDELSE            =  '';                                        00000260
    DO IND = 3 TO 14;                                                   00000270
   /*   ENDRET 15.03.88   SATISH                                      */00000280
   /*                                                                 */00000290
   /*  IF B02.PERSON.STATUS.PENSJONSTYPE2(IND) = 'Y' THEN             */00000300
   /*   HITTIL                                                        */00000310
       IF B02.PERSON.STATUS.PENSJONSTYPE2(IND) = 'P' THEN               00000320
          DO;                                                           00000330
             Y_BARN_IND = IND;                                          00000340
             IND = 14;                                                  00000350
          END;                                                          00000360
    END;                                                                00000370
    W_HENDELSE.HENDDATO   =    B02.PERSON.STATUS.VIRK_DATO_ÅM(BA_IND);  00000380
    W_HENDELSE.VERSJON    =    W_ROT.NESTE_SB_VERSJON_NR;               00000390
    W_HENDELSE.TERMINAL   =    EIBLK.EIBTRMID;                          00000400
    IF B02.PERSON.STATUS.PENSJONSTYPE3(BA_IND) = 'U'     THEN           00000410
       DO;                                                              00000420
       W_HENDELSE.GP_BRUTTO = B02.PERSON.UFØRPENS.GP(BA_IND);           00000430
       W_HENDELSE.GP_NETTO  = B02.PERSON.UFØRPENS.GP(BA_IND);           00000440
       W_HENDELSE.TP_BRUTTO = B02.PERSON.UFØRPENS.TP(BA_IND);           00000450
       W_HENDELSE.TP_NETTO  = B02.PERSON.UFØRPENS.TP(BA_IND);           00000460
       W_HENDELSE.ST        = B02.PERSON.UFØRPENS.ST(BA_IND);           00000470
       W_HENDELSE.KT        = B02.PERSON.UFØRPENS.KT(BA_IND);           00000480
       W_HENDELSE.UF_GRAD   = B02.PERSON.UFØRPENS.UFG(BA_IND);          00000490
       END;                                                             00000500
    ELSE                                                                00000510
       DO;                                                              00000520
       W_HENDELSE.GP_BRUTTO  =    B02.PERSON.ETTEBARN.GP(BA_IND);       00000530
       W_HENDELSE.TP_BRUTTO  =    B02.PERSON.ETTEBARN.TP(BA_IND);       00000540
       W_HENDELSE.ST         =    B02.PERSON.ETTEBARN.ST(BA_IND);       00000550
       W_HENDELSE.KT         =    B02.PERSON.ETTEBARN.KT(BA_IND);       00000560
       END;                                                             00000570
    W_HENDELSE.ANTALL_BARN = B02.PERSON.STATUS.ANTALL_BARN(Y_BARN_IND); 00000580
    W_HENDELSE.ANTALL_BARN_TIDL = B01.PERSON.STATUS.ANTALL_BARN(3);     00000590
    W_HENDELSE.TT        = B02.PERSON.STATUS.TT_ANV(BA_IND);            00000600
    CALL PLASSER_TEKSTTYPE_A_KODE;                                      00000610
 /* CALL  PLASSER_TEKSTYPE_B1_KODE   */                                 00000620
    W_HENDELSE.TEKSTYPE_B1_KODE  = 9;                                   00000630
 /* CALL  PLASSER_TEKSTYPE_B2_KODE   */                                 00000640
    W_HENDELSE.TEKSTYPE_B2_KODE  = 9;                                   00000650
 /* CALL  PLASSER_TEKSTYPE_C_KODE    */                                 00000660
    W_HENDELSE.TEKSTYPE_C_KODE  = 9;                                    00000670
 /* **************************************************************** */ 00000680
 /* HENDELSE SEGMENT SKRIVES UT.                                     */ 00000690
 /* **************************************************************** */ 00000700
    CALL INSERT_HENDELSE;                                               00000710
 /* **************************************************************** */ 00000720
 /*VI OPPBEVARER NØKKEL TIL HENDELSE SEGMENT I TILFELLE VI MÅ FJERNE */ 00000730
 /*DEN DERSOM DET OPPSTÅR FEIL VED BEHANDLING AV SENERE HENDELSER.   */ 00000740
 /* **************************************************************** */ 00000750
 /* IF W_HENDELSE.TP_NETTO > 0  THEN                                 */ 00000760
 /*    CALL BYGG_OPP_BEREGNINGS_VEDLEGG_SEGMENT                      */ 00000770
  END LAG_BARNEP_BEGGE_HEND;                                            00000780
