 /*       SIST ENDRET 24/07-98 12.19.14 AV   JDA7339                  */00000000
 /*       SIST ENDRET 24/07-98 11.56.59 AV   JDA7339                  */00000010
 /*       SIST ENDRET 26/01-98 15.04.26 AV   JDA7339                  */00000020
 /*       SIST ENDRET 26/01-98 15.03.25 AV   JDA7339                  */00000030
 /*       SIST ENDRET 06/05-96 13.10.19 AV   JDA0310                  */00000040
 /*       SIST ENDRET 12/04-94 15.04.10 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 16/02-94 15.41.22 AV   TRUDE                    */00000060
 /*       SIST ENDRET 13/12-91 12.26.19 AV   DYBVIK                   */00000070
 /*********************************************************************/00000080
 /* IDENTIFIKASJON:                                                   */00000090
 /*    R0016031 - R0016021 (PROC-SAMLING) DELT OPP. BØ9112            */00000100
 /* HENSIKT:                                                          */00000110
 /*    EN FUNKSJON SOM KOVERTERER SIVILSTAND FRA RF- TIL SR-STANDARD  */00000120
 /* PROGRAMTILKNYTNING:                                               */00000130
 /*    LOKAL PROSEDYRE I R0016001                                     */00000140
 /* ENDRET UKE 7 1994 AV SVERRE LUNDEBY,DATA-UTVIKLING A/S            */00000150
 /*                   PT1 = K ==> SVAR = 21                           */00000160
 /* ENDRET UKE 15 1994 AV SVERRE LUNDEBY,DATA-UTVIKLING A/S           */00000170
 /*            NYE SIVILSTANDSKODER                                  */ 00000180
 /* ENDRET UKE 15 1996 AV SVERRE LUNDEBY,DATA-UTVIKLING A/S           */00000190
 /*                   NY KODE=32 : ETTERL.SAMBOER (PT1/PT2=E OG SIV=W)*/00000200
 /* ENDRET UKE 01 1998 AV SVERRE LUNDEBY,DATA-UTVIKLING A/S           */00000210
 /*                   NY KODE=09 : SAMBOERE IKKE BARN (         SIV=V)*/00000220
 /* ENDRET UKE 30 1998 AV SVERRE LUNDEBY,DATA-UTVIKLING A/S           */00000230
 /*            FEIL TEST VED RF0_SS=S,W TILLEGG V/RF0_SS=E            */00000240
 /*********************************************************************/00000250
                                                                        00000260
 F_KONV_SIVILSTAND: PROC (RF0_SS) RETURNS (PIC '99');                   00000270
                                                                        00000280
    DCL RF0_SS               CHAR (1); /* SIVILSTAND HOVED-BASEN (RF) */00000290
    DCL SVAR                 PIC '99'; /* SIVILSTAND STATISTKK-BASEN  */00000300
                                                                        00000310
    SELECT(RF0_SS);                                                     00000320
       WHEN ('G')                                                       00000330
          SELECT(B02.PERSON(3-I).STATUS.PENSJONSTYPE1);                 00000340
             WHEN ('A') SVAR = 21;                                      00000350
             WHEN ('K') SVAR = 21;                                      00000360
             WHEN ('U') SVAR = 22;                                      00000370
             WHEN ('V') SVAR = 22;                                      00000380
             WHEN ('Y') SVAR = 22;                                      00000390
             WHEN ('F') SVAR = 23;                                      00000400
             OTHERWISE  SVAR = 29;                                      00000410
          END; /* OF SELECT */                                          00000420
       WHEN ('U') SVAR = 10;                                            00000430
       WHEN ('A') SVAR = 24;                                            00000440
       WHEN ('S')                                                       00000450
            IF B02.PERSON(I).STATUS.PENSJONSTYPE1 = 'E' !    /*9807SL*/ 00000460
               B02.PERSON(I).STATUS.PENSJONSTYPE2 = 'E' THEN /*9807SL*/ 00000470
               SVAR = 31;                                               00000480
            ELSE                                                        00000490
               SVAR = 40;                                               00000500
       WHEN ('E')                                                       00000510
            IF B02.PERSON(3-I).STATUS.SIVILSTAND = 'S' THEN /*9807SL*/  00000520
               SVAR = 31;                                   /*9807SL*/  00000530
            ELSE IF                                                     00000540
               B02.PERSON(3-I).STATUS.SIVILSTAND = 'W' THEN /*9807SL*/  00000550
               SVAR = 32;                                   /*9807SL*/  00000560
            ELSE                                                        00000570
               SVAR = 30;                                               00000580
       WHEN ('P') SVAR = 60;                                            00000590
       WHEN ('W')                                                       00000600
            IF B02.PERSON(I).STATUS.PENSJONSTYPE1 = 'E' !    /*9807SL*/ 00000610
               B02.PERSON(I).STATUS.PENSJONSTYPE2 = 'E' THEN /*9807SL*/ 00000620
               SVAR = 32;                                               00000630
            ELSE                                                        00000640
               SVAR = 00;                                               00000650
       WHEN ('V') SVAR = 09;                                            00000660
       OTHERWISE  SVAR = 99;                                            00000670
    END; /* OF SELECT */                                                00000680
    RETURN(SVAR);                                                       00000690
 END; /* F_KONV_SIVILSTAND */                                           00000700
                                                                        00000710
