 /*       SIST ENDRET 18/08-95 12.59.39 AV   TSB0310                  */00000000
 /*       SIST ENDRET 25/02-94 13.09.47 AV   HERMAN                   */00000010
 /*       SIST ENDRET 02/11-93 09.36.35 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 15/09-89 10.49.21 AV   TRUDE                    */00000030
 /*       SIST ENDRET 16/08-89 09.02.53 AV   TRUDE                    */00000040
 /*       SIST ENDRET 08/08-89 08.52.35 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 29/03-89 13.49.00 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 07/02-89 13.11.23 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 14/12-88 14.18.14 AV   DYBVIK                   */00000080
 /* ***************************************************************** */00000090
 /*                                                                   */00000100
 /* ***************************************************************** */00000110
 /*IDENTIFIKASJON:                                                    */00000120
 /* **********************                                            */00000130
 /*  PROGRAM-IDENT : R0011901 KONTROLL_GRUNNBLANKETT_AFP HOVEDPROG    */00000140
 /*  PROGRAM-SPRÅK : PLI - CICS                                       */00000150
 /*  PROGRAMMERER  : SATISH PATHAK                                    */00000160
 /*  PROGRAMMET BLE LAGET : 1988                                      */00000170
 /*  ENDRINGERSDATO :                                                 */00000180
 /*  ENDRINGEN GJELDER:                                               */00000190
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000200
 /*                                                                   */00000210
 /* ***************************************************************** */00000220
 /*HENSIKT:                                                           */00000230
 /* **********                                                        */00000240
 /*  PROGRAMMET KONTROLLERER AFP (AVTALEFESTET FØRTIDSPENSJON)        */00000250
 /*  BLANKETTEN KONTROLLERES ISOLERT - IKKE MOT STATUS.               */00000260
 /*  OPERATØREN KAN BRUKE PF-TASTENE :                                */00000270
 /*    PF1  FØRER TIL OPPBEVARING AV TRANSEN I VENTEREGISTERET.       */00000280
 /*    PF2  FØRER TIL AT TRANSAKSJONEN FORKASTES -                    */00000290
 /*    I BEGGE TILFELLER SKRIVES DET UT MELDING PÅ SKJERM, OG         */00000300
 /*    PROGRAM R0010401 SØRGER FOR Å LEGGE UT NYTT BILDE FOR          */00000310
 /*    REGISTRERING AV AFP - TRANSKODE R041.                          */00000320
 /*  NÅR INGEN FEIL MER FINNES SETTES TRANSKODE = R042, OG DET        */00000330
 /*  RETURNERES TIL R0010401.                                         */00000340
 /*                                                                   */00000350
 /* ***************************************************************** */00000360
 /*PROGRAMTILKNYTTING:                                                */00000370
 /* ********************                                              */00000380
 /*  PROGRAMMETS TRANSKODER ER R190, R191, R192, R193, R194.          */00000390
 /*  PROGRAMMET KALLES FRA R0010401 - REGISTRERING, MED               */00000400
 /*  TRANSKODE 'R190'.                                                */00000410
 /*  PROGRAMMET HAR EXEC CICS XCTL TIL :                              */00000420
 /*             R0010301 - VALG_AV_FUNKSJON                           */00000430
 /*             R0010401 - REGISTRERING                               */00000440
 /*  PROGRAMMET HAR EXEC CICS LINK TIL :                              */00000450
 /*             R0010490 - SKRIV_UT_PÅ_VENTEREG                       */00000460
 /*  PROGRAMMET INCLUDER :                                            */00000470
 /*             R0011902  -  BLANK_ARBEIDSOMRÅDE                      */00000480
 /*             R0011903  -  KONTROLL_SØKER                           */00000490
 /*             R0011905  -  KONTROLL_SPESIELLE_OPPLYSNINGER          */00000500
 /*             R0011906  -  FLYTT_FRA_ARBEIDSOMRÅDE_TIL_MAP          */00000510
 /*             R0011908  -  BEREGN_TT_AFP                            */00000520
 /*             R0011909  -  FLYTT_FRA_MAP_TIL_ARBEIDSOMRÅDE          */00000530
 /*             R0019901  -  TEST OM DATO ER GYLDIG                   */00000540
 /*             R0019902  -  FINNE KJØNN                              */00000550
 /*             R0019903  -  ER EKTEFELLES ALDER GYLDIG               */00000560
 /*             R0019904  -  FØDSELSNUMMERKONTROLL                    */00000570
 /*             R0019905  -  BEREGN_ALDER                             */00000580
 /*             R0019907  -  TABELLSØKING                             */00000590
 /*             R0019910  -  NUMERISK KONTROLL                        */00000600
 /*             R0019911  -  DATO_KONTROLL                            */00000610
 /*             R0019912  -  KONVERTERING CHAR ==> PIC OG OMV.        */00000620
 /*             R0019944  -  SKRIV_FEIL                               */00000630
 /*             R0019964  -  DAGENS DATO + 6 MDR                      */00000640
 /*  PROGRAMMET BRUKER MAPSET S001193 - AFP                           */00000650
 /*         MAP S001191   -  REGISTRERING AV AFP-TRANS                */00000660
 /* ***************************************************************** */00000670
 /*DATASETTOPPLYSNINGER:                                              */00000680
 /* ***********************                                           */00000690
 /*  FØDSELSNR-ENDRINGSREG BLIR LEST I SUBPROGRAM R0011903 VED        */00000700
 /*  CALL TIL PROGRAM R0019906.                                       */00000710
 /*                                                                   */00000720
 /* ***************************************************************** */00000730
 /*FEILMELDINGER:                                                     */00000740
 /* *******************                                               */00000750
 /*                                                                   */00000760
 /*  SKRIVES UT PÅ SKJERMBILDET                                       */00000770
 /*                                                                   */00000780
 /* ***************************************************************** */00000790
 R00119:                                                                00000800
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000810
 %PAGE;                                                                 00000820
      %INCLUDE S00119;                 /* AFP-MAPSETTET   */            00000830
 %PAGE;                                                                 00000840
      %INCLUDE P0011901;               /* TRANS-OMR FOR AFP          */ 00000850
 %PAGE;                                                                 00000860
      %INCLUDE P0019906;               /* TRANS_OPPL_OMR (BASED) */     00000870
 %PAGE;                                                                 00000880
      %INCLUDE P0019908;               /* KOM_OMRÅDE (BASED) */         00000890
 %PAGE;                                                                 00000900
      %INCLUDE P0019910;               /* STYRINGS_OMRÅDE (BASED) */    00000910
 %PAGE;                                                                 00000920
      %INCLUDE P0019912;               /*  DIV_OMRÅDE (BASED)      */   00000930
 %PAGE;                                                                 00000940
      %INCLUDE DFHBMSCA;                                                00000950
 %PAGE;                                                                 00000960
   DCL                                                                  00000970
      (BMSMAPBR,                                                        00000980
      COMMAREA_PEKER) PTR;                                              00000990
   DCL                                                                  00001000
      (CSTG,                                                            00001010
      ADDR,                                                             00001020
      VERIFY,                                                           00001030
      UNSPEC,                                                           00001040
      ONCODE,                                                           00001050
      SUBSTR) BUILTIN;                                                  00001060
   DCL                                                                  00001070
      (FEIL_FUNNET,FEIL19,FEIL20) BIT(1),                               00001080
      FEIL_I_SØKER                BIT(1),                               00001090
   /* FEIL_I_BARN                 BIT(1), */                            00001100
      FEIL_I_SPES                 BIT(1),                               00001110
      ONKODE                      PIC'9999',                            00001120
      CURSOR_POS                  FIXED BIN(15) INIT(-1),               00001130
      ONK DEF ONKODE              CHAR(4),                              00001140
      FEILKODE                    CHAR(4),                              00001150
      DSNAVN                      CHAR(8),                              00001160
      ANT_FEIL_SKREVET            FIXED DEC (3);                        00001170
 %PAGE;                                                                 00001180
      ON ERROR SNAP                                                     00001190
      BEGIN;                                                            00001200
                                                                        00001210
         ON ERROR SYSTEM        ;                                       00001220
         ONKODE=ONCODE          ;                                       00001230
         FEILKODE = ONK         ;                                       00001240
         DSNAVN   = EIBDS       ;                                       00001250
         GO TO FEILBEH          ;                                       00001260
      END;                                                              00001270
                                                                        00001280
                                                                        00001290
 FEILKODE  = 'FEIL';                                                    00001300
 DSNAVN    = '        ';                                                00001310
                                                                        00001320
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00001330
                                                                        00001340
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00001350
                                                                        00001360
                                                                        00001370
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00001380
                                                                        00001390
 IF FRA_CICS THEN                                                       00001400
  DO;                                                                   00001410
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);00001420
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);     00001430
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);  00001440
  END;                                                                  00001450
                                                                        00001460
                                                                        00001470
 IF HENT_FRAM_MAP  THEN                                                 00001480
   DO;                                                                  00001490
     EXEC CICS SEND MAP('S001191') MAPSET('S001193') MAPONLY            00001500
     SET (BMSMAPBR);                                                    00001510
     ALLOCATE S001191O;                                                 00001520
   END;                                                                 00001530
                                                                        00001540
 RECEIVE_MAP:                                                           00001550
                                                                        00001560
                                                                        00001570
 IF ^HENT_FRAM_MAP THEN                                                 00001580
    DO;                                                                 00001590
       EXEC CICS RECEIVE MAP('S001191')                                 00001600
                 MAPSET('S001193') SET(BMSMAPBR);                       00001610
       CALL BLANK_AFP_MELDNR;                            /* R0011902 */ 00001620
       CALL MAP_SPESIAL_INFO_PROT;                                      00001630
       FEIL_MELD_NR = 0;                                                00001640
    END;                                                                00001650
                                                                        00001660
 IF FUNKSJONSKODEL > 0 THEN                                             00001670
    DO;                                                                 00001680
       FUNKSJONSKODE = FUNKSJONSKODEI;                                  00001690
       EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);            00001700
    END;                                                                00001710
                                                                        00001720
 IF STYRE_KODEL > 0 THEN                                                00001730
    DO;                                                                 00001740
       STYREKODE = STYRE_KODEI;                                         00001750
       TRANSKODE = 'R041';                                              00001760
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00001770
    END;                                                                00001780
                                                                        00001790
 IF STYREKODE ^= 'AF'  &  FRA_CICS THEN      /*   CHANGE TO */          00001800
    TRANSKODE = 'R041';                                                 00001810
                                                                        00001820
 ELSE                                                                   00001830
                                                                        00001840
  DO;                                                                   00001850
   ANT_FEIL_SKREVET = 0;                                                00001860
   FEIL_FUNNET      = '0'B;                                             00001870
   FEIL_I_SØKER     = '0'B;                                             00001880
   FEIL_I_SPES      = '0'B;                                             00001890
   TRANS_RETURKODE  = TRANSKODE;                                        00001900
                                                                        00001910
            SELECT (TRANSKODE);                                         00001920
               WHEN('R190')                                             00001930
                  DO;                                                   00001940
                     CALL BLANK_AFP_SØKER;                /* R0011902 */00001950
                     CALL BLANK_AFP_SPES;                 /* R0011902 */00001960
                     CALL BLANK_AFP_MELDNR;               /* R0011902 */00001970
                     CALL OVERFØR_AFP_SØKER;              /* R0011909 */00001980
                     CALL KONTROLL_AFP_SØKER(FEIL_I_SØKER);/*R0011903*/ 00001990
                  END;                                                  00002000
               WHEN('R191')                                             00002010
                  DO;                                                   00002020
                     CALL BLANK_AFP_MELDNR;               /* R0011902 */00002030
                     IF FUNKSJONSKODE ^= 'V' THEN                       00002040
                        DO;                                             00002050
                           CALL BLANK_AFP_SPES;           /* R0011902 */00002060
                        END;                                            00002070
                     CALL OVERFØR_AFP_SØKER;              /* R0011909 */00002080
                     CALL KONTROLL_AFP_SØKER(FEIL_I_SØKER);/*R0011903*/ 00002090
                  END;                                                  00002100
               WHEN('R192')                                             00002110
                  DO;                                                   00002120
                     CALL BLANK_AFP_MELDNR;               /* R0011902 */00002130
                     CALL BLANK_AFP_SPES;                 /* R0011902 */00002140
                     CALL OVERFØR_AFP_SØKER;              /* R0011909 */00002150
                     CALL KONTROLL_AFP_SØKER(FEIL_I_SØKER);/*R0011903*/ 00002160
                  END;                                                  00002170
               WHEN('R193' , 'R194' )                                   00002180
                  DO;                                                   00002190
                     CALL BLANK_AFP_MELDNR;               /* R0011902 */00002200
                     CALL OVERFØR_AFP_SØKER;              /* R0011909 */00002210
                     CALL OVERFØR_AFP_SPES;               /* R0011909 */00002220
                     CALL KONTROLL_AFP_SØKER(FEIL_I_SØKER);/*R0011903*/ 00002230
                     IF AFP.NORSK_BOSATT = 'J' THEN                     00002240
                        CALL BLANK_AFP_SPES;              /* R0011902 */00002250
                     ELSE                                               00002260
                        CALL KONTROLL_AFP_SPES(FEIL_I_SPES);/*R0011905*/00002270
                                                                        00002280
                  END;                                                  00002290
               OTHERWISE                                                00002300
                  ;                                                     00002310
 /* INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER */      00002320
            END;                                                        00002330
                                                                        00002340
            IF FEIL_I_SØKER = '0'B &                                    00002350
               FEIL_I_SPES  = '0'B THEN                                 00002360
               FEIL_FUNNET = '0'B;                                      00002370
            ELSE                                                        00002380
               FEIL_FUNNET = '1'B;                                      00002390
                                                                        00002400
                                                                        00002410
               IF AFP.NORSK_BOSATT = 'N' & ^FEIL_FUNNET THEN            00002420
                  TRANSKODE        = 'R193';                            00002430
                                                                        00002440
            IF ( TRANSKODE = 'R192' !                                   00002450
             TRANSKODE = 'R193' ! TRANSKODE =  'R194') &                00002460
             AFP.NORSK_BOSATT = 'J' THEN                                00002470
               TRANSKODE = 'R191';                                      00002480
                                                                        00002490
            ELSE                                                        00002500
            IF (TRANSKODE = 'R193' ! TRANSKODE = 'R194') &              00002510
                AFP.NORSK_BOSATT ='J'  THEN                             00002520
              TRANSKODE = 'R192';                                       00002530
                                                                        00002540
            ELSE                                                        00002550
            IF (TRANSKODE = 'R192' ! TRANSKODE = 'R194') &              00002560
               AFP.NORSK_BOSATT = 'N'   THEN                            00002570
                TRANSKODE = 'R193';                                     00002580
                                                                        00002590
            ELSE                                                        00002600
            IF (TRANSKODE = 'R192' ! TRANSKODE = 'R193') &              00002610
                AFP.NORSK_BOSATT ='N'         THEN                      00002620
                TRANSKODE = 'R194';                                     00002630
                                                                        00002640
            IF FEIL_FUNNET ! HENT_FRAM_MAP ! FRA_UTEN_DIALOG !          00002650
            TRANS_RETURKODE ^= TRANSKODE THEN                           00002660
                                                                        00002670
               DO;                                                      00002680
                  IF TRANSKODE = 'R190' THEN                            00002690
                     TRANSKODE = 'R191';                                00002700
                  CALL BLANK_AFP_MAP;                     /* R0011909 */00002710
                  CALL OVERFØR_AFPSØKER_MAP;             /* R0011906 */ 00002720
                  SELECT (TRANSKODE);                                   00002730
                     WHEN ('R193' , 'R194')                             00002740
                        DO;                                             00002750
                           CALL OVERFØR_AFPSPES_MAP;      /* R0011906 */00002760
                        END;                                            00002770
                     OTHERWISE                                          00002780
                        ;                                               00002790
                  END;                                                  00002800
                                                                        00002810
                IF HENT_FRAM_MAP THEN                                   00002820
                   EXEC CICS SEND MAP('S001191') MAPSET('S001193')      00002830
                                                        ERASE CURSOR;   00002840
                ELSE                                                    00002850
                   EXEC CICS SEND MAP('S001191') MAPSET('S001193')      00002860
                                            DATAONLY ERASEAUP CURSOR;   00002870
                FEIL_MELD_NR  = 666;/* => FEIL_FUNNET ER SATT. */       00002880
                HENT_FRAM_MAP = '0'B;                                   00002890
                                                                        00002900
                IF  FRA_CICS THEN                                       00002910
                    EXEC CICS RETURN TRANSID(TRANSKODE)                 00002920
                                                  COMMAREA(KOM_OMR);    00002930
                ELSE                                                    00002940
                    GO TO RECEIVE_MAP;                                  00002950
               END;                                                     00002960
                                                                        00002970
            ELSE                                                        00002980
                                                                        00002990
              DO;                                                       00003000
                                                                        00003010
                IF TRANSKODE = 'R190' THEN                              00003020
                  TRANS_RETURKODE = 'R191';                             00003030
                ELSE                                                    00003040
                  TRANS_RETURKODE = TRANSKODE;                          00003050
                IF  FRA_CICS  THEN                                      00003060
                  DO;                                                   00003070
                    BLANKETTYPE = STYREKODE;                            00003080
                    TRANSKODE = 'R042';                                 00003090
                  END;                                                  00003100
              END;                                                      00003110
                                                                        00003120
  END;                                                                  00003130
                                                                        00003140
  CALL UTGANG;                                                          00003150
                                                                        00003160
  UTGANG: PROC;                                                         00003170
    IF  FRA_CICS THEN                                                   00003180
      EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);             00003190
    ELSE                                                                00003200
      EXEC CICS RETURN;                                                 00003210
  END UTGANG;                                                           00003220
                                                                        00003230
                                                                        00003240
  FEILBEH:                                                              00003250
                                                                        00003260
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00003270
                                                                        00003280
     PROGRAM_ID = 'R0011901';                                           00003290
                                                                        00003300
     S001191O.MELDING2O =                                               00003310
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00003320
                                                                        00003330
     S001191O.MELDING3O =                                               00003340
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00003350
                                                                        00003360
     S001191O.MELDING4O =                                               00003370
       'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE !! 00003380
                                            '. DATASETT : ' !! DSNAVN;  00003390
                                                                        00003400
     S001191O.MELDING5O =                                               00003410
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00003420
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00003430
                                                                        00003440
     S001191O.MELDING6O =                                               00003450
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00003460
                                                                        00003470
                                                                        00003480
     EXEC CICS SEND MAP('S001191')                                      00003490
                                                 MAPSET('S001193');     00003500
                                                                        00003510
     EXEC CICS RECEIVE MAP('S001191')                                   00003520
                                    MAPSET('S001193') SET(BMSMAPBR);    00003530
                                                                        00003540
     CALL MAP_SPESIAL_INFO_PROT;                                        00003550
                                                                        00003560
     EXEC CICS SYNCPOINT ROLLBACK;                                      00003570
                                                                        00003580
                                                                        00003590
     TERMINERINGS_IND = 'F';                                            00003600
                                                                        00003610
     TRANSKODE  = 'R041';                                               00003620
                                                                        00003630
     CALL UTGANG;                                                       00003640
                                                                        00003650
  ABEND:                                                                00003660
     EXEC CICS ABEND ABCODE(FEILKODE);                                  00003670
                                                                        00003680
  PF1:                                                                  00003690
                                                                        00003700
 /* LEGGER UNDERKJENT TRANS UT PÅ VENTEDATABASE HVIS GYLDIG     */      00003710
 /* FNR OG VIRKNINGSDATO,ELLERS FORKASTES TRANSAKSJONEN.        */      00003720
                                                                        00003730
     IF ^(AFP.FNRNR = 1          !                                      00003740
          AFP.FNRNR = 200        !                                      00003750
          AFP.VIRK_DATO_MÅNR = 9 !                                      00003760
          AFP.VIRK_DATO_MÅNR = 200) THEN                                00003770
        DO;                                                             00003780
                                                                        00003790
           IF FØDSNUMMER    = 0   THEN                                  00003800
                                                                        00003810
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER FORKASTET.           */      00003820
                                                                        00003830
              DO;                                                       00003840
                 FEIL_MELD_NR  = 0;                                     00003850
                 S001191O.MELDING6O =                                   00003860
                         'REGISTERINGEN ER IKKE AVSLUTTET MED "ENTER"'!!00003870
                         '.TRANSAKSJONEN ER FORKASTET.';                00003880
              END;                                                      00003890
           ELSE                                                         00003900
              DO;                                                       00003910
                                                                        00003920
                 SEARCH_FNR  = TRANS_OPPL_OMR.FØDSNUMMER;               00003930
                 IF FRA_CICS THEN                                       00003940
                    BLANKETTYPE = STYREKODE;                            00003950
                                                                        00003960
                                                                        00003970
                 IF FEIL_MELD_NR = 666 &      /*BLANKETTKONTROLLFEIL*/  00003980
                    ^FRA_MED_DIALOG     THEN  /*IKKE BASEKONTROLLFEIL*/ 00003990
                    FUNKSJONSKODE = 'B';                                00004000
                                                                        00004010
                 CALL BLANK_AFP_MELDNR;                  /* R0011902 */ 00004020
                                                                        00004030
                                                                        00004040
                 IF AFP.NORSK_BOSATT = 'N' THEN                         00004050
                    CALL OVERFØR_AFPSPES_MAP;            /* R0011906 */ 00004060
                                                                        00004070
                 EXEC CICS LINK PROGRAM('R0010490') COMMAREA(KOM_OMR);  00004080
                                                                        00004090
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER LAGT UT PÅ VENTEBASE.*/      00004100
                                                                        00004110
                 S001191O.MELDING6O =                                   00004120
                         'TRANSAKSJONEN ER LAGT UT PÅ VENTEREGISTER.';  00004130
              END;                                                      00004140
                                                                        00004150
                                                                        00004160
           EXEC CICS SEND MAP('S001191') MAPSET('S001193')              00004170
                                                           DATAONLY;    00004180
     /* DUMMY SEND-KALL.                              */                00004190
                                                                        00004200
           EXEC CICS SEND MAP('S001191')                                00004210
                                                  MAPSET('S001193');    00004220
           EXEC CICS DELAY INTERVAL(005);                               00004230
                                                                        00004240
           TERMINERINGS_IND = 'F';                                      00004250
                                                                        00004260
           TRANSKODE  = 'R041';                                         00004270
                                                                        00004280
           CALL UTGANG;                                                 00004290
                                                                        00004300
        END;                                                            00004310
     ELSE                                                               00004320
        DO;                                                             00004330
           TERMINERINGS_IND = 'F';                                      00004340
                                                                        00004350
           TRANSKODE = 'R041';                                          00004360
                                                                        00004370
           S001191O.MELDING6O =                                         00004380
                                                                        00004390
   'NB** TRANSAKSJONEN ER FORKASTET P.G.A. UGYLDIG FNR EL. VDATO **NB'; 00004400
                                                                        00004410
           EXEC CICS SEND MAP('S001191') MAPSET('S001193')              00004420
                                                           DATAONLY;    00004430
     /* DUMMY SEND-KALL.                            */                  00004440
                                                                        00004450
           EXEC CICS SEND MAP('S001191')                                00004460
                                    MAPSET('S001193');                  00004470
                                                                        00004480
           EXEC CICS DELAY INTERVAL(005);                               00004490
           CALL UTGANG;                                                 00004500
        END;                                                            00004510
                                                                        00004520
                                                                        00004530
  PF2:                                                                  00004540
     TERMINERINGS_IND   = 'F';                                          00004550
                                                                        00004560
     S001191O.MELDING6O =                                               00004570
                                                                        00004580
      'NBNBNBNBNB***    TRANSAKSJONEN ER FORKASTET.    ***NBNBNBNBNB';  00004590
                                                                        00004600
     EXEC CICS SEND MAP('S001191') MAPSET('S001193')                    00004610
                                                      DATAONLY ;        00004620
     /* DUMMY SEND-KALL.                                     */         00004630
                                                                        00004640
     EXEC CICS SEND MAP('S001191')                                      00004650
                                    MAPSET('S001193');                  00004660
     EXEC CICS DELAY INTERVAL(005);                                     00004670
                                                                        00004680
                                                                        00004690
     TRANSKODE = 'R041';                                                00004700
     CALL UTGANG;                                                       00004710
                                                                        00004720
                                                                        00004730
  MAP_SPESIAL_INFO_PROT:                                                00004740
               PROC;                                                    00004750
     /*----------------------------------------------*/                 00004760
     /* SPESIAL OPPLYSNINGER FELTER ER BLOKET        */                 00004770
     /*----------------------------------------------*/                 00004780
     /*----------------------------------------------*/                 00004790
      S001191O.TT_F67A       =  DFHBMPRO;                               00004800
      S001191O.TT_E66_ÅA     =  DFHBMPRO;                               00004810
      S001191O.TT_E66_MA     =  DFHBMPRO;                               00004820
      S001191O.STATSBORGERA  =  DFHBMPRO;                               00004830
      S001191O.BOSATTA       =  DFHBMPRO;                               00004840
      S001191O.FRAVIK_FLYKTA =  DFHBMPRO;                               00004850
      S001191O.OVERKOMP_UTLA =  DFHBMPRO;                               00004860
      S001191O.FRAVIK_19_3A  =  DFHBMPRO;                               00004870
                                                                        00004880
  END MAP_SPESIAL_INFO_PROT;                                            00004890
 %PAGE;                                                                 00004900
      %INCLUDE R0011902;               /* BLANK  ARBEIDSOMRÅDE      */  00004910
 %PAGE;                                                                 00004920
      %INCLUDE R0011903;               /* KONTROLL AV SØKERDELEN    */  00004930
 %PAGE;                                                                 00004940
      %INCLUDE R0011905;               /* KONTROLL AV SPESIELLE     */  00004950
                                       /* OPPLYSNINGER              */  00004960
 %PAGE;                                                                 00004970
      %INCLUDE R0011906;               /* ARBEIDSOMRÅDE -> MAP      */  00004980
 %PAGE;                                                                 00004990
      %INCLUDE R0011908;               /* BEREGN TT AP              */  00005000
 %PAGE;                                                                 00005010
      %INCLUDE R0011909;               /* MAP -> ARBEIDSOMRÅDE      */  00005020
 %PAGE;                                                                 00005030
      %INCLUDE R0019901;               /* TESTER OM DATO ER GYLDIG  */  00005040
 %PAGE;                                                                 00005050
      %INCLUDE R0019902;               /* FINNE KJØNN               */  00005060
 %PAGE;                                                                 00005070
      %INCLUDE R0019903;               /* EKTEFELLES ALDER GYLDIG   */  00005080
 %PAGE;                                                                 00005090
      %INCLUDE R0019904;               /* FØDSELSNUMMERKONTROLL     */  00005100
 %PAGE;                                                                 00005110
      %INCLUDE R0019905;               /* BEREGNER ALDER            */  00005120
 %PAGE;                                                                 00005130
      %INCLUDE R0019910;               /* NUMERISK KONTROLL         */  00005140
 %PAGE;                                                                 00005150
      %INCLUDE R0019911;               /* DATO KONTROLL             */  00005160
 %PAGE;                                                                 00005170
      %INCLUDE R0019912;               /* KONVERTERING CHAR ==> PIC */  00005180
                                       /* PIC ==> CHAR              */  00005190
 %PAGE;                                                                 00005200
      %INCLUDE R0019913;               /* F_SNU_DATO                */  00005210
 %PAGE;                                                                 00005220
      %INCLUDE R0019944;               /* SKRIV_FEIL      */            00005230
 %PAGE;                                                                 00005240
      %INCLUDE R0019964;               /* DAGENS DATO PLUSS 6 MDR   */  00005250
                                                                        00005260
   END R00119;                                                          00005270
