  /* *************************************************************** */ 00000000
  /* IDENTIFIKASJON:   R0017202                                      */ 00000010
  /* PROGRAMMERER:  HELEN    JULI, 1982                              */ 00000020
  /* HENSIKT:                                                        */ 00000030
  /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT    */ 00000040
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */ 00000050
  /*        HVER AJOURFØRT TRANSAKSJON.                              */ 00000060
  /* PROGRAMTILKNYTNING:                                             */ 00000070
  /*        PROGRAMMET KALLES OPP AV R0017001                        */ 00000080
  /*                                                                 */ 00000090
  /* *************************************************************** */ 00000100
  LAG_ALDERSP_HEND:                                                     00000110
      PROC (PERSON_IND,EK_IND) OPTIONS (MAIN);                          00000120
  DCL 1 B01 BASED(B02_PEKER), %INCLUDE P0019921;                        00000130
  DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                        00000140
  /* *************************************************************** */ 00000150
  /*                                                                 */ 00000160
  /*   ARBEIDSOMRÅDE FOR  ROT_OPPLYSNINGER                           */ 00000170
  /*                                                                 */ 00000180
  /* *************************************************************** */ 00000190
  %SKIP;                                                                00000200
   DCL 1  W_ROT,                                                        00000210
          2   FNR                           FIXED DEC (11),             00000220
          2   NESTE_SB_VERSJON_NR           FIXED DEC (1),              00000230
          2   SISTE_TERMINAL_NR             FIXED DEC (1),              00000240
          2   SISTE_REGISTRERINGSTIDSPUNKT  FIXED DEC (11),             00000250
          2   PENSJTYP                      FIXED DEC (1),              00000260
          2   NAVN                              CHAR (25),              00000270
          2   TKNR                          FIXED DEC (5),              00000280
          2   SPRÅK                         FIXED DEC (1);              00000290
  /* *************************************************************** */ 00000300
  /*                                                                 */ 00000310
  /*   ARBEIDSOMRÅDE FOR HENDELSE_OPPLYSNINGER                       */ 00000320
  /*                                                                 */ 00000330
  /* *************************************************************** */ 00000340
  %SKIP;                                                                00000350
   DCL 1  W_HENDELSE,                                                   00000360
          2   HENDDATO                 FIXED DEC (11),                  00000370
          2   VERSJON                  FIXED DEC (3),                   00000380
          2   TERMINAL                 FIXED DEC (3),                   00000390
          2   FNR_EKTEF                FIXED DEC (11),                  00000400
          2   NAVN_EKTEF                    CHAR (25),                  00000410
          2   TEKSTYPE_A_KODE          FIXED DEC (1),                   00000420
          2   GP                       FIXED DEC (5),                   00000430
          2   TP                       FIXED DEC (5),                   00000440
          2   ST                       FIXED DEC (5),                   00000450
          2   KT                       FIXED DEC (3),                   00000460
          2   ET                       FIXED DEC (5),                   00000470
          2   BT                       FIXED DEC (5),                   00000480
          2   ANTALL_BARN              FIXED DEC (2),                   00000490
          2   VT_GP                    FIXED DEC (5),                   00000500
          2   VT_TP                    FIXED DEC (5),                   00000510
          2   TILLEGG_8_5_1            FIXED DEC (1),                   00000520
          2   TEKSTYPE_B1_KODE         FIXED DEC (1),                   00000530
          2   TEKSTYPE_B2_KODE         FIXED DEC (1),                   00000540
          2   APD                      FIXED DEC (3),                   00000550
          2   ØNSKET_APD               FIXED DEC (3),                   00000560
          2   UF_GRAD                  FIXED DEC (3),                   00000570
          2   TT                       FIXED DEC (3),                   00000580
          2   TT_EK                    FIXED DEC (3),                   00000590
          2   TEKSTYPE_C_KODE          FIXED DEC (1),                   00000600
          2   TEKSTYPE_D_KODE          FIXED DEC (1);                   00000610
  /* *************************************************************** */ 00000620
  /*                                                                 */ 00000630
  /*     ARBEIDSOMRÅDE FOR BEREGNINGSVEDLEGGSOPPLYSNINGER            */ 00000640
  /*                                                                 */ 00000650
  /* *************************************************************** */ 00000660
  %SKIP;                                                                00000670
   DCL 1  W_BERVEDL,                                                    00000680
          2   AAR                          FIXED DEC (2),               00000690
          2   G                            FIXED DEC (1),               00000700
          2   PI                           FIXED DEC (5),               00000710
          2   UFGRAD                       FIXED DEC (3),               00000720
          2   PP                           FIXED DEC (1),               00000730
          2   TEKSTYPE_D_KODE              FIXED DEC (1),               00000740
          2   TEKSTYPE_E_KODE              FIXED DEC (1),               00000750
          2   PI_EKTEF                     FIXED DEC (5),               00000760
          2   UFGRAD_EKTEF                 FIXED DEC (3),               00000770
          2   PP_EKTEF                     FIXED DEC (1),               00000780
          2   TEKSTYPE_E_KODE_EKTEF        FIXED DEC (1),               00000790
          2   SLUTTPOENGTALL               FIXED DEC (1),               00000800
          2   SPT                          FIXED DEC (1),               00000810
          2   SPT_EKTEF                    FIXED DEC (1),               00000820
          2   OPT                          FIXED DEC (1),               00000830
          2   OPT_EKTEF                    FIXED DEC (1);               00000840
  %SKIP;                                                                00000850
 DCL  PERSON_IND,                                                       00000860
      EK_IND                               FIXED BIN(15);               00000870
 DCL  HENDELSE_KEY_INDEX                   FIXED BIN(15);               00000880
 DCL  HENDELSE_KEY,                                                     00000890
      HENDELSE_NØKKEL                      CHAR (10);                   00000900
  /* *************************************************************** */ 00000910
  /* ARBEIDSOMRÅDE FOR OPPBEVARING AV FNR. OG ROT INFORMASJON        */ 00000920
  /* SOM BRUKES I JUSTER_SB_ROT_SEGMENT.                             */ 00000930
  /* *************************************************************** */ 00000940
 DCL  1  FNR_TABELL(14),                                                00000950
         2    FNR             FIXED DEC(11),                            00000960
         2    PENSJTYP             CHAR(1),                             00000970
         2    NAVN                 CHAR(25),                            00000980
         2    TKNR            FIXED DEC(5),                             00000990
         2    SPRÅK                CHAR(1);                             00001000
  /* *************************************************************** */ 00001010
  /* PROGRAMMET BEGYNNER HER. VI FINNER FNR. I FNR_TABELL ELLER      */ 00001020
  /* FØRSTE LEDIGE PLASS I FNR_TABELL.                               */ 00001030
  /* PROC A ER FELLES FOR ALLE LAG_HENDELSER FOR VOKSNE.             */ 00001040
  /* *************************************************************** */ 00001050
 A: PROC;                                                               00001060
    DO I = 1 TO 14 ;                                                    00001070
       IF FNR_TABELL.FNR(I) = B02.MF.RFOPERSN.FNR(PERSON_IND)  THEN     00001080
          DO;                                                           00001090
             F_IND = I;                                                 00001100
             I = 14;                                                    00001110
          END;                                                          00001120
       ELSE                                                             00001130
          IF FNR_TABELL.FNR(I) = 0   THEN                               00001140
             DO;                                                        00001150
                F_IND = I;                                              00001160
                FNR_TABELL.FNR(F_IND) =                                 00001170
                            B02.MF.RFOPERSN.FNR(PERSON_IND);            00001180
                I = 14;                                                 00001190
             END;                                                       00001200
          ELSE                                                          00001210
             IF I = 14  THEN                                            00001220
                CALL FEIL_MELDING ;                                     00001230
    END;                                                                00001240
    FNR_TABELL.PENSJTYP(F_IND) =                                        00001250
                              B02.MF.STATUS.PENSJONSTYPE1(PERSON_IND);  00001260
    FNR_TABELL.NAVN(F_IND) =  B02.MF.RFOPERSN.NAVN(PERSON_IND);         00001270
    FNR_TABELL.TKNR(F_IND) =  B02.MF.RFOPERSN.TKNR(PERSON_IND);         00001280
    FNR_TABELL.SPRÅK(F_IND) = B02.MF.FROPERSN.SPRÅK(PERSON_IND);        00001290
    W_HENDELSE.HENDDATO   =    B02.MF.STATUS.VIRKDATO_ÅM(BARN_IND);     00001300
    W_HENDELSE.VERSJON    =    SBROT.SISTE_SB_VERSJON_NR;               00001310
    W_HENDELSE.TERMINAL   =    EIBLK.EIBTRMID;                          00001320
    W_HENDELSE.FNR_EKTEF  =    B02.MF.RFOPERSN.FNR(EK_IND);             00001330
    W_HENDELSE.NAVN_EKTEF  =    B02.MF.RFOPERSN.NAVN(EK_IND);           00001340
    CALL  PLASSER_TEKSTYPE_A_KODE ;                                     00001350
    END;                                                                00001360
 B: PROC;                                                               00001370
    W_HENDELSE.GP         =    B02.MF.ALDERSP.GP(PERSON_IND);           00001380
    W_HENDELSE.TP         =    B02.MF.ALDERSP.TP(PERSON_IND);           00001390
    W_HENDELSE.ST         =    B02.MF.ALDERSP.ST(PERSON_IND);           00001400
    W_HENDELSE.KT         =    B02.MF.ALDERSP.KT(PERSON_IND);           00001410
    W_HENDELSE.ET         =    B02.MF.ALDERSP.ET(PERSON_IND);           00001420
    W_HENDELSE.BT         =    B02.MF.ALDERSP.BT(PERSON_IND);           00001430
    W_HENDELSE.ANTALL_BARN =   B02.MF.STATUS.ANTALL_BARN(PERSON_IND);   00001440
    W_HENDELSE.VT_GP      =    B02.MF.ALDERSP.VT_GP(PERSON_IND);        00001450
    W_HENDELSE.VT_TP      =    B02.MF.ALDERSP.VT_TP(PERSON_IND);        00001460
    CALL  PLASSER_TEKSTYPE_B1_KODE;                                     00001470
    CALL  PLASSER_TEKSTYPE_B2_KODE;                                     00001480
  /* *************************************************************** */ 00001490
  /* FØLGENDE  3 FELT SKAL EVT. REDIGERES INN I TEKSTTYPE B1.        */ 00001500
  /* *************************************************************** */ 00001510
    W_HENDELSE.APD        =    B02.MF.ALDERSP.APD(PERSON_IND);          00001520
    IF B02.MF.ALDERSP.P67_KODE = 3  THEN                                00001530
       W_HENDELSE.ØNSKET_ADP   = B02.MF.ALDERSP.APD(PERSON_IND);        00001540
    ELSE                                                                00001550
       W_HENDELSE.ØNSKET_ADP   = 0;                                     00001560
    W_HENDELSE.TT         =    B02.MF.STATUS.TT_ANV(PERSON_IND);        00001570
    W_HENDELSE.TT         =    B02.MF.STATUS.TT_ANV(EK_IND);            00001580
    CALL  PLASSER_TEKSTYPE_C_KODE;                                      00001590
    CALL  PLASSER_TEKSTYPE_D_KODE;                                      00001600
    END;                                                                00001610
  /* *************************************************************** */ 00001620
  /* HENDELSE SEGMENT SKRIVES UT.                                    */ 00001630
  /* *************************************************************** */ 00001640
    CALL INSERT_HEND_OG_DE_ØVRIGE_SEGMENTER;                            00001650
  /* *************************************************************** */ 00001660
  /*VI OPPBEVARER NØKKEL TIL HENDELSE SEGMENT I TILFELLE VI MÅ FJERNE*/ 00001670
  /*DEN DERSOM DET OPPSTÅR FEIL VED BEHANDLING AV SENERE HENDELSER.  */ 00001680
  /* *************************************************************** */ 00001690
    HENDELSE_NØKKEL =   HENDDATO!!VERSJON!!TERMINAL;                    00001700
    HENDELSE_KEY_INDEX = HENDELSE_KEY_INDEX + 1;                        00001710
    HENDELSE_KEY(HENDELSE_KEY_INDEX) = HENDELSE_NØKKEL;                 00001720
  /* *************************************************************** */ 00001730
  /*HENDELSE_NØKKEL ER  HENDATO:VERSJON:TERMINAL                     */ 00001740
  /* *************************************************************** */ 00001750
    IF W_HENDELSE.TP > 0                                                00001760
       & B02.MF.ALDERSP.TP(PERSON_IND) ^=                               00001770
                             B01.MF.ALDERSP.TP(PERSON_IND) THEN         00001780
       THEN                                                             00001790
       CALL BYGG_OPP_BEREGNINGS_VEDLEGG_SEGMENT;                        00001800
  END  LAG_ALDERSP_HEND;                                                00001810
