 /*       SIST ENDRET 05/10-82 12.44.41 AV   LUNDEBY                  */00000000
 /* ***************************************************************** */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /*    R0011005 PLI          JAN Y. OLSEN                             */00000030
 /*    PROGRAMMET ER LAGET I AUGUST 1981.                             */00000040
 /*HENSIKT:                                                           */00000050
 /*    KONTROLLERE SPES.INFO DELEN PÅ GRUNNBLANKETT FORELDRELØSE      */00000060
 /*    BARN.                                                          */00000070
 /*BRUKES:                                                            */00000080
 /*    CALL KONTROLL_FB_SPES(FEIL_I_FB_SPES);                         */00000090
 /*PARAMETRE INN:                                                     */00000100
 /*    INGEN, MEN BRUKER FBSP DATAENE I FB_TRANS_OMR.                 */00000110
 /*PARAMETRE UT :                                                     */00000120
 /*    FEIL_FUNNET                                                    */00000130
 /* ***************************************************************** */00000140
 KONTROLL_FB_SPES:                                                      00000150
   PROC(FEIL_FUNNET);                                                   00000160
 %PAGE;                                                                 00000170
   DCL                                                                  00000180
      FEIL_FUNNET BIT(1);                                               00000190
   DCL                                                                  00000200
      HJ_FELT_3 CHAR(3);                                                00000210
   DCL                                                                  00000220
      FEIL BIT(1),                                                      00000230
      SUM PIC'99';                                                      00000240
   DCL                                                                  00000250
      ANT_BARN FIXED BIN (15);                                          00000260
   DCL                                                                  00000270
      TYPE CHAR(1),                                                     00000280
      DATO CHAR(6);                                                     00000290
 %SKIP(2);                                                              00000300
      FEIL_FUNNET = '0'B;                                               00000310
 %PAGE;                                /*    */                         00000320
     /* MORDELEN */                                                     00000330
 /* ***************************************************************** */00000340
 /* TESTER OM FORUTSETNINGENE FOR Å KONTROLLERE FELTENE I SPES.INFO   */00000350
 /* MOR DELEN ER TILSTEDE D.V.S:                                      */00000360
 /* -STATSBORGER MÅ VÆRE FYLLT UT                                     */00000370
 /* -BOSATT MÅ VÆRE FYLLT UT                                          */00000380
 /* -TRYGDETID MÅ VÆRE STØRRE ENN 0                                   */00000390
 /* ***************************************************************** */00000400
      IF STATSBORGER_M = 0 & BOSATT_M = 0 &                             00000410
        TT_F67_M = 0 &                                                  00000420
        TT_E66_Å_M = 0 & TT_E66_M_M = 0 THEN                            00000430
         DO;                                                            00000440
            FEIL_FUNNET = '1'B;                                         00000450
            STATSBORGER_MNR = 37;                                       00000460
            BOSATT_MNR = 999;                                           00000470
            TT_F67_MNR = 999;                                           00000480
            TT_E66_Å_MNR = 999;                                         00000490
            TT_E66_M_MNR = 999;                                         00000500
         END;                                                           00000510
      ELSE                                                              00000520
         DO;                                                            00000530
 /*************************/                                            00000540
 /* FELTKONTROLLER........*/                                            00000550
 /*************************/                                            00000560
            HJ_FELT_3 = STATSBORGER_M;                                  00000570
            IF F_TABSØKC_FUNNET(HJ_FELT_3,SB_MAX, STATSB_KODE)THEN      00000580
               DO;                                                      00000590
                  FEIL_FUNNET = '1'B;                                   00000600
                  STATSBORGER_MNR = 24;                                 00000610
               END;                                                     00000620
            HJ_FELT_3 = BOSATT_M;                                       00000630
            IF F_TABSØKC_FUNNET(HJ_FELT_3,SB_MAX, STATSB_KODE) THEN     00000640
               DO;                                                      00000650
                  FEIL_FUNNET = '1'B;                                   00000660
                  BOSATT_MNR = 25;                                      00000670
               END;                                                     00000680
            IF TRYGDET_3ÅR_M ^= 'J' ! TRYGDET_3ÅR_M ^= 'N'              00000690
            THEN                                                        00000700
               DO;                                                      00000710
                  FEIL_FUNNET = '1'B;                                   00000720
                  TRYGDET_3ÅR_MNR = 56;                                 00000730
               END;                                                     00000740
 %PAGE;                                                                 00000750
            IF ^(FRAVIK_19_3_M =' ' & FRAVIK_19_3_M < '9')              00000760
            THEN                                                        00000770
               DO;                                                      00000780
                  FEIL_FUNNET = '1'B;                                   00000790
                  FRAVIK_19_3_MNR = 28;                                 00000800
               END;                                                     00000810
            IF FRAVIK_FLYKT_M ^= ' ' ! FRAVIK_FLYKT_M ^= 'J'            00000820
            THEN                                                        00000830
               DO;                                                      00000840
                  FEIL_FUNNET = '1'B;                                   00000850
                  FRAVIK_FLYKT_MNR = 26;                                00000860
               END;                                                     00000870
            IF OVERKOMP_M ^= ' ' ! OVERKOMP_M ^= 'J'                    00000880
            THEN                                                        00000890
               DO;                                                      00000900
                  FEIL_FUNNET = '1';                                    00000910
                  OVERKOMP_MNR = 35;                                    00000920
               END;                                                     00000930
            IF ^ STATSBORGER_M = '000' &                                00000940
            (OVERKOMP_M = 'J' ! OVERKOMP_M = 'N') THEN                  00000950
               DO;                                                      00000960
                  FEIL_FUNNET = '1'B;                                   00000970
                  OVERKOMP_MNR = 35;                                    00000980
               END;                                                     00000990
       END;                                                             00001000
 /*  FARDELEN  */                                                       00001010
 %PAGE;                                /*    */                         00001020
 /* ***************************************************************** */00001030
 /* TESTER OM FORUTSETNINGENE FOR Å KONTROLLERE FELTENE I SPES.INFO   */00001040
 /* FAR DELEN ER TILSTEDE D.V.S:                                      */00001050
 /* -STATSBORGER MÅ VÆRE FYLLT UT                                     */00001060
 /* -BOSATT MÅ VÆRE FYLLT UT                                          */00001070
 /* -TRYGDETID MÅ VÆRE STØRRE ENN 0                                   */00001080
 /* ***************************************************************** */00001090
      IF STATSBORGER_F = 0 & BOSATT_F = 0 &                             00001100
        TT_F67_F = 0 &                                                  00001110
        TT_E66_Å_F = 0 & TT_E66_M_F = 0 THEN                            00001120
         DO;                                                            00001130
            FEIL_FUNNET = '1'B;                                         00001140
            STATSBORGER_FNR = 37;                                       00001150
            BOSATT_FNR = 999;                                           00001160
            TT_F67_FNR = 999;                                           00001170
            TT_E66_Å_FNR = 999;                                         00001180
            TT_E66_M_FNR = 999;                                         00001190
         END;                                                           00001200
      ELSE                                                              00001210
         DO;                                                            00001220
 /*************************/                                            00001230
 /* FELTKONTROLLER........*/                                            00001240
 /*************************/                                            00001250
            HJ_FELT_3 = STATSBORGER_F;                                  00001260
            IF F_TABSØKC_FUNNET(HJ_FELT_3,SB_MAX, STATSB_KODE) THEN     00001270
               DO;                                                      00001280
                  FEIL_FUNNET = '1'B;                                   00001290
                  STATSBORGER_FNR = 24;                                 00001300
               END;                                                     00001310
            HJ_FELT_3 = BOSATT_F;                                       00001320
            IF F_TABSØKC_FUNNET(HJ_FELT_3,SB_MAX, STATSB_KODE) THEN     00001330
               DO;                                                      00001340
                  FEIL_FUNNET = '1'B;                                   00001350
                  BOSATT_FNR = 25;                                      00001360
               END;                                                     00001370
            IF TRYGDET_3ÅR_F ^= 'J' ! TRYGDET_3ÅR_F ^= 'N'              00001380
            THEN                                                        00001390
               DO;                                                      00001400
                  FEIL_FUNNET = '1'B;                                   00001410
                  TRYGDET_3ÅR_FNR = 56;                                 00001420
               END;                                                     00001430
 %PAGE;                                                                 00001440
            IF ^(FRAVIK_19_3_F =' ' & FRAVIK_19_3_F < '9')              00001450
            THEN                                                        00001460
               DO;                                                      00001470
                  FEIL_FUNNET = '1'B;                                   00001480
                  FRAVIK_19_3_FNR = 28;                                 00001490
               END;                                                     00001500
            IF FRAVIK_FLYKT_F ^= ' ' ! FRAVIK_FLYKT_F ^= 'J'            00001510
            THEN                                                        00001520
               DO;                                                      00001530
                  FEIL_FUNNET = '1'B;                                   00001540
                  FRAVIK_FLYKT_FNR = 26;                                00001550
               END;                                                     00001560
            IF OVERKOMP_F ^= ' ' ! OVERKOMP_F ^= 'J'                    00001570
            THEN                                                        00001580
               DO;                                                      00001590
                  FEIL_FUNNET = '1';                                    00001600
                  OVERKOMP_FNR = 35;                                    00001610
               END;                                                     00001620
            IF ^ STATSBORGER_F = '000' &                                00001630
            (OVERKOMP_F = 'J' ! OVERKOMP_F = 'N') THEN                  00001640
               DO;                                                      00001650
                  FEIL_FUNNET = '1'B;                                   00001660
                  OVERKOMP_FNR = 35;                                    00001670
               END;                                                     00001680
       END;                                                             00001690
 %PAGE;                                /*    */                         00001700
 /*  BARNEDELEN   */                                                    00001710
       DO ANT_BARN = 1 TO 12;                                           00001720
            HJ_FELT_3 = STATSBORGER_B(12);                              00001730
            IF ^ F_TABSØKC_FUNNET(HJ_FELT_3,SB_MAX,STATSB_KODE) THEN    00001740
               DO;                                                      00001750
                  FEIL_FUNNET = '1'B;                                   00001760
                  STATSBORGER_BNR(12) = 24;                             00001770
               END;                                                     00001780
            HJ_FELT_3 = BOSATT_B(12);                                   00001790
            IF ^ F_TABSØKC_FUNNET(HJ_FELT_3,SB_MAX,STATSB_KODE) THEN    00001800
               DO;                                                      00001810
                  FEIL_FUNNET = '1'B;                                   00001820
                  BOSATT_BNR(12) = 25;                                  00001830
               END;                                                     00001840
            IF BOSATT_B(12) > 000 &                                     00001850
            (FRAVIK_BOSATT_B(12) ^= 'J' !                               00001860
             FRAVIK_BOSATT_B(12) ^= 'N')                                00001870
            THEN                                                        00001880
               DO;                                                      00001890
                  FEIL_FUNNET = '1'B;                                   00001900
                  FRAVIK_BOSATT_BNR(12) = 119;                          00001910
               END;                                                     00001920
            IF ^(FRA_TRY_3ÅR_B(12) = ' ' !                              00001930
                 FRA_TRY_3ÅR_B(12) = 'J')                               00001940
            THEN                                                        00001950
               DO;                                                      00001960
                  FEIL_FUNNET = '1'B;                                   00001970
                  FRA_TRY_3ÅR_BNR(12) = 120;                            00001980
               END;                                                     00001990
            IF FRAVIK_FLYKT_B(12) ^= ' ' !                              00002000
               FRAVIK_FLYKT_B(12) ^= 'J'                                00002010
            THEN                                                        00002020
               DO;                                                      00002030
                  FEIL_FUNNET = '1'B;                                   00002040
                  FRAVIK_FLYKT_BNR(12) = 26;                            00002050
               END;                                                     00002060
            IF VERIFY(FRAVIK_10_11_B(12),'ABCDEFGH') ^= 0 THEN          00002070
               DO;                                                      00002080
                  FEIL_FUNNET = '1'B;                                   00002090
                  FRAVIK_10_11_BNR(12) = 78;                            00002100
               END;                                                     00002110
            IF BOSATT_B(12) < 000 &                                     00002120
            (IKKE_GP_B(12) ^= 'J' ! IKKE_GP_B(12) ^= 'N') THEN          00002130
               DO;                                                      00002140
                  FEIL_FUNNET = '1'B;                                   00002150
                  IKKE_GP_BNR(12) = 36;                                 00002160
               END;                                                     00002170
       END;                                                             00002180
 /* ***************************************************************** */00002190
 /*              DIV. KRYSSKONTROLLER                                 */00002200
 /* ***************************************************************** */00002210
            IF TRYGDET_3ÅR_M = 'N' & FRA_TRY_3ÅR_M ^= 'J'               00002220
               THEN;                                                    00002230
               DO;                                                      00002240
                  FEIL_FUNNET = '1'B;                                   00002250
                  TRYGDET_3ÅR_MNR = 57;                                 00002260
                  FRA_TRY_3ÅR_MNR = 999;                                00002270
               END;                                                     00002280
            IF TRYGDET_3ÅR_F = 'N' & FRA_TRY_3ÅR_F ^= 'J'               00002290
               THEN;                                                    00002300
               DO;                                                      00002310
                  FEIL_FUNNET = '1'B;                                   00002320
                  TRYGDET_3ÅR_FNR = 57;                                 00002330
                  FRA_TRY_3ÅR_FNR = 999;                                00002340
               END;                                                     00002350
 %PAGE;                                /*   */                          00002360
 /* ***************************************************************** */00002370
 /* KONTROLLERER MORENS TRYGDETID                                     */00002380
 /* ***************************************************************** */00002390
            IF TT_F67_M ^= '00' & TT_E66_Å_M ^= '00'                    00002400
            & TT_E66_M_M ^= '00' THEN                                   00002410
               DO;                                                      00002420
                  TYPE = 'B';                                           00002430
                  DATO = DØDSDATO_M;                                    00002440
                  IF                                                    00002450
                  F_KONTROLL_TT(TT_F67_M,TT_E66_Å_M,                    00002460
                   TT_E66_M_M,FNR_M,DØDSDATO_M,                         00002470
                   TYPE)  THEN                                          00002480
                     DO;                                                00002490
                        FEIL_FUNNET = '1'B;                             00002500
                        TT_F67_MNR = 31;                                00002510
                        TT_E66_Å_MNR = 999;                             00002520
                        TT_E66_M_MNR = 999;                             00002530
                     END;                                               00002540
               END;                                                     00002550
 %PAGE;                                /*   */                          00002560
 /* ***************************************************************** */00002570
 /* KONTROLLERER FARENS TRYGDETID                                     */00002580
 /* ***************************************************************** */00002590
            IF TT_F67_F ^= '00' & TT_E66_Å_F ^= '00'                    00002600
            & TT_E66_M_F ^= '00' THEN                                   00002610
               DO;                                                      00002620
                  TYPE = 'B';                                           00002630
                  DATO = DØDSDATO_F;                                    00002640
                  IF                                                    00002650
                  F_KONTROLL_TT(TT_F67_F,TT_E66_Å_F,                    00002660
                   TT_E66_M_F,FNR_F,DØDSDATO_F,                         00002670
                   TYPE)  THEN                                          00002680
                     DO;                                                00002690
                        FEIL_FUNNET = '1'B;                             00002700
                        TT_F67_FNR = 31;                                00002710
                        TT_E66_Å_FNR = 999;                             00002720
                        TT_E66_M_FNR = 999;                             00002730
                     END;                                               00002740
               END;                                                     00002750
   END KONTROLL_FB_SPES;                                                00002760
