 /*       SIST ENDRET 23/01-85 09.33.41 AV   HERMAN                   */00000000
 /*       SIST ENDRET 09/11-84 14.02.34 AV   HERMAN                   */00000010
 /*       SIST ENDRET 21/09-83 13.49.21 AV   HERMAN                   */00000020
 /*       SIST ENDRET 03/01-83 10.08.13 AV   OLAV                     */00000030
 %SKIP;                                /*  */                           00000040
 /* ***************************************************************** */00000050
 /*                                                                   */00000060
 /* ***************************************************************** */00000070
 /*IDENTIFIKASJON:                                                    */00000080
 /* **********************                                            */00000090
 /*  PROGRAM-IDENT : R0010508      TT_AP         SUBPROGRAM           */00000100
 /*  PROGRAM-SPRÅK : PLI                                              */00000110
 /*  PROGRAMMERER  : BERGESTAD                                        */00000120
 /*  PROGRAMMET BLE TOTALT OMARBEIDET I NOV 84                        */00000130
 /*  ENDRINGERSDATO : 9.11.84                                         */00000140
 /*  ENDRINGEN BLE UTFØRT AV : HERMAN                                 */00000150
 /*                                                                   */00000160
 /* ***************************************************************** */00000170
 /*HENSIKT:                                                           */00000180
 /* **********                                                        */00000190
 /*    BEREGNER MAKS TT FØR 1967, OG TT ETTER 1966                    */00000200
 /*                                                                   */00000210
 /*  BRUK:                                                            */00000220
 /*    CALL TT_AP(FNR,MAKS_TT_FØR_1967,TT_TIL_TPK);                   */00000230
 /*  PARAMETER INN :                                                  */00000240
 /*    FNR                                                            */00000250
 /*  PARAMETER UT :                                                   */00000260
 /*    MAKS_TT_FØR_1967, TT_TIL_TPK                                   */00000270
 /*                                                                   */00000280
 /* ***************************************************************** */00000290
 /*PROGRAMTILKNYTTING:                                                */00000300
 /* ********************                                              */00000310
 /*  PROGRAMMET INCLUDES I R0010501 - KONTROLL_GRUNNBLANKETT_AP       */00000320
 /*                                                                   */00000330
 /* ***************************************************************** */00000340
 /*DATASETTOPPLYSNINGER:                                              */00000350
 /* ***********************                                           */00000360
 /*  INGEN                                                            */00000370
 /* ***************************************************************** */00000380
 /*FEILMELDINGER:                                                     */00000390
 /* *******************                                               */00000400
 /*  INGEN                                                            */00000410
 /* ***************************************************************** */00000420
 /*ENDRET AV HERMAN 23.1.85 : DET DEKLARERTE ELEMENTET W_FNR_MN       */00000430
 /*                VAR FEILSKREVET SOM W_FNR_MND  I STATEMENTENE      */00000440
 /* ***************************************************************** */00000450
 %PAGE;                                                                 00000460
 TT_AP:                                                                 00000470
   PROC(FNR,MAKS_TT_FØR_1967,TT_TIL_TPK);                               00000480
   DCL                                                                  00000490
      FNR              PIC'(11)9';                                      00000500
   DCL                                                                  00000510
      W_FNR_MN         PIC'(2)9' DEF FNR POS(3),                        00000520
      W_FNR_ÅR         PIC'(2)9' DEF FNR POS(5),                        00000530
      W_PERSNR         PIC'(3)9' DEF FNR POS(7);                        00000540
   DCL                                                                  00000550
      MAKS_TT_FØR_1967 PIC'(2)9',                                       00000560
      TT_TIL_TPK       PIC'(4)9';                                       00000570
 %PAGE;                                                                 00000580
      IF W_PERSNR > 499 THEN                                            00000590
                                                                        00000600
         DO;                                                            00000610
                                                                        00000620
            MAKS_TT_FØR_1967 = 167 -(W_FNR_ÅR + 16);                    00000630
                                                                        00000640
            IF W_FNR_ÅR < 97                     THEN                   00000650
                                                                        00000660
               TT_TIL_TPK = 0;                                          00000670
                                                                        00000680
            ELSE                                                        00000690
                                                                        00000700
               TT_TIL_TPK = (W_FNR_ÅR - 97) * 100 + W_FNR_MN;           00000710
                                                                        00000720
         END;                                                           00000730
                                                                        00000740
      ELSE                                                              00000750
                                                                        00000760
         DO;                                                            00000770
                                                                        00000780
            MAKS_TT_FØR_1967 = 67 -(W_FNR_ÅR + 16);                     00000790
                                                                        00000800
            IF W_FNR_ÅR < 3                       THEN                  00000810
                                                                        00000820
               TT_TIL_TPK   = (W_FNR_ÅR + 70 - 67)* 100 + W_FNR_MN;     00000830
                                                                        00000840
            ELSE                                                        00000850
                                                                        00000860
            IF W_FNR_ÅR > 5                       THEN                  00000870
                                                                        00000880
               TT_TIL_TPK   = (W_FNR_ÅR * 100) + W_FNR_MN;              00000890
                                                                        00000900
            ELSE /* FØDT I 1903,4 0G 5 FÅR 6 ÅR */                      00000910
                                                                        00000920
               TT_TIL_TPK   = 600;                                      00000930
                                                                        00000940
         END;                                                           00000950
                                                                        00000960
      IF TT_TIL_TPK > 0                           THEN                  00000970
                                                                        00000980
         IF W_FNR_MN = 12                        THEN                   00000990
                                                                        00001000
            TT_TIL_TPK   = TT_TIL_TPK + 88; /* + 100 - 12 */            00001010
                                                                        00001020
      RETURN;                                                           00001030
                                                                        00001040
   END TT_AP;                                                           00001050
