 /*       SIST ENDRET 13/12-91 12.26.32 AV   DYBVIK                   */00000000
 /*********************************************************************/00000010
 /* IDENTIFIKASJON:                                                   */00000020
 /*    R0016032 - R0016021 (PROC-SAMLING) DELT OPP. BØ9112            */00000030
 /* HENSIKT:                                                          */00000040
 /*    EN PROSEDYRE SOM HENTER FELTER FRA BLANKETT-OMR. V/UP-TRANS.   */00000050
 /* PROGRAMTILKNYTNING:                                               */00000060
 /*    LOKAL PROSEDYRE I R0016001                                     */00000070
 /*********************************************************************/00000080
                                                                        00000090
    /*----------------------------------------------------------------*/00000100
    /*                                                                */00000110
    /* YRKE, PRIMÆR- OG SEKUNDÆR-DIAGNOSE LEGGES IKKE UT I B01/B02.   */00000120
    /* DISSE OPPLYSNINGENE MÅ HENTES DIREKTE PÅ TRANSAKSJONEN.        */00000130
    /* 2 TYPER UP-BL. FRA 1991 MEDFØRER 2 PROC'ER: UP_OPPDAT/U2_OPPDAT*/00000140
    /*----------------------------------------------------------------*/00000150
                                                                        00000160
 UP_OPPDAT: PROC;                                                       00000170
                                                                        00000180
 %INCLUDE P0010601;     /* TRANS_OMR UP-BLANKETT */                     00000190
                                                                        00000200
       /* DENNE ENDRES NÅR YRKESKODEN UTVIDES */                        00000210
                                                                        00000220
    IF VERIFY(TRANS_OMR.UPS.FNR,'0123456789') = 0 THEN                  00000230
      IF TRANS_OMR.UPS.FNR = B02.PERSON(I).RF0PERSN.FNR THEN            00000240
      DO;                                                               00000250
        IF TRANS_OMR.UPS.YRKE > 0 THEN                                  00000260
           REGTPKT.YRKE = TRANS_OMR.UPS.YRKE;                           00000270
                                                                        00000280
        IF TRANS_OMR.UPS.PRIMDIAG > '      ' THEN                       00000290
          DO;                                                           00000300
            IF TRANS_OMR.UPS.YSKADE_TILLEGG = 'J' THEN                  00000310
               DIAGNOSE.PRIMDIAG_YRKE  = TRANS_OMR.UPS.PRIMDIAG;        00000320
            ELSE                                                        00000330
               DIAGNOSE.PRIMDIAG       = TRANS_OMR.UPS.PRIMDIAG;        00000340
            SEGMENT_TABELL.DIAGNOSE = TRUE;                             00000350
          END;                                                          00000360
                                                                        00000370
        IF TRANS_OMR.UPS.SEKUDIAG > '      ' THEN                       00000380
          DO;                                                           00000390
            IF TRANS_OMR.UPS.YSKADE_TILLEGG = 'J' THEN                  00000400
               DIAGNOSE.SEKUDIAG_YRKE  = TRANS_OMR.UPS.SEKUDIAG;        00000410
            ELSE                                                        00000420
               DIAGNOSE.SEKUDIAG       = TRANS_OMR.UPS.SEKUDIAG;        00000430
            SEGMENT_TABELL.DIAGNOSE = TRUE;                             00000440
          END;                                                          00000450
      END;                                                              00000460
                                                                        00000470
 END UP_OPPDAT;                                                         00000480
                                                                        00000490
