 /*       SIST ENDRET 25/02-94 12.23.14 AV   HERMAN                   */00000000
 /*       SIST ENDRET 02/04-93 10.00.51 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 06/01-93 12.28.15 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 08/12-92 12.44.14 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 18/03-92 13.16.27 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 07/01-92 15.03.29 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 10/10-91 13.56.39 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 24/07-91 09.33.45 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 26/04-91 11.43.23 AV   DYBVIK                   */00000080
 /* ***************************************************************** */00000090
 /*IDENTIFIKASJON:                                                    */00000100
 /*    R001NC03 - PROSEDYRE I PLI                                     */00000110
 /*    PROGRAMMERER:                                                  */00000120
 /*HENSIKT:                                                           */00000130
 /*    PROSEDYREN FORETAR KONTROLL AV DATA FOR F7_SØKER FRA           */00000140
 /*       GRUNNBLANKETT FORSØRGINGSTILLEGG EKTEFELLE OG/ELLER BARN.   */00000150
 /*PROGRAMTILKNYTNING:                                                */00000160
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLING AV FORSØRGINGS-     */00000170
 /*       TILLEG EKTEFELLE OG/ELLER BARN.                             */00000180
 /*    INCLUDES I  R001NC01.                                          */00000190
 /*BRUK:                                                              */00000200
 /* CALL KONRTOLL_F7_SØKER(FEIL_I_F7_SØKER);                          */00000210
 /*                                                                   */00000220
 /*   MODULEN KONTROLLERER F7_SØKER, OG RETURNERER                    */00000230
 /*   MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG              */00000240
 /*                                                                   */00000250
 /* ***************************************************************** */00000260
 %SKIP(2);                                                              00000270
 KONTROLL_F7_SØKER:                                                     00000280
   PROC (FEIL_FUNNET);                                                  00000290
   DCL                                                                  00000300
      FEIL_FUNNET BIT (1);                                              00000310
   DCL                                                                  00000320
      DAGENS_DATO_ÅMD                           PIC '999999',           00000330
      DAGENS_DATO_ÅM DEF DAGENS_DATO_ÅMD        PIC '9999',             00000340
      DAGENS_DATO_Å  DEF DAGENS_DATO_ÅMD        PIC '99',               00000350
      DAGENS_DATO_M  DEF DAGENS_DATO_ÅMD POS(3) PIC '99',               00000360
      DAGENS_DATO_D  DEF DAGENS_DATO_ÅMD POS(5) PIC '99';               00000370
 %SKIP;                                                                 00000380
   DCL                                                                  00000390
      HJ_DAGENS_DATO_ÅM                             PIC '9999',         00000400
      HJ_DAGENS_DATO_Å DEF HJ_DAGENS_DATO_ÅM        PIC '99',           00000410
      HJ_DAGENS_DATO_M DEF HJ_DAGENS_DATO_ÅM POS(3) PIC '99';           00000420
 %SKIP;                                                                 00000430
   DCL                                                                  00000440
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00000450
      KEY_PEKER                  POINTER,                               00000460
      TK_RECL                    CHAR (101);                            00000470
   DCL                                                                  00000480
      ALDER FIXED DEC (5),                                              00000490
      TYPE CHAR(1),                                                     00000500
      DATO PIC '9999';                                                  00000510
   DCL                                                                  00000520
      1 FNR_REG,                                                        00000530
        2 FNR1        FIXED DEC(11),                                    00000540
        2 FNR2        FIXED DEC(11),                                    00000550
        2 BRUKERID    CHAR     ( 4);                                    00000560
                                                                        00000570
 /*------------------------------------------------------------*/       00000580
 /*  HJELPE DCL FOR Å SNU DATO                                 */       00000590
 /*------------------------------------------------------------*/       00000600
                                                                        00000610
   DCL                                                                  00000620
      HJ_VIRK_DATO_ÅM PIC '9999',                                       00000630
      VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅM POS(1) PIC '99',                  00000640
      VIRK_DATO_M DEF HJ_VIRK_DATO_ÅM POS(3) PIC '99';                  00000650
 %SKIP;                                                                 00000660
   DCL                                                                  00000670
      HJ_VIRK_DATO_MÅ PIC '9999',                                       00000680
      HJ_VIRK_DATO_M DEF HJ_VIRK_DATO_MÅ POS(1) PIC '99',               00000690
      HJ_VIRK_DATO_Å DEF HJ_VIRK_DATO_MÅ POS(3) PIC '99';               00000700
 %PAGE;                                                                 00000710
      ANT_FEIL_SKREVET = 0;                                             00000720
      FEIL_FUNNET      = '0'B;                                          00000730
      KEY_PEKER        = ADDR(F7S.TKNR);                                00000740
                                                                        00000750
  /* ******************************************************* */         00000760
  /* DATE () ER EN BUILTIN-FUNKSJON I PLI SOM RETURNERER     */         00000770
  /* DAGENS DATO I FORMEN ÅR - MNDR - DAG                    */         00000780
  /* ******************************************************* */         00000790
                                                                        00000800
  FNR_REG.BRUKERID   = DIV_PARAM_OMR.CICS_IND;                          00000810
  DAGENS_DATO_ÅMD    = DATE ();                                         00000820
                                                                        00000830
                                                                        00000840
 /* BLANKETTER MED VIRK FRAM I TID AVVISES FRA 01.92  SP 8.91 */        00000850
    HJ_VIRK_DATO_MÅ  = F7S.VIRK_DATO_MÅ;                                00000860
    VIRK_DATO_Å      = HJ_VIRK_DATO_Å;                                  00000870
    VIRK_DATO_M      = HJ_VIRK_DATO_M;                                  00000880
                                                                        00000890
      /* HIT SP 8.91                                      */            00000900
                                                                        00000910
                                                                        00000920
                                                                        00000930
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR11(F7S.FNR)) THEN                  00000940
         DO;                                                            00000950
            FEIL_FUNNET = '1'B;                                         00000960
            F7S.FNRNR =200;                                             00000970
         END;                                                           00000980
      ELSE                                                              00000990
      IF ^F_GYLDIG_FNR(F7S.FNR) THEN                                    00001000
         DO;                                                            00001010
            FEIL_FUNNET = '1'B;                                         00001020
            F7S.FNRNR = 1;                                              00001030
         END;                                                           00001040
      ELSE                                                              00001050
         DO;                                                            00001060
            FNR_REG.FNR1 = F7S.FNR;                                     00001070
            EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);       00001080
            IF FNR_REG.FNR2 > 0 THEN                                    00001090
               DO;                                                      00001100
                 F7S.FNRNR = 203;                                       00001110
                 F7S.FNR_GML = F7S.FNR;                                 00001120
                 F7S.FNR = FNR_REG.FNR2;                                00001130
               END;                                                     00001140
         END;                                                           00001150
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(F7S.TKNR)) THEN                  00001160
         DO;                                                            00001170
            FEIL_FUNNET = '1'B;                                         00001180
            F7S.TKNRNR = 200;                                           00001190
         END;                                                           00001200
      ELSE                                                              00001210
         DO;                                                            00001220
                  EXEC CICS HANDLE CONDITION NOTFND(NOTFND);            00001230
                  EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)    00001240
                                                     INTO(TK_RECL);     00001250
                  GOTO TKNR_UT;                                         00001260
              NOTFND:                                                   00001270
                  FEIL_FUNNET = '1'B;                                   00001280
                  F7S.TKNRNR  = 3;                                      00001290
                  LEAVE;                                                00001300
              TKNR_UT:                                                  00001310
                  DIV_PARAM_OMR.DIV_TKNR = SUBSTR(TK_RECL,1,4);         00001320
         END;                                                           00001330
      IF ^(F7S.TILL_EK = 'J' ! F7S.TILL_EK = ' ') THEN                  00001340
         DO;                                                            00001350
            FEIL_FUNNET ='1'B;                                          00001360
            F7S.TILL_EKNR = 4;                                          00001370
         END;                                                           00001380
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR2(F7S.BT_ANT)) THEN                00001390
         DO;                                                            00001400
            FEIL_FUNNET = '1'B;                                         00001410
            F7S.BT_ANTNR = 200;                                         00001420
         END;                                                           00001430
      ELSE                                                              00001440
      IF F7S.BT_ANT > 12 THEN                                           00001450
         DO;                                                            00001460
            FEIL_FUNNET = '1'B;                                         00001470
            F7S.BT_ANTNR = 282;                                         00001480
         END;                                                           00001490
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(PENSJONSINNTEKT)) THEN           00001500
         DO;                                                            00001510
            FEIL_FUNNET = '1'B;                                         00001520
            F7S.PENSJONSINNTEKTNR = 200;                                00001530
         END;                                                           00001540
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(ARBEIDSINNTEKT)) THEN            00001550
         DO;                                                            00001560
            FEIL_FUNNET = '1'B;                                         00001570
            F7S.ARBEIDSINNTEKTNR = 200;                                 00001580
         END;                                                           00001590
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(PENSJONSINNTEKT_EK)) THEN        00001600
         DO;                                                            00001610
            FEIL_FUNNET = '1'B;                                         00001620
            F7S.PENSJONSINNTEKT_EKNR = 200;                             00001630
         END;                                                           00001640
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(ARBEIDSINNTEKT_EK)) THEN         00001650
         DO;                                                            00001660
            FEIL_FUNNET = '1'B;                                         00001670
            F7S.ARBEIDSINNTEKT_EKNR = 200;                              00001680
         END;                                                           00001690
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(F7S.VIRK_DATO_MÅ)) THEN          00001700
         DO;                                                            00001710
            FEIL_FUNNET = '1'B;                                         00001720
            F7S.VIRK_DATO_MÅNR = 200;                                   00001730
         END;                                                           00001740
      ELSE                                                              00001750
      IF ^F_GYLDIG_DATO(F7S.VIRK_DATO_MÅ) THEN                          00001760
         DO;                                                            00001770
            FEIL_FUNNET = '1'B;                                         00001780
            F7S.VIRK_DATO_MÅNR = 9;                                     00001790
         END;                                                           00001800
      ELSE                                                              00001810
         DO;                                                            00001820
            HJ_VIRK_DATO_MÅ = F7S.VIRK_DATO_MÅ;                         00001830
            VIRK_DATO_Å = HJ_VIRK_DATO_Å;                               00001840
            VIRK_DATO_M = HJ_VIRK_DATO_M;                               00001850
            IF HJ_VIRK_DATO_ÅM < 9105 THEN                              00001860
               DO;                                                      00001870
                  FEIL_FUNNET = '1'B;                                   00001880
                  F7S.VIRK_DATO_MÅNR = 381;                             00001890
               END;                                                     00001900
         END;                                                           00001910
                                                                        00001920
                                                                        00001930
  /* HER SETTES VERDIER INN I MENY_OMR */                               00001940
      FØDSNUMMER = F7S.FNR;                                             00001950
      VIRKNINGSDATO = F7S.VIRK_DATO_MÅ;                                 00001960
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR11(F7S.FNR_EK)) THEN               00001970
         DO;                                                            00001980
            FEIL_FUNNET = '1'B;                                         00001990
            F7S.FNR_EKNR = 200;                                         00002000
         END;                                                           00002010
      ELSE                                                              00002020
      IF F7S.FNR_EK > 0 THEN                                            00002030
         DO;                                                            00002040
            IF ^F_GYLDIG_FNR(F7S.FNR_EK) THEN                           00002050
               DO;                                                      00002060
                  FEIL_FUNNET = '1'B;                                   00002070
                  F7S.FNR_EKNR = 15;                                    00002080
               END;                                                     00002090
            ELSE                                                        00002100
               DO;                                                      00002110
                  FNR_REG.FNR1 = F7S.FNR_EK;;                           00002120
                  EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG); 00002130
                  IF FNR_REG.FNR2 > 0 THEN                              00002140
                     DO;                                                00002150
                        F7S.FNR_EKNR = 203;                             00002160
                        F7S.FNR_GML_EK = F7S.FNR_EK;                    00002170
                        F7S.FNR_EK = FNR_REG.FNR2;                      00002180
                     END;                                               00002190
               END;                                                     00002200
         END;                                                           00002210
 %SKIP(3);                             /*  */                           00002220
 /*   KRYSS KONTROLLER       */                                         00002230
 %SKIP;                                                                 00002240
                                                                        00002250
                                                                        00002260
      IF ^FEIL_FUNNET THEN                                              00002270
         DO;                                                            00002280
          /*IF F7S.FNR_EK > 0 THEN                                      00002290
               DO;                                                      00002300
                  IF F_KJØNN(F7S.FNR) = F_KJØNN(F7S.FNR_EK) THEN        00002310
                     DO;                                                00002320
                        FEIL_FUNNET = '1'B;                             00002330
                        F7S.FNRNR = 999;                                00002340
                        F7S.FNR_EKNR = 16;                              00002350
                     END;                                               00002360
               END;     */                                              00002370
                                                                        00002380
   /* RETTES SLIK AT VI KAN REG F7  SEKS MND FREM I TID *******         00002390
            IF HJ_VIRK_DATO_ÅM > DAGENS_DATO_ÅM THEN                    00002400
               DO;                                                      00002410
                  IF DAGENS_DATO_D > 19 THEN                            00002420
                     DO;                                                00002430
                        HJ_DAGENS_DATO_ÅM = DAGENS_DATO_ÅM + 2;         00002440
                     END;                                               00002450
                  ELSE                                                  00002460
                     HJ_DAGENS_DATO_ÅM = DAGENS_DATO_ÅM + 1;            00002470
                  IF HJ_DAGENS_DATO_M > 12 THEN                         00002480
                     DO;                                                00002490
                        HJ_DAGENS_DATO_Å = HJ_DAGENS_DATO_Å + 1 ;       00002500
                        HJ_DAGENS_DATO_M = HJ_DAGENS_DATO_M - 12;       00002510
                     END;                                               00002520
                   IF HJ_VIRK_DATO_ÅM > HJ_DAGENS_DATO_ÅM THEN          00002530
                     DO;                                                00002540
                        FEIL_FUNNET        = '1'B;                      00002550
                        F7S.VIRK_DATO_MÅNR =  10 ;                      00002560
                     END;                                               00002570
               END;                                                     00002580
         ***************** TRUDE 180392   ******* */                    00002590
   /* RETTES SLIK AT VI KAN REG F7  SEKS MND FREM I TID ******* */      00002600
                                                                        00002610
            IF HJ_VIRK_DATO_ÅM > DAGENS_DATO_ÅM THEN                    00002620
               DO;                                                      00002630
                  IF ^ F_6MDR(HJ_VIRK_DATO_ÅM)   THEN                   00002640
                     DO;                                                00002650
                        FEIL_FUNNET        = '1'B;                      00002660
                        F7S.VIRK_DATO_MÅNR = 205 ;                      00002670
                     END;                                               00002680
               END;                                                     00002690
                                        /* TRUDE 180392   HIT */        00002700
                                                                        00002710
               IF F7S.TILL_EK ^= 'J' & F7S.BT_ANT = 0 THEN              00002720
                  DO;                                                   00002730
                     FEIL_FUNNET = '1'B;                                00002740
                     F7S.TILL_EKNR = 163;                               00002750
                     F7S.BT_ANTNR = 999;                                00002760
                  END;                                                  00002770
            IF F7S.TILL_EK = 'J' THEN                                   00002780
               IF F7S.FNR_EK = 0  THEN                                  00002790
                  DO;                                                   00002800
                     FEIL_FUNNET = '1'B;                                00002810
                     F7S.TILL_EKNR = 19;                                00002820
                     F7S.FNR_EKNR = 999;                                00002830
                  END;                                                  00002840
         END;                                                           00002850
   END KONTROLL_F7_SØKER;                                               00002860
                                                                        00002870
                                                                        00002880
