 /*       SIST ENDRET 26/04-96 12.09.29 AV   JDA0310                  */00000000
 /*       SIST ENDRET 12/10-95 14.03.45 AV   JDA0310                  */00000010
 /*       SIST ENDRET 28/07-94 13.11.34 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 15/02-91 13.18.40 AV   HERMAN                   */00000030
 /*       SIST        14/04-89 13.24.35 AV   HERMAN                   */00000040
 /*       SIST ENDRET 01/09-87 08.45.19 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 08/10-86 09.17.44 AV   LUNDEBY                  */00000060
 /*       SIST ENDRET 02/08-85 09.56.30 AV   FARVIK                   */00000070
 /*       SIST ENDRET 12/06-85 06.57.51 AV   FARVIK                   */00000080
 /*       SIST ENDRET 17/01-85 08.06.29 AV   LUNDEBY                  */00000090
 /*       SIST ENDRET 24/10-84 09.50.13 AV   FARVIK                   */00000100
 /*       SIST ENDRET 11/09-84 09.22.27 AV   FARVIK                   */00000110
 /*       SIST ENDRET 15/09-83 13.02.48 AV   LUNDEBY                  */00000120
                                                                        00000130
 /******************************************************************* */00000140
 /*IDENTIFIKASJON:                                                    */00000150
 /************************                                            */00000160
 /*  PROGRAM-IDENT : R0010451 -  FJERN SISTE TRANS -   SUBPROGRAM     */00000170
 /*  PROGRAM-SPRÅK : PLI                                              */00000180
 /*  PROGRAMMERER  : JAN HARALD KRISTENSEN                            */00000190
 /*  PROGRAMMET BLE LAGET  :                                          */00000200
 /*  ENDRINGERSDATO :                                                 */00000210
 /*  ENDRINGEN GJELDER:                                               */00000220
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000230
 /******************************************************************* */00000240
 /*HENSIKT:                                                           */00000250
 /************                                                        */00000260
 /*  SUB-PROGRAM I DELSYSTEMET FJERNING.                              */00000270
 /*  VIS_MEG_SISTE_TRANS:                                             */00000280
 /*    RUTINEN LESER SISTE OG NEST-SISTE STATUS INN I B01 OG B00      */00000290
 /*    RUTINEN LESER SISTE TRANS I TRANSHISTORIKKEN                   */00000300
 /*  MAPS_UT_ST:                                                      */00000310
 /*    RUTINEN SKRIVER SISTE OG NEST_SISTE STATUS TIL SKJERMEN        */00000320
 /*  LOW_VALUES_TIL_MAP:                                              */00000330
 /*    ???????????                                                    */00000340
 /*  MAPUT_STATUS:                                                    */00000350
 /*    ???????????                                                    */00000360
 /*  HENT_SVAR_OG_BEKREFT                                             */00000370
 /*    RUTINEN BLIR CALLET I R0010450                                 */00000380
 /*    RUTINEN FOR Å HENTE SVAR OG BEKREFTELSE PÅ FJERNING            */00000390
 /*  FJERN_SISTE_TRANS                                                */00000400
 /*    RUTINEN OMGJØR N-SISTE STATUS TIL SISTE OG SKRIVER UT PÅ       */00000410
 /*    BASEN VED R0015401                                             */00000420
 /*                                                                   */00000430
 /*PROGRAMTILKNYTTING:                                                */00000440
 /******************************************************************* */00000450
 /*  PROCEDUREN VIS_MEG_SISTE_TRANS:                                  */00000460
 /*    RUTINEN BLIR CALLET I R0010450.                                */00000470
 /*    R0013101 LINKES FOR Å LESE SISTE/NEST-SISTE STATUS             */00000480
 /*    FORBEREDE_TRANS(R0010452) CALLES FOR Å LESE FØRSTE TRANS       */00000490
 /*    R0010411 LINKES FOR Å BYGGE OPP TRANS_LISTE OG FNR_ARRAY       */00000500
 /*  PROCEDUREN MAPS_UT_ST:                                           */00000510
 /*    RUTINEN BLIR CALLET I R0010450                                 */00000520
 /*    CALLER LOW_VALUES_TIL_MAP(CALLES I R0010451)                   */00000530
 /*    CALLER MAPUT_STATUS(CALLES I R0010451)                         */00000540
 /*  PROCEDUREN HENT_SVAR_OG_BEKREFT:                                 */00000550
 /*    RUTINEN BLIR CALLET I R0010450                                 */00000560
 /*  PROCEDUREN FJERN_SISTE_TRANS:                                    */00000570
 /*    RUTINEN BLIR CALLET I R0010450                                 */00000580
 /*    R0015501 LINKES FOR Å FJERNE SISTE TRANS                       */00000590
 /*    R0014901 LINKES FOR Å KJØRE AUTOHENDELSE-BEREGNING             */00000600
 /*    R0015401 LINKES FOR Å SKRIVE SISTE STATUS                      */00000610
 /*    R0010412 LINKES FOR Å LISTE UT FJERNET TRANS                   */00000620
 /******************************************************************* */00000630
 /*                                                                   */00000640
 /*DATASETTOPPLYSNINGER:                                              */00000650
 /*************************                                           */00000660
 /*  PO/PE-BASEN:                                                     */00000670
 /*               LESES,TRANSER FJERNES,NY STATUS SKRIVES             */00000680
 /*    ER DETTE NØDVENDIG????                                         */00000690
 /*  **DDNAVN,TYPE I/O DATASETTOPPLYSNINGER,PSB-NAVN **               */00000700
 /*                                                                   */00000710
 /******************************************************************* */00000720
 /*FEILMELDINGER:                                                     */00000730
 /*********************                                               */00000740
 /*  'PERSONEN ER REGISTRERT SOM DØD, FJERNING BARE TILLATT VIA....   */00000750
 /*   FJERN ALLE'                                                     */00000760
 /*  'PERSONEN ER TILKN. EN DØD SOM PEKER UTENFOR FAMILIEN, PRØV..    */00000770
 /*   FJERN ALLE'                                                     */00000780
 /*  'PERSONEN MED FNR ...... HAR IKKE SISTE-STATUS'                  */00000790
 /*                                                                   */00000800
 /* ****************************************************************  */00000810
 /*  VISER SISTE TRANSAKSJON                                          */00000820
 /* ****************************************************************  */00000830
                                                                        00000840
 VIS_MEG_SISTE_TRANS: PROC;                                             00000850
                                                                        00000860
   DCL                                                                  00000870
          GJEMME_BLANKETTYPE    CHAR(2),                                00000880
          GJEMME_VIRKDATO       PIC'9999',                              00000890
          WORK_IND              BIT(1) ,                                00000900
          NS                    BIT(1)   INIT ('0'B),                   00000910
          SS                    BIT(1)   INIT ('1'B),                   00000920
          SISTE_TRANS_FUNNET    BIT(1)   INIT ('0'B);                   00000930
                                                                        00000940
  /*------------------------------------------------------------------*/00000950
  /*  EKSEKVERINGEN BEGYNNER HER.                                     */00000960
  /*------------------------------------------------------------------*/00000970
                                                                        00000980
   MAX_ANTALL_TRANS             =   5;                                  00000990
                                                                        00001000
   DAGENS_DATO_PLUSS2_ÅM        =  (DATE + 200)/100;                    00001010
   IF DAGENS_DATO_PLUSS2_M      >   12 THEN                             00001020
      DO;                                                               00001030
         DAGENS_DATO_PLUSS2_M   =   DAGENS_DATO_PLUSS2_M - 12;          00001040
         DAGENS_DATO_PLUSS2_Å   =   DAGENS_DATO_PLUSS2_Å + 1;           00001050
      END;                                                              00001060
                                                                        00001070
   DAGENS_DATO_PLUSS1_ÅM        =  (DATE + 100)/100;                    00001080
   IF DAGENS_DATO_PLUSS1_M      >   12 THEN                             00001090
      DO;                                                               00001100
         DAGENS_DATO_PLUSS1_M   =   DAGENS_DATO_PLUSS1_M - 12;          00001110
         DAGENS_DATO_PLUSS1_Å   =   DAGENS_DATO_PLUSS1_Å + 1;           00001120
      END;                                                              00001130
                                                                        00001140
   GJEMME_VIRKDATO              =   TRANS_OPPL_OMR.VIRKNINGSDATO;       00001150
   GJEMME_BLANKETTYPE           =   TRANS_OPPL_OMR.BLANKETTYPE;         00001160
   TRANS_OPPL_OMR.VIRKNINGSDATO =   F_SNU_DATO(DAGENS_DATO_PLUSS2_ÅM);  00001170
   TRANS_OPPL_OMR.FØDSNUMMER    =   FNR_SØKER;                          00001180
   TRANS_OPPL_OMR.BLANKETTYPE   =  'O1';          /* FOR Å SETTE DØD */ 00001190
   DIV_PARAM_OMR.ØNSKET_STATUS  =  ' ';           /* INIT 3101       */ 00001200
                                                                        00001210
   /*-----------------------------------------------------------------*/00001220
   /* OPPRETT-STATUS-FOR-FAMILIEN                                     */00001230
   /*-----------------------------------------------------------------*/00001240
                                                                        00001250
   EXEC CICS LINK PROGRAM ('R0013101') COMMAREA(KOM_OMR);               00001260
                                                                        00001270
   IF FEIL_MELD_NR   =  0    THEN                                       00001280
      DO;                                                               00001290
         DO I  = 1 TO  14;                                              00001300
                                                                        00001310
            IF B01.RF0PERSN.FNR        (I)  =  FNR_SØKER    &           00001320
               B01.STATUS.VIRK_DATO_ÅM (I)  >  0            THEN        00001330
               DO;                                                      00001340
                  SØKER_IND_SS              =  I ;                      00001350
                  I                         =  14;                      00001360
               END;                                                     00001370
         END;                                                           00001380
                                                                        00001390
         IF SØKER_IND_SS                = 0     THEN                    00001400
            DO;                                                         00001410
               KOM_OMR.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR); 00001420
               KOM_OMR.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);      00001430
                                                                        00001440
               CALL FORBEREDE_TRANS;                                    00001450
                                                                        00001460
               B01.FNR(14)              = 0; /* RYDDE OPP ETTER 5201 */ 00001470
                                                                        00001480
               IF TRANS_OPPL_OMR.BLANKETTYPE = 'O1' THEN                00001490
                  DO;                                                   00001500
                     MAP_MELDING =                                      00001510
                        'PERSONEN ER REGISTRERT SOM DØD, FJERNING BARE' 00001520
                        !! ' TILLATT VIA FJERN ALLE';                   00001530
                     FEIL        = '1'B;                                00001540
                     GOTO SLUTT        ;                                00001550
                  END;                                                  00001560
               ELSE IF FEIL  !  FATAL_FEIL THEN    GOTO SLUTT;          00001570
                                                                        00001580
              /*-----------------------------------------------------*/ 00001590
              /* BYGG-TRANS-LISTE, DVS LES SISTE TRANS               */ 00001600
              /*-----------------------------------------------------*/ 00001610
                                                                        00001620
               ANTALL_TRANS_I_TRANS_LISTE = 1;                          00001630
                                                                        00001640
               EXEC CICS LINK PROGRAM ('R0010411'   ) COMMAREA          00001650
                                      (LOKAL_KOM_OMR);                  00001660
            END;                                                        00001670
                                                                        00001680
         ELSE                                                           00001690
            SELECT  (B01.STATUS.STATUS_KODE(SØKER_IND_SS));             00001700
                                                                        00001710
               /*----------------------------------------------------*/ 00001720
               /* SISTE_STATUS                                       */ 00001730
               /* HVIS PERSON ER DØD , SKAL FJERNING AVVISES         */ 00001740
               /*----------------------------------------------------*/ 00001750
               WHEN ('S')                                               00001760
                  DO;                                                   00001770
                     IF B01.PENSJONSTYPE1(SØKER_IND_SS) = 'D' THEN      00001780
                        DO;                                             00001790
                          MAP_MELDING = 'PERSONEN ER REGISTRERT '  !!   00001800
                                        'SOM DØD, FJERNING BARE '  !!   00001810
                                        'TILLATT VIA FJERN ALLE.'    ;  00001820
                          FEIL = '1'B;                                  00001830
                          GOTO SLUTT;                                   00001840
                        END;                                            00001850
                     ELSE                                               00001860
                        DO I = 1 TO 13;                                 00001870
                           IF B01.TILKNYTNINGSKODE(SØKER_IND_SS,I) =    00001880
                                                            'D' THEN    00001890
                                                                        00001900
                              DO;                                       00001910
                                 DO J = 1 TO 14 UNTIL(B01.FNR_TILKN(    00001920
                                          SØKER_IND_SS,I) = B01.FNR(J));00001930
                                 END;                                   00001940
                                                                        00001950
                                 DO K = 1 TO 13 WHILE                   00001960
                                               (B01.FNR_TILKN(J,K) > 0);00001970
                                                                        00001980
                                    IF B01.FNR_TILKN(J,K) ^=            00001990
                                       B01.FNR(SØKER_IND_SS) THEN       00002000
                                       DO;                              00002010
                                          MAP_MELDING =                 00002020
                                             'PERSONEN ER TILKN.  ' !!  00002030
                                             'EN DØD,SOM PEKER UT ' !!  00002040
                                             'ENFOR FAMILIEN,PRØV ' !!  00002050
                                             'FJERN ALLE';              00002060
                                          FEIL = '1'B;                  00002070
                                          GOTO SLUTT;                   00002080
                                       END;                             00002090
                                 END;                                   00002100
                              END;                                      00002110
                        END;              /*  DO I = 1 TO 13;   */      00002120
                                                                        00002130
                  PIC_4 = B01.STATUS.VIRK_DATO_ÅM(SØKER_IND_SS);        00002140
                  PIC_4 = PIC_4 - 1;              /* MINUS 1 MND    */  00002150
                                                                        00002160
                  IF MOD(PIC_4,100) = 0            THEN                 00002170
                     PIC_4          = PIC_4 - 88;  /* -1 ÅR  +12MND  */ 00002180
                                                                        00002190
                  TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(PIC_4);     00002200
                  TRANS_OPPL_OMR.FØDSNUMMER    = FNR_SØKER;             00002210
                  TRANS_OPPL_OMR.BLANKETTYPE   = 'O1';                  00002220
                  STATUS_TYPE_SS          = DIV_PARAM_OMR.STATUS_TYPE;  00002230
                                                                        00002240
                  /*--------------------------------------------------*/00002250
                  /* SISTE_STATUS FLYTTES TIL B02                     */00002260
                  /*--------------------------------------------------*/00002270
                                                                        00002280
                  B02 = B01;                                            00002290
                  B01 = '';                                             00002300
                                                                        00002310
                  /*--------------------------------------------------*/00002320
                  /* N.S STATUS OPPRETTES I B01.                      */00002330
                  /*--------------------------------------------------*/00002340
                                                                        00002350
                  DIV_PARAM_OMR.ØNSKET_STATUS  = ' ';                   00002360
                                                                        00002370
                  EXEC CICS LINK PROGRAM('R0013101') COMMAREA(KOM_OMR); 00002380
                                                                        00002390
                  /*--------------------------------------------------*/00002400
                  /* SJEKKER OM TRANS.                                */00002410
                  /*--------------------------------------------------*/00002420
                                                                        00002430
                  IF DIV_PARAM_OMR.FEIL_MELD_NR    = 502   &            00002440
                     STATUS_TYPE                   = 'C'   THEN         00002450
                     DO;                                                00002460
                        DIV_PARAM_OMR.FEIL_MELD_NR = 0;                 00002470
                        ANTALL_TRANS_I_TRANS_LISTE = 0;                 00002480
                    END;                                                00002490
                                                                        00002500
                 IF DIV_PARAM_OMR.FEIL_MELD_NR     > 0     THEN         00002510
                    DO;                                                 00002520
                       FATAL_FEIL                  = '1'B;              00002530
                       GOTO SLUTT;                                      00002540
                    END;                                                00002550
                                                                        00002560
                 DO I = 1 TO 14;                                        00002570
                                                                        00002580
                    IF B01.RF0PERSN.FNR        (I) =  FNR_SØKER   &     00002590
                       B01.STATUS.VIRK_DATO_ÅM (I) >  0           THEN  00002600
                       DO;                                              00002610
                          SØKER_IND_NS             =  I ;               00002620
                          I                        =  14;               00002630
                       END;                                             00002640
                 END;                                                   00002650
                                                                        00002660
                 STATUS_TYPE_NS          = DIV_PARAM_OMR.STATUS_TYPE;   00002670
                                                                        00002680
                 /*---------------------------------------------------*/00002690
                 /*   OPPRETTER TRANS - LISTE FOR SENERE UTMAPPING.   */00002700
                 /*   BYGG OPP TRANS-LISTE                            */00002710
                 /*---------------------------------------------------*/00002720
                                                                        00002730
                 DO I = 1 TO  ANTALL_TRANS_I_TRANS_LISTE;               00002740
                    KOM_OMR.TRANS_OPPL_PEKER=ADDR(TRANS_LISTE_LINJE(I));00002750
                    KOM_OMR.TRANS_PEKER     =ADDR(TRANS_LISTE_LINJE.    00002760
                                                       VARIABEL_DEL(I));00002770
                    EXEC CICS LINK PROGRAM   ('R0010411'    )           00002780
                                   COMMAREA  ( LOKAL_KOM_OMR);          00002790
                    TRANS_ANT               =  TRANS_ANT + 1 ;          00002800
                 END;                                                   00002810
               END;                                                     00002820
                                                                        00002830
            WHEN('N')          /* NEST_SISTE_STATUS  */                 00002840
               DO;                                                      00002850
                 /*---------------------------------------------------*/00002860
                 /*   INGEN SISTE STATUS FINNES. N.S. FINNES I B01    */00002870
                 /*---------------------------------------------------*/00002880
                                                                        00002890
                  MAP_MELDING = 'PERSONEN MED FØDSELSNUMMER ' !! PIC_11 00002900
                             !! ' HAR IKKE SISTE - STATUS.' ;           00002910
                  FEIL = '1'B                               ;           00002920
                  GOTO SLUTT                                ;           00002930
               END;                                                     00002940
            OTHERWISE;   /* BLANK             */                        00002950
         END;            /* SELECT            */                        00002960
      END;               /* DO                */                        00002970
   ELSE                  /* FEIL_MELD_NR = 0  */                        00002980
      FATAL_FEIL = '1'B;                                                00002990
                                                                        00003000
 SLUTT:                                                                 00003010
                                                                        00003020
                                                                        00003030
 END VIS_MEG_SISTE_TRANS;                                               00003040
                                                                        00003050
                                                                        00003060
                                                                        00003070
  /* **************************************************************** */00003080
  /*  PROCEDURE FOR Å SKRIVE SISTE_STATUS OG NEST_SISTE_STATUS        */00003090
  /*   TIL SKJERMEN.                                                  */00003100
  /* **************************************************************** */00003110
                                                                        00003120
  MAPS_UT_ST:                                                           00003130
     PROC;                                                              00003140
                                                                        00003150
     DCL  I               FIXED BIN(15);                                00003160
                                                                        00003170
                                                                        00003180
     CALL LOW_VALUES_TIL_MAP;                                           00003190
                                                                        00003200
     IF SØKER_IND_NS              >  0                  THEN            00003210
        DO;                                                             00003220
           PIC_4  =  B01.STATUS.VIRK_DATO_ÅM    (SØKER_IND_NS);         00003230
           S0010E1O.VIRK_DATO_MÅO =  F_SNU_DATO (PIC_4);                00003240
           S0010E1O.STATUSTYPEO   =  STATUS_TYPE_NS;                    00003250
        END;                                                            00003260
                                                                        00003270
     EXEC CICS SEND MAP('S0010E1') MAPSET('S0010E3') ERASE ACCUM        00003280
                                                          PAGING;       00003290
     CALL LOW_VALUES_TIL_MAP;                                           00003300
                                                                        00003310
     IF SØKER_IND_NS              > 0 THEN                              00003320
        CALL MAPUT_STATUS('N');                                         00003330
                                                                        00003340
     CALL LOW_VALUES_TIL_MAP;                                           00003350
                                                                        00003360
     /**** HER SKAL TRANSENE UT    *****/                               00003370
     EXEC CICS SEND MAP('S0010E3') MAPSET('S0010E3') ACCUM PAGING;      00003380
     DO I = ANTALL_TRANS_I_TRANS_LISTE TO 1 BY -1;                      00003390
        CALL LOW_VALUES_TIL_MAP;                                        00003400
        KOM_OMR.TRANS_OPPL_PEKER = TRANS_LISTE.TRANS_OPPL_PTR(I);       00003410
        S0010E4O.VIRK_DATO_MÅO   = TRANS_OPPL_OMR.VIRKNINGSDATO;        00003420
        S0010E4O.BL_TYPEO        = TRANS_OPPL_OMR.BLANKETTYPE;          00003430
        S0010E4O.FNR_SØKERO      = TRANS_OPPL_OMR.FØDSNUMMER;           00003440
        IF TRANS_LISTE.FNR_EK(I) > 0 THEN                               00003450
           S0010E4O.FNR_EKTEFO   = TRANS_LISTE.FNR_EK(I);               00003460
        S0010E4O.ANT_BARNO       = TRANS_LISTE.ANT_BARN(I);             00003470
        EXEC CICS SEND MAP('S0010E4') MAPSET('S0010E3') ACCUM PAGING;   00003480
     END;                                                               00003490
                                                                        00003500
     CALL LOW_VALUES_TIL_MAP;                                           00003510
                                                                        00003520
     IF SØKER_IND_SS > 0 THEN                                           00003530
        DO;                                                             00003540
           PIC_4 = B02.STATUS.VIRK_DATO_ÅM(SØKER_IND_SS);               00003550
           S0010E5O.VIRK_DATO_MÅO = F_SNU_DATO(PIC_4);                  00003560
           S0010E5O.STATUSTYPEO   = STATUS_TYPE_SS;                     00003570
        END;                                                            00003580
                                                                        00003590
     EXEC CICS SEND MAP('S0010E5') MAPSET('S0010E3') ACCUM PAGING;      00003600
                                                                        00003610
     CALL LOW_VALUES_TIL_MAP;                                           00003620
                                                                        00003630
     IF SØKER_IND_SS > 0 THEN                                           00003640
        CALL MAPUT_STATUS('S');                                         00003650
                                                                        00003660
     CALL LOW_VALUES_TIL_MAP;                                           00003670
                                                                        00003680
     /*****      TRAILER       *****/                                   00003690
     S0010E6O.MELDINGO = 'VENNLIGST IKKE LA DETTE BILDET STÅ LENGE DA'!!00003700
                         ' DET OPPTAR STORE MASKIN-RESSURSER.';         00003710
     EXEC CICS SEND MAP('S0010E6') MAPSET('S0010E3') ACCUM PAGING;      00003720
     EXEC CICS SEND PAGE RETAIN NOAUTOPAGE;                             00003730
                                                                        00003740
     MAPUT_STATUS:                                                      00003750
        PROC(TYPE);                                                     00003760
        DCL                                                             00003770
           TYPE CHAR(1);                                                00003780
        DCL                                                             00003790
            1 HUSK_B01,                                                 00003800
              %INCLUDE   P0019921;                                      00003810
                                                                        00003820
        IF TYPE = 'S' THEN                                              00003830
           DO;                                                          00003840
              HUSK_B01 = B01;                                           00003850
              B01 = B02;                                                00003860
           END;                                                         00003870
                                                                        00003880
        DO I = 1 TO 14 ;                                                00003890
           IF B01.RF0PERSN.FNR(I) > 0 THEN                              00003900
              DO;                                                       00003910
                 IF I = 1 THEN                                          00003920
                    S0010E2O.TEKSTO = 'FNR_MOR ';                       00003930
                 ELSE IF I = 2 THEN                                     00003940
                    S0010E2O.TEKSTO = 'FNR_FAR ';                       00003950
                 ELSE                                                   00003960
                    S0010E2O.TEKSTO = 'FNR_BARN';                       00003970
                 S0010E2O.FNR_STATUSO    = B01.RF0PERSN.FNR(I);         00003980
                 S0010E2O.PT1O           = B01.STATUS.PENSJONSTYPE1(I); 00003990
                 S0010E2O.PT2O           = B01.STATUS.PENSJONSTYPE2(I); 00004000
                 S0010E2O.PT3O           = B01.STATUS.PENSJONSTYPE3(I); 00004010
                 S0010E2O.SIV_STANDO     = B01.SIVILSTAND(I);           00004020
                 EXEC CICS SEND MAP('S0010E2') MAPSET('S0010E3')        00004030
                                                    ACCUM PAGING;       00004040
              END;                                                      00004050
        END;                                                            00004060
                                                                        00004070
        IF TYPE = 'S' THEN                                              00004080
           B01 = HUSK_B01;                                              00004090
     END MAPUT_STATUS;                                                  00004100
  END MAPS_UT_ST;                                                       00004110
                                                                        00004120
  /* **************************************************************** */00004130
  /*                                                                  */00004140
  /*  PROCEDURE FOR Å HENTE SVAR OG BEKREFTELSE PÅ FJERNING           */00004150
  /*                                                                  */00004160
  /*                                                                  */00004170
  /* **************************************************************** */00004180
  /*                                                                    00004190
  */                                                                    00004200
  HENT_SVAR_OG_BEKREFT:                                                 00004210
     PROC;                                                              00004220
     EXEC CICS RECEIVE MAP('S0010E6') MAPSET('S0010E3') INTO (S0010E6I);00004230
     IF STYREKODE = 'ST' & ANTALL_TRANS_I_TRANS_LISTE = 0 THEN          00004240
        S0010E6O.MELDING1O = 'INGEN TRANSER, TA HARDCOPY SELV !  Nå !!';00004250
     ELSE                                                               00004260
        S0010E6O.MELDING1O = 'PF8 GIR LISTE AV FJERNEDE TRANSER' !!     00004270
                             ' PÅ PRINTER.';                            00004280
     S0010E6O.MELDINGO  = 'BEKREFT FJERNING MED: B   VENNLIGST VæR ' !! 00004290
                         'SNAR DA DETTE OPPTAR STORE RESSURSER';        00004300
     EXEC CICS SEND    MAP('S0010E6') MAPSET('S0010E3');                00004310
     EXEC CICS RECEIVE MAP('S0010E6') MAPSET('S0010E3') INTO (S0010E6I);00004320
                                                                        00004330
  END HENT_SVAR_OG_BEKREFT;                                             00004340
                                                                        00004350
                                                                        00004360
                                                                        00004370
  /* **************************************************************** */00004380
  /*                                                                  */00004390
  /*  PROCEDURE FOR Å OMGJØRE N-SISTE STATUS TIL SISTE OG SKRIVE UT   */00004400
  /*  PÅ BASEN VED R0015401                                           */00004410
  /*                                                                  */00004420
  /* **************************************************************** */00004430
                                                                        00004440
  FJERN_SISTE_TRANS:                                                    00004450
     PROC;                                                              00004460
                                                                        00004470
     DCL                                                                00004480
       1 HJELP_B01,                                                     00004490
         %INCLUDE   P0019921;                                           00004500
     DCL                                                                00004510
       FUNNET_I_B01      BIT (1)     INIT('0'B);                        00004520
                                                                        00004530
     FNR_ARRAY              =  0;                                       00004540
 /*  NESTE_HENDELSE_DATO_ÅM =  DAGENS_DATO_PLUSS1_ÅM;   */              00004550
     NESTE_HENDELSE_DATO_ÅM =  DAGENS_DATO_PLUSS2_ÅM;                   00004560
     KJØRINGS_TYPE          = 'O';                  /* FOR AUTOBER */   00004570
                                                                        00004580
     /*-------------------------------------------------------------*/  00004590
     /*  FJERNING AV SISTE TRANS                                    */  00004600
     /*-------------------------------------------------------------*/  00004610
                                                                        00004620
     FJERN_ALLE = '0'B;         /* INDIKERER BARE FJERNING AV SISTE */  00004630
                                                                        00004640
                                                                        00004650
     DO I = 1 TO ANTALL_TRANS_I_TRANS_LISTE;                            00004660
                                                                        00004670
        KOM_OMR.TRANS_OPPL_PEKER = TRANS_LISTE.TRANS_OPPL_PTR(I);       00004680
        SEARCH_FNR               = TRANS_OPPL_OMR.FØDSNUMMER;           00004690
                                                                        00004700
        EXEC CICS LINK PROGRAM ('R0015501') COMMAREA(LOKAL_KOM_OMR);    00004710
                                                                        00004720
                                                                        00004730
        IF DIV_PARAM_OMR.FEIL_MELD_NR > 0 THEN                          00004740
           DO;                                                          00004750
              FATAL_FEIL = '1'B;                                        00004760
              GOTO SLUTT;                                               00004770
           END;                                                         00004780
     END;                                                               00004790
                                                                        00004800
     DO I = 1 TO 13;                                                    00004810
        /*----------------------------------------------------------*/  00004820
        /* DANN DE-AKTIV-TRANS TIL STATISTIKK                       */  00004830
        /*----------------------------------------------------------*/  00004840
                                                                        00004850
        IF B02.RF0PERSN.FNR(I) > 0 THEN                                 00004860
           DO;                                                          00004870
              TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR(I);          00004880
              EXEC CICS LINK PROGRAM ('R0016301') COMMAREA(KOM_OMR);    00004890
                                                                        00004900
              IF DIV_PARAM_OMR.FEIL_MELD_NR > 0 THEN                    00004910
                 DO;                                                    00004920
                    FATAL_FEIL = '1'B;                                  00004930
                    GOTO SLUTT;                                         00004940
                 END;                                                   00004950
           END;                                                         00004960
     END;                                                               00004970
                                                                        00004980
     TRANS_OPPL_OMR.FØDSNUMMER = SEARCH_FNR;                            00004990
                                                                        00005000
     HJELP_B01 = B01;  /* N-SISTE GJEMMES UNNA   */                     00005010
                                                                        00005020
     IF SØKER_IND_NS > 0 THEN                                           00005030
        DO;                                                             00005040
           /*-------------------------------------------------------*/  00005050
           /* GJEMME UNNA DE SOM HAR SISTE,MEN IKKE N-SISTE         */  00005060
           /*-------------------------------------------------------*/  00005070
                                                                        00005080
           K    = 14;                                                   00005090
           DO I = 1 TO 14;                                              00005100
              IF B02.RF0PERSN.FNR(I) > 0 THEN                           00005110
                 DO;                                                    00005120
                    DO J = 1 TO 14;                                     00005130
                       IF B02.RF0PERSN.FNR(I) = B01.RF0PERSN.FNR(J) THEN00005140
                          FUNNET_I_B01 = '1'B;                          00005150
                                                                        00005160
                       IF FUNNET_I_B01 THEN                             00005170
                          LEAVE;                                        00005180
                    END;                                                00005190
                                                                        00005200
                    IF ^FUNNET_I_B01 THEN                               00005210
                       DO;                                              00005220
                          FNR_ARRAY(K) = B02.RF0PERSN.FNR(I);           00005230
                          K = K - 1;                                    00005240
                       END;                                             00005250
                 END;                                                   00005260
                                                                        00005270
              FUNNET_I_B01 = '0'B;                                      00005280
           END;                                                         00005290
                                                                        00005300
           /*-------------------------------------------------------*/  00005310
           /* AUTOHENDELSE BEREGNING                                */  00005320
           /*-------------------------------------------------------*/  00005330
                                                                        00005340
           B02 = B01 ;                        /* LIKT FØR AUTO    */    00005350
                                                                        00005360
         /*IF STYRINGS_OMR.BRUKERID ^= 'AUTO' THEN */                   00005370
              EXEC CICS LINK PROGRAM ('R0014901') COMMAREA(KOM_OMR);    00005380
                                                                        00005390
           /*-------------------------------------------------------*/  00005400
           /* LEGGE I B02 FOR FJERNING AV SISTE FOR DISSE PERSONER  */  00005410
           /*-------------------------------------------------------*/  00005420
                                                                        00005430
           DO I = 14 TO 1 BY -1     WHILE (FNR_ARRAY(I) > 0)         ;  00005440
              B02.RF0PERSN.FNR(I)        = FNR_ARRAY(I)              ;  00005450
              B02.STATUS.VIRK_DATO_ÅM(I) = 0;                           00005460
           END;                                                         00005470
        END;                                                            00005480
     ELSE                                                               00005490
        DO I = 1 TO 14;                                                 00005500
           B02.STATUS.VIRK_DATO_ÅM(I)    = 0;                           00005510
        END;                                                            00005520
                                                                        00005530
     B00   = HJELP_B01;                                                 00005540
                                                                        00005550
     DO I = 1 TO 14;                                                    00005560
        B00.STATUS.VIRK_DATO_ÅM(I) = 0;                                 00005570
     END;                                                               00005580
                                                                        00005590
     /*---------------------------------------------------------------*/00005600
     /* SKRIV NY STATUS TIL BASE                                      */00005610
     /*---------------------------------------------------------------*/00005620
                                                                        00005630
     EXEC CICS LINK PROGRAM ('R0015401') COMMAREA(KOM_OMR);             00005640
                                                                        00005650
     IF DIV_PARAM_OMR.FEIL_MELD_NR > 0 THEN                             00005660
        DO;                                                             00005670
           FATAL_FEIL = '1'B;                                           00005680
           GOTO SLUTT;                                                  00005690
        END;                                                            00005700
                                                                        00005710
     /*-------------------------------------------------------------*/  00005720
     /* GÅR IGJENNON B02  P.GR.A FNR OG TKNR TIL NORTRYGD           */  00005730
     /*-------------------------------------------------------------*/  00005740
                                                                        00005750
     DO I = 1 TO 14                                                  ;  00005760
                                                                        00005770
        IF B01.TKNR (I)          >  0                             THEN  00005780
           DO;                                                          00005790
              CALL P900_NOR_DATA (B02.FNR (I) , B02.TKNR (I) )       ;  00005800
                                                                        00005810
              IF DIV_PARAM_OMR.FEIL_MELD_NR >  0                  THEN  00005820
                 DO;                                                    00005830
                   FATAL_FEIL               = '1'B;                     00005840
                   GOTO SLUTT;                                          00005850
                 END;                                                   00005860
           END;                                                         00005870
     END;                                                               00005880
                                                                        00005890
     /*---------------------------------------------------------------*/00005900
     /*  UTLISTING AV FJERNEDE TRANSER . TRANS_LISTE TIL SKJERM       */00005910
     /*---------------------------------------------------------------*/00005920
                                                                        00005930
     IF ANTALL_TRANS_I_TRANS_LISTE > 0 THEN                             00005940
        EXEC CICS LINK PROGRAM ('R0010412') COMMAREA(LOKAL_KOM_OMR);    00005950
     ELSE                                                               00005960
        DO;                                                             00005970
           MAP_MELDING = 'SISTE STATUS ER NÅ FJERNET, TRYKK ENTER !  '; 00005980
           EXEC CICS SEND TEXT FROM (MAP_MELDING) ACCUM PAGING ERASE    00005990
                                                  JUSTIFY(15);          00006000
           EXEC CICS SEND PAGE RETAIN NOAUTOPAGE;                       00006010
        END;                                                            00006020
                                                                        00006030
  SLUTT:                                                                00006040
      IF DIV_PARAM_OMR.FEIL_MELD_NR = 0 &                               00006050
         FATAL_FEIL = '0'B         THEN                                 00006060
            CALL SKRIV_BRUKER_ID;                                       00006070
                                                                        00006080
  END FJERN_SISTE_TRANS;                                                00006090
                                                                        00006100
