 /*       SIST ENDRET 18/05-90 14.19.48 AV   HERMAN                   */00000000
 /*       SIST ENDRET 11/05-90 13.08.34 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 17/04-84 09.42.07 AV   KARIN                    */00000020
 /*       SIST ENDRET 27/12-82 10.15.14 AV   OLAV                     */00000030
 /*       SIST ENDRET 14/12-82 14.10.00 AV   FARVIK                   */00000040
 /*       SIST ENDRET 01/10-82 14.26.36 AV   FARVIK                   */00000050
 /* ***************************************************************** */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /*    R0014721 - PROSEDYRE I PLI                                     */00000080
 /*    PROGRAMMERER: JAN, JUNI -82.                                   */00000090
 /* ***************************************************************** */00000100
 /*HENSIKT:                                                           */00000110
 /*    BEREGNE GRUNNPENSJON ETTERLATT                                 */00000120
 /*PROGRAMTILKNYTNING:                                                */00000130
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV ETTERLATTEPEN-  */00000140
 /*    SJONSBEREGNINGEN FOR FORELDRELØSE BARN                         */00000150
 /*    INCLUDES I R0014701                                            */00000160
 /*BRUK:                                                              */00000170
 /*    CALL BEREGN_GP_BARN1(GP,TT_ANV)                                */00000180
 /*                                                                   */00000190
 /* ***************************************************************** */00000200
 /* REVIDERT FULLSTENDIG 27.4.90 - HL                                 */00000210
 /* ***************************************************************** */00000220
 %SKIP(2);                                                              00000230
 BEREGN_GP_BARN1:                                                       00000240
   PROC;                                                                00000250
     DCL                                                                00000260
         W_FÅ_MF    PIC '99',                                           00000270
         TT_ANV1    DEC FIXED(3),                                       00000280
         TT_ANV2    DEC FIXED(3),                                       00000290
         W_IND      FIXED BIN(15);                                      00000300
     DCL                                                                00000310
         1 HJDD_ÅMD,                                                    00000320
           2 HJDD_Å PIC '99',                                           00000330
           2 HJDD_M PIC '99',                                           00000340
           2 HJDD_D PIC '99';                                           00000350
                                                                        00000360
                                                                        00000370
  IF B02.FNR(1) > 0 THEN                                                00000380
     DO;                                                                00000390
     /* AVDØDES FNR ER OPPGITT */                                       00000400
        HJDD_ÅMD   = B02.DØDSDATO_ÅMD(1);                               00000410
        FNR        = B02.FNR         (1);                               00000420
        W_FÅ_MF    = FNR_R.ÅR;                                          00000430
        IF HJDD_Å - 1 - W_FÅ_MF  >= 66 THEN                             00000440
           CALL REGN_TT_67_TIL_70;                                      00000450
                                                                        00000460
        TT_ANV1 = B02.TT_FØR_1967 (1) +                                 00000470
                           (B02.TT_ETTER_1966  (1) +                    00000480
                            B02.TT_FRAMT       (1) + 11) /12 +          00000490
                            B02.TT_67_TIL_70   (1);                     00000500
                                                                        00000510
        IF TT_ANV1 > 39 THEN                                            00000520
           TT_ANV1 = 40;                                                00000530
        B02.TT_ANV(1)  = TT_ANV1;                                       00000540
    END;                                                                00000550
  ELSE                                                                  00000560
    TT_ANV1 = 40;                                                       00000570
                                                                        00000580
  IF B02.FNR(2) > 0 THEN                                                00000590
     DO;                                                                00000600
     /* AVDØDES FNR ER OPPGITT */                                       00000610
        HJDD_ÅMD   = B02.DØDSDATO_ÅMD(2);                               00000620
        FNR        = B02.FNR         (2);                               00000630
        W_FÅ_MF    = FNR_R.ÅR;                                          00000640
        IF HJDD_Å - 1 - W_FÅ_MF  >= 66 THEN                             00000650
           CALL REGN_TT_67_TIL_70;                                      00000660
                                                                        00000670
        TT_ANV2 = B02.TT_FØR_1967 (2) +                                 00000680
                           (B02.TT_ETTER_1966  (2) +                    00000690
                            B02.TT_FRAMT       (2) + 11) /12 +          00000700
                            B02.TT_67_TIL_70   (2);                     00000710
                                                                        00000720
        IF TT_ANV2 > 39 THEN                                            00000730
           TT_ANV2 = 40;                                                00000740
        B02.TT_ANV(2)  = TT_ANV2;                                       00000750
    END;                                                                00000760
  ELSE                                                                  00000770
    TT_ANV2 = 40;                                                       00000780
                                                                        00000790
  IF TT_ANV1 > TT_ANV2          THEN                                    00000800
     B02.TT_ANV(BER_SØ_IND) = TT_ANV1;                                  00000810
  ELSE                                                                  00000820
     B02.TT_ANV(BER_SØ_IND) = TT_ANV2;                                  00000830
                                                                        00000840
  W_GP = G * B02.TT_ANV(BER_SØ_IND) / 40;                               00000850
                                                                        00000860
   END BEREGN_GP_BARN1;                                                 00000870
