 /*       SIST ENDRET 14/02-89 12.44.10 AV   DYBVIK                   */00000000
 R001I91:                                                               00000010
    PROC OPTIONS(MAIN);                                                 00000020
 %SKIP;                                /*  */                           00000030
 /******************************************************************* */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /************************                                            */00000060
 /*  PROGRAM-IDENT : R001I901-UTSKRIFT AV BRUKER-ID BILDE-HOVEDPROGRAM*/00000070
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000080
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */00000090
 /*  PROGRAMMET BLE LAGET  FEB. 89                                    */00000100
 /*  ENDRINGERSDATO :                                                 */00000110
 /*  ENDRINGEN GJELDER:                                               */00000120
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000130
 /*                                                                   */00000140
 /******************************************************************* */00000150
 /*HENSIKT:                                                           */00000160
 /************                                                        */00000170
 /*  PÅLOGGING TIL REGISTRERING AV INNTEKT FRA BRUDDLISTE.            */00000180
 /*  TRANSAKSJONSKODE RI90.                                           */00000190
 /*  PROGRAMMET SENDER UT DET FØRSTE BILDE FOR INNHENTING AV          */00000200
 /*  BRUKER-IDENT, MAP S001011, MAPSET S001I93                        */00000210
 /*  RETURNERER TIL CICS MED TRANSID = RI9A SOM ER TRANSKODEN TIL     */00000220
 /*  PROGRAM R001I902, DET NESTE PROGRAM I DIALOGEN                   */00000230
 /*                                                                   */00000240
 /******************************************************************* */00000250
 /*PROGRAMTILKNYTTING:                                                */00000260
 /**********************                                              */00000270
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSKODE RI90.          */00000280
 /*  KONTROLLEN GÅR VIA CICS TIL R001I902 - KONTROLL BRUKER-ID        */00000290
 /*  TRANSAKSJONSKODEN ER R020                                        */00000300
 /*                                                                   */00000310
 /******************************************************************* */00000320
 /*DATASETTOPPLYSNINGER:                                              */00000330
 /*************************                                           */00000340
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000350
 /*                                                                   */00000360
 /******************************************************************* */00000370
 /*FEILMELDINGER:                                                     */00000380
 /*********************                                               */00000390
 /*  DET BLIR IKKE SKREVET UT FEILMELDINGER I DETTE PROGRAMMET        */00000400
 /*                                                                   */00000410
 /* ***************************************************************** */00000420
                                                                        00000430
 %PAGE;                                                                 00000440
      %INCLUDE P0019908;               /* KOM_OMR (BASED) */            00000450
 %PAGE;                                                                 00000460
      %INCLUDE P0019906;               /* TRANS_OPPL_OMRÅDE (BASED) */  00000470
 %PAGE;                                                                 00000480
      %INCLUDE P0019910;               /* STYRINGS_OMRÅDE (BASED) */    00000490
    DCL                                                                 00000500
        (BMSMAPBR, COMMAREA_PEKER) POINTER;                             00000510
    DCL                                                                 00000520
        (STG,LOW,CSTG,ADDR) BUILTIN;                                    00000530
                                                                        00000540
 %PAGE;                                /*   */                          00000550
        EXEC CICS HANDLE CONDITION ERROR(FORTSETT);                     00000560
                                                                        00000570
        ALLOCATE KOM_OMR;                                               00000580
        KOM_OMR.PEKER_LISTE.STYRINGS_PEKER = ADDR(KOM_OMR.STYRINGS_OMR);00000590
        KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =                          00000600
                                           ADDR(KOM_OMR.TRANS_OPPL_OMR);00000610
        ANT_FORSØK = 0;                                                 00000620
        TRANSKODE = 'RI9A';                                             00000630
                                                                        00000640
 FORTSETT:                                                              00000650
    /* SKRIVER SKJERMBILDE MED SPØRSMÅL OM BRUKER-ID */                 00000660
                                                                        00000670
        EXEC CICS SEND MAP('S001011') MAPSET ('S001I93') MAPONLY ERASE; 00000680
                                                                        00000690
        EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);          00000700
                                                                        00000710
    END R001I91;                                                        00000720
