 /*       SIST ENDRET 06/01-93 12.28.49 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 24/02-92 14.42.35 AV   HERMAN                   */00000010
 /*       SIST ENDRET 22/11-91 08.45.35 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 10/10-91 13.57.00 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 06/03-91 11.50.56 AV   DYBVIK                   */00000040
  /* **************************************************************** */00000050
  /*IDENTIFIKASJON:                                                   */00000060
  /*    R001N903 - PROSEDYRE I PLI                                    */00000070
  /*    PROGRAMMERER: GEIR, JULI 1981                                 */00000080
  /*HENSIKT:                                                          */00000090
  /*    PROSEDYREN FORETAR KONTROLL AV DATA FOR EF_SØKER              */00000100
  /*    FRA GRUNNBLANKETT  ETTERLATT FAMILIEPLEIER.                   */00000110
  /*PROGRAMTILKNYTNING:                                               */00000120
  /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLING AV ETTERLATT       */00000130
  /*    FAMILIEPLEIERPENSJON.                                         */00000140
  /*    INCLUDES I R001N901.                                          */00000150
  /*BRUK:                                                             */00000160
  /*    CALL KONTROLL_E4_SØKER (FEIL_I_E4_SØKER);                     */00000170
  /*                                                                  */00000180
 /*ENDRET: 13.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000190
 /* ******                                                            */00000200
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000210
 /*    OM FNR ER ENDRET (R0019906).                                   */00000220
  /* **************************************************************** */00000230
  /*                                                                  */00000240
  /*    MODULEN KONTROLLERER EF_SØKER OG RETURNERER MED               */00000250
  /*    FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG.               */00000260
  /*                                                                  */00000270
  /* **************************************************************** */00000280
  %SKIP(2);                                                             00000290
  KONTROLL_E4_SØKER:                                                    00000300
    PROC (FEIL_FUNNET);                                                 00000310
    DCL                                                                 00000320
       FEIL_FUNNET BIT (1);                                             00000330
   DCL                                                                  00000340
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00000350
      KEY_PEKER                  POINTER,                               00000360
      TK_RECL                    CHAR (101);                            00000370
    DCL                                                                 00000380
       TT_FRAM_TIL                         PIC'(4)9',                   00000390
       ALDER                               FIXED DEC (5);               00000400
  %PAGE;                    /*      */                                  00000410
  /*   HJELPE DCL FOR Å SNU DATO                                      */00000420
                                                                        00000430
    DCL                                                                 00000440
      HJ_FNR                                    PIC'(11)9';             00000450
    DCL                                                                 00000460
      1 FNR DEF HJ_FNR,                                                 00000470
        2 DAG                                   PIC'(2)9',              00000480
        2 MND                                   PIC'(2)9',              00000490
        2 AAR                                   PIC'(2)9',              00000500
        2 ÅRHUNDRE                              PIC'9',                 00000510
        2 REST                                  PIC'(4)9';              00000520
    DCL                                                                 00000530
       HJ_VIRK_DATO_ÅM                             PIC '9999',          00000540
       VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅM POS(1)      PIC '99',            00000550
       VIRK_DATO_M DEF HJ_VIRK_DATO_ÅM POS(3)      PIC '99';            00000560
    DCL                                                                 00000570
       HJ_VIRK_DATO_MÅ                             PIC '9999',          00000580
       HJ_VIRK_DATO_M DEF HJ_VIRK_DATO_MÅ POS(1)   PIC '99',            00000590
       HJ_VIRK_DATO_Å DEF HJ_VIRK_DATO_MÅ POS(3)   PIC '99';            00000600
                                                                        00000610
  /*   HJELPE DCL FOR Å SNU DATO                                      */00000620
                                                                        00000630
    DCL                                                                 00000640
       HJ_FRAML_DATO_ÅM                            PIC '9999',          00000650
       FRAML_DATO_Å DEF HJ_FRAML_DATO_ÅM POS(1)    PIC '99',            00000660
       FRAML_DATO_M DEF HJ_FRAML_DATO_ÅM POS(3)    PIC '99';            00000670
    DCL                                                                 00000680
       HJ_FRAML_DATO_MÅ                            PIC'9999',           00000690
       HJ_FRAML_DATO_M DEF HJ_FRAML_DATO_MÅ POS(1) PIC'99',             00000700
       HJ_FRAML_DATO_Å DEF HJ_FRAML_DATO_MÅ POS(3) PIC'99';             00000710
    DCL                                                                 00000720
       TT_FRA1937_ÅM                               PIC'9999',           00000730
       TT_FRA1937_ÅR   DEF TT_FRA1937_ÅM     POS(1) PIC'99',            00000740
       TT_FRA1937_MND  DEF TT_FRA1937_ÅM     POS(3) PIC'99';            00000750
                                                                        00000760
    DCL 1 FNR_REG,                                                      00000770
          2 FNR1       FIXED DEC(11),                                   00000780
          2 FNR2       FIXED DEC(11),                                   00000790
          2 BRUKERID   CHAR     ( 4);                                   00000800
                                                                        00000810
                                                                        00000820
       FNR_REG.BRUKERID =  DIV_PARAM_OMR.CICS_IND;                      00000830
       ANT_FEIL_SKREVET =  0;                                           00000840
       FEIL_FUNNET      = '0'B;                                         00000850
       KEY_PEKER        =  ADDR(E4S.TKNR);                              00000860
                                                                        00000870
                                                                        00000880
    HJ_VIRK_DATO_MÅ  = E4S.VIRK_DATO_MÅ;                                00000890
    VIRK_DATO_Å      = HJ_VIRK_DATO_Å;                                  00000900
    VIRK_DATO_M      = HJ_VIRK_DATO_M;                                  00000910
                                                                        00000920
       IF ^ F_NUMERISK(F_FELT_PIC_CHAR11(E4S.FNR)) THEN                 00000930
          DO;                                                           00000940
            FEIL_FUNNET = '1'B;                                         00000950
            E4S.FNRNR   = 200;                                          00000960
          END;                                                          00000970
       ELSE                                                             00000980
       IF ^ F_GYLDIG_FNR(E4S.FNR) THEN                                  00000990
          DO;                                                           00001000
            FEIL_FUNNET = '1'B;                                         00001010
            E4S.FNRNR   = 1;                                            00001020
          END;                                                          00001030
       ELSE                                                             00001040
          DO;                                                           00001050
             FNR_REG.FNR1 = E4S.FNR;                                    00001060
             EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);      00001070
             IF FNR_REG.FNR2 > 0 THEN                                   00001080
                DO;                                                     00001090
                   E4S.FNRNR   = 203;                                   00001100
                   E4S.FNR_GML = E4S.FNR;                               00001110
                   E4S.FNR     = FNR_REG.FNR2;                          00001120
                END;                                                    00001130
          END;                                                          00001140
       IF E4S.NAVN       = (25)' ' THEN                                 00001150
          DO;                                                           00001160
             FEIL_FUNNET = '1'B;                                        00001170
             E4S.NAVNNR  = 2;                                           00001180
          END;                                                          00001190
       IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(E4S.TKNR)) THEN                 00001200
          DO;                                                           00001210
            FEIL_FUNNET = '1'B;                                         00001220
            E4S.TKNRNR  = 200;                                          00001230
          END;                                                          00001240
       ELSE                                                             00001250
          DO;                                                           00001260
               EXEC CICS HANDLE CONDITION NOTFND(NOTFND);               00001270
               EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)       00001280
                                                  INTO(TK_RECL);        00001290
               GOTO TKNR_UT;                                            00001300
            NOTFND:                                                     00001310
               FEIL_FUNNET = '1'B;                                      00001320
               E4S.TKNRNR  = 3;                                         00001330
               LEAVE;                                                   00001340
            TKNR_UT:                                                    00001350
               DIV_PARAM_OMR.DIV_TKNR = SUBSTR(TK_RECL,1,4);            00001360
          END;                                                          00001370
       IF VERIFY(E4S.SIVILSTAND,'USE') ^= 0 THEN                        00001380
          DO;                                                           00001390
            FEIL_FUNNET      = '1'B;                                    00001400
            E4S.SIVILSTANDNR = 5;                                       00001410
          END;                                                          00001420
       IF VERIFY(E4S.SPRÅK,'NB ') ^= 0 THEN                             00001430
          DO;                                                           00001440
            FEIL_FUNNET = '1'B;                                         00001450
            E4S.SPRÅKNR = 6;                                            00001460
          END;                                                          00001470
       IF VERIFY(E4S.NORSK_BOSATT,'JN') ^= 0 THEN                       00001480
          DO;                                                           00001490
            FEIL_FUNNET        = '1'B;                                  00001500
            E4S.NORSK_BOSATTNR = 8;                                     00001510
          END;                                                          00001520
       IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(E4S.FORVENTET)) THEN            00001530
          DO;                                                           00001540
            FEIL_FUNNET     = '1'B;                                     00001550
            E4S.FORVENTETNR = 200;                                      00001560
          END;                                                          00001570
       IF VERIFY(E4S.GP_OS_KODE,'PO') ^= 0 THEN                         00001580
          DO;                                                           00001590
            FEIL_FUNNET      = '1'B;                                    00001600
            E4S.GP_OS_KODENR = 68;                                      00001610
          END;                                                          00001620
       IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(E4S.FRAML_DATO_MÅ)) THEN        00001630
          DO;                                                           00001640
            FEIL_FUNNET         = '1'B;                                 00001650
            E4S.FRAML_DATO_MÅNR = 200;                                  00001660
          END;                                                          00001670
       ELSE                                                             00001680
          IF ^F_GYLDIG_DATO(E4S.FRAML_DATO_MÅ) &                        00001690
              E4S.FRAML_DATO_MÅ > 0 THEN                                00001700
            DO;                                                         00001710
              FEIL_FUNNET         = '1'B;                               00001720
              E4S.FRAML_DATO_MÅNR = 71;                                 00001730
            END;                                                        00001740
       IF VERIFY(E4S.FRAMLEGGSKODE,'AO ') ^= 0 THEN                     00001750
          DO;                                                           00001760
            FEIL_FUNNET         = '1'B;                                 00001770
            E4S.FRAMLEGGSKODENR = 73;                                   00001780
          END;                                                          00001790
       IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(E4S.VIRK_DATO_MÅ)) THEN         00001800
          DO;                                                           00001810
            FEIL_FUNNET        = '1'B;                                  00001820
            E4S.VIRK_DATO_MÅNR = 200;                                   00001830
          END;                                                          00001840
       ELSE                                                             00001850
         IF ^F_GYLDIG_DATO(E4S.VIRK_DATO_MÅ) THEN                       00001860
            DO;                                                         00001870
              FEIL_FUNNET        = '1'B;                                00001880
              E4S.VIRK_DATO_MÅNR = 9;                                   00001890
            END;                                                        00001900
  /* HER SETTES VERDIER INN I MENY_OMR  */                              00001910
                                                                        00001920
     FØDSNUMMER    = E4S.FNR;                                           00001930
     VIRKNINGSDATO = E4S.VIRK_DATO_MÅ;                                  00001940
  %SKIP (3);                    /*    */                                00001950
  /*    KRYSSKONTROLLER        */                                       00001960
  %SKIP;                                                                00001970
       IF ^FEIL_FUNNET THEN                                             00001980
          DO;                                                           00001990
            ALDER            = F_ALDER(E4S.FNR, E4S.VIRK_DATO_MÅ);      00002000
            HJ_VIRK_DATO_MÅ  = E4S.VIRK_DATO_MÅ;                        00002010
            HJ_VIRK_DATO_ÅM  = F_SNU_DATO(E4S.VIRK_DATO_MÅ);            00002020
            VIRK_DATO_Å      = HJ_VIRK_DATO_Å;                          00002030
            VIRK_DATO_M      = HJ_VIRK_DATO_M;                          00002040
            HJ_FRAML_DATO_MÅ = E4S.FRAML_DATO_MÅ;                       00002050
            FRAML_DATO_Å     = HJ_FRAML_DATO_Å;                         00002060
            FRAML_DATO_M     = HJ_FRAML_DATO_M;                         00002070
                                                                        00002080
       IF HJ_VIRK_DATO_ÅM < 9101  THEN                                  00002090
          DO;                                                           00002100
            FEIL_FUNNET        = '1'B;                                  00002110
            E4S.VIRK_DATO_MÅNR = 364;                                   00002120
          END;                                                          00002130
                                                                        00002140
 /*LOVENDRING - HL : */                                                 00002150
                                                                        00002160
       IF ALDER < 1800                                         !        00002170
          ALDER > 6912                                         !        00002180
          (ALDER > 6612 & VIRK_DATO_Å > 72 & VIRK_DATO_Å < 91) !        00002190
          (ALDER > 6700 & VIRK_DATO_Å > 90)               THEN          00002200
          DO;                                                           00002210
             FEIL_FUNNET        = '1'B;                                 00002220
             E4S.FNRNR          = 100;                                  00002230
             E4S.VIRK_DATO_MÅNR = 999;                                  00002240
          END;                                                          00002250
       END;                                                             00002260
                                                                        00002270
    DCL V_DATO  PIC '99';                                               00002280
    DCL V_AAR   PIC '99';                                               00002290
    DCL V_MND   PIC '99';                                               00002300
    DCL V_1937  PIC '99999';                                            00002310
                                                                        00002320
                                                                        00002330
                                                                        00002340
                                                                        00002350
      IF E4S.NORSK_BOSATT = 'J' THEN                                    00002360
         DO;                                                            00002370
            HJ_FNR               = E4S.FNR;                             00002380
            TT_FRAM_TIL          = FNR.AAR + 66;                        00002390
            TT_FRA1937_ÅM   = (HJ_VIRK_DATO_Å - (FNR.AAR + 16)) * 100;  00002400
            E4SP.TT_FRA_1937_ÅR  = TT_FRA1937_ÅR;                       00002410
            E4SP.TT_FRA_1937_MND = FNR.MND;                             00002420
         END;                                                           00002430
        V_1937  = TT_FRA1937_ÅM;                                        00002440
        V_MND   = FNR.MND;                                              00002450
        V_AAR   = FNR.AAR;                                              00002460
        V_DATO  = HJ_VIRK_DATO_Å;                                       00002470
  END KONTROLL_E4_SØKER;                                                00002480
