 /*       SIST ENDRET 07/07-98 12.50.20 AV   JDA7339                  */00000000
 /*       SIST ENDRET 07/07-98 12.48.08 AV   JDA7339                  */00000010
 /*       SIST ENDRET 23/09-94 14.27.40 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 22/07-94 10.42.43 AV   HERMAN                   */00000030
 /*       SIST ENDRET 15/02-93 14.46.51 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 17/03-92 07.53.49 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 06/03-91 11.49.34 AV   DYBVIK                   */00000060
 /* ***************************************************************** */00000070
 /*IDENTIFIKASJON:                                                    */00000080
 /*    R001N805 PLI          R.FARVIK DATA-UTVIKLING AS               */00000090
 /*                          OG TRUDE                                 */00000100
 /*    PROGRAMMET ER LAGET I NOV 1990.   NY VERSJON                   */00000110
 /*HENSIKT:                                                           */00000120
 /*    KONTROLLERE SPES.INFO DELEN PÅ GRUNNBLANKETTT ETTERLATT EK.    */00000130
 /*BRUKES:                                                            */00000140
 /*    CALL KONTROLL_E3_SPES(FEIL_I_E3_SPES);                         */00000150
 /*PARAMETRE INN:                                                     */00000160
 /*    INGEN, MEN BRUKER E3SP DATAENE I E3_TRANS_OMR.                 */00000170
 /*PARAMETRE UT :                                                     */00000180
 /*    FEIL_FUNNET                                                    */00000190
 /* ***************************************************************** */00000200
  KONTROLL_E3_SPES:                                                     00000210
    PROC(FEIL_FUNNET);                                                  00000220
 %SKIP(2);                                                              00000230
   DCL                                                                  00000240
      FEIL_FUNNET                        BIT(1);                        00000250
   DCL                                                                  00000260
      T_FNR                              PIC'(11)9',                    00000270
      FNR_AVDØD                          PIC'(11)9';                    00000280
   DCL                                                                  00000290
      KEY_BIT1                   BIT(32) BASED (KEY_PEKER1),            00000300
      KEY_BIT2                   BIT(32) BASED (KEY_PEKER2),            00000310
      KEY_PEKER1                 POINTER,                               00000320
      KEY_PEKER2                 POINTER,                               00000330
      ST_RECL                    CHAR (35);                             00000340
   DCL                                                                  00000350
      1 FNR            DEF T_FNR,                                       00000360
         2 DG          PIC'99',                                         00000370
         2 MN          PIC'99',                                         00000380
         2 ÅR          PIC'99',                                         00000390
         2 PERSNR,                                                      00000400
            3 ÅRHUNDRE PIC'999',                                        00000410
            3 REST     PIC'99';                                         00000420
   DCL                                                                  00000430
      1 FNR_EK         DEF FNR_AVDØD,                                   00000440
         2 DG_EK       PIC'99',                                         00000450
         2 MN_EK       PIC'99',                                         00000460
         2 ÅR_EK       PIC'99',                                         00000470
         2 PERSNR_EK,                                                   00000480
            3 ÅRHUNDRE_EK PIC'999',                                     00000490
            3 REST_EK     PIC'99';                                      00000500
 %PAGE;                                                                 00000510
   DCL                                                                  00000520
      FYLT_SEKSTIEKS                     PIC'(4)9' INIT(0),             00000530
      FYLT_SYTTI                         PIC'(4)9' INIT(0);             00000540
   DCL                                                                  00000550
      TT                                 PIC'99' INIT(0),               00000560
      MAKS_TT_ETTER_DØD                  PIC'(4)9' INIT(0),             00000570
      W_TT_MND                           PIC'(3)9' INIT(0),             00000580
      W_TT_MND_EK                        PIC'(3)9' INIT(0),             00000590
      TT_MAKS_TIL_DATO                   PIC'(4)9' INIT(0),             00000600
      TIL_DATO_MÅ                        PIC'(4)9' INIT(0),             00000610
      TIL_DATO_ÅM                        PIC'(4)9' INIT(0);             00000620
   DCL                                                                  00000630
      T_DØD_EK                           PIC'(6)9' INIT(0),             00000640
      DØD_M       PIC'(2)9' DEF T_DØD_EK POS(3),                        00000650
      DØD_Å       PIC'(2)9' DEF T_DØD_EK POS(5),                        00000660
      DØD_MND PIC'(4)9',                                                00000670
      T_VIRK_DATO_MND                    PIC'(4)9' INIT(0),             00000680
      T_VIRK_DATO                        PIC'(4)9' INIT(0);             00000690
   DCL                                                                  00000700
      VIRK_DATO_M DEF T_VIRK_DATO POS(1) PIC'(2)9',                     00000710
      VIRK_DATO_Å DEF T_VIRK_DATO POS(3) PIC'(2)9';                     00000720
   DCL                                                                  00000730
      TT_TIL_TPK                         PIC'(4)9' INIT(0);             00000740
 %PAGE;                                                                 00000750
      FEIL_FUNNET     = '0'B;                                           00000760
      KEY_PEKER1      = ADDR(E3SP.STATSBORGER);                         00000770
      KEY_PEKER2      = ADDR(E3SP.BOSATT);                              00000780
      T_DØD_EK        = E3S.DØDSDATO_EK;                                00000790
      T_FNR           = E3S.FNR;                                        00000800
      FNR_AVDØD       = E3S.FNR_EK;                                     00000810
      T_VIRK_DATO     = E3S.VIRK_DATO_MÅ;                               00000820
      T_VIRK_DATO_MND = (VIRK_DATO_Å * 12) + VIRK_DATO_M;               00000830
 %PAGE;                                /*  */                           00000840
                                                                        00000850
 /* ***************************************************************** */00000860
 /*           F E L T K O N T R O L L E R - SØKER                     */00000870
 /* ***************************************************************** */00000880
                                                                        00000890
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND1);               00000900
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT1)       00000910
                                               INTO(ST_RECL);           00000920
              GOTO STAT_UT;                                             00000930
          NOTFND1:                                                      00000940
              FEIL_FUNNET        = '1'B;                                00000950
              E3SP.STATSBORGERNR = 24;                                  00000960
              GOTO STAT_UT;                                             00000970
          STAT_UT:                                                      00000980
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND2);               00000990
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT2)       00001000
                                               INTO(ST_RECL);           00001010
              GOTO BO_UT;                                               00001020
          NOTFND2:                                                      00001030
              FEIL_FUNNET   = '1'B;                                     00001040
              E3SP.BOSATTNR = 25;                                       00001050
              GOTO BO_UT;                                               00001060
          BO_UT:                                                        00001070
                                                                        00001080
   IF E3SP.PENSJONSTRYGDET = 'N'  THEN                                  00001090
           PENSJONSTRYGDET = ' ';                                       00001100
   IF ^(E3SP.PENSJONSTRYGDET = 'J' ! E3SP.PENSJONSTRYGDET = ' ') THEN   00001110
          DO;                                                           00001120
             FEIL_FUNNET        = '1'B;                                 00001130
             E3SP.PENSJONSTRYGDETNR = 354;                              00001140
          END;                                                          00001150
       IF E3SP.MINST_20ÅR = 'N' THEN                                    00001160
          E3SP.MINST_20ÅR = ' ';                                        00001170
       IF ^(E3SP.MINST_20ÅR = ' ' ! E3SP.MINST_20ÅR = 'J') THEN         00001180
          DO;                                                           00001190
             FEIL_FUNNET        = '1'B;                                 00001200
             E3SP.MINST_20ÅRNR = 355;                                   00001210
          END;                                                          00001220
   IF ^(E3SP.FRAVIK_KONVENSJON = 'J' ! E3SP.FRAVIK_KONVENSJON = 'N'!    00001230
            E3SP.FRAVIK_KONVENSJON = ' ') THEN                          00001240
          DO;                                                           00001250
             FEIL_FUNNET          = '1'B;                               00001260
             E3SP.FRAVIK_KONVENSJONNR = 119;                            00001270
          END;                                                          00001280
       IF ^(E3SP.FRAVIK_FLYKT = ' ' ! E3SP.FRAVIK_FLYKT = 'J') THEN     00001290
          DO;                                                           00001300
             FEIL_FUNNET         = '1'B;                                00001310
             E3SP.FRAVIK_FLYKTNR = 26;                                  00001320
          END;                                                          00001330
 /*    E3SP.OVERKOMP_UTL = ' ' ; TILBAKE 9712 HL  :         */          00001340
                                                                        00001350
       IF ^(E3SP.OVERKOMP_UTL = 'N' ! E3SP.OVERKOMP_UTL = 'J' !         00001360
            E3SP.OVERKOMP_UTL = ' ')                            THEN    00001370
          DO;                                                           00001380
             FEIL_FUNNET         = '1';                                 00001390
             E3SP.OVERKOMP_UTLNR = 35 ;                                 00001400
          END;                                                          00001410
                                                                        00001420
       IF ^(E3SP.IKKE_GP = 'J' ! E3SP.IKKE_GP = ' ') THEN               00001430
          DO;              /*RETTET TIL'J' FRA 'N' SE BRUKERB. */       00001440
             FEIL_FUNNET    = '1';                                      00001450
             E3SP.IKKE_GPNR = 36;                                       00001460
          END;                                                          00001470
 IF   E3SP.BEREGNING_KONVENSJON = 'N' THEN                              00001480
      E3SP.BEREGNING_KONVENSJON = ' ' ;                                 00001490
 IF ^(E3SP.BEREGNING_KONVENSJON = ' ' !                                 00001500
      E3SP.BEREGNING_KONVENSJON = 'J') THEN                             00001510
          DO;                                                           00001520
             FEIL_FUNNET        = '1'B;                                 00001530
             E3SP.BEREGNING_KONVENSJONNR = 78;                          00001540
          END;                                                          00001550
   IF ^F_NUMERISK(F_FELT_PIC_CHAR2(E3SP.TT_KONVENSJON_ÅR)) THEN         00001560
          DO;                                                           00001570
             FEIL_FUNNET       = '1'B;                                  00001580
             E3SP.TT_KONVENSJON_ÅRNR = 125;                             00001590
          END;                                                          00001600
 %PAGE;                                                                 00001610
                                                                        00001620
   IF  E3S.DØDSDATO_EK > 930100 THEN          /*93*/                    00001630
        DO;                                                             00001640
           E3SP.TT_FRA_1937ÅR    = 0;                                   00001650
           E3SP.TT_FRA_1937MND   = 0;                                   00001660
        END;                                                            00001670
  /*                                                                    00001680
   IF ^F_NUMERISK(F_FELT_PIC_CHAR2(E3SP.TT_FRA_1937ÅR)) THEN            00001690
          DO;                                                           00001700
             FEIL_FUNNET       = '1'B;                                  00001710
             E3SP.TT_FRA_1937ÅRNR = 200;                                00001720
          END;                                                          00001730
                                                                        00001740
   IF ^F_NUMERISK(F_FELT_PIC_CHAR2(E3SP.TT_FRA_1937MND)) THEN           00001750
          DO;                                                           00001760
             FEIL_FUNNET       = '1'B;                                  00001770
             E3SP.TT_FRA_1937MNDNR = 200;                               00001780
          END;                                                          00001790
     ENDERET SP 23.09.94   */                                           00001800
                                                                        00001810
 IF E3SP.TT_NORDEN_ANNET = 'N' THEN                                     00001820
    E3SP.TT_NORDEN_ANNET = ' ';                                         00001830
                                                                        00001840
 IF ^(E3SP.TT_NORDEN_ANNET = ' ' ! E3SP.TT_NORDEN_ANNET = 'J') THEN     00001850
          DO;                                                           00001860
             FEIL_FUNNET       = '1'B;                                  00001870
             E3SP.TT_NORDEN_ANNETNR = 361;                              00001880
          END;                                                          00001890
                                                                        00001900
       IF ^F_NUMERISK(F_FELT_PIC_CHAR4(E3SP.STI)) THEN                  00001910
          DO;                                                           00001920
             FEIL_FUNNET   = '1';                                       00001930
             E3SP.STINR = 200;                                          00001940
          END;                                                          00001950
                                                                        00001960
 IF E3SP.VILKÅR_10_5_NR2 = 'N' THEN                                     00001970
    E3SP.VILKÅR_10_5_NR2 = ' ';                                         00001980
                                                                        00001990
                                                                        00002000
 IF ^(E3SP.VILKÅR_10_5_NR2 = ' ' ! E3SP.VILKÅR_10_5_NR2 = 'J') THEN     00002010
          DO;                                                           00002020
             FEIL_FUNNET       = '1'B;                                  00002030
             E3SP.VILKÅR_10_5_NR2NR = 365;                              00002040
          END;                                                          00002050
                                                                        00002060
 %PAGE;                                /*    */                         00002070
 /* ***************************************************************** */00002080
 /*              K R Y S S K O N T R O L L E R - SØKER                */00002090
 /* ***************************************************************** */00002100
                                                                        00002110
 IF ^FEIL_FUNNET THEN                                                   00002120
    DO;                                                                 00002130
                                                                        00002140
       IF E3SP.BOSATT = 0 &  (E3SP.PENSJONSTRYGDET = 'J' !              00002150
                              E3SP.MINST_20ÅR      = 'J' !              00002160
                              E3SP.FRAVIK_KONVENSJON   = 'J') THEN      00002170
          DO;                                                           00002180
             FEIL_FUNNET          = '1'B;                               00002190
             E3SP.BOSATTNR        = 110;                                00002200
          END;                                                          00002210
                                                                        00002220
       IF E3SP.FRAVIK_FLYKT = 'J'  & (E3SP.TT_FRA_1937ÅR > 0 &          00002230
                                    E3SP.TT_FRA_1937MND > 0 ) THEN      00002240
          DO;                                                           00002250
             FEIL_FUNNET          = '1'B;                               00002260
             E3SP.FRAVIK_FLYKTNR   = 157;                               00002270
             E3SP.TT_FRA_1937ÅRNR = 999;                                00002280
             E3SP.TT_FRA_1937MNDNR = 999;                               00002290
          END;                                                          00002300
       IF E3SP.BEREGNING_KONVENSJON = 'J' &                             00002310
                         E3SP.TT_KONVENSJON_ÅR = 0   THEN               00002320
          DO;                                                           00002330
             FEIL_FUNNET          = '1'B;                               00002340
             E3SP.BEREGNING_KONVENSJONNR = 358;                         00002350
             E3SP.TT_KONVENSJON_ÅRNR = 999;                             00002360
          END;                                                          00002370
   /*  IF E3SP.VILKÅR_10_5_NR2 = ' '  & (E3SP.TT_FRA_1937ÅR > 0 &       00002380
                                    E3SP.TT_FRA_1937MND > 0 )  THEN     00002390
          DO;                                                           00002400
             FEIL_FUNNET          = '1'B;                               00002410
             E3SP.VILKÅR_10_5_NR2NR = 357;                              00002420
             E3SP.TT_FRA_1937ÅRNR = 999;                                00002430
             E3SP.TT_FRA_1937MNDNR = 999;                               00002440
          END;   FJERNES TRUDE? */                                      00002450
                                                                        00002460
 %PAGE;   /*  */                                                        00002470
 /* ***************************************************************** */00002480
 /* REGNER UT ÅR OG MND VEDKOMMENDE FYLLER 67 ÅR (ÅÅMM)               */00002490
 /*(SIFFER 7-9 ANGIR ÅRHUNDRE:1800-TALLET 500-749,1900-TALLET 000-499)*/00002500
 /* ***************************************************************** */00002510
 /*    IF ÅRHUNDRE <= 499 THEN                                          00002520
          FYLT_SEKSTISEKS = ((ÅR + 66) * 12) + MN;                      00002530
       ELSE                                                             00002540
          FYLT_SEKSTISEKS = (((ÅR + 66) - 100) * 12) + MN;              00002550
      */                                                                00002560
 /* ***************************************************************** */00002570
 /* REGNER UT ÅR OG MND VEDKOMMENDE FYLLER 70 ÅR (ÅÅMM)  (SE OVENFOR) */00002580
 /* ***************************************************************** */00002590
                                                                        00002600
  /*   FYLT_SYTTI = FYLT_SEKSTISJU + 36;  */                            00002610
                                                                        00002620
 %PAGE;                                /*   */                          00002630
                                                                        00002640
 /*** TRYGDETIDEN MÅ ALLTID OPPGIS NÅR DET ER SPESIELLE OPPLYSNINGER*/  00002650
 /*** UNTATT NÅR YSKADE_TILLEGG = J                                 */  00002660
                                                                        00002670
 /* IF  E3S.YSKADE_TILLEGG  ^= 'J'    THEN                              00002680
      DO;                                                               00002690
       IF E3SP.TT_FRA_1937ÅR     = 0 &                                  00002700
          E3SP.TT_FRA_1937MND    = 0 &                                  00002710
                                                                        00002720
          E3SP.TT_FRA_1937_ÅR_EK =  0 &                                 00002730
          E3SP.TT_FRA_1937_MND_EK =  0  THEN                            00002740
                                                                        00002750
          DO;                                                           00002760
             FEIL_FUNNET = '1'B;                                        00002770
             E3SP.TT_FRA_1937ÅRNR = 195;                                00002780
             E3SP.TT_FRA_1937MNDNR = 999;                               00002790
             E3SP.TT_FRA_1937_ÅR_EKNR = 999;                            00002800
             E3SP.TT_FRA_1937_MND_EKNR = 999;                           00002810
          END;                                                          00002820
      END; **** */                                                      00002830
                                                                        00002840
    IF E3SP.STI > 0 THEN                                                00002850
      TIL_DATO_MÅ = E3SP.STI;                                           00002860
    ELSE                                                                00002870
      TIL_DATO_MÅ = E3S.DØDSDATO_EK;                                    00002880
                                                                        00002890
    IF E3S.FNR_EK = 11111111111   THEN                                  00002900
       TIL_DATO_MÅ = E3S.VIRK_DATO_MÅ;                                  00002910
                                                                        00002920
    TIL_DATO_ÅM  = F_SNU_DATO(TIL_DATO_MÅ);                             00002930
                                                                        00002940
    IF FNR.ÅR  < 21 ! ÅRHUNDRE > 499 THEN                               00002950
       TT_MAKS_TIL_DATO = TIL_DATO_ÅM - 1937;                           00002960
    ELSE                                                                00002970
       TT_MAKS_TIL_DATO = TIL_DATO_ÅM - FNR.ÅR + 16;                    00002980
                                                                        00002990
    W_TT_MND  = E3SP.TT_FRA_1937ÅR * 12 + E3SP.TT_FRA_1937MND;          00003000
                                                                        00003010
    IF W_TT_MND > TT_MAKS_TIL_DATO THEN                                 00003020
       DO;                                                              00003030
          FEIL_FUNNET     = '1'B;                                       00003040
          E3SP.TT_FRA_1937ÅRNR  = 359;                                  00003050
          E3SP.TT_FRA_1937MNDNR = 359;                                  00003060
       END;                                                             00003070
                                                                        00003080
   /* KONTROLL AVDØDE */                                                00003090
                                                                        00003100
       IF E3S.NORSK_BOSATT_EK  = 'N'  THEN                              00003110
         DO;                                                            00003120
            TIL_DATO_ÅM = F_SNU_DATO(TIL_DATO_MÅ);                      00003130
            W_TT_MND_EK  = E3SP.TT_FRA_1937_ÅR_EK * 12  +               00003140
                        E3SP.TT_FRA_1937_MND_EK;                        00003150
                                                                        00003160
            IF FNR.ÅR < 21 ! ÅRHUNDRE > 499 THEN                        00003170
               TT_MAKS_TIL_DATO = TIL_DATO_ÅM - 1937;                   00003180
            ELSE                                                        00003190
               TT_MAKS_TIL_DATO = TIL_DATO_ÅM - FNR.ÅR + 16;            00003200
                                                                        00003210
            IF W_TT_MND_EK > TT_MAKS_TIL_DATO THEN                      00003220
              DO;                                                       00003230
                FEIL_FUNNET     = '1'B;                                 00003240
                E3SP.TT_FRA_1937_ÅR_EKNR  = 359;                        00003250
           END;                                                         00003260
                                                                        00003270
            IF ^FEIL_FUNNET THEN                                        00003280
              DO;                                                       00003290
                IF E3SP.BOSATT ^= 0  & E3SP.FRAVIK_FLYKT = 'J' THEN     00003300
                  DO;                                                   00003310
                    FEIL_FUNNET = '1'B;                                 00003320
                    E3SP.BOSATTNR = 360;                                00003330
                    E3SP.FRAVIK_FLYKTNR = 999;                          00003340
                  END;                                                  00003350
              END;                                                      00003360
          END;   /* NORSK_BOSATT_EK  */                                 00003370
                                                                        00003380
    END;  /*FEIL_FUNNET */                                              00003390
  END KONTROLL_E3_SPES;                                                 00003400
 %PAGE;                                                                 00003410
                                                                        00003420
 KONTROLL_E3_SPES_EK:                                                   00003430
   PROC(FEIL_FUNNET);                                                   00003440
 /* ***************************************************************** */00003450
 /*           F E L T K O N T R O L L E R  -  AVDØDE                  */00003460
 /* ***************************************************************** */00003470
 %SKIP(2);                                                              00003480
                                                                        00003490
  DCL FEIL_FUNNET BIT(1),                                               00003500
      TT_EK       PIC'99';                                              00003510
   DCL                                                                  00003520
      KEY_BIT3                   BIT(32) BASED (KEY_PEKER3),            00003530
      KEY_BIT4                   BIT(32) BASED (KEY_PEKER4),            00003540
      KEY_PEKER3                 POINTER,                               00003550
      KEY_PEKER4                 POINTER,                               00003560
      ST_RECL                    CHAR (35);                             00003570
                                                                        00003580
      KEY_PEKER3      = ADDR(E3SP.STATSBORGER_EK);                      00003590
      KEY_PEKER4      = ADDR(E3SP.BOSATT_EK);                           00003600
                                                                        00003610
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND3);               00003620
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT3)       00003630
                                               INTO(ST_RECL);           00003640
              GOTO STAT_UT;                                             00003650
          NOTFND3:                                                      00003660
              FEIL_FUNNET           = '1'B;                             00003670
              E3SP.STATSBORGER_EKNR = 24;                               00003680
              GOTO STAT_UT;                                             00003690
          STAT_UT:                                                      00003700
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND4);               00003710
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT4)       00003720
                                               INTO(ST_RECL);           00003730
              GOTO BO_UT;                                               00003740
          NOTFND4:                                                      00003750
              FEIL_FUNNET      = '1'B;                                  00003760
              E3SP.BOSATT_EKNR = 25;                                    00003770
              GOTO BO_UT;                                               00003780
          BO_UT:                                                        00003790
  IF ^(E3SP.OVERKOMP_UTL_EK = 'J' ! E3SP.OVERKOMP_UTL_EK = ' ' !        00003800
       E3SP.OVERKOMP_UTL_EK = 'N')        THEN                          00003810
     DO;                                                                00003820
        FEIL_FUNNET            = '1';                                   00003830
        E3SP.OVERKOMP_UTL_EKNR = 35;                                    00003840
     END;                                                               00003850
  IF ^F_NUMERISK(F_FELT_PIC_CHAR2(E3SP.TT_FRA_1937_ÅR_EK)) THEN         00003860
     DO;                                                                00003870
        FEIL_FUNNET              = '1'B;                                00003880
        E3SP.TT_FRA_1937_ÅR_EKNR = 200;                                 00003890
     END;                                                               00003900
  IF ^F_NUMERISK(F_FELT_PIC_CHAR2(E3SP.TT_FRA_1937_MND_EK)) THEN        00003910
     DO;                                                                00003920
        FEIL_FUNNET               = '1'B;                               00003930
        E3SP.TT_FRA_1937_MND_EKNR = 200;                                00003940
     END;                                                               00003950
 IF E3SP.TT_NORDEN_ANNET_EK = 'N' THEN                                  00003960
    E3SP.TT_NORDEN_ANNET_EK = ' ';                                      00003970
 IF ^(E3SP.TT_NORDEN_ANNET_EK = ' ' !                                   00003980
                                E3SP.TT_NORDEN_ANNET_EK = 'J') THEN     00003990
          DO;                                                           00004000
             FEIL_FUNNET       = '1'B;                                  00004010
             E3SP.TT_NORDEN_ANNET_EKNR = 361;                           00004020
          END;                                                          00004030
                                                                        00004040
 %PAGE;        /*  */                                                   00004050
 /* ***************************************************************** */00004060
 /*              K R Y S S K O N T R O L L E R - AVDØDE               */00004070
 /* ***************************************************************** */00004080
                                                                        00004090
                                                                        00004100
 %PAGE;                                                                 00004110
 /* ***************************************************************** */00004120
 /* KRYSSKONTROLLER HVOR OPPL. OM BÅDE SØKER OG AVDØDE KAN INNGÅ..    */00004130
 /* ***************************************************************** */00004140
                                                                        00004150
  END KONTROLL_E3_SPES_EK;                                              00004160
