 /*       SIST ENDRET 16/02-98 13.06.26 AV   JDA7339                  */00000000
 /*       SIST ENDRET 16/02-98 13.03.21 AV   JDA7339                  */00000010
 /*       SIST ENDRET 28/01-98 15.14.02 AV   JDA7339                  */00000020
 /*       SIST ENDRET 28/01-98 15.12.10 AV   JDA7339                  */00000030
 /*       SIST ENDRET 24/09-97 15.04.29 AV   HLA7339                  */00000040
 /*       SIST ENDRET 24/09-97 15.03.58 AV   HLA7339                  */00000050
 /*       SIST ENDRET 28/07-97 12.34.24 AV   HLA7339                  */00000060
 /*       SIST ENDRET 17/02-93 16.32.54 AV   TRUDE                    */00000070
 /*       SIST ENDRET 08/02-93 09.22.08 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 11/01-93 14.57.52 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 26/10-92 13.49.20 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 09/07-92 08.36.53 AV   HERMAN                   */00000110
 /*       SIST ENDRET 07/07-92 14.44.58 AV   HERMAN                   */00000120
 /*       SIST ENDRET 12/06-92 13.51.40 AV   TRUDE                    */00000130
 /*       SIST ENDRET 17/02-92 13.46.16 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 03/11-89 13.07.04 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 13/09-89 14.46.38 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 14/04-89 13.37.58 AV   HERMAN                   */00000170
 /*       SIST ENDRET 31/03-87 08.54.51 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 08/02-84 12.50.50 AV   OLAV                     */00000190
 /*       SIST ENDRET 18/01-84 11.14.49 AV   OLAV                     */00000200
 /*       SIST ENDRET 05/05-83 13.51.00 AV   OLAV                     */00000210
 /*       SIST ENDRET 03/05-83 13.39.40 AV   OLAV                     */00000220
 /* *************************************************************** */  00000230
 /*IDENTIFIKASJON:                                                  */  00000240
 /*    R0014422 - SUBPROGRAM I PLI                                  */  00000250
 /*    PROGRAMMERER: EDB-ING. ROLF FARVIK,SFK,MARS -82.             */  00000260
 /*HENSIKT:                                                         */  00000270
 /*    BEREGNE TILLEGGSPENSJON FOR UFØRE.                           */  00000280
 /*    OPPDATERER UFØRPENS : SPT, OPT, PÅ  OG TP                    */  00000290
 /*PROGRAMTILKNYTNING:                                              */  00000300
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV UFØREPENSJON- */  00000310
 /*    SBEREGNINGEN.                                                */  00000320
 /*    INCLUDES I R0014401                                          */  00000330
 /*BRUK:                                                            */  00000340
 /*    CALL BEREGN_TP_UP;                                           */  00000350
 /*                                                                 */  00000360
 /*ENDRING:                                                         */  00000370
 /*    DET ER LAGT INN FJERNING AV POENGILLEGGSOPPLYSNINGER NÅR     */  00000380
 /*    IKKE GIS POENGTILLEGG LENGER           6/2 84   OLAV         */  00000390
 /* *************************************************************** */  00000400
 /*   */                                                                00000410
 BEREGN_TP_UP:                                                          00000420
   PROC;                                                                00000430
                                                                        00000440
    DCL W_STI_ÅM         PIC '(4)9';                                    00000450
    DCL W_STI_ÅR         PIC '(2)9' DEF W_STI_ÅM POS (1);               00000460
    DCL W_STI_MND        PIC '(2)9' DEF W_STI_ÅM POS (3);               00000470
    DCL   TJUE_ÅM        PIC '(4)9';                                    00000480
    DCL   TJUE_ÅR        PIC '(2)9' DEF   TJUE_ÅM POS (1);              00000490
    DCL   TJUE_MND       PIC '(2)9' DEF   TJUE_ÅM POS (3);              00000500
    DCL OPPTJENINGSPERIODE FIXED DEC (3) INIT (0);                      00000510
    DCL REDUKSJONSPERIODE  FIXED DEC (3) INIT (0);                      00000520
    DCL FAKTISK_TT         FIXED DEC (3) INIT (0);                      00000530
    DCL MINSTEVILK         FIXED DEC (5,2) INIT (0);                    00000540
    DCL ANTALL_POENGÅR     FIXED DEC (3);                               00000550
    DCL ANTALL_FLERE_PÅ    FIXED DEC (3);                               00000560
    DCL ANTALL_PÅ_FØR      FIXED DEC (3);                               00000570
    DCL SISTE_ÅR           FIXED DEC (3);                               00000580
    DCL START_ÅR           FIXED DEC (3);                               00000590
    DCL SLUTT_ÅR           FIXED DEC (3);                               00000600
                                                                        00000610
    DCL SISTE_UFIND      FIXED BIN(15);                                 00000620
                                                                        00000630
    DO SISTE_UFIND = 1 TO 7 WHILE             /*0697 HL*/               00000640
             (B02.OPPHØRSDATO_ÅM(BER_SØ_IND,SISTE_UFIND) > 0);          00000650
    END;                                                                00000660
                                                                        00000670
    B01_B02_IND           = 2;                                          00000680
    POTALL_OPPL.IND       = BER_SØ_IND;                                 00000690
    EXEC CICS LINK PROGRAM ('R0014141')  COMMAREA (KOM_OMR);            00000700
                                                                        00000710
    IF FEIL_MELD_NR > 0  THEN                                           00000720
       GO TO RETUR;                                                     00000730
    ELSE                                                                00000740
       PROGRAM_ID = 'R0014401';                                         00000750
                                                                        00000760
    IF B02.UFT_ÅM(BER_SØ_IND,SISTE_UFIND) < 9200     THEN               00000770
       POREKKE.PÅ_ETTER91(BER_SØ_IND) = 0;                              00000780
                                                                        00000790
 /* ***************************************************************** */00000800
 /*                                                                   */00000810
 /* ***************************************************************** */00000820
 /*   */                                                                00000830
    IF (B02.PENSJONSTYPE2(BER_SØ_IND) = 'S') THEN                       00000840
       DO;                                                              00000850
          B01_B02_IND = 2;                                              00000860
          POTALL_OPPL.IND = BER_EK_IND;                                 00000870
          EXEC CICS LINK PROGRAM ('R0014141')  COMMAREA (KOM_OMR);      00000880
                                                                        00000890
          IF FEIL_MELD_NR > 0  THEN                                     00000900
             GO TO RETUR;                                               00000910
          ELSE                                                          00000920
             PROGRAM_ID = 'R0014401';                                   00000930
                                                                        00000940
          IF POREKKE.SPT(BER_SØ_IND) > 0   &                            00000950
             POREKKE.SPT(BER_EK_IND) > 0        THEN                    00000960
                                                                        00000970
             CALL POENG_TILLEGG;                                        00000980
                                                                        00000990
          CALL BEREGN_SPT_OPT_PÅ(BER_SØ_IND,                            00001000
                       POREKKE(BER_SØ_IND),B02.FNR(BER_SØ_IND));        00001010
                                                                        00001020
          IF B02.UFT_ÅM(BER_SØ_IND,SISTE_UFIND) < 9200     THEN         00001030
             POREKKE.PÅ_ETTER91(BER_SØ_IND) = 0;                        00001040
       END;                                                             00001050
                                                                        00001060
    ELSE                                                                00001070
                                                                        00001080
       DO;                                                              00001090
                                                                        00001100
          B02.POENGTILLEGG_DATO_ÅM(BER_SØ_IND) = 0;                     00001110
          B02.POENGTILLEGG_KODE   (BER_SØ_IND) = ' ';     /*25.3.87*/   00001120
          B02.POENGTILLEGG_DATO_ÅM(BER_EK_IND) = 0;                     00001130
          B02.POENGTILLEGG_KODE   (BER_EK_IND) = ' ';     /* HL    */   00001140
       END;                                                             00001150
                                                                        00001160
    B02.UFØRPENS.TP (BER_SØ_IND) = F_TP92(FNR_R.ÅR,G,                   00001170
                                    POREKKE.SPT(BER_SØ_IND),            00001180
                                    POREKKE.OPT(BER_SØ_IND),            00001190
                                    POREKKE.PÅ(BER_SØ_IND),             00001200
                            POREKKE.PÅ_ETTER91(BER_SØ_IND),             00001210
                                    UFGRAD,                             00001220
                                    100,'J');                           00001230
                                                                        00001240
                                                                        00001250
    B02.UFØRPENS.SPT (BER_SØ_IND) = POREKKE.SPT(BER_SØ_IND);            00001260
    B02.UFØRPENS.OPT (BER_SØ_IND) = POREKKE.OPT(BER_SØ_IND);            00001270
    B02.UFØRPENS.PÅ  (BER_SØ_IND) = POREKKE.PÅ(BER_SØ_IND);             00001280
    B02.UFØRPENS.PÅ_ETTER91  (BER_SØ_IND) =                             00001290
                           POREKKE.PÅ_ETTER91(BER_SØ_IND);              00001300
 %PAGE;                                                                 00001310
    DCL PÅ_ETTER1  FIXED DEC (3) INIT (0);                              00001320
    DCL PÅ_ETTER2  FIXED DEC (3) INIT (0);                              00001330
    DCL SLUTTPOENG FIXED DEC (3,2) INIT (0);                            00001340
    PÅ_ETTER1      =       POREKKE.PÅ_ETTER91(BER_SØ_IND);              00001350
    PÅ_ETTER2      =  B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND);              00001360
    SLUTTPOENG     =  B02.UFØRPENS.SPT(BER_SØ_IND);                     00001370
                                                                        00001380
                                                                        00001390
    IF B02.BUP_GAR_KODE(BER_SØ_IND,1) = 'B'   THEN                      00001400
      DO;                                                               00001410
        IF B02.REDUSERT_ANT_BUP_ÅR(BER_SØ_IND,SISTE_UFIND) > 0 THEN     00001420
          DO;                                                           00001430
    /*FEIL NR 6 I - 9712 HL :                          */               00001440
    /*HER KAN ANTALL POENGÅR BLI ØKET                  */               00001450
             W_STI_ÅM = B02.UFØRPENS.STI(BER_SØ_IND);                   00001460
             TJUE_ÅR  = FNR_R.ÅR + 20;                                  00001470
             TJUE_MND = FNR_R.MND;                                      00001480
             IF W_STI_ÅM > 0       &                                    00001490
                W_STI_ÅM < TJUE_ÅM           THEN                       00001500
               DO;                                                      00001510
                  OPPTJENINGSPERIODE = ((W_STI_ÅR*12) + W_STI_MND       00001520
                     - 1) - (((FNR_R.ÅR + 16) * 12) +                   00001530
                               FNR_R.MND);                              00001540
                  MINSTEVILK = (OPPTJENINGSPERIODE * 4) / 5;            00001550
                 IF B02.TT_16_66(BER_SØ_IND) > 0 THEN                   00001560
                    FAKTISK_TT = B02.TT_16_66(BER_SØ_IND);              00001570
                 ELSE                                                   00001580
                    FAKTISK_TT =  B02.TT_FØR_1967(BER_SØ_IND) * 12      00001590
                                + B02.TT_ETTER_1966(BER_SØ_IND);        00001600
                                                                        00001610
                 IF MINSTEVILK   > FAKTISK_TT        THEN               00001620
                   DO;                                                  00001630
                      REDUKSJONSPERIODE =((TJUE_ÅR - W_STI_ÅR) *12      00001640
                         + TJUE_MND - W_STI_MND) *4 /5;                 00001650
                      ANTALL_POENGÅR =  (B02.TT_FRAMT(BER_SØ_IND)       00001660
                          - REDUKSJONSPERIODE + 6) /12;                 00001670
                      IF ANTALL_POENGÅR >                               00001680
                         B02.UFØRPENS.PÅ(BER_SØ_IND)      THEN          00001690
                        DO;                                             00001700
                          ANTALL_PÅ_FØR = B02.UFØRPENS.PÅ(BER_SØ_IND);  00001710
                          ANTALL_FLERE_PÅ = ANTALL_POENGÅR -            00001720
                                            ANTALL_PÅ_FØR;              00001730
                          POREKKE.PÅ_ETTER91(BER_SØ_IND) =              00001740
                             POREKKE.PÅ_ETTER91(BER_SØ_IND) +           00001750
                             ANTALL_FLERE_PÅ;                           00001760
                          B02.UFØRPENS.PÅ_ETTER91  (BER_SØ_IND) =       00001770
                             POREKKE.PÅ_ETTER91(BER_SØ_IND);            00001780
    /*SISTE_ÅR ER SISTE  ÅR SOM VAR OPPDATERT*/                         00001790
    /*START_ÅR ER FØRSTE ÅR SOM MÅ OPPDATERES*/                         00001800
    /*SLUTT_ÅR ER SISTE  ÅR SOM MÅ OPPDATERES*/                         00001810
                          SISTE_ÅR = TJUE_ÅR + ANTALL_PÅ_FØR - 1;       00001820
                          START_ÅR = SISTE_ÅR + 1;                      00001830
                          SLUTT_ÅR = SISTE_ÅR + ANTALL_FLERE_PÅ;        00001840
                          DO I = START_ÅR TO SLUTT_ÅR;                  00001850
                             POREKKE.POENG(BER_SØ_IND,I) =              00001860
                             POREKKE.POENG(BER_SØ_IND,SISTE_ÅR);        00001870
                             POREKKE.BUP_FPP(BER_SØ_IND,I) =            00001880
                             POREKKE.BUP_FPP(BER_SØ_IND,SISTE_ÅR);      00001890
                          END;                                          00001900
                        END;                                            00001910
                      B02.UFØRPENS.PÅ(BER_SØ_IND) = ANTALL_POENGÅR;     00001920
                      POREKKE.PÅ(BER_SØ_IND)      = ANTALL_POENGÅR;     00001930
                      POREKKE.BUP_FPP_ÅR(BER_SØ_IND) = ANTALL_POENGÅR;  00001940
                   END;                                                 00001950
                 END;                                                   00001960
                                                                        00001970
    /* ***HIT HL**************************************** */             00001980
          END;                                                          00001990
        ELSE                                                            00002000
           B02.UFØRPENS.PÅ(BER_SØ_IND) = 40;                            00002010
                                                                        00002020
        IF (B02.UFØRPENS.SPT(BER_SØ_IND) <                              00002030
                          B02.BUP_GARANTI(BER_SØ_IND,1)) THEN           00002040
       B02.UFØRPENS.SPT(BER_SØ_IND) = B02.BUP_GARANTI(BER_SØ_IND,1);    00002050
                                                                        00002060
          /*HER VAR OVERFØRT 0 I PÅ_ETTER91 FOR UNGE UFØRE*/            00002070
          /*TRUDE 200192  */                                            00002080
                                                                        00002090
          /*UFØRE FøR 1992 :  ENDRET 9709 HL          */                00002100
                                                                        00002110
        IF B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,1) < 9200     &               00002120
           B02.UFØRPENS.STI(BER_SØ_IND)      < 9200     &  /*9802 HL*/  00002130
             B02.UFØRPENS.SPT(BER_SØ_IND)   =                           00002140
             B02.UFØRHIST.BUP_GARANTI(BER_SØ_IND,1)    THEN             00002150
           DO;                                                          00002160
              POREKKE.PÅ_ETTER91(BER_SØ_IND) = 0;                       00002170
              B02.UFØRPENS.PÅ_ETTER91  (BER_SØ_IND) = 0;                00002180
           END;                                                         00002190
                                                                        00002200
          B02.UFØRPENS.TP (BER_SØ_IND) = F_TP92(FNR_R.ÅR,G,             00002210
                               B02.UFØRPENS.SPT(BER_SØ_IND),            00002220
                               B02.UFØRPENS.OPT(BER_SØ_IND),            00002230
                               B02.UFØRPENS.PÅ(BER_SØ_IND),             00002240
                               B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND),     00002250
                                    UFGRAD,                             00002260
                                    100,'J');                           00002270
                                                                        00002280
       END;                                                             00002290
                                                                        00002300
     RETUR:                                                             00002310
                                                                        00002320
   END BEREGN_TP_UP;                                                    00002330
