 /*       SIST ENDRET 08/10-82 14.04.08 AV   LUNDEBY                  */00000000
 /*       SIST ENDRET 23/08-82 09.58.09 AV   OLAV                     */00000010
 /* ***************************************************************** */00000020
 /* IDENTIFIKASJON:  R0017401                                         */00000030
 /* PROGRAMMERER:    HELEN,  JULI 1982 .                              */00000040
 /* HENSIKT:                                                          */00000050
 /*         PROGRAMMET UNDERSØKER PENSJONSTYPE TIL STØNADSBREV-       */00000060
 /*         MOTTAGER OG KALLER OPP RUTINEN SOM LEGGER INFORMASJON     */00000070
 /*         I HENDELSE_SEGMENTET I ST.BREV BASEN.                     */00000080
 /* PROGRAM-TILKNYTNING:                                              */00000090
 /*         INCLUDES I R0017001 (LAG_STØNADSBREV_TRANSER)             */00000100
 /*                                                                   */00000110
 /* ***************************************************************** */00000120
 LAG_SB_GRUNNLAG_IKKE_BARN:                                             00000130
     PROC (PERS_IND,EK_IND) ;                                           00000140
 DCL  PERS_IND         FIXED BIN (15);                                  00000150
 DCL  EK_IND           FIXED BIN (15);                                  00000160
 /* ***************************************************************** */00000170
 /* PROGRAMMET BEGYNNER HER.                                          */00000180
 /* ***************************************************************** */00000190
    SELECT (B02.PERSON.STATUS.PENSJONSTYPE1(PERS_IND));                 00000200
 /* ***************************************************************** */00000210
 /* PERSONEN ER ALDERSPENSJONIST.                                     */00000220
 /* ***************************************************************** */00000230
       WHEN   ('A')                                                     00000240
          DO;                                                           00000250
 /* ***************************************************************** */00000260
 /* PERSONEN HAR ETTERLATTE RETTIGHETER.                              */00000270
 /* ***************************************************************** */00000280
             IF B02.PERSON.PENSJONSTYPE2(PERS_IND) = 'E' &              00000290
                B02.PERSON.ETTEPENS.TP_BRUTTO(PERS_IND) > 0     THEN    00000300
                CALL LAG_ETTERL_ALDERSP_HEND(PERS_IND);                 00000310
             ELSE                                                       00000320
                CALL LAG_ALDERSP_HEND(PERS_IND,EK_IND);                 00000330
          END;                                                          00000340
 /* ***************************************************************** */00000350
 /* PERSONEN ER UFØREPENSJONIST.                                      */00000360
 /* ***************************************************************** */00000370
       WHEN   ('U')                                                     00000380
          DO;                                                           00000390
 /* ***************************************************************** */00000400
 /* PERSONEN HAR ETTERLATTE RETTIGHETER.                              */00000410
 /* ***************************************************************** */00000420
             IF B02.PERSON.PENSJONSTYPE2(PERS_IND) = 'E' &              00000430
                B02.PERSON.UFØRPENS.TP(PERS_IND) = 0   THEN             00000440
                CALL LAG_ETTERL_UFØRPENS_HEND(PERS_IND);                00000450
             ELSE                                                       00000460
                CALL LAG_UFØRPENS_HEND(PERS_IND,EK_IND);                00000470
          END;                                                          00000480
 /* ***************************************************************** */00000490
 /* PERSONEN ER ETTERLATT EKTEFELLE.                                  */00000500
 /* ***************************************************************** */00000510
       WHEN   ('E')                                                     00000520
           CALL LAG_ETTERLATT_HEND(PERS_IND);                           00000530
 /* ***************************************************************** */00000540
 /* PERSONEN ER ETTERLATT FAMILIE PERSON.(PENSJONSTYPE1 = 'J')        */00000550
 /* ***************************************************************** */00000560
       OTHERWISE                                                        00000570
           CALL LAG_ETTERL_FAM_HEND(PERS_IND);                          00000580
       END;                                                             00000590
 END LAG_SB_GRUNNLAG_IKKE_BARN;                                         00000600
