 /*       SIST ENDRET 28/07-98 12.50.45 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/07-98 12.27.21 AV   JDA7339                  */00000010
 /*       SIST ENDRET 25/02-98 13.46.02 AV   JDA7339                  */00000020
 /*       SIST ENDRET 25/02-98 13.39.14 AV   JDA7339                  */00000030
 /*       SIST ENDRET 30/01-98 14.51.38 AV   JDA7339                  */00000040
 /*       SIST ENDRET 30/01-98 14.22.19 AV   JDA7339                  */00000050
 /*       SIST ENDRET 16/12-97 12.41.20 AV   HLA7339                  */00000060
 /*       SIST ENDRET 16/12-97 12.39.37 AV   HLA7339                  */00000070
 /*       SIST ENDRET 05/12-97 12.29.30 AV   JDA7339                  */00000080
 /*       SIST ENDRET 27/11-97 10.59.25 AV   JDA7339                  */00000090
 /*       SIST ENDRET 22/07-97 12.21.21 AV   JDA7339                  */00000100
 /*       SIST ENDRET 11/02-97 13.44.31 AV   JDA7339                  */00000110
 /*       SIST ENDRET 27/09-96 14.30.09 AV   JDA0310                  */00000120
 /*       SIST ENDRET 21/03-94 15.01.25 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 02/01-92 13.53.26 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 26/04-91 11.46.13 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 16/10-89 12.43.29 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 09/05-89 14.34.45 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 06/04-89 11.54.44 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 17/03-89 15.01.43 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 14/12-88 13.20.39 AV   DYBVIK                   */00000200
 /* *************************************************************** */  00000210
 /*IDENTIFIKASJON:                                                  */  00000220
 /*    R0014252 - UNDERPROGRAM I PLI                                */  00000230
 /*    PROGRAMMERER:  TRUDE OKTOBER 1988.                           */  00000240
 /*HENSIKT:                                                         */  00000250
 /*    BEREGNER 100 % AVTALEFESTET FØRTIDSPENSJON                   */  00000260
 /*    OPPDATERER SPT, OPT, PÅ, TT.                                 */  00000270
 /*    OPPDATERER ST,KT,BT, ET, GP OG TP                            */  00000280
 /*    OPPDATERER PÅ_ETTER91                                        */  00000290
 /*                                                                 */  00000300
 /*PROGRAMTILKNYTNING:                                              */  00000310
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV AVTALE-       */  00000320
 /*    FESTET PENSJONSBERGENINGEN.                                  */  00000330
 /*    INCLUDES I R0014251                                          */  00000340
 /*BRUK:                                                            */  00000350
 /*    CALL BEREGN_AFP_DEL1;                                        */  00000360
 /*                                                                 */  00000370
 /* *************************************************************** */  00000380
                                                                        00000390
 %SKIP(2);                                                              00000400
 BEREGN_AFP_DEL1:                                                       00000410
   PROC;                                                                00000420
 %SKIP;                                                                 00000430
                                                                        00000440
 DCL ALDER_EK                     FIXED DEC(5) INIT (0);                00000450
 DCL SUM_TP                       FIXED DEC(5);                         00000460
 DCL TT_EGEN                      PIC '(3)9';                           00000470
 DCL TT_EK                        PIC '(3)9';                           00000480
 DCL W_DATO_MÅ                    PIC'9999';                            00000490
 DCL W_DATO_ÅM                    PIC'(4)9';                            00000500
 DCL W_ÅR  DEF W_DATO_ÅM POS(1)   PIC'99';                              00000510
 DCL W_MN  DEF W_DATO_ÅM POS(3)   PIC'99';                              00000520
 DCL W_FNR_EK                     PIC'(11)9';                           00000530
 DCL W_GP                         FIXED DEC (11,4) INIT (0);            00000540
 DCL W_TP                         FIXED DEC (7)   INIT (0);             00000550
 DCL W_TP_ALT                     FIXED DEC (7)   INIT (0);             00000560
 DCL W_VIRK_DATO_ÅM               PIC '(4)9';                           00000570
 DCL TEST_ETTER91                 FIXED DEC (3)   INIT (0);             00000580
                                                                        00000590
                                                                        00000600
 W_DATO_ÅM = B02.VIRK_DATO_ÅM(BER_SØ_IND);                              00000610
 W_DATO_MÅ = W_MN !! W_ÅR;                                              00000620
 W_FNR_EK  = B02.FNR(BER_EK_IND);                                       00000630
 ALDER_EK  = F_ALDER(W_FNR_EK,W_DATO_MÅ);                               00000640
                                                                        00000650
 /* ***************************************************************** */00000660
 /* TILLEGGSPENSJON                                                   */00000670
 /* ***************************************************************** */00000680
                                                                        00000690
    B01_B02_IND          = 2;                                           00000700
    POTALL_OPPL.IND      = BER_SØ_IND;                                  00000710
    EXEC CICS LINK PROGRAM ('R0014141')  COMMAREA (KOM_OMR);            00000720
                                                                        00000730
                                                                        00000740
    IF FEIL_MELD_NR > 0  THEN                                           00000750
       GO TO RETUR;                                                     00000760
    ELSE                                                                00000770
       PROGRAM_ID = 'R0014251';                                         00000780
                                                                        00000790
    B02.POENGTILLEGG_DATO_ÅM(BER_SØ_IND) =  0;                          00000800
    B02.POENGTILLEGG_KODE   (BER_SØ_IND) = ' ';                         00000810
    B02.POENGTILLEGG_DATO_ÅM(BER_EK_IND) =  0;                          00000820
    B02.POENGTILLEGG_KODE   (BER_EK_IND) = ' ';                         00000830
                                                                        00000840
 /*LOVENDRING FRA 1.1.92 : */                                           00000850
                                                                        00000860
    TEST_ETTER91 = POREKKE.PÅ_ETTER91(BER_SØ_IND);                      00000870
                                                                        00000880
    IF (B02.UTTAKSDATO_ÅM(BER_SØ_IND) > 9200)        &                  00000890
       (FNR_R.ÅR > 25)                           THEN                   00000900
       DO;  /*ENDRET 9807 HL : */                                       00000910
  /*      B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND) = FNR_R.ÅR + 66 - 91;*/    00000920
          B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND) =                          00000930
              POREKKE.PÅ_ETTER91(BER_SØ_IND);                           00000940
          B02.ALDERSP.TP(BER_SØ_IND)= F_TP92(FNR_R.ÅR,G,                00000950
                                    POREKKE.SPT(BER_SØ_IND),            00000960
                                    POREKKE.OPT(BER_SØ_IND),            00000970
                                    POREKKE.PÅ(BER_SØ_IND),             00000980
  /*                           B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND),*/    00000990
                                    POREKKE.PÅ_ETTER91(BER_SØ_IND),     00001000
                                    100,100,'J');                       00001010
                                                                        00001020
       END;                                                             00001030
    ELSE                                                                00001040
                                                                        00001050
    B02.ALDERSP.TP(BER_SØ_IND)= F_TILLEGGSPENSJON(FNR_R.ÅR,G,           00001060
                                    POREKKE.SPT(BER_SØ_IND),            00001070
                                    POREKKE.OPT(BER_SØ_IND),            00001080
                                    POREKKE.PÅ(BER_SØ_IND),             00001090
                                    100,100,'J');                       00001100
                                                                        00001110
    B02.ALDERSP.SPT (BER_SØ_IND) = POREKKE.SPT    (BER_SØ_IND);         00001120
    B02.ALDERSP.OPT (BER_SØ_IND) = POREKKE.OPT    (BER_SØ_IND);         00001130
    B02.ALDERSP.PÅ  (BER_SØ_IND) = POREKKE.PÅ     (BER_SØ_IND);         00001140
                                                                        00001150
                                                                        00001160
    IF FEIL_MELD_NR > 0  THEN                                           00001170
       GO TO RETUR;                                                     00001180
    ELSE                                                                00001190
       PROGRAM_ID = 'R0014251';                                         00001200
                                                                        00001210
 /* ***************************************************************** */00001220
 /*  GRUNNPENSJON .                                                   */00001230
 /* ***************************************************************** */00001240
                                                                        00001250
                                                                        00001260
    W_VIRK_DATO_ÅM = B02.VIRK_DATO_ÅM(BER_SØ_IND);                      00001270
                                                                        00001280
    IF B02.TT_16_66(BER_SØ_IND)  > 0  THEN                              00001290
       TT_EGEN  = (B02.TT_16_66(BER_SØ_IND) + 6) / 12;                  00001300
    ELSE                                                                00001310
       TT_EGEN = B02.STATUS.TT_FØR_1967 (BER_SØ_IND) +                  00001320
                 (B02.TT_ETTER_1966 (BER_SØ_IND)  +                     00001330
                  B02.STATUS.TT_FRAMT (BER_SØ_IND) + 11) / 12;          00001340
                                                                        00001350
    IF TT_EGEN > 39 !                                                   00001360
       B02.FRAVIK_FLYKTN(BER_SØ_IND) = 'J' THEN                         00001370
       B02.TT_ANV(BER_SØ_IND) = 40;                                     00001380
    ELSE                                                                00001390
       B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                                00001400
                                                                        00001410
                                                                        00001420
    IF B02.TT_ANV(BER_SØ_IND) < B02.ALDERSP.PÅ  (BER_SØ_IND) THEN       00001430
       B02.TT_ANV(BER_SØ_IND) = B02.ALDERSP.PÅ  (BER_SØ_IND);           00001440
                                                                        00001450
    IF B02.PENSJONSTYPE2 (BER_SØ_IND) = 'S'  !                          00001460
   /*ENDRET  980129 HL : */                                             00001470
        (B02.PENSJONSTYPE2 (BER_SØ_IND) = 'N'  &                        00001480
         B02.PENSJONSTYPE2 (BER_EK_IND) = 'P'  &                        00001490
         B02.SIVILSTAND    (BER_SØ_IND) ^= 'A' )     THEN               00001500
       DO;                                                              00001510
                                                                        00001520
 /*TILLEGG 18.9.89 HL - LOVENDRING 7.2 NR 2 B - 2. SETNING UTGÅR */     00001530
                                                                        00001540
          IF B01.PENSJONSTYPE2(BER_SØ_IND)    = 'S'    &                00001550
             B01.STATUS_KODE_HIST(BER_SØ_IND) = ' '    &                00001560
             B01.UFØRPENS.UFG    (BER_EK_IND) < 100    &                00001570
             B01.UFØRPENS.UFG    (BER_EK_IND) >   0    &                00001580
             B01.VIRK_DATO_ÅM    (BER_SØ_IND) < 9001  THEN              00001590
                                                                        00001600
             B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'J';            00001610
                                                                        00001620
          IF  (B02.PENSJONSTYPE1(BER_EK_IND) = 'U' !                    00001630
               B02.PENSJONSTYPE1(BER_EK_IND) = 'Y'  )    THEN           00001640
             DO;                                                        00001650
                                                                        00001660
                IF (B02.VIRK_DATO_ÅM    (BER_SØ_IND) < 9001 !           00001670
                   B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'J') THEN 00001680
                                                                        00001690
                   DO;                                                  00001700
                      W_GP= 1 - 0.25 * B02.UFØRPENS.UFG(BER_EK_IND)/100;00001710
                      B02.ALDERSP.GP(BER_SØ_IND) =  G * W_GP  *         00001720
                                            B02.TT_ANV(BER_SØ_IND)  /   00001730
                                                   (40 * 12) + 0.5;     00001740
                   END;                                                 00001750
                ELSE                                                    00001760
                   DO;                                                  00001770
                      B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'N';   00001780
                      B02.ALDERSP.GP(BER_SØ_IND) = (G * 0.75 *          00001790
                                          B02.TT_ANV(BER_SØ_IND)) /     00001800
                                          (40 * 12) + 0.5;              00001810
                   END;                                                 00001820
             END;                                                       00001830
 /*HIT 18.9.89 HL*/                                                     00001840
                                                                        00001850
          ELSE                                                          00001860
              B02.ALDERSP.GP(BER_SØ_IND) = (G * 0.75 *                  00001870
                                          B02.TT_ANV(BER_SØ_IND)) /     00001880
                                          (40 * 12) + 0.5;              00001890
       END;                                                             00001900
    ELSE  /*IKKE PT2 = S :  */                                          00001910
       DO;                                                              00001920
                                                                        00001930
          IF B02.TT_GARANTI(BER_SØ_IND) >                               00001940
             B02.TT_ANV(BER_SØ_IND)            THEN                     00001950
             B02.TT_ANV(BER_SØ_IND) = B02.TT_GARANTI(BER_SØ_IND);       00001960
          IF B02.PENSJONSTYPE1(BER_EK_IND) = 'K'   &                    00001970
             B02.SUM_YTELSE   (BER_EK_IND) > 0     & /*9802 HL*/        00001980
             B02.SIVILSTAND    (BER_SØ_IND) ^= 'A'  &                   00001990
             ALDER_EK < 6501              THEN                          00002000
            DO;                                                         00002010
             IF B02.ALDERSP.UTTAKSDATO_ÅM(BER_EK_IND) > 9709   THEN     00002020
                DO; /*REGLER FRA 1.10.97 */                             00002030
                    B02.ALDERSP.GP(BER_SØ_IND) = (G * 0.75 *            00002040
                                    B02.TT_ANV(BER_SØ_IND)) /           00002050
                                    (40 * 12) + 0.5;                    00002060
                    DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'K';     00002070
                END;                                                    00002080
             ELSE /*NÅ BLIR DET REGLER FØR 9710 : */                    00002090
                  /* SKAL PT3 FOR EKTEFELLE = K OGSÅ VÆR MED?*/         00002100
                                             /* TRUDE 020698  */        00002110
             IF (B02.PENSJONSTYPE3(BER_EK_IND) = 'S'   !                00002120
                 B02.PENSJONSTYPE3(BER_EK_IND) = 'K')   &               00002130
                (B02.PENSJONSTYPE3(BER_SØ_IND) = 'S'  !                 00002140
                 (B02.PENSJONSTYPE3(BER_SØ_IND) = 'K'  &                00002150
                  ALDER_ÅM > 6500))               THEN                  00002160
                DO;                                                     00002170
                    B02.ALDERSP.GP(BER_SØ_IND) = (G * 0.75 *            00002180
                                    B02.TT_ANV(BER_SØ_IND)) /           00002190
                                    (40 * 12) + 0.5;                    00002200
                    DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'K';     00002210
                END;                                                    00002220
            END;                                                        00002230
          ELSE                                                          00002240
          IF B02.PENSJON_FØR_9802(BER_SØ_IND) ^= 'J'    THEN            00002250
                                                                        00002260
            DO;                                                         00002270
              IF (B02.SIVILSTAND(BER_SØ_IND) = 'G'  !                   00002280
                  B02.SIVILSTAND(BER_SØ_IND) = 'P'  !                   00002290
                  B02.SIVILSTAND(BER_SØ_IND) = 'W'  !                   00002300
                  B02.SIVILSTAND(BER_SØ_IND) = 'V'   )      &           00002310
                                                                        00002320
                  B02.EK_INNT_OVER_2G(BER_SØ_IND) = 'J' THEN            00002330
                 DO;                                                    00002340
                                                                        00002350
                    B02.ALDERSP.GP(BER_SØ_IND) = (G * 0.75 *            00002360
                                          B02.TT_ANV(BER_SØ_IND)) /     00002370
                                          (40 * 12) + 0.5;              00002380
                    DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'J';     00002390
                 END;                                                   00002400
              ELSE                                                      00002410
              IF  B02.SIVILSTAND(BER_SØ_IND) = 'V'   &                  00002420
                 (B02.PENSJONSTYPE2(BER_EK_IND) = 'P'  !                00002430
                  B02.PENSJONSTYPE2(BER_EK_IND) = 'S'  )   THEN         00002440
                 DO;                                                    00002450
                    B02.ALDERSP.GP(BER_SØ_IND) = (G * 0.75 *            00002460
                                          B02.TT_ANV(BER_SØ_IND)) /     00002470
                                          (40 * 12) + 0.5;              00002480
                    DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'V';     00002490
                 END;                                                   00002500
              ELSE                                                      00002510
                 B02.ALDERSP.GP(BER_SØ_IND) = (G * B02.TT_ANV(          00002520
                                       BER_SØ_IND)) /                   00002530
                                       (40 * 12) + 0.5;                 00002540
            END;                                                        00002550
          ELSE                                                          00002560
             B02.ALDERSP.GP(BER_SØ_IND) = (G * B02.TT_ANV(              00002570
                                       BER_SØ_IND)) /                   00002580
                                       (40 * 12) + 0.5;                 00002590
       END;                                                             00002600
 /* */                                                                  00002610
    SUM_TP = B02.ALDERSP.TP(BER_SØ_IND) + B02.TP_BRUTTO(BER_SØ_IND);    00002620
                                                                        00002630
 /* ***************************************************************** */00002640
 /* KALL FUNKSJON SOM BEREGNER SÆRTILLEGG.     4133                   */00002650
 /* ***************************************************************** */00002660
                                                                        00002670
 %SKIP;                                                                 00002680
    IF (B02.PENSJONSTYPE2 (BER_SØ_IND) = 'S') !                         00002690
       (B02.PENSJONSTYPE2 (BER_SØ_IND) = 'N' &                          00002700
        B02.PENSJONSTYPE2 (BER_EK_IND) = 'P' &                          00002710
        B02.SIVILSTAND    (BER_EK_IND) = 'G') THEN                      00002720
                                                                        00002730
       DO;                                                              00002740
          B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(             00002750
                                         SUM_TP,0,'JA',                 00002760
                                         ST_PROSENT_SAMST,              00002770
                                         100,                           00002780
                                         B02.TT_ANV(BER_SØ_IND));       00002790
          B02.ALDERSP.ET(BER_SØ_IND)   = 0;                             00002800
       END;                                                             00002810
    ELSE                                                                00002820
                                                                        00002830
    IF B02.PENSJONSTYPE2 (BER_SØ_IND) = 'F' THEN                        00002840
       DO;                                                              00002850
                                                                        00002860
  /*LOVENDRING OM BEHOVSPRØVET FORSØRGINGSTILLEGG FRA 1.5.91 :*/        00002870
  /* SÅ SNART DET SKAL BEREGNES MED HØYERE GRUNNBELØP ENN     */        00002880
  /* PR 30.4.91, SÅ SKAL ALL BEREGNING SKJE I R0014011        */        00002890
                                                                        00002900
          IF G > 34100 THEN                                             00002910
             DO;                                                        00002920
                B02.ALDERSP.ET(BER_SØ_IND)   = 0;                       00002930
                IF B02.FT_SKAL_BEREGNES(BER_SØ_IND) = ' '     THEN      00002940
                   B02.FT_SKAL_BEREGNES(BER_SØ_IND) = 'N';              00002950
             END;                                                       00002960
          ELSE                                                          00002970
             B02.ALDERSP.ET(BER_SØ_IND)   = 0.5 * G *                   00002980
                      B02.TT_ANV (BER_SØ_IND)                           00002990
                      /   (12 * 40) + 0.5;                              00003000
                                                                        00003010
                                                                        00003020
 /*HL*/    IF (ALDER_EK        >= 6000    &                             00003030
               W_DATO_ÅM       >  8903    &                             00003040
               W_DATO_ÅM       <  9100)        !                        00003050
              (ALDER_EK        >  6000    &                             00003060
               W_DATO_ÅM       >  9100)      THEN                       00003070
                                                                        00003080
              B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(         00003090
                                         SUM_TP,0,'JA',                 00003100
                                        (ST_PROSENT_SAMST * 2),         00003110
                                         100,                           00003120
                                         B02.TT_ANV(BER_SØ_IND));       00003130
                                                                        00003140
           ELSE                                                         00003150
                                                                        00003160
              B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(         00003170
                                         SUM_TP,0,'JA',                 00003180
                                         ST_PROSENT_ENSLIG,             00003190
                                         100,                           00003200
                                         B02.TT_ANV(BER_SØ_IND));       00003210
                                                                        00003220
           /* TILLEGGSTEST 21.03.94. REGELENDR. 0194 BLE TUDLIGERE*/    00003230
           /* TAKLET I R0014010, MEN BLIR FEIL VED 'TAK' OG 'FAI' */    00003240
           /* TRUDE                                               */    00003250
                                                                        00003260
           IF  ALDER_EK        >= 6001    &                             00003270
               W_DATO_ÅM       >  9312    THEN                          00003280
               B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(        00003290
                                            SUM_TP,0,'JA',              00003300
                                            (ST_PROSENT_ENSLIG * 2),    00003310
                                            100,                        00003320
                                            B02.TT_ANV(BER_SØ_IND));    00003330
                                                                        00003340
       END;                                                             00003350
                                                                        00003360
    ELSE                                                                00003370
                                                                        00003380
       DO;                                                              00003390
                                                                        00003400
          B02.ALDERSP.ET(BER_SØ_IND)   = 0;                             00003410
                                                                        00003420
          B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(             00003430
                                         SUM_TP,0,'JA',                 00003440
                                         ST_PROSENT_ENSLIG,             00003450
                                         100,                           00003460
                                         B02.TT_ANV(BER_SØ_IND));       00003470
                                                                        00003480
       END;                                                             00003490
                                                                        00003500
 /* ***************************************************************** */00003510
 /* KALL FUNKSJON SOM BEREGNER KOMPENSASJONSTILLEGG.  4134            */00003520
 /* ***************************************************************** */00003530
                                                                        00003540
 %SKIP;                                                                 00003550
    IF (B02.PENSJONSTYPE2 (BER_SØ_IND) = 'S') !                         00003560
       (B02.PENSJONSTYPE2 (BER_SØ_IND) = 'N' &                          00003570
        B02.PENSJONSTYPE2 (BER_EK_IND) = 'P' &                          00003580
        B02.SIVILSTAND    (BER_EK_IND) = 'G') THEN                      00003590
                                                                        00003600
        B02.ALDERSP.KT(BER_SØ_IND) = F_BEREGN_KOMPENSASJONSTILLEGG(     00003610
                                     B02.PENSJONSTYPE1(BER_SØ_IND),     00003620
                                     'S',                               00003630
                                     B02.TT_ANV(BER_SØ_IND),0,1,'J');   00003640
    ELSE                                                                00003650
                                                                        00003660
        B02.ALDERSP.KT(BER_SØ_IND) = F_BEREGN_KOMPENSASJONSTILLEGG(     00003670
                                     B02.PENSJONSTYPE1(BER_SØ_IND),     00003680
                                     B02.PENSJONSTYPE2(BER_SØ_IND),     00003690
                                     B02.TT_ANV(BER_SØ_IND),0,1,'J');   00003700
                                                                        00003710
 /* ***************************************************************** */00003720
 /* DEN PÅFØLGENDE TESTEN SKAL UNNGÅ Å GI UTENLANDSBOENDE KOMP.       */00003730
 /* ERIK 22.12.86.                                                    */00003740
 /* ***************************************************************** */00003750
                                                                        00003760
    IF B02.SPESOPPL.BOSATT(BER_SØ_IND) > 0 THEN                         00003770
       B02.ALDERSP.KT(BER_SØ_IND) = 0 ;                                 00003780
                                                                        00003790
     /* DETTE  FOR Å FÅ MED ET FOR AFP-NULL.TRUDE0996*/                 00003800
     IF B02.PENSJONSTYPE1(BER_EK_IND)  = 'F' &                          00003810
        B02.PENSJONSTYPE2(BER_SØ_IND)  = 'N' THEN                       00003820
       DO;                                                              00003830
          B02.PENSJONSTYPE2(3)    = B02.PENSJONSTYPE2(SØKER_IND);       00003840
          B02.PENSJONSTYPE2(SØKER_IND)     =  'F';                      00003850
          B02.PENSJONSTYPE2(EKTEF_IND)      =  ' ';                     00003860
          B02.FT_SKAL_BEREGNES(BER_SØ_IND)  = 'J';                      00003870
       END;                                                             00003880
                                                                        00003890
    RETUR:                                                              00003900
                                                                        00003910
                                                                        00003920
   END BEREGN_AFP_DEL1;                                                 00003930
