 /*       SIST ENDRET 13/03-98 13.35.47 AV   JDA7339                  */00000000
 /*       SIST ENDRET 13/03-98 13.20.37 AV   JDA7339                  */00000010
 /*       SIST ENDRET 05/07-90 09.44.37 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 01/12-89 08.56.02 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 22/07-86 11.37.58 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 30/05-86 14.42.03 AV   FARVIK                   */00000050
 /*       SIST ENDRET 11/01-85 13.44.01 AV   KARIN                    */00000060
 /*       SIST ENDRET 11/04-84 08.05.26 AV   FARVIK                   */00000070
 /*       SIST ENDRET 14/02-84 07.49.04 AV   FARVIK                   */00000080
 /******************************************************************* */00000090
 /*  IDENTIFIKASJON:                                                  */00000100
 /****************************                                        */00000110
 /*  PROGRAMIDENT : R0010820-KONTROLL EPTRANS MOT STATUS FOR FAMILIEN */00000120
 /*  PROGRAMSPRÅK : PLI/CICS                                          */00000130
 /*  PROGRAMMERER : HELEN SHAW                                        */00000140
 /*  PROGRAMMET BLE LAGET I JANUAR 1982                               */00000150
 /*  ****************************                                     */00000160
 /*  HENSIKT:                                                         */00000170
 /*      KONTROLLER EPTRANS MOT STATUS FOR FAMILIEN                   */00000180
 /*  PROGRAMTILKNYTNING:                                              */00000190
 /*      KALLES OPP AV PROGRAM R0013520                               */00000200
 /*  BRUK:                                                            */00000210
 /*      EXEC CICS XCTL PROGRAM ('R0010820') COMMAREA (KOM_OMR)       */00000220
 /*                                                                   */00000230
 /*  *****************************                                    */00000240
 /*  ENDRING                                                          */00000250
 /* ***************************************************************** */00000260
                                                                        00000270
  KON_EP:                                                               00000280
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000290
                                                                        00000300
 /* ***************************************************************** */00000310
 /* KOMM_OMR                                                          */00000320
 /* ***************************************************************** */00000330
                                                                        00000340
 %INCLUDE P0019908 ;                                                    00000350
                                                                        00000360
 /* ***************************************************************** */00000370
 /* MENY_OMR                                                          */00000380
 /* ***************************************************************** */00000390
                                                                        00000400
 %INCLUDE P0019906;                                                     00000410
                                                                        00000420
 /* ***************************************************************** */00000430
 /* TRANS_OMR                                                         */00000440
 /* ***************************************************************** */00000450
                                                                        00000460
 %INCLUDE P0010801;                                                     00000470
 %INCLUDE P0019910;                                                     00000480
 %INCLUDE P0019912;                                                     00000490
                                                                        00000500
 DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                         00000510
 DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                         00000520
 DCL COMMAREA_PEKER PTR;                                                00000530
 %PAGE;                                                                 00000540
 DCL   AVDØD_IND           FIXED BIN (15),                              00000550
       I                   FIXED BIN (15),                              00000560
       TILKNYTTET_SW       CHAR(1),                                     00000570
       STATUS_TYPE_SØKER   CHAR(1);                                     00000580
   DCL                                                                  00000590
       W_DØDSTP_ÅM                                    FIXED(5);         00000600
   DCL                                                                  00000610
       W_DØDSTP_ÅMD                                   PIC '999999',     00000620
       W_DØDSTP_ÅR     DEF W_DØDSTP_ÅMD      POS (1)  PIC '99',         00000630
 /*YS*/W_DØDSTP_MND    DEF W_DØDSTP_ÅMD      POS (3)  PIC '99',         00000640
 /*YS*/W_DØDSDATO_ÅM   DEF W_DØDSTP_ÅMD      POS (1)  PIC '9999';       00000650
   DCL                                                                  00000660
       W_VIRKDATO_ÅM                                  PIC '9999',       00000670
       W_VIRKDATO_ÅR   DEF W_VIRKDATO_ÅM     POS (1)  PIC '99',         00000680
       W_VIRKDATO_MND  DEF W_VIRKDATO_ÅM     POS (3)  PIC '99';         00000690
   DCL                                                                  00000700
       W_ALDER_ÅM                                 PIC '9999';           00000710
                                                                        00000720
                                                                        00000730
 /* ***************************************************************** */00000740
 /* HER BEGYNNER PROGRAMMET KON_EP                                    */00000750
 /* ENDRET 11/1-85 AV KARIN : SAVING AV SØKERS STATUS_TYPE            */00000760
 /* ***************************************************************** */00000770
                                                                        00000780
 PROGRAM_ID      = 'R0010820';                                          00000790
 I               = 0;                                                   00000800
 TRANSTYPE       = ' 3';                                                00000810
 STATUS_TYPE_SØKER = STATUS_TYPE;                                       00000820
                                                                        00000830
 /* ***************************************************************** */00000840
 /* AVDØD EKTEFELLES INDEX FINNES.                                    */00000850
 /* ***************************************************************** */00000860
                                                                        00000870
  IF SØKER_IND = 1 THEN                                                 00000880
     AVDØD_IND = 2;                                                     00000890
  ELSE                                                                  00000900
     AVDØD_IND = 1;                                                     00000910
                                                                        00000920
 /*AFP:SØKER ER AFP-PENSJONIST. FOR Å FÅ EP, MÅ VI HA          */       00000930
 /*    OPPHØRSBLANKETT FØRST.BLANKETT AVVISES.TRUDE 080289     */       00000940
 /*AFP*/                                                                00000950
 /*AFP*/ IF B01.PENSJONSTYPE1(SØKER_IND)  = 'K'  THEN                   00000960
 /*AFP*/    DO;                                                         00000970
 /*AFP*/       FEIL_MELD_NR  = 1735;                                    00000980
 /*AFP*/       GO TO L999;                                              00000990
 /*AFP*/    END;                                                        00001000
                                                                        00001010
 /* ***************************************************************** */00001020
 /* AVDØDE ER OPPGITT PÅ BLANKETTEN - FNR ULIK 11111111111            */00001030
 /* ***************************************************************** */00001040
                                                                        00001050
 IF EPS.FNR_EK ^= (11)'1' THEN                                          00001060
    DO;                                                                 00001070
                                                                        00001080
 /* ***************************************************************** */00001090
 /* DERSOM AVDØD IKKE ER LEST INN I B01.                              */00001100
 /* ***************************************************************** */00001110
       IF B01.FNR(AVDØD_IND) = 0 THEN                                   00001120
          DO;                                                           00001130
             DØD = '1'B;                                                00001140
             SEARCH_FNR  = EPS.FNR_EK;                                  00001150
             POS_I_B01   = AVDØD_IND;                                   00001160
             EXEC CICS LINK PROGRAM ('R0019928') COMMAREA (KOM_OMR);    00001170
             IF FEIL_MELD_NR > 0 THEN                                   00001180
                GO   TO L999;                                           00001190
             ELSE                                                       00001200
                PROGRAM_ID = 'R0010820';                                00001210
             DØD = '0'B;                                                00001220
                                                                        00001230
 /* ***************************************************************** */00001240
 /* KONTROLLERER OM AVDØD ER KJENT OG ER DØD I BASEN.                 */00001250
 /* ***************************************************************** */00001260
                                                                        00001270
             IF B01.FNR(AVDØD_IND) = 0 !                                00001280
                (B01.FNR(AVDØD_IND) > 0 &                               00001290
                B01.DØDSDATO_ÅMD(AVDØD_IND) = 0) THEN                   00001300
                DO;                                                     00001310
  L100:                                                                 00001320
                   FEIL_VED_LABEL = '100';                              00001330
                   FEIL_MELD_NR   = 1710;                               00001340
                   GO TO L999;                                          00001350
                END;                                                    00001360
             ELSE                                                       00001370
                                                                        00001380
 /* ***************************************************************** */00001390
 /*  EKTEFELLEN ER DØD OG SØKEREN HAR IKKE PENSJONSSTATUS.            */00001400
 /* ***************************************************************** */00001410
                                                                        00001420
                IF B01.PENSJONSTYPE1 (SØKER_IND) = ' ' !                00001430
                   B01.STATUS_KODE_HIST (SØKER_IND) ^= ' ' THEN         00001440
                                                                        00001450
 /* ***************************************************************** */00001460
 /*  SØKEREN ER I BASEN MED INNTEKTER OG HISTORIKK.                   */00001470
 /* ***************************************************************** */00001480
                                                                        00001490
                   DO;                                                  00001500
                      B02.TKNR  (SØKER_IND) =  EPS.TKNR;                00001510
                      B02.NAVN  (SØKER_IND) =  EPS.NAVN;                00001520
                      B02.SPRÅK (SØKER_IND) =  EPS.SPRÅK;               00001530
                      IF B01.FNR(SØKER_IND) > 0 THEN                    00001540
                         CALL                                           00001550
                         FLYTT_B01_TIL_B02(SØKER_IND);                  00001560
                      ELSE                                              00001570
                                                                        00001580
 /* ***************************************************************** */00001590
 /*  SØKEREN ER IKKE I BASEN.                                         */00001600
 /*  ENDRING 11/1-85 AV KARIN: RUTINEN OPPRETT_STATUS_EP_SØKER        */00001610
 /* ***************************************************************** */00001620
                                                                        00001630
                         B02.FNR   (SØKER_IND) =  EPS.FNR;              00001640
                      B02.PERSON(AVDØD_IND) = B01.PERSON(AVDØD_IND);    00001650
                      CALL                                              00001660
                         OPPRETT_STATUS_EP_SØKER; /* R0010821 */        00001670
 /*YS*/                  IF FEIL_MELD_NR > 0  THEN                      00001680
 /*YS*/                     GO TO L999;                                 00001690
                                                                        00001700
                      CALL                                              00001710
                         KOBLE_TO_PERSONER(SØKER_IND,AVDØD_IND);        00001720
                   END;                                                 00001730
                ELSE                                                    00001740
                   DO;                                                  00001750
                                                                        00001760
 /* ***************************************************************** */00001770
 /*  SØKEREN HAR PENSJONSSTATUS.                                      */00001780
 /* ***************************************************************** */00001790
                                                                        00001800
                      IF B01.TKNR(SØKER_IND) > 0  THEN                  00001810
                         IF B01.TKNR(SØKER_IND) ^= EPS.TKNR THEN        00001820
                            DO;                                         00001830
  L110:                                                                 00001840
                               FEIL_VED_LABEL = '110';                  00001850
                               FEIL_MELD_NR   = 1702;                   00001860
                               GO TO L999;                              00001870
                            END;                                        00001880
                      SELECT (B01.STATUS.SIVILSTAND(SØKER_IND));        00001890
                                                                        00001900
 /* ***************************************************************** */00001910
 /*  SØKEREN ER UGIFT.                                                */00001920
 /*  SIVILSTAND 'U' På BLANKETTEN ER TILLATT VED YRKESSKADE.    *//*YS*/00001930
 /*  SØKEREN HAR DA VÆRT SAMBOER MED AVDØDE.                    *//*YS*/00001940
 /* ***************************************************************** */00001950
                                                                        00001960
                         WHEN('U')                                      00001970
                            DO;                                         00001980
 /*YS*/                        IF EPS.SIVILSTAND ^= 'U' THEN            00001990
 /*YS*/                           DO;                                   00002000
  L120:                                                                 00002010
                                     FEIL_VED_LABEL = '120';            00002020
                                     FEIL_MELD_NR = 1407;               00002030
                                     GO TO L999;                        00002040
 /*YS*/                           END;                                  00002050
 /*YS*/                        ELSE                                     00002060
 /*YS*/                           DO;                                   00002070
 /*YS*/                              CALL                               00002080
 /*YS*/                              FLYTT_B01_TIL_B02(SØKER_IND);      00002090
 /*YS*/                              B02.PERSON(AVDØD_IND) =            00002100
 /*YS*/                                    B01.PERSON(AVDØD_IND);       00002110
 /*YS*/                              CALL                               00002120
 /*YS*/                              AJOURFØR_B02_MED_EP_TRANS;         00002130
 /*YS*/                              IF FEIL_MELD_NR > 0   THEN         00002140
 /*YS*/                                 GO TO L999;                     00002150
 /*YS*/                              CALL                               00002160
 /*YS*/                              KOBLE_TO_PERSONER                  00002170
 /*YS*/                              (SØKER_IND,AVDØD_IND);             00002180
 /*YS*/                           END;                                  00002190
                            END;                                        00002200
                                                                        00002210
 /* ***************************************************************** */00002220
 /*  SØKEREN ER SKILT.                                                */00002230
 /* ***************************************************************** */00002240
                                                                        00002250
                        WHEN('S')                                       00002260
                           DO;                                          00002270
                              IF EPS.SIVILSTAND ='E' THEN               00002280
                                 DO;                                    00002290
  L130:                                                                 00002300
                                    FEIL_VED_LABEL = '130';             00002310
                                    FEIL_MELD_NR   = 1409;              00002320
                                    GO TO L999;                         00002330
                                 END;                                   00002340
                              ELSE                                      00002350
                                 DO;                                    00002360
                                    CALL                                00002370
                                    FLYTT_B01_TIL_B02(SØKER_IND);       00002380
                                    B02.PERSON(AVDØD_IND) =             00002390
                                          B01.PERSON(AVDØD_IND);        00002400
                                    CALL                                00002410
                                    AJOURFØR_B02_MED_EP_TRANS;          00002420
 /*YS*/                             IF FEIL_MELD_NR > 0  THEN           00002430
 /*YS*/                                GO TO L999;                      00002440
                                    CALL                                00002450
                                    KOBLE_TO_PERSONER                   00002460
                                    (SØKER_IND,AVDØD_IND);              00002470
                                 END;                                   00002480
                           END;                                         00002490
                                                                        00002500
 /* ***************************************************************** */00002510
 /*  SØKEREN MÅ VÆRE ETTERLATT                                        */00002520
 /* ***************************************************************** */00002530
                                                                        00002540
                        WHEN('E')                                       00002550
                           DO;                                          00002560
                              IF EPS.SIVILSTAND ='S' THEN               00002570
                                 DO;                                    00002580
      L140:                                                             00002590
                                    FEIL_VED_LABEL = '140';             00002600
                                    FEIL_MELD_NR   = 1410;              00002610
                                    GO TO L999;                         00002620
                                 END;                                   00002630
                              ELSE                                      00002640
                                 DO;                                    00002650
                                    CALL                                00002660
                                    FLYTT_B01_TIL_B02(SØKER_IND);       00002670
                                    B02.PERSON(AVDØD_IND) =             00002680
                                              B01.PERSON(AVDØD_IND);    00002690
                                    CALL                                00002700
                                     AJOURFØR_B02_MED_EP_TRANS;         00002710
 /*YS*/                              IF FEIL_MELD_NR > 0  THEN          00002720
 /*YS*/                                 GO TO L999;                     00002730
                                    CALL                                00002740
                                     KOBLE_TO_PERSONER                  00002750
                                           (SØKER_IND,AVDØD_IND);       00002760
                                 END;                                   00002770
                           END;                                         00002780
                        OTHERWISE                                       00002790
                           DO;                                          00002800
  L145:                                                                 00002810
                              FEIL_VED_LABEL = '145';                   00002820
                              FEIL_MELD_NR   = 1412;                    00002830
                              GO TO L999;                               00002840
                           END;                                         00002850
                      END; /* END SELECT */                             00002860
                   END;    /* END SØKER HAR PENSJONSSTATUS */           00002870
          END;             /* END AVDØD IKKE I B01 */                   00002880
       ELSE                                                             00002890
                                                                        00002900
 /* ***************************************************************** */00002910
 /*  AVDØD ER I B01-D.V.S KNYTTET TIL SØKEREN I BASEN.                */00002920
 /*  SØKER OG AVDØDE BEHØVER IKKE Å VÆRE TILKNYTTET HVERANDRE,        */00002930
 /*  HVIS SØKER FYLLER 67/70 ÅR MELLOM TRANSDATO OG DAGENS-DATO KAN   */00002940
 /*  BEGGE LIGGE I B01 UTEN Å VÆRE TILKNYTTET                         */00002950
 /* ***************************************************************** */00002960
                                                                        00002970
          DO;                                                           00002980
             IF B01.TKNR(SØKER_IND) > 0 THEN                            00002990
                IF B01.TKNR(SØKER_IND) ^= EPS.TKNR THEN                 00003000
                   DO;                                                  00003010
  L150:                                                                 00003020
                      FEIL_VED_LABEL = '150';                           00003030
                      FEIL_MELD_NR   = 1702;                            00003040
                      GO TO L999;                                       00003050
                   END;                                                 00003060
                SELECT (B01.STATUS.SIVILSTAND(SØKER_IND));              00003070
                                                                        00003080
 /* ***************************************************************** */00003090
 /*  SØKEREN ER GIFT.                                                 */00003100
 /* ***************************************************************** */00003110
                                                                        00003120
                   WHEN('G','A')                                        00003130
                                                                        00003140
 /* ***************************************************************** */00003150
 /*  EKTEFELLEN ER IKKE REGISTRERT SOM DØD I BASEN.                   */00003160
 /* ***************************************************************** */00003170
                                                                        00003180
                      DO;                                               00003190
                        IF B01.FNR(AVDØD_IND) = EPS.FNR_EK THEN         00003200
                           DO;                                          00003210
  L160:                                                                 00003220
                              FEIL_VED_LABEL = '160';                   00003230
                              FEIL_MELD_NR   = 1710;                    00003240
                              GO TO L999;                               00003250
                           END;                                         00003260
                        ELSE                                            00003270
                                                                        00003280
 /* ***************************************************************** */00003290
 /*  SØKEREN ER GIFT MED EN ANNEN.                                    */00003300
 /* ***************************************************************** */00003310
                                                                        00003320
                           DO;                                          00003330
  L170:                                                                 00003340
                              FEIL_VED_LABEL = '170';                   00003350
                              FEIL_MELD_NR   = 1408;                    00003360
                              GO TO L999;                               00003370
                           END;                                         00003380
                      END;                                              00003390
                                                                        00003400
 /* ***************************************************************** */00003410
 /*  SØKEREN ER ETTERLATT MED/UTEN TILKNYTTING TIL AVDØDE             */00003420
 /* ***************************************************************** */00003430
                                                                        00003440
                   OTHERWISE                                            00003450
                      DO;                                               00003460
                        IF B01.FNR(AVDØD_IND) = EPS.FNR_EK THEN         00003470
                                                                        00003480
 /* ***************************************************************** */00003490
 /*  DET ER DEN SAMME AVDØD.                                          */00003500
 /* ***************************************************************** */00003510
                                                                        00003520
                           DO;                                          00003530
                              IF EPS.SIVILSTAND ^=                      00003540
                                  B01.STATUS.SIVILSTAND(SØKER_IND) THEN 00003550
                                 DO;                                    00003560
  L180:                                                                 00003570
                                    FEIL_VED_LABEL = '180';             00003580
                                    FEIL_MELD_NR   = 1410;              00003590
                                    GO TO L999;                         00003600
                                 END;                                   00003610
                              ELSE                                      00003620
                                 DO;                                    00003630
                                    CALL                                00003640
                                      FLYTT_B01_TIL_B02(SØKER_IND);     00003650
                                    B02.PERSON(AVDØD_IND) =             00003660
                                            B01.PERSON(AVDØD_IND);      00003670
                                    CALL                                00003680
                                     AJOURFØR_B02_MED_EP_TRANS;         00003690
 /*YS*/                             IF FEIL_MELD_NR > 0  THEN           00003700
 /*YS*/                                GO TO L999;                      00003710
                                 /* ENDRET AV KARIN 19/1-84      */     00003720
                                 /* TESTE OM TILKNYTTING MANGLER */     00003730
                                    TILKNYTTET_SW = 'N';                00003740
                                    DO I = 1 TO 13 WHILE                00003750
                                     (B01.FNR_TILKN(AVDØD_IND,I) > 0);  00003760
                                     IF B01.FNR_TILKN(AVDØD_IND,I) =    00003770
                                       B01.FNR(SØKER_IND) THEN          00003780
                                       TILKNYTTET_SW = 'J';             00003790
                                    END;                                00003800
                                    IF TILKNYTTET_SW = 'N' THEN         00003810
                                      CALL KOBLE_TO_PERSONER            00003820
                                          (SØKER_IND,AVDØD_IND);        00003830
                                 /* ENDRINGEN SLUTTER HER, KS 19/1-84 */00003840
                                 END;                                   00003850
                           END;                                         00003860
                                                                        00003870
 /* ***************************************************************** */00003880
 /*  DET ER IKKE DEN SAMME AVDØD.                                     */00003890
 /* ***************************************************************** */00003900
                                                                        00003910
                        ELSE                                            00003920
                           DO;                                          00003930
  L190:                                                                 00003940
                              FEIL_VED_LABEL = '190';                   00003950
                              FEIL_MELD_NR   = 1408;                    00003960
                              GO TO L999;                               00003970
                           END;                                         00003980
                      END;                                              00003990
                END;  /* END SELECT     */                              00004000
          END;        /*AVDØD ER I B01 */                               00004010
    END;              /*AVDØD ER OPPGITT PÅ BLANKETTEN */               00004020
 ELSE                                                                   00004030
    DO;                                                                 00004040
 /* ***************************************************************** */00004050
 /*  AVDØD EKTEFELLE ER UOPPGITT  - ENDRET AV KARIN 21/2-84           */00004060
 /* ***************************************************************** */00004070
 /* ***************************************************************** */00004080
 /* DERSOM AVDØD ER LEST INN I B01. (DETTE ER FEIL)                   */00004090
 /* ***************************************************************** */00004100
                                                                        00004110
       IF B01.FNR(AVDØD_IND) > 0 THEN                                   00004120
          DO;                                                           00004130
  L200:                                                                 00004140
              FEIL_VED_LABEL = '200';                                   00004150
              FEIL_MELD_NR   = 1715;                                    00004160
              GO TO L999;                                               00004170
             /* FEIL - UOPPGITT EKTEFELLE På BLANKETTEN */              00004180
          END;                                                          00004190
                                                                        00004200
                                                                        00004210
                                                                        00004220
 /* ***************************************************************** */00004230
 /*  HAR SØKER PENSJONSSTATUS, INNTEKTER , HISTORIKK?                 */00004240
 /* ***************************************************************** */00004250
                                                                        00004260
       IF B01.PENSJONSTYPE1 (SØKER_IND) = ' ' !                         00004270
          B01.STATUS_KODE_HIST (SØKER_IND) ^= ' ' THEN                  00004280
                                                                        00004290
 /* ***************************************************************** */00004300
 /*  SØKEREN ER I BASEN MED INNTEKTER OG HISTORIKK.                   */00004310
 /* ***************************************************************** */00004320
                                                                        00004330
          DO;                                                           00004340
             B02.TKNR  (SØKER_IND) =  EPS.TKNR;                         00004350
             B02.NAVN  (SØKER_IND) =  EPS.NAVN;                         00004360
             B02.SPRÅK (SØKER_IND) =  EPS.SPRÅK;                        00004370
             IF B01.FNR(SØKER_IND) > 0 THEN                             00004380
                CALL                                                    00004390
                 FLYTT_B01_TIL_B02(SØKER_IND);                          00004400
             ELSE                                                       00004410
                                                                        00004420
 /* ***************************************************************** */00004430
 /*  SØKEREN ER IKKE I BASEN.                                         */00004440
 /* ***************************************************************** */00004450
                                                                        00004460
                 B02.FNR   (SØKER_IND) =  EPS.FNR;                      00004470
                                                                        00004480
              CALL                                                      00004490
                OPPRETT_STATUS_EP_SØKER;                                00004500
 /*YS*/       IF FEIL_MELD_NR > 0         THEN                          00004510
 /*YS*/          GO TO L999;                                            00004520
          END;                                                          00004530
       ELSE                                                             00004540
          DO;                                                           00004550
                                                                        00004560
 /* ***************************************************************** */00004570
 /*  SØKEREN HAR PENSJONSSTATUS.                                      */00004580
 /* ***************************************************************** */00004590
                                                                        00004600
             IF B01.TKNR(SØKER_IND) > 0  THEN                           00004610
                IF B01.TKNR(SØKER_IND) ^= EPS.TKNR THEN                 00004620
                   DO;                                                  00004630
             L210:                                                      00004640
                      FEIL_VED_LABEL = '210';                           00004650
                      FEIL_MELD_NR   = 1702;                            00004660
                      GO TO L999;                                       00004670
                   END;                                                 00004680
                                                                        00004690
             SELECT (B01.STATUS.SIVILSTAND(SØKER_IND));                 00004700
                                                                        00004710
 /* ***************************************************************** */00004720
 /*  SØKEREN ER UGIFT.                                                */00004730
 /*YS      FØDSELSNUMMER AVDØD ER IKKE OPPGITT.  YRKESSKADE OG SIV=U  */00004740
 /*YS      SKAL IKKE FOREKOMME.                                       */00004750
 /* ***************************************************************** */00004760
                                                                        00004770
                WHEN('U')                                               00004780
                   DO;                                                  00004790
              L220:                                                     00004800
                      FEIL_VED_LABEL = '220';                           00004810
                      FEIL_MELD_NR = 1407;                              00004820
                      GO TO L999;                                       00004830
                   END;                                                 00004840
                                                                        00004850
 /* ***************************************************************** */00004860
 /*  SØKEREN ER SKILT.                                                */00004870
 /*YS      FØDSELSNUMMER AVDØD ER IKKE OPPGITT.  YRKESSKADE OG SIV=U  */00004880
 /*YS      SKAL IKKE FOREKOMME.                                       */00004890
 /* ***************************************************************** */00004900
                                                                        00004910
                WHEN('S')                                               00004920
                   DO;                                                  00004930
                      IF EPS.SIVILSTAND ='E' THEN                       00004940
                         DO;                                            00004950
                L230:                                                   00004960
                            FEIL_VED_LABEL = '230';                     00004970
                            FEIL_MELD_NR   = 1409;                      00004980
                            GO TO L999;                                 00004990
                          END;                                          00005000
                       ELSE                                             00005010
                          DO;                                           00005020
                             CALL                                       00005030
                              FLYTT_B01_TIL_B02(SØKER_IND);             00005040
                             CALL                                       00005050
                              AJOURFØR_B02_MED_EP_TRANS;                00005060
 /*YS*/                      IF FEIL_MELD_NR > 0    THEN                00005070
 /*YS*/                         GO TO L999;                             00005080
                          END;                                          00005090
                   END;                                                 00005100
                                                                        00005110
 /* ***************************************************************** */00005120
 /*  SØKEREN MÅ VÆRE ETTERLATT                                        */00005130
 /*YS      FØDSELSNUMMER AVDØD ER IKKE OPPGITT.  YRKESSKADE OG SIV=U  */00005140
 /*YS      SKAL IKKE FOREKOMME.                                       */00005150
 /* ***************************************************************** */00005160
                                                                        00005170
                WHEN('E')                                               00005180
                   DO;                                                  00005190
                      IF EPS.SIVILSTAND ='S' THEN                       00005200
                         DO;                                            00005210
          L240:                                                         00005220
                            FEIL_VED_LABEL = '240';                     00005230
                            FEIL_MELD_NR   = 1410;                      00005240
                            GO TO L999;                                 00005250
                         END;                                           00005260
                      ELSE                                              00005270
                         DO;                                            00005280
                            CALL                                        00005290
                              FLYTT_B01_TIL_B02(SØKER_IND);             00005300
                            CALL                                        00005310
                                 AJOURFØR_B02_MED_EP_TRANS;             00005320
 /*YS*/                     IF FEIL_MELD_NR > 0    THEN                 00005330
 /*YS*/                        GO TO L999;                              00005340
                         END;                                           00005350
                   END;                                                 00005360
                OTHERWISE                                               00005370
                   DO;                                                  00005380
           L245:                                                        00005390
                      FEIL_VED_LABEL = '245';                           00005400
                      FEIL_MELD_NR   = 1412;                            00005410
                      GO TO L999;                                       00005420
                   END;                                                 00005430
             END;        /* END SELECT */                               00005440
          END;           /* END SØKER HAR PENSJONSSTATUS */             00005450
    END;                 /* END AVDØD ER UOPPGITT        */             00005460
                                                                        00005470
                                                                        00005480
  L999:                                                                 00005490
  EXEC CICS PURGE MESSAGE;                                              00005500
  EXEC CICS RETURN;                                                     00005510
  %INCLUDE R0019905;    /*F_ALDER                               */      00005520
  %INCLUDE R0019913;    /*F_SNU_DATO                            */      00005530
  %INCLUDE R0019926;    /*FLYTT_B01_TIL_B02                     */      00005540
  %INCLUDE R0019924;    /*KOBLE_TO_PERSONER                     */      00005550
  %INCLUDE R0019949;    /*BEREGNER TT_FRAMT                     */      00005560
  %INCLUDE R0019965;    /*F_DATO_ÅM_PLUSS1                      *//*YS*/00005570
  %INCLUDE R0010821;    /*OPPRETT_STATUS_EP_SØKER               */      00005580
  %INCLUDE R0010822;    /*AJOURFØR_B02_MED_EP_TRANS             */      00005590
  %INCLUDE R0010823;    /*KONTROLL_AJOURFØR_AVDØD_YP            */      00005600
    %INCLUDE R0019968;  /* F_RULL_FORSI              */                 00005610
 END KON_EP;                                                            00005620
