 /*       SIST ENDRET 26/06-91 11.09.19 AV   DYBVIK                   */00000000
 R001NRC: PROC (IN_TKNR,IN_SVAR) OPTIONS(COBOL);                        00000010
                                                                        00000020
   DCL SYSPRINT             EXTERNAL FILE;                              00000030
   %INCLUDE P0019953;                        /* TKNRTAB */              00000040
                                                                        00000050
   DCL IN_TKNR              PIC '( 4)9',                                00000060
       IN_SVAR              CHAR ( 1)  ,                                00000070
       FUNNET               BIT  ( 1)    INIT ('1'B);                   00000080
                                                                        00000090
   DCL TKNRFIL FILE RECORD INPUT KEYED ENV (VSAM);                      00000100
                                                                        00000110
                                                                        00000120
   ON KEY (TKNRFIL)                                                     00000130
      FUNNET    = '0'B;                                                 00000140
                                                                        00000150
   OPEN FILE(TKNRFIL) INPUT;                                            00000160
                                                                        00000170
   READ FILE (TKNRFIL) INTO (TKNRTAB) KEY (IN_TKNR);                    00000180
                                                                        00000190
                                                                        00000200
   IF FUNNET THEN                                                       00000210
      IN_SVAR  = '0';                                                   00000220
   ELSE                                                                 00000230
      IN_SVAR  = '1';                                                   00000240
                                                                        00000250
 END;                                                                   00000260
