 /*       SIST ENDRET 28/07-97 12.35.13 AV   HLA7339                  */00000000
 /*       SIST ENDRET 08/08-96 12.32.57 AV   TSB0310                  */00000010
 /*       SIST ENDRET 14/08-95 09.14.27 AV   HLB0310                  */00000020
 /*       SIST ENDRET 18/10-94 15.12.55 AV   JDA0310                  */00000030
 /*       SIST ENDRET 28/09-94 12.26.30 AV   JDA0310                  */00000040
 /*       SIST ENDRET 28/04-94 14.33.30 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 05/01-94 12.54.45 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 11/03-92 14.00.06 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 30/01-92 09.52.01 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 03/01-92 14.14.05 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 18/12-91 16.20.45 AV   HERMAN                   */00000100
 /*       SIST ENDRET 13/12-91 12.35.14 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 10/10-91 13.56.11 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 11/07-91 14.22.47 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 26/04-91 11.47.25 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 08/04-91 12.06.30 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 12/11-90 13.15.02 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 04/09-90 12.53.36 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 18/01-90 12.01.10 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 13/12-89 08.00.41 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 01/12-89 08.42.11 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 11/07-85 14.02.58 AV   LUNDEBY                  */00000210
 /*       SIST ENDRET 08/07-85 09.59.50 AV   DYBVIK                   */00000220
 /*       SIST ENDRET 13/06-85 09.35.03 AV   FARVIK                   */00000230
 /*       SIST ENDRET 05/06-85 09.41.11 AV   LUNDEBY                  */00000240
 /*       SIST ENDRET 05/09-84 11.17.22 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 09/07-84 09.53.23 AV   HERMAN                   */00000260
 /*       SIST ENDRET 17/11-83 14.18.36 AV   FARVIK                   */00000270
 /*       SIST ENDRET 17/11-83 11.25.02 AV   DYBVIK                   */00000280
 /*       SIST ENDRET 04/11-83 08.49.03 AV   OLAV                     */00000290
  /* *************************************************************** */ 00000300
  /* IDENTIFIKASJON:   R0017035                                      */ 00000310
  /* PROGRAMMERER:  HELEN    JULI, 1982                              */ 00000320
  /* HENSIKT:                                                        */ 00000330
  /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT    */ 00000340
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */ 00000350
  /*        HVER AJOURFØRT TRANSAKSJON.                              */ 00000360
  /* PROGRAMTILKNYTNING:                                             */ 00000370
  /*        PROGRAMMET INKLUDERES I  R0017001                        */ 00000380
  /* *************************************************************** */ 00000390
                                                                        00000400
  LAG_ETTERL_ALDERSP_HEND:                                              00000410
      PROC(IND);                                                        00000420
                                                                        00000430
    DCL   IND             FIXED BIN (15);                               00000440
    DCL   EKIND           FIXED BIN (15);                               00000450
    DCL   AE_ALDER        FIXED DEC  (5);                               00000460
                                                                        00000470
 DCL                                                                    00000480
    W_TAI                 FIXED DEC (7),                                00000490
    W_BRP                 FIXED DEC (7,2),                              00000500
    W_APD                 FIXED DEC (7,3),                              00000510
    W_FAI_MAX             FIXED DEC (7),                                00000520
    W_FAI_MAX_FRAVIK      FIXED DEC (7);                                00000530
                                                                        00000540
 DCL F_NUMMER                               PIC '99999999999';          00000550
                                                                        00000560
 DCL FNR_ÅM DEF F_NUMMER POS (3)            PIC '9999';                 00000570
                                                                        00000580
 DCL  FYLL_67_ÅM                            PIC '9999';                 00000590
                                                                        00000600
 DCL FYLL_67_ÅR  DEF FYLL_67_ÅM POS (1)     PIC '99';                   00000610
                                                                        00000620
 DCL FYLL_67_MND DEF FYLL_67_ÅM POS (3)     PIC '99';                   00000630
                                                                        00000640
 DCL  FYLL_70_ÅM                            PIC '9999';                 00000650
                                                                        00000660
 DCL FYLL_70_ÅR  DEF FYLL_70_ÅM POS (1)     PIC '99';                   00000670
                                                                        00000680
 DCL FYLL_70_MND DEF FYLL_70_ÅM POS (3)     PIC '99';                   00000690
                                                                        00000700
 DCL MAX_ÅM                                 PIC '9999';                 00000710
                                                                        00000720
 DCL MAX_MND DEF MAX_ÅM            POS (3)  PIC '99';                   00000730
                                                                        00000740
 DCL MAX_ÅR  DEF MAX_ÅM            POS (1)  PIC '99';                   00000750
                                                                        00000760
 DCL MIN_ÅM                                 PIC '9999';                 00000770
                                                                        00000780
 DCL MIN_MND DEF MIN_ÅM            POS (3)  PIC '99';                   00000790
                                                                        00000800
 DCL MIN_ÅR  DEF MIN_ÅM            POS (1)  PIC '99';                   00000810
                                                                        00000820
 DCL MND                                    PIC '9999';                 00000830
                                                                        00000840
  /* *************************************************************** */ 00000850
  /*   PROGRAMMET BEGYNNER HER. VI BLANKER W_HENDELSE.               */ 00000860
  /*   ADDRESSERER EIB                                               */ 00000870
  /* *************************************************************** */ 00000880
                                                                        00000890
    EXEC CICS ADDRESS EIB(DFHEIPTR);                                    00000900
                                                                        00000910
    IF IND = 1 THEN                                                     00000920
       EKIND = 2;                                                       00000930
    ELSE                                                                00000940
       EKIND = 1;                                                       00000950
                                                                        00000960
    W_HENDELSE              =  '';                                      00000970
    OMR_DATO                = F_SNU_DATO(TRANS_OPPL_OMR.VIRKNINGSDATO); 00000980
    AE_ALDER                = F_ALDER(TRANS_OPPL_OMR.FØDSNUMMER,        00000990
                                      TRANS_OPPL_OMR.VIRKNINGSDATO);    00001000
    W_APD                   = B02.ALDERSP.APD(IND);                     00001010
                                                                        00001020
    IF TRANS_OPPL_OMR.TRANSTYPE = 27 THEN                               00001030
       DO;                                                              00001040
          HENDDATO  =  OMR_DATO;                                        00001050
       END;                                                             00001060
    ELSE                                                                00001070
       DO;                                                              00001080
          IF DIV_PERIODE.INTENDR_ÅM > 0    THEN                         00001090
             HENDDATO     = DIV_PERIODE.INTENDR_ÅM;                     00001100
          ELSE                                                          00001110
             DO;                                                        00001120
                R_HENDDATO_D =  B02.PERSON.STATUS.VIRK_DATO_ÅM(IND);    00001130
                HENDDATO     =  R_HENDDATO.AAR !!R_HENDDATO.MND;        00001140
             END;                                                       00001150
       END;                                                             00001160
                                                                        00001170
                                                                        00001180
  /* *************************************************************** */ 00001190
  /* ANTALL MÅNEDER VENTET PÅ ALDERSPENSJON                          */ 00001200
  /* *************************************************************** */ 00001210
                                                                        00001220
  /* *************************************************************** */ 00001230
  /*   VI SKRIVER BARE UT VENTEMÅNEDER NÅR DET TAS UT 100%           */ 00001240
  /* *************************************************************** */ 00001250
                                                                        00001260
   MND                       = 0;                                       00001270
   MAX_ÅM                    = 0;                                       00001280
   MIN_ÅM                    = 0;                                       00001290
   F_NUMMER                  = B02.FNR(IND);                            00001300
                                                                        00001310
   IF B02.ALDERSP.APD (IND) = 100  THEN                                 00001320
     DO;                                                                00001330
       FYLL_67_ÅM                = F_SNU_DATO(FNR_ÅM) + 6700;           00001340
       IF FYLL_67_ÅM < 7301 THEN                                        00001350
          FYLL_67_ÅM = 7301;                                            00001360
       FYLL_70_ÅM                = F_SNU_DATO(FNR_ÅM) + 7000;           00001370
       IF FYLL_70_ÅM < 7301 THEN                                        00001380
          FYLL_70_ÅM = 7301;                                            00001390
                                                                        00001400
       IF B02.UTTAKSDATO_ÅM(IND) > FYLL_70_ÅM THEN                      00001410
          DO;                                                           00001420
    /* HL 9.7.84 */   IF FYLL_70_ÅM > 8404          THEN                00001430
                         MAX_ÅM   = 8404;                               00001440
                      ELSE                                              00001450
                         MAX_ÅM   = FYLL_70_ÅM;                         00001460
    /* HL -  HIT */   MIN_ÅM   = FYLL_67_ÅM;                            00001470
                      MND      = (MAX_ÅR * 12 + MAX_MND)                00001480
                            - (MIN_ÅR * 12 + MIN_MND);                  00001490
          END;                                                          00001500
       ELSE                                                             00001510
                                                                        00001520
  /* *************************************************************** */ 00001530
  /* LOVENDRING - VENTETILLEGGET FALLER BORT 01.04.84                */ 00001540
  /* *************************************************************** */ 00001550
                                                                        00001560
       IF FYLL_67_ÅM < 8404 THEN                                        00001570
          DO;                                                           00001580
                                                                        00001590
  /* *************************************************************** */ 00001600
  /* FRA 67 ÅR TIL FØRSTE UTTAKSDATO                                 */ 00001610
  /* *************************************************************** */ 00001620
                                                                        00001630
              MAX_ÅM   = B02.UTTAKSDATO_ÅM(IND);                        00001640
              MIN_ÅM   = FYLL_67_ÅM;                                    00001650
              IF MAX_ÅM > 8404 THEN                                     00001660
                 MAX_ÅM = 8404;                                         00001670
              IF MIN_ÅM > 8404 THEN                                     00001680
                 MIN_ÅM = 8404;                                         00001690
              MND      = (MAX_ÅR * 12 + MAX_MND)                        00001700
                       - (MIN_ÅR * 12 + MIN_MND);                       00001710
                                                                        00001720
  /* *************************************************************** */ 00001730
  /* VIDERE FRA FØRSTE UTTAKSDATO                                    */ 00001740
  /* *************************************************************** */ 00001750
                                                                        00001760
                  IF B02.UTTAKS_APD(IND) < 100 THEN                     00001770
                     MIN_ÅM = B02.UTTAKSDATO_ÅM(IND);                   00001780
                  ELSE                                                  00001790
                     MIN_ÅM = 0;                                        00001800
                  IF MIN_ÅM > 8404 THEN                                 00001810
                     MIN_ÅM = 8404;                                     00001820
                                                                        00001830
  /* *************************************************************** */ 00001840
  /* VENTEMÅNEDER REGNES FREM TIL HVER VENTEPERIODE                  */ 00001850
  /* *************************************************************** */ 00001860
                                                                        00001870
                  DO I = 1 TO 5 WHILE (B02.UTTAKSDATO_ÅM_ØVRIGE         00001880
                                    (IND,I) > 0);                       00001890
                        IF MIN_ÅM > 0  THEN                             00001900
                           DO;                                          00001910
                                                                        00001920
                              MAX_ÅM = B02.UTTAKSDATO_ÅM_ØVRIGE         00001930
                                                         (IND,I);       00001940
                              IF MAX_ÅM > 8404 THEN                     00001950
                                 MAX_ÅM = 8404;                         00001960
                              MND      = (MAX_ÅR * 12 + MAX_MND)        00001970
                                        - (MIN_ÅR * 12 + MIN_MND)       00001980
                                        + MND;                          00001990
                           END;                                         00002000
                                                                        00002010
                         IF B02.APD_ØVRIGE(IND,I) < 100 THEN            00002020
                            MIN_ÅM = B02.UTTAKSDATO_ÅM_ØVRIGE(IND,I);   00002030
                         ELSE                                           00002040
                            MIN_ÅM = 0;                                 00002050
                   END;                                                 00002060
         END;                                                           00002070
     END;                                                               00002080
   W_HENDELSE.ANTALL_MND_VENTET  =  MND;                                00002090
   IF W_HENDELSE.ANTALL_MND_VENTET  > 36 THEN                           00002100
      W_HENDELSE.ANTALL_MND_VENTET  = 36;                               00002110
                                                                        00002120
    F_NUMMER                  = B02.FNR(IND);                           00002130
                                                                        00002140
    W_HENDELSE.FNR_EKTEF  =    B02.PERSON.RF0PERSN.FNR(EKIND);          00002150
    W_HENDELSE.NAVN_EKTEF =    B02.PERSON.RF0PERSN.NAVN(EKIND);         00002160
    W_HENDELSE.SIVILSTAND_EK = B02.STATUS.SIVILSTAND(EKIND);            00002170
    W_HENDELSE.VERSJON       =  W_ROT.NESTE_SB_VERSJON_NR;              00002180
    W_HENDELSE.TERMINAL      = EIBTRMID;                                00002190
    W_HENDELSE.PENSJONSTYPE1 = B02.STATUS.PENSJONSTYPE1(IND);           00002200
    W_HENDELSE.PENSJONSTYPE2 = B02.STATUS.PENSJONSTYPE2(IND);           00002210
    W_HENDELSE.PENSJONSTYPE3 = B02.STATUS.PENSJONSTYPE3(IND);           00002220
    W_HENDELSE.SIVILSTAND_EK = B02.STATUS.SIVILSTAND(EKIND);            00002230
    W_HENDELSE.GP_BRUTTO     =  B02.PERSON.ALDERSP.GP(IND);             00002240
  /*W_HENDELSE.GP_NETTO      =  B02.PERSON.ALDERSP.GP(IND);   JD 2.92*/ 00002250
    W_HENDELSE.TP_BRUTTO     =  B02.PERSON.ALDERSP.TP(IND) +            00002260
                                  B02.PERSON.ETTEPENS.TP_BRUTTO(IND);   00002270
    W_HENDELSE.TP_NETTO      =  B02.PERSON.ETTEPENS.TP_NETTO(IND);      00002280
      /*                     +    B02.PERSON.AP_TP_NETTO(IND);   */     00002290
    W_HENDELSE.ST            =  B02.PERSON.ALDERSP.ST(IND);             00002300
    W_HENDELSE.KT            =  B02.PERSON.ALDERSP.KT(IND);             00002310
    W_HENDELSE.ET            =  B02.PERSON.ALDERSP.ET(IND);             00002320
    W_HENDELSE.BT            =  B02.PERSON.ALDERSP.BT(IND);             00002330
                                                                        00002340
                                         /* NY0591 TRUDE  */            00002350
                                                                        00002360
    W_HENDELSE.BT_SÆRBARN    =  B02.PERSON.FORSI.BT_SÆRBARN(IND);       00002370
    W_HENDELSE.FT_SKAL_BEREGNES = B02.FORSI.FT_SKAL_BEREGNES(IND);      00002380
    W_HENDELSE.ARBEIDSINNTEKT   = B02.FORSI.ARBEIDSINNTEKT(IND);        00002390
    W_HENDELSE.PENSJONSINNTEKT   = B02.FORSI.PENSJONSINNTEKT(IND);      00002400
    W_HENDELSE.ARBEIDSINNTEKT_EK = B02.FORSI.ARBEIDSINNTEKT_EK(IND);    00002410
    W_HENDELSE.PENSJONSINNTEKT_EK= B02.FORSI.PENSJONSINNTEKT_EK(IND);   00002420
    W_HENDELSE.FRIBELØP_MINSTE = DIV_PARAM_OMR.FRIBELØP_MINSTE(IND);    00002430
    W_HENDELSE.FRIBELØP_FELLESBARN =                                    00002440
                             DIV_PARAM_OMR.FRIBELØP_FELLESBARN(IND);    00002450
    W_HENDELSE.FRIBELØP_SÆRBARN = DIV_PARAM_OMR.FRIBELØP_SÆRBARN(IND);  00002460
    W_HENDELSE.FOLKETRYGD        = DIV_PARAM_OMR.FOLKETRYGD(IND);       00002470
     /* ******* NESTE STATEMENT MÅ INNEHOLDE FEIL INDEX                 00002480
    W_HENDELSE.FOLKETRYGD_EK     = DIV_PARAM_OMR.FOLKETRYGD(EKTEF_IND); 00002490
      ERSTATTES MED NESTE, TRUDE 290192    ******** */                  00002500
    W_HENDELSE.FOLKETRYGD_EK     = DIV_PARAM_OMR.FOLKETRYGD(EKIND);     00002510
                                    /* HIT TRUDE */                     00002520
                                                                        00002530
    W_HENDELSE.TEI   = DIV_PARAM_OMR.TAI(IND) / 1000;            /*92*/ 00002540
                                                                        00002550
 /* NESTE LINJE ER ERSTATTET MED EN TEST. HL 1294 */                    00002560
 /* HVORFOR . TRUDE 0896. RETTEST TIL OPPRINNELIG */                    00002570
                                                                        00002580
    W_HENDELSE.BEREGN_ALT_AEY = DIV_PARAM_OMR.AP_KODE_AEY(IND);         00002590
                                                                        00002600
 /* IF B02.ETTEPENS.TP_BRUTTO(IND) > 0     THEN                         00002610
       W_HENDELSE.BEREGN_ALT_AEY = 'E';                                 00002620
                                                                        00002630
  **HIT HL 1294 */                                                      00002640
                                                                        00002650
    W_HENDELSE.FULLT_SÆRTILLEGG =                                /*92*/ 00002660
           DIV_PARAM_OMR.FULLT_SÆRTILLEGG(IND);  /*92*/                 00002670
    IF B02.STATUS.SIVILSTAND(IND) = 'E' THEN                            00002680
       W_HENDELSE.TP_PROSENT     = 55;                                  00002690
    ELSE                                                                00002700
       W_HENDELSE.TP_PROSENT     = B02.ETTEPENS.TP_PROSENT(IND);        00002710
                                                                        00002720
 /*2.4.91 HL : */                                                       00002730
                                                                        00002740
    IF IND < 3        THEN                                              00002750
       W_HENDELSE.GARANTITILLEGG_TP = DIV_PARAM_OMR.                    00002760
                                GARANTITILLEGG_TP(IND);                 00002770
                                                                        00002780
                                 /* TRUDE FT0591 FRA HIT */             00002790
      /*HER ER FEIL I INDEX EKTEF_IND, SKAL VÆRE EKIND, TS290192*/      00002800
                                                                        00002810
    IF B02.PENSJONSTYPE1(EKIND)  =  'F'  THEN                           00002820
         DO I = 1 TO 13;                                                00002830
            IF B02.FNR_TILKN(IND,I) =   B02.FNR(EKIND) THEN             00002840
                DO;                                                     00002850
                   W_HENDELSE.ET_FØR_0591 = B02.FT_FØR_91(IND,I);       00002860
                   I = 13;                                              00002870
                END;                                                    00002880
         END;                                                           00002890
                                                                        00002900
    W_HENDELSE.GARANTITILLEGG_EK = B02.FORSI.GARANTITILLEGG_EK(IND);    00002910
    W_HENDELSE.GARANTITILLEGG_BARN =                                    00002920
                            B02.FORSI.GARANTITILLEGG_BARN(IND);         00002930
    W_HENDELSE.GARANTITILLEGG_SÆRBARN =                                 00002940
                        B02.FORSI.GARANTITILLEGG_SÆRBARN(IND);          00002950
                                /* FT 0591 TIL HIT */                   00002960
                                                                        00002970
    /* LAGT INN 20.6 1985 J.D */                                        00002980
    IF AE_ALDER < 7000  & B02.ETTEPENS.FORVENTET(IND) = 0 THEN          00002990
       W_HENDELSE.FORVENTET_INNTEKT = B02.ALDERSP.FAI(IND);             00003000
    ELSE                                                                00003010
       W_HENDELSE.FORVENTET_INNTEKT = B02.ETTEPENS.FORVENTET(IND);      00003020
    /* HIT J.D */                                                       00003030
    W_HENDELSE.TP_GAR_KODE   =  B02.PERSON.TP_GAR_KODE(IND); /*UFF*/    00003040
    /*0697 HL:*/                                                        00003050
    DO L = 1 TO 7 WHILE (B02.UFØRHIST.UFT_ÅM(IND,L) > 0); /*UFF67*/     00003060
       W_HENDELSE.BUP_GARANTI = B02.UFØRHIST.BUP_GARANTI(IND,L);/*UFF*/ 00003070
    END;   /*UFF67*/                                                    00003080
    W_HENDELSE.ANTALL_BARN   =  B02.PERSON.STATUS.ANTALL_BARN(IND);     00003090
    W_HENDELSE.ANTALL_BARN_TIDL                                         00003100
                             =  B01.PERSON.STATUS.ANTALL_BARN(IND);     00003110
    W_HENDELSE.VT_GP         =  B02.PERSON.ALDERSP.VT_GP(IND);          00003120
    IF B02.PERSON.ALDERSP.VT_TP(IND) > 0 THEN                           00003130
       DO;                                                              00003140
          W_HENDELSE.VT_TP   =  B02.PERSON.ALDERSP.VT_TP(IND);          00003150
       END;                                                             00003160
    W_HENDELSE.FAI           =  B02.PERSON.ALDERSP.FAI(IND);            00003170
    W_HENDELSE.APD           =  B02.PERSON.ALDERSP.APD(IND);            00003180
                                                                        00003190
    IF B02.PERSON.ALDERSP.P67_KODE(IND) = '3'  THEN                     00003200
       DO;                                                              00003210
          W_HENDELSE.ØNSKET_APD = B02.PERSON.ALDERSP.APD(IND);          00003220
       END;                                                             00003230
    ELSE                                                                00003240
       DO;                                                              00003250
          W_HENDELSE.ØNSKET_APD = 0;                                    00003260
       END;                                                             00003270
                                                                        00003280
  /* *************************************************************** */ 00003290
  /* HVIS SØKER ER UNDER 70 ÅR HENTES FØLGENDE RUTINER FRA BEREGNING */ 00003300
  /* *************************************************************** */ 00003310
                                                                        00003320
    IF AE_ALDER < 7000 THEN                                             00003330
       DO;                                                              00003340
          W_FNR                   = B02.FNR (IND);                      00003350
          CALL TIDLIGERE_ARBEIDSINNTEKT(W_TAI,W_BRP);                   00003360
                                                                        00003370
          IF (B02.PERSON.ALDERSP.P67_KODE(IND) = '1' !                  00003380
              B02.PERSON.ALDERSP.P67_KODE(IND) = '2'   )    THEN        00003390
                                                                        00003400
             DO;                                                        00003410
                CALL FAI_GRENSER(W_APD,W_TAI,W_FAI_MAX);                00003420
                CALL FAI_GRENSER_FRAVIK(W_APD,W_FAI_MAX_FRAVIK);        00003430
                                                                        00003440
                IF W_FAI_MAX < W_FAI_MAX_FRAVIK      THEN               00003450
                   W_FAI_MAX = W_FAI_MAX_FRAVIK;                        00003460
             END;                                                       00003470
                                                                        00003480
           ELSE                                                         00003490
                                                                        00003500
                IF B02.PERSON.ALDERSP.P67_KODE(IND) = '3'  THEN         00003510
                                                                        00003520
                   DO;                                                  00003530
                      IF W_TAI < G * 2 THEN                             00003540
                         CALL FAI_GRENSER_FRAVIK(W_APD,W_FAI_MAX);      00003550
                      ELSE                                              00003560
                         CALL FAI_GRENSER(W_APD,W_TAI,W_FAI_MAX);       00003570
                   END;                                                 00003580
                                                                        00003590
                ELSE                                                    00003600
                                                                        00003610
                   CALL FAI_GRENSER_FRAVIK(W_APD,W_FAI_MAX);            00003620
                                                                        00003630
          W_HENDELSE.FAI_MAX      = W_FAI_MAX/100;                      00003640
       END;                                                             00003650
                                                                        00003660
    W_HENDELSE.TT            = B02.PERSON.STATUS.TT_ANV(IND);           00003670
    W_HENDELSE.TT_EK         = B02.PERSON.STATUS.TT_ANV(EKIND);         00003680
    W_HENDELSE.VENTEFAKTOR   = B02.VENTEFAKTOR(IND);                    00003690
                                                                        00003700
    W_HENDELSE.PÅ            = B02.ALDERSP.PÅ      (IND);               00003710
    W_HENDELSE.OPT           = B02.ALDERSP.OPT     (IND);               00003720
    W_HENDELSE.SPT           = B02.ALDERSP.SPT     (IND);               00003730
                                                                        00003740
    W_HENDELSE.PÅ_P67        = B02.ALDERSP.VT_PÅ   (IND);               00003750
    W_HENDELSE.OPT_P67       = B02.ALDERSP.VT_OPT  (IND);               00003760
    W_HENDELSE.SPT_P67       = B02.ALDERSP.VT_SPT  (IND);               00003770
                                                                        00003780
                                                                        00003790
  /* *************************************************************** */ 00003800
  /* NY LOV 0192     JD 11.91                                        */ 00003810
  /* *************************************************************** */ 00003820
                                                                        00003830
    W_HENDELSE.GT_LOV92    =  B02.STATUS.GT_LOV92(IND);                 00003840
    W_HENDELSE.GT_TILLEGG_LOV92 = B02.STATUS.GT_TILLEGG_LOV92(IND);     00003850
    W_HENDELSE.GARANTI_DATO_ÅM  = B02.STATUS.GARANTI_DATO_ÅM(IND);      00003860
    W_HENDELSE.AP_TP_NETTO      = B02.ALDERSP.AP_TP_NETTO   (IND);      00003870
    W_HENDELSE.AP_GP_NETTO      = B02.ALDERSP.AP_GP_NETTO   (IND);      00003880
    W_HENDELSE.SPT_1291         = B02.ALDERSP.SPT_1291      (IND);      00003890
    W_HENDELSE.OPT_1291         = B02.ALDERSP.OPT_1291      (IND);      00003900
    W_HENDELSE.PÅ_1291         = B02.ALDERSP.PÅ_1291      (IND);        00003910
    W_HENDELSE.PÅ_ETTER91      = B02.ALDERSP.PÅ_ETTER91   (IND);        00003920
    W_HENDELSE.SPT_1291_EK     = B02.ETTEPENS.SPT_1291    (IND); /**/   00003930
    W_HENDELSE.OPT_1291_EK     = B02.ETTEPENS.OPT_1291    (IND); /**/   00003940
    W_HENDELSE.PÅ_1291_EK      = B02.ETTEPENS.PÅ_1291     (IND); /**/   00003950
    W_HENDELSE.PÅ_ETTER91_EK   = B02.ETTEPENS.PÅ_ETTER91  (IND); /**/   00003960
    W_HENDELSE.YRKE_PÅ_ETTER91 = B02.YRKEPENS.PÅ_ETTER91  (IND);        00003970
    W_HENDELSE.YRKE_POENG_1291 = B02.YRKEPENS.YRKE_POENG_1291(IND);     00003980
             /* HIT JD 1191 */                                          00003990
    W_HENDELSE.YRKE_BT       = B02.YRKEPENS.BT(IND);   /*YS*/           00004000
    W_HENDELSE.YRKE_TP       = B02.YRKEPENS.TP(IND);   /*YS*/           00004010
    W_HENDELSE.YRKE_GP       = B02.YRKEPENS.GP(IND);   /*YS*/           00004020
    W_HENDELSE.YRKE_UFG      = B02.YRKEPENS.YUG(IND);   /*YS*/          00004030
    W_HENDELSE.YRKE_KODE     = B02.YRKEPENS.YPT_KODE(IND); /*YS*/       00004040
                                                                        00004050
    IF B02.YRKEPENS.YPT  (IND) < B02.YRKE_POENG_1291 (IND) THEN         00004060
       W_HENDELSE.YRKE_YPT     = B02.YRKE_POENG_1291 (IND);             00004070
    ELSE                                                                00004080
       W_HENDELSE.YRKE_YPT     = B02.YRKEPENS.YPT    (IND);             00004090
                                                                        00004100
 /* W_HENDELSE.YRKE_YPT      = B02.YRKEPENS.YPT  (IND)         */       00004110
    W_HENDELSE.YRKE_SPT      = B02.YRKEPENS.SPT  (IND);    /*YS*/       00004120
    W_HENDELSE.DØD_AV_YSKADE = B02.DØD_AV_YRKESSKADE(IND);  /*YS*/      00004130
    W_HENDELSE.BOSATT        = B02.BOSATT(IND);  /*JD 08.90 */          00004140
    IF B02.YRKEPENS.YUG(EKIND) > 0 THEN                                 00004150
       DO;                                                              00004160
         W_HENDELSE.YRKE_UFG_AVD = B02.YRKEPENS.YUG(EKIND); /*YS*/      00004170
         W_HENDELSE.YRKE_KODE_AVD = B02.YRKEPENS.YPT_KODE(EKIND);/*YS*/ 00004180
                                                                        00004190
    IF B02.YRKEPENS.YPT(EKIND) < B02.YRKE_POENG_1291 (EKIND) THEN       00004200
       W_HENDELSE.YRKE_YPT_AVD = B02.YRKE_POENG_1291 (EKIND);           00004210
    ELSE                                                                00004220
       W_HENDELSE.YRKE_YPT_AVD = B02.YRKEPENS.YPT    (EKIND);           00004230
                                                                        00004240
 /*      W_HENDELSE.YRKE_YPT_AVD = B02.YRKEPENS.YPT(EKIND)       */     00004250
         W_HENDELSE.YRKE_SPT_AVD = B02.YRKEPENS.SPT(EKIND);  /*YS*/     00004260
      END;                                                              00004270
  /* *************************************************************** */ 00004280
  /* FØLGENDE FELT HENTES FRA YRKESSKADEHISTORIKKK                   */ 00004290
  /* *************************************************************** */ 00004300
                                                                        00004310
                                                                        00004320
  DCL M                 FIXED BIN(15) INIT (0);               /*YS*/    00004330
  DCL Y                 FIXED BIN(15) INIT (0);               /*YS*/    00004340
                                                              /*YS*/    00004350
  DCL TRUDE1            PIC '9999';                           /*YS*/    00004360
  DCL TRUDE2            PIC '9999';                           /*YS*/    00004370
  /* FINNE SISTE YUFT  */                                     /*YS*/    00004380
  TRUDE1 = B01.YRKEHIST.YUFT_ÅM(EKIND,1);                     /*YS*/    00004390
  TRUDE2 = B01.YRKEHIST.YUFT_ÅM(EKIND,2);                     /*YS*/    00004400
  DO M = 5 TO 1 BY -1  UNTIL (B02.YRKEHIST.YUFT_ÅM            /*YS*/    00004410
                                       (EKIND,M) > 0);        /*YS*/    00004420
  END;                                                        /*YS*/    00004430
                                                              /*YS*/    00004440
 IF M > 0 THEN                                                /*YS*/    00004450
 DO;                                                          /*YS*/    00004460
                                                              /*YS*/    00004470
  W_HENDELSE.YRKE_YUFT_ÅM_AVD = B02.YRKEHIST.YUFT_ÅM(EKIND,M);/*YS*/    00004480
  W_HENDELSE.YRKE_YST_ÅM_AVD  = B02.YRKEHIST.YST_ÅM (EKIND,M);/*YS*/    00004490
  IF B02.YRKEHIST.AÅI (EKIND,M) = 9999999 THEN                /*YS*/    00004500
     W_HENDELSE.YRKE_AÅI_AVD         = 0;                     /*YS*/    00004510
  ELSE                                                        /*YS*/    00004520
     W_HENDELSE.YRKE_AÅI_AVD  = B02.YRKEHIST.AÅI (EKIND,M);   /*YS*/    00004530
  W_HENDELSE.YRKE_YRKE11_AVD  = B02.YRKEHIST.YRKE11 (EKIND,M);/*YS*/    00004540
  W_HENDELSE.YRKE_PAÅ_AVD     = B02.YRKEHIST.PAÅ   (EKIND,M); /*YS*/    00004550
                                                                        00004560
 END;                                                         /*YS*/    00004570
                                                                        00004580
  DO Y = 5 TO 1 BY -1  UNTIL (B02.YRKEHIST.YUFT_ÅM             /*YS*/   00004590
                                       (IND,Y) > 0);           /*YS*/   00004600
  END;                                                         /*YS*/   00004610
 IF Y > 0 THEN                                                  /*YS*/  00004620
 DO;                                                            /*YS*/  00004630
 /*  IF B02.PERSON.STATUS.ENGANGSBELØP_11_7(IND) > 0 THEN       YS*/    00004640
  IF   DIV_PARAM_OMR.ENGANGSBELØP_11_7(IND) > 0 THEN   /*YS*/           00004650
     DO;                                                       /*YS*/   00004660
        W_HENDELSE.YRKE_UFG     = B02.YRKEHIST.YUG(IND,Y);     /*YS*/   00004670
     END;                                                      /*YS*/   00004680
                                                               /*YS*/   00004690
  W_HENDELSE.YRKE_YUFT_ÅM = B02.YRKEHIST.YUFT_ÅM(IND,Y);       /*YS*/   00004700
  W_HENDELSE.YRKE_YST_ÅM  = B02.YRKEHIST.YST_ÅM (IND,Y);       /*YS*/   00004710
  IF B02.YRKEHIST.AÅI (IND,Y) = 9999999 THEN                /*YS*/      00004720
     W_HENDELSE.YRKE_AÅI         = 0;                          /*YS*/   00004730
  ELSE                                                         /*YS*/   00004740
     W_HENDELSE.YRKE_AÅI         = B02.YRKEHIST.AÅI   (IND,Y); /*YS*/   00004750
  W_HENDELSE.YRKE_YRKE11  = B02.YRKEHIST.YRKE11 (IND,Y);       /*YS*/   00004760
  W_HENDELSE.YRKE_PAÅ     = B02.YRKEHIST.PAÅ   (IND,Y);        /*YS*/   00004770
 END;                                                                   00004780
    W_HENDELSE.PÅ_EK         = B02.ETTEPENS.PÅ_AVD (IND);               00004790
    W_HENDELSE.OPT_EK        = B02.ETTEPENS.OPT_AVD(IND);               00004800
    W_HENDELSE.SPT_EK        = B02.ETTEPENS.SPT_AVD(IND);               00004810
                                                                        00004820
       DO J = 3 TO 14 WHILE(B02.FNR(J) > 0);                            00004830
                                                                        00004840
          DO K = 1 TO 13 WHILE (B02.FNR_TILKN(IND,K) > 0);              00004850
                                                                        00004860
             IF B02.FNR(J) = B02.FNR_TILKN(IND,K) THEN                  00004870
                                                                        00004880
                DO;                                                     00004890
                   W_HENDELSE.BARN.FNR_B(J-2)           = B02.FNR(J);   00004900
                   W_HENDELSE.BARN.PENSJONSTYPE2_B(J-2) =               00004910
                                                  B02.PENSJONSTYPE2(J); 00004920
                   W_HENDELSE.BARN.BT_FØR_0591(J-2) =                   00004930
                              B02.FT_FØR_91(IND,K);                     00004940
                   K = 13;                                              00004950
                END;                                                    00004960
          END;                                                          00004970
       END;                                                             00004980
    W_HENDELSE.ÅR_BUP_FPP    = POREKKE.BUP_FPP_ÅR(IND);                 00004990
    W_HENDELSE.ÅR_BUP_FPP_EK = POREKKE.BUP_FPP_ÅR(EKIND);               00005000
                                                                        00005010
    CALL PLASSER_TEKST(IND,EKIND);                                      00005020
                                                                        00005030
    CALL INSERT_HENDELSE;                                               00005040
                                                                        00005050
    IF W_HENDELSE.SPT > 0 ! W_HENDELSE.OPT > 0 THEN                     00005060
       DO;                                                              00005070
          CALL BYGG_OPP_BERGRUNL_SEGMENT(IND);                          00005080
       END;                                                             00005090
                                                                        00005100
  /* *************************************************************** */ 00005110
  /*   DERSOM AVDØDE EKTEFELLE HAR SPT STØRRE ENN 0                  */ 00005120
  /* *************************************************************** */ 00005130
                                                                        00005140
    IF (B02.PENSJONSTYPE1(IND) = 'E' &                                  00005150
        B02.PENSJONSTYPE1(EKIND) = 'D' ) !                              00005160
       (W_HENDELSE.SPT_EK       >  0 !                                  00005170
        W_HENDELSE.OPT_EK       >  0 ) THEN                             00005180
        DO;                                                             00005190
           CALL BYGG_OPP_BERGRUNL_SEGMENT_DØD(EKIND);                   00005200
        END;                                                            00005210
                                                                        00005220
  END  LAG_ETTERL_ALDERSP_HEND;                                         00005230
