 /*       SIST ENDRET 01/09-98 09.56.24 AV   JDA7339                  */00000000
 /*       SIST ENDRET 01/09-98 09.54.16 AV   JDA7339                  */00000010
 /*       SIST ENDRET 26/04-96 08.18.18 AV   JDA0310                  */00000020
 /*       SIST ENDRET 18/04-96 15.14.09 AV   TSB0310                  */00000030
 /*       SIST ENDRET 17/04-96 12.20.24 AV   JDA0310                  */00000040
 /*       SIST ENDRET 17/04-96 12.08.16 AV   JDA0310                  */00000050
 /*       SIST ENDRET 15/04-96 11.48.20 AV   JDA0310                  */00000060
 /*       SIST ENDRET 10/03-94 14.47.00 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 02/12-92 12.26.07 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 14/07-92 10.10.17 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 04/05-92 11.13.44 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 18/12-89 12.35.23 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 08/11-89 13.26.10 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 06/09-89 12.01.28 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 28/04-89 11.15.11 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 14/04-89 15.49.35 AV   HERMAN                   */00000150
 %SKIP;                                /*  */                           00000160
 /* ***************************************************************** */00000170
 /*                                                                   */00000180
 /* ***************************************************************** */00000190
 /*IDENTIFIKASJON:                                                    */00000200
 /* **********************                                            */00000210
 /*  PROGRAM-IDENT : R0012004                    SUBPROGRAM           */00000220
 /*  PROGRAM-SPRÅK : PLI                                              */00000230
 /*  PROGRAMMERER  : PATAHAK                                          */00000240
 /*                                                                   */00000250
 /* ***************************************************************** */00000260
 /*HENSIKT:                                                           */00000270
 /* **********                                                        */00000280
 /*    UPDATE THE STATISTICS FILE WITH INFORMAATIONS                  */00000290
 /*                                                                   */00000300
 /*     - HOWMANY TOTAL 'GRUNNBLANKETER' ARE REGISTERED IN A DAY      */00000310
 /*     - TYPE WISE                                                   */00000320
 /*     - HOWMANY 'GRUNNBLANKETER' ARE REJECTED                       */00000330
 /*                                                                   */00000340
 /*                                                                   */00000350
 /*                                                                   */00000360
 /*                                                                   */00000370
 /* ***************************************************************** */00000380
 /*PROGRAMTILKNYTTING:                                                */00000390
 /* ********************                                              */00000400
 /*  PROGRAMMET INCLUDES I R0012001 -                                 */00000410
 /*                                                                   */00000420
 /* ***************************************************************** */00000430
 /*DATASETTOPPLYSNINGER:                                              */00000440
 /* ***********************                                           */00000450
 /*  INGEN                                                            */00000460
 /* ***************************************************************** */00000470
 /*FEILMELDINGER:                                                     */00000480
 /* *******************                                               */00000490
 /*  INGEN                                                            */00000500
 /* ***************************************************************** */00000510
 /* ***************************************************************** */00000520
 %PAGE;                                                                 00000530
                                                                        00000540
   %INCLUDE P0012004;                                                   00000550
                                                                        00000560
   DCL S_MELDNR      PIC'9';                                            00000570
   DCL NOR_INFO      CHAR (1);                                          00000580
   DCL BRUK_LOGG     POINTER;                                           00000590
                                                                        00000600
 DCL 01 BRUKERINFO_REC,                                                 00000610
        02 FNR                  PIC '(11)9',                            00000620
        02 BLANKET_TYPE         CHAR (2)   ,                            00000630
        02 TERMINAL_NR          CHAR (4)   ,                            00000640
        02 BRUKER_ID            CHAR (8)   ,                            00000650
        02 FILLER               CHAR (5)   ,                            00000660
        02 DATO                 PIC '(6)9' ,                            00000670
        02 TID                  PIC '(7)9' ,      /* HHHMMSS  */        00000680
        02 KJORINGS_TYPE        CHAR (1)   ,                            00000690
        02 FIL1                 CHAR (06)  ;                            00000700
                                                                        00000710
  DCL  HJELP_TID         FIXED DEC(7,0);                                00000720
                                                                        00000730
                                                                        00000740
 UPDATE_STATISTIKK_REG:  PROC(S_STYREKODE);                             00000750
 DCL S_STYREKODE   CHAR (2);                                            00000760
                                                                        00000770
      CALL SKRIV_BRUKER_ID;                                             00000780
      S_MELDNR = 0;                                                     00000790
      CALL LESE_STATISTIKK_REG;                                         00000800
                                                                        00000810
      IF  S_MELDNR = 9 THEN                                             00000820
                        GOTO UPDATE_99;                                 00000830
                                                                        00000840
      IF FUNKSJONSKODE = 'V' THEN                                       00000850
         VENTE_TRANS_BL = VENTE_TRANS_BL + 1;                           00000860
                                                                        00000870
      CALL LES_TKNR;              /* BESTAME INFO OG NOR TYGDEKONTOR */ 00000880
                                                                        00000890
      SELECT(S_STYREKODE);                                              00000900
                                                                        00000910
         WHEN ('AP', 'A1' )                                             00000920
            DO;                                                         00000930
               IF STATISK_MELD = 0   THEN                               00000940
                 DO;                                                    00000950
                  IF NOR_INFO    = ' '        THEN                      00000960
                      BLANK_AVVIST.GRUNNBL_AP =                         00000970
                                BLANK_AVVIST.GRUNNBL_AP + 1;            00000980
                                                                        00000990
                  IF NOR_INFO    = 'I'        THEN                      00001000
                     BLANK_MOTTATT_I.GRUNNBL_AP =                       00001010
                                BLANK_MOTTATT_I.GRUNNBL_AP + 1;         00001020
                  IF NOR_INFO    = 'N'        THEN                      00001030
                     BLANK_MOTTATT_N.GRUNNBL_AP =                       00001040
                                BLANK_MOTTATT_N.GRUNNBL_AP + 1;         00001050
              END;                                                      00001060
               ELSE                                                     00001070
                  BLANK_AVVIST.GRUNNBL_AP =                             00001080
                                BLANK_AVVIST.GRUNNBL_AP + 1;            00001090
            END;                                                        00001100
                                                                        00001110
         WHEN ('AF', 'KF' )                                             00001120
            DO;                                                         00001130
               IF STATISK_MELD = 0   THEN                               00001140
                 DO;                                                    00001150
                  IF NOR_INFO    = ' '        THEN                      00001160
                      BLANK_AVVIST.GRUNNBL_AF =                         00001170
                                BLANK_AVVIST.GRUNNBL_AF + 1;            00001180
                                                                        00001190
                  IF NOR_INFO    = 'I'        THEN                      00001200
                     BLANK_MOTTATT_I.GRUNNBL_AF =                       00001210
                                BLANK_MOTTATT_I.GRUNNBL_AF + 1;         00001220
                  IF NOR_INFO    = 'N'        THEN                      00001230
                     BLANK_MOTTATT_N.GRUNNBL_AF =                       00001240
                                BLANK_MOTTATT_N.GRUNNBL_AF + 1;         00001250
              END;                                                      00001260
               ELSE                                                     00001270
                  BLANK_AVVIST.GRUNNBL_AF =                             00001280
                                BLANK_AVVIST.GRUNNBL_AF + 1;            00001290
            END;                                                        00001300
                                                                        00001310
         WHEN ('UP' , 'U2', 'U3')                                       00001320
            DO;                                                         00001330
               IF STATISK_MELD = 0   THEN                               00001340
                 DO;                                                    00001350
                  IF NOR_INFO    = ' '        THEN                      00001360
                      BLANK_AVVIST.GRUNNBL_UP =                         00001370
                                BLANK_AVVIST.GRUNNBL_UP + 1;            00001380
                                                                        00001390
                  IF NOR_INFO    = 'I'        THEN                      00001400
                     BLANK_MOTTATT_I.GRUNNBL_UP =                       00001410
                                BLANK_MOTTATT_I.GRUNNBL_UP + 1;         00001420
                  IF NOR_INFO    = 'N'        THEN                      00001430
                     BLANK_MOTTATT_N.GRUNNBL_UP =                       00001440
                                BLANK_MOTTATT_N.GRUNNBL_UP + 1;         00001450
              END;                                                      00001460
               ELSE                                                     00001470
                  BLANK_AVVIST.GRUNNBL_UP =                             00001480
                                BLANK_AVVIST.GRUNNBL_UP + 1;            00001490
            END;                                                        00001500
                                                                        00001510
         WHEN ('EP', 'E3' , 'EE' )                                      00001520
            DO;                                                         00001530
               IF STATISK_MELD = 0   THEN                               00001540
                 DO;                                                    00001550
                  IF NOR_INFO    = ' '        THEN                      00001560
                      BLANK_AVVIST.GRUNNBL_EP =                         00001570
                                BLANK_AVVIST.GRUNNBL_EP + 1;            00001580
                                                                        00001590
                  IF NOR_INFO    = 'I'        THEN                      00001600
                     BLANK_MOTTATT_I.GRUNNBL_EP =                       00001610
                                BLANK_MOTTATT_I.GRUNNBL_EP + 1;         00001620
                  IF NOR_INFO    = 'N'        THEN                      00001630
                     BLANK_MOTTATT_N.GRUNNBL_EP =                       00001640
                                BLANK_MOTTATT_N.GRUNNBL_EP + 1;         00001650
              END;                                                      00001660
               ELSE                                                     00001670
                  BLANK_AVVIST.GRUNNBL_EP =                             00001680
                                BLANK_AVVIST.GRUNNBL_EP + 1;            00001690
            END;                                                        00001700
                                                                        00001710
         WHEN ('EF', 'E4' )                                             00001720
            DO;                                                         00001730
               IF STATISK_MELD = 0   THEN                               00001740
                 DO;                                                    00001750
                  IF NOR_INFO    = ' '        THEN                      00001760
                      BLANK_AVVIST.GRUNNBL_EF =                         00001770
                                BLANK_AVVIST.GRUNNBL_EF + 1;            00001780
                                                                        00001790
                  IF NOR_INFO    = 'I'        THEN                      00001800
                     BLANK_MOTTATT_I.GRUNNBL_EF =                       00001810
                                BLANK_MOTTATT_I.GRUNNBL_EF + 1;         00001820
                  IF NOR_INFO    = 'N'        THEN                      00001830
                     BLANK_MOTTATT_N.GRUNNBL_EF =                       00001840
                                BLANK_MOTTATT_N.GRUNNBL_EF + 1;         00001850
              END;                                                      00001860
               ELSE                                                     00001870
                  BLANK_AVVIST.GRUNNBL_EF =                             00001880
                                BLANK_AVVIST.GRUNNBL_EF + 1;            00001890
            END;                                                        00001900
                                                                        00001910
         WHEN ('BP', 'B6' )                                             00001920
            DO;                                                         00001930
               IF STATISK_MELD = 0   THEN                               00001940
                 DO;                                                    00001950
                  IF NOR_INFO    = ' '        THEN                      00001960
                      BLANK_AVVIST.GRUNNBL_BP =                         00001970
                                BLANK_AVVIST.GRUNNBL_BP + 1;            00001980
                                                                        00001990
                  IF NOR_INFO    = 'I'        THEN                      00002000
                     BLANK_MOTTATT_I.GRUNNBL_BP =                       00002010
                                BLANK_MOTTATT_I.GRUNNBL_BP + 1;         00002020
                  IF NOR_INFO    = 'N'        THEN                      00002030
                     BLANK_MOTTATT_N.GRUNNBL_BP =                       00002040
                                BLANK_MOTTATT_N.GRUNNBL_BP + 1;         00002050
              END;                                                      00002060
               ELSE                                                     00002070
                  BLANK_AVVIST.GRUNNBL_BP =                             00002080
                                BLANK_AVVIST.GRUNNBL_BP + 1;            00002090
            END;                                                        00002100
                                                                        00002110
         WHEN ('FB', 'F5' )                                             00002120
            DO;                                                         00002130
               IF STATISK_MELD = 0   THEN                               00002140
                 DO;                                                    00002150
                  IF NOR_INFO    = ' '        THEN                      00002160
                      BLANK_AVVIST.GRUNNBL_FB =                         00002170
                                BLANK_AVVIST.GRUNNBL_FB + 1;            00002180
                                                                        00002190
                  IF NOR_INFO    = 'I'        THEN                      00002200
                     BLANK_MOTTATT_I.GRUNNBL_FB =                       00002210
                                BLANK_MOTTATT_I.GRUNNBL_FB + 1;         00002220
                  IF NOR_INFO    = 'N'        THEN                      00002230
                     BLANK_MOTTATT_N.GRUNNBL_FB =                       00002240
                                BLANK_MOTTATT_N.GRUNNBL_FB + 1;         00002250
              END;                                                      00002260
               ELSE                                                     00002270
                  BLANK_AVVIST.GRUNNBL_FB =                             00002280
                                BLANK_AVVIST.GRUNNBL_FB + 1;            00002290
            END;                                                        00002300
                                                                        00002310
         WHEN ('FT', 'F7', 'FO' )                                       00002320
            DO;                                                         00002330
               IF STATISK_MELD = 0   THEN                               00002340
                 DO;                                                    00002350
                  IF NOR_INFO    = ' '        THEN                      00002360
                      BLANK_AVVIST.GRUNNBL_FT =                         00002370
                                BLANK_AVVIST.GRUNNBL_FT + 1;            00002380
                                                                        00002390
                  IF NOR_INFO    = 'I'        THEN                      00002400
                     BLANK_MOTTATT_I.GRUNNBL_FT =                       00002410
                                BLANK_MOTTATT_I.GRUNNBL_FT + 1;         00002420
                  IF NOR_INFO    = 'N'        THEN                      00002430
                     BLANK_MOTTATT_N.GRUNNBL_FT =                       00002440
                                BLANK_MOTTATT_N.GRUNNBL_FT + 1;         00002450
              END;                                                      00002460
               ELSE                                                     00002470
                  BLANK_AVVIST.GRUNNBL_FT =                             00002480
                                BLANK_AVVIST.GRUNNBL_FT + 1;            00002490
            END;                                                        00002500
                                                                        00002510
         WHEN ('US')                                                    00002520
            DO;                                                         00002530
               IF STATISK_MELD = 0   THEN                               00002540
                  DO;                                                   00002550
                  IF NOR_INFO    = ' '        THEN                      00002560
                      BLANK_AVVIST.GRUNNBL_US =                         00002570
                                BLANK_AVVIST.GRUNNBL_US + 1;            00002580
                                                                        00002590
                  IF NOR_INFO    = 'I'        THEN                      00002600
                     BLANK_MOTTATT_I.GRUNNBL_US =                       00002610
                                BLANK_MOTTATT_I.GRUNNBL_US + 1;         00002620
                  IF NOR_INFO    = 'N'        THEN                      00002630
                     BLANK_MOTTATT_N.GRUNNBL_US =                       00002640
                                BLANK_MOTTATT_N.GRUNNBL_US + 1;         00002650
             END;                                                       00002660
               ELSE                                                     00002670
                  BLANK_AVVIST.GRUNNBL_US =                             00002680
                                BLANK_AVVIST.GRUNNBL_US + 1;            00002690
            END;                                                        00002700
                                                                        00002710
         WHEN ('E1','EN')                                               00002720
            DO;                                                         00002730
               IF STATISK_MELD = 0   THEN                               00002740
                  DO;                                                   00002750
                    IF NOR_INFO    = ' '        THEN                    00002760
                       BLANK_AVVIST.GRUNNBL_E1 =                        00002770
                                BLANK_AVVIST.GRUNNBL_E1 + 1;            00002780
                                                                        00002790
                    IF NOR_INFO    = 'I'        THEN                    00002800
                       BLANK_MOTTATT_I.GRUNNBL_E1 =                     00002810
                                BLANK_MOTTATT_I.GRUNNBL_E1 + 1;         00002820
                    IF NOR_INFO    = 'N'        THEN                    00002830
                       BLANK_MOTTATT_N.GRUNNBL_E1 =                     00002840
                                BLANK_MOTTATT_N.GRUNNBL_E1 + 1;         00002850
                  END;                                                  00002860
               ELSE                                                     00002870
                  BLANK_AVVIST.GRUNNBL_E1 =                             00002880
                                BLANK_AVVIST.GRUNNBL_E1 + 1;            00002890
            END;                                                        00002900
                                                                        00002910
         WHEN ('E2')                                                    00002920
            DO;                                                         00002930
               IF STATISK_MELD = 0   THEN                               00002940
                  DO;                                                   00002950
                    IF NOR_INFO    = ' '        THEN                    00002960
                       BLANK_AVVIST.GRUNNBL_E2 =                        00002970
                                BLANK_AVVIST.GRUNNBL_E2 + 1;            00002980
                                                                        00002990
                    IF NOR_INFO    = 'I'        THEN                    00003000
                       BLANK_MOTTATT_I.GRUNNBL_E2 =                     00003010
                                BLANK_MOTTATT_I.GRUNNBL_E2 + 1;         00003020
                    IF NOR_INFO    = 'N'        THEN                    00003030
                       BLANK_MOTTATT_N.GRUNNBL_E2 =                     00003040
                                BLANK_MOTTATT_N.GRUNNBL_E2 + 1;         00003050
                  END;                                                  00003060
               ELSE                                                     00003070
                    BLANK_AVVIST.GRUNNBL_E2 =                           00003080
                                BLANK_AVVIST.GRUNNBL_E2 + 1;            00003090
            END;                                                        00003100
                                                                        00003110
         WHEN ('O1')                                                    00003120
            DO;                                                         00003130
               IF STATISK_MELD = 0   THEN                               00003140
                  DO;                                                   00003150
                    IF NOR_INFO    = ' '        THEN                    00003160
                       BLANK_AVVIST.GRUNNBL_O1 =                        00003170
                                BLANK_AVVIST.GRUNNBL_O1 + 1;            00003180
                                                                        00003190
                    IF NOR_INFO    = 'I'        THEN                    00003200
                       BLANK_MOTTATT_I.GRUNNBL_O1 =                     00003210
                                BLANK_MOTTATT_I.GRUNNBL_O1 + 1;         00003220
                    IF NOR_INFO    = 'N'        THEN                    00003230
                       BLANK_MOTTATT_N.GRUNNBL_O1 =                     00003240
                                BLANK_MOTTATT_N.GRUNNBL_O1 + 1;         00003250
                  END;                                                  00003260
               ELSE                                                     00003270
                  BLANK_AVVIST.GRUNNBL_O1 =                             00003280
                                BLANK_AVVIST.GRUNNBL_O1 + 1;            00003290
            END;                                                        00003300
                                                                        00003310
         WHEN ('O2')                                                    00003320
            DO;                                                         00003330
               IF STATISK_MELD = 0   THEN                               00003340
                  DO;                                                   00003350
                    IF NOR_INFO    = ' '        THEN                    00003360
                       BLANK_AVVIST.GRUNNBL_O2 =                        00003370
                                BLANK_AVVIST.GRUNNBL_O2 + 1;            00003380
                                                                        00003390
                    IF NOR_INFO    = 'I'        THEN                    00003400
                       BLANK_MOTTATT_I.GRUNNBL_O2 =                     00003410
                                BLANK_MOTTATT_I.GRUNNBL_O2 + 1;         00003420
                    IF NOR_INFO    = 'N'        THEN                    00003430
                       BLANK_MOTTATT_N.GRUNNBL_O2 =                     00003440
                                BLANK_MOTTATT_N.GRUNNBL_O2 + 1;         00003450
                  END;                                                  00003460
               ELSE                                                     00003470
                    BLANK_AVVIST.GRUNNBL_O2 =                           00003480
                                BLANK_AVVIST.GRUNNBL_O2 + 1;            00003490
            END;                                                        00003500
                                                                        00003510
                                                                        00003520
         WHEN ('UF')                                                    00003530
            DO;                                                         00003540
               IF STATISK_MELD = 0   THEN                               00003550
                  DO;                                                   00003560
                    IF NOR_INFO    = ' '        THEN                    00003570
                       BLANK_AVVIST.GRUNNBL_UF =                        00003580
                                BLANK_AVVIST.GRUNNBL_UF + 1;            00003590
                                                                        00003600
                    IF NOR_INFO    = 'I'        THEN                    00003610
                       BLANK_MOTTATT_I.GRUNNBL_UF =                     00003620
                                BLANK_MOTTATT_I.GRUNNBL_UF + 1;         00003630
                    IF NOR_INFO    = 'N'        THEN                    00003640
                       BLANK_MOTTATT_N.GRUNNBL_UF =                     00003650
                                BLANK_MOTTATT_N.GRUNNBL_UF + 1;         00003660
                  END;                                                  00003670
               ELSE                                                     00003680
                  BLANK_AVVIST.GRUNNBL_UF =                             00003690
                                BLANK_AVVIST.GRUNNBL_UF + 1;            00003700
            END;                                                        00003710
                                                                        00003720
         WHEN ('XX')                                                    00003730
            DO;                                                         00003740
            END;                                                        00003750
         OTHERWISE                                                      00003760
            DO;                                                         00003770
               IF STATISK_MELD = 0   THEN                               00003780
                  DO;                                                   00003790
                    IF NOR_INFO    = ' '        THEN                    00003800
                       BLANK_AVVIST.GRUNNBL_ANDRE =                     00003810
                                BLANK_AVVIST.GRUNNBL_ANDRE + 1;         00003820
                                                                        00003830
                    IF NOR_INFO    = 'I'        THEN                    00003840
                       BLANK_MOTTATT_I.GRUNNBL_ANDRE =                  00003850
                                BLANK_MOTTATT_I.GRUNNBL_ANDRE + 1;      00003860
                    IF NOR_INFO    = 'N'        THEN                    00003870
                       BLANK_MOTTATT_N.GRUNNBL_ANDRE =                  00003880
                                BLANK_MOTTATT_N.GRUNNBL_ANDRE + 1;      00003890
                  END;                                                  00003900
               ELSE                                                     00003910
                  BLANK_AVVIST.GRUNNBL_ANDRE =                          00003920
                                BLANK_AVVIST.GRUNNBL_ANDRE + 1;         00003930
            END;                                                        00003940
      END;                    /*     END SELECT         */              00003950
                                                                        00003960
                                                                        00003970
     CALL SKRIV_STATISTIKK_REG;                                         00003980
     DIV_PARAM_OMR.STATISK_MELD = 0 ;                                   00003990
                                                                        00004000
                                                                        00004010
   UPDATE_99:                                                           00004020
                                                                        00004030
     S_MELDNR = 0;                                                      00004040
                                                                        00004050
   END UPDATE_STATISTIKK_REG;                                           00004060
                                                                        00004070
                                                                        00004080
   LESE_STATISTIKK_REG: PROC;                                           00004090
   DCL C_DATO          PIC'(6)9' INIT (0);                              00004100
      C_DATO = DATE;                                                    00004110
                                                                        00004120
     EXEC CICS HANDLE CONDITION                                         00004130
               ERROR (ERROR)                                            00004140
               NOTFND(NOTFOUND);                                        00004150
                                                                        00004160
     EXEC CICS READ DATASET('STASTIK')                                  00004170
                    INTO (STATISTIKK_REC)                               00004180
                    RIDFLD(C_DATO)                                      00004190
                    UPDATE;                                             00004200
     GO TO LESE_99;                                                     00004210
                                                                        00004220
  NOTFOUND:                                                             00004230
     EXEC CICS HANDLE CONDITION                                         00004240
               ERROR (ERROR);                                           00004250
                                                                        00004260
   /*  STATISTIKK_REC = '';    */                                       00004270
     EDB_SYSTEM     = 'O';                                              00004280
     STATISTIKK_DATO_ÅMD = C_DATO;                                      00004290
                                                                        00004300
                                                                        00004310
     EXEC CICS WRITE DATASET('STASTIK')                                 00004320
                    FROM (STATISTIKK_REC)                               00004330
                    RIDFLD(STATISTIKK_DATO_ÅMD);                        00004340
                                                                        00004350
                                                                        00004360
     EXEC CICS READ DATASET('STASTIK')                                  00004370
                    INTO (STATISTIKK_REC)                               00004380
                    RIDFLD(C_DATO)                                      00004390
                    UPDATE;                                             00004400
     GO TO LESE_99;                                                     00004410
                                                                        00004420
  ERROR:                                                                00004430
     S_MELDNR = 9;                                                      00004440
                                                                        00004450
                                                                        00004460
  LESE_99:                                                              00004470
  END  LESE_STATISTIKK_REG;                                             00004480
                                                                        00004490
  SKRIV_STATISTIKK_REG: PROC;                                           00004500
                                                                        00004510
     EXEC CICS HANDLE CONDITION                                         00004520
               ERROR (ERROR_UPDATE)                                     00004530
               DUPREC(DUPLICAT_REC);                                    00004540
                                                                        00004550
     EXEC CICS REWRITE DATASET('STASTIK')                               00004560
                    FROM (STATISTIKK_REC);                              00004570
           /*       RIDFLD(C_DATO);          */                         00004580
                                                                        00004590
     GO TO  UPDATE_99;                                                  00004600
                                                                        00004610
  DUPLICAT_REC:                                                         00004620
     S_MELDNR = 9;                                                      00004630
                                                                        00004640
     GO TO  UPDATE_99;                                                  00004650
                                                                        00004660
  ERROR_UPDATE:                                                         00004670
     S_MELDNR = 9;                                                      00004680
                                                                        00004690
                                                                        00004700
  UPDATE_99:                                                            00004710
                                                                        00004720
                                                                        00004730
  END SKRIV_STATISTIKK_REG;                                             00004740
                                                                        00004750
  LES_TKNR: PROC;                                                       00004760
                                                                        00004770
                                                                        00004780
   DCL                                                                  00004790
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00004800
      KEY_PEKER                  POINTER;                               00004810
  DCL W_TKNR                     PIC '9999';                            00004820
 %INCLUDE   P0019953;                                                   00004830
 %SKIP;                                                                 00004840
      W_TKNR       = DIV_TKNR ;                                         00004850
      KEY_PEKER    = ADDR(W_TKNR);                                      00004860
                                                                        00004870
            EXEC CICS HANDLE CONDITION NOTFND(NOTFND);                  00004880
            EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)          00004890
                                               INTO(TKNRTAB);           00004900
            GOTO TKNR_UT;                                               00004910
        NOTFND:                                                         00004920
            NOR_INFO    = ' ';                                          00004930
            GOTO TKNR_99;                                               00004940
        TKNR_UT:                                                        00004950
          NOR_INFO    = 'N';                                            00004960
          IF INFO_NOR = 'I' THEN                                        00004970
              NOR_INFO    = 'I';                                        00004980
                                                                        00004990
  TKNR_99:                                                              00005000
  END LES_TKNR;                                                         00005010
                                                                        00005020
  SKRIV_BRUKER_ID: PROC;                                                00005030
                                                                        00005040
        BRUKERINFO_REC.FNR           = DIV_PARAM_OMR.SEARCH_FNR;        00005050
        BRUKERINFO_REC.BLANKET_TYPE  = STYRINGS_OMR.STYREKODE;          00005060
        BRUKERINFO_REC.BRUKER_ID     = DIV_PARAM_OMR.BRUKER_ID;         00005070
        BRUKERINFO_REC.DATO          = DATE;                            00005080
                                                                        00005090
        HJELP_TID                    = EIBTIME;                         00005100
        BRUKERINFO_REC.TID           = HJELP_TID;                       00005110
        BRUKERINFO_REC.KJORINGS_TYPE = STYRINGS_OMR.FUNKSJONSKODE   ;   00005120
        BRUKERINFO_REC.TERMINAL_NR   = EIBTRMID;                        00005130
     /* BRUKERINFO_REC.BRUKER_NAVN   = DIV_PARAM_OMR.BRUKER_PASS; */    00005140
                                                                        00005150
        IF BRUKERINFO_REC.BLANKET_TYPE  ^= 'US' THEN                    00005160
           EXEC CICS WRITE DATASET('BRUKINFO')                          00005170
                    FROM (BRUKERINFO_REC)                               00005180
                    RIDFLD(BRUK_LOGG) RBA;                              00005190
  END SKRIV_BRUKER_ID;                                                  00005200
