 /*       SIST ENDRET 14/08-95 09.14.38 AV   HLB0310                  */00000000
 /*       SIST ENDRET 30/11-83 12.58.33 AV   LUNDEBY                  */00000010
 /*       SIST ENDRET 18/11-83 14.08.32 AV   LUNDEBY                  */00000020
 /*       SIST ENDRET 15/09-83 07.44.24 AV   LUNDEBY                  */00000030
 /*       SIST ENDRET 20/12-82 10.17.27 AV   LUNDEBY                  */00000040
                                                                        00000050
                                                                        00000060
 %PAGE;                                                                 00000070
 /* ************************************************************ */     00000080
 /*                                                              */     00000090
 /*  PROCDURE FOR Å SORTERE TRANS_LISTE MED SEKVENS PÅ           */     00000100
 /*                                                              */     00000110
 /*           VIRKNINGSDATO OG TRANSKODE-PRIORITET               */     00000120
 /*                                                              */     00000130
 /*                                                              */     00000140
 /*      START_POS ANGIR DEN FØRSTE  POSISJON I TRANS_LISTE      */     00000150
 /*      SOM SKAL SORTERES . DE EVENTUELLE TRANSER SOM LIGGER    */     00000160
 /*      FØR ER BEHANDLET TIDLIGERE .                            */     00000170
 /*                                                              */     00000180
 /* ************************************************************ */     00000190
                                                                        00000200
 P_SORTER_TRANS_LISTE_OMR:                                              00000210
   PROC   ( START_POS )  ;                                              00000220
                                                                        00000230
   DCL    ( I,J,K,START_POS,PRIOR_KODE,                                 00000240
            WORK_TRANS_LISTE_PRIOR_KODE,                                00000250
            TRANS_LISTE_LINJE_PRIOR_KODE)          FIXED BIN (15);      00000260
                                                                        00000270
                                                                        00000280
   DO  I   =  START_POS  TO  4                                          00000290
       WHILE (TRANS_LISTE_LINJE.VIRKNINGSDATO(I) > 0);                  00000300
                                                                        00000310
       WORK_TRANS_LISTE   =  TRANS_LISTE_LINJE (I);                     00000320
                                                                        00000330
       DO J = I + 1 TO 5 WHILE (TRANS_LISTE_LINJE.VIRKNINGSDATO(J) > 0);00000340
                                                                        00000350
          CALL P010_SETT_PRIOR_KODE (WORK_TRANS_LISTE.BLANKETTYPE)     ;00000360
          WORK_TRANS_LISTE_PRIOR_KODE   =  PRIOR_KODE                  ;00000370
                                                                        00000380
          CALL P010_SETT_PRIOR_KODE (TRANS_LISTE_LINJE.BLANKETTYPE (J));00000390
          TRANS_LISTE_LINJE_PRIOR_KODE  =  PRIOR_KODE                  ;00000400
                                                                        00000410
          IF ( F_SNU_DATO (  WORK_TRANS_LISTE.VIRKNINGSDATO    )   >    00000420
               F_SNU_DATO ( TRANS_LISTE_LINJE.VIRKNINGSDATO (J)) ) !    00000430
                                                                        00000440
             ( F_SNU_DATO (  WORK_TRANS_LISTE.VIRKNINGSDATO    )   =    00000450
               F_SNU_DATO ( TRANS_LISTE_LINJE.VIRKNINGSDATO (J))   &    00000460
               WORK_TRANS_LISTE_PRIOR_KODE                         >    00000470
               TRANS_LISTE_LINJE_PRIOR_KODE                      )  THEN00000480
             DO;                                                        00000490
                WORK_TRANS_LISTE = TRANS_LISTE_LINJE      (J);          00000500
                K = J;                                                  00000510
             END;                                                       00000520
                                                                        00000530
       END;  /***   DO J = I + 1 TO 5   ***/                            00000540
                                                                        00000550
       CALL P010_SETT_PRIOR_KODE (WORK_TRANS_LISTE.BLANKETTYPE)     ;   00000560
       WORK_TRANS_LISTE_PRIOR_KODE   =  PRIOR_KODE                  ;   00000570
                                                                        00000580
       CALL P010_SETT_PRIOR_KODE (TRANS_LISTE_LINJE.BLANKETTYPE (I));   00000590
       TRANS_LISTE_LINJE_PRIOR_KODE  =  PRIOR_KODE                  ;   00000600
                                                                        00000610
       IF ( F_SNU_DATO (   WORK_TRANS_LISTE.VIRKNINGSDATO    )   <      00000620
            F_SNU_DATO (  TRANS_LISTE_LINJE.VIRKNINGSDATO (I)) )    !   00000630
                                                                        00000640
          ( F_SNU_DATO (  WORK_TRANS_LISTE.VIRKNINGSDATO    )    =      00000650
            F_SNU_DATO ( TRANS_LISTE_LINJE.VIRKNINGSDATO (I))    &      00000660
            WORK_TRANS_LISTE_PRIOR_KODE                          <      00000670
            TRANS_LISTE_LINJE_PRIOR_KODE                       )    THEN00000680
          DO;                                                           00000690
             TRANS_LISTE_LINJE (K)  =  TRANS_LISTE_LINJE (I);           00000700
             TRANS_LISTE_LINJE (I)  =  WORK_TRANS_LISTE     ;           00000710
          END;                                                          00000720
                                                                        00000730
    END;  /***   DO I = 1 TO 4   ***/                                   00000740
                                                                        00000750
                                                                        00000760
                                                                        00000770
    /* ************************************************************ */  00000780
    /* HER SETTES PRIORITETS-KODEN.                                 */  00000790
    /* ************************************************************ */  00000800
                                                                        00000810
    P010_SETT_PRIOR_KODE:                                               00000820
      PROC   ( BL_TYPE ) ;                                              00000830
                                                                        00000840
      DCL      BL_TYPE                 CHAR  (2)  ;                     00000850
                                                                        00000860
                                                                        00000870
      SELECT ( BL_TYPE ) ;                                              00000880
                                                                        00000890
        WHEN ('O1' , 'O2')                                              00000900
             PRIOR_KODE     =   1             ;                         00000910
                                                                        00000920
  /*    WHEN ('E1'       )        ENDRET 0295 - HL */                   00000930
        WHEN ('E1' , 'EN')                                              00000940
             PRIOR_KODE     =   2             ;                         00000950
                                                                        00000960
        OTHERWISE                                                       00000970
             PRIOR_KODE     =   3             ;                         00000980
      END;                                                              00000990
                                                                        00001000
    END P010_SETT_PRIOR_KODE;                                           00001010
                                                                        00001020
                                                                        00001030
 END P_SORTER_TRANS_LISTE_OMR;                                          00001040
                                                                        00001050
                                                                        00001060
