 /*       SIST ENDRET 28/09-82 07.24.52 AV   FARVIK                   */00000000
  F_SEKSTISJU_ÅR:                                                       00000010
      PROC(FNR) RETURNS(PIC'(4)9');                                     00000020
          DCL                                                           00000030
             FNR            PIC'(11)9';                                 00000040
          DCL                                                           00000050
             FYLT_SEKSTISJU PIC'(4)9';                                  00000060
          DCL                                                           00000070
             1 FØDSELSNUMMER DEF FNR,                                   00000080
             2 DAG          PIC'99',                                    00000090
             2 MND          PIC'99',                                    00000100
             2 AAR          PIC'99',                                    00000110
             2 PERSNR,                                                  00000120
               3 ÅRHUNDRE   PIC'999',                                   00000130
               3 REST       PIC'99';                                    00000140
      IF AAR >= 33 THEN                                                 00000150
         FYLT_SEKSTISJU = (((AAR + 67) - 100 ) * 100) + MND;            00000160
      ELSE                                                              00000170
         FYLT_SEKSTISJU = ((AAR + 67) * 100) + MND;                     00000180
      RETURN(FYLT_SEKSTISJU);                                           00000190
  END F_SEKSTISJU_ÅR;                                                   00000200
