 /*       SIST ENDRET 28/09-94 12.31.12 AV   JDA0310                  */00000000
 /*       SIST ENDRET 16/12-93 14.33.23 AV   TRUDE                    */00000010
 /*       SIST ENDRET 01/12-93 11.34.54 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 28/09-92 10.27.29 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 28/07-92 11.14.53 AV   DYBVIK                   */00000040
 /* ***************************************************************** */00000050
 /* IDENTIFIKASJON                                                    */00000060
 /*     R0019F05 - SPECIAL PROGRAM MED ENDERING                       */00000070
 /*                                   - CICS-HOVEDPROG I PLI          */00000080
 /*     PROGRAMMERER: SATISH  DEC 92                                  */00000090
 /* HENSIKT                                                           */00000100
 /*     SE FORKLARING NEDENFOR.                                       */00000110
 /* ***************************************************************** */00000120
 /*                                                                   */00000130
 /*                                                                   */00000140
 /*                                                                   */00000150
 /* THIS PROGRAM IS A SPECIAL COPY OF R0019F01 AND IS FOR ONE TIME ** */00000160
 /* RUN  WITH SPECIAL CHANGES.                                        */00000170
 /*                                                                   */00000180
 /* ***************************************************************** */00000190
 /* ***************************************************************** */00000200
 /* ***************************************************************** */00000210
 /*                                                                   */00000220
 /*        PROGRAMMET LESER SEKVENSIELT GJENNOM PEPO-BASEN.           */00000230
 /*           NÅR EN PERSON MED                                       */00000240
 /*   1.      ALL SOM ER FØDT I 1923   &                             */ 00000250
 /*           PINNTEKT.PI (SøKER_IND, 92) > G_V(92)   &               */00000260
 /*           ALDERSP.PÅ-ETTER91(SØKER_IND) = 0                       */00000270
 /*                                                                   */00000280
 /*    BEREGNET NED AUTOBEREGNING                                     */00000290
 /*                SKRIVE RESULTAT ER SKRIVET TILL DATA BASE.         */00000300
 /*                STØNADSBREV-BASEN OG TRANS-STATISTIKK-BASEN.       */00000310
 /*                REC FOR SKRIVING AV INFORMASJON TIL PENSJONISTEN   */00000320
 /*                                                                   */00000330
 /*    LINK TIL R0014001                                              */00000340
 /*    LINK TIL R0017001                                              */00000350
 /* ***************************************************************** */00000360
                                                                        00000370
 R0019F: PROC(COMMAREA_PEKER)                  OPTIONS (MAIN);          00000380
                                                                        00000390
                                                                        00000400
 %PAGE;                                                                 00000410
 %INCLUDE P0019906;               /* TRANS_OPPL_OMR                   */00000420
 %PAGE;                                                                 00000430
 %INCLUDE P0019908;               /* KOM_OMR                          */00000440
 %PAGE;                                                                 00000450
 %INCLUDE P0019910;               /* STYRINGSOMRÅDE                   */00000460
 %PAGE;                                                                 00000470
 %INCLUDE P0019912;               /* DIV_PARAM_OMR                    */00000480
 %PAGE;                                                                 00000490
 %INCLUDE P0014009;               /* POTALL_OPPL                      */00000500
 %PAGE;                                                                 00000510
 %INCLUDE P0019924;               /* G_V_TAB                          */00000520
 %PAGE;                                                                 00000530
 %INCLUDE P0019925;               /* G_TAB                            */00000540
 %PAGE;                                                                 00000550
 %INCLUDE P0019014;               /* FNR_TAB                          */00000560
 %PAGE;                                                                 00000570
 %INCLUDE S0019F;                 /* MAP TIL ALDERSKONVERTERING       */00000580
 %PAGE;                                                                 00000590
   DCL 1 B00     BASED (B00_PEKER),                                     00000600
 %INCLUDE P0019921;                                                     00000610
 %PAGE;                                                                 00000620
   DCL 1 B01     BASED (B01_PEKER),                                     00000630
 %INCLUDE P0019921;                                                     00000640
 %PAGE;                                                                 00000650
   DCL 1 B02     BASED (B02_PEKER),                                     00000660
 %INCLUDE P0019921;                                                     00000670
   DCL 1 WORK_TRANS_LISTE UNAL BASED (WORK_TRANS_LISTE_PEKER),          00000680
 %INCLUDE P0019911;                                                     00000690
                                                                        00000700
 %PAGE;                                                                 00000710
 %INCLUDE DFHBMSCA;                                                     00000720
 %PAGE;                                                                 00000730
 %INCLUDE DLIUIB;                                                       00000740
 %PAGE;                                                                 00000750
 %INCLUDE P0012002;   /* PCB - PEKER - OMR    */                        00000760
 %PAGE;                                                                 00000770
    DCL PLITDLI ENTRY;                                                  00000780
                                                                        00000790
    DCL 1 SEGMENTER,                                                    00000800
                                                                        00000810
           2 ROTSEGM,                                                   00000820
              3 FNR              FIXED DEC (11),                        00000830
              3 NAVN             CHAR(25),                              00000840
              3 TKNR             FIXED DEC (5),                         00000850
              3 SPROG            CHAR(1),                               00000860
              3 AI               FIXED DEC (5),                         00000870
              3 SPERRE           CHAR(1),                               00000880
                                                                        00000890
           2 STATUSSEGM,                                                00000900
              %INCLUDE P0019930;                                        00000910
                                                                        00000920
    DCL 1 TILKNSEGM,                                                    00000930
              %INCLUDE P0019931;                                        00000940
                                                                        00000950
    DCL 1 UFØRHISTSEGM,                                                 00000960
              %INCLUDE P0019935;                                        00000970
                                                                        00000980
    DCL 1 FORSISEGM,                                                    00000990
              %INCLUDE P0019965;                                        00001000
                                                                        00001010
    DCL 1 TRANHISTSEGM,                                                 00001020
                                                                        00001030
              4 XFNR              FIXED DEC (11),                       00001040
              4 XNAVN             CHAR(25),                             00001050
              4 XTKNR             FIXED DEC (5),                        00001060
              4 XSPROG            CHAR(1),                              00001070
              4 XAI               FIXED DEC (5),                        00001080
              4 XSPERRE           CHAR(1),                              00001090
              %INCLUDE P0019940;                                        00001100
                                                                        00001110
    DCL 1 RF1 BASED (RF1_PCB_PEKER),                                    00001120
 %INCLUDE P0012003;                                                     00001130
    DCL 1 RF4 BASED (RF4_PCB_PEKER),                                    00001140
 %INCLUDE P0012003;                                                     00001150
                                                                        00001160
    DCL EN   FIXED BIN (31) INIT (1);                                   00001170
    DCL TO   FIXED BIN (31) INIT (2);                                   00001180
    DCL TRE  FIXED BIN (31) INIT (3);                                   00001190
    DCL FIRE FIXED BIN (31) INIT (4);                                   00001200
    DCL FEM  FIXED BIN (31) INIT (5);                                   00001210
    DCL SEKS FIXED BIN (31) INIT (6);                                   00001220
                                                                        00001230
                                                                        00001240
    DCL 01 FNR_ÅM_DEF,                                                  00001250
         02  FNR_Å         PIC '99',                                    00001260
         02  FNR_M         PIC '99',                                    00001270
        01 FNR_ÅM   DEF FNR_ÅM_DEF   PIC '9999';                        00001280
                                                                        00001290
    DCL 01 W_UFT_DEF,                                                   00001300
         02  W_UFT_Å         PIC '99',                                  00001310
         02  W_UFT_M         PIC '99',                                  00001320
        01 W_UFT_ÅM   DEF W_UFT_DEF   PIC '9999';                       00001330
    DCL    W_ÅM                   PIC '9999' INIT (0);                  00001340
                                                                        00001350
    DCL 1 SSA_ROT_GU,                                                   00001360
           2 SSA_ROT_NAVN      CHAR(11) INIT ('RF0PERSN*D('),           00001370
           2 FELT1             CHAR(8)  INIT ('FNR     '),              00001380
           2 RELOOP1           CHAR(2)  INIT (' ='),                    00001390
           2 FNR               FIXED DEC (11),                          00001400
           2 HØYRE_PARENTES    CHAR(1)  INIT (')');                     00001410
                                                                        00001420
    DCL 1 SSA_ROT,                                                      00001430
           2 SSA_ROT_NAVN      CHAR(11) INIT ('RF0PERSN*D ');           00001440
                                                                        00001450
    DCL 1 SSA_STATUS,                                                   00001460
           2 SSA_STATUS_FELT   CHAR(11) INIT ('STATUS  *P('),           00001470
           2 FELT1             CHAR(8)  INIT ('STATKODE'),              00001480
           2 RELOOP1           CHAR(2)  INIT (' ='),                    00001490
           2 SSA_STATUS_KODE   CHAR(1)  INIT ('S'),                     00001500
           2 CONC              CHAR(1)  INIT ('&'),                     00001510
           2 FELT2             CHAR(8)  INIT ('STKODHST'),              00001520
           2 RELOOP2           CHAR(2)  INIT (' ='),                    00001530
           2 SSA_STATUS_HIST   CHAR(1)  INIT (' '),                     00001540
           2 HØYRE_PARENTES    CHAR(1)  INIT (')');                     00001550
                                                                        00001560
                                                                        00001570
    DCL SSA_UQUAL              CHAR(9)  INIT ('STATUS   ');             00001580
                                                                        00001590
 %PAGE;                                                                 00001600
                                                                        00001610
                                                                        00001620
    DCL 1 REC_TIL_OSLO_TKR,                                             00001630
          2 FNR                   PIC'(11)9',                           00001640
          2 NAVN                  CHAR(25),                             00001650
          2 TYPE                  PIC '9';                              00001660
                                                                        00001670
                                                                        00001680
    DCL COMMAREA_PEKER    POINTER;                                      00001690
    DCL BMSMAPBR          POINTER;                                      00001700
    DCL (UNSPEC,ADDR,VERIFY,SUBSTR,                                     00001710
         DATE,NULL, CSTG)      BUILTIN;                                 00001720
    DCL W_GRUNNBL_DATO    FIXED DEC (7);                                00001730
                                                                        00001740
    DCL W_FNR_TILKN     PIC '(11)9';                                    00001750
    DCL W_FNR_TILKN_ÅR   DEF  W_FNR_TILKN POS (5) PIC '99' ;            00001760
                                                                        00001770
                                                                        00001780
    DCL 01 OLARC,                                                       00001790
           02 FNR          PIC '(11)9',                                 00001800
           02 TKNR         PIC '(05)9',                                 00001810
           02 P_TYPE1      CHAR (01),                                   00001820
           02 P_TYPE2      CHAR (01),                                   00001830
           02 FIL1         CHAR (01) INIT (' '),                        00001840
           02 BUP_GML       PIC '99V99' INIT (0),                       00001850
           02 FIL2         CHAR (01) INIT (' '),                        00001860
           02 BUP_NY        PIC '99V99' INIT (0),                       00001870
           02 FIL3         CHAR (01) INIT (' '),                        00001880
           02 SPT_NY       PIC '99V99'       INIT (0),                  00001890
           02 FIL4         CHAR (01) INIT (' '),                        00001900
           02 TP_GML        PIC '(07)9'      INIT (0),                  00001910
           02 FIL5         CHAR (01) INIT (' '),                        00001920
           02 TP_GAR       PIC '(07)9' INIT  (0),                       00001930
           02 FIL6         CHAR (01) INIT (' '),                        00001940
           02 BUP_GML_EK    PIC '99V99'   INIT (0),                     00001950
           02 FIL7         CHAR (01) INIT (' '),                        00001960
           02 BUP_NY_EK     PIC '99V99' INIT (0),                       00001970
           02 FIL8         CHAR (01) INIT (' '),                        00001980
           02 SPT_NY_EK    PIC '99V99' INIT (0);                        00001990
                                                                        00002000
                                                                        00002010
    DCL DAGENS_DATO      CHAR (6)                                  ;    00002020
                                                                        00002030
    DCL DAGENS_DATO_ÅR   DEF  DAGENS_DATO POS (1) PIC '99'         ,    00002040
        DAGENS_DATO_MND  DEF  DAGENS_DATO POS (3) PIC '99'         ,    00002050
        DAGENS_DATO_DAG  DEF  DAGENS_DATO POS (5) PIC '99'         ;    00002060
                                                                        00002070
    DCL W_DATO           CHAR (6)                                  ;    00002080
                                                                        00002090
    DCL W_DATO_DAG       DEF  W_DATO      POS (1) PIC '99'         ,    00002100
        W_DATO_MND       DEF  W_DATO      POS (3) PIC '99'         ,    00002110
        W_DATO_ÅR        DEF  W_DATO      POS (5) PIC '99'         ;    00002120
                                                                        00002130
    DCL MELDING           CHAR(78) INIT((78)' ');                       00002140
    DCL MELD2             CHAR(78) INIT((78)' ');                       00002150
                                                                        00002160
    DCL AVBRUDD BIT(1) INIT ('0'B);                                     00002170
    DCL OK      BIT(1) INIT ('1'B);                                     00002180
                                                                        00002190
    DCL W01_GET CHAR(4) INIT  ('GU  ');                                 00002200
                                                                        00002210
    DCL SSAKVAL CHAR(9) INIT ('         ');                             00002220
                                                                        00002230
    DCL N_92               PIC'(2)9'       INIT (92);                   00002240
    DCL G_V92              PIC'(5)9'       INIT (36167);                00002250
    DCL PICF4              PIC'(4)9'       INIT (0);                    00002260
    DCL PICX4              PIC'(4)9'       INIT (0);                    00002270
    DCL PICX4_POS1         PIC'(2)9'  DEF  PICX4 POS(1);                00002280
    DCL PICX4_POS3         PIC'(2)9'  DEF  PICX4 POS(3);                00002290
                                                                        00002300
    DCL START_TID           PIC'999B99B99'  INIT(0);                    00002310
    DCL SLUTT_TID           PIC'999B99B99'  INIT(0);                    00002320
    DCL RBA_PEKER           POINTER;                                    00002330
    DCL FEIL_RBA            POINTER;                                    00002340
                                                                        00002350
    DCL SYNC_POINT_TELL FIXED BIN (15) INIT(1);                         00002360
    DCL BRI_PROT_MDT    CHAR(1)        INIT('Z');                       00002370
    DCL PERIODE         FIXED BIN (15);                                 00002380
    DCL FIXED_BIN15     FIXED BIN (15);                                 00002390
    DCL LINJE_TELL      FIXED BIN (15);                                 00002400
    DCL W_SØKER_IND     FIXED BIN (15);                                 00002410
    DCL BARN_IND        FIXED BIN (15);                                 00002420
    DCL TILKN_IND       FIXED BIN (15);                                 00002430
    DCL PLASS_I_B02_IND FIXED BIN (15);                                 00002440
    DCL LOOP            FIXED BIN (15);                                 00002450
    DCL I               FIXED BIN (15);                                 00002460
    DCL J               FIXED DEC (3);                                  00002470
    DCL K               FIXED DEC (3);                                  00002480
    DCL IJ              FIXED DEC (7);                                  00002490
    DCL ALDER           FIXED DEC (5);                                  00002500
    DCL F05_IND         FIXED BIN (15);                                 00002510
    DCL W_INNTEKT_1     PIC '(9)9';                                     00002520
    DCL W_INNTEKT_2     PIC '(9)9';                                     00002530
    DCL FORSI_KODE         CHAR(1)        INIT(' ');                    00002540
    DCL UFØREHIST_KODE     CHAR (1)      INIT (' ');                    00002550
    DCL TRANHIST_KODE      CHAR(1)        INIT(' ');                    00002560
    DCL BEHANDLE_FNR       CHAR(1)        INIT(' ');                    00002570
    DCL KODE               CHAR(2);                                     00002580
    DCL LES_UFØ_KODE      CHAR(2);                                      00002590
    DCL SSA_IND         CHAR(9) INIT ('ROT_STAT');                      00002600
    DCL PIC11           PIC '(11)9';                                    00002610
    DCL PIC6            PIC '(6)9',                                     00002620
        PIC4_DEF_PIC6   PIC '(4)9' DEF PIC6 POS(1);                     00002630
    DCL PIC4            PIC '(4)9',                                     00002640
        PIC4_POS1       PIC '(2)9' DEF PIC4 POS(1),                     00002650
        PIC4_POS3       PIC '(2)9' DEF PIC4 POS(3);                     00002660
    DCL PIC7            PIC '(7)9',                                     00002670
        PIC7_POS_7      PIC '(1)9' DEF PIC7 POS(7),                     00002680
        PIC7_POS_6_7    PIC '(2)9' DEF PIC7 POS(6),                     00002690
        PIC7_POS_5_7    PIC '(3)9' DEF PIC7 POS(5),                     00002700
        PIC7_POS_4_7    PIC '(4)9' DEF PIC7 POS(4),                     00002710
        PIC7_POS_3_7    PIC '(5)9' DEF PIC7 POS(3),                     00002720
        PIC7_POS_2_7    PIC '(6)9' DEF PIC7 POS(2);                     00002730
                                                                        00002740
    DCL TILKN_CODE      PIC '9' INIT (0);                               00002750
    DCL DL1_KODE        PIC '9';                                        00002760
    DCL W_ROT_FNR       PIC '(11)9';                                    00002770
    DCL ROT_KJONN       DEF W_ROT_FNR POS(9) PIC '9';                   00002780
    DCL W_BA_FNR        PIC '(11)9';                                    00002790
    DCL BA_KJONN        DEF W_BA_FNR POS(9) PIC '9';                    00002800
    DCL W_FNR           PIC '(11)9';                                    00002810
    DCL W_TKNR          PIC '(04)9';                                    00002820
    DCL HJELP_DATO_ÅM   PIC '(04)9';                                    00002830
    DCL Y_FNR           CHAR (11);                                      00002840
    DCL ANT_L           PIC '(07)9'INIT (0);                            00002850
    DCL ANT_S           PIC '(07)9'INIT (0);                            00002860
    DCL ANT_OMR_FAM     PIC '(07)9'INIT (0),                            00002870
        ANT_OMR_FAMX DEF ANT_OMR_FAM   CHAR (07);                       00002880
    DCL ANT_LEST_STATUS  PIC '(07)9'INIT (0),                           00002890
        ANT_LEST_STATUSX DEF ANT_LEST_STATUS  CHAR (07);                00002900
    DCL GRUNN_OMR1      CHAR      (1202);                               00002910
    DCL GRUNN_OMR2      CHAR      (1202);                               00002920
    DCL GRUNN_IDENT     CHAR      ( 8);                                 00002930
                                                                        00002940
    DCL 1 FEIL_STRUC,                                                   00002950
          2 FEIL_NR        FIXED DEC(5),                                00002960
          2 FEIL_MELDING   CHAR(78),                                    00002970
          2 KOM_OMR_PEKER  POINTER;                                     00002980
                                                                        00002990
    DCL F_GAR_ET             PIC '(7)9';                                00003000
    DCL F_GAR_BT             PIC '(7)9';                                00003010
    DCL E_GAR_ET             PIC '(7)9';                                00003020
    DCL E_GAR_BT             PIC '(7)9';                                00003030
    DCL F_SUM                PIC '(7)9';                                00003040
    DCL E_SUM                PIC '(7)9';                                00003050
    DCL S_KODE               PIC '(1)9';                                00003060
    DCL 1 X_REC,                                                        00003070
          2 FNR              PIC '(11)9',                               00003080
          2 FIL1             CHAR (1) INIT (' '),                       00003090
          2 TKNR             PIC '(4)9' ,                               00003100
          2 FIL2             CHAR (1) INIT (' '),                       00003110
          2 W_ANTALL          PIC '(9)9' ,                              00003120
          2 FIL3             CHAR (1) INIT (' '),                       00003130
          2 A_ANTALL         PIC '(9)9' ;                               00003140
                                                                        00003150
                                                                        00003160
    ON ERROR SNAP                                                       00003170
    BEGIN;                                                              00003180
       ON ERROR SYSTEM;                                                 00003190
       MELD2                = (78) ' ';                                 00003200
       MELDING = 'STOPP PÅ GRUNN AV PLI - ABEND, HOVEDFØDSELSNUMMER: '!!00003210
                  W_FNR;                                                00003220
       CALL SEND_TEXT;                                                  00003230
                                                                        00003240
       GOTO SLUTT;                                                      00003250
    END;                                                                00003260
                                                                        00003270
                                                                        00003280
    START_TID  = EIBTIME;                                               00003290
    ALLOCATE PCB_UIB_PEKER_OMR;                                         00003300
    ALLOCATE WORK_TRANS_LISTE;                                          00003310
    ALLOCATE FNRTAB;                                                    00003320
    ALLOCATE B00;                                                       00003330
    ALLOCATE B01;                                                       00003340
    ALLOCATE B02;                                                       00003350
    ALLOCATE POTALL_OPPL;                                               00003360
    ALLOCATE GV_TAB_RE                                                ; 00003370
    ALLOCATE G_TAB_RE                                                 ; 00003380
                                                                        00003390
    KOM_OMR.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);              00003400
    KOM_OMR.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);            00003410
    KOM_OMR.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);             00003420
    KOM_OMR.GV_PEKER         = ADDR (GRUNN_OMR1   ) ;                   00003430
    KOM_OMR.G_PEKER          = ADDR (GRUNN_OMR2   ) ;                   00003440
    FEIL_STRUC.KOM_OMR_PEKER = COMMAREA_PEKER;                          00003450
                                                                        00003460
                                                                        00003470
    B00           = '';                                                 00003480
    B01           = '';                                                 00003490
    B02           = '';                                                 00003500
    SEGMENTER     = '';                                                 00003510
    POTALL_OPPL   = '';                                                 00003520
    FNRTAB        = '';                                                 00003530
    GV_TAB_RE     = '';                                                 00003540
    G_TAB_RE      = '';                                                 00003550
    A_ANTALL      = 0;                                                  00003560
    W_ANTALL      = 0;                                                  00003570
    I = 1;                                                              00003580
    PIC6 = DATE;                                                        00003590
    PIC4 = PIC4_DEF_PIC6;                                               00003600
    PIC4 = PIC4 + 2;                                                    00003610
    IF  PIC4_POS3 > 12 THEN                                             00003620
       DO;                                                              00003630
          PIC4_POS1 = PIC4_POS1 + 1;                                    00003640
          PIC4_POS3 = PIC4_POS3 - 12;                                   00003650
       END;                                                             00003660
    TRANS_OPPL_OMR.TRANSKODE        = 'AUTO';                           00003670
    TRANS_OPPL_OMR.NY_GML_TRANS_IND = ' ';                              00003680
    TRANS_OPPL_OMR.FØDSNUMMER       = 0;                                00003690
    TRANS_OPPL_OMR.VIRKNINGSDATO    = 0;                                00003700
    TRANS_OPPL_OMR.BLANKETTYPE      = '  ';                             00003710
    TRANS_OPPL_OMR.TRANS_RETURKODE  = '    ';                           00003720
    DIV_PARAM_OMR. FEIL_MELD_NR     = 0;                                00003730
    DIV_PARAM_OMR. STØNADSBREV_ØNSKET_IND = '0'B;                       00003740
    DIV_PARAM_OMR. KJØRINGS_TYPE    = 'S';  /* STYRING AV R0014901 */   00003750
                                           /* INGEN SPERREPROBLEMATIKK*/00003760
    DIV_PARAM_OMR. ØNSKET_STATUS    = 'S';  /* STYRING AV R0013110 */   00003770
    STYRINGS_OMR . FUNKSJONSKODE    = 'F';  /* STYRING AV R0013110 */   00003780
                                                                        00003790
                                                                        00003800
                                                                        00003810
    GRUNN_IDENT                     = 'P0019924';                       00003820
                                                                        00003830
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                      00003840
                                                                        00003850
    GRUNN_IDENT                     = 'P0019925';                       00003860
                                                                        00003870
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                      00003880
                                                                        00003890
                                                                        00003900
                                                                        00003910
    IF PROGRAM_ID = 'R0010426' THEN                                     00003920
       DO;                                                              00003930
          EXEC CICS LOAD PROGRAM ('S0019F3');                           00003940
          ALLOCATE S0019XO;                                             00003950
          S0019XO.MELDINGO = 'NB NB  SJEKK AT KJØREDATO ER KORREKT !!'; 00003960
          S0019XO.DATO_MÅO = F_SNU_DATO(PIC4);                          00003970
          EXEC CICS SEND MAP('S0019X') MAPSET ('S0019F3') ERASE;        00003980
          PROGRAM_ID = 'R0019F05';                                      00003990
          EXEC CICS RETURN TRANSID('RF05') COMMAREA(KOM_OMR);           00004000
       END;                                                             00004010
                                                                        00004020
                                                                        00004030
    EXEC CICS RECEIVE MAP('S0019X') MAPSET ('S0019F3') SET (BMSMAPBR);  00004040
                                                                        00004050
                                                                        00004060
 /* ENDRET 21.02.86  AL                                            */   00004070
                                                                        00004080
    IF S0019XI.FUNKSJONSKODEL > 0 &                                     00004090
       VERIFY(S0019XI.FUNKSJONSKODEI,'RVEFIAX') = 0 THEN                00004100
                                                                        00004110
       DO;                                                              00004120
          STYRINGS_OMR.FUNKSJONSKODE = S0019XI.FUNKSJONSKODEI ;         00004130
          EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR);       00004140
       END;                                                             00004150
                                                                        00004160
    ELSE                                                                00004170
       IF S0019XI.STYRE_KODEL > 0  THEN                                 00004180
          DO;                                                           00004190
             STYREKODE          =      S0019XI.STYRE_KODEI;             00004200
             EXEC CICS XCTL PROGRAM  ('R0010420')                       00004210
                            COMMAREA ( KOM_OMR  );                      00004220
          END;                                                          00004230
                                                                        00004240
 /* HIT    21.02.86  AL                                            */   00004250
                                                                        00004260
    IF ^ F_NUMERISK(S0019XI.DATO_MÅI) THEN                              00004270
       DO;                                                              00004280
          S0019XI.DATO_MÅL = -1;                                        00004290
          MELDING ='TEGN SOM IKKE ER TALL I DATOFELT';                  00004300
       END;                                                             00004310
    ELSE IF ^ F_GYLDIG_DATO(S0019XO.DATO_MÅO) THEN                      00004320
       DO;                                                              00004330
          S0019XI.DATO_MÅL = -1;                                        00004340
          MELDING ='UGYLDIG DATO';                                      00004350
       END;                                                             00004360
    ELSE IF ^ F_NUMERISK(S0019XI.FNRI) THEN                             00004370
       DO;                                                              00004380
          S0019XI.FNRL = -1;                                            00004390
          MELDING ='TEGN SOM IKKE ER TALL I FØDSELSNUMMER - FELT';      00004400
       END;                                                             00004410
    ELSE IF ^ F_GYLDIG_FNR(S0019XO.FNRO) & S0019XO.FNRO  > 0 THEN       00004420
       DO;                                                              00004430
          S0019XI.FNRL = -1;                                            00004440
          MELDING ='UGYLDIG FØDSELSNUMMER ';                            00004450
       END;                                                             00004460
    ELSE IF ^ F_NUMERISK(S0019XI.ANT_Ø_BEHI) THEN                       00004470
       DO;                                                              00004480
          S0019XI.ANT_Ø_BEHL = -1;                                      00004490
          MELDING ='TEGN SOM IKKE ER TALL I ANTALL - FELT';             00004500
       END;                                                             00004510
    ELSE IF  S0019XO.ANT_Ø_BEHO = 1 & S0019XI.FNRI = 0 THEN             00004520
       DO;                                                              00004530
          S0019XI.ANT_Ø_BEHL = -1;                                      00004540
          MELDING ='FEIL KOMBINASJON - KJØRE-ANTALL = 1 OG FNR = 0';    00004550
       END;                                                             00004560
    ELSE IF                                                             00004570
         S0019XO.ANT_Ø_BEHO    = 999              !                     00004580
         S0019XO.ANT_Ø_BEHO    = 9999             !                     00004590
         S0019XO.ANT_Ø_BEHO    = 99999            !                     00004600
         S0019XO.ANT_Ø_BEHO    = 999999           THEN                  00004610
         DO;                                                            00004620
            S0019XI.ANT_Ø_BEHL = -1;                                    00004630
            MELDING            = 'ALLE SYV  9  TALLENE MÅ OPPGIS ';     00004640
         END;                                                           00004650
                                                                        00004660
    NESTE_HENDELSE_DATO_ÅM   = F_SNU_DATO(S0019XO.DATO_MÅO);            00004670
                                                                        00004680
    IF NESTE_HENDELSE_DATO_ÅM  >  PIC4   THEN                           00004690
     MELDING = ' OMREGNINGS DATO ER STORE ENN DAGEN DATO + 40 DAGER ';  00004700
                                                                        00004710
    EXEC CICS HANDLE CONDITION ERROR (CICS_ABEND);                      00004720
                                                                        00004730
    IF MELDING              ^= (78) ' ' THEN                            00004740
       CALL MAP_UT_OG_RETUR;                                            00004750
                                                                        00004760
                                                                        00004770
    S0019XO.ANT_LEST_STATUSO = 0;                                       00004780
    S0019XO.ANT_OMR_FAMO     = 0;                                       00004790
                                                                        00004800
    CALL DATABASE('OPEN');                                              00004810
                                                                        00004820
                                                                        00004830
    /** DERSOM EN GÅR INN HER STARTER EN SCAN PÅ NESTE FØDSELSNUMMER */ 00004840
    IF S0019XO.FNRO > 0 THEN                                            00004850
       DO;                                                              00004860
          SSA_IND = 'KV_ROT_ST';                                        00004870
          SSA_ROT_GU.FNR = S0019XO.FNRO;                                00004880
          CALL LES_ROT_STATUS_SEGM;                                     00004890
          W01_GET = 'GN  ';                                             00004900
          SSA_IND = 'ROT_STAT';                                         00004910
       END;                                                             00004920
                                                                        00004930
    IF S0019XO.ANT_Ø_BEHO > 1 THEN                                      00004940
       CALL LES_ROT_STATUS_SEGM;                                        00004950
 /* LES ROTSEGMENT-STATUSSSEGMENT MED GHN KVALIFISERT MED               00004960
          (STATUS-KODE = S OG STATUS-KODE-HIST = BLANK) */              00004970
 /* ***************************************************************** */00004980
 /* LESER FØRSTE PERSON SOM HAR PENSJON                               */00004990
 /* ***************************************************************** */00005000
                                                                        00005010
    W01_GET = 'GN  ';                                                   00005020
                                                                        00005030
                                                                        00005040
  /* MELD2 ='BEHANDLINGEN STARTER NÅ, JOBBEN TAR CA. 3 TIMER';  */      00005050
                                                                        00005060
    PICX4        =   EIBTIME / 100                              ;       00005070
    S0019XO.DATO_MÅA     = DFHBMPRO;                                    00005080
    S0019XO.FNRA         = DFHBMPRO;                                    00005090
    S0019XO.ANT_Ø_BEHA   = DFHBMPRO;                                    00005100
    S0019XO.START_TIDO   = PICX4;                                       00005110
    EXEC CICS SEND MAP ('S0019X') MAPSET ('S0019F3') WAIT               00005120
                                           DATAONLY;                    00005130
                                                                        00005140
                                                                        00005150
    DAGENS_DATO  =   DATE                                       ;       00005160
    W_DATO_DAG   =   DAGENS_DATO_DAG                            ;       00005170
    W_DATO_MND   =   DAGENS_DATO_MND                            ;       00005180
    W_DATO_ÅR    =   DAGENS_DATO_ÅR                             ;       00005190
                                                                        00005200
    MELDING = (78)' ';                                                  00005210
    FEIL_STRUC.FEIL_MELDING = MELDING;                                  00005220
                                                                        00005230
    MELDING = 'SPECIAL KJØRING    START KL:' !! PICX4 !!                00005240
                        '  DATO : ' !! W_DATO;                          00005250
                                                                        00005260
    FEIL_STRUC.FEIL_MELDING = MELDING;                                  00005270
    CALL SEND_TEXT;                                                     00005280
                                                                        00005290
    DO  IJ = 1 TO S0019XO.ANT_Ø_BEHO WHILE (OK & ^AVBRUDD);             00005300
                                                                        00005310
       W_FNR = ROTSEGM.FNR;                                             00005320
       BEHANDLE_FNR = ' ';                                              00005330
                                                                        00005340
       DIV_PARAM_OMR.FEIL_MELD_NR = 0;                                  00005350
                                                                        00005360
       ANT_LEST_STATUS = ANT_LEST_STATUS + 1;                           00005370
       S0019XO.ANT_LEST_STATUSO = ANT_LEST_STATUSX;                     00005380
                                                                        00005390
       ANT_L      =  ANT_L + 1;                                         00005400
       IF ANT_L  > ANT_S     THEN                                       00005410
          DO;                                                           00005420
             ANT_S = ANT_S + 100000;                                    00005430
                                                                        00005440
             EXEC CICS ASKTIME;                                         00005450
             PICF4        =   EIBTIME / 100        ;                    00005460
                                                                        00005470
             MELDING = 'SPECIAL KJØRING    START KL:' !! PICX4 !!       00005480
                        '  DATO : ' !! W_DATO !!                        00005490
                        ' SISTE BILDE ENDERING ' !! PICF4;              00005500
                                                                        00005510
             S0019XO.MELDINGO = MELDING;                                00005520
             EXEC CICS SEND MAP ('S0019X') MAPSET('S0019F3') DATAONLY   00005530
                                              CURSOR;                   00005540
          END;                                                          00005550
                                                                        00005560
                                                                        00005570
 /*SPECIAL KJØRING  21.05.92     SATISH     */                          00005580
                                                                        00005590
                                                                        00005600
                                                                        00005610
       DIV_PARAM_OMR.FEIL_MELD_NR = 0;                                  00005620
       DIV_PARAM_OMR.SØKER_IND    = 0;                                  00005630
       DIV_PARAM_OMR.FAMILIE_IND  = 0;                                  00005640
                                                                        00005650
       SEARCH_FNR = ROTSEGM.FNR;                                        00005660
       W_ROT_FNR         = ROTSEGM.FNR;                                 00005670
                                                                        00005680
       IF F_KJØNN(W_ROT_FNR) = 'K' THEN                                 00005690
                                                                        00005700
          SØKER_IND = 1;                                                00005710
                                                                        00005720
       ELSE                                                             00005730
                                                                        00005740
          SØKER_IND = 2;                                                00005750
                                                                        00005760
       F05_IND = SØKER_IND;                                             00005770
                                                                        00005780
       IF SØKER_IND > 0 THEN                                            00005790
          DO;                                                           00005800
             B01               = '';                                    00005810
             CALL ROSSFFB;                                              00005820
          END;                                                          00005830
       ELSE                                                             00005840
          GOTO LES_GN;                                                  00005850
 /* ***************************************************************** */00005860
                       /*  CALL OPPRETT_SISTE_STATUS_FOR_FAMILIEN_BATCH 00005870
                                            (ROT_SEGM_FNR,SØKER_IND) */ 00005880
 /* SISTE STATUS TIL ROT-SEGM-FNR'S FAMILIE BLIR                      */00005890
 /* LEST INN I B02                                                    */00005900
 /* ***************************************************************** */00005910
                                                                        00005920
       IF FEIL_MELD_NR > 0 THEN                                         00005930
                                                                        00005940
          DO;                                                           00005950
             CALL ACCUM_FEIL;                                           00005960
             GOTO LES_GU;                                               00005970
                                                                        00005980
          END;                                                          00005990
                                                                        00006000
                                                                        00006010
       TRANS_OPPL_OMR.TRANSTYPE               = 00;                     00006020
       STØNADSBREV_ØNSKET_IND                 = '0'B;                   00006030
       S_KODE   = 0;                                                    00006040
                                                                        00006050
       IF B01.PENSJONSTYPE2 (SØKER_IND)         ='S'  THEN              00006060
          DO;                                                           00006070
              TRANS_OPPL_OMR.TRANSTYPE               = 10;              00006080
              STØNADSBREV_ØNSKET_IND                 = '0'B;            00006090
              S_KODE   = 1;                                             00006100
          END;                                                          00006110
                                                                        00006120
       IF B01.PENSJONSTYPE2 (SØKER_IND)        = 'F'  THEN              00006130
          DO;                                                           00006140
              TRANS_OPPL_OMR.TRANSTYPE         = 10;                    00006150
              STØNADSBREV_ØNSKET_IND           = '1'B;                  00006160
              S_KODE   = 2;                                             00006170
          END;                                                          00006180
                                                                        00006190
        DO J = 1 TO 13                                                  00006200
                       WHILE (B01.TILKN.FNR_TILKN(SØKER_IND, J) > 0);   00006210
               IF B01.TILKN.TILKNYTNINGSKODE(SØKER_IND, J) = 'W' THEN   00006220
                  DO;                                                   00006230
                       TRANS_OPPL_OMR.TRANSTYPE         = 10;           00006240
                       STØNADSBREV_ØNSKET_IND           = '1'B;         00006250
                       S_KODE   = 2;                                    00006260
                  END;                                                  00006270
        END;                                                            00006280
                                                                        00006290
        IF TRANS_OPPL_OMR.TRANSTYPE         = 00 THEN                   00006300
           GOTO LES_GN;                                                 00006310
                                                                        00006320
       X_REC.FNR         = ROTSEGM.FNR;                                 00006330
       X_REC.TKNR        = ROTSEGM.TKNR;                                00006340
                                                                        00006350
       B02 = B01;                                                       00006360
       F_SUM   = B01.SUM_YTELSE(SØKER_IND);                             00006370
       F_GAR_ET = B01.GARANTITILLEGG_EK(SØKER_IND);                     00006380
       F_GAR_BT = B01.GARANTITILLEGG_BARN(SØKER_IND);                   00006390
                                                                        00006400
       POTALL_OPPL          = '';                                       00006410
                                                                        00006420
       DIV_PERIODE = '';                                                00006430
                                                                        00006440
 /*    DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = ' ';                         00006450
       DIV_PARAM_OMR.BEREGNINGS_ALT_AVD         = ' ';                  00006460
       DIV_PARAM_OMR.FULLT_SÆRTILLEGG           = 0;                    00006470
       DIV_PARAM_OMR.GARANTITILLEGG_TP(1)= 0;                           00006480
       DIV_PARAM_OMR.GARANTITILLEGG_TP(2)= 0;                           00006490
       DIV_PARAM_OMR.ENGANGSBELØP_11_7(1)= 0;                           00006500
       DIV_PARAM_OMR.ENGANGSBELØP_11_7(2)= 0;                           00006510
       DIV_PARAM_OMR.FOLKETRYGD              (1)= 0;                    00006520
       DIV_PARAM_OMR.FOLKETRYGD              (2)= 0;                    00006530
       DIV_PARAM_OMR.FRIBELØP_MINSTE         (1)= 0;                    00006540
       DIV_PARAM_OMR.FRIBELØP_MINSTE         (2)= 0;                    00006550
       DIV_PARAM_OMR.FRIBELØP_SÆRBARN (1)= 0;                           00006560
       DIV_PARAM_OMR.FRIBELØP_SÆRBARN (2)= 0;                           00006570
       DIV_PARAM_OMR.FRIBELØP_FELLESBARN(1) = 0;                        00006580
       DIV_PARAM_OMR.FRIBELØP_FELLESBARN(2) = 0;                        00006590
       DIV_PARAM_OMR.FULLT_BT_V                 = ' ';                  00006600
       DIV_PARAM_OMR.FULLT_BT_W                 = ' ';                  00006610
       DIV_PARAM_OMR.FULLT_ET                   = ' ';                  00006620
       DIV_PARAM_OMR.RETT_TIL_ÅFT            (1)= ' ';                  00006630
       DIV_PARAM_OMR.RETT_TIL_ÅFT            (2)= ' ';                  00006640
       DIV_PARAM_OMR.TAI                     (1)= 0  ;                  00006650
       DIV_PARAM_OMR.TAI                     (2)= 0  ;                  00006660
       DIV_PARAM_OMR.AP_KODE_AEY             (1)= ' ';                  00006670
       DIV_PARAM_OMR.AP_KODE_AEY             (2)= ' ';                  00006680
       DIV_PARAM_OMR.REGN_1291                  = ' ';                  00006690
  */                                                                    00006700
                                                                        00006710
       NESTE_HENDELSE_DATO_ÅM           = F_SNU_DATO(S0019XO.DATO_MÅO); 00006720
                                                                        00006730
   /*  B02.VIRK_DATO_ÅM (SØKER_IND)    =  9401; */                      00006740
       TRANS_OPPL_OMR.VIRKNINGSDATO    =  B01.VIRK_DATO_ÅM (SØKER_IND); 00006750
                                                                        00006760
       EXEC CICS LINK PROGRAM('R0014901') COMMAREA(KOM_OMR);            00006770
                                                                        00006780
                                                                        00006790
       E_SUM   = B02.SUM_YTELSE(SØKER_IND);                             00006800
       E_GAR_ET = B02.GARANTITILLEGG_EK(SØKER_IND);                     00006810
       E_GAR_BT = B02.GARANTITILLEGG_BARN(SØKER_IND);                   00006820
                                                                        00006830
       IF F_SUM    ^= E_SUM   THEN                                      00006840
          DO;                                                           00006850
             IF S_KODE  = 1      THEN                                   00006860
                A_ANTALL  = A_ANTALL + 1;                               00006870
                                                                        00006880
            IF S_KODE  = 2      THEN                                    00006890
               W_ANTALL  = W_ANTALL + 1;                                00006900
                                                                        00006910
        /*                                                              00006920
            EXEC CICS WRITE DATASET ('F0019F05')                        00006930
                   FROM (X_REC) RBA    RIDFLD(RBA_PEKER);               00006940
         */                                                             00006950
          END;                                                          00006960
        ELSE                                                            00006970
           STØNADSBREV_ØNSKET_IND   = '0'B;                             00006980
                                                                        00006990
       IF F_SUM   =    E_SUM     THEN                                   00007000
         DO;                                                            00007010
            IF F_GAR_ET ^= E_GAR_ET !                                   00007020
               F_GAR_BT ^= E_GAR_BT THEN                                00007030
               STØNADSBREV_ØNSKET_IND   = '1'B;                         00007040
         END;                                                           00007050
                                                                        00007060
       IF  STØNADSBREV_ØNSKET_IND   = '0'B  THEN                        00007070
           EXEC CICS LINK PROGRAM('R0017102') COMMAREA(KOM_OMR);        00007080
                                                                        00007090
 /* ***************************************************************** */00007100
 /* FAMILIEN AUTOMATISK ALDERSOPPDATERT OG BEREGNET                   */00007110
 /* PÅ NYTT.  RESULTATET BLIR SKREVET UT PÅ                           */00007120
 /* STØNADSBREV-BASEN OG STATISTIKK-TRANS-BASEN.                      */00007130
 /* ***************************************************************** */00007140
                                                                        00007150
              IF FEIL_MELD_NR = 0 THEN                                  00007160
                 DO;                                                    00007170
                                                                        00007180
 /* ***************************************************************** */00007190
 /* FAMILIEN BLIR SKREVET TILBAKE PÅ BASEN                            */00007200
 /* ***************************************************************** */00007210
                                                                        00007220
                    EXEC CICS LINK PROGRAM('R0015401')                  00007230
                                    COMMAREA(KOM_OMR);                  00007240
                                                                        00007250
                                                                        00007260
      /*******   ********************************************    */     00007270
      /*     CALL   JUSTER-SB-ROTSEGMENTSTØNADSBREV-BASEN        */     00007280
      /*                             (ST-BREV-NØKKEL-TABELL)     */     00007290
      /* *****   ********************************************    */     00007300
                                                                        00007310
                IF  STØNADSBREV_ØNSKET_IND   = '1'B  THEN               00007320
                    EXEC CICS LINK PROGRAM('R0017101')                  00007330
                                    COMMAREA(KOM_OMR);                  00007340
                                                                        00007350
                                                                        00007360
                 END;                                                   00007370
                                                                        00007380
              IF FEIL_MELD_NR > 0 THEN                                  00007390
                                                                        00007400
                 DO;                                                    00007410
                                                                        00007420
                                /* ********************************* */ 00007430
                                /* SKRIV UT FEILMELDING OM FAMILIEN  */ 00007440
                                /* ********************************* */ 00007450
                    CALL ACCUM_FEIL;                                    00007460
                    FEIL_MELD_NR = 0;                                   00007470
                                                                        00007480
                              /****** ********************************* 00007490
                                  CALL FJERN-TRANS-FRA-STØNADSBREV-BASE 00007500
                                       (STØNADSBREV-NØKKEL-TABELL)      00007510
                                ***** ********************************/ 00007520
                   IF  STØNADSBREV_ØNSKET_IND   = '1'B  THEN            00007530
                        EXEC CICS LINK PROGRAM('R0016401')              00007540
                                       COMMAREA(KOM_OMR);               00007550
                                                                        00007560
                    IF FEIL_MELD_NR > 0 THEN                            00007570
                       DO;                                              00007580
                          CALL ACCUM_FEIL;                              00007590
                          FEIL_MELD_NR = 0;                             00007600
                       END;                                             00007610
                                                                        00007620
                 END;                                                   00007630
                                                                        00007640
              FNRTAB        = '';                                       00007650
                                                                        00007660
                                                                        00007670
              EXEC CICS SYNCPOINT;                                      00007680
              CALL DATABASE('OPEN');                                    00007690
                                                                        00007700
            LES_GU:                                                     00007710
              SSA_ROT_GU.FNR = W_FNR;                                   00007720
              CALL GU_PÅ_ROT;                                           00007730
              CALL GN_PÅ_ROT;                                           00007740
                                                                        00007750
                                                                        00007760
                                                                        00007770
     LES_GN:                                                            00007780
                                                                        00007790
       CALL LES_ROT_STATUS_SEGM;                                        00007800
 /* ***************************************************************** */00007810
 /* NESTE PERSON I SEKVENSEN LESES                                    */00007820
 /* ***************************************************************** */00007830
                                                                        00007840
           OLARC         = '';                                          00007850
 /*        DIV_PARAM_OMR. STØNADSBREV_ØNSKET_IND = '1'B;            */  00007860
                                                                        00007870
    END;                                                                00007880
                                                                        00007890
 %PAGE;                                                                 00007900
                                                                        00007910
 KONTROLL_FORSI: PROC;                                                  00007920
                                                                        00007930
    DCL SSA_FORSI              CHAR(9)  INIT ('FORSI    ');             00007940
    DCL FUNC_GNP               CHAR(4)  INIT ('GNP ');                  00007950
                                                                        00007960
    FORSI_KODE = ' ';                                                   00007970
    CALL PLITDLI (FIRE,FUNC_GNP,RF4,FORSISEGM,SSA_FORSI);               00007980
                                                                        00007990
                                                                        00008000
    IF DLIUIB.UIBFCTR                   ^=    '00000000'B THEN          00008010
       DO;                                                              00008020
          DL1_KODE = 9;                                                 00008030
          MELDING =                                                     00008040
           'NOE ER GALT MED DATABASEN PÅ KALL: GNP PÅ FORSI  KODE: '    00008050
            !! UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);               00008060
          GOTO SLUTT;                                                   00008070
       END;                                                             00008080
                                                                        00008090
    KODE = RF4.STATUS_KODE;                                             00008100
                                                                        00008110
    SELECT (RF4.STATUS_KODE);                                           00008120
                                                                        00008130
       WHEN ('  ')                                                      00008140
          DO;                                                           00008150
                                                                        00008160
             IF FORSISEGM.ARBEIDSINNTEKT     > 0 !                      00008170
                FORSISEGM.ARBEIDSINNTEKT_EK  > 0 !                      00008180
                FORSISEGM.PENSJONSINNTEKT    > 0 !                      00008190
                FORSISEGM.PENSJONSINNTEKT_EK > 0 THEN                   00008200
                FORSI_KODE = 'J';                                       00008210
                                                                        00008220
          END;                                                          00008230
                                                                        00008240
       WHEN ('GE','GB')                                                 00008250
                                                                        00008260
          DO;                                                           00008270
                FORSI_KODE = ' ';                                       00008280
          END;                                                          00008290
                                                                        00008300
                                                                        00008310
       OTHERWISE                                                        00008320
 /* ***************************************************************** */00008330
 /* FEIL STATUSKODE                                                   */00008340
 /* ***************************************************************** */00008350
          DO;                                                           00008360
             DL1_KODE = 9;                                              00008370
             MELDING = 'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!    00008380
                       ' FRA GNP PÅ FORSI, FNR: ' !! W_FNR;             00008390
             GO TO SLUTT;                                               00008400
          END;                                                          00008410
                                                                        00008420
    END;                                                                00008430
                                                                        00008440
                                                                        00008450
                                                                        00008460
 END KONTROLL_FORSI;                                                    00008470
                                                                        00008480
                                                                        00008490
                                                                        00008500
 KONTROLL_TRANHIST: PROC;                                               00008510
                                                                        00008520
    DCL SSA_TRANHIST           CHAR(11)  INIT ('TRANHIST*F ');          00008530
    DCL FUNC_GU                CHAR(4)  INIT ('GU  ');                  00008540
                                                                        00008550
    SSA_ROT_GU.FNR = W_FNR;                                             00008560
                                                                        00008570
    CALL PLITDLI      (FEM ,                                            00008580
                       FUNC_GU,                                         00008590
                       RF4,                                             00008600
                       TRANHISTSEGM,                                    00008610
                       SSA_ROT_GU,                                      00008620
                       SSA_TRANHIST);                                   00008630
                                                                        00008640
                                                                        00008650
    IF DLIUIB.UIBFCTR                   ^=    '00000000'B THEN          00008660
       DO;                                                              00008670
          DL1_KODE = 9;                                                 00008680
          MELDING =                                                     00008690
           'NOE ER GALT MED DATABASEN PÅ KALL: GNP PÅ TRANHIST  KODE: ' 00008700
            !! UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);               00008710
          GOTO SLUTT;                                                   00008720
       END;                                                             00008730
                                                                        00008740
    KODE = RF4.STATUS_KODE;                                             00008750
                                                                        00008760
    SELECT (RF4.STATUS_KODE);                                           00008770
                                                                        00008780
       WHEN ('  ')                                                      00008790
          DO;                                                           00008800
                                                                        00008810
             IF REGDATO_ÅMD < 920613 THEN                               00008820
                TRANHIST_KODE = 'J';                                    00008830
             ELSE                                                       00008840
                TRANHIST_KODE = ' ';                                    00008850
                                                                        00008860
          END;                                                          00008870
                                                                        00008880
       WHEN ('GE')                                                      00008890
                                                                        00008900
          DO;                                                           00008910
                TRANHIST_KODE = 'J';                                    00008920
                                                                        00008930
          END;                                                          00008940
                                                                        00008950
       WHEN ('GB')                                                      00008960
                                                                        00008970
          DO;                                                           00008980
                TRANHIST_KODE = ' ';                                    00008990
                                                                        00009000
          END;                                                          00009010
                                                                        00009020
       OTHERWISE                                                        00009030
 /* ***************************************************************** */00009040
 /* FEIL STATUSKODE                                                   */00009050
 /* ***************************************************************** */00009060
          DO;                                                           00009070
             DL1_KODE = 9;                                              00009080
             MELDING = 'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!    00009090
                       ' FRA GNP PÅ TRANHIST, FNR: ' !! W_FNR;          00009100
             GO TO SLUTT;                                               00009110
          END;                                                          00009120
                                                                        00009130
    END;                                                                00009140
                                                                        00009150
                                                                        00009160
                                                                        00009170
 END KONTROLL_TRANHIST;                                                 00009180
                                                                        00009190
                                                                        00009200
                                                                        00009210
   KONTROLL_TILKN: PROC;                                                00009220
                                                                        00009230
    TILKN_CODE = 0;                                                     00009240
    CALL LES_TILKN;                                                     00009250
    IF FEIL_MELD_NR > 0  THEN                                           00009260
       DO;                                                              00009270
          FEIL_MELD_NR = 0;                                             00009280
          GOTO KON_99;                                                  00009290
       END;                                                             00009300
                                                                        00009310
     DO K = 1 TO 14 UNTIL ( TILKNSEGM.FNR_TILKN = 0 );                  00009320
                                                                        00009330
        W_FNR_TILKN = TILKNSEGM.FNR_TILKN;                              00009340
                                                                        00009350
        IF TILKNSEGM.TILKNYTNINGSKODE = 'V' THEN                        00009360
           DO;                                                          00009370
              TILKN_CODE = 1;                                           00009380
           END;                                                         00009390
                                                                        00009400
        IF TILKN_CODE = 1 THEN                                          00009410
           LEAVE;                                                       00009420
        CALL LES_TILKN;                                                 00009430
                                                                        00009440
        IF FEIL_MELD_NR > 0 THEN                                        00009450
           DO;                                                          00009460
              DIV_PARAM_OMR.FEIL_MELD_NR = 0;                           00009470
              K = 15;                                                   00009480
           END;                                                         00009490
      END;                                                              00009500
  KON_99:                                                               00009510
  END KONTROLL_TILKN;                                                   00009520
                                                                        00009530
                                                                        00009540
                                                                        00009550
                                                                        00009560
 LES_TILKN: PROC;                                                       00009570
                                                                        00009580
                                                                        00009590
    DCL SSA_TILKN              CHAR(9)  INIT ('TILKN    ');             00009600
    DCL FUNC_GNP               CHAR(4)  INIT ('GNP ');                  00009610
                                                                        00009620
    CALL PLITDLI (FIRE,FUNC_GNP,RF4,TILKNSEGM,SSA_TILKN);               00009630
                                                                        00009640
                                                                        00009650
    IF DLIUIB.UIBFCTR                   ^=    '00000000'B THEN          00009660
       DO;                                                              00009670
          DL1_KODE = 9;                                                 00009680
          MELDING =                                                     00009690
           'NOE ER GALT MED DATABASEN PÅ KALL: GNP PÅ TILKN  KODE: '    00009700
            !! UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);               00009710
          GOTO SLUTT;                                                   00009720
       END;                                                             00009730
                                                                        00009740
    KODE = RF4.STATUS_KODE;                                             00009750
                                                                        00009760
    SELECT (RF4.STATUS_KODE);                                           00009770
                                                                        00009780
       WHEN ('  ')                                                      00009790
          DO;                                                           00009800
                                                                        00009810
             OK = '1'B;                                                 00009820
                                                                        00009830
          END;                                                          00009840
                                                                        00009850
       WHEN ('GE','GB')                                                 00009860
                                                                        00009870
          DO;                                                           00009880
             FEIL_MELD_NR = 497;                                        00009890
             PROGRAM_ID = 'R0019F05';                                   00009900
             FEIL_VED_LABEL = 'L110';                                   00009910
          END;                                                          00009920
                                                                        00009930
                                                                        00009940
       OTHERWISE                                                        00009950
 /* ***************************************************************** */00009960
 /* FEIL STATUSKODE                                                   */00009970
 /* ***************************************************************** */00009980
          DO;                                                           00009990
             DL1_KODE = 9;                                              00010000
             MELDING = 'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!    00010010
                       ' FRA GNP PÅ TILKN, FNR: ' !! W_FNR;             00010020
             GO TO SLUTT;                                               00010030
          END;                                                          00010040
                                                                        00010050
    END;                                                                00010060
                                                                        00010070
                                                                        00010080
 END LES_TILKN;                                                         00010090
                                                                        00010100
 KONTROLL_UFØREHIST: PROC;                                              00010110
                                                                        00010120
     UFØREHIST_KODE = ' ';                                              00010130
     Y_FNR = W_FNR;                                                     00010140
                                                                        00010150
     IF SUBSTR(Y_FNR,7,1 ) < '5'     &                                  00010160
        SUBSTR(Y_FNR,5,2 ) > '42'    THEN                               00010170
        DO;                                                             00010180
           CALL LES_UFØREHIST;                                          00010190
           IF LES_UFØ_KODE              = '  '           &              00010200
              UFØRHISTSEGM.BUP_GAR_KODE = 'B' THEN                      00010210
              DO;                                                       00010220
                 FNR_Å  = SUBSTR(Y_FNR,5,2);                            00010230
                 FNR_M  = SUBSTR(Y_FNR,3,2);                            00010240
                                                                        00010250
                 W_UFT_ÅM  = UFØRHISTSEGM.UFT_ÅM ;                      00010260
                                                                        00010270
                 IF FNR_M > W_UFT_M  THEN                               00010280
                    DO;                                                 00010290
                       W_UFT_M = W_UFT_M + 12;                          00010300
                       W_UFT_Å = W_UFT_Å - 1 ;                          00010310
                    END;                                                00010320
                                                                        00010330
                 W_ÅM  = UFØRHISTSEGM.UFT_ÅM - FNR_ÅM;                  00010340
                 IF W_ÅM > 2200 &                                       00010350
                    W_ÅM < 2401  THEN                                   00010360
                    DO;                                                 00010370
                /*      EXEC CICS WRITE DATASET ('F0019F05')            00010380
                           FROM (W_FNR) RBA    RIDFLD(RBA_PEKER);   */  00010390
                        UFØREHIST_KODE = 'J';                           00010400
                    END;                                                00010410
                                                                        00010420
              END;                                                      00010430
        END;                                                            00010440
    ELSE                                                                00010450
      DO;                                                               00010460
        CALL LES_UFØREHIST;                                             00010470
        IF LES_UFØ_KODE              = '  '           &                 00010480
           UFØRHISTSEGM.BUP_GAR_KODE = 'E' THEN                         00010490
           DO;                                                          00010500
              IF FORSI_KODE = 'J'  THEN                                 00010510
                                                                        00010520
                  EXEC CICS WRITE DATASET ('F0019F05')                  00010530
                        FROM (W_FNR) RBA    RIDFLD(RBA_PEKER);          00010540
                                                                        00010550
           END;                                                         00010560
      END;                                                              00010570
 END KONTROLL_UFØREHIST;                                                00010580
                                                                        00010590
                                                                        00010600
 LES_UFØREHIST: PROC;                                                   00010610
                                                                        00010620
                                                                        00010630
    DCL SSA_UFØRHIST           CHAR(11)  INIT ('UFØRHIST*L');           00010640
    DCL FUNC_GNP               CHAR(4)  INIT ('GNP ');                  00010650
                                                                        00010660
    CALL PLITDLI (FIRE,FUNC_GNP,RF4,UFØRHISTSEGM,SSA_UFØRHIST);         00010670
                                                                        00010680
                                                                        00010690
    IF DLIUIB.UIBFCTR                   ^=    '00000000'B THEN          00010700
       DO;                                                              00010710
          DL1_KODE = 9;                                                 00010720
          MELDING =                                                     00010730
           'NOE ER GALT MED DATABASEN PÅ KALL: GNP PÅ TILKN  KODE: '    00010740
            !! UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);               00010750
          GOTO SLUTT;                                                   00010760
       END;                                                             00010770
                                                                        00010780
    LES_UFØ_KODE = RF4.STATUS_KODE;                                     00010790
                                                                        00010800
    SELECT (RF4.STATUS_KODE);                                           00010810
                                                                        00010820
       WHEN ('  ')                                                      00010830
          DO;                                                           00010840
                                                                        00010850
             OK = '1'B;                                                 00010860
                                                                        00010870
          END;                                                          00010880
                                                                        00010890
       WHEN ('GE','GB')                                                 00010900
                                                                        00010910
          DO;                                                           00010920
  L110:      FEIL_MELD_NR = 497;         /* FINNES IKKE TILKN  **/      00010930
             PROGRAM_ID = 'R0019F05';                                   00010940
             FEIL_VED_LABEL = 'L110';                                   00010950
          END;                                                          00010960
                                                                        00010970
                                                                        00010980
       OTHERWISE                                                        00010990
 /* ***************************************************************** */00011000
 /* FEIL STATUSKODE                                                   */00011010
 /* ***************************************************************** */00011020
          DO;                                                           00011030
             DL1_KODE = 9;                                              00011040
             MELDING = 'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!    00011050
                       ' FRA GNP PÅ UFØRHIST , FNR: ' !! W_FNR;         00011060
             GO TO SLUTT;                                               00011070
          END;                                                          00011080
                                                                        00011090
    END;                                                                00011100
                                                                        00011110
                                                                        00011120
 END LES_UFØREHIST;                                                     00011130
                                                                        00011140
 LES_ROT_STATUS_SEGM:                                                   00011150
                                                                        00011160
  PROC;                                                                 00011170
                                                                        00011180
    IF SSA_IND = 'ROT_STAT' THEN                                        00011190
       CALL PLITDLI (FEM,W01_GET,RF4,SEGMENTER,SSA_ROT,SSA_STATUS);     00011200
                                                                        00011210
    ELSE                                                                00011220
       CALL PLITDLI (FEM,W01_GET,RF4,SEGMENTER,SSA_ROT_GU,SSA_STATUS);  00011230
                                                                        00011240
    IF DLIUIB.UIBFCTR                   ^=    '00000000'B THEN          00011250
       DO;                                                              00011260
         DL1_KODE = 9;                                                  00011270
          MELDING =                                                     00011280
           'NOE ER GALT MED DATABASEN PÅ KALL: ' !! W01_GET !! ' KODE: '00011290
            !! UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);               00011300
          GOTO SLUTT;                                                   00011310
       END;                                                             00011320
                                                                        00011330
    KODE = RF4.STATUS_KODE;                                             00011340
                                                                        00011350
    SELECT (RF4.STATUS_KODE);                                           00011360
                                                                        00011370
       WHEN ('  ','GA','GK')                                            00011380
          DO;                                                           00011390
                                                                        00011400
             OK = '1'B;                                                 00011410
                                                                        00011420
          END;                                                          00011430
                                                                        00011440
       WHEN ('GB')                                                      00011450
                                                                        00011460
          DO;                                                           00011470
             MELDING = 'DATABASEN HAR NÅ BLITT GJENNOMLEST OG ' !!      00011480
                       'OPPDATERT MED LOVEENDERING 1291     GB';        00011490
             OK = '0'B;                                                 00011500
          END;                                                          00011510
                                                                        00011520
       WHEN ('GE')                                                      00011530
                                                                        00011540
          DO;                                                           00011550
             IF S0019XO.ANT_LEST_STATUSO = 0 THEN                       00011560
               MELDING = 'DETTE FØDESELSNUMMER FINNES IKKE I DATABASEN';00011570
             ELSE                                                       00011580
               MELDING = 'DATABASEN HAR NÅ BLITT GJENNOMLEST OG ' !!    00011590
                         'OPPDATERT MED LOVENDERING 1291      GE';      00011600
             OK = '0'B;                                                 00011610
             GOTO SLUTT;                                                00011620
          END;                                                          00011630
                                                                        00011640
                                                                        00011650
       OTHERWISE                                                        00011660
 /* ***************************************************************** */00011670
 /* FEIL STATUSKODE                                                   */00011680
 /* ***************************************************************** */00011690
          DO;                                                           00011700
             DL1_KODE = 9;                                              00011710
             MELDING = 'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!    00011720
                       ' FRA ' !! W01_GET !! 'CALL';                    00011730
             GO TO SLUTT;                                               00011740
          END;                                                          00011750
                                                                        00011760
    END;                                                                00011770
                                                                        00011780
 END LES_ROT_STATUS_SEGM;                                               00011790
                                                                        00011800
                                                                        00011810
 GU_PÅ_ROT:                                                             00011820
      PROC;                                                             00011830
                                                                        00011840
      W01_GET        = 'GU  ';                                          00011850
      CALL PLITDLI (FIRE,W01_GET,RF4,SEGMENTER,SSA_ROT_GU);             00011860
                                                                        00011870
      IF DLIUIB.UIBFCTR            ^=    '00000000'B THEN               00011880
         DO;                                                            00011890
            DL1_KODE = 9;                                               00011900
            MELDING =                                                   00011910
           'NOE ER GALT MED DATABASEN PÅ KALL: ' !! W01_GET !!          00011920
           ' KODE: ' !! UNSPEC(UIBFCTR) !!' '!! UNSPEC(UIBDLTR);        00011930
            GOTO SLUTT;                                                 00011940
         END;                                                           00011950
                                                                        00011960
      SELECT (RF4.STATUS_KODE);                                         00011970
                                                                        00011980
         WHEN ('  ')                                                    00011990
            ;                                                           00012000
                                                                        00012010
         OTHERWISE                                                      00012020
 /* ***************************************************************** */00012030
 /* FEIL STATUSKODE                                                   */00012040
 /* ***************************************************************** */00012050
            DO;                                                         00012060
               DL1_KODE = 9;                                            00012070
               MELDING =                                                00012080
                  'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!         00012090
                  ' FRA ' !! W01_GET !! 'CALL' !! W_FNR;                00012100
               GO TO SLUTT;                                             00012110
            END;                                                        00012120
                                                                        00012130
      END;                                                              00012140
                                                                        00012150
 END GU_PÅ_ROT;                                                         00012160
                                                                        00012170
 GN_PÅ_ROT:                                                             00012180
      PROC;                                                             00012190
      W01_GET = 'GN  ';                                                 00012200
                                                                        00012210
      CALL PLITDLI (FIRE,W01_GET,RF4,SEGMENTER,SSA_ROT);                00012220
                                                                        00012230
      IF DLIUIB.UIBFCTR            ^=    '00000000'B THEN               00012240
         DO;                                                            00012250
            DL1_KODE = 9;                                               00012260
            MELDING =                                                   00012270
           'NOE ER GALT MED DATABASEN PÅ KALL: ' !! W01_GET !!          00012280
           ' KODE: ' !! UNSPEC(UIBFCTR) !!' '!! UNSPEC(UIBDLTR);        00012290
            GOTO SLUTT;                                                 00012300
         END;                                                           00012310
                                                                        00012320
      SELECT (RF4.STATUS_KODE);                                         00012330
                                                                        00012340
         WHEN ('  ')                                                    00012350
            ;                                                           00012360
                                                                        00012370
         WHEN ('GE','GB')                                               00012380
            DO;                                                         00012390
               MELDING =                                                00012400
                  'SLUTT På DATABASEN ' !! RF4.STATUS_KODE !!           00012410
                  ' MED ' !! W01_GET !! 'CALL' !! W_FNR;                00012420
               GO TO SLUTT;                                             00012430
            END;                                                        00012440
         OTHERWISE                                                      00012450
 /* ***************************************************************** */00012460
 /* FEIL STATUSKODE                                                   */00012470
 /* ***************************************************************** */00012480
            DO;                                                         00012490
               DL1_KODE = 9;                                            00012500
               MELDING =                                                00012510
                  'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!         00012520
                  ' FRA ' !! W01_GET !! 'CALL' !! W_FNR;                00012530
               GO TO SLUTT;                                             00012540
            END;                                                        00012550
                                                                        00012560
      END;                                                              00012570
                                                                        00012580
 END GN_PÅ_ROT;                                                         00012590
                                                                        00012600
                                                                        00012610
 %PAGE;                                                                 00012620
 %INCLUDE R0019901;          /*     F_GYLDIG_DATO       */              00012630
 %PAGE;                                                                 00012640
 %INCLUDE R0019902;          /*     F_KJØNN             */              00012650
 %PAGE;                                                                 00012660
 %INCLUDE R0019904;          /*     F_GYLDIG_FNR        */              00012670
 %PAGE;                                                                 00012680
 %INCLUDE R0019905;          /*     F_ALDER             */              00012690
 %PAGE;                                                                 00012700
 %INCLUDE R0019910;          /*     F_NUMERISK          */              00012710
 %PAGE;                                                                 00012720
 %INCLUDE R0019913;          /*     F_SNU_DATO          */              00012730
 %PAGE;                                                                 00012740
 %INCLUDE R0019956;          /*     P9956_BER_G_CICS    */              00012750
 %PAGE;                                                                 00012760
 %INCLUDE R0019F21;          /*     ROSSFFB             */              00012770
 %PAGE;                                                                 00012780
                                                                        00012790
                                                                        00012800
                                                                        00012810
                                                                        00012820
 SLUTT:                                                                 00012830
    EXEC CICS ASKTIME;                                                  00012840
    PICX4 = EIBTIME/100;                                                00012850
    S0019XO.STOPP_TIDO = PICX4;                                         00012860
    FEIL_STRUC.FEIL_MELDING =                                           00012870
                             W_FNR !! '   ' !! S0019XO.STOPP_TIDO;      00012880
                                                                        00012890
    EXEC CICS WRITE DATASET('OMRFEIL')                                  00012900
         FROM (FEIL_STRUC.FEIL_MELDING) RIDFLD(FEIL_RBA) RBA;           00012910
                                                                        00012920
    IF DL1_KODE = 0      THEN                                           00012930
    DO;                                                                 00012940
       IF S0019XO.ANT_Ø_BEHO = S0019XO.ANT_LEST_STATUSO THEN            00012950
          MELDING =                                                     00012960
                 'KJØRINGEN ER NORMALT AVSLUTTET PÅ FØDSELSNUMMER: ' !! 00012970
                                                                W_FNR;  00012980
                                                                        00012990
       ELSE                                                             00013000
           IF MELDING = (78)' ' THEN                                    00013010
              MELDING =                                                 00013020
                  'KJØRINGEN ER AVSLUTTET PÅ FØDSELSNUMMER: ' !! W_FNR; 00013030
                                                                        00013040
                                                                        00013050
        S0019XO.MELDINGO = MELDING;                                     00013060
        FEIL_STRUC.FEIL_MELDING = MELDING;                              00013070
        EXEC CICS WRITE DATASET('OMRFEIL')                              00013080
              FROM (FEIL_STRUC.FEIL_MELDING) RIDFLD(FEIL_RBA) RBA;      00013090
                                                                        00013100
                                                                        00013110
        EXEC CICS SEND MAP ('S0019X') MAPSET ('S0019F3') WAIT           00013120
                                           DATAONLY;                    00013130
    END;                                                                00013140
                                                                        00013150
    EXEC CICS RETURN;                                                   00013160
                                                                        00013170
                                                                        00013180
                                                                        00013190
  CICS_ABEND:                                                           00013200
    MELDING = 'STOPP PÅ GRUNN AV CICS - ABEND, HOVEDFØDSELSNUMMER: ' !! 00013210
               W_FNR;                                                   00013220
    GOTO SLUTT;                                                         00013230
                                                                        00013240
                                                                        00013250
  MAP_UT_OG_RETUR:                                                      00013260
   PROC;                                                                00013270
      S0019XO.MELDINGO = MELDING;                                       00013280
      EXEC CICS SEND MAP ('S0019X') MAPSET('S0019F3') DATAONLY          00013290
                                              CURSOR;                   00013300
      EXEC CICS RETURN TRANSID('RF05') COMMAREA (KOM_OMR);              00013310
  END  MAP_UT_OG_RETUR;                                                 00013320
                                                                        00013330
                                                                        00013340
 DATABASE:                                                              00013350
   PROC(STYRING);                                                       00013360
                                                                        00013370
   DCL                                                                  00013380
     STYRING                               CHAR(5),                     00013390
     NULL                                  BUILTIN,                     00013400
     UNSPEC                                BUILTIN;                     00013410
                                                                        00013420
                                                                        00013430
                                                                        00013440
                                                                        00013450
  %SKIP;                                                                00013460
  /* **************************************************************** */00013470
  /*                                                                  */00013480
  /*     DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-   */00013490
  /*     KALL                                                         */00013500
  /*                                                                  */00013510
  /* **************************************************************** */00013520
     DCL                                                                00013530
       W01_PSB_NAVN                CHAR (8)       INIT('B0019F05');     00013540
     DCL                                                                00013550
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');         00013560
     DCL                                                                00013570
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00013580
  %PAGE;                                                                00013590
  /* **************************************************************** */00013600
  /*                                                                  */00013610
  /*     ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00013620
  /*                                                                  */00013630
  /*                                                                  */00013640
  /* **************************************************************** */00013650
                                                                        00013660
  %PAGE;                                                                00013670
  /* **************************************************************** */00013680
  /*                                                                  */00013690
  /*     DLI CALL-PARAMETRE                                           */00013700
  /*                                                                  */00013710
  /* **************************************************************** */00013720
  %SKIP(2);                                                             00013730
     DCL 1  W01_DLI_PARAM,                                              00013740
            2   W02_GU             CHAR (4)       INIT('GU  '),         00013750
            2   W02_PARM_CT_1      FIXED BIN(31)  INIT(1),              00013760
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT(3),              00013770
            2   W02_PARM_CT_4      FIXED BIN(31)  INIT(4);              00013780
                                                                        00013790
  %PAGE;                                                                00013800
                                                                        00013810
     IF STYRING = 'OPEN' THEN                                           00013820
        DO;                                                             00013830
           CALL   PLITDLI                        (W02_PARM_CT_3,        00013840
                                                  W01_PCB_FUNCTION,     00013850
                                                  W01_PSB_NAVN,         00013860
                                                  UIBPTR);              00013870
                                                                        00013880
           IF DLIUIB.UIBFCTR                    =    '00000000'B THEN   00013890
             DO;                                                        00013900
               PCB_UIB_PEKER_OMR.PCB_PEKER      =    UIBPCBAL;          00013910
               PCB_UIB_PEKER_OMR.UIB_PEKER      =    UIBPTR;            00013920
             END;                                                       00013930
           ELSE                                                         00013940
             DO;                                                        00013950
                MELDING =                                               00013960
                 'NOE ER GALT MED DATABASEN PÅ ÅPNINGSKALLET, KODE: ' !!00013970
                  UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);            00013980
                GOTO SLUTT;                                             00013990
             END;                                                       00014000
        END;                                                            00014010
     ELSE                                                               00014020
        DO;                                                             00014030
           CALL   PLITDLI                        (W02_PARM_CT_1,        00014040
                                                  W01_TERM_FUNCTION);   00014050
           KOM_OMR.PCB_UIB_PEKER = NULL;                                00014060
        END;                                                            00014070
                                                                        00014080
 END DATABASE;                                                          00014090
                                                                        00014100
                                                                        00014110
 ACCUM_FEIL:                                                            00014120
    PROC;                                                               00014130
                                                                        00014140
      IF DIV_PARAM_OMR.FEIL_MELD_NR   = 497 THEN                        00014150
         DO;                                                            00014160
                                                                        00014170
           FEIL_STRUC.FEIL_NR          = 0;                             00014180
           DIV_PARAM_OMR.FEIL_MELD_NR  = 0;                             00014190
           GOTO ACCUM_999;                                              00014200
         END;                                                           00014210
                                                                        00014220
      FEIL_STRUC.FEIL_MELDING = 'PROGRAM: ' !! DIV_PARAM_OMR.PROGRAM_ID 00014230
             !! ' FEIL VED LABEL: ' !! DIV_PARAM_OMR.FEIL_VED_LABEL   !!00014240
                ' DB-STATUSKODE: '  !! DIV_PARAM_OMR.DB_STATUS_KODE   !!00014250
                ' HOVEDFNR: '  !! W_FNR;                                00014260
                                                                        00014270
    EXEC CICS WRITE DATASET('OMRFEIL')                                  00014280
              FROM (FEIL_STRUC.FEIL_MELDING) RIDFLD(FEIL_RBA) RBA;      00014290
                                                                        00014300
      FEIL_STRUC.FEIL_NR = DIV_PARAM_OMR.FEIL_MELD_NR;                  00014310
      EXEC CICS LINK PROGRAM ('R0019921') COMMAREA(FEIL_STRUC);         00014320
                                                                        00014330
    EXEC CICS WRITE DATASET('OMRFEIL')                                  00014340
              FROM (FEIL_STRUC.FEIL_MELDING) RIDFLD(FEIL_RBA) RBA;      00014350
                                                                        00014360
                                                                        00014370
 ACCUM_999:                                                             00014380
                                                                        00014390
 END ACCUM_FEIL;                                                        00014400
                                                                        00014410
                                                                        00014420
 SKRIVE_MELD:                                                           00014430
   PROC;                                                                00014440
                                                                        00014450
    MELDING = 'SISTE FNR UNDER BEHANDLING :' !! W_FNR;                  00014460
                                                                        00014470
    FEIL_STRUC.FEIL_MELDING = MELDING;                                  00014480
                                                                        00014490
    EXEC CICS WRITE DATASET('OMRFEIL')                                  00014500
              FROM (FEIL_STRUC.FEIL_MELDING) RIDFLD(FEIL_RBA) RBA;      00014510
                                                                        00014520
                                                                        00014530
    DIV_PARAM_OMR.FEIL_MELD_NR = 0;                                     00014540
 END SKRIVE_MELD;                                                       00014550
                                                                        00014560
 SKRIV_OLA_REC: PROC;                                                   00014570
           ANT_OMR_FAM = ANT_OMR_FAM + 1;                               00014580
           S0019XO.ANT_OMR_FAMO = ANT_OMR_FAMX;                         00014590
                                                                        00014600
           EXEC CICS WRITE DATASET ('F0019F05')                         00014610
                                  FROM (OLARC)                          00014620
                                  RBA RIDFLD(RBA_PEKER);                00014630
              OLARC.BUP_GML    =  0;                                    00014640
              OLARC.BUP_NY     =  0;                                    00014650
              OLARC.SPT_NY     =  0;                                    00014660
              OLARC.TP_GML     =  0;                                    00014670
              OLARC.TP_GAR     =  0;                                    00014680
              OLARC.BUP_GML_EK =  0;                                    00014690
              OLARC.BUP_NY_EK  =  0;                                    00014700
              OLARC.SPT_NY_EK  =  0;                                    00014710
 END SKRIV_OLA_REC;                                                     00014720
 SEND_TEXT:                                                             00014730
   PROC;                                                                00014740
                                                                        00014750
                                                                        00014760
      S0019XO.MELDINGO = MELDING;                                       00014770
      S0019XO.MELD2O   = MELD2;                                         00014780
      EXEC CICS SEND MAP ('S0019X') MAPSET('S0019F3') DATAONLY          00014790
                                              CURSOR;                   00014800
                                                                        00014810
                                                                        00014820
 END SEND_TEXT;                                                         00014830
                                                                        00014840
 END R0019F;                                                            00014850
                                                                        00014860
