 /*       SIST ENDRET 20/07-98 14.27.15 AV   JDA7339                  */00000000
 /*       SIST ENDRET 12/06-98 11.45.08 AV   MHA7339                  */00000010
 /*       SIST ENDRET 19/05-98 13.01.44 AV   JDA7339                  */00000020
 /*       SIST ENDRET 19/05-98 12.48.52 AV   JDA7339                  */00000030
 /*       SIST ENDRET 24/10-97 11.56.30 AV   JDA7339                  */00000040
 /*       SIST ENDRET 02/10-97 08.48.29 AV   JDA7339                  */00000050
 /*       SIST ENDRET 10/09-97 15.12.39 AV   TSB7339                  */00000060
 /*       SIST ENDRET 19/08-97 14.35.48 AV   TSB7339                  */00000070
 /*       SIST ENDRET 15/08-97 10.30.13 AV   HLA7339                  */00000080
 /*       SIST ENDRET 04/08-97 14.10.06 AV   JDA7339                  */00000090
 /* ----------------------------------------------------------------- */00000100
 /* IDENTIFIKASJON:                                                   */00000110
 /*     R0014427 - UNDERPROGRAM I PL1                                 */00000120
 /*     PROGRAMMERER: MARTIN HELLE, JULI 1997                         */00000130
 /* ----------------------------------------------------------------- */00000140
 /* HENSIKT:                                                          */00000150
 /*     RUTINEN BENYTTES FOR BEREGNING AV LOVLIG INNTEKT FOR          */00000160
 /*     PERSONER SOM MOTTAR GRADERT UFØREPENSJON.                     */00000170
 /* ----------------------------------------------------------------- */00000180
 /* VED ENDRING:                                                      */00000190
 /*     R0017001 & R0010410 MÅ KOMPILERES!                            */00000200
 /* ----------------------------------------------------------------- */00000210
 B_LOVLIG_INNT :                                                        00000220
    PROC                                                                00000230
    /* (IND) */                                                         00000240
       (INNDATA_UFT_ÅM,                                                 00000250
        INNDATA_UFG,                                                    00000260
        INNDATA_INNTEKT_FØR_UP,                                         00000270
        INNDATA_INNT_DATO_ÅM,                                           00000280
        INNDATA_TIDSBEGR_ATTF,                                          00000290
        INNDATA_SKJERM_ATTF,                                            00000300
        INNDATA_BUP_GARANTI_KODE,                                       00000310
        INNDATA_YRKESKODE);                                             00000320
    /* -------------------------------------------------------------- */00000330
    DCL                                                                 00000340
       BUP_GARANTI_KODE           CHAR      (1),                        00000350
       DAGENS_DATO_ÅMD            FIXED DEC (7) INIT(0),                00000360
       DATE                       BUILTIN,                              00000370
       GARANTI_INNTEKT            DEC FIXED (5) INIT(0),                00000380
       G_NÅ                       DEC FIXED (5) INIT(0),                00000390
       G_NÅ_HALVE                 DEC FIXED (5) INIT(0),                00000400
       G_PÅ_UFT                   DEC FIXED (5) INIT(0),                00000410
       HJELPE_FELT                DEC FIXED (13,4) INIT(0),             00000420
       IND                        FIXED BIN(15),                        00000430
       INNDATA_BUP_GARANTI_KODE   CHAR      (1),                        00000440
       INNDATA_INNT_DATO_ÅM       DEC FIXED (5),                        00000450
       INNDATA_INNTEKT_FØR_UP     DEC FIXED (5),                        00000460
       INNDATA_SKJERM_ATTF        CHAR      (1),                        00000470
       INNDATA_TIDSBEGR_ATTF      CHAR      (1),                        00000480
       INNDATA_UFG                DEC FIXED (3),                        00000490
       INNDATA_UFT_ÅM             DEC FIXED (4),                        00000500
       INNDATA_YRKESKODE          DEC FIXED (3),                        00000510
       INNT_FØR_UP                DEC FIXED (5) INIT(0),                00000520
       INNT_DATO_ÅM               DEC FIXED (3) INIT(0),                00000530
       INNT_DATO_ÅMD              DEC FIXED (7) INIT(0),                00000540
       LOVLIG_INNTEKT             DEC FIXED (11) INIT(0),               00000550
       MAX                        BUILTIN,                              00000560
       SANN                       BIT(1) ALIGNED INIT ('1'B),           00000570
       SKJERM_ATTF                BIT(1) ALIGNED INIT ('0'B),           00000580
       TIDSBEGR_ATTF              BIT(1) ALIGNED INIT ('0'B),           00000590
       UFT_ÅMD                    DEC FIXED (7) INIT(0),                00000600
       UFØREGRAD                  DEC FIXED (3) INIT(0),                00000610
       VIRK_DATO_ÅMD              DEC FIXED (7) INIT(0),                00000620
       YRKESKODE                  FIXED DEC (3) INIT(0);                00000630
    %INCLUDE P0019925;            /* G_TAB_RE */                        00000640
    /* ============================================================== */00000650
    DAGENS_DATO_ÅMD  = DATE();                                          00000660
    UFT_ÅMD          = INNDATA_UFT_ÅM*100+01;                           00000670
    UFØREGRAD        = INNDATA_UFG;                                     00000680
    INNT_FØR_UP      = INNDATA_INNTEKT_FØR_UP;                          00000690
    INNT_DATO_ÅMD    = INNDATA_INNT_DATO_ÅM*100+01;                     00000700
    YRKESKODE        = INNDATA_YRKESKODE;                               00000710
    BUP_GARANTI_KODE = INNDATA_BUP_GARANTI_KODE;                        00000720
    IF INNDATA_TIDSBEGR_ATTF = 'J' THEN                                 00000730
       TIDSBEGR_ATTF = SANN;                                            00000740
    IF INNDATA_SKJERM_ATTF = 'J' THEN                                   00000750
       SKJERM_ATTF = SANN;                                              00000760
    IF UFØREGRAD > 0 &                                                  00000770
       INNT_FØR_UP > 0  &                                               00000780
       INNT_DATO_ÅMD > 0 &                                              00000790
       ^(YRKESKODE = 11 !                                               00000800
         YRKESKODE = 12 !                                               00000810
         YRKESKODE = 18 ) !                                             00000820
       (INNDATA_BUP_GARANTI_KODE = 'B' !                                00000830
        INNDATA_BUP_GARANTI_KODE = 'E' ) THEN                           00000840
       DO;                                                              00000850
          /* -------------------------------------------------------- */00000860
          /* IFLG. BREV UFØRHETSKONTORET 08.09.97:                    */00000870
          /*   "DERSOM UFØRETIDSPUNKTET ER FØR 1967, SKAL DET FØRSTE  */00000880
          /*    FASTSATTE GRUNNBELØPET BENYTTES I OPPJUSTERINGEN, DVS */00000890
          /*    KR 5.400, SOM BLE FASTSATT FRA 0167."                 */00000900
          /* -------------------------------------------------------- */00000910
          IF INNT_DATO_ÅM < 6700 THEN                                   00000920
             G_PÅ_UFT = 5400;                                           00000930
          DO I = 1 TO 60;                                               00000940
             IF INNT_DATO_ÅMD >= PERIODE_START_ÅMD(I) &                 00000950
                INNT_DATO_ÅMD <= PERIODE_SLUTT_ÅMD(I) THEN              00000960
                G_PÅ_UFT    = G_TAB_PERIODE.GRUNNBELØP(I);              00000970
             IF DAGENS_DATO_ÅMD >= PERIODE_START_ÅMD(I) &               00000980
                DAGENS_DATO_ÅMD <= PERIODE_SLUTT_ÅMD(I) THEN            00000990
                DO;                                                     00001000
                   G_NÅ           = G_TAB_PERIODE.GRUNNBELØP(I);        00001010
                   G_NÅ_HALVE     = G_TAB_PERIODE.GRUNNBELØP_HALVE(I);  00001020
                   I=99;                                                00001030
                END;                                                    00001040
          END; /* DO I = 1 TO 60 */                                     00001050
          /* -------------------------------------------------------- */00001060
          IF (INNDATA_BUP_GARANTI_KODE = 'B' !                          00001070
              INNDATA_BUP_GARANTI_KODE = 'E' ) THEN                     00001080
             DO;                                                        00001090
                /* -------------------------------------------------- */00001100
                /* GARANTI INNTEKT FØR UFØRHET, SE FORSKRIFT TIL      */00001110
                /* PARAGRAF 12-7, PARAGRAF 3 FJERDE LEDD.             */00001120
                /* -------------------------------------------------- */00001130
                GARANTI_INNTEKT = ( G_PÅ_UFT * 4.3 / 100 + 0.5);        00001140
                IF GARANTI_INNTEKT > INNT_FØR_UP THEN                   00001150
                   INNT_FØR_UP = GARANTI_INNTEKT;                       00001160
             END;                                                       00001170
          /* -------------------------------------------------------- */00001180
          LOVLIG_INNTEKT = INNT_FØR_UP *(100 - UFØREGRAD);              00001190
          HJELPE_FELT    = G_NÅ /G_PÅ_UFT;                              00001200
          LOVLIG_INNTEKT = LOVLIG_INNTEKT * HJELPE_FELT + 0.5;          00001210
          /* -------------------------------------------------------- */00001220
          /* LOVLIG INNTEKT - VANLIGE AVRUNDINGSREGLER                */00001230
          /* -------------------------------------------------------- */00001240
          LOVLIG_INNTEKT = (LOVLIG_INNTEKT +50)/100;                    00001250
          LOVLIG_INNTEKT = LOVLIG_INNTEKT * 100;                        00001260
          IF SKJERM_ATTF THEN                                           00001270
             LOVLIG_INNTEKT = LOVLIG_INNTEKT + G_NÅ;                    00001280
          ELSE                                                          00001290
             IF TIDSBEGR_ATTF THEN                                      00001300
                LOVLIG_INNTEKT = LOVLIG_INNTEKT + G_NÅ_HALVE;           00001310
       END;                                                             00001320
    RETURN (LOVLIG_INNTEKT);                                            00001330
 END B_LOVLIG_INNT;                                                     00001340
