 /*       SIST ENDRET 13/03-98 13.34.09 AV   JDA7339                  */00000000
 /*       SIST ENDRET 13/03-98 13.19.27 AV   JDA7339                  */00000010
 /*       SIST ENDRET 16/09-97 10.24.04 AV   JDA7339                  */00000020
 /*       SIST ENDRET 15/09-97 13.16.54 AV   JDA7339                  */00000030
 /*       SIST ENDRET 01/10-96 10.31.40 AV   JDA0310                  */00000040
 /*       SIST ENDRET 06/01-95 12.45.28 AV   TSB0310                  */00000050
 /*       SIST ENDRET 08/09-94 14.23.40 AV   HERMAN                   */00000060
 /*       SIST ENDRET 08/08-94 13.26.36 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 26/05-94 11.08.10 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 01/07-93 09.40.27 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 28/04-93 09.09.21 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 25/03-93 13.02.58 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 10/03-93 15.24.45 AV   TRUDE                    */00000120
 /*       SIST ENDRET 18/02-93 11.26.09 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 16/02-93 11.24.09 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 15/02-93 14.46.43 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 04/09-92 09.35.49 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 21/05-92 13.35.27 AV   HERMAN                   */00000170
 /*       SIST ENDRET 17/03-92 07.54.03 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 03/03-92 09.51.58 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 29/01-92 15.06.53 AV   HERMAN                   */00000200
 /*       SIST ENDRET 06/03-91 11.50.22 AV   DYBVIK                   */00000210
 /* *************************************************************** */  00000220
 /*IDENTIFIKASJON:                                                  */  00000230
 /*    R001N822 - UNDERPROGRAM I PLI                                */  00000240
 /*    PROGRAMMERER: TRUDE SPONBERG NOV 1990                        */  00000250
 /* *************************************************************** */  00000260
 /*HENSIKT:                                                         */  00000270
 /*    AJOURFØRE B02 MED OPPL. FRA E3-TRANS.VIRKDATO OG             */  00000280
 /*    FØRSTE-GANG-REG BLIR OPPDATERT I FLYTT-B01-TIL-B02.          */  00000290
 /* *************************************************************** */  00000300
 /*PROGRAMTILKNYTNING:                                              */  00000310
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV ETTERLATTPENS.*/  00000320
 /*    INCLUDES I R001N820                                          */  00000330
 /*BRUK:                                                            */  00000340
 /*    CALL AJOURFØR_B02_MED_E3_TRANS;                              */  00000350
 /*                                                                 */  00000360
 /* *************************************************************** */  00000370
                                                                        00000380
 %SKIP(2);                                                              00000390
 AJOURFØR_B02_MED_E3_TRANS:                                             00000400
   PROC;                                                                00000410
                                                                        00000420
  /* DCL W_STI_ÅM       FIXED DEC(5) INIT (0) FELTET ER DCL I HOVEDP*/  00000430
  /* PROBLEMER MED STI PGA DETTE . TRUDE 250393 */                      00000440
                                                                        00000450
     DCL W_TT_FRAMT     FIXED DEC(5) INIT (0);                          00000460
 /* ***************************************************************** */00000470
 /* DIV.OPPL.                                                         */00000480
 /* ***************************************************************** */00000490
                                                                        00000500
                                                                        00000510
      IF (B01.PENSJONSTYPE1 (SØKER_IND) = 'A' !                         00000520
 /*YS*/  B01.PENSJONSTYPE1 (SØKER_IND)  = 'U' !                         00000530
 /*YS*/  B01.PENSJONSTYPE1 (SØKER_IND)  = 'Y') THEN                     00000540
         B02.PENSJONSTYPE2 (SØKER_IND)  = 'E';                          00000550
      ELSE                                                              00000560
         DO;                                                            00000570
            B02.PENSJONSTYPE1 (SØKER_IND)  = 'E';                       00000580
            B02.PENSJONSTYPE2 (SØKER_IND)  = E3S.GP_OS_KODE;            00000590
         END;                                                           00000600
      B02.SPRÅK (SØKER_IND)             = E3S.SPRÅK;                    00000610
      B02.TKNR  (SØKER_IND)             = E3S.TKNR;                     00000620
      B02.SIVILSTAND(SØKER_IND)         = E3S.SIVILSTAND;               00000630
      B02.FØRSTE_GANG_REG(SØKER_IND)    = 'N';                          00000640
      B02.NAVN      (SØKER_IND)         = E3S.NAVN;                     00000650
                                                                        00000660
 /* ***************************************************************** */00000670
 /* BEREGNING AV TRYGDETID.                                           */00000680
 /* ***************************************************************** */00000690
                                                                        00000700
      W_VIRKDATO_ÅM           = F_SNU_DATO(E3S.VIRK_DATO_MÅ);           00000710
                                                                        00000720
      B02.STATUS.TT_16_66(SØKER_IND) =                                  00000730
                   E3SP.TT_FRA_1937ÅR * 12 + E3SP.TT_FRA_1937MND;       00000740
  IF E3S.FNR_EK =(11)'1' THEN                                           00000750
     B02.TT_FRAMT(SØKER_IND) = 0;                                       00000760
  ELSE                                                                  00000770
    DO;                                                                 00000780
      W_DØDSTP_ÅMD            = B01.DØDSDATO_ÅMD(AVDØD_IND);            00000790
      W_DØDSTP_ÅM             = B01.DØDSDATO_ÅMD(AVDØD_IND) / 100;      00000800
      B02.TT_FRAMT(SØKER_IND) = F_BEREGN_TT_FRAMT                       00000810
                                         (B02.FNR(SØKER_IND),           00000820
                                          W_DØDSTP_ÅM);                 00000830
     B02.ETTEPENS.SPT_1291(SØKER_IND)= B02.UFØRPENS.SPT_1291(AVDØD_IND);00000840
     B02.ETTEPENS.OPT_1291(SØKER_IND)= B02.UFØRPENS.OPT_1291(AVDØD_IND);00000850
     B02.ETTEPENS.PÅ_1291(SØKER_IND) = B02.UFØRPENS.PÅ_1291(AVDØD_IND); 00000860
                                                                        00000870
 /* ***************************************************************** */00000880
 /* OPPL. OM DEN DØDE                                                 */00000890
 /* ***************************************************************** */00000900
                                                                        00000910
      B02.STATUS.TT_16_66(AVDØD_IND) =                                  00000920
            E3SP.TT_FRA_1937_ÅR_EK * 12 + E3SP.TT_FRA_1937_MND_EK;      00000930
      B02.TT_FRAMT(AVDØD_IND) = F_BEREGN_TT_FRAMT                       00000940
                                         (B02.FNR(AVDØD_IND),           00000950
                                          W_DØDSTP_ÅM);                 00000960
      IF B01.STATUS.VILKÅR_8_4_3A(AVDØD_IND) = 'J'    THEN              00000970
         B02.STATUS.VILKÅR_8_4_3A(AVDØD_IND) = 'J';                     00000980
      ELSE                                                              00000990
         B02.STATUS.VILKÅR_8_4_3A(AVDØD_IND) = E3S.VILKÅR_8_4_EK;       00001000
      B02.FØRSTE_GANG_REG(AVDØD_IND)      = 'N';                        00001010
      DO I=1 TO 4 WHILE (E3S.VP_ÅR_EK(I) > 0);                          00001020
         B02.VERNEPLIKTÅR(AVDØD_IND,I) = E3S.VP_ÅR_EK(4);               00001030
      END;                                                              00001040
      IF (ALDER_67_EK.ÅR + 3)  < W_DØDSTP_ÅR    THEN;   /*HL0693*/      00001050
      ELSE                                                              00001060
      IF W_DØDSTP_ÅR > 67 THEN                  /*HL9709*/              00001070
      DO;                                                               00001080
        IF  B01.PI_KODE(AVDØD_IND,W_DØDSTP_ÅR - 1)  = 'F'  !            00001090
          B01.PI_KODE(AVDØD_IND,W_DØDSTP_ÅR - 1)  = ' '  THEN           00001100
          DO;                                                           00001110
             B02.PI(AVDØD_IND,W_DØDSTP_ÅR - 1)      = E3S.PI_EK / 100;  00001120
             B02.PI_KODE(AVDØD_IND,W_DØDSTP_ÅR - 1) = 'F';              00001130
          END;                                                          00001140
       END;                                                             00001150
    END;                                                                00001160
                                                                        00001170
 /* ***************************************************************** */00001180
 /* ETTERLATTPENSJON                                                  */00001190
 /* ***************************************************************** */00001200
                                                                        00001210
 %SKIP;                                                                 00001220
      B02.OMSORG_AVD_BA(SØKER_IND)     = E3S.OMSORG_AVD_BA;             00001230
      B02.VILKÅR_10_5(SØKER_IND)       = E3S.VILKÅR_10_5;               00001240
      B02.TP_PROSENT(SØKER_IND)        = 55;                            00001250
      B02.FORVENTET(SØKER_IND)         = E3S.FORVENTET / 100;           00001260
 %SKIP;                                                                 00001270
      W_ALDER_ÅM = F_ALDER(E3S.FNR,E3S.VIRK_DATO_MÅ);                   00001280
                                                                        00001290
 /********** HVIS SØKER ER MELLOM 67 OG 70 ÅR                         */00001300
                                                                        00001310
                                                                        00001320
      IF W_ALDER_ÅM > 6700 THEN                                         00001330
         DO;                                                            00001340
            B02.PENSJONSTYPE1(SØKER_IND)    = 'A';                      00001350
            B02.PENSJONSTYPE2(SØKER_IND)    = 'E';                      00001360
            B02.ALDERSP.APD  (SØKER_IND)    = 100;                      00001370
                                                                        00001380
 /* ENDRET 191286 BF: VILKÅR OM AT E3S.FAI MÅ VÆRE STØRRE ENN 0 ER   */ 00001390
 /*                   FJERNET FRA TESTEN NEDENFOR. FRAPP 441.        */ 00001400
                                                                        00001410
            IF W_ALDER_ÅM < 7001  THEN                                  00001420
               DO;                                                      00001430
                  B02.FAI_DATO_ÅM(SØKER_IND)      = W_VIRKDATO_ÅM;      00001440
                  B02.FAI(SØKER_IND)              = E3S.FAI / 100;      00001450
               END;                                                     00001460
         END;                                                           00001470
                                                                        00001480
 /* ***************************************************************** */00001490
 /* FRAMLEGGS-OPPLYSNINGER                                            */00001500
 /* ***************************************************************** */00001510
                                                                        00001520
 %SKIP;                                                                 00001530
      B02.FRAMLEGGSDATO_ÅM(SØKER_IND) =                                 00001540
                                       F_SNU_DATO(E3S.FRAMLEGGSDATO_MÅ);00001550
      B02.FRAMLEGGSKODE(SØKER_IND)     = E3S.FRAMLEGGSKODE;             00001560
                                                                        00001570
 /* ***************************************************************** */00001580
 /* YRKESSKADEOPPLYSNINGER                                            */00001590
 /* ***************************************************************** */00001600
                                                                        00001610
  IF E3S.YSKADE_TILLEGG = ' ' THEN                                      00001620
     DO;                                                                00001630
        IF B02.DØD_AV_YRKESSKADE(AVDØD_IND) = 'J'     THEN              00001640
           B02.DØD_AV_YRKESSKADE(SØKER_IND) = 'Y';                      00001650
        ELSE                                                            00001660
           B02.DØD_AV_YRKESSKADE(SØKER_IND) = ' ';                      00001670
     END;                                                               00001680
                                                                        00001690
  ELSE                                                                  00001700
     DO;                                                                00001710
        CALL KONTROLL_AJOURFØR_AVDØD_YP_E3;  /*R001N823*/               00001720
        IF FEIL_MELD_NR > 0      THEN                                   00001730
           GO TO RETUR;                                                 00001740
     END;                                                               00001750
                                                                        00001760
                                                                        00001770
 /* ***************************************************************** */00001780
 /* SPESIELLE OPPLYSNINGER                                            */00001790
 /* ***************************************************************** */00001800
                                                                        00001810
 %SKIP;                                                                 00001820
      IF E3S.NORSK_BOSATT    = 'N' !                                    00001830
         E3S.NORSK_BOSATT_EK = 'N' THEN                                 00001840
         DO;                                                            00001850
            B02.SPESOPPL.STATSBORGER(SØKER_IND)   = E3SP.STATSBORGER;   00001860
            B02.SPESOPPL.BOSATT(SØKER_IND)        = E3SP.BOSATT;        00001870
            B02.SPESOPPL.PENSJONSTRYGDET(SØKER_IND) =                   00001880
                                                E3SP.PENSJONSTRYGDET;   00001890
            B02.MINST_20ÅR_BOTID(SØKER_IND)  = E3SP.MINST_20ÅR;         00001900
            B02.FRAVIK_BOSATT_KONVENSJON(SØKER_IND)  =                  00001910
                                              E3SP.FRAVIK_KONVENSJON;   00001920
            B02.SPESOPPL.FRAVIK_FLYKTN(SØKER_IND) = E3SP.               00001930
                                                  FRAVIK_FLYKT;         00001940
   /*B02.SPESOPPL.OVERKOMP_UTL(SØKER_IND)  = E3SP.OVERKOMP_UTL  */      00001950
   /*LEGGES INN IGJEN - HL 9712 : */                                    00001960
     B02.SPESOPPL.OVERKOMP_UTL(SØKER_IND)  = E3SP.OVERKOMP_UTL;         00001970
            B02.IKKE_GP(SØKER_IND)               = E3SP.IKKE_GP;        00001980
            B02.KONVENSJON(SØKER_IND)  = E3SP.BEREGNING_KONVENSJON;     00001990
            B02.ETTEPENS.STI(SØKER_IND) = F_SNU_DATO(E3SP.STI);         00002000
                                                                        00002010
            IF E3S.NORSK_BOSATT    = 'N'    !               /*9501 TS*/ 00002020
               B02.DØDSDATO_ÅMD(AVDØD_IND)  > 930100 THEN   /*9501 TS*/ 00002030
               B02.TT_FRAMT(SØKER_IND) = 0;                             00002040
                                                                        00002050
            IF E3S.NORSK_BOSATT_EK = 'N'     THEN        /*93*/         00002060
               B02.TT_FRAMT(AVDØD_IND) = 0;              /*93*/         00002070
                                                                        00002080
            IF E3SP.STI  > 0 THEN  /* OVERSTYRER DØDSDATO */            00002090
               W_STI_ÅM  = F_SNU_DATO(E3SP.STI);                        00002100
            ELSE                                                        00002110
               W_STI_ÅM  = W_DØDSTP_ÅM;                                 00002120
          /*--------------------------------------------------------*/  00002130
          /* NYE REGLER FOR DØDSFALL FOM 01.93. KUN RETT TIL AVDØDES*/  00002140
          /* TRYGDETID. TRUDE 0193                                  */  00002150
          /*--------------------------------------------------------*/  00002160
    L111:                                                               00002170
         IF B02.DØDSDATO_ÅMD(AVDØD_IND)  > 930100  &                    00002180
            B02.SPESOPPL.BOSATT(SØKER_IND)  >  0 &       /*9303*/       00002190
            E3S.NORSK_BOSATT_EK = 'N'              THEN                 00002200
            DO;                                                         00002210
               E3SP.VILKÅR_10_5_NR2  = ' ';                             00002220
               IF ^(E3SP.PENSJONSTRYGDET   = 'J' ! /* & TIL ! 11.93*/   00002230
                    E3SP.MINST_20ÅR        = 'J' !                      00002240
                    E3SP.FRAVIK_KONVENSJON = 'J' !                      00002250
                    E3S.YSKADE_TILLEGG     = 'J' ) THEN                 00002260
                 DO;                                                    00002270
                    FEIL_VED_LABEL   = '111';                           00002280
                    FEIL_MELD_NR     =  494;                            00002290
                    GO TO RETUR;                                        00002300
                 END;                                                   00002310
               IF  E3SP.PENSJONSTRYGDET  = 'J' THEN                     00002320
                 DO;                                                    00002330
                   B02.TT_16_66(SØKER_IND) = 0;                         00002340
                   IF (B01.PENSJONSTYPE1 (SØKER_IND)  = 'A' !           00002350
 /*YS*/                B01.PENSJONSTYPE1 (SØKER_IND)  = 'U' !           00002360
 /*YS*/                B01.PENSJONSTYPE1 (SØKER_IND)  = 'Y') THEN       00002370
                     DO;                                                00002380
                         IF B01.TT_16_66(SØKER_IND) > 0 THEN            00002390
                            B02.TT_16_66(SØKER_IND) =                   00002400
                                              B01.TT_16_66(SØKER_IND);  00002410
                         ELSE                                           00002420
                           DO;                                          00002430
                              B02.TT_FØR_1967(SØKER_IND)   =            00002440
                                         B01.TT_FØR_1967(SØKER_IND);    00002450
                              B02.TT_ETTER_1966(SØKER_IND) =            00002460
                                         B01.TT_ETTER_1966(SØKER_IND);  00002470
                           END;                                         00002480
                     END;                                               00002490
                 END;                                                   00002500
            END; /*DØDSDATO > 9300 */                                   00002510
           /*93*/                                                       00002520
                                                                        00002530
         IF E3SP.VILKÅR_10_5_NR2  = 'J' THEN  /*RETT EGEN TT*/          00002540
          DO;                                                           00002550
            IF B02.TT_16_66(SØKER_IND) = 0 THEN                         00002560
               DO;                                                      00002570
                 B02.TT_FRAMT(SØKER_IND) =                              00002580
                  (ALDER_67_SØKER.ÅR * 12)                              00002590
                                 - (W_STI_ÅR * 12 + W_STI_M - 1);       00002600
                 IF B01.TT_16_66(SØKER_IND) > 0 THEN                    00002610
                    TT_SØKER  = (B01.TT_16_66(SØKER_IND) +              00002620
                                 B01.TT_FRAMT(SØKER_IND) + 11 ) / 12;   00002630
                 ELSE                                                   00002640
                    TT_SØKER   = B01.TT_FØR_1967(SØKER_IND) +           00002650
                                (B01.TT_ETTER_1966(SØKER_IND) +         00002660
                                 B01.TT_FRAMT(SØKER_IND) + 11) / 12;    00002670
                 B02.TT_16_66(SØKER_IND) = TT_SØKER * 12 -              00002680
                                 B02.TT_FRAMT(SØKER_IND);               00002690
               END;                                                     00002700
            ELSE                                                        00002710
                IF W_ALDER_ÅM < 6700   THEN                             00002720
                 DO;                                                    00002730
                  IF E3SP.VILKÅR_10_5_NR2  = 'J' THEN  /*RETT EGEN TT*/ 00002740
                      B02.STATUS.TT_FRAMT(SØKER_IND) =                  00002750
                                            F_BEREGN_TT_FRAMT_UTLAND    00002760
                                            (B02.FNR(SØKER_IND),        00002770
                                             W_STI_ÅM,                  00002780
                                             SØKER_IND);                00002790
                 END;                                                   00002800
          END;  /*RETT TIL EGEN TT*/                                    00002810
            IF B02.TT_16_66(AVDØD_IND)   = 0  &      /*TRUDE 040392*/   00002820
               E3S.FNR_EK  ^=(11)'1'       THEN      /*TIL HIT     */   00002830
               DO;                                                      00002840
               /*HER KAN VI FÅ NEGATIVT SVAR, TRUDE 250393*/            00002850
               /*B02.TT_FRAMT(AVDØD_IND) =                              00002860
                    (ALDER_67_EK.ÅR * 12)                               00002870
                             - (W_STI_ÅR * 12 + W_STI_M - 1)*/          00002880
               /*KORRIGERES SLIK:   */                                  00002890
                 W_TT_FRAMT  =                                          00002900
                    (ALDER_67_EK.ÅR * 12)                               00002910
                             - (W_STI_ÅR * 12 + W_STI_M - 1);           00002920
                 IF W_TT_FRAMT > 0  THEN                                00002930
                    B02.TT_FRAMT(AVDØD_IND) =  W_TT_FRAMT;              00002940
               /* KORR. HIT TRUDE 250393*/                              00002950
                                                                        00002960
                 IF B01.TT_16_66(AVDØD_IND) > 0 THEN                    00002970
                    TT_AVDØD  = (B01.TT_16_66(AVDØD_IND) +              00002980
                                 B01.TT_FRAMT(AVDØD_IND) + 11 ) / 12;   00002990
                 ELSE                                                   00003000
                    TT_AVDØD   = B01.TT_FØR_1967(AVDØD_IND) +           00003010
                                (B01.TT_ETTER_1966(AVDØD_IND) +         00003020
                                 B01.TT_FRAMT(AVDØD_IND) + 11) / 12;    00003030
                 B02.TT_16_66(AVDØD_IND) = TT_AVDØD * 12 -              00003040
                                 B02.TT_FRAMT(AVDØD_IND);               00003050
               DCL TT2 FIXED DEC(3);                                    00003060
               TT2 = B02.TT_16_66(AVDØD_IND);                           00003070
               END;                                                     00003080
            ELSE                                                        00003090
                IF W_ALDER_ÅM < 6700   &               /*TRUDE 040392*/ 00003100
  /* HL0496        E3S.VILKÅR_8_4_EK = 'J' &             TRUDE 030993*/ 00003110
                   E3S.FNR_EK  ^=(11)'1'       THEN    /*TIL HIT     */ 00003120
                 DO;                                                    00003130
                      B02.STATUS.TT_FRAMT(AVDØD_IND) =                  00003140
                                            F_BEREGN_TT_FRAMT_UTLAND    00003150
                                            (B02.FNR(AVDØD_IND),        00003160
                                             W_STI_ÅM,                  00003170
                                             AVDØD_IND);                00003180
                 END;                                                   00003190
         END;  /*NORSK BOSATT*/                                         00003200
                                                                        00003210
 /* ***************************************************************** */00003220
 /* SPESIELLE OPPLYSNINGER OM AVDØDE                                  */00003230
 /* ***************************************************************** */00003240
                                                                        00003250
 %SKIP;                                                                 00003260
      IF E3S.NORSK_BOSATT_EK = 'N' THEN                                 00003270
         DO;                                                            00003280
            B02.SPESOPPL.STATSBORGER(AVDØD_IND) =                       00003290
                                                 E3SP.STATSBORGER_EK;   00003300
            B02.SPESOPPL.BOSATT(AVDØD_IND)  = E3SP.BOSATT_EK;           00003310
            B02.SPESOPPL.FRAVIK_FLYKTN(AVDØD_IND) = E3SP.               00003320
                                                      FRAVIK_FLYKT_EK;  00003330
            IF E3SP.OVERKOMP_UTL_EK = 'J'         THEN                  00003340
               B02.SPESOPPL.OVERKOMP_UTL(AVDØD_IND)  =  'J';            00003350
            ELSE                                                        00003360
               B02.SPESOPPL.OVERKOMP_UTL(AVDØD_IND)  =  'N';            00003370
                                                                        00003380
                    /* DERSOM SØKER HAR 'J' I KONVENSJON, MÅ OGSÅ */    00003390
                    /* AVDØD HA 'J' PGA BEREGNING. TRUDE          */    00003400
                                                                        00003410
            B02.KONVENSJON(AVDØD_IND)  = E3SP.FRAVIK_KONVENSJON;        00003420
 /* ***************************************************************** */00003430
 /* DØDSHISTORIKK                                                     */00003440
 /* ***************************************************************** */00003450
                                                                        00003460
            B02.TT_16_66(AVDØD_IND) = E3SP.TT_FRA_1937_ÅR_EK * 12 +     00003470
                                      E3SP.TT_FRA_1937_MND_EK;          00003480
         END;                                                           00003490
 /*RULLERING AV INNTEKTER 9802 HL : */                                  00003500
                                                                        00003510
    IF B02.FORSI.PENSJONSINNTEKT(SØKER_IND) > 0  THEN                   00003520
       B02.FORSI.PENSJONSINNTEKT(SØKER_IND) =                           00003530
           F_RULL_FORSI(B02.G_DATO_ÅM(SØKER_IND),                       00003540
                 B02.VIRK_DATO_ÅM(SØKER_IND),                           00003550
                 B02.FORSI.PENSJONSINNTEKT(SØKER_IND));                 00003560
                                                                        00003570
    IF B02.FORSI.ARBEIDSINNTEKT(SØKER_IND) > 0  THEN                    00003580
       B02.FORSI.ARBEIDSINNTEKT(SØKER_IND) =                            00003590
           F_RULL_FORSI(B02.G_DATO_ÅM(SØKER_IND),                       00003600
                 B02.VIRK_DATO_ÅM(SØKER_IND),                           00003610
                 B02.FORSI.ARBEIDSINNTEKT(SØKER_IND));                  00003620
                                                                        00003630
                                                                        00003640
 /*YS*/ RETUR:                                                          00003650
                                                                        00003660
   END AJOURFØR_B02_MED_E3_TRANS;                                       00003670
