 /*       SIST ENDRET 02/04-93 10.01.05 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 29/03-93 09.03.39 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 25/03-93 14.52.47 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 10/12-92 08.52.55 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 08/12-92 12.44.07 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 18/06-91 13.57.18 AV   HERMAN                   */00000050
 /*       SIST ENDRET 07/05-91 15.34.44 AV   HERMAN                   */00000060
 /*       SIST ENDRET 26/04-91 11.43.35 AV   DYBVIK                   */00000070
 /*IDENTIFIKASJON:                                                    */00000080
 /*    R001NC04 - PROGRAM I PLI                                       */00000090
 /*    PROGRAMMERT AV                                                 */00000100
 /*HENSIKT:                                                           */00000110
 /*    PROGRAMMET BEHANDLER BARNEDELEN.                               */00000120
 /*ENDRING:                                                           */00000130
 /*    PROGRAMMET OVERFØR_F7_BARN ER SKILT UT OG LAGT I R001NC10.     */00000140
 /*                                                                   */00000150
 /*BRUK:                                                              */00000160
 /*    KONTROLL_F7_BARN                                               */00000170
 /*       (FEIL_FUNNET)                                               */00000180
 /*                                                                   */00000190
 /* ***************************************************************** */00000200
 %SKIP(2);                                                              00000210
 KONTROLL_F7_BARN:                                                      00000220
   PROC (FEIL_FUNNET);                                                  00000230
 %SKIP;                                                                 00000240
   DCL                                                                  00000250
      FEIL_FUNNET BIT (1);                                              00000260
   DCL                                                                  00000270
      1 FNR_REG,                                                        00000280
        2 FNR1         FIXED DEC(11),                                   00000290
        2 FNR2         FIXED DEC(11),                                   00000300
        2 BRUKERID     CHAR     ( 4);                                   00000310
    DCL   FELLS_BARN_J   CHAR     ( 1),                                 00000320
          FELLS_BARN_N   CHAR     ( 1);                                 00000330
   DCL                                                                  00000340
      (FEIL19,                                                          00000350
      FEIL20,                                                           00000360
      FEIL21,                                                           00000370
      FEIL22) BIT (1);                                                  00000380
      FEIL19 = '0'B;                                                    00000390
      FEIL20 = '0'B;                                                    00000400
      FEIL21 = '0'B;                                                    00000410
      FEIL22 = '0'B;                                                    00000420
   DCL                                                                  00000430
      TELL                        FIXED BIN(15),                        00000440
      TELL_BARN                   FIXED BIN(15),                        00000450
      ANT_BARN                    FIXED BIN(15);                        00000460
   DCL                                                                  00000470
      ALDER FIXED(5);                                                   00000480
      TELL_BARN = 0;                                                    00000490
                                                                        00000500
                                                                        00000510
                                                                        00000520
      FELLS_BARN_N  = ' ';                                              00000530
      FELLS_BARN_J  = ' ';                                              00000540
      FNR_REG.BRUKERID =    DIV_PARAM_OMR.CICS_IND;                     00000550
                                                                        00000560
      CALL BLANK_F7_BARN_REST;                                          00000570
                                                                        00000580
      DO ANT_BARN = 1 TO F7S.BT_ANT;                                    00000590
         IF F_FELT_PIC_CHAR11(F7B.FNR_BARN(ANT_BARN)) ^= (11)'0' THEN   00000600
            DO;                                                         00000610
               IF ^F_NUMERISK(F_FELT_PIC_CHAR11(F7B.FNR_BARN(ANT_BARN)))00000620
               THEN                                                     00000630
                  DO;                                                   00000640
                     IF ^FEIL19 THEN                                    00000650
                        DO;                                             00000660
                           FEIL19 = '1'B;                               00000670
                           F7B.FNR_BARNNR(ANT_BARN) = 200;              00000680
                        END;                                            00000690
                     ELSE                                               00000700
                        F7B.FNR_BARNNR(ANT_BARN) = 200;                 00000710
                  END;                                                  00000720
               ELSE                                                     00000730
               IF ^ F_GYLDIG_FNR(F7B.FNR_BARN(ANT_BARN)) THEN           00000740
                  DO;                                                   00000750
                     IF ^FEIL20 THEN                                    00000760
                        DO;                                             00000770
                           FEIL20 = '1'B;                               00000780
                           F7B.FNR_BARNNR(ANT_BARN) = 20;               00000790
                        END;                                            00000800
                     ELSE                                               00000810
                        F7B.FNR_BARNNR(ANT_BARN) = 999;                 00000820
                  END;                                                  00000830
               ELSE                                                     00000840
                  DO;                                                   00000850
                    FNR_REG.FNR1 = F7B.FNR_BARN(ANT_BARN);              00000860
                    EXEC CICS LINK PROGRAM('R0019906')COMMAREA(FNR_REG);00000870
                    IF FNR_REG.FNR2 > 0 THEN                            00000880
                      DO;                                               00000890
                         F7B.FNR_BARNNR(ANT_BARN) = 203;                00000900
                         F7B.FNR_GML_BARN(ANT_BARN) =                   00000910
                         F7B.FNR_BARN(ANT_BARN);                        00000920
                         F7B.FNR_BARN(ANT_BARN) = FNR_REG.FNR2;         00000930
                      END;                                              00000940
                     ALDER =                                            00000950
                     F_ALDER(F7B.FNR_BARN(ANT_BARN),F7S.VIRK_DATO_MÅ);  00000960
                     IF ALDER > 1800 THEN                               00000970
                        DO;                                             00000980
                           IF ^FEIL21 THEN                              00000990
                              DO;                                       00001000
                                 FEIL21 = '1'B;                         00001010
                                 F7B.FNR_BARNNR(ANT_BARN) = 21;         00001020
                              END;                                      00001030
                           ELSE                                         00001040
                              F7B.FNR_BARNNR(ANT_BARN) = 999;           00001050
                        END;                                            00001060
                     ELSE                                               00001070
                        IF ALDER < 1 THEN                               00001080
                           DO;                                          00001090
                              IF ^FEIL22 THEN                           00001100
                                 DO;                                    00001110
                                    FEIL22 = '1'B;                      00001120
                                    F7B.FNR_BARNNR( ANT_BARN) = 22;     00001130
                                 END;                                   00001140
                              ELSE                                      00001150
                                 F7B.FNR_BARNNR( ANT_BARN) = 999;       00001160
                           END;                                         00001170
                  END;                                                  00001180
               IF F7B.FELLES_BARN(ANT_BARN) = 'J' !                     00001190
                  F7B.FELLES_BARN(ANT_BARN) = 'N' THEN                  00001200
                  DO;                                                   00001210
                  END;                                                  00001220
               ELSE                                                     00001230
                     DO;                                                00001240
                        FEIL_FUNNET = '1'B;                             00001250
                        F7B.FELLES_BARNNR(ANT_BARN) = 272;              00001260
                     END;                                               00001270
               IF F7B.FELLES_BARN(ANT_BARN) = 'J'  THEN                 00001280
                        FELLS_BARN_J  = 'J';                            00001290
                                                                        00001300
               IF F7B.FELLES_BARN(ANT_BARN) = 'N' &                     00001310
                  ARBEIDSINNTEKT_EK > 0               THEN              00001320
                     DO;                                                00001330
                        FELLS_BARN_N  = 'J';                            00001340
             /*         F7B.FELLES_BARNNR(ANT_BARN) = 384;     */       00001350
                     END;                                               00001360
                                                                        00001370
               TELL_BARN = TELL_BARN + 1;                               00001380
            END;                                                        00001390
         ELSE                                                           00001400
            LEAVE;                                                      00001410
      END;                                                              00001420
      IF FELLS_BARN_J  = ' ' &                                          00001430
         FELLS_BARN_N  = 'J' THEN                                       00001440
         DO;                                                            00001450
           F7B.FELLES_BARNNR(1) = 384;                                  00001460
           FEIL_FUNNET = '1'B;                                          00001470
         END;                                                           00001480
  /*                                                                    00001490
      IF ^FEIL_FUNNET     &                                             00001500
          F7S.TILL_EK = 'J'   THEN                                      00001510
         CALL KONTROLL_ARBEIDSINNTEKT (F7S.VIRK_DATO_MÅ);               00001520
  */                                                                    00001530
                                                                        00001540
      IF ^ FEIL_FUNNET THEN                                             00001550
        IF F7S.BT_ANT ^= TELL_BARN THEN                                 00001560
           DO;                                                          00001570
              FEIL_FUNNET = '1'B;                                       00001580
              F7S.BT_ANTNR = 23;                                        00001590
           END;                                                         00001600
                                                                        00001610
      FEIL_FUNNET = FEIL_FUNNET ! FEIL19 ! FEIL20 ! FEIL21 ! FEIL22;    00001620
                                                                        00001630
  /*  HER SJEKKES OM ET FØDSELSNUMMER ER SKREVET MER ENN EN GANG    */  00001640
      IF ^FEIL_FUNNET THEN                                              00001650
        IF F7S.BT_ANT > 0 THEN                                          00001660
           DO ANT_BARN = 1 TO F7S.BT_ANT;                               00001670
              DO TELL = ANT_BARN TO F7S.BT_ANT;                         00001680
                 IF TELL ^= ANT_BARN THEN                               00001690
                    IF F7B.FNR_BARN(TELL) = F7B.FNR_BARN(ANT_BARN) THEN 00001700
                       DO;                                              00001710
                          FEIL_FUNNET = '1'B;                           00001720
                          F7B.FNR_BARNNR(ANT_BARN) = 124;               00001730
                          F7B.FNR_BARNNR(TELL) = 999;                   00001740
                       END;                                             00001750
              END;                                                      00001760
           END;                                                         00001770
                                                                        00001780
   END KONTROLL_F7_BARN;                                                00001790
                                                                        00001800
                                                                        00001810
