 /*       SIST ENDRET 12/05-87 08.33.58 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 11/11-86 11.28.23 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 07/02-86 10.15.14 AV   FARVIK                   */00000020
 /*       SIST ENDRET 27/08-85 11.19.49 AV   FARVIK                   */00000030
 /*       SIST ENDRET 04/06-84 09.57.31 AV   FARVIK                   */00000040
 %PAGE;                                /*   */                          00000050
 /*IDENTIFIKASJON:                                                    */00000060
 /*    R0011202  -                                                    */00000070
 /*    PROGRAMMERER: JAN, AUGUST 81                                   */00000080
 /*HENSIKT:                                                           */00000090
 /*    R0011202 INNHOLDER:                                            */00000100
 /*      PROSEDYRER FOR BLANKING AV FT_TRANS_OMR.                     */00000110
 /*ENDRING:                                                           */00000120
 /*    PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL          */00000130
 /*    FT_TRANS_OMR ER SKILT UT OG LAGT I R0011209. 050587 BRITT      */00000140
 /*PROGRAMTILKNYTNING:                                                */00000150
 /*    PROSEDYRENE INCLUDES I BEHANDLINGA AV FORSØRGINGSTILLEGG FOR   */00000160
 /*    EKTEFELLE OG /ELLER BARN TIL DET MASKINELLE                    */00000170
 /*    FOLKETRYGDSYSTEMET.                                            */00000180
 /*    ARBEIDSOMRÅDE: P0011201  (LIGGER I R001.TEST.COPYLIB)          */00000190
 /*BRUK:                                                              */00000200
 /*    %INCLUDE R0011202;                                             */00000210
 /*    BLANK_FT_SØKER:    BLANKER SØKERDELEN                          */00000220
 /*    BLANK_FT_BARN:     BLANKER BARNEDELEN                          */00000230
 /*    BLANK_FT_MELDNR:   SETTER 0 I MELDINGSNUMMERNE                 */00000240
 %PAGE;                                /*   */                          00000250
 /* ***************************************************************** */00000260
 /*                                                                   */00000270
 /*    PROSEDYREN BLANKER FT_SØKERDELEN I FT_TRANS_OMR I              */00000280
 /*    KOM_OMR FOR FORSØRGINGSTILLEGG EKTEFELLE OG/ELLER BARN.        */00000290
 /*                                                                   */00000300
 /* ***************************************************************** */00000310
 %SKIP(2);                             /*   */                          00000320
 BLANK_FT_SØKER:                                                        00000330
   PROC;                                                                00000340
      FTS.REGDATO = 0;                                                  00000350
      FTS.TERMID = '    ';                                              00000360
      FTS.FNR = 0;                                                      00000370
      FTS.FNR_GML = 0;                                                  00000380
      FTS.TKNR = 0;                                                     00000390
      FTS.TILL_EK = ' ';                                                00000400
      FTS.BT_ANT = 0;                                                   00000410
      FTS.VIRK_DATO_MÅ = 0;                                             00000420
      FTS.FNR_EK = 0;                                                   00000430
      FTS.FNR_GML_EK = 0;                                               00000440
      FTS.NAVN_EK = (25)' ';                                            00000450
      FTS.BOSATT_UTL = ' ';                                             00000460
      FTS.TT_F67_EK = 0;                                                00000470
      FTS.TT_E66_Å_EK = 0;                                              00000480
      FTS.TT_E66_M_EK = 0;                                              00000490
      FTS.EK_INNT = ' ';                                                00000500
   END BLANK_FT_SØKER;                                                  00000510
 %PAGE;                                /*   */                          00000520
 /* ***************************************************************** */00000530
 /*                                                                   */00000540
 /*    PROSEDYREN BLANKER FT_BARNEDELEN I FT_TRANS_OMR I              */00000550
 /*    KOM_OMR FOR FORSØRGINGSTILLEGG FOR EKTEFELLE OG/ELLER BARN.    */00000560
 /*                                                                   */00000570
 /* ***************************************************************** */00000580
 %SKIP;                                                                 00000590
 BLANK_FT_BARN:                                                         00000600
   PROC;                                                                00000610
   DCL                                                                  00000620
      ANT_BARN FIXED BIN (15);                                          00000630
 %SKIP;                                                                 00000640
      DO ANT_BARN = 1 TO 8;                                             00000650
         FTB.FNR_BARN(ANT_BARN) = 0;                                    00000660
         FTB.RBT_BARN(ANT_BARN) = ' ';                                  00000670
         FTB.FNR_GML_BARN(ANT_BARN) = 0;                                00000680
      END;                                                              00000690
   END BLANK_FT_BARN;                                                   00000700
 %PAGE;                                /* */                            00000710
 /* ***************************************************************** */00000720
 /*                                                                   */00000730
 /*    PROSEDYRE FOR Å SETTE 0  MELDINGSNUMMERNE I FT_TRANS_OMR I     */00000740
 /*    KOM_OMR.                                                       */00000750
 /*                                                                   */00000760
 /* ***************************************************************** */00000770
 %SKIP(2);                                                              00000780
 BLANK_FT_MELDNR:                                                       00000790
   PROC;                                                                00000800
   DCL                                                                  00000810
      ANT_BARN FIXED BIN (15);                                          00000820
 %SKIP(2);                                                              00000830
 /*  0 I MELDINGSNUMMERNE I  SØKERDELEN   */                            00000840
 %SKIP(2);                                                              00000850
      FTS.REGDATONR = 0;                                                00000860
      FTS.TERMIDNR = 0;                                                 00000870
      FTS.FNRNR = 0;                                                    00000880
      FTS.TKNRNR = 0;                                                   00000890
      FTS.TILL_EKNR = 0;                                                00000900
      FTS.BT_ANTNR = 0;                                                 00000910
      FTS.VIRK_DATO_MÅNR = 0;                                           00000920
      FTS.FNR_EKNR = 0;                                                 00000930
      FTS.NAVN_EKNR = 0;                                                00000940
      FTS.BOSATT_UTLNR = 0;                                             00000950
      FTS.TT_F67_EKNR = 0;                                              00000960
      FTS.TT_E66_Å_EKNR = 0;                                            00000970
      FTS.TT_E66_M_EKNR = 0;                                            00000980
      FTS.EK_INNTNR     = 0;                                            00000990
 %SKIP(2);                             /*  */                           00001000
 /*  0 I MELDINGSNUMMERNE I  BARNEDELEN   */                            00001010
 %SKIP(2);                                                              00001020
      DO ANT_BARN = 1 TO 8;                                             00001030
         FTB.FNR_BARNNR(ANT_BARN) = 0;                                  00001040
         FTB.RBT_BARNNR(ANT_BARN) = 0;                                  00001050
      END;                                                              00001060
   END BLANK_FT_MELDNR;                                                 00001070
