 /*       SIST ENDRET 02/03-98 12.37.32 AV   JDA7339                  */00000000
 /*       SIST ENDRET 02/03-98 12.34.38 AV   JDA7339                  */00000010
 /*       SIST ENDRET 19/09-97 09.22.57 AV   JDA7339                  */00000020
 /*       SIST ENDRET 19/09-97 09.21.57 AV   JDA7339                  */00000030
 /*       SIST ENDRET 16/09-97 10.24.11 AV   JDA7339                  */00000040
 /*       SIST ENDRET 15/09-97 13.30.58 AV   JDA7339                  */00000050
 /*       SIST ENDRET 29/08-97 12.28.01 AV   JDA7339                  */00000060
 /*       SIST ENDRET 28/08-97 08.52.42 AV   SPA7339                  */00000070
 /*       SIST ENDRET 28/07-97 12.34.04 AV   HLA7339                  */00000080
 /*       SIST ENDRET 19/03-97 10.44.35 AV   JDA7339                  */00000090
 /*       SIST ENDRET 10/07-96 14.49.39 AV   HLB0310                  */00000100
 /*       SIST ENDRET 28/02-96 08.38.35 AV   JDA0310                  */00000110
 /*       SIST ENDRET 20/02-96 13.10.09 AV   JDA0310                  */00000120
 /*       SIST ENDRET 30/01-96 16.30.14 AV   HLB0310                  */00000130
 /*       SIST ENDRET 18/01-96 08.42.13 AV   HLB0310                  */00000140
 /*       SIST ENDRET 02/11-95 14.49.04 AV   TSB0310                  */00000150
 /*       SIST ENDRET 23/08-95 10.18.21 AV   TSB0310                  */00000160
 /*       SIST ENDRET 18/08-95 10.32.02 AV   TSB0310                  */00000170
 /*       SIST ENDRET 06/01-95 10.45.29 AV   TSB0310                  */00000180
 /*       SIST ENDRET 04/01-95 13.47.17 AV   JDA0310                  */00000190
 /*       SIST ENDRET 16/12-94 13.04.46 AV   JDA0310                  */00000200
 /*       SIST ENDRET 23/11-94 14.21.06 AV   JDA0310                  */00000210
 /*       SIST ENDRET 10/02-94 13.28.45 AV   DYBVIK                   */00000220
 /*       SIST ENDRET 24/01-94 15.40.37 AV   TRUDE                    */00000230
 /*       SIST ENDRET 15/12-93 12.14.27 AV   DYBVIK                   */00000240
 /*       SIST ENDRET 26/10-93 11.10.52 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 22/09-93 11.55.30 AV   DYBVIK                   */00000260
 /*       SIST ENDRET 21/12-92 11.57.14 AV   DYBVIK                   */00000270
 /*       SIST ENDRET 24/08-92 12.27.21 AV   DYBVIK                   */00000280
 /*       SIST ENDRET 12/06-92 13.52.02 AV   TRUDE                    */00000290
 /*       SIST ENDRET 24/04-92 13.15.03 AV   HERMAN                   */00000300
 /*       SIST ENDRET 31/03-92 13.29.14 AV   HERMAN                   */00000310
 /*       SIST ENDRET 25/02-92 15.33.04 AV   HERMAN                   */00000320
 /*       SIST ENDRET 17/02-92 13.44.51 AV   DYBVIK                   */00000330
 /*       SIST ENDRET 13/12-91 12.21.13 AV   DYBVIK                   */00000340
 /*       SIST ENDRET 11/12-90 13.23.33 AV   DYBVIK                   */00000350
 /*       SIST ENDRET 26/03-90 08.47.19 AV   DYBVIK                   */00000360
 /*       SIST ENDRET 11/01-90 09.04.49 AV   DYBVIK                   */00000370
 /*       SIST ENDRET 13/12-89 09.24.09 AV   DYBVIK                   */00000380
 /*       SIST ENDRET 11/12-89 14.35.22 AV   DYBVIK                   */00000390
 /*       SIST ENDRET 01/12-89 08.39.55 AV   DYBVIK                   */00000400
 /*       SIST ENDRET 31/03-87 08.53.45 AV   DYBVIK                   */00000410
 /*       SIST ENDRET 02/12-86 13.22.52 AV   DYBVIK                   */00000420
 /*       SIST ENDRET 23/05-86 08.47.39 AV   HERMAN                   */00000430
 /*       SIST ENDRET 28/01-86 14.36.26 AV   HERMAN                   */00000440
 /*       SIST ENDRET 29/05-85 12.34.41 AV   HERMAN                   */00000450
 /*       SIST ENDRET 28/03-85 08.16.04 AV   DYBVIK                   */00000460
 /*       SIST ENDRET 01/02-85 12.28.23 AV   OLAV                     */00000470
 /*       SIST ENDRET 08/02-84 12.54.58 AV   OLAV                     */00000480
 /*       SIST ENDRET 18/01-84 08.40.19 AV   OLAV                     */00000490
 /*       SIST ENDRET 26/10-83 09.40.34 AV   OLAV                     */00000500
 /*       SIST ENDRET 18/05-83 11.59.13 AV   OLAV                     */00000510
 /*       SIST ENDRET 09/05-83 11.49.39 AV   OLAV                     */00000520
 /* ***************************************************************** */00000530
 /*IDENTIFIKASJON:                                                    */00000540
 /*    R0014131 - BEREGN_TP_ETTERLATT_AP - UNDERPROGRAM I PLI         */00000550
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982                           */00000560
 /*    ENDRET JULI 82 AV KARIN,TOTALT ENDRET AV R.FARVIK.             */00000570
 /*HENSIKT:                                                           */00000580
 /*    PROGRAMMET REGNER UT EGEN TP OG 55 PROSENT AV EGEN OG AVDØDES  */00000590
 /*    TP, VELGER HØYESTE TP, OPPDATERER B02 MED TP, SLUTTPOENGTALL,  */00000600
 /*    OVERKOMP.POENGTALL OG POENGÅR.                                 */00000610
 /*    OPPDATERER EVT. YRKEPENS.YPT OG YPT_KODE FOR AVDØDE            */00000620
 /*PROGRAMTILKNYTNING:                                                */00000630
 /*    PROGRAMMET BLIR INKLUDERT I R0014101-(BEREGN_ETTERLATT_AP)     */00000640
 /*    OG CALLET FRA               R0014121-(BEREGN_ETTERLATT_AP_DEL1)*/00000650
 /*BRUK:                                                              */00000660
 /*    CALL BEREGN_TP_ETTERLATT_AP                                    */00000670
 /*ENDRING:                                                           */00000680
 /*    DET ER LAGT INN FJERNING AV POENGILLEGGSOPPLYSNINGER NÅR DET   */00000690
 /*    IKKE GIS POENGTILLEGG LENGER           6/2 84   OLAV           */00000700
 /*ENDRING:                                                           */00000710
 /*    DET ER GJORT ENDRING I BEREGNINGEN AV TP NåR SIVILSTAND = S    */00000720
 /*                                          28/3 85  J.Y. DYBVIK     */00000730
 /*ENDRING:                                                           */00000740
 /*    SKILT PERSON SKAL HA POENGTILLEGG                              */00000750
 /*                                          29.5.85 HERMAN LARSSEN   */00000760
 /*ENDRING:                                                           */00000770
 /*    SKILT PERSON MED '0' PROSENT AV AVDØDES TP FÅR LIKEVEL         */00000780
 /*    IKKE POENGTILLEGG - FRAPP 302.                                 */00000790
 /*                                          28.1.86 HERMAN LARSSEN   */00000800
 /*ENDRING 28.11.86 - HL                                            */  00000810
 /*    VALG AV POENGREKKE SKAL FORETAS ETTER EN SAMMENLIGNING       */  00000820
 /*    AV PENSJON MED EVT. POENGTILLEGG. ALTERNATIV POREKKE ER      */  00000830
 /*    LAGT UT PÅ PLASS 12(KVINNE) ELLER 13(MANN).                  */  00000840
 /*ENDRING 23.10.90 - TS UNGE UFØRE FØR 1967 FÅR ENDRET SPT_GARANTI */  00000850
 /*                      FRA 1.6 TIL 2 FRA 0191.                    */  00000860
 /* *************************************************************** */  00000870
 /* ***************************************************************** */00000880
                                                                        00000890
 BEREGN_TP_ETTERLATT_AP: PROC;                                          00000900
                                                                        00000910
                                                                        00000920
  DCL                                                                   00000930
     W_TP_ALT           FIXED DEC(7) INIT (0),                          00000940
     W_TP               FIXED DEC(7) INIT (0),                          00000950
     W2_TP              FIXED DEC(7) INIT (0),                          00000960
     TP_EK              FIXED DEC(7) INIT (0),                          00000970
     FORHØY_IND         CHAR(1);                                        00000980
                                                                        00000990
  DCL TP_GARANTI        FIXED DEC(11,4) ,        /*UF*/                 00001000
      TP_GARANTI1       FIXED DEC(5);            /*UF*/                 00001010
 DCL  SPT_GARANTI       FIXED DEC(3,2) INIT (0);          /*UF*/        00001020
                                                                        00001030
  DCL W_GARANTI_TP     FIXED DEC(11,4) ;        /*UF*/                  00001040
  DCL W_GAR_TP         FIXED DEC(5) ;           /*UF*/                  00001050
                                                                        00001060
                                                                        00001070
 DCL                                                                    00001080
   1 W_FNR                   PIC'(11)9';                                00001090
 DCL                                                                    00001100
   1 FNR_R DEF W_FNR,                                                   00001110
     2 DAG                     PIC '99',                                00001120
     2 MND                     PIC '99',                                00001130
     2 ÅR                      PIC '99',                                00001140
     2 ÅRHUNDRE                PIC '9',                                 00001150
     2 FILLER                  PIC '(4)9';                              00001160
                                                                        00001170
                                                                        00001180
 DCL                                                                    00001190
     W_FNR_EK    PIC '(11)9';                                           00001200
 DCL                                                                    00001210
     1 FNR_EK_R       DEF W_FNR_EK,                                     00001220
       2 DAG_EK       PIC'99',                                          00001230
       2 MND_EK       PIC'99',                                          00001240
       2 ÅR_EK        PIC'99',                                          00001250
       2 ÅRHUNDRE_EK  PIC'9',                                           00001260
       2 FILLER_EK    PIC'(4)9';                                        00001270
                                                                        00001280
  DCL ÅR_FYLLER_67_SØ FIXED DEC (3) INIT(0);                            00001290
  DCL ÅR_FYLLER_67    FIXED DEC (3) INIT(0);                            00001300
  DCL ÅR_FYLLER_69    FIXED DEC (3) INIT(0);                            00001310
  DCL ÅR_E91          FIXED DEC (3) INIT(0);                            00001320
                                                                        00001330
 DCL DØDSDATO_ÅMD  PIC '(6)9';                                          00001340
 DCL DØDSÅR DEF DØDSDATO_ÅMD POS(1)     PIC '99';                       00001350
 DCL PÅ_FØR92         FIXED DEC (3)  INIT (0);                          00001360
 DCL SISTE_UFØRHIST   FIXED DEC (5)  INIT (0);                          00001370
 DCL SISTE_UFØRHIST_EK   FIXED DEC (5)  INIT (0);                       00001380
 DCL FAKTOR1          FIXED DEC (13,4)  INIT (0);                       00001390
 DCL FAKTOR2          FIXED DEC (13,4)  INIT (0);                       00001400
 DCL ALDER            PIC 'S99999';                                     00001410
 DCL PÅ_ETTER91_SØKER CHAR (1) INIT ('N');                              00001420
 DCL PÅ_ETTER91_EK    CHAR (1) INIT ('N');                              00001430
 DCL K                FIXED BIN (15);                                   00001440
 DCL FRADRAG          FIXED DEC (3) INIT (0);                           00001450
 DCL HL_PÅ_ETTER91    FIXED DEC (3) INIT (0);                           00001460
 DCL W_ÅR_E91         FIXED DEC (3) INIT (0);                           00001470
 DCL  TEST_UFT        FIXED DEC (4) INIT(0);                            00001480
 DCL RETUR_POENG      FIXED DEC (3,2) INIT(0);                          00001490
    DCL FIXED_DEC5      FIXED DEC (5)    INIT (0);  /*HL*/              00001500
    DCL DØDSDATO_ÅM      PIC '9999'      INIT (0);  /*HL*/              00001510
    DCL ALDER_VED_DØD    PIC 'S99999'    INIT (0);  /*HL*/              00001520
                                                                        00001530
 /* %INCLUDE P0014002 */                                                00001540
                                                                        00001550
 %SKIP(3);                                                              00001560
  DØDSDATO_ÅMD     = B02.DØDSDATO_ÅMD(BER_EK_IND);                      00001570
  W_FNR_EK         = B02.FNR(BER_EK_IND);                               00001580
                                                                        00001590
  ÅR_E91            = 0;                                                00001600
  W_FNR            = B02.FNR(BER_SØ_IND);                               00001610
  ALDER = F_ALDER(W_FNR,F_SNU_DATO(B02.VIRK_DATO_ÅM(BER_SØ_IND)));      00001620
                                                                        00001630
   /* TILLEGG 150196 TRUDE */                                           00001640
  IF  FNR_R.ÅR > 24 & FNR_R.ÅRHUNDRE < 5 THEN                           00001650
     DO;                                                                00001660
        ÅR_FYLLER_67_SØ = FNR_R.ÅR + 67;                                00001670
     END;                                                               00001680
   /* HIT TRUDE 170895 */                                               00001690
                                                                        00001700
   /* TILLEGG 17 08 95 TRUDE */                                         00001710
  IF  FNR_EK_R.ÅR_EK > 24 & FNR_EK_R.ÅRHUNDRE_EK < 5 THEN               00001720
     DO;                                                                00001730
        ÅR_FYLLER_67 = FNR_EK_R.ÅR_EK + 67;                             00001740
        ÅR_FYLLER_69 = FNR_EK_R.ÅR_EK + 69;                             00001750
     END;                                                               00001760
   /* HIT TRUDE 170895 */                                               00001770
                                                                        00001780
   B01_B02_IND     = 2;                                                 00001790
   POTALL_OPPL.IND = BER_SØ_IND;                                        00001800
   EXEC CICS LINK PROGRAM ('R0014141') COMMAREA(KOM_OMR);               00001810
    /* BEREGN_POENGREKKE_SLUTTPOENGTALL */                              00001820
                                                                        00001830
 /*************                                                         00001840
   IF (ÅRHUNDRE > 5 )                                    THEN;          00001850
   ELSE IF   (FNR_R.ÅR < 23)                             THEN;          00001860
   ELSE IF   (FNR_R.ÅR < 26  & ALDER < 7000)             THEN;          00001870
   ELSE IF   (FNR_R.ÅR = 26  & ALDER < 7000  &                          00001880
              B02.KONV_P_KODE(BER_SØ_IND) = 'K'  &                      00001890
              B02.UTTAKSDATO_ÅM(BER_SØ_IND) < 9200)      THEN;          00001900
   ELSE                                                                 00001910
      PÅ_ETTER91_SØKER               = 'J';                             00001920
  ******** 0296 HL ******************************* */                   00001930
                                                                        00001940
   /*------------------------------------------------------------*/     00001950
   /* OVERGANGSREGLER FRA 0192 FOR DE SOM HAR UFØRE- ELLER       */     00001960
   /* ETTERLATTPENSON PR.31.12.91. SKAL BEHOLDE BEREGNING MED 45 */     00001970
   /* PROSENT VED OVERGANG TIL ALDER. TRUDE 16.12.92             */     00001980
   /*------------------------------------------------------------*/     00001990
                                                                        00002000
    /* FINNE SISTE UFØRHIST . TRUDE  261093*/                           00002010
    /*0697 HL:*/                                                        00002020
    DO J = 7 TO 1 BY - 1 UNTIL(B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,J) > 0);  00002030
       SISTE_UFØRHIST  = J;                                             00002040
    END;                                                          /*93*/00002050
                                                                  /*93*/00002060
    /* FINNE SISTE UFØRHIST  FOR EKTEFELLE. TRUDE  141194*/             00002070
    /*0697 HL:*/                                                        00002080
    DO K = 7 TO 1 BY - 1 UNTIL(B02.UFØRHIST.UFT_ÅM(BER_EK_IND,K) > 0);  00002090
       SISTE_UFØRHIST_EK  = K;                                          00002100
    END;                                                          /*93*/00002110
                                                                  /*93*/00002120
   /*------------------------------------------------------------*/     00002130
   /* VI MÅ TESTE PÅ ALDER FOR DISSE PERSONENE. 70 ÅRINGER       */     00002140
   /* SKAL HA MED 42 %. TRUDE 15.12.93                           */     00002150
   /* ALDERSTEST VAR 70 IKKE 7000!!! TRUDE 240294                */     00002160
   /*------------------------------------------------------------*/     00002170
                                                                        00002180
   IF  FNR_R.ÅR > 22  &                                                 00002190
       ALDER    > 7000  THEN                                            00002200
       B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND) =                             00002210
                              POREKKE.PÅ_ETTER91(BER_SØ_IND);           00002220
   /*  ELSE  0196                                                       00002230
   IF B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,SISTE_UFØRHIST)  < 9200 &          00002240
      (B02.KONV_P_KODE(BER_SØ_IND)        = 'Y' !   TILLEGG 220993 TS   00002250
       B02.KONV_P_KODE(BER_SØ_IND)        = 'U')  THEN                  00002260
          PÅ_ETTER91_SØKER               = 'N';                         00002270
                                                                        00002280
                                                                        00002290
                                                                        00002300
           TILLEGGSTEST 0150196TRUDE                                    00002310
        IF (B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,SISTE_UFØRHIST) < 9200 &     00002320
           B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,SISTE_UFØRHIST)   > 7300 ) &  00002330
           B02.OPPHØRSKODE(BER_SØ_IND,SISTE_UFØRHIST)      ^= 'J'  THEN 00002340
         DO;                                                            00002350
           IF  ÅR_FYLLER_67_SØ  > 91  THEN                              00002360
             DO;                                                        00002370
                IF (POREKKE.POENG(BER_SØ_IND,ÅR_FYLLER_67_SØ)    +      00002380
                    POREKKE.POENG(BER_SØ_IND,(ÅR_FYLLER_67_SØ + 1)) +   00002390
                    POREKKE.POENG(BER_SØ_IND,(ÅR_FYLLER_67_SØ + 2)) > 0)00002400
                                                             THEN       00002410
                 DO;                                                    00002420
              IF  POREKKE.POENG(BER_SØ_IND,ÅR_FYLLER_67_SØ) > 0 THEN    00002430
                  ÅR_E91  = ÅR_E91 + 1;                                 00002440
                                                                        00002450
              IF  POREKKE.POENG(BER_SØ_IND,(ÅR_FYLLER_67_SØ + 1)) > 0   00002460
                                                  THEN                  00002470
                  ÅR_E91  = ÅR_E91 + 1;                                 00002480
                                                                        00002490
              IF  POREKKE.POENG(BER_SØ_IND,(ÅR_FYLLER_67_SØ + 2)) > 0   00002500
                                                  THEN                  00002510
                  ÅR_E91  = ÅR_E91 + 1;                                 00002520
              PÅ_ETTER91_SØKER = 'J';                                   00002530
              POREKKE.PÅ_ETTER91(BER_SØ_IND) = ÅR_E91;                  00002540
                 END;                                                   00002550
             END;                                                       00002560
         END;    0196                                                   00002570
                                                                        00002580
   IF B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,SISTE_UFØRHIST)  < 7300 &          00002590
      (B02.KONV_P_KODE(BER_SØ_IND)        = 'Y' !                       00002600
       B02.KONV_P_KODE(BER_SØ_IND)        = 'U')  THEN                  00002610
          PÅ_ETTER91_SØKER               = 'N';                         00002620
                                                                        00002630
   IF PÅ_ETTER91_SØKER               = 'N'            THEN              00002640
      POREKKE.PÅ_ETTER91(BER_SØ_IND) = 0;                               00002650
                                                                        00002660
   POREKKE_P67.PÅ_ETTER91(BER_SØ_IND) = 0;                              00002670
                                                                        00002680
    *** FJERNET TIL HIT 140296 HL */                                    00002690
   /*------------------------------------------------------------*/     00002700
   /*NY RUTINE FOR 45/42 ---------140296 HL----------------------*/     00002710
   /*------------------------------------------------------------*/     00002720
                                                                        00002730
     HL_PÅ_ETTER91   =                                                  00002740
                              POREKKE.PÅ_ETTER91(BER_SØ_IND);           00002750
                                                                        00002760
     B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND) =                               00002770
                              POREKKE.PÅ_ETTER91(BER_SØ_IND);           00002780
     IF (B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,SISTE_UFØRHIST) < 7300)  &      00002790
        (B02.OPPHØRSKODE(BER_SØ_IND,SISTE_UFØRHIST)     = 'A') THEN     00002800
                                                                        00002810
         B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND) = 0;                        00002820
     ELSE                                                               00002830
 /*  IF (ALDER      > 7000  &      FJERNET 27.2.96 */                   00002840
     IF (W_FNR_ÅM   > 2500     )       &                                00002850
        ((B02.KONV_P_KODE(BER_SØ_IND)    = 'K'   &                      00002860
          B02.UTTAKSDATO_ÅM(BER_SØ_IND)  < 9200 )    !                  00002870
                                                                        00002880
        ((B02.KONV_P_KODE(BER_SØ_IND)    = 'U'   !                      00002890
          B02.KONV_P_KODE(BER_SØ_IND)    = 'Y' ) &                      00002900
          B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,SISTE_UFØRHIST) < 9200 ))      00002910
                    THEN                                                00002920
        DO;                                                             00002930
           POREKKE_P67.PÅ_ETTER91(BER_SØ_IND) = 0;                      00002940
           FRADRAG = FNR_R.ÅR - 25;                                     00002950
           IF FRADRAG > POREKKE.PÅ_ETTER91(BER_SØ_IND)    THEN          00002960
              B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND)  = 0;                  00002970
           ELSE                                                         00002980
              DO;                                                       00002990
                 B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND)  =                  00003000
                 POREKKE.PÅ_ETTER91(BER_SØ_IND) - FRADRAG;              00003010
                 POREKKE.PÅ_ETTER91(BER_SØ_IND) =                       00003020
                 B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND);                    00003030
                 POREKKE.PÅ_ETTER91(BER_SØ_IND + 11) =                  00003040
                 B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND);                    00003050
              END;                                                      00003060
        END;                                                            00003070
     IF B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND) > 0   THEN                   00003080
        PÅ_ETTER91_SØKER = 'J';                                         00003090
     ELSE                                                               00003100
        DO;                                                             00003110
           PÅ_ETTER91_SØKER = 'N';                                      00003120
           POREKKE.PÅ_ETTER91(BER_SØ_IND) = 0;                          00003130
           POREKKE_P67.PÅ_ETTER91(BER_SØ_IND) = 0;                      00003140
        END;                                                            00003150
                                                                        00003160
     HL_PÅ_ETTER91   =                                                  00003170
     B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND);                                00003180
                                                                        00003190
 /* ***************************************************************** */00003200
 /* 42/45 HIT. HL 130296                                              */00003210
 /* ***************************************************************** */00003220
                                                                        00003230
      POREKKE(14)             = POREKKE(BER_SØ_IND);                    00003240
      /* PLASS 14 BRUKES SOM OPPBEVARINGSOMR. DA DENNE PLASSEN     */   00003250
      /* ALLTID ER LEDIG I ALDERSPENSJON.                          */   00003260
                                                                        00003270
      W_POREKKE               = POREKKE_P67(BER_SØ_IND);                00003280
                                                                        00003290
                                                                        00003300
   IF FEIL_MELD_NR > 0  THEN                                            00003310
      GO TO RETUR;                                                      00003320
   ELSE                                                                 00003330
      PROGRAM_ID = 'R0014101';                                          00003340
                                                                        00003350
                                                                        00003360
  /* HER REGNES ENSLIG TILLEGGSPENSJON UT    */                         00003370
   DCL TEST_PÅ   FIXED DEC (3) INIT (0);                                00003380
   TEST_PÅ =  POREKKE.PÅ_ETTER91(BER_SØ_IND);                           00003390
                                                                        00003400
   TP_EGEN   =  F_TP92(FNR_R.ÅR,G,                                      00003410
                        POREKKE.SPT(BER_SØ_IND),                        00003420
                        POREKKE.OPT(BER_SØ_IND),                        00003430
                        POREKKE.PÅ (BER_SØ_IND),                        00003440
                        POREKKE.PÅ_ETTER91 (BER_SØ_IND),                00003450
                           100,100,'J');                                00003460
                                                                        00003470
  /*  R0014142  */                                                      00003480
                                                                        00003490
                                                                        00003500
   IF (B02.SIVILSTAND(BER_SØ_IND) = 'S' &                               00003510
       B02.TP_PROSENT(BER_SØ_IND) = 0)            THEN                  00003520
                                                                        00003530
      DO;                                                               00003540
                                                                        00003550
         B02.POENGTILLEGG_DATO_ÅM(BER_SØ_IND) = 0;                      00003560
         B02.POENGTILLEGG_KODE   (BER_SØ_IND) = ' ';                    00003570
         B02.POENGTILLEGG_DATO_ÅM(BER_EK_IND) = 0;                      00003580
         B02.POENGTILLEGG_KODE   (BER_EK_IND) = ' ';                    00003590
                                                                        00003600
         B02.ALDERSP.SPT(BER_SØ_IND)      = POREKKE.SPT(BER_SØ_IND);    00003610
         B02.ALDERSP.OPT(BER_SØ_IND)      = POREKKE.OPT(BER_SØ_IND);    00003620
         B02.ALDERSP.PÅ(BER_SØ_IND)       = POREKKE.PÅ (BER_SØ_IND);    00003630
         B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND)       =                     00003640
                                POREKKE.PÅ_ETTER91 (BER_SØ_IND);        00003650
                                                                        00003660
         B02.VT_SPT(BER_SØ_IND)   = POREKKE_P67.SPT(BER_SØ_IND);        00003670
         B02.VT_OPT(BER_SØ_IND)   = POREKKE_P67.OPT(BER_SØ_IND);        00003680
         B02.VT_PÅ (BER_SØ_IND)   = POREKKE_P67.PÅ (BER_SØ_IND);        00003690
                                                                        00003700
         B02.ALDERSP.TP(BER_SØ_IND)         = TP_EGEN;                  00003710
         B02.ETTEPENS.TP_BRUTTO(BER_SØ_IND) = 0;                        00003720
         B02.ETTEPENS.TP_NETTO(BER_SØ_IND)  = 0;                        00003730
                                                                        00003740
         GO TO RETUR;                                                   00003750
      END;                                                              00003760
                                                                        00003770
    IF B02.SIVILSTAND(BER_SØ_IND) ^= 'S'         THEN                   00003780
       B02.TP_PROSENT(BER_SØ_IND) =  55;                                00003790
                                                                        00003800
   B01_B02_IND     = 2;                                                 00003810
   POTALL_OPPL.IND = BER_EK_IND;                                        00003820
                                                                        00003830
   EXEC CICS LINK PROGRAM ('R0014141') COMMAREA(KOM_OMR);               00003840
                                                                        00003850
   IF FEIL_MELD_NR > 0  THEN                                            00003860
      GO TO RETUR;                                                      00003870
   ELSE                                                                 00003880
      PROGRAM_ID = 'R0014101';                                          00003890
                                                                        00003900
                                                                        00003910
 /* 42 % TP FOR ÅR ETTER 1991 : */                                      00003920
                                                                        00003930
                                                                        00003940
   /*------------------------------------------------------------*/     00003950
   /* VI MÅ TESTE PÅ ALDER FOR DISSE PERSONENE. 70 ÅRINGER       */     00003960
   /* SKAL HA MED 42 %. TRUDE  5.01.95                           */     00003970
   /*------------------------------------------------------------*/     00003980
                                                                        00003990
         DCL TEST_ÅR  PIC '99';                                         00004000
         TEST_ÅR  = POREKKE.PÅ_ETTER91(BER_EK_IND);                     00004010
                                                                        00004020
 /*      IF (ÅR_EK       > 22  &                                        00004030
             ÅRHUNDRE_EK < 5 ) &                                        00004040
             ALDER_EK    > 7000  THEN                                   00004050
             B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND) =                      00004060
                    POREKKE.PÅ_ETTER91(BER_EK_IND);                     00004070
                                                                        00004080
                                                                        00004090
         IF ^(DØDSÅR > 91       &                                       00004100
              DØDSÅR = 0        &                                       00004110
              ÅR_EK  > 25       &                                       00004120
              ÅRHUNDRE_EK < 5 )   THEN                                  00004130
                 POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;                    00004140
                                                                        00004150
         IF   DØDSÅR < 73     &                                         00004160
              DØDSÅR > 0        THEN                                    00004170
              POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;                       00004180
  ********** */                                                         00004190
                                                                        00004200
         IF   DØDSÅR < 92         THEN                                  00004210
                 POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;                    00004220
                                                                        00004230
  /* ***************                                                    00004240
        IF (B02.UFØRHIST.UFT_ÅM(BER_EK_IND,SISTE_UFØRHIST_EK) < 9200 &  00004250
           B02.UFØRHIST.UFT_ÅM(BER_EK_IND,SISTE_UFØRHIST_EK) > 7200 ) & 00004260
           ( B02.OPPHØRSKODE(BER_EK_IND,SISTE_UFØRHIST_EK) ^= 'J'  &    00004270
           B02.PENSJONSTYPE1(BER_EK_IND)                 = 'D')  THEN   00004280
                                                                        00004290
                                                                        00004300
                                                                        00004310
           DO;                                                          00004320
             IF (ÅR_FYLLER_67  > 91   &                                 00004330
                 POREKKE.POENG(BER_EK_IND,ÅR_FYLLER_67) > 0)  THEN      00004340
                 W_ÅR_E91 = 1;                                          00004350
                                                                        00004360
             IF  (ÅR_FYLLER_67 + 1)  > 91   &                           00004370
                 POREKKE.POENG(BER_EK_IND,(ÅR_FYLLER_67 + 1)) > 0  THEN 00004380
                 W_ÅR_E91 = W_ÅR_E91 + 1;                               00004390
                                                                        00004400
             IF  (ÅR_FYLLER_67 + 2)  > 91   &                           00004410
                 POREKKE.POENG(BER_EK_IND,(ÅR_FYLLER_67 + 2)) > 0  THEN 00004420
                 W_ÅR_E91 = W_ÅR_E91 + 1;                               00004430
                                                                        00004440
             IF  W_ÅR_E91 > 0     THEN                                  00004450
                 DO;                                                    00004460
                    PÅ_ETTER91_EK = 'J';                                00004470
                    POREKKE.PÅ_ETTER91(BER_EK_IND) = W_ÅR_E91;          00004480
                 END;                                                   00004490
             ELSE                                                       00004500
               DO;                                                      00004510
                 POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;                    00004520
                 PÅ_ETTER91_EK = 'N';                                   00004530
               END;                                                     00004540
           END;                                                         00004550
                                                                        00004560
  ******************** */                                               00004570
                                                                        00004580
                                                                        00004590
      TEST_UFT = B02.UFØRHIST.UFT_ÅM(BER_EK_IND,SISTE_UFØRHIST_EK);     00004600
                                                                        00004610
      IF (B02.UFØRHIST.UFT_ÅM(BER_EK_IND,SISTE_UFØRHIST_EK) < 7300 ) &  00004620
         (B02.UFØRHIST.UFT_ÅM(BER_EK_IND,SISTE_UFØRHIST_EK) > 0    ) &  00004630
         ( B02.OPPHØRSKODE(BER_EK_IND,SISTE_UFØRHIST_EK) ^= 'J'    ) &  00004640
         ( B02.PENSJONSTYPE1(BER_EK_IND)                 = 'D')  THEN   00004650
               DO;                                                      00004660
                 POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;                    00004670
                 PÅ_ETTER91_EK = 'N';                                   00004680
               END;                                                     00004690
                    /* HIT TRUDE 021195 */                              00004700
                                                                        00004710
                                                                        00004720
  /*TILLEGG 9803 HL : */                                                00004730
                                                                        00004740
         B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND) =                          00004750
                  POREKKE.PÅ_ETTER91(BER_EK_IND);                       00004760
                                                                        00004770
         IF FNR_EK_R.ÅR_EK > 24         &                               00004780
            ((B02.KONV_P_KODE(BER_EK_IND) = 'K' &                       00004790
             B02.UTTAKSDATO_ÅM(BER_EK_IND) < 9200)  !                   00004800
                                                                        00004810
             ((B02.KONV_P_KODE(BER_EK_IND) = 'U' !                      00004820
               B02.KONV_P_KODE(BER_EK_IND) = 'Y'  )  &                  00004830
               B02.UFØRHIST.UFT_ÅM(BER_EK_IND,SISTE_UFØRHIST_EK)        00004840
                                               < 9200 )    !            00004850
             ( B02.UFØRHIST.UFT_ÅM(BER_EK_IND,SISTE_UFØRHIST_EK)        00004860
                                               < 9200    &              00004870
               B02.OPPHØRSKODE(BER_EK_IND,SISTE_UFØRHIST_EK)            00004880
                                               = 'A')) THEN             00004890
            DO;                                                         00004900
               FRADRAG = FNR_EK_R.ÅR_EK - 25;                           00004910
               IF FRADRAG > POREKKE.PÅ_ETTER91(BER_EK_IND)    THEN      00004920
                  B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND) = 0;              00004930
               ELSE                                                     00004940
                DO;                                                     00004950
                  B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND) =                 00004960
                  POREKKE.PÅ_ETTER91(BER_EK_IND) - FRADRAG;             00004970
                  POREKKE.PÅ_ETTER91(BER_EK_IND) =                      00004980
                  B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND);                  00004990
                  POREKKE.PÅ_ETTER91(BER_EK_IND + 11) =                 00005000
                  B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND);                  00005010
                END;                                                    00005020
            END;                                                        00005030
   /*HIT 9803*/                                                         00005040
         IF POREKKE.PÅ_ETTER91(BER_EK_IND) ^= 0    THEN                 00005050
            PÅ_ETTER91_EK = 'J';                                        00005060
                                                                        00005070
         IF POREKKE.SPT(BER_SØ_IND) > 0 &                               00005080
            POREKKE.SPT(BER_EK_IND) > 0       THEN                      00005090
                                                                        00005100
            CALL POENG_TILLEGG;                 /* R0014143 */          00005110
                                                                        00005120
 /* ENDRET 28.11.86 HL - HVIS ALTERNATIV POREKKE, SOM  EVT. ER    */    00005130
 /*   FRAPP 270          LAGT UT På PLASS 'IND + 11', HAR 'U' I   */    00005140
 /*                      TYPE, Så SKAL ALTERNATIV BEREGNING PRøVES*/    00005150
                                                                        00005160
          IF POREKKE.TYPE(BER_SØ_IND) = 'O' &                           00005170
             POREKKE.TYPE(BER_SØ_IND + 11)  = 'O'   THEN                00005180
                                       /* O = ORDINÆR */                00005190
             DO;                                                        00005200
 /*4153*/       CALL BEREGN_SPT_OPT_PÅ    (                             00005210
                                BER_SØ_IND,POREKKE(BER_SØ_IND),W_FNR);  00005220
 /*4153*/       CALL BEREGN_SPT_OPT_PÅ    (                             00005230
                                BER_SØ_IND,POREKKE_P67(BER_SØ_IND),     00005240
                                                               W_FNR);  00005250
 /*TILLEGG 100796 HL :*/                                                00005260
                 POREKKE.PÅ_ETTER91(BER_SØ_IND) =                       00005270
                 B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND);                    00005280
                 POREKKE.PÅ_ETTER91(BER_SØ_IND + 11) =                  00005290
                 B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND);                    00005300
                POREKKE_P67.PÅ_ETTER91(BER_SØ_IND) = 0;                 00005310
                IF PÅ_ETTER91_SØKER = 'N'    THEN                       00005320
                   POREKKE.PÅ_ETTER91(BER_SØ_IND) = 0;                  00005330
                                                                        00005340
                TP_PT_EGEN_55 = F_TP92(FNR_R.ÅR,G,                      00005350
                                       POREKKE.SPT(BER_SØ_IND),         00005360
                                       POREKKE.OPT(BER_SØ_IND),         00005370
                                       POREKKE.PÅ (BER_SØ_IND),         00005380
                               POREKKE.PÅ_ETTER91 (BER_SØ_IND),         00005390
                                       100,55,'J');                     00005400
                     /* 4142 */                                         00005410
                                                                        00005420
             END;                                                       00005430
                                                                        00005440
          ELSE     /* TYPE ER DA U = AP SOM VAR UP FØR 1973 */          00005450
             DO;                                                        00005460
 /*4156*/       CALL BEREGN_SPT_OPT_PÅ_ALT(                             00005470
                                BER_SØ_IND,POREKKE(BER_SØ_IND),W_FNR);  00005480
 /*4156*/       CALL BEREGN_SPT_OPT_PÅ_ALT(                             00005490
                                BER_SØ_IND,POREKKE_P67(BER_SØ_IND),     00005500
                                                               W_FNR);  00005510
 /*TILLEGG 100796 HL :*/                                                00005520
                 POREKKE.PÅ_ETTER91(BER_SØ_IND) =                       00005530
                 B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND);                    00005540
                 POREKKE.PÅ_ETTER91(BER_SØ_IND + 11) =                  00005550
                 B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND);                    00005560
                POREKKE_P67.PÅ_ETTER91(BER_SØ_IND) = 0;                 00005570
                IF PÅ_ETTER91_SØKER = 'N'    THEN                       00005580
                   POREKKE.PÅ_ETTER91(BER_SØ_IND) = 0;                  00005590
                                                                        00005600
                                                                        00005610
 /*28.11.86 HL- FRAPP 270 - PENSJON ETTER ALTERNATIVE POENGREKKER, */   00005620
 /*              OG MED POENGTILLEGG, SKAL SAMMENLIGNES.           */   00005630
                                                                        00005640
                TP_PT_EGEN_55      = F_TP92(FNR_R.ÅR,G,                 00005650
                                    POREKKE.SPT(BER_SØ_IND),            00005660
                                    POREKKE.OPT(BER_SØ_IND),            00005670
                                    POREKKE.PÅ(BER_SØ_IND),             00005680
                            POREKKE.PÅ_ETTER91(BER_SØ_IND),             00005690
                                    100,55,'J');                        00005700
                                                                        00005710
                                                                        00005720
 /*4156*/       CALL BEREGN_SPT_OPT_PÅ_ALT(                             00005730
                                BER_SØ_IND,POREKKE(BER_SØ_IND + 11),    00005740
                                                             W_FNR);    00005750
                                                                        00005760
 /*4156*/       CALL BEREGN_SPT_OPT_PÅ_ALT(                             00005770
                            BER_SØ_IND,POREKKE_P67(BER_SØ_IND + 11),    00005780
                                                             W_FNR);    00005790
                                                                        00005800
                                                                        00005810
 /*TILLEGG 100796 HL :*/                                                00005820
                 POREKKE.PÅ_ETTER91(BER_SØ_IND) =                       00005830
                 B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND);                    00005840
                 POREKKE.PÅ_ETTER91(BER_SØ_IND + 11) =                  00005850
                 B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND);                    00005860
                POREKKE_P67.PÅ_ETTER91(BER_SØ_IND + 11) = 0;            00005870
                IF PÅ_ETTER91_SØKER = 'N'    THEN                       00005880
                   POREKKE.PÅ_ETTER91(BER_SØ_IND + 11)  = 0;            00005890
                                                                        00005900
                                                                        00005910
                W_TP_ALT        = F_TP92(FNR_R.ÅR,G,                    00005920
                                    POREKKE.SPT(BER_SØ_IND + 11),       00005930
                                    POREKKE.OPT(BER_SØ_IND + 11),       00005940
                                    POREKKE.PÅ(BER_SØ_IND + 11),        00005950
                            POREKKE.PÅ_ETTER91(BER_SØ_IND + 11),        00005960
                                    100,55,'J');                        00005970
                                                                        00005980
                IF W_TP_ALT > TP_PT_EGEN_55          THEN               00005990
                                                                        00006000
                                                                        00006010
                   DO;                                                  00006020
                                                                        00006030
                      POREKKE(BER_SØ_IND) =                             00006040
                                     POREKKE(BER_SØ_IND + 11);          00006050
                                                                        00006060
                      POREKKE_P67(BER_SØ_IND) =                         00006070
                                     POREKKE_P67(BER_SØ_IND + 11);      00006080
                                                                        00006090
                      TP_PT_EGEN_55         = W_TP_ALT;                 00006100
                                                                        00006110
                   END;                                                 00006120
                                                                        00006130
                                                                        00006140
             END;                                                       00006150
 /* ENDRET 11.12.86 HL - HVIS ALTERNATIV POREKKE, SOM EVT. ER     */    00006160
 /*   FRAPP 270          LAGT UT På PLASS 'IND + 11', IKKE HAR 'O'*/    00006170
 /*                    I TYPE, Så SKAL ALTERNATIV BEREGNING PRøVES*/    00006180
                                                                        00006190
          IF POREKKE.TYPE(BER_EK_IND) = 'O' &                           00006200
             POREKKE.TYPE(BER_EK_IND + 11) ^= 'D'  THEN                 00006210
                                       /* O = ORDINÆR */                00006220
             DO;                                                        00006230
 /*4153*/       CALL BEREGN_SPT_OPT_PÅ (BER_EK_IND,POREKKE(BER_EK_IND), 00006240
                                                          W_FNR_EK);    00006250
                                                                        00006260
     /*TILLEGG 9803*/                                                   00006270
                  POREKKE.PÅ_ETTER91(BER_EK_IND) =                      00006280
                  B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND);                  00006290
                  POREKKE.PÅ_ETTER91(BER_EK_IND + 11) =                 00006300
                  B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND);                  00006310
                IF PÅ_ETTER91_EK = 'N'             THEN                 00006320
                   POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;                  00006330
                                                                        00006340
                                                                        00006350
                TP_EK_PT      = F_TP92(FNR_EK_R.ÅR_EK,G,                00006360
                                       POREKKE.SPT(BER_EK_IND),         00006370
                                       POREKKE.OPT(BER_EK_IND),         00006380
                                       POREKKE.PÅ (BER_EK_IND),         00006390
                                       POREKKE.PÅ_ETTER91(BER_EK_IND),  00006400
                              100,B02.TP_PROSENT(BER_SØ_IND),'J');      00006410
                                                                        00006420
                         /* 4142 */                                     00006430
                                                                        00006440
             END;                                                       00006450
                                                                        00006460
          ELSE     /* TYPE ER DA U =  AP SOM VAR UP FØR 1973 */         00006470
                   /* ELLER      D = DØD SOM VAR UP FØR 1973 */         00006480
                                                                        00006490
             DO;                                                        00006500
 /*4156*/       CALL BEREGN_SPT_OPT_PÅ_ALT(                             00006510
                                BER_EK_IND,POREKKE(BER_EK_IND),         00006520
                                                          W_FNR_EK);    00006530
                                                                        00006540
                                                                        00006550
 /*4156*/       CALL BEREGN_SPT_OPT_PÅ_ALT(                             00006560
                                BER_EK_IND,POREKKE(BER_EK_IND + 11),    00006570
                                                           W_FNR_EK);   00006580
  /*TILLEGG 9803 */                                                     00006590
                  POREKKE.PÅ_ETTER91(BER_EK_IND) =                      00006600
                  B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND);                  00006610
                  POREKKE.PÅ_ETTER91(BER_EK_IND + 11) =                 00006620
                  B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND);                  00006630
                IF PÅ_ETTER91_EK = 'N'             THEN                 00006640
                   DO;                                                  00006650
                      POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;               00006660
                      POREKKE.PÅ_ETTER91(BER_EK_IND + 11) = 0;          00006670
                   END;                                                 00006680
                                                                        00006690
                                                                        00006700
 /*11.12.86 HL- FRAPP 270 - PENSJON ETTER ALTERNATIVE POENGREKKER, */   00006710
 /*              OG MED POENGTILLEGG, SKAL SAMMENLIGNES.           */   00006720
                                                                        00006730
                W_TP     = F_TP92(FNR_EK_R.ÅR_EK,G,                     00006740
                                    POREKKE.SPT(BER_EK_IND),            00006750
                                    POREKKE.OPT(BER_EK_IND),            00006760
                                    POREKKE.PÅ(BER_EK_IND),             00006770
                                    POREKKE.PÅ_ETTER91(BER_EK_IND),     00006780
                                    100,                                00006790
                                    B02.TP_PROSENT(BER_SØ_IND),'J');    00006800
                                                                        00006810
                                                                        00006820
                                                                        00006830
                W_TP_ALT      = F_TP92(FNR_EK_R.ÅR_EK,G,                00006840
                                    POREKKE.SPT(BER_EK_IND + 11),       00006850
                                    POREKKE.OPT(BER_EK_IND + 11),       00006860
                                    POREKKE.PÅ(BER_EK_IND + 11),        00006870
                              POREKKE.PÅ_ETTER91(BER_EK_IND + 11),      00006880
                                    100,                                00006890
                                    B02.TP_PROSENT(BER_SØ_IND),'J');    00006900
                                                                        00006910
                IF W_TP_ALT > W_TP                   THEN               00006920
                                                                        00006930
                                                                        00006940
                   DO;                                                  00006950
                                                                        00006960
                      POREKKE(BER_EK_IND) =                             00006970
                                     POREKKE(BER_EK_IND + 11);          00006980
                                                                        00006990
                      POREKKE_P67(BER_EK_IND) =                         00007000
                             POREKKE_P67(BER_EK_IND + 11);              00007010
                                                                        00007020
                      TP_EK_PT = W_TP_ALT;                              00007030
                                                                        00007040
                   END;                                                 00007050
                                                                        00007060
                ELSE                                                    00007070
                                                                        00007080
                      TP_EK_PT = W_TP;                                  00007090
                                                                        00007100
             END;                                                       00007110
 /* ************************************************************* */    00007120
 /*ENDRET 0388 HL : ETT ALTERNATIV ER AT AVDØDES POENG IKKE ENDRES*/    00007130
 /* ************************************************************* */    00007140
                                                                        00007150
         IF B01.UFØRPENS.UFG(BER_EK_IND) > 0          THEN              00007160
                                                                        00007170
            W2_TP     = F_TP92(FNR_EK_R.ÅR_EK,G,                        00007180
                          B01.UFØRPENS.SPT(BER_EK_IND),                 00007190
                          B01.UFØRPENS.OPT(BER_EK_IND),                 00007200
                          B01.UFØRPENS.PÅ(BER_EK_IND),                  00007210
                          B01.UFØRPENS.PÅ_ETTER91(BER_EK_IND),          00007220
                          100,                                          00007230
                          B02.TP_PROSENT(BER_SØ_IND),'J');              00007240
                                                                        00007250
         IF W2_TP > TP_EK_PT THEN                                       00007260
                                                                        00007270
            DO;                                                         00007280
                                                                        00007290
               B02.ETTEPENS.SPT_AVD(BER_SØ_IND) =                       00007300
                       B01.UFØRPENS.SPT(BER_EK_IND);                    00007310
               B02.ETTEPENS.OPT_AVD(BER_SØ_IND) =                       00007320
                       B01.UFØRPENS.OPT(BER_EK_IND);                    00007330
               B02.ETTEPENS.PÅ_AVD(BER_SØ_IND)  =                       00007340
                       B01.UFØRPENS.PÅ(BER_EK_IND);                     00007350
               B02.ETTEPENS.PÅ_ETTER91(BER_SØ_IND)  =                   00007360
                       B01.UFØRPENS.PÅ_ETTER91(BER_EK_IND);             00007370
                                                                        00007380
            END;                                                        00007390
                                                                        00007400
         ELSE                                                           00007410
                                                                        00007420
           DO;                                                          00007430
             B02.ETTEPENS.SPT_AVD(BER_SØ_IND) = POREKKE.SPT(BER_EK_IND);00007440
             B02.ETTEPENS.OPT_AVD(BER_SØ_IND) = POREKKE.OPT(BER_EK_IND);00007450
             B02.ETTEPENS.PÅ_AVD(BER_SØ_IND)  = POREKKE.PÅ (BER_EK_IND);00007460
             B02.ETTEPENS.PÅ_ETTER91(BER_SØ_IND) =                      00007470
                         POREKKE.PÅ_ETTER91 (BER_EK_IND);               00007480
                                                                        00007490
           END;                                                         00007500
                                                                        00007510
   /* OPPDATERING AV ALDERSP.PÅ_ETTER91 MANGLER DER PÅE91 = 0 */        00007520
   /* TRUDE, 404095*/                                                   00007530
                                                                        00007540
   IF  PÅ_ETTER91_SØKER = 'N'  THEN                                     00007550
       B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND)   = 0;                        00007560
     HL_PÅ_ETTER91   =                                                  00007570
     B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND);                                00007580
     HL_PÅ_ETTER91   =                                                  00007590
                 POREKKE.PÅ_ETTER91(BER_SØ_IND);                        00007600
                                                                        00007610
 /* ************************************************************ */     00007620
 /* YS - TILLEGG. AVDØDES YPT OPPDATERES VED NY SKADE            */     00007630
 /*      KAP11-PENSJON BEREGNES EVT. FOR AVDØDE                  */     00007640
 /* ************************************************************ */     00007650
                                                                        00007660
         IF B02.YRKEPENS.YUG(BER_EK_IND) > 0 THEN                       00007670
            DO;                                                         00007680
                                                                        00007690
        DCL KAP11_TP_BRUTTO       FIXED DEC (5);                        00007700
        DCL W_KAP11_TP_BRUTTO       FIXED DEC (11,4) INIT(0);  /*TS*/   00007710
        DCL VANLIG_TP_BRUTTO      FIXED DEC (5);                        00007720
        DCL REST_GRAD             FIXED DEC (3);                        00007730
                                                                        00007740
               IF B02.YRKEPENS.YUG(BER_EK_IND)  = 100   &               00007750
                  B01.YRKEPENS.YUG(BER_EK_IND) ^= 100 THEN              00007760
                  DO;                                                   00007770
                     IF B02.YRKEPENS.YPT(BER_EK_IND) <                  00007780
                        B02.SPT_AVD(BER_SØ_IND)     THEN                00007790
                        DO;                                             00007800
                           B02.YRKEPENS.YPT(BER_EK_IND) =               00007810
                           B02.SPT_AVD(BER_SØ_IND);                     00007820
                           B02.YRKEPENS.YPT_KODE(BER_EK_IND) = 'V';     00007830
                        END;                                            00007840
                  END;                                                  00007850
                                                                        00007860
 /*YS         KAP11_TP_BRUTTO = G * 45 / 100 / 12 *                     00007870
                               B02.YRKEPENS.YPT(BER_EK_IND)       *     00007880
                               B02.YRKEPENS.YUG(BER_EK_IND) / 100 *     00007890
                               B02.TP_PROSENT(BER_SØ_IND)   / 100 +     00007900
                               0.5;         YS  TRUDE*/                 00007910
             /* TRUDE FRA HIT */                                        00007920
             /* VED ENDRING AV G- BLE TP ETTER AVD. FEIL */             00007930
                                                                 /*YS*/ 00007940
             W_KAP11_TP_BRUTTO =  G * B02.YRKEPENS.YPT(BER_EK_IND);     00007950
             W_KAP11_TP_BRUTTO =  W_KAP11_TP_BRUTTO *                   00007960
                                  B02.YRKEPENS.YUG(BER_EK_IND)/100;     00007970
             W_KAP11_TP_BRUTTO =  W_KAP11_TP_BRUTTO *                   00007980
                                  B02.TP_PROSENT(BER_SØ_IND) /100;      00007990
             W_KAP11_TP_BRUTTO =  W_KAP11_TP_BRUTTO / 12;               00008000
             IF B02.YRKEPENS.PÅ_ETTER91(BER_EK_IND) = 0     THEN        00008010
                KAP11_TP_BRUTTO   =  W_KAP11_TP_BRUTTO * 0.45;          00008020
             ELSE                                                       00008030
             DO;                                                        00008040
                FAKTOR1 = (B02.YRKEPENS.PÅ(BER_EK_IND)                  00008050
                           - B02.YRKEPENS.PÅ_ETTER91(BER_EK_IND) )      00008060
                           / B02.YRKEPENS.PÅ(BER_EK_IND) * 0.45;        00008070
                FAKTOR2 =  B02.YRKEPENS.PÅ_ETTER91(BER_EK_IND)          00008080
                           / B02.YRKEPENS.PÅ(BER_EK_IND) * 0.42;        00008090
      KAP11_TP_BRUTTO=W_KAP11_TP_BRUTTO * (FAKTOR1 + FAKTOR2 + 0.00005);00008100
             END;                                                       00008110
             KAP11_TP_BRUTTO   =  KAP11_TP_BRUTTO + 0.5;                00008120
                                                                        00008130
                                                                        00008140
             /* TRUDE TIL HIT */                                        00008150
                                                                        00008160
               VANLIG_TP_BRUTTO = TP_EK_PT *                            00008170
                         B02.YRKEPENS.YUG(BER_EK_IND) / 100 + 0.5;      00008180
                                                                        00008190
               IF KAP11_TP_BRUTTO > VANLIG_TP_BRUTTO       THEN         00008200
                  DO;                                                   00008210
                     DIV_PARAM_OMR.BEREGNINGS_ALT_AVD = '3';            00008220
                                                                        00008230
                     TP_EK_PT = TP_EK_PT + KAP11_TP_BRUTTO -            00008240
                                VANLIG_TP_BRUTTO;                       00008250
                  END;                                                  00008260
                                                                        00008270
            END;                                                        00008280
     /* 9709 HL : */                                                    00008290
                                                                        00008300
  DØDSDATO_ÅM = B02.DØDSDATO_ÅMD(BER_EK_IND) / 100;                     00008310
  FIXED_DEC5  = F_ALDER(W_FNR_EK,F_SNU_DATO(DØDSDATO_ÅM));              00008320
  ALDER_VED_DØD = FIXED_DEC5;                                           00008330
                                                                        00008340
  /* GARANTI FOR GAMLE UNGE UFØRE FØDT FØR 1943 */                      00008350
  /*LEGGES INN 040892 TRUDE                    */                       00008360
                                                                        00008370
  IF B02.BUP_GAR_KODE(BER_EK_IND,1)  = 'E' THEN                         00008380
     CALL SPT_GARANTI_E(ÅR_EK,                                          00008390
              B02.VIRK_DATO_ÅM(BER_SØ_IND),RETUR_POENG); /*4199*/       00008400
  ELSE                                                                  00008410
  IF B02.TP_GAR_KODE(BER_EK_IND) = 'E'     THEN                         00008420
     CALL UNGE_DØDE_E(B02.VIRK_DATO_ÅM(BER_SØ_IND),                     00008430
                   ÅR_EK,ALDER_VED_DØD,RETUR_POENG); /*4327*/           00008440
                                                                        00008450
  IF RETUR_POENG > 0                      THEN                          00008460
    DO;                                                                 00008470
                                                                        00008480
      W_GARANTI_TP      =  G * 0.45 * RETUR_POENG;                      00008490
      W_GARANTI_TP      =  W_GARANTI_TP * B02.TT_ANV(BER_EK_IND) / 40;  00008500
      W_GARANTI_TP      =  W_GARANTI_TP / 100;                          00008510
      W_GARANTI_TP      =  W_GARANTI_TP * B02.TP_PROSENT(BER_SØ_IND);   00008520
      W_GARANTI_TP      =  W_GARANTI_TP / 12 ;                          00008530
      W_GAR_TP          = W_GARANTI_TP + 0.5;                           00008540
                                                                        00008550
      IF W_GAR_TP  >  TP_EK_PT THEN                                     00008560
         TP_EK_PT  = W_GAR_TP;                                          00008570
    END;                                                                00008580
    RETUR_POENG = 0;                                                    00008590
                                                                        00008600
  /* SISTE_KODE BLIR IKKE BRUKT **********************                  00008610
          DCL SISTE_KODE PIC '9';                                       00008620
                                                                        00008630
                                                                        00008640
          DO J = 7 TO 1 BY -1 UNTIL(B02.UFØRHIST.BUP_GAR_KODE           00008650
                                 (BER_SØ_IND,J) ^= ' ');                00008660
             SISTE_KODE   = J;                                          00008670
          END;                                                          00008680
  *******************  HIT 9708 HL *************************** */       00008690
                                                                        00008700
 /*9708 HLIF B02.STATUS.TP_GAR_KODE(BER_SØ_IND)    =   'E' * */         00008710
         IF B02.BUP_GAR_KODE(BER_SØ_IND,1)    =   'E'   THEN            00008720
            CALL SPT_GARANTI_E(FNR_R.ÅR,                                00008730
              B02.VIRK_DATO_ÅM(BER_SØ_IND),RETUR_POENG); /*4199*/       00008740
  /* *********************************                                  00008750
           DO;                                                          00008760
             IF B02.VIRK_DATO_ÅM(BER_SØ_IND)    < 9101 THEN             00008770
                                                                        00008780
                                                                        00008790
                SPT_GARANTI  = 1.6;                                     00008800
                                                                        00008810
            ELSE                                                        00008820
            IF B02.VIRK_DATO_ÅM(BER_SØ_IND)    < 9201   THEN            00008830
                 DO;                                                    00008840
                    IF FNR_R.ÅR    >= 25 THEN                           00008850
                       SPT_GARANTI  = 2;                                00008860
                    ELSE                                                00008870
                    IF FNR_R.ÅR   = 23 !                                00008880
                       FNR_R.ÅR   = 24  THEN                            00008890
                         SPT_GARANTI = 1.6;                             00008900
                 END;                                                   00008910
            ELSE                                                        00008920
            IF B02.VIRK_DATO_ÅM(BER_SØ_IND)    < 9205        THEN       00008930
               DO;                                                      00008940
                  IF FNR_R.ÅR     > 25 &                                00008950
                     FNR_R.ÅR     < 45 THEN                             00008960
                       SPT_GARANTI  = 2.5;                              00008970
                  ELSE                                                  00008980
                  IF FNR_R.ÅR   = 25 THEN                               00008990
                       SPT_GARANTI  = 2;                                00009000
                  ELSE                                                  00009010
                  IF FNR_R.ÅR   = 23 !                                  00009020
                     FNR_R.ÅR   = 24  THEN                              00009030
                       SPT_GARANTI = 1.6;                               00009040
               END;                                                     00009050
            ELSE                                                        00009060
            IF B02.VIRK_DATO_ÅM(BER_SØ_IND)  < 9705    THEN             00009070
               DO;                                                      00009080
                  IF FNR_R.ÅR     > 25 &                                00009090
                     FNR_R.ÅR     < 43 THEN                             00009100
                        SPT_GARANTI  = 3.0;                             00009110
                  ELSE                                                  00009120
                  IF FNR_R.ÅR   = 25 THEN                               00009130
                        SPT_GARANTI  = 2;                               00009140
                  ELSE                                                  00009150
                  IF FNR_R.ÅR   = 23 !                                  00009160
                     FNR_R.ÅR   = 24  THEN                              00009170
                        SPT_GARANTI = 1.6;                              00009180
               END;                                                     00009190
                                                                        00009200
                                                                        00009210
            ELSE                                                        00009220
            IF B02.VIRK_DATO_ÅM(BER_SØ_IND)  < 9707       THEN          00009230
               DO;                                                      00009240
                  IF FNR_R.ÅR     > 25  &                               00009250
                     FNR_R.ÅR     < 43 THEN                             00009260
                     IF FNR_R.ÅR  > 30     THEN                         00009270
                           SPT_GARANTI  = 3.3;                          00009280
                     ELSE                                               00009290
                           SPT_GARANTI  = 3.0;                          00009300
                  ELSE                                                  00009310
                  IF FNR_R.ÅR   = 25 THEN                               00009320
                           SPT_GARANTI  = 2;                            00009330
                  ELSE                                                  00009340
                  IF FNR_R.ÅR   = 23 !                                  00009350
                     FNR_R.ÅR   = 24  THEN                              00009360
                           SPT_GARANTI = 1.6;                           00009370
               END;                                                     00009380
            ELSE                                                        00009390
                                                                        00009400
               DO;                                                      00009410
                  IF FNR_R.ÅR     > 25  &                               00009420
                     FNR_R.ÅR     < 41 THEN                             00009430
                     IF FNR_R.ÅR  > 30     THEN                         00009440
                           SPT_GARANTI  = 3.3;                          00009450
                     ELSE                                               00009460
                           SPT_GARANTI  = 3.0;                          00009470
                  ELSE                                                  00009480
                  IF FNR_R.ÅR   = 25 THEN                               00009490
                           SPT_GARANTI  = 2;                            00009500
                  ELSE                                                  00009510
                  IF FNR_R.ÅR   = 23 !                                  00009520
                     FNR_R.ÅR   = 24  THEN                              00009530
                           SPT_GARANTI = 1.6;                           00009540
               END;                                                     00009550
         END;                                                           00009560
 **************************************************** */                00009570
                                                                        00009580
     IF RETUR_POENG > 0 THEN                                            00009590
       DO;                                                              00009600
       TP_GARANTI  = ( RETUR_POENG * 0.45 * G );                        00009610
       TP_GARANTI  = TP_GARANTI / 40;                                   00009620
       TP_GARANTI  = TP_GARANTI * B02.TT_ANV(BER_SØ_IND);               00009630
       TP_GARANTI  = TP_GARANTI / 12;                                   00009640
       TP_GARANTI    = TP_GARANTI + 0.5;                                00009650
                                                                        00009660
         IF TP_GARANTI  >   TP_EGEN  THEN                               00009670
             DO;                                                        00009680
                                                                        00009690
                TP_EGEN     = TP_GARANTI;                               00009700
                B02.STATUS.TP_GAR_KODE(BER_SØ_IND)  = 'E';              00009710
             END;                                                       00009720
       END;                                                             00009730
                                                                        00009740
                    /*UF BLE FEIL VED OVERGANG TIL P67  */              00009750
                    /*TRUDE, 8.1.90 TIL HIT             */              00009760
                                                                        00009770
                                                                        00009780
 RETUR:                                                                 00009790
                                                                        00009800
 END BEREGN_TP_ETTERLATT_AP;                                            00009810
