 /*       SIST ENDRET 06/03-91 11.48.39 AV   DYBVIK                   */00000000
 /* ***************************************************************** */00000010
 /*               R 0 0 1 0 6 0 8                                     */00000020
 /* ***************************************************************** */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /* **********************                                            */00000050
 /*  PROGRAM-IDENT : R001N608      TT_UP_EP      SUBPROGRAM           */00000060
 /*  PROGRAM-SPRÅK : PLI                                              */00000070
 /*  PROGRAMMERER  : SATISH                                           */00000080
 /*  PROGRAMMET BLE LAGET : DEC 1990                                  */00000090
 /*  ENDRINGEN GJELDER: GRENSE FOR MAX TT, IKKE LENGER 40 ÅR          */00000100
 /*  ENDRINGEN BLE UTFØRT AV : KARIN                                  */00000110
 /*                                                                   */00000120
 /* ***************************************************************** */00000130
 /*HENSIKT:                                                           */00000140
 /* **********                                                        */00000150
 /*    BEREGNER MAKS TT FØR 1967, OG TT FRA 1966 TIL UFØRE/           */00000160
 /*    DØDSTIDSPUNKTET                                                */00000170
 /*  BRUK:                                                            */00000180
 /*    CALL TT_UP_EP(FNR,DATO,MAKS_TT_FØR_1967,TT_TIL_TPK);           */00000190
 /*  PARAMETER INN :                                                  */00000200
 /*    FNR,DATO                                                       */00000210
 /*  PARAMETER UT :                                                   */00000220
 /*    MAKS_TT_FØR_1967, TT_TIL_TPK                                   */00000230
 /*                                                                   */00000240
 /* ***************************************************************** */00000250
 /*PROGRAMTILKNYTTING:                                                */00000260
 /* ********************                                              */00000270
 /*  PROGRAMMET INCLUDES I R001N601 - KONTROLL_GRUNNBLANKETT_UP       */00000280
 /*  PROGRAMMET INCLUDES I R0010801 - KONTROLL_GRUNNBLANKETT_EP       */00000290
 /*                                                                   */00000300
 /* ***************************************************************** */00000310
 /*DATASETTOPPLYSNINGER:                                              */00000320
 /* ***********************                                           */00000330
 /*  INGEN                                                            */00000340
 /* ***************************************************************** */00000350
 /*FEILMELDINGER:                                                     */00000360
 /* *******************                                               */00000370
 /*  INGEN                                                            */00000380
 /* ***************************************************************** */00000390
 %PAGE;                                                                 00000400
 TT_UP_EP:                                                              00000410
    PROC(FNR,TPK_MÅ,MAKS_TT_FØR_1967,TT_TIL_TPK);                       00000420
   DCL                                                                  00000430
      FNR PIC'(11)9';                                                   00000440
   DCL                                                                  00000450
      W_FNR_MN PIC'(2)9' DEF FNR POS(3),                                00000460
      W_FNR_ÅR PIC'(2)9' DEF FNR POS(5),                                00000470
      W_PERSNR PIC'(3)9' DEF FNR POS(7);                                00000480
   DCL                                                                  00000490
      TPK_MÅ PIC'(4)9',                                                 00000500
      TPK_ÅM PIC'(4)9',                                                 00000510
      TPK_M DEF TPK_MÅ POS(1) PIC '99',                                 00000520
      TPK_Å DEF TPK_MÅ POS(3) PIC '99';                                 00000530
   DCL                                                                  00000540
      MAKS_TT_FØR_1967 PIC'(2)9',                                       00000550
      TT_TIL_TPK PIC'(4)9';                                             00000560
 %SKIP(2);                                                              00000570
   TPK_ÅM = ((TPK_Å * 100) + TPK_M);                                    00000580
 %SKIP(2);                                                              00000590
   IF W_PERSNR >= 500 THEN                                              00000600
      MAKS_TT_FØR_1967 = 1967 - (1800 + W_FNR_ÅR +16);                  00000610
   ELSE                                                                 00000620
      MAKS_TT_FØR_1967 = 1967 - (                                       00000630
      W_FNR_ÅR + 1900 + 16);                                            00000640
   TT_TIL_TPK = TPK_ÅM - 6700;                                          00000650
   RETURN;                                                              00000660
 END TT_UP_EP;                                                          00000670
