 /*       SIST ENDRET 30/10-98 10.35.44 AV   JDA7339                  */00000000
 /*       SIST ENDRET 30/10-98 10.32.56 AV   JDA7339                  */00000010
 /*       SIST ENDRET 28/07-98 12.52.02 AV   JDA7339                  */00000020
 /*       SIST ENDRET 28/07-98 12.28.24 AV   JDA7339                  */00000030
 /*       SIST ENDRET 12/06-98 13.35.58 AV   SPA7339                  */00000040
 /*       SIST ENDRET 25/05-98 12.52.38 AV   SPA7339                  */00000050
 /*       SIST ENDRET 25/02-98 13.46.06 AV   JDA7339                  */00000060
 /*       SIST ENDRET 25/02-98 13.39.17 AV   JDA7339                  */00000070
 /*       SIST ENDRET 30/01-98 14.51.43 AV   JDA7339                  */00000080
 /*       SIST ENDRET 30/01-98 14.22.22 AV   JDA7339                  */00000090
 /*       SIST ENDRET 05/12-97 12.47.33 AV   JDA7339                  */00000100
 /*       SIST ENDRET 27/11-97 11.52.46 AV   JDA7339                  */00000110
 /*       SIST ENDRET 29/08-97 12.31.59 AV   JDA7339                  */00000120
 /*       SIST ENDRET 28/08-97 08.55.38 AV   SPA7339                  */00000130
 /*       SIST ENDRET 20/08-97 07.34.30 AV   HLA7339                  */00000140
 /*       SIST ENDRET 04/08-97 14.11.19 AV   JDA7339                  */00000150
 /*       SIST ENDRET 16/07-97 14.08.57 AV   HLA7339                  */00000160
 /*       SIST ENDRET 19/03-97 10.53.13 AV   JDA7339                  */00000170
 /*       SIST ENDRET 16/01-96 13.40.28 AV   HLB0310                  */00000180
 /*       SIST ENDRET 07/12-95 14.38.20 AV   HLB0310                  */00000190
 /*       SIST ENDRET 07/09-95 08.55.47 AV   TSB0310                  */00000200
 /*       SIST ENDRET 03/07-95 09.28.30 AV   HLB0310                  */00000210
 /*       SIST ENDRET 02/11-94 08.06.41 AV   HLB0310                  */00000220
 /*       SIST ENDRET 20/09-94 09.44.13 AV   HERMAN                   */00000230
 /*       SIST ENDRET 25/07-94 13.54.20 AV   DYBVIK                   */00000240
 /*       SIST ENDRET 24/05-94 14.04.28 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 21/03-94 15.01.35 AV   DYBVIK                   */00000260
 /*       SIST ENDRET 25/02-94 17.59.16 AV   HERMAN                   */00000270
 /*       SIST ENDRET 23/09-93 13.06.06 AV   DYBVIK                   */00000280
 /*       SIST ENDRET 06/05-93 13.58.04 AV   DYBVIK                   */00000290
 /*       SIST ENDRET 21/09-92 14.42.51 AV   DYBVIK                   */00000300
 /*       SIST ENDRET 10/08-92 11.45.34 AV   DYBVIK                   */00000310
 /*       SIST ENDRET 12/06-92 13.54.19 AV   TRUDE                    */00000320
 /*       SIST ENDRET 14/05-92 14.47.21 AV   HERMAN                   */00000330
 /*       SIST ENDRET 08/04-92 13.32.30 AV   DYBVIK                   */00000340
 /*       SIST ENDRET 08/04-92 09.03.55 AV   HERMAN                   */00000350
 /*       SIST ENDRET 31/03-92 09.14.06 AV   DYBVIK                   */00000360
 /*       SIST ENDRET 17/02-92 13.54.04 AV   DYBVIK                   */00000370
 /*       SIST ENDRET 28/01-92 12.27.20 AV   DYBVIK                   */00000380
 /*       SIST ENDRET 14/01-92 14.42.03 AV   DYBVIK                   */00000390
 /*       SIST ENDRET 03/01-92 14.54.51 AV   HERMAN                   */00000400
 /*       SIST ENDRET 13/12-91 13.02.14 AV   DYBVIK                   */00000410
 /*       SIST ENDRET 04/07-91 12.50.42 AV   DYBVIK                   */00000420
 /*       SIST ENDRET 14/06-91 13.29.17 AV   DYBVIK                   */00000430
 /*       SIST ENDRET 26/04-91 12.24.46 AV   DYBVIK                   */00000440
 /*       SIST ENDRET 08/04-91 12.08.30 AV   DYBVIK                   */00000450
 /*       SIST ENDRET 26/03-91 14.24.10 AV   HERMAN                   */00000460
 /*       SIST ENDRET 06/03-91 14.35.36 AV   DYBVIK                   */00000470
 /*       SIST ENDRET 10/10-90 10.24.39 AV   DYBVIK                   */00000480
 /*       SIST ENDRET 05/07-90 09.36.40 AV   DYBVIK                   */00000490
 /*       SIST ENDRET 23/11-89 15.07.54 AV   DYBVIK                   */00000500
 /*       SIST ENDRET 27/10-89 13.04.43 AV   DYBVIK                   */00000510
 /*       SIST ENDRET 16/10-89 13.08.53 AV   DYBVIK                   */00000520
 /*       SIST ENDRET 13/09-89 14.33.22 AV   DYBVIK                   */00000530
 /*       SIST ENDRET 17/07-89 14.39.08 AV   DYBVIK                   */00000540
 /*       SIST ENDRET 13/07-89 13.23.49 AV   DYBVIK                   */00000550
 /*       SIST ENDRET 02/06-89 15.55.33 AV   DYBVIK                   */00000560
 /*       SIST ENDRET 23/05-89 12.14.30 AV   DYBVIK                   */00000570
 /*       SIST ENDRET 19/05-89 10.46.54 AV   HERMAN                   */00000580
 /*       SIST ENDRET 12/05-89 08.55.06 AV   DYBVIK                   */00000590
 /*       SIST ENDRET 11/05-89 08.20.23 AV   DYBVIK                   */00000600
 /*       SIST ENDRET 26/04-89 08.10.01 AV   DYBVIK                   */00000610
 /*       SIST ENDRET 14/04-89 14.52.33 AV   DYBVIK                   */00000620
 /* ***************************************************************** */00000630
 /* IDENTIFIKASJON                                                    */00000640
 /*     R0014401 - BEREGN_UFØREPENSJON - HOVEDPROG I PLI.             */00000650
 /*     PROGRAMMERER: TOM JØRGENSEN, JULI 82.                         */00000660
 /* HENSIKT                                                           */00000670
 /*     BEREGNE UFØREPENSJON.                                         */00000680
 /*     OPPDATERER UFØRPENS MED : BT, ET, ST OG KT                    */00000690
 /*     OPPDATERER STATUS   MED : SUM_YTELSE                          */00000700
 /* PROGRAMTILKNYTNING.                                               */00000710
 /*     PROSEDYREN BLIR LINKET FRA  R0014001 - BEREGNINGER.           */00000720
 /* ENDRING 9803 - HL:                                                */00000730
 /*     ATTFØRINGSPENGER - ÅRSBELØP  LEGGES INN I :                   */00000740
 /*         DIV_PERIODE.ATTFØRING_GP_ÅRSBELØP                         */00000750
 /*         DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP                         */00000760
 /* ***************************************************************** */00000770
  R001440:                                                              00000780
   PROC(COMMAREA_PEKER) OPTIONS (MAIN);                                 00000790
 %PAGE;                                                                 00000800
 /*   %INCLUDE P0010601    */                                           00000810
 %PAGE;                                                                 00000820
 %INCLUDE P0019912;   /* DIV_PARAM_OMR */                               00000830
 %PAGE;                                                                 00000840
 %INCLUDE P0019910;   /* STYRINGS_OMR */                                00000850
 %PAGE;                                                                 00000860
 %INCLUDE P0019906;   /* TRANS_OPPL_OMR */                              00000870
 %PAGE;                                                                 00000880
 %INCLUDE P0019908;   /* KOM_OMR        */                              00000890
 %PAGE;                                                                 00000900
   DCL 1 B01 BASED (B01_PEKER),                                         00000910
 %INCLUDE P0019921;                                                     00000920
 %PAGE;                                                                 00000930
   DCL 1 B02 BASED (B02_PEKER),                                         00000940
 %INCLUDE P0019921;                                                     00000950
 %INCLUDE P0019924;   /* GV_TAB_RE */                                   00000960
 %PAGE;                                                                 00000970
 %INCLUDE P0014009;   /* POTALL_OPPL */                                 00000980
 %PAGE;                                                                 00000990
 %INCLUDE P0014002;   /* W_POENG_REKKE */                               00001000
 %INCLUDE P0014003;   /* TAB          */                                00001010
 %PAGE;                                                                 00001020
 %INCLUDE P0019925;   /* G_TAB_RE      */                               00001030
 %PAGE;                                                                 00001040
                                                                        00001050
  DCL (ADDR,                                                            00001060
       CSTG,                                                            00001070
       DATE,                                                            00001080
       VERIFY)     BUILTIN;                                             00001090
                                                                        00001100
  DCL                                                                   00001110
      DATO         CHAR(6);                                             00001120
  DCL                                                                   00001130
     1 DAGENS_DATO DEF DATO,                                            00001140
       2 ÅR        PIC'99',                                             00001150
       2 MND       PIC'99',                                             00001160
       2 DAG       PIC'99';                                             00001170
                                                                        00001180
                                                                        00001190
                                                                        00001200
 %PAGE;                                                                 00001210
   DCL COMMAREA_PEKER PTR;                                              00001220
   DCL UF_IND       FIXED BIN (15);                                     00001230
   DCL J            FIXED BIN (15);                                     00001240
   DCL ST_FRADRAG   FIXED DEC (5);                                      00001250
   DCL TT_EGEN      FIXED DEC (5);                                      00001260
   DCL TT_EK        FIXED DEC (5);                                      00001270
   DCL ÅFT_MAX      FIXED DEC (5) INIT(0);                              00001280
   DCL W_BT         FIXED DEC (5) INIT(0);                              00001290
   DCL TP_GARANTI1  FIXED DEC (7) INIT(0);                              00001300
   DCL TP_GARANTI   FIXED DEC (13,4) INIT(0);                           00001310
   DCL TP_GARANTI1_YP  FIXED DEC (7) INIT(0);                           00001320
   DCL TP_GARANTI_YP   FIXED DEC (13,4) INIT(0);                        00001330
   DCL NEI          BIT(1)  INIT ('0'B);                                00001340
   DCL UFØR_FØR_73  CHAR (1) INIT (' ');   /*310392TS*/                 00001350
   DCL S_KODE       PIC '9';                                            00001360
   DCL K            FIXED BIN (15);                                     00001370
   DCL INDEX        FIXED BIN (15);                                     00001380
                                                                        00001390
   DCL 1 W,                                                             00001400
           2 TP     FIXED DEC (5),                                      00001410
           2 TP1    FIXED DEC (5),                                      00001420
           2 TP2    FIXED DEC (13,4);                                   00001430
   DCL                                                                  00001440
    1 W_FNR                               PIC      '(11)9';             00001450
   DCL                                                                  00001460
    1 FNR_R DEF W_FNR,                                                  00001470
      2 DAG                   PIC '(2)9',                               00001480
      2 MND                   PIC '(2)9',                               00001490
      2 ÅR                    PIC '(2)9',                               00001500
      2 ÅRHUNDRE              PIC '9',                                  00001510
      2 FILLER                PIC '(4)9';                               00001520
   DCL PÅ_EK        FIXED DEC (3);                                      00001530
                                                                        00001540
   DCL SPT_GARANTI  FIXED DEC (3,2) INIT(0);        /*UF*/              00001550
                                                                        00001560
    DCL W_BT2        FIXED DEC (5) INIT(0);                             00001570
 DCL W_FNR_EK           PIC'(11)9';                                     00001580
 DCL ALDER_EK        FIXED DEC (5) INIT (0);      /*HL*/                00001590
 DCL W_DATO_ÅM          PIC'(4)9';                                      00001600
 DCL W_ÅR  DEF W_DATO_ÅM POS(1)   PIC'99';                              00001610
 DCL W_MN  DEF W_DATO_ÅM POS(3)   PIC'99';                              00001620
 DCL W_DATO_MÅ          PIC'9999';                                      00001630
 DCL GARANTITILLEGG     FIXED DEC (5) INIT (0);     /*HL*/              00001640
                                                                        00001650
 DCL KAP11_UTLØST      CHAR (1) ;                    /*TS*/             00001660
 DCL U_UFT_MÅ          PIC '(4)9';                   /*TS*/             00001670
 DCL U_FNR              PIC '(11)9';                  /*TS*/            00001680
 DCL TT_KONVENSJON      PIC '99';       /*TS                 0892*/     00001690
 DCL REDUKSJONSBELØP   FIXED DEC (5) INIT (0);                          00001700
                                                /*TRUDE,210292      */  00001710
 DCL UP_GP_DEC         FIXED DEC(7,2) INIT (0), /*VED 50%YP + 50% GP*/  00001720
     YP_GP_DEC         FIXED DEC(7,2) INIT (0),/*BLIR GP KR 1 FOR LITE*/00001730
     SUM_GP            FIXED DEC (5) INIT (0),                          00001740
     DIFF_GP           FIXED DEC (5) INIT (0);                          00001750
                                                                        00001760
 DCL W_BOSATT            CHAR(1) INIT (' ');   /*200392 TRUDE */        00001770
 DCL YRKE_ÅRSTP        FIXED DEC (7) INIT (0);                          00001780
 DCL W_INNTEKT_FØR     FIXED DEC (9) INIT (0); /* 190994 TRUDE */       00001790
 DCL ALTERNATIV_ER_OPPDATERT CHAR(1) INIT (' ');                        00001800
 DCL ALTERNATIV_SAVE   FIXED DEC (7) INIT (0);                          00001810
 DCL OPPH_ÅM                         PIC'(4)9';                         00001820
 DCL OPPH_ÅR DEF OPPH_ÅM POS(1)      PIC'(2)9';                         00001830
 DCL OPPH_MN DEF OPPH_ÅM POS(3)      PIC'(2)9';                         00001840
 DCL UFT_ÅRM                         PIC'(4)9';                         00001850
 DCL UFT_ÅR DEF UFT_ÅRM POS(1)       PIC'(2)9';                         00001860
 DCL UFT_MN DEF UFT_ÅRM POS(3)       PIC'(2)9';                         00001870
 DCL JA           BIT(1)  INIT ('1'B);                                  00001880
 DCL SKAL_TESTES  BIT(1)  INIT ('0'B);                                  00001890
                                                                        00001900
 /* ********************************************************* */        00001910
 /*    SLUTT PÅ DCL                                           */        00001920
 /* ********************************************************* */        00001930
                                                                        00001940
 COMMAREA_PEKER           = ADDR(KOM_OMR);                              00001950
 KOM_OMR.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);                00001960
 DIV_PARAM_OMR.ENGANGSBELØP_11_7(BER_SØ_IND) = 0;       /*  SP    */    00001970
 DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND) = 0;                       00001980
 DIV_PERIODE.ATTFØRING_GP_ÅRSBELØP           = 0;                       00001990
 DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP           = 0;                       00002000
                                                                        00002010
 IF TRANS_OPPL_OMR.BLANKETTYPE   = 'UP' THEN    /*NY0191TS*/            00002020
    CALL HENT_FRA_UP;                                                   00002030
 ELSE                                                                   00002040
    IF TRANS_OPPL_OMR.BLANKETTYPE   = 'U2' THEN    /*NY0191TS*/         00002050
       CALL HENT_FRA_U2;                                                00002060
 ELSE                                                                   00002070
    IF TRANS_OPPL_OMR.BLANKETTYPE   = 'U3' THEN    /*NY0194HL*/         00002080
       DO;                                                              00002090
          CALL HENT_FRA_U3;                                             00002100
          /* CALL BEREGN_INNTEKT_FØR_UP    R0014430 */                  00002110
       END;                                                             00002120
                                                                        00002130
 W_DATO_ÅM = B02.VIRK_DATO_ÅM(BER_SØ_IND);                              00002140
 W_DATO_MÅ = W_MN * 100 + W_ÅR;                                         00002150
 W_FNR_EK  = B02.FNR(BER_EK_IND);                                       00002160
 /*HL : */            ALDER_EK =  F_ALDER(W_FNR_EK,W_DATO_MÅ);          00002170
                                                                        00002180
 %PAGE;                                                                 00002190
   PROGRAM_ID    = 'R0014401';                                          00002200
   W_FNR         = B02.FNR(BER_SØ_IND);                                 00002210
                                                                        00002220
   DATO          = DATE;                                                00002230
                                                                        00002240
                                                                        00002250
    /* ************************************************************** */00002260
    /* IKKE SAMMENSTØTENDE BEREGNING NÅR EK HAR 0 APD                 */00002270
    /* ************************************************************** */00002280
                                                                        00002290
                                                                        00002300
 /* ENDRET 20.1.88 HL - FRAPP 467 OG 556                         */     00002310
                                                                        00002320
                                                                        00002330
    IF (B02.PENSJONSTYPE1(BER_EK_IND) = 'A' !                           00002340
        B02.PENSJONSTYPE1(BER_EK_IND) = 'K' ) &                         00002350
       B02.ALDERSP.APD  (BER_EK_IND) =  0      &                        00002360
       B02.SUM_YTELSE   (BER_EK_IND) =  0      &           /*NY92*/     00002370
       B02.KONV_P_KODE  (BER_EK_IND) ^= 'F'   THEN                      00002380
       DO;                                                              00002390
          B02.PENSJONSTYPE2(BER_SØ_IND)  = 'P';                         00002400
          B02.PENSJONSTYPE2(BER_EK_IND)  = 'P';                         00002410
       END;                                                             00002420
    ELSE                                                                00002430
    IF (B02.PENSJONSTYPE1(BER_EK_IND) = 'U' !                           00002440
        B02.PENSJONSTYPE1(BER_EK_IND) = 'Y' ) &                         00002450
       B02.UFØRPENS.UFG (BER_EK_IND) =  0      &                        00002460
       B02.SUM_YTELSE   (BER_EK_IND) =  0        THEN                   00002470
       DO;                                                              00002480
          B02.PENSJONSTYPE2(BER_SØ_IND)  = 'P';                         00002490
          B02.PENSJONSTYPE2(BER_EK_IND)  = 'P';                         00002500
       END;                                                             00002510
    ELSE                                                                00002520
       DO;                                                              00002530
          IF (B02.SIVILSTAND (BER_EK_IND) = 'G' !                       00002540
              B02.SIVILSTAND (BER_EK_IND) = 'P' !   /*9710 HL*/         00002550
              B02.SIVILSTAND (BER_EK_IND) = 'W'  ) &                    00002560
             B02.PENSJONSTYPE2(BER_EK_IND)  = 'P'   &                   00002570
             B02.PENSJONSTYPE2(BER_SØ_IND)  = 'P'    THEN               00002580
             DO;                                                        00002590
                B02.PENSJONSTYPE2(BER_SØ_IND)  = 'S';                   00002600
                B02.PENSJONSTYPE2(BER_EK_IND)  = 'S';                   00002610
  /*TATT BORT 9712 HL : */                                              00002620
  /*            IF B02.PENSJONSTYPE3(BER_EK_IND) = 'S' THEN             00002630
                   B02.PENSJONSTYPE2(BER_SØ_IND) = 'P';      */         00002640
             END;                                                       00002650
       END;                                                             00002660
                                                                        00002670
  /*0-PENSJONISTER SKAL IKKE HA PENSJONSTYPE2 = 'S'  0797 HL: */        00002680
                                                                        00002690
    IF B02.UFØRPENS.UFG (BER_SØ_IND) =  0      &                        00002700
       B02.SUM_YTELSE   (BER_SØ_IND) =  0      &                        00002710
       B02.PENSJONSTYPE2(BER_EK_IND)  = 'S'               THEN          00002720
       DO;                                                              00002730
          B02.PENSJONSTYPE2(BER_SØ_IND)  = 'P';                         00002740
          B02.PENSJONSTYPE2(BER_EK_IND)  = 'P';                         00002750
       END;                                                             00002760
        /* TATT BORT 9712 HL :     */                                   00002770
 /* IF B02.PENSJONSTYPE3(BER_EK_IND)  = 'S' &                           00002780
       B02.SIVILSTAND   (BER_SØ_IND)  = 'G'  THEN                       00002790
       DO;                                                              00002800
          B02.PENSJONSTYPE2(BER_SØ_IND)  = 'P';                         00002810
       END;                                         */                  00002820
                                                                        00002830
    IF (KAP11_UTLØST   = 'J'                &                           00002840
        U_FNR          = B02.FNR(BER_SØ_IND))  THEN                     00002850
           B02.PENSJONSTYPE2(BER_SØ_IND)  = ' ';                        00002860
                                                                        00002870
   DCL UFGRAD         FIXED DEC (3);                                    00002880
   DCL FAKTOR         FIXED DEC (3) INIT (0);                           00002890
   DCL W_GP           FIXED DEC (11,4) INIT (0);                        00002900
   DCL Y_GP           FIXED DEC (11,4) INIT (0);                        00002910
                                                                        00002920
                                                                        00002930
   UFGRAD = B02.UFØRPENS.UFG(BER_SØ_IND) -                              00002940
            B02.YRKEPENS.YUG(BER_SØ_IND);                               00002950
                                                                        00002960
   IF UFGRAD < 0 THEN                                                   00002970
      UFGRAD = 0;                                                       00002980
                                                                        00002990
    IF  B02.PENSJONSTYPE2 (BER_SØ_IND) = 'S'   THEN                     00003000
       DO;                                                              00003010
                                                                        00003020
 /*TILLEGG 18.9.89 HL - LOVENDRING 7.2 NR 2 B - 2. SETNING UTGÅR*/      00003030
                                                                        00003040
          IF B01.PENSJONSTYPE2(BER_SØ_IND)    = 'S'    &                00003050
             B01.STATUS_KODE_HIST(BER_SØ_IND) = ' '    &                00003060
             B01.UFØRPENS.UFG    (BER_EK_IND) < 100    &                00003070
             B01.UFØRPENS.UFG    (BER_EK_IND) >   0    &                00003080
             B01.VIRK_DATO_ÅM    (BER_SØ_IND) < 9001  THEN              00003090
                                                                        00003100
             B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'J';            00003110
                                                                        00003120
 /*ENDRET 21.9.91 HL - NY SAMMENSTØTS REGEL NÅR UFG_EK ER 100/0 */      00003130
                                                                        00003140
          IF B02.UFØRPENS.UFG    (BER_EK_IND) = 100    !                00003150
             B02.UFØRPENS.UFG    (BER_EK_IND) =   0      THEN           00003160
             B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'N';            00003170
                                                                        00003180
 /*HIT HL */                                                            00003190
                                                                        00003200
          IF  (B02.PENSJONSTYPE1(BER_EK_IND) = 'U' !                    00003210
               B02.PENSJONSTYPE1(BER_EK_IND) = 'Y'  )   THEN            00003220
                                                                        00003230
             DO;                                                        00003240
                IF (B02.VIRK_DATO_ÅM    (BER_SØ_IND) < 9001 !           00003250
                   B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'J') THEN 00003260
                                                                        00003270
                   FAKTOR = B02.UFØRPENS.UFG(BER_EK_IND);               00003280
                                                                        00003290
                ELSE                                                    00003300
                                                                        00003310
                   DO;                                                  00003320
                      B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'N';   00003330
                      FAKTOR = 100;                                     00003340
                   END;                                                 00003350
             END;                                                       00003360
          ELSE                                                          00003370
             FAKTOR = 100;                                              00003380
      END;                                                              00003390
                                                                        00003400
   ELSE    /*IKKE SAMMENSTØTS-BEREGNING */                              00003410
  /* I DISSE TILFELLENE SKAL GP IKKE REDUSERES : 9805 HL */             00003420
                                                                        00003430
   IF ^(B02.PENSJON_FØR_9802(BER_SØ_IND) = 'J'   &                      00003440
        B02.SIVILSTAND(BER_SØ_IND)       = 'V')  THEN                   00003450
 DO;  /*TILLEGG 9805*/                                                  00003460
   IF B02.PENSJONSTYPE1(BER_EK_IND) = 'K'  &                            00003470
      B02.SUM_YTELSE   (BER_EK_IND) > 0    &        /*9802 HL*/         00003480
      B02.SIVILSTAND           (BER_SØ_IND) ^= 'A'    &                 00003490
      ALDER_EK < 6501          THEN                                     00003500
      DO;                                                               00003510
         IF B02.ALDERSP.UTTAKSDATO_ÅM(BER_EK_IND) > 9709   THEN         00003520
            DO;                                                         00003530
               FAKTOR= 100;                                             00003540
               DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'K';          00003550
            END;                                                        00003560
         ELSE    /*REGLER FØR 9710 : */                                 00003570
         IF B02.PENSJONSTYPE3(BER_EK_IND) = 'S'   THEN                  00003580
            DO;                                                         00003590
               FAKTOR= 100;                                             00003600
               DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'K';          00003610
            END;                                                        00003620
      END;                                                              00003630
   ELSE                                                                 00003640
      FAKTOR = 0;                                                       00003650
 END; /*TILLEGG 9805*/                                                  00003660
                                                                        00003670
 /* PRØVER Å FLYTT ALLE KALL TIL GP ETTER TP BEREGNING , TRUDE*/        00003680
                                                                        00003690
 /*FLYTTET TIL 4421    9804 :     *******************                   00003700
                                                                        00003710
         W_GP         = 1 - 0.25 * (FAKTOR/100);                        00003720
         W_GP         = W_GP * G;                                       00003730
         W_GP         = W_GP * B02.YRKEPENS.YUG(BER_SØ_IND)/100;        00003740
         IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN                    00003750
   9804     DIV_PERIODE.ATTFØRING_GP_ÅRSBELØP = W_GP + 0.5;             00003760
         B02.YRKEPENS.GP(BER_SØ_IND) = W_GP/12 + 0.5;                   00003770
         YP_GP_DEC                   = W_GP/12;                         00003780
                                                                        00003790
  **************************************************** */               00003800
                                                                        00003810
   CALL BEREGN_TP_UP;       /*4422*/                                    00003820
                                                                        00003830
 /*YS  4424 SKAL BARE CALLES VED NY SKADE */                            00003840
 /*YS  TRANSTYPE9 = ENDRINGSBLANKETT      */                            00003850
                                                                        00003860
                                                                        00003870
         IF ((B02.YRKEPENS.YUG(BER_SØ_IND) >                            00003880
              B01.YRKEPENS.YUG(BER_SØ_IND)   )  &                       00003890
              TRANS_OPPL_OMR.TRANSTYPE ^= 9    )       !                00003900
                                                                        00003910
 /*TILLEGG 20.3.90 HL : */                                              00003920
                                                                        00003930
             (B01.YRKEHIST.AÅI(BER_SØ_IND,1) ^=                         00003940
              B02.YRKEHIST.AÅI(BER_SØ_IND,1) )      THEN                00003950
                                                                        00003960
            DO;                                                         00003970
               CALL BEREGN_POENG_AV_AÅI;      /*4424*/                  00003980
               CALL BEREGN_TP_YP;             /*4425*/                  00003990
            END;                                                        00004000
                                                                        00004010
                                                                        00004020
         ELSE                                                           00004030
         IF  B02.PENSJONSTYPE1(BER_SØ_IND) = 'Y'     THEN               00004040
 /* ****************                                                    00004050
             IF TRANS_OPPL_OMR.TRANSTYPE = 22 !                         00004060
                TRANS_OPPL_OMR.TRANSTYPE = 23 !                         00004070
                TRANS_OPPL_OMR.TRANSTYPE = 30 !                         00004080
                TRANS_OPPL_OMR.TRANSTYPE = 31 !                         00004090
                TRANS_OPPL_OMR.TRANSTYPE = 39 !                         00004100
                TRANS_OPPL_OMR.TRANSTYPE = 46 THEN                      00004110
 *** */                                                                 00004120
                                                                        00004130
                CALL BEREGN_TP_YP;            /*4425*/                  00004140
                                                                        00004150
 /*ENDRET 13.9.89 HL - SPT/YPT    KAN ENDRES BL.A.VED TILSTÅELSE*/      00004160
 /*                    AV POENGTILLEGG                          */      00004170
                                                                        00004180
         ELSE;                                                          00004190
                                                                        00004200
 /*YS DET KAN LØNNE SEG Å FORETA FULL BEREGNING ETTER KAP 8 */          00004210
                                                                        00004220
   IF UFGRAD > 0 THEN                                                   00004230
                                                                        00004240
      DO;                                                               00004250
         ALTERNATIV_SAVE = DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP;/*9804*/   00004260
         W.TP = F_TP92((FNR_R.ÅR),                                      00004270
                       (G),                                             00004280
                       (B02.UFØRPENS.SPT(BER_SØ_IND)),                  00004290
                       (B02.UFØRPENS.OPT(BER_SØ_IND)),                  00004300
                       (B02.UFØRPENS.PÅ(BER_SØ_IND)),                   00004310
                       (B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND)),           00004320
                       (B02.UFØRPENS.UFG(BER_SØ_IND)),                  00004330
                        100,                                            00004340
                        'J'                                             00004350
                      );                                                00004360
                                                                        00004370
         IF W.TP > (B02.UFØRPENS.TP(BER_SØ_IND) +                       00004380
                    B02.YRKEPENS.TP(BER_SØ_IND))    THEN                00004390
                                                                        00004400
            DO;                                                         00004410
               ALTERNATIV_ER_OPPDATERT = 'J';                           00004420
               B02.UFØRPENS.TP(BER_SØ_IND) = W.TP -                     00004430
                           B02.YRKEPENS.TP(BER_SØ_IND);                 00004440
            END;                                                        00004450
         ELSE                                                           00004460
 /*9804*/   DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = ALTERNATIV_SAVE;        00004470
      END;                                                              00004480
                                                                        00004490
  /* ************************************************************** */  00004500
  /* BEREGNINGSREGLENES PUNKT 1.5 SIER AT BÅDE TILLEGGSPENSJON      */  00004510
  /* ETTER KAP. 8 OG 11 SKAL AVRUNDES HVER FOR SEG.  DETTE GIR      */  00004520
  /* I PRAKSIS 1 KRONE MER I TILLEGGSPENSJON NÅR KAP. 8 -           */  00004530
  /* ALTERNATIVET VELGES SOM DET BESTE ALTERNATIVET (ISTEDET FOR    */  00004540
  /* ALTERNATIVET MED PAÅ).  VISER SEG BARE NÅR YP-GRADEN ER MINDRE */  00004550
  /* ENN UP-GRADEN.  AVKLART I YRKESKADEMØTE 13.1.88.  ERIK.        */  00004560
  /* ************************************************************** */  00004570
                                                                        00004580
   IF FEIL_MELD_NR > 0  THEN                                            00004590
      GO TO L999;                                                       00004600
   ELSE                                                                 00004610
      PROGRAM_ID = 'R0014401';                                          00004620
                                                                        00004630
   IF (TRANSTYPE = 2   ! DIV_PARAM_OMR.REGN_1291 = '2' )                00004640
 /*23.5.89 HL*/  /*  UFGRAD > 0  &    FJERNET 22.11.89 HL */            00004650
      & DIV_PARAM_OMR.SISTE_UFTIDSPUNKT = ' '             /*0794 HL*/   00004660
      & DIV_PARAM_OMR.REGN_1291 ^= '3'                    /*9810*/      00004670
      & B02.PENSJONSTYPE3(BER_SØ_IND) ^= 'A' THEN                       00004680
                                                                        00004690
 /* VI MÅ UNDERSØKE OM DET ER FLER ENN ETT MULIG UFØRETIDSPUNKT.      */00004700
 /* (DEN NYE UFØREPERIODEN ER LAGT INN).                              */00004710
      DO;                                                               00004720
         IF B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,2) > 0 THEN                  00004730
            DO;                                                         00004740
               DO J = 2 TO 7;         /*0697 HL*/                       00004750
               IF B02.UFØRHIST.OPPHØRSDATO_ÅM(BER_SØ_IND,J) = 0 THEN    00004760
                  DO;                                                   00004770
   /*FRA 9812 SKAL OPPHØR IKKE VÆRE I JANUAR (BLIR DA DESEMBER)*/       00004780
             OPPH_ÅM =  B02.UFØRHIST.OPPHØRSDATO_ÅM(BER_SØ_IND,(J-1));  00004790
             UFT_ÅRM =  B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,J);              00004800
             IF OPPH_ÅR > 97 &                                          00004810
                OPPH_MN = 12 &                                          00004820
                UFT_ÅR  = OPPH_ÅR + 1  &                                00004830
                UFT_MN  = 1                THEN                         00004840
                SKAL_TESTES = JA;                                       00004850
             ELSE                                                       00004860
             IF (OPPH_ÅM = UFT_ÅRM)  &                                  00004870
     /*           IF (B02.UFØRHIST.OPPHØRSDATO_ÅM(BER_SØ_IND,(J-1)) =   00004880
                  B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,J)           ) &  */   00004890
                  ((B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,J) > 9704 )    !     00004900
                   (B02.UFØRHIST.UFG(BER_SØ_IND,(J-1)) >= 50))    THEN  00004910
                 SKAL_TESTES = JA;                                      00004920
                                                                        00004930
 /*YS : OPPDATERING AV GAMMEL UFØREPENSJON ER IKKE AKTUELL FOR      */  00004940
 /*YS : GRADER UNDER 50  (KAP11-PENSJON)                            */  00004950
                                                                        00004960
              IF SKAL_TESTES = JA               THEN                    00004970
                       DO;       /*9804*/                               00004980
         ALTERNATIV_SAVE = DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP;           00004990
                         IF B01.UFØRPENS.SPT_1291(BER_SØ_IND) >         00005000
                            B01.UFØRPENS.SPT(BER_SØ_IND)     THEN       00005010
                                                                        00005020
                            W.TP = F_TP92                               00005030
                                 ( FNR_R.ÅR ,                           00005040
                                   G,                                   00005050
                                  (B01.UFØRPENS.SPT_1291(BER_SØ_IND)),  00005060
                                  (B01.UFØRPENS.OPT_1291(BER_SØ_IND)),  00005070
                                  (B01.UFØRPENS.PÅ_1291(BER_SØ_IND)),   00005080
                                  (B01.UFØRPENS.PÅ_ETTER91(BER_SØ_IND)),00005090
                                  (B02.UFØRPENS.UFG(BER_SØ_IND)),       00005100
                                   100,                                 00005110
                                   'J'                                  00005120
                                 );                                     00005130
                                                                        00005140
                         ELSE                                           00005150
                            W.TP = F_TP92                               00005160
                                 ( FNR_R.ÅR,                            00005170
                                    G,                                  00005180
                                  (B01.UFØRPENS.SPT(BER_SØ_IND)),       00005190
                                  (B01.UFØRPENS.OPT(BER_SØ_IND)),       00005200
                                  (B01.UFØRPENS.PÅ(BER_SØ_IND)),        00005210
                                  (B01.UFØRPENS.PÅ_ETTER91(BER_SØ_IND)),00005220
                                  (B02.UFØRPENS.UFG(BER_SØ_IND)),       00005230
                                    100,                                00005240
                                    'J'                                 00005250
                                 );                                     00005260
                                                                        00005270
 /*ENDRING 22.11.89 HL : */                                             00005280
                                                                        00005290
                         W.TP1 = F_TP92(FNR_R.ÅR,                       00005300
                                  G,                                    00005310
                                  (B02.UFØRPENS.SPT(BER_SØ_IND)),       00005320
                                  (B02.UFØRPENS.OPT(BER_SØ_IND)),       00005330
                                  (B02.UFØRPENS.PÅ(BER_SØ_IND)),        00005340
                                 (B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND)), 00005350
                                  (B02.UFØRPENS.UFG(BER_SØ_IND)),       00005360
                                  100,                                  00005370
                                 'J');                                  00005380
         /*9804 : */                                                    00005390
            DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = ALTERNATIV_SAVE;        00005400
                         IF W.TP >= W.TP1              THEN             00005410
                                                                        00005420
 /*HIT 22.11.89 HL */                                                   00005430
                                                                        00005440
 /* GAMMELT UFØRETIDSPUNKT LØNNER SEG.                                */00005450
                            DO;                                         00005460
                               B02.UFØRPENS.TP(BER_SØ_IND)  = W.TP;     00005470
                               B02.UFØRPENS.SPT(BER_SØ_IND) =           00005480
                                        B01.UFØRPENS.SPT(BER_SØ_IND);   00005490
                               B02.UFØRPENS.OPT(BER_SØ_IND) =           00005500
                                        B01.UFØRPENS.OPT(BER_SØ_IND);   00005510
                               B02.UFØRPENS.PÅ(BER_SØ_IND)  =           00005520
                                        B01.UFØRPENS.PÅ(BER_SØ_IND);    00005530
                               B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND)  =   00005540
                                B01.UFØRPENS.PÅ_ETTER91(BER_SØ_IND);    00005550
  /*4423*/                    CALL OPPDATER_GAMMEL_UFØRHISTORIKK;       00005560
                              IF FEIL_MELD_NR > 0 THEN                  00005570
                                 J = 7;        /*0697 HL*/              00005580
                                                                        00005590
 /*TILLEGG 120589 - HL*/      CALL BEREGN_TP_UP;       /*4422*/         00005600
                                                                        00005610
         IF  B02.PENSJONSTYPE1(BER_SØ_IND) = 'Y'     THEN               00005620
                                                                        00005630
                CALL BEREGN_TP_YP;            /*4425*/                  00005640
                                                                        00005650
                            END;                                        00005660
                        END;                                            00005670
                    J = 7;        /*0697 HL*/                           00005680
                  END;    /*OPPHØRSDATO = 0 */                          00005690
             END;   /* J = 2 TO 7 */                                    00005700
           END;  /* UFT > 0 */                                          00005710
      END;   /* TRANSTYPE = 2 & PENSJONSTYPE3 ^= A */                   00005720
                                                                        00005730
                                                                        00005740
                                                                        00005750
             /*-------------------------------------------------------*/00005760
             /*----------PENSJON UTLAND-------------------------------*/00005770
             /*NÅ HAR VI ENDELIG FÅTT REGNET UT ANTALL POENGÅR.       */00005780
             /*DERSOM ANTALL POENGÅR > TT_ANV SÅ SKAL DENNE BRUKES TIL*/00005790
             /*Å REGNE GRUNNPENSJON ETTER. - TRUDE 0990---------------*/00005800
             /*-------------------------------------------------------*/00005810
                                                                        00005820
   IF B02.SPESOPPL.BOSATT(BER_SØ_IND) > 0  &                            00005830
      B02.VIRK_DATO_ÅM(BER_SØ_IND) <  9101 THEN                         00005840
                                                                        00005850
      CALL BEREGN_GP_UP_UTLAND; /* 4482-NYTT PROGRAM               */   00005860
   ELSE                                                                 00005870
      CALL BEREGN_GP_UP;         /*4421*/                               00005880
                                                                        00005890
                                                                        00005900
             /*-------------------------------------------------------*/00005910
             /* GRUNNPENSJON BLE KR 1 FOR LITE VED 50%UP + 50% YP     */00005920
             /* TRUDE, 21.02.92                                       */00005930
             /*-------------------------------------------------------*/00005940
       SUM_GP   = UP_GP_DEC  + YP_GP_DEC + 0.5;                         00005950
       DIFF_GP  = SUM_GP - (B02.UFØRPENS.GP(BER_SØ_IND) +               00005960
                            B02.YRKEPENS.GP(BER_SØ_IND));               00005970
       IF ( DIFF_GP  > 0  &                                             00005980
            B02.IKKE_GP(BER_SØ_IND) ^= 'J') THEN                        00005990
           B02.UFØRPENS.GP(BER_SØ_IND) =                                00006000
                          B02.UFØRPENS.GP(BER_SØ_IND) + DIFF_GP;        00006010
       ELSE                                                             00006020
           DIFF_GP  = 0 ;                                               00006030
                                                                        00006040
             /*-------------------------------------------------------*/00006050
             /* HER SKAL VI SE OM GARANTIEN FOR UNGE UFØRE FØR 1967   */00006060
             /* SLÅR TIL. TRUDE, 28.06.89                             */00006070
             /*-------------------------------------------------------*/00006080
             /* PGA ENDRING AV ALDERSGRENSE 0592 TIL 24 ÅR.           */00006090
             /* MÅ HA MED TEST PÅ ALDER. TRUDE 200892                 */00006100
             /*-------------------------------------------------------*/00006110
                                                                        00006120
   DCL TEST_TP  FIXED DEC (5) INIT (0);                                 00006130
   TEST_TP = B02.UFØRPENS.TP(BER_SØ_IND);                               00006140
   /*0697 HL:*/                                                         00006150
   DO K = 7 TO 1 BY -1 UNTIL(B02.UFØRHIST.BUP_GAR_KODE(BER_SØ_IND,K)    00006160
                                                  ^= ' ');              00006170
      S_KODE   = K;                                                     00006180
   END;                                                                 00006190
                                                                        00006200
   DCL TEST_KODE CHAR(1) INIT (' ');                                    00006210
   TEST_KODE =                                                          00006220
              B02.BUP_GAR_KODE(BER_SØ_IND,S_KODE);                      00006230
                                                                        00006240
   IF B02.BUP_GAR_KODE(BER_SØ_IND,1)  =   'E'   &                       00006250
      B02.VIRK_DATO_ÅM(BER_SØ_IND)    >  8906   THEN                    00006260
                                                                        00006270
  /*ENDRET 9708 HL : */                                                 00006280
                                                                        00006290
     DO;  /*VIRK 8907 - 9012 :*/                                        00006300
        IF B02.VIRK_DATO_ÅM(BER_SØ_IND) <  9100  THEN                   00006310
           DO;                                                          00006320
              SPT_GARANTI  = 1.6;                                       00006330
           END;                                                         00006340
        ELSE /*VIRK 9101-9112 :*/                                       00006350
        IF B02.VIRK_DATO_ÅM(BER_SØ_IND) <  9201        THEN             00006360
           DO;                                                          00006370
              IF FNR_R.ÅR     =  23  !                                  00006380
                 FNR_R.ÅR     =  24  THEN                               00006390
                 SPT_GARANTI  = 1.6;                                    00006400
              ELSE                                                      00006410
                 SPT_GARANTI  = 2;                                      00006420
           END;                                                         00006430
        ELSE  /*VIRK 9201 - 9204: */                                    00006440
        IF B02.VIRK_DATO_ÅM(BER_SØ_IND) <  9205         THEN            00006450
           DO;                                                          00006460
              IF  FNR_R.ÅR     = 25  THEN                               00006470
                  SPT_GARANTI  = 2;                                     00006480
              ELSE                                                      00006490
              IF  FNR_R.ÅR    >  25  &                                  00006500
                  FNR_R.ÅR    <  45  THEN                               00006510
                  SPT_GARANTI  = 2.5;                                   00006520
              ELSE                                                      00006530
              IF FNR_R.ÅR     =  23  !                                  00006540
                 FNR_R.ÅR     =  24  THEN                               00006550
                 SPT_GARANTI  = 1.6;                                    00006560
           END;                                                         00006570
        ELSE  /*VIRK 9205 - 9704: */                                    00006580
        IF B02.VIRK_DATO_ÅM(BER_SØ_IND) <  9705            THEN         00006590
           DO;                                                          00006600
              IF  FNR_R.ÅR     = 25  THEN                               00006610
                  SPT_GARANTI  = 2;                                     00006620
              ELSE                                                      00006630
                  SPT_GARANTI  = 3;                                     00006640
           END;                                                         00006650
        ELSE  /*VIRK ETTER 9704 : */                                    00006660
           IF FNR_R.ÅR > 30            THEN                             00006670
              SPT_GARANTI  = 3.3;                                       00006680
           ELSE                                                         00006690
              SPT_GARANTI  = 3;                                         00006700
                                                                        00006710
        TP_GARANTI  = ( SPT_GARANTI * 0.45 * G );                       00006720
        TP_GARANTI  = TP_GARANTI / 100  ;                               00006730
        TP_GARANTI  = TP_GARANTI * B02.TT_ANV(BER_SØ_IND);              00006740
        TP_GARANTI  = TP_GARANTI * UFGRAD;                              00006750
        TP_GARANTI  = TP_GARANTI / ( 40 * 12) ;                         00006760
        TP_GARANTI1 = TP_GARANTI + 0.5;                                 00006770
                                                                        00006780
          IF TP_GARANTI1 > B02.UFØRPENS.TP(BER_SØ_IND)  THEN            00006790
             DO;                                                        00006800
                B02.UFØRPENS.TP(BER_SØ_IND)   = TP_GARANTI1;            00006810
                B02.STATUS.TP_GAR_KODE(BER_SØ_IND)  = 'E';              00006820
             END;                                                       00006830
          IF B02.PENSJONSTYPE1(BER_SØ_IND)  = 'Y' THEN                  00006840
            DO;                                                         00006850
               TP_GARANTI_YP = ( SPT_GARANTI * 0.45 * G );              00006860
               TP_GARANTI_YP = TP_GARANTI_YP / 100 ;                    00006870
               TP_GARANTI_YP = TP_GARANTI_YP                            00006880
                                        * B02.TT_ANV(BER_SØ_IND);       00006890
               TP_GARANTI_YP = TP_GARANTI_YP                            00006900
                                 * B02.YRKEPENS.YUG(BER_SØ_IND);        00006910
               TP_GARANTI_YP = TP_GARANTI_YP / ( 40 * 12) ;             00006920
               TP_GARANTI1_YP = TP_GARANTI_YP + 0.5;                    00006930
             IF TP_GARANTI1_YP > B02.YRKEPENS.TP(BER_SØ_IND) THEN       00006940
               DO;                                                      00006950
                 B02.YRKEPENS.TP(BER_SØ_IND) = TP_GARANTI1_YP;          00006960
                 B02.STATUS.TP_GAR_KODE(BER_SØ_IND) = 'E';              00006970
               END;                                                     00006980
            END;                                                        00006990
      END;                                                              00007000
                                                                        00007010
                                                                        00007020
   IF FEIL_MELD_NR > 0 THEN                                             00007030
      GO TO L999;                                                       00007040
   ELSE                                                                 00007050
      PROGRAM_ID = 'R0014401';                                          00007060
                                                                        00007070
                                                                        00007080
   CALL BEREGN_BT( W_BT,                        /*4233*/                00007090
                  (UFGRAD));                                            00007100
           B02.UFØRPENS.BT (BER_SØ_IND) = W_BT;                         00007110
                                                                        00007120
   CALL BEREGN_BT(W_BT2,                       /*4233*/                 00007130
                  (B02.YRKEPENS.YUG(BER_SØ_IND)));                      00007140
           B02.YRKEPENS.BT (BER_SØ_IND) = W_BT2;                        00007150
                                                                        00007160
   UF_IND = 1;                                                          00007170
                                                                        00007180
   DO J = 2 TO 7;         /*0697 HL*/                                   00007190
     IF (B02.UFT_ÅM(BER_SØ_IND,J) = 0 & B02.UFT_ÅM(BER_SØ_IND,J-1)      00007200
                                                            > 0) THEN   00007210
                                                                        00007220
 /* FINN INDEKSEN TIL 'UF_IND' FOR SISTE UFØRHIST-SEGMENT.            */00007230
                                                                        00007240
        UF_IND = J - 1;                                                 00007250
   END;                                                                 00007260
                                                                        00007270
 /*DET ER IKKE LAGT INN BEREGNING AV ÅFT FOR YRKESSKADE : */            00007280
                                                                        00007290
    IF (B02.UFT_ÅM(BER_SØ_IND,UF_IND) < 7307 &                          00007300
        B02.PENSJONSTYPE1(BER_SØ_IND) = 'U'  ) THEN                     00007310
                                                                        00007320
       CALL ÅFT_TILLEGG((B02.UFØRPENS.ÅFT(BER_SØ_IND)),                 00007330
                         ÅFT_MAX,                                       00007340
                         UF_IND                                         00007350
                       );                                               00007360
                                                                        00007370
    ELSE                                                                00007380
       DO;                                                              00007390
          ÅFT_MAX = 0;                                                  00007400
          B02.UFØRPENS.ÅFT(BER_SØ_IND) = 0; /* 7.6.84 HL. */            00007410
       END;                                                             00007420
                                                                        00007430
 /* ************************************************************** */   00007440
 /* ET OG ST BARE FOR UFG >= 50 %                                  */   00007450
 /* ************************************************************** */   00007460
                                                                        00007470
           B02.UFØRPENS.ET(BER_SØ_IND) = 0;                             00007480
                                                                        00007490
           IF (B02.UFØRPENS.UFG(BER_SØ_IND) >= 50)  !                   00007500
              (B02.VIRK_DATO_ÅM(BER_SØ_IND) > 9704  &      /*9705 HL*/  00007510
               (B02.UFØRHIST.UFG(BER_SØ_IND,1) > 49 !                   00007520
               B02.PENSJONSTYPE1(BER_SØ_IND) = 'U'))  THEN              00007530
              DO;                                                       00007540
                                                                        00007550
                IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'F' THEN             00007560
                   DO;                                                  00007570
  /*LOVENDRING OM BEHOVSPRØVET FORSØRGINGSTILLEGG FRA 1.5.91 :*/        00007580
  /* SÅ SNART DET SKAL BEREGNES MED HØYERE GRUNNBELØP ENN     */        00007590
  /* PR 30.4.91, SÅ SKAL ALL BEREGNING SKJE I R0014011        */        00007600
                                                                        00007610
                     IF G > 34100 THEN                                  00007620
                        DO;                                             00007630
                           B02.UFØRPENS.ET(BER_SØ_IND) = 0;             00007640
  /*HL*/                IF B02.FT_SKAL_BEREGNES(BER_SØ_IND) ^= 'J'  THEN00007650
                            B02.FT_SKAL_BEREGNES(BER_SØ_IND) = 'N';     00007660
                        END;                                            00007670
                      ELSE                                              00007680
                         B02.UFØRPENS.ET(BER_SØ_IND) =                  00007690
                            0.5 * G * B02.TT_ANV(BER_SØ_IND) *          00007700
                            B02.UFØRPENS.UFG(BER_SØ_IND) /              00007710
                            (12 * 40 * 100) + 0.5;                      00007720
                                                                        00007730
                      IF (ALDER_EK       >= 6000 &                      00007740
                          W_DATO_ÅM      >  8903 &                      00007750
                          W_DATO_ÅM      <  9100)   !                   00007760
                         (ALDER_EK       >= 6001 &                      00007770
                          W_DATO_ÅM      >  9100)     THEN              00007780
                                                                        00007790
                         B02.UFØRPENS.ST(BER_SØ_IND)                    00007800
                                  = F_BEREGN_SÆRTILLEGG(                00007810
                                    (B02.UFØRPENS.TP(BER_SØ_IND)),      00007820
                                    ÅFT_MAX,                            00007830
                                    'J',                                00007840
                                    (ST_PROSENT_SAMST * 2),             00007850
                                    (B02.UFØRPENS.UFG(BER_SØ_IND)),     00007860
                                    (B02.TT_ANV(BER_SØ_IND)));          00007870
                      ELSE                                              00007880
                                                                        00007890
                          B02.UFØRPENS.ST(BER_SØ_IND)                   00007900
                                  = F_BEREGN_SÆRTILLEGG(                00007910
                                    (B02.UFØRPENS.TP(BER_SØ_IND)),      00007920
                                     ÅFT_MAX,                           00007930
                                     'J',                               00007940
                                    (ST_PROSENT_ENSLIG),                00007950
                                    (B02.UFØRPENS.UFG(BER_SØ_IND)),     00007960
                                    (B02.TT_ANV(BER_SØ_IND)));          00007970
                                                                        00007980
                      /* TILLEGGSTEST 21.03.94. REGELENDR 0194 */       00007990
                      /* BLE TIDL. TAKLET I 4010. TRUDE        */       00008000
                      /* FJERNES 240594           TRUDE        */       00008010
                                                                        00008020
                      /* NB! PGM ER LAGT OVER MED KOMMENTAR PÅ */       00008030
                      /* NEDENST. TEST. TRUDE 030694           */       00008040
                      IF  ALDER_EK       >= 6001 &                      00008050
                          W_DATO_ÅM      >  9400 THEN                   00008060
                                                                        00008070
                         B02.UFØRPENS.ST(BER_SØ_IND)                    00008080
                                  = F_BEREGN_SÆRTILLEGG(                00008090
                                    (B02.UFØRPENS.TP(BER_SØ_IND)),      00008100
                                     ÅFT_MAX,                           00008110
                                     'J',                               00008120
                                    (ST_PROSENT_ENSLIG * 2),            00008130
                                    (B02.UFØRPENS.UFG(BER_SØ_IND)),     00008140
                                    (B02.TT_ANV(BER_SØ_IND)));          00008150
                                                                        00008160
                   END;                                                 00008170
                ELSE                                                    00008180
                                                                        00008190
                   IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'S'      THEN     00008200
                                                                        00008210
                      B02.UFØRPENS.ST(BER_SØ_IND)                       00008220
                                  = F_BEREGN_SÆRTILLEGG(                00008230
                                    (B02.UFØRPENS.TP(BER_SØ_IND)),      00008240
                                    ÅFT_MAX,'J',                        00008250
                                    (ST_PROSENT_SAMST),                 00008260
                                    (B02.UFØRPENS.UFG(BER_SØ_IND)),     00008270
                                    (B02.TT_ANV(BER_SØ_IND)));          00008280
                   ELSE                                                 00008290
                                                                        00008300
                       B02.UFØRPENS.ST(BER_SØ_IND)                      00008310
                                  = F_BEREGN_SÆRTILLEGG(                00008320
                                    (B02.UFØRPENS.TP(BER_SØ_IND)),      00008330
                                    ÅFT_MAX,'J',                        00008340
                                    (ST_PROSENT_ENSLIG),                00008350
                                    (B02.UFØRPENS.UFG(BER_SØ_IND)),     00008360
                                    (B02.TT_ANV(BER_SØ_IND)));          00008370
                                                                        00008380
              END;                                                      00008390
                                                                        00008400
                                                                        00008410
                                                                        00008420
 /* **************************************************************** */ 00008430
 /* PENSJON UTLAND. DERSOM TT-F67 > 0 OG TT-E66 < 3 ,KODE 19-3= 1(NY)*/ 00008440
 /* I ALLE ANDRE TILFELLE ,19-3 KODE= 0 , RETT TIL SÆRTILLEGG ETTER  */ 00008450
 /* SAMME TT SOM GRUNNPENSJON ER REGNET ETTER. TRUDE 01.03.90        */ 00008460
 /* **************************************************************** */ 00008470
                                                                        00008480
         IF B02.TT_FØR_1967(BER_SØ_IND)    > 0    &                     00008490
           ((B02.TT_ETTER_1966(BER_SØ_IND) + 11) / 12   < 3 ) THEN      00008500
            DO;                                                         00008510
               IF  B02.FRAVIK_19_3  (BER_SØ_IND)  = '1'  THEN           00008520
                   B02.UFØRPENS.ST(BER_SØ_IND)    = 0;                  00008530
            END;                                    /* TIL HIT TRUDE */ 00008540
                                                                        00008550
                                                                        00008560
   IF (KAP11_UTLØST = 'J'     &                                         00008570
       U_FNR = B02.FNR(BER_SØ_IND)) THEN                                00008580
      DO;                                                               00008590
          ÅFT_MAX                       = 0;                            00008600
          B02.UFØRPENS.ÅFT(BER_SØ_IND)  = 0;                            00008610
      END;                                                              00008620
                                                                        00008630
   IF (B02.PENSJONSTYPE2(BER_SØ_IND) = 'A')    !      /*DAGPENGER*/     00008640
      (B02.PENSJONSTYPE3(BER_SØ_IND) = 'A')      THEN                   00008650
      B02.UFØRPENS.ST(BER_SØ_IND) = 0;                                  00008660
                                                                        00008670
                                                                        00008680
  /* ************************************************************* */   00008690
  /* HVIS TILLEGGSPENSJONEN ER BEREGNET UT FRA PAÅ, SÅ VIL DET     */   00008700
  /* KUNNE BLI REGNET SÆRTILLEGG.  DET MÅ DERFOR TESTES PÅ OM      */   00008710
  /* BÅDE UP-TP OG YP-TP SAMLET OVERSTIGER SÆRTILLEGGET.           */   00008720
  /* TESTEN PÅ OM UP-TP ER STØRRE ENN ST. GJØRES ANNET STED.       */   00008730
  /* ERIK.                                                         */   00008740
  /* ************************************************************* */   00008750
                                                                        00008760
                                                                        00008770
             IF B02.PENSJONSTYPE1(BER_SØ_IND) = 'Y'   THEN              00008780
                DO;                                                     00008790
                   B02.UFØRPENS.ST(BER_SØ_IND) =                        00008800
                   B02.UFØRPENS.ST(BER_SØ_IND) -                        00008810
                               B02.YRKEPENS.TP(BER_SØ_IND);             00008820
                   IF B02.UFØRPENS.ST(BER_SØ_IND) < 0 THEN              00008830
                      B02.UFØRPENS.ST(BER_SØ_IND) = 0;                  00008840
                END;                                                    00008850
                                                                        00008860
                                                                        00008870
        IF B02.UFØRPENS.UFG(BER_SØ_IND) < 50 THEN                       00008880
           B02.UFØRPENS.KT(BER_SØ_IND) = 0;                             00008890
        ELSE                                                            00008900
                                                                        00008910
                                                                        00008920
      B02.UFØRPENS.KT(BER_SØ_IND) = F_BEREGN_KOMPENSASJONSTILLEGG(      00008930
                                    B02.PENSJONSTYPE1(BER_SØ_IND),      00008940
                                    B02.PENSJONSTYPE2(BER_SØ_IND),      00008950
                                    B02.TT_ANV(BER_SØ_IND),0,1,'J');    00008960
                                                                        00008970
 /*KOMP.TILLEGGET ENDRET FRA 1.5.91 ( G > 34100 ) */                    00008980
                                                                        00008990
  IF G > 34100 THEN                                                     00009000
     IF B02.UFØRPENS.KT(BER_SØ_IND) > B02.UFØRPENS.ST(BER_SØ_IND) THEN  00009010
        B02.UFØRPENS.KT(BER_SØ_IND) =                                   00009020
        B02.UFØRPENS.KT(BER_SØ_IND) - B02.UFØRPENS.ST(BER_SØ_IND);      00009030
     ELSE                                                               00009040
        B02.UFØRPENS.KT(BER_SØ_IND) = 0;                                00009050
                                                                        00009060
   B02.SUM_YTELSE(BER_SØ_IND) = B02.UFØRPENS.GP(BER_SØ_IND)    +        00009070
                                  B02.UFØRPENS.ST(BER_SØ_IND)  +        00009080
                                  B02.UFØRPENS.BT(BER_SØ_IND)  +        00009090
                                  B02.UFØRPENS.KT(BER_SØ_IND)  +        00009100
                                  B02.UFØRPENS.ET(BER_SØ_IND)  +        00009110
                                  B02.UFØRPENS.TP(BER_SØ_IND)  +        00009120
                                  B02.UFØRPENS.ÅFT(BER_SØ_IND) +        00009130
                                  B02.YRKEPENS.GP(BER_SØ_IND)  +        00009140
                                  B02.YRKEPENS.BT(BER_SØ_IND)  +        00009150
                                  B02.YRKEPENS.TP(BER_SØ_IND)  ;        00009160
   DCL W_SUM FIXED DEC (7) INIT (0);                                    00009170
   W_SUM  =     B02.SUM_YTELSE(BER_SØ_IND);                             00009180
   IF B02.GARANTI_TP(BER_SØ_IND) > 0 THEN                               00009190
     DO;                                                     /*9304TS*/ 00009200
        IF B02.GARANTI_DATO_ÅM(BER_SØ_IND)  > 9301 THEN      /*9304TS*/ 00009210
          DO;                                                           00009220
                                                                        00009230
            IF G > 35500     THEN                            /*9304TS*/ 00009240
              DO;                                                       00009250
               B02.VIRK_DATO_ÅM(BER_SØ_IND)  =                          00009260
                           B02.GARANTI_DATO_ÅM(BER_SØ_IND);  /*9304TS*/ 00009270
               GARANTITILLEGG = B02.GARANTI_TP(BER_SØ_IND) -            00009280
                                 (B02.UFØRPENS.TP(BER_SØ_IND)  +        00009290
                                  B02.UFØRPENS.ST(BER_SØ_IND)  +        00009300
                                  B02.YRKEPENS.TP(BER_SØ_IND)) ;        00009310
              END;                                                      00009320
          END;                                                          00009330
        ELSE                                                 /*9304TS*/ 00009340
          DO;                                                /*9304TS*/ 00009350
        IF (G > 34100)                       !                          00009360
           ((G = 34100) & (TRANSTYPE ^= 27))      THEN                  00009370
   /* DO */                                                             00009380
         GARANTITILLEGG = B02.GARANTI_TP(BER_SØ_IND) -                  00009390
                                 (B02.UFØRPENS.TP(BER_SØ_IND)  +        00009400
                                  B02.UFØRPENS.ST(BER_SØ_IND)  +        00009410
                                  B02.YRKEPENS.TP(BER_SØ_IND)) ;        00009420
          END;                                                          00009430
                                                                        00009440
         IF GARANTITILLEGG > 0 THEN                                     00009450
            DO;                                                         00009460
               B02.SUM_YTELSE(BER_SØ_IND) = B02.SUM_YTELSE(BER_SØ_IND)  00009470
                                         + GARANTITILLEGG;              00009480
               DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND) =            00009490
                                           GARANTITILLEGG;              00009500
            END;                                                        00009510
     END;                                                               00009520
   W_SUM  =     B02.SUM_YTELSE(BER_SØ_IND);                             00009530
                                                                        00009540
   DCL B1_LOV92  FIXED DEC (7) INIT (0);                                00009550
   DCL B2_LOV92  FIXED DEC (7) INIT (0);                                00009560
   B1_LOV92 =   B01.GT_LOV92(BER_SØ_IND);                               00009570
   B2_LOV92 =   B02.GT_LOV92(BER_SØ_IND);                               00009580
   /*TRUDE,170292:   */                                                 00009590
                                                                        00009600
   IF B01.GT_LOV92(BER_SØ_IND) > 0      &      /*TRUDE,170292:   */     00009610
      B02.GT_LOV92(BER_SØ_IND) = 0            THEN                      00009620
       DO;                                                              00009630
        B02.UFØRPENS.SPT_1291(BER_SØ_IND) =                             00009640
                                     B01.UFØRPENS.SPT_1291(BER_SØ_IND); 00009650
        B02.UFØRPENS.OPT_1291(BER_SØ_IND) =                             00009660
                                     B01.UFØRPENS.OPT_1291(BER_SØ_IND); 00009670
        B02.UFØRPENS.PÅ_1291(BER_SØ_IND) =                              00009680
                                     B01.UFØRPENS.PÅ_1291(BER_SØ_IND);  00009690
        B02.GT_LOV92(BER_SØ_IND)  =  B01.GT_LOV92(BER_SØ_IND);          00009700
       END;                                                             00009710
                                                                        00009720
   /*TRUDE TIL HIT 170292 */                                            00009730
                                                                        00009740
                                                                        00009750
 /* LOVENDRING FRA 1.1.92 - HL : */                                     00009760
                                                                        00009770
   IF B02.GT_LOV92(BER_SØ_IND) > 0            THEN                      00009780
      DO;               /*9804 : */                                     00009790
         ALTERNATIV_SAVE = DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP;           00009800
                                                                        00009810
         B02.GT_LOV92(BER_SØ_IND) =                                     00009820
            F_TILLEGGSPENSJON                                           00009830
               ( FNR_R.ÅR,                                              00009840
                 35500,                                                 00009850
                (B02.UFØRPENS.SPT_1291(BER_SØ_IND)),                    00009860
                (B02.UFØRPENS.OPT_1291(BER_SØ_IND)),                    00009870
                (B02.UFØRPENS.PÅ_1291(BER_SØ_IND)),                     00009880
                (UFGRAD),                                               00009890
                 100,                                                   00009900
                 'J'                                                    00009910
               );                                                       00009920
                                                                        00009930
         IF B02.YRKE_POENG_1291(BER_SØ_IND) > 0 THEN                    00009940
            DO;                                                         00009950
               B02.GT_LOV92(BER_SØ_IND) =                               00009960
                        B02.GT_LOV92(BER_SØ_IND) +                      00009970
                                                                        00009980
                        F_TILLEGGSPENSJON((FNR_R.ÅR),G,                 00009990
                        (B02.YRKE_POENG_1291(BER_SØ_IND)),0,40,         00010000
                        (B02.YRKEPENS.YUG(BER_SØ_IND)),                 00010010
                        100,'J');                                       00010020
                                                                        00010030
 /*F_TILLEGGSPENSJON LEGGER VERDI INN I ATTFØRING_TP  - TIL BRUK  */    00010040
 /* FOR BEREGNING AV DAGPENGER.  DETTE SKAL BARE GJØRES NÅR VANLIG*/    00010050
 /* TP SKAL OPPDATERES - ALTSÅ IKKE HER :                         */    00010060
                                /*9804 */                               00010070
               DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = 0;                   00010080
                                                                        00010090
               REDUKSJONSBELØP =  B02.UFØRPENS.TP(BER_SØ_IND) +         00010100
                                  B02.UFØRPENS.ST(BER_SØ_IND) +         00010110
                                  B02.YRKEPENS.TP(BER_SØ_IND);          00010120
            END;                                                        00010130
         ELSE                                                           00010140
                                                                        00010150
             REDUKSJONSBELØP =  B02.UFØRPENS.TP(BER_SØ_IND) +           00010160
                                  B02.UFØRPENS.ST(BER_SØ_IND);          00010170
                                                                        00010180
         IF B02.GT_LOV92(BER_SØ_IND) > REDUKSJONSBELØP      THEN        00010190
         DO;                                                            00010200
             B02.GT_TILLEGG_LOV92(BER_SØ_IND) = B02.GT_LOV92(BER_SØ_IND)00010210
                                                - REDUKSJONSBELØP;      00010220
             IF B02.GARANTI_TP(BER_SØ_IND) > REDUKSJONSBELØP  THEN      00010230
                IF B02.GARANTI_TP(BER_SØ_IND) <                         00010240
                             B02.GT_LOV92(BER_SØ_IND)  THEN             00010250
                B02.SUM_YTELSE(BER_SØ_IND) = B02.SUM_YTELSE(BER_SØ_IND) 00010260
                + REDUKSJONSBELØP - B02.GARANTI_TP(BER_SØ_IND)          00010270
                                + B02.GT_TILLEGG_LOV92(BER_SØ_IND);     00010280
                ELSE;                                                   00010290
             ELSE                                                       00010300
             B02.SUM_YTELSE(BER_SØ_IND) = B02.SUM_YTELSE(BER_SØ_IND)    00010310
                                + B02.GT_TILLEGG_LOV92(BER_SØ_IND);     00010320
         END;                                                           00010330
         ELSE                                                           00010340
            DO;                                                         00010350
               B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                    00010360
                                                                        00010370
 /*VI KAN NULLSTILLE DERSOM VI IKKE TRENGER GT_LOV92 TIL      */        00010380
 /*BEREGNING AV GARANTI TIL FORSØRGINGSTILLEGG :              */        00010390
               IF B02.FT_SKAL_BEREGNES(BER_SØ_IND) = ' '  THEN          00010400
                  DO;                                                   00010410
                     B02.GT_LOV92(BER_SØ_IND)         = 0;              00010420
                     B02.UFØRPENS.SPT_1291(BER_SØ_IND) = 0;             00010430
                     B02.UFØRPENS.OPT_1291(BER_SØ_IND) = 0;             00010440
                     B02.UFØRPENS.PÅ_1291(BER_SØ_IND) = 0;              00010450
                  END;                                                  00010460
            END;          /*9804*/                                      00010470
         DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = ALTERNATIV_SAVE;           00010480
      END;                                                              00010490
                                                                        00010500
        /*-----------------------------------------------------*/       00010510
        /*VI KAN NULLSTILLE GARANTI_TP DERSOM TP> GARANTI_TP   */       00010520
        /*TRUDE, 280992                                        */       00010530
 /* FORELØPIG KOMMENTERES UT. IKKE FERDIG TESTET. TRUDE       */        00010540
        /*-----------------------------------------------------*/       00010550
                                                                        00010560
   /*  IF  (B02.UFØRPENS.TP(BER_SØ_IND)     >                           00010570
            B02.GARANTI_TP(BER_SØ_IND))        THEN                     00010580
          DO;                                                           00010590
           IF B02.PENSJONSTYPE2(BER_SØ_IND) ^= 'F'  &                   00010600
              B02.ANTALL_BARN(BER_SØ_IND)    = 0  THEN                  00010610
                  B02.GARANTI_TP(BER_SØ_IND)     = 0;                   00010620
          END;                                                          00010630
   NB!   */                                                             00010640
   W_SUM  =     B02.SUM_YTELSE(BER_SØ_IND);                             00010650
                                                                        00010660
 /*YS***********************************/                               00010670
 /*YS  TRUDE KAP_11_7 UTLØSNINSGBELØP  */                               00010680
 /*YS***********************************/                               00010690
                                                                        00010700
  IF (KAP11_UTLØST     = 'J'   &                                        00010710
      U_FNR = B02.FNR(BER_SØ_IND) )  THEN                               00010720
    DO;                                                                 00010730
     IF  ( B02.YRKEPENS.YUG(BER_SØ_IND)  >14    )    &                  00010740
         ( B02.YRKEPENS.YUG(BER_SØ_IND)  <   20 )    THEN               00010750
 /*ENGANGSBELOEP FLYTTET FRA B02 TIL DIV-PARAM  J.D 10.90*/             00010760
   DIV_PARAM_OMR.ENGANGSBELØP_11_7(BER_SØ_IND) =                        00010770
                           (B02.SUM_YTELSE(BER_SØ_IND) * 3 * 12);       00010780
                                                                        00010790
       IF (B02.YRKEPENS.YUG(BER_SØ_IND)   >   19 )     &                00010800
          (B02.YRKEPENS.YUG(BER_SØ_IND)   <   25 )     THEN             00010810
                                                                        00010820
   DIV_PARAM_OMR.ENGANGSBELØP_11_7(BER_SØ_IND) =                        00010830
                           (B02.SUM_YTELSE(BER_SØ_IND) * 6 * 12);       00010840
                                                                        00010850
                                                                        00010860
       IF (B02.YRKEPENS.YUG(BER_SØ_IND)   >   24 )     &                00010870
          (B02.YRKEPENS.YUG(BER_SØ_IND)   <   30 )     THEN             00010880
                                                                        00010890
   DIV_PARAM_OMR.ENGANGSBELØP_11_7(BER_SØ_IND) =                        00010900
                           (B02.SUM_YTELSE(BER_SØ_IND) * 9 * 12);       00010910
                                                                        00010920
    DCL BELØP_11_7   PIC '99999999';                                    00010930
    BELØP_11_7   = DIV_PARAM_OMR.ENGANGSBELØP_11_7(BER_SØ_IND);         00010940
                                                                        00010950
 /*YS  NB! UTLØSNINGSBELØPET SKAL IKKE OVERSTIGE KAPITALVERDIEN */      00010960
 /*YS  AV PENSJONEN REGNET FRAM TIL FYLTE 67 ÅR, ELLER TIL FYLTE*/      00010970
 /*YS  70 ÅR DERSOM SKADETILFELLET INTRAFF FØR 1973             */      00010980
                                                                        00010990
    DCL KAPITALISERINGSBELØP  PIC'(7)9'INIT(0);                         00011000
                                                                        00011010
          KAPITALISERINGSBELØP =                                        00011020
             F_KAPFAKT( W_FNR,                                          00011030
                       (B02.SUM_YTELSE(BER_SØ_IND)),                    00011040
                       (W_DATO_MÅ),                                     00011050
                       (B02.YRKEPENS.YUG(BER_SØ_IND))                   00011060
                      );                                                00011070
          IF KAPITALISERINGSBELØP >  0 THEN                             00011080
            DO;                                                         00011090
  DIV_PARAM_OMR.ENGANGSBELØP_11_7(BER_SØ_IND)  = KAPITALISERINGSBELØP;  00011100
            END;  /* NB!DERSOM BEGGE BELØP SKAL OPPGIS PÅ SB !!!  */    00011110
                                                                        00011120
                                                                        00011130
       B02.SUM_YTELSE(BER_SØ_IND)  = 0;                                 00011140
       B02.YRKEPENS(BER_SØ_IND) = '';                                   00011150
 /*YS        B02.YRKEHIST.OPPH_KODE(BER_SØ_IND,M)    =  'J'  */         00011160
                                                                        00011170
                                                                        00011180
       IF ( B01.PENSJONSTYPE1(BER_SØ_IND)    = ' ' &                    00011190
          B01.STATUS_KODE_HIST(BER_SØ_IND)   = ' ' )  !                 00011200
          ( B01.PENSJONSTYPE1(BER_SØ_IND)   ^= ' ' &                    00011210
          B01.STATUS_KODE_HIST(BER_SØ_IND)   = 'X') THEN                00011220
           DO;                                                          00011230
            B02.STATUS_KODE_HIST(BER_SØ_IND) = 'X';                     00011240
           END;                                                         00011250
    END;                                                                00011260
                                                                        00011270
   IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A'    &                          00011280
      ALTERNATIV_ER_OPPDATERT ^= 'J'      THEN                          00011290
      DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP =           /*9804*/            00011300
      DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP + YRKE_ÅRSTP;                   00011310
 /* ================================================================= */00011320
 HENT_FRA_UP: PROC;                                                     00011330
     %INCLUDE P0010601;                                                 00011340
     U_FNR         = UPS.FNR;                                           00011350
     KAP11_UTLØST  = UPY.KAP_11_7_UTLØST;                               00011360
     U_UFT_MÅ      = UPS.UFT_MÅ;                                        00011370
     W_BOSATT        = UPS.NORSK_BOSATT;       /* 200392 TRUDE*/        00011380
 END HENT_FRA_UP;                                                       00011390
 /* ================================================================= */00011400
 HENT_FRA_U2: PROC;                                                     00011410
    %INCLUDE P001N601;                                                  00011420
    U_FNR               = U2S.FNR;                                      00011430
    U_UFT_MÅ            = U2S.UFT_MÅ;                                   00011440
    IF F_KJØNN(U2S.FNR) = 'M' THEN     /*R0019902 TRUDE 0892*/          00011450
       INDEX            = 2;                                            00011460
    ELSE                                                                00011470
       INDEX            = 1;                                            00011480
    TT_KONVENSJON       = U2SP.TT_KONVENSJON_ÅR;                        00011490
    KAP11_UTLØST        = U2Y.KAP_11_7_UTLØST;                          00011500
    W_BOSATT            = U2S.NORSK_BOSATT;       /* 200392 TRUDE*/     00011510
 END HENT_FRA_U2;                                                       00011520
 /* ================================================================= */00011530
 HENT_FRA_U3: PROC;                                                     00011540
    %INCLUDE P001U601;                                                  00011550
    U_FNR             = U3S.FNR;                                        00011560
      U_UFT_MÅ          = U3S.UFT_MÅ;                                   00011570
      IF F_KJØNN(U3S.FNR) = 'M' THEN                                    00011580
         INDEX         = 2;                                             00011590
      ELSE                                                              00011600
         INDEX         = 1;                                             00011610
                                                                        00011620
      TT_KONVENSJON     = U3SP.TT_KONVENSJON_ÅR;                        00011630
      KAP11_UTLØST      = U3Y.KAP_11_7_UTLØST;                          00011640
 /*   W_INNTEKT_FØR     = U3S.INNTEKT_FØR_UP;      NY 0994*/            00011650
                                                                        00011660
 /*DET TESTES PÅ W_BOSATT I 4421, MEN DENNE TESTEN KAN IKKE BRUKES*/    00011670
 /*FOR U3-REGISTRERING.  DERFOR SETTES W_BOSATT = 'J' HER  :      */    00011680
                                                                        00011690
      W_BOSATT          = 'J';                                          00011700
                                                                        00011710
   END HENT_FRA_U3;                                                     00011720
 %PAGE;                                                                 00011730
        %INCLUDE R0014133;      /* F_BEREGN_SÆRTILLEGG           */     00011740
        %INCLUDE R0014134;      /* F_BEREGN_KOMPTILLEGG          */     00011750
        %INCLUDE R0014142;      /* F_TILLEGGSPENSJON             */     00011760
        %INCLUDE R0014143;      /* POENG_TILLEGG                 */     00011770
        %INCLUDE R0014148;      /* F_TP92                        */     00011780
        %INCLUDE R0014153;      /* BEREGN_SPT_OPT_PÅ             */     00011790
        %INCLUDE R0014233;      /* BEREGN_BT FELLES FOR AP UP    */     00011800
        %INCLUDE R0014421;      /* BEREGN_GP_UP                  */     00011810
        %INCLUDE R0014482;      /* BEREGN_GP_UP_UTLAND.          */     00011820
        %INCLUDE R0014422;      /* BEREGN_TP_UP                  */     00011830
        %INCLUDE R0014423;      /* OPPDATER_GAMMEL_UFØRHISTORIKK */     00011840
        %INCLUDE R0014424;      /* BEREGN_POENG_AV_AÅI           */     00011850
        %INCLUDE R0014425;      /* BEREGN_TP_YP                  */     00011860
        %INCLUDE R0014426;      /* KAPITALISERING AV SMÅ-        */     00011870
   /*   %INCLUDE R0014430;      BEREGN_INNTEKT_FØR_UP         */        00011880
        %INCLUDE R0014431;      /* ÅFT_TILLEGG                   */     00011890
        %INCLUDE R0019913;      /* F_SNU_DATO                    */     00011900
        %INCLUDE R0019905;      /* F_ALDER                       */     00011910
                                /* PENSJONER KAP 11-7.TRUDE      */     00011920
        %INCLUDE R0019902;      /* F_KJØNN,BLIR BRUKT I R001KAPT */     00011930
                                                                        00011940
  L999:                                                                 00011950
                                                                        00011960
  END R001440;                                                          00011970
