 /*       SIST ENDRET 28/07-98 12.50.06 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/07-98 12.26.59 AV   JDA7339                  */00000010
 /*       SIST ENDRET 12/06-98 13.34.07 AV   SPA7339                  */00000020
 /*       SIST ENDRET 25/05-98 12.37.57 AV   SPA7339                  */00000030
 /*       SIST ENDRET 30/03-98 12.55.59 AV   JDA7339                  */00000040
 /*       SIST ENDRET 16/03-98 14.39.47 AV   JDA7339                  */00000050
 /*       SIST ENDRET 05/12-97 12.19.37 AV   JDA7339                  */00000060
 /*       SIST ENDRET 27/11-97 10.43.54 AV   JDA7339                  */00000070
 /*       SIST ENDRET 24/10-97 11.56.13 AV   JDA7339                  */00000080
 /*       SIST ENDRET 24/09-97 08.04.40 AV   HLA7339                  */00000090
 /*       SIST ENDRET 29/08-97 12.03.10 AV   JDA7339                  */00000100
 /*       SIST ENDRET 28/08-97 08.52.26 AV   SPA7339                  */00000110
 /*       SIST ENDRET 16/07-97 14.08.13 AV   HLA7339                  */00000120
 /*       SIST ENDRET 16/05-97 10.49.27 AV   JDA7339                  */00000130
 /*       SIST ENDRET 28/04-97 11.12.07 AV   TSB7339                  */00000140
 /*       SIST ENDRET 19/03-97 10.43.34 AV   JDA7339                  */00000150
 /*       SIST ENDRET 16/08-96 12.47.13 AV   HLB0310                  */00000160
 /*       SIST ENDRET 15/07-96 08.00.29 AV   HLB0310                  */00000170
 /*       SIST ENDRET 03/04-96 10.44.11 AV   HLB0310                  */00000180
 /*       SIST ENDRET 05/03-96 09.21.04 AV   HLB0310                  */00000190
 /*       SIST ENDRET 13/02-96 11.17.51 AV   HLB0310                  */00000200
 /*       SIST ENDRET 13/11-95 12.31.59 AV   JDA0310                  */00000210
 /*       SIST ENDRET 26/06-95 13.57.05 AV   JDA0310                  */00000220
 /*       SIST ENDRET 04/05-95 09.52.21 AV   JDA0310                  */00000230
 /*       SIST ENDRET 30/11-94 08.36.53 AV   JDA0310                  */00000240
 /*       SIST ENDRET 17/11-94 12.05.55 AV   JDA0310                  */00000250
 /*       SIST ENDRET 06/10-94 14.12.50 AV   TSB0310                  */00000260
 /*       SIST ENDRET 11/08-94 13.09.51 AV   HERMAN                   */00000270
 /*       SIST ENDRET 12/07-94 14.05.34 AV   DYBVIK                   */00000280
 /*       SIST ENDRET 11/07-94 12.40.07 AV   DYBVIK                   */00000290
 /*       SIST ENDRET 08/06-94 14.04.36 AV   DYBVIK                   */00000300
 /*       SIST ENDRET 03/05-94 13.23.47 AV   DYBVIK                   */00000310
 /*       SIST ENDRET 07/04-94 14.39.14 AV   HERMAN                   */00000320
 /*       SIST ENDRET 25/02-94 12.24.47 AV   HERMAN                   */00000330
  /*IDENTIFIKASJON:                                                  */ 00000340
  /*    R001U621 - PROSEDYRE I PLI                                   */ 00000350
  /*    PROGRAMMERER: HERMAN          JULI 1993                      */ 00000360
  /*HENSIKT:                                                         */ 00000370
  /*    OPPRETTE PENSJONSSTATUS FOR SØKER FRA TRANSEN                */ 00000380
  /* *************************************************************** */ 00000390
  /*ENDRET:                                                          */ 00000400
  /*ENDRINGEN GJELDER:                                               */ 00000410
  /*ENDRET AV:                                                       */ 00000420
  /* *************************************************************** */ 00000430
  /* *************************************************************** */ 00000440
  /*PROGRAMTILKNYTNING:                                              */ 00000450
  /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV UFØREPENSJON  */ 00000460
  /*    INCLUDES I R001U620 NÅR STATUS_TYPE = A, C, I, K             */ 00000470
  /*BRUK:                                                            */ 00000480
  /*    CALL OPPRETT_B02_PENSJONSSTATUS_U3_SØKER                     */ 00000490
  /* *************************************************************** */ 00000500
  %SKIP(2);                                                             00000510
                                                                        00000520
  OPPRETT_STATUS_U3_SØKER:                                              00000530
    PROC;                                                               00000540
    DCL                                                                 00000550
                                                                        00000560
       ÅR_FØR_UFØRHET   PIC '99';                                       00000570
          DCL  YRK_IND  FIXED BIN(15);                                  00000580
          DCL  M        FIXED BIN(15);                                  00000590
                                                                        00000600
          DCL  VILKÅR_DEF CHAR(2);                                      00000610
          DCL  1 W_VILKÅR_1_2_2AB DEFINED VILKÅR_DEF,                   00000620
                 3 W_VILKÅR_1_2_2A CHAR(1),                             00000630
                 3 W_VILKÅR_1_2_2B CHAR(1);                             00000640
                                                                        00000650
   DCL    HL_BEREGN_FOLKETRYGD     CHAR (1) INIT (' ');                 00000660
   DCL    ALDER_UF            FIXED DEC (5) INIT (0);      /*HL*/       00000670
   DCL    ALDER_VIRK          FIXED DEC (5) INIT (0);      /*JD*/       00000680
                                                                        00000690
      PROGRAM_ID = 'R001U621';                                          00000700
      FNR = U3S.FNR;                                                    00000710
      ALDER_UF = F_ALDER(U3S.FNR,U3S.UFT_MÅ);   /*HL*/                  00000720
      ALDER_VIRK = F_ALDER(U3S.FNR,U3S.VIRK_DATO_MÅ); /* JD */          00000730
                                                                        00000740
 /* ***************************************************************** */00000750
 /* NÅR STATUS_TYPE = A OG STATUS_KODE_HIST = O MÅ VI FØRST BLANKE    */00000760
 /* FELTENE SOM LIGGER I STATUS_SEGMENTENE.                           */00000770
 /* B01 ER FLYTTET OVER TIL B02 I R001U620.                           */00000780
 /* ***************************************************************** */00000790
      IF STATUS_TYPE_SØKER                = 'A' &                       00000800
         B01.STATUS_KODE_HIST (SØKER_IND) = 'O' THEN                    00000810
         DO;  /* TØMMER SEGMENTENE */                                   00000820
            B02.STATUS   (SØKER_IND)   = '';                            00000830
            B02.UFØRPENS (SØKER_IND)   = '';                            00000840
            B02.UFØRHIST (SØKER_IND,1) = '';                            00000850
            B02.UFØRHIST (SØKER_IND,2) = '';                            00000860
            B02.UFØRHIST (SØKER_IND,3) = '';                            00000870
            B02.UFØRHIST (SØKER_IND,4) = '';                            00000880
            B02.UFØRHIST (SØKER_IND,5) = '';                            00000890
            B02.UFØRHIST (SØKER_IND,6) = '';         /*0697 HL*/        00000900
            B02.UFØRHIST (SØKER_IND,7) = '';         /*0697 HL*/        00000910
            B02.YRKEPENS (SØKER_IND)   = '';                            00000920
            B02.YRKEHIST (SØKER_IND,1) = '';                            00000930
            B02.YRKEHIST (SØKER_IND,2) = '';                            00000940
            B02.YRKEHIST (SØKER_IND,3) = '';                            00000950
            B02.YRKEHIST (SØKER_IND,4) = '';                            00000960
            B02.YRKEHIST (SØKER_IND,5) = '';                            00000970
            B02.ETTEPENS (SØKER_IND)   = '';                            00000980
            B02.ETTEBARN (SØKER_IND)   = '';                            00000990
            B02.SPESOPPL (SØKER_IND)   = '';                            00001000
            B02.EØSINFO  (SØKER_IND)   = '';                            00001010
         END; /* TØMME SEGMENTENE */                                    00001020
                                                                        00001030
 /* ***************************************************************** */00001040
 /* STATUS_SEGMENTET                                                  */00001050
 /* ***************************************************************** */00001060
                                                                        00001070
        IF HJ_VIRK_DATO_ÅM < 9802                   THEN                00001080
           B02.PENSJON_FØR_9802(SØKER_IND) = 'J';     /*9811 HL*/       00001090
                                                                        00001100
        B02.EK_INNT_OVER_2G(SØKER_IND) = U3S.EK_INNT_OVER_2G;           00001110
                                                                        00001120
        IF U3S.TILL_EK = 'J' & HJ_VIRK_DATO_ÅM > 9104 THEN              00001130
           U3S.TILL_EK = ' ';    /*JD 07.91*/                           00001140
                                                                        00001150
  /*LAGT INN 12.7.96 HL :*/                                             00001160
        IF F_SNU_DATO(U3S.UFT_MÅ) < 9100  THEN                          00001170
           B02.PENSJONSRETT_FØR_91(SØKER_IND) = 'J';                    00001180
                                                                        00001190
        IF U3S.YSKADE_TILLEGG = 'J' THEN                                00001200
           B02.PENSJONSTYPE1(SØKER_IND) = 'Y';                          00001210
        ELSE                                                            00001220
           DO;  /* IKKE YRKESSKADE */                                   00001230
              B02.STATUS.PENSJONSTYPE1(SØKER_IND) = 'U';                00001240
              IF   (U3S.UFG < 50)     THEN    /* 9705 HL: */            00001250
                 DO;                                                    00001260
   L261:                                                                00001270
              /* ---------------------------------------------------- */00001280
              /* UGYLDIG UFØREGRAD ('050','055' ... '100').           */00001290
              /* ---------------------------------------------------- */00001300
                    FEIL_VED_LABEL = '261';                             00001310
                    FEIL_MELD_NR   =  38;                               00001320
                    GO TO RETUR;                                        00001330
                 END;                                                   00001340
           END; /* IKKE YRKESSKADE */                                   00001350
                                                                        00001360
                                                                        00001370
       IF U3S.TILL_EK = 'J' THEN                                        00001380
          B02.PENSJONSTYPE2(SØKER_IND) = 'F';                           00001390
       ELSE                                                             00001400
       IF U3S.ATT_UF = 'X'          THEN          /*DAGPENGER*/         00001410
          B02.PENSJONSTYPE2(SØKER_IND) = 'A';                           00001420
       ELSE                                                             00001430
          B02.PENSJONSTYPE2(SØKER_IND) = 'P';                           00001440
  DCL CHAR1 CHAR(1);                                                    00001450
  CHAR1 = B02.PENSJONSTYPE2(SØKER_IND);                                 00001460
                                                                        00001470
       IF U3S.TILL_EK = ' ' &                                           00001480
          B01.PENSJONSTYPE2(SØKER_IND) = 'F' &                          00001490
          U3S.UFG < 50   THEN                                           00001500
          DO;                                                           00001510
             B02.PENSJONSTYPE2(SØKER_IND) = 'P';                        00001520
             B02.PENSJONSTYPE1(EKTEF_IND) = 'G';                        00001530
             B02.PENSJONSTYPE2(EKTEF_IND) = ' ';                        00001540
          END;                                                          00001550
                                                                        00001560
       HJ_UFT_MÅ      = U3S.UFT_MÅ;                                     00001570
       ÅR_FØR_UFØRHET = HJ_UFT_Å - 1;                                   00001580
                                                                        00001590
       IF U3SP.STI_MÅ_3B > 0           THEN                             00001600
          HJ_MÅ = U3SP.STI_MÅ_3B;                                       00001610
 /*FJERNES I NY U3 :                                                    00001620
       ELSE                                                             00001630
       IF U3SP.STI_MÅ_3C > 0           THEN                             00001640
          HJ_MÅ = U3SP.STI_MÅ_3C;       HIT 9803 */                     00001650
       ELSE                                                             00001660
          HJ_MÅ = U3S.UFT_MÅ;                                           00001670
                                                                        00001680
       HJ_ÅM = F_SNU_DATO(HJ_MÅ);                                       00001690
       HJ_ÅM_FIX = HJ_ÅM;                                               00001700
                                                                        00001710
       B02.SIVILSTAND(SØKER_IND)           = U3S.SIVILSTAND;            00001720
       B02.NAVN      (SØKER_IND)           = U3S.NAVN;                  00001730
       B02.SPRÅK     (SØKER_IND)           = U3S.SPRÅK;                 00001740
       B02.TKNR      (SØKER_IND)           = U3S.TKNR;                  00001750
                                                                        00001760
       IF U3S.YRKE                       >   0 THEN                     00001770
          B02.YRKES_KODE(SØKER_IND)      = U3S.YRKE;                    00001780
                                                                        00001790
 /* ***************************************************************** */00001800
 /* VERNEPLIKTSOPPLYSNINGER                                           */00001810
 /* ***************************************************************** */00001820
                                                                        00001830
       DO I = 1 TO 4 WHILE (U3S.VP_ÅR(I) > 0);                          00001840
          B02.VERNEPLIKTÅR(SØKER_IND,I) = U3S.VP_ÅR(I);                 00001850
       END;                                                             00001860
                                                                        00001870
       B02.UFØRPENS.VILKÅR_8_4_3A(SØKER_IND) = U3S.VILKÅR_8_4_3A;       00001880
       B02.UFØRPENS.UFG          (SØKER_IND) = U3S.UFG;                 00001890
 /*KOMMER I FORB MED NY U3 : - 9803 */                                  00001900
       IF ALDER_UF  > 2600       THEN                                   00001910
          B02.UFØRPENS.GARANTERT_TP (SØKER_IND) = ' ';                  00001920
       ELSE                                                             00001930
       IF FNR_R_Å < 41           THEN                                   00001940
          U3S.GARANTERT_TP = ' ';                   /*9802*/            00001950
       ELSE                                                             00001960
       IF U3S.GARANTERT_TP = ' '      THEN                              00001970
  L262:                                                                 00001980
          DO;                                                           00001990
             FEIL_VED_LABEL = '262';                                    00002000
             FEIL_MELD_NR   = 1544;                                     00002010
             GO TO RETUR;                                               00002020
          END;                                                          00002030
       ELSE                                                             00002040
       B02.UFØRPENS.GARANTERT_TP (SØKER_IND) = U3S.GARANTERT_TP;        00002050
       IF U3S.FRYSP_3ÅR_ARB ^= ' '     !                                00002060
          U3S.FRYSP_TIDSB   ^= ' '         THEN                         00002070
  L266:                                                                 00002080
          DO;                                                           00002090
             FEIL_VED_LABEL = '266';                                    00002100
             FEIL_MELD_NR   = 1545;                                     00002110
             GO TO RETUR;                                               00002120
          END;                                                          00002130
    /*********** NY U3 HIT */                                           00002140
       B02.VIRK_DATO_ÅM          (SØKER_IND) = HJ_VIRK_DATO_ÅM;         00002150
                                                                        00002160
       B02.INNTEKT_FØR_UP        (SØKER_IND) = U3S.INNTEKT_FØR_UP / 100;00002170
       B02.INNT_DATO_ÅM          (SØKER_IND) = HJ_UFT_Å*100+HJ_UFT_M;   00002180
                                                                        00002190
       B02.UFØRPENS.UTDANNING    (SØKER_IND) = U3S.UTDANNING;           00002200
       B02.UFØRPENS.YRKESM_ATTF  (SØKER_IND) = U3S.YRKESM_ATTF;         00002210
       IF U3S.TIDSBEGR_ATTF = 'S'                 THEN                  00002220
          B02.TIDSBEGR_ATTF(SØKER_IND) = 'J';                           00002230
       IF U3S.SKJERM_ATTF = 'S'                 THEN                    00002240
          B02.SKJERM_ATTF(SØKER_IND) = 'J';                             00002250
                                                                        00002260
       B02.YNGSTE_BARN_FÅR       (SØKER_IND) = U3S.YNGSTE_BARN_FÅR;     00002270
                                                          /*EØS*/       00002280
  /*LAGT INN   11.97 JD :*/                                             00002290
        IF B02.VIRK_DATO_ÅM(SØKER_IND) > 9812 &                         00002300
           ALDER_VIRK < 1801  THEN                                      00002310
                 DO;                                                    00002320
   L263:                                                                00002330
              /* ---------------------------------------------------- */00002340
              /* NEDRE ALDERSGRENSE FOR UFØRPENS ER 18 ÅR             */00002350
              /* ---------------------------------------------------- */00002360
                    FEIL_VED_LABEL = '263';                             00002370
                    FEIL_MELD_NR   =  444;                              00002380
                    GO TO RETUR;                                        00002390
                 END;                                                   00002400
       IF STATUS_TYPE_SØKER = 'I' ! STATUS_TYPE_SØKER = 'K' THEN        00002410
                /* SØKER HAR UFØREHISTORIKK SOM ALLTID MÅ OVERFØRES */  00002420
                                                                        00002430
     DO;  /* STATUS_TYPE_SØKER = 'I' ! 'K' */                           00002440
                                                                        00002450
 /*YS---------------------------------------------------------------*/  00002460
 /*YS  OPPHØRSDATO OG KODE SETTES I UFØRHIST-SEGMENTET              */  00002470
 /*YS  DETTE ER BARE AKTUELT FOR TIDLIGER ENGANGSUTLØSNING . TRUDE  */  00002480
 /*YS---------------------------------------------------------------*/  00002490
                                                                        00002500
          DO I = 1 TO 7;                /*0697 HL*/                     00002510
             IF B01.UFØRHIST.UFT_ÅM(SØKER_IND,I)          > 0 &         00002520
                B01.UFØRHIST.OPPHØRSDATO_ÅM(SØKER_IND,I)   = 0 THEN     00002530
                DO;                                                     00002540
                   IF B01.UFØRHIST.UFT_ÅM(SØKER_IND,I)  =               00002550
                      (HJ_UFT_Å*100+HJ_UFT_M)           THEN            00002560
                         DO;                                            00002570
        L264:                                                           00002580
                             FEIL_VED_LABEL = '264';                    00002590
                             FEIL_MELD_NR   =  1609;                    00002600
                             GO TO RETUR;                               00002610
                         END;                                           00002620
                                                                        00002630
                   ELSE                                                 00002640
                   DO;                                                  00002650
                      B02.UFØRHIST.OPPHØRSDATO_ÅM(SØKER_IND,I)          00002660
         /*              = HJ_UFT_Å*100+HJ_UFT_M;     */                00002670
                         = OPPH_ÅR*100+OPPH_MN;     /*9807*/            00002680
                      B02.UFØRHIST.OPPHØRSKODE(SØKER_IND,I)    =  'J';  00002690
                      I                =   7 ;  /*0697 HL*/             00002700
                   END;                                                 00002710
                END;                                                    00002720
          END; /* DO I = 1 T0 7 */                                      00002730
                                                                        00002740
 /*YS---------------------------------------------------------------*/  00002750
 /*YS  OPPHØRSDATO OG KODE SETTES I YRKEHIST-SEGMENTET              */  00002760
 /*YS  DETTE ER BARE AKTUELT FOR TIDLIGER ENGANGSUTLØSNING . TRUDE  */  00002770
 /*YS---------------------------------------------------------------*/  00002780
                                                                        00002790
                                                                        00002800
          DO I = 1 TO 5;                                                00002810
             IF B01.YRKEHIST.YUFT_ÅM(SØKER_IND,I)          > 0 &        00002820
                B01.YRKEHIST.OPPH_DATO_ÅM(SØKER_IND,I)   = 0 THEN       00002830
                DO;                                                     00002840
                   B02.YRKEHIST.OPPH_DATO_ÅM(SØKER_IND,I)               00002850
      /*              = HJ_UFT_Å*100+HJ_UFT_M;       */                 00002860
                      = OPPH_ÅR*100+OPPH_MN;       /*9807*/             00002870
                   B02.YRKEHIST.OPPH_KODE(SØKER_IND,I)    =  'J';       00002880
                   I                                        =   5 ;     00002890
                END;                                                    00002900
          END;                                                          00002910
                                                                        00002920
          B02.FØRSTE_GANG_REG    (SØKER_IND) = 'N';                     00002930
     END; /* STATUS_TYPE_SØKER ) 'I' ! 'K' */                           00002940
       ELSE                                                             00002950
       IF B02.STATUS_KODE_HIST(SØKER_IND)  = 'X'   THEN /*0296 HL*/     00002960
          B02.FØRSTE_GANG_REG    (SØKER_IND) = 'N';                     00002970
       ELSE                                                             00002980
          B02.FØRSTE_GANG_REG    (SØKER_IND) = 'J';                     00002990
                                                                        00003000
       B02.STATUS_KODE_HIST (SØKER_IND) = ' ';                          00003010
                                                                        00003020
     DCL TEST_Å   PIC '99';                                             00003030
     DCL TEST_M   PIC '99';                                             00003040
     DCL TEST_16_66 PIC '99';                                           00003050
                                                                        00003060
  IF HJ_VIRK_DATO_ÅM > 9100 THEN                                        00003070
    DO;                                                                 00003080
     B02.TT_16_66(SØKER_IND) = (HJ_UFT_Å -(FNR_R_Å + 16)) * 12          00003090
                                + HJ_UFT_M - FNR_R_M;                   00003100
    END;                                                                00003110
  ELSE                                      /* TRUDE 0695*/             00003120
     DO;                                                                00003130
       B02.TT_FØR_1967  (SØKER_IND) = U3SP.TT_F67;                      00003140
       B02.TT_ETTER_1966(SØKER_IND) = U3SP.TT_E66_Å * 12 +              00003150
                                      U3SP.TT_E66_M;                    00003160
     END;                                                               00003170
                                                                        00003180
     IF B02.TT_16_66(SØKER_IND) > 480     THEN                          00003190
        B02.TT_16_66(SØKER_IND) = 480;      /*HL 080694*/               00003200
                                                                        00003210
                                                                        00003220
                                                                        00003230
        IF F_SNU_DATO(U3S.UFT_MÅ) > 9712  &                             00003240
           ALDER_UF < 1800                THEN                          00003250
                 DO;                                                    00003260
   L268:                                                                00003270
              /* ---------------------------------------------------- */00003280
              /* NEDRE ALDERSGRENSE FOR UFØRPENS ER 18 ÅR             */00003290
              /* ---------------------------------------------------- */00003300
                    FEIL_VED_LABEL = '268';                             00003310
                    FEIL_MELD_NR   =  444;                              00003320
                    GO TO RETUR;                                        00003330
                 END;                                                   00003340
        /* TIL HIT JD 11.97  */                                         00003350
 /*BLANKES FOR SIKKERHETS SKYLD :      */                               00003360
                                                                        00003370
 /* ***************************************************************** */00003380
 /* SPESIELLE OPPLYSNINGER                                            */00003390
 /* ***************************************************************** */00003400
  %SKIP;                                                                00003410
       IF U3S.NORSK_BOSATT = 'N'  THEN                                  00003420
         DO;  /* HAR BODD I UTLANDET */                                 00003430
            B02.TT_FØR_1967    (SØKER_IND)     = 0;                     00003440
            B02.TT_ETTER_1966  (SØKER_IND)     = 0;                     00003450
            B02.TT_16_66       (SØKER_IND)     = 0;                     00003460
            B02.TT_FRAMT       (SØKER_IND)     = 0;                     00003470
            IF U3SP.TT_FRA1937_ÅR    > 0       !                        00003480
               U3SP.TT_FRA1937_MND   > 0              THEN              00003490
               B02.TT_16_66(SØKER_IND) = U3SP.TT_FRA1937_ÅR * 12 +      00003500
                                    U3SP.TT_FRA1937_MND;                00003510
            ELSE                                                        00003520
               DO;                                                      00003530
                  B02.TT_FØR_1967  (SØKER_IND) = U3SP.TT_F67;           00003540
                  B02.TT_ETTER_1966(SØKER_IND) = U3SP.TT_E66_Å * 12 +   00003550
                                                 U3SP.TT_E66_M;         00003560
                  B02.TT_FØR_1967  (EKTEF_IND) = U3SP.TT_F67_EK;        00003570
                  IF U3SP.TT_E66_Å_EK > 0               THEN            00003580
                B02.TT_ETTER_1966(EKTEF_IND) = U3SP.TT_E66_Å_EK * 12 +  00003590
                                               U3SP.TT_E66_M_EK;        00003600
               END;                                                     00003610
                                                                        00003620
           IF U3SP.TT_KONVENSJON_ÅR > 0            THEN                 00003630
              B02.TT_16_66(SØKER_IND) = U3SP.TT_KONVENSJON_ÅR * 12;     00003640
                                                                        00003650
           IF B02.TT_16_66(SØKER_IND) > 480     THEN                    00003660
              B02.TT_16_66(SØKER_IND) = 480;                            00003670
                                                                        00003680
           /*STM ANG STI FLYTTET HIT.TRUDE 020595*/                     00003690
          IF U3SP.STI_MÅ_3B > 0          THEN                           00003700
             B02.UFØRPENS.STI(SØKER_IND) = F_SNU_DATO(U3SP.STI_MÅ_3B);  00003710
  /*FJERNES I NY U3 :                                                   00003720
          ELSE                                                          00003730
          IF U3SP.STI_MÅ_3C > 0          THEN                           00003740
             B02.UFØRPENS.STI(SØKER_IND) = F_SNU_DATO(U3SP.STI_MÅ_3C);  00003750
      HIT  9803 *** */                                                  00003760
                                                                        00003770
          /*-----------------------------------------------------*/     00003780
          /*FRAVIK FLYKTN GAV REDUSERT ANT_BUP_ÅR. TRUDE 091092--*/     00003790
          /*-----------------------------------------------------*/     00003800
          /*-----------------------------------------------------*/     00003810
          /*ALL FREMTIDIG TRYGDETID BLE BEREGNET ETTER NYE REGLER*/     00003820
          /*TRUDE 051094 ----------------------------------------*/     00003830
                                                                        00003840
          IF U3SP.FRAVIK_FLYKT       = 'J'     !                        00003850
           ( B02.TT_16_66(SØKER_IND) =  0  &         /* TRUDE 051094*/  00003860
             B02.UFØRPENS.STI(SØKER_IND) =  0 ) THEN  /* TRUDE 020595*/ 00003870
             IF B02.PENSJONSRETT_FØR_91(SØKER_IND) = 'J'     THEN       00003880
                B02.STATUS.TT_FRAMT(SØKER_IND) =                        00003890
                   (ALDER_67.ÅR * 12 + ALDER_67.MND)                    00003900
                    - (HJ_Å * 12 + HJ_M);                               00003910
             ELSE                                                       00003920
                B02.STATUS.TT_FRAMT(SØKER_IND) =                        00003930
                            (ALDER_67.ÅR * 12) - (HJ_Å * 12 + HJ_M);    00003940
          ELSE                                                          00003950
             B02.STATUS.TT_FRAMT(SØKER_IND) = F_BEREGN_TT_FRAMT_UTLAND  00003960
                    ((B02.FNR(SØKER_IND)),HJ_ÅM_FIX,SØKER_IND);         00003970
                                                                        00003980
          B02.SPESOPPL.STATSBORGER(SØKER_IND)   = U3SP.STATSBORGER;     00003990
          B02.SPESOPPL.BOSATT(SØKER_IND)        = U3SP.BOSATT;          00004000
       B02.SPESOPPL.PENSJONSTRYGDET(SØKER_IND) = U3SP.PENSJONSTRYGDET;  00004010
          B02.SPESOPPL.MINST_20ÅR_BOTID(SØKER_IND) = U3SP.MINST_20_ÅR;  00004020
          B02.SPESOPPL.FRAVIK_BOSATT_KONVENSJON(SØKER_IND) =            00004030
                                                     U3SP.KONVENSJON;   00004040
          B02.SPESOPPL.FRAVIK_FLYKTN(SØKER_IND) = U3SP.FRAVIK_FLYKT;    00004050
                                                                        00004060
          IF U3SP.OVERKOMP_UTL = 'J'      THEN                          00004070
             B02.SPESOPPL.OVERKOMP_UTL(SØKER_IND)  = 'J';               00004080
          ELSE                                                          00004090
             B02.SPESOPPL.OVERKOMP_UTL(SØKER_IND)  = 'N';               00004100
          B02.SPESOPPL.IKKE_GP      (SØKER_IND) = U3SP.IKKE_GP;         00004110
          B02.SPESOPPL.KONVENSJON(SØKER_IND) =  U3SP.BEREGNING_KONV;    00004120
                                                                        00004130
   /*NY U3-BLANKETT 9803 HL :                                           00004140
                                                                        00004150
          IF U3SP.FRAVIK_8_1_3B = 'J'   !                               00004160
             U3SP.FRAVIK_8_1_3C = 'J'           THEN    */              00004170
          IF U3SP.UNNTAK_12_2   = 'J'         THEN                      00004180
 /*          B02.SPESOPPL.FRAVIK_8_1_3(SØKER_IND)  =  'J'; */           00004190
             B02.SPESOPPL.UNNTAK_12_2 (SØKER_IND)  =  'J';              00004200
   /* NY U3             */                                              00004210
          B02.SPESOPPL.FRAVIK_8_1(SØKER_IND) = U3SP.FRAVIK_8_1;         00004220
          IF U3SP.TT_PÅ     = 'J'    !                                  00004230
             U3SP.TT_LIK_PÅ = 'J'    THEN                               00004240
             DO;                                                        00004250
                B02.SPESOPPL.TT_PÅ     (SØKER_IND) = 'J';               00004260
  /*            B02.TT_FØR_1967        (SØKER_IND) =  0 ;               00004270
                B02.TT_ETTER_1966      (SØKER_IND) =  0 ;               00004280
                B02.TT_FRAMT           (SØKER_IND) =  0 ;               00004290
                B02.TT_67_TIL_70       (SØKER_IND) =  0 ;               00004300
                B02.TT_16_66           (SØKER_IND) =  0 ;   */          00004310
             END;                                                       00004320
          B02.SPESOPPL.TT_FRAMTIDIG (SØKER_IND) = U3SP.TT_FRAMTIDIG;    00004330
          B02.SPESOPPL.TT_FAKTISK   (SØKER_IND) = U3SP.TT_FAKTISK;      00004340
  /*      B02.SPESOPPL.FRAVIK_5_1(SØKER_IND) = U3SP.FRAVIK_5_1; */      00004350
          B02.SPESOPPL.UNG_UFØR  (SØKER_IND) = U3SP.UNG_UFØR;           00004360
                                                                        00004370
 /* TILLEGG 0196 HL : */                                                00004380
                                                                        00004390
          B02.TT_NORDISK_FAKT_MND (SØKER_IND) =                         00004400
 ((U3SP.TT_FAKTISK_NORDISK_ÅR * 12) + U3SP.TT_FAKTISK_NORDISK_MND);     00004410
          B02.PÅ_NORDISK_FAKT    (SØKER_IND) = U3SP.PÅ_FAKTISK_NORDISK; 00004420
                                                                        00004430
          IF ( B02.TT_NORDISK_FAKT_MND(SØKER_IND) +                     00004440
               B02.PÅ_NORDISK_FAKT(SØKER_IND) > 0 ) THEN                00004450
             B02.NORDISK_KONVENSJON(SØKER_IND) = 'J';                   00004460
                                                                        00004470
  /*EØS : */                                                            00004480
          B02.KONVENSJON_LAND(SØKER_IND) = U3SP.KONVENSJON_LAND;        00004490
          B02.FRAVIK_BOSATT_EØS(SØKER_IND) = U3SP.FRAVIK_BOSATT_EØS;    00004500
          B02.TP_NORDISK       (SØKER_IND) = U3SP.TP_NORDISK;           00004510
          B02.TP_NORDISK_LAND  (SØKER_IND) = U3SP.TP_NORDISK_LAND;      00004520
          B02.TT_KONVENSJON_ÅR  (SØKER_IND) = U3SP.TT_KONVENSJON_ÅR;    00004530
  /*EØSINFO : */                                                        00004540
          IF (B02.PENSJONSTYPE2(SØKER_IND) = 'A') THEN                  00004550
             DO;                                                        00004560
                B02.BEREGN_FOLKETRYGD(SØKER_IND) = 'J';                 00004570
                B02.EØS_8_4_3A(SØKER_IND)        = U3S.VILKÅR_8_4_3A;   00004580
             END;                                                       00004590
          ELSE                                                          00004600
             DO;                                                        00004610
                B02.BEREGN_FOLKETRYGD(SØKER_IND) =                      00004620
                                 U3SP.BEREGN_FOLKETRYGD;                00004630
          HL_BEREGN_FOLKETRYGD=  U3SP.BEREGN_FOLKETRYGD;                00004640
                B02.EØS_8_4_3A     (SØKER_IND) = U3SP.EØS_8_4_3A;       00004650
             END;                                                       00004660
          B02.TT_PRO_RATA_MND(SØKER_IND) = U3SP.TT_PRORATA_EØS_MND      00004670
                 + (U3SP.TT_PRORATA_EØS_ÅR * 12);                       00004680
          B02.TT_TEORETISK_EØS_MND(SØKER_IND) =                         00004690
                    U3SP.TT_TEORETISK_EØS_MND                           00004700
                 + (U3SP.TT_TEORETISK_EØS_ÅR * 12);                     00004710
          B02.PENSJON_EØS (SØKER_IND)  = U3SP.PENSJON_EØS;              00004720
                                                                        00004730
          IF (B02.TT_PRO_RATA_MND(SØKER_IND) +                          00004740
              B02.TT_TEORETISK_EØS_MND(SØKER_IND) > 0 ) THEN            00004750
             B02.PRO_RATA_BEREGNING(SØKER_IND) = 'J' ;                  00004760
                                                                        00004770
          DO I = 67 TO 106;                                             00004780
                B02.INNTEKTSÅR_EØS(SØKER_IND,I) = NEI;                  00004790
          END;                                                          00004800
                                                                        00004810
          DO I = 1 TO 33;                                               00004820
             ÅR_IND = U3SP.EØS_ÅR(I);                                   00004830
             IF ÅR_IND > 0   THEN                                       00004840
                B02.INNTEKTSÅR_EØS(SØKER_IND,ÅR_IND) = JA;              00004850
          END;                                                          00004860
   /* KOMMER I NY U3  */                                                00004870
          DO I = 1967 TO 2006;                                          00004880
                B02.EØS_ÅR_IKKE_PRO_RATA(SØKER_IND,I) = NEI;            00004890
          END;                                                          00004900
                                                                        00004910
          DO I = 1 TO 9;                                                00004920
             ÅR_IND = U3SP.EØS_ÅR_IKKE_PRO_RATA(I);                     00004930
             IF ÅR_IND > 0   THEN                                       00004940
                B02.EØS_ÅR_IKKE_PRO_RATA(SØKER_IND,I) = JA;             00004950
          END;                                                          00004960
    /* 9803 ******* HIT I NY U3 */                                      00004970
       END; /* HAR BODD I UTLANDET */                                   00004980
                                                                        00004990
       ELSE                                                             00005000
          /* SAMMENHENGENDE NORSK BOSATT */                             00005010
          B02.STATUS.TT_FRAMT(SØKER_IND) =                              00005020
              (ALDER_67.ÅR * 12) - (HJ_Å * 12 + HJ_M);                  00005030
                                                                        00005040
       IF B02.STATUS.TT_FRAMT(SØKER_IND) < 0        THEN                00005050
          B02.STATUS.TT_FRAMT(SØKER_IND) = 0;                           00005060
                                                                        00005070
       IF B02.STATUS.TT_FRAMT(SØKER_IND) > 480      THEN                00005080
          B02.STATUS.TT_FRAMT(SØKER_IND) = 480;  /*HL 0196*/            00005090
                                                                        00005100
                                                                        00005110
 /* ***************************************************************** */00005120
 /*                                                                   */00005130
 /* YRKESSKADEOPPLYSNINGER.  ERIK 2.7.87                              */00005140
 /*                                                                   */00005150
 /* ***************************************************************** */00005160
                                                                        00005170
  %SKIP;                                                                00005180
                                                                        00005190
        IF U3S.YSKADE_TILLEGG = 'J' THEN                                00005200
           DO;                                                          00005210
              DO I = 1 TO 5;                                            00005220
                IF B01.YRKEHIST.YUFT_ÅM(SØKER_IND,I) = 0 THEN           00005230
                   DO;                                                  00005240
                      IF (I > 1)  & (B01.YRKEHIST.OPPH_DATO_ÅM          00005250
                                    (SØKER_IND,(I-1)) >                 00005260
                                   F_SNU_DATO(U3S.UFT_MÅ)) THEN         00005270
                         DO;                                            00005280
                                                                        00005290
         /*  ********************************************* */           00005300
         /*  Y-UFØRETIDSPUNKT LIGGER FØR OPPHØRSTIDSPUNKT  */           00005310
         /*  ********************************************* */           00005320
                              B02.YRKEHIST.OPPH_DATO_ÅM(                00005330
                              SØKER_IND,(I - 1 )) =                     00005340
           /*                       F_SNU_DATO(U3S.UFT_MÅ);  */         00005350
                                OPPH_ÅR*100+OPPH_MN;   /*9807*/         00005360
                          END;                                          00005370
  /* FJERNET 030496 HL :*/                                              00005380
                                                                        00005390
  /* **********                                                         00005400
        L264:                                                           00005410
                             FEIL_VED_LABEL = '264';                    00005420
                             FEIL_MELD_NR   =  1719;                    00005430
                             GO TO RETUR;                               00005440
                         END;                                           00005450
      ********************************************** */                 00005460
                      ELSE                                              00005470
                       DO;                                              00005480
                          YRK_IND = I;                                  00005490
                          W_VILKÅR_1_2_2A =                             00005500
                                          U3Y.VILKÅR_1_2_2A;            00005510
                          W_VILKÅR_1_2_2B =                             00005520
                                          U3Y.VILKÅR_1_2_2B;            00005530
                          B02.VILKÅR_1_2_2(SØKER_IND,YRK_IND) =         00005540
                                                  VILKÅR_DEF;           00005550
                                    /*    W_VILKÅR_1_2_2AB  */          00005560
                                                                        00005570
  /* ******************************************************* */         00005580
  /* HUSK:                                                   */         00005590
  /* TESTE PÅ OM B02.VILKÅR_1_2_2 = '  '. HVIS JA, SÅ VANLIG */         00005600
  /* ALDERSKONV.  HVIS NEI, SÅ SPESIELL ALDERSKONV.BEHANDLING*/         00005610
  /* ERIK .                                                  */         00005620
  /* ******************************************************* */         00005630
                                                                        00005640
                          B02.YRKEHIST.YUFT_ÅM(SØKER_IND,I) =           00005650
                                          F_SNU_DATO(U3S.UFT_MÅ);       00005660
                          B02.YST_ÅM(SØKER_IND,YRK_IND) =               00005670
                                          F_SNU_DATO(U3Y.YST_MÅ);       00005680
                                                                        00005690
                          B02.YRKEPENS.YSYKDOM(SØKER_IND) =             00005700
                                          U3Y.YSYKDOM;                  00005710
                          DIV_PARAM_OMR.YSYKDOM  =                      00005720
                                          U3Y.YSYKDOM;                  00005730
                                                                        00005740
                          B02.YRKEPENS.YUG(SØKER_IND) = U3Y.YUG;        00005750
                          B02.YRKEHIST.YUG(SØKER_IND,YRK_IND) =         00005760
                                          U3Y.YUG;                      00005770
                          B02.KAP_11_7_UTLØST(SØKER_IND,YRK_IND) =      00005780
                                          U3Y.KAP_11_7_UTLØST;          00005790
                          B02.YRKE11(SØKER_IND,YRK_IND) = U3Y.YRKE11;   00005800
                          B02.YRKEHIST.AÅI(SØKER_IND,YRK_IND)           00005810
                                                    = U3Y.AÅI;          00005820
                       END;                                             00005830
                     I = 5;                                             00005840
                                                                        00005850
                  END;                                                  00005860
              ELSE                                                      00005870
                                                                        00005880
                    IF I = 5 THEN                                       00005890
                       DO;                                              00005900
                                                                        00005910
 /* ***************************************************************** */00005920
 /* FEIL, ALLE YRKEPERIODENE ER UTFYLT, IKKE PLASS TIL EN TIL         */00005930
 /* ***************************************************************** */00005940
                                                                        00005950
         L267:                                                          00005960
                          FEIL_VED_LABEL = '267';                       00005970
                          FEIL_MELD_NR   = 1715;                        00005980
                          GO TO RETUR;                                  00005990
                       END;                                             00006000
                  END;                                                  00006010
            END;                                                        00006020
                                                                        00006030
                                                                        00006040
 /* ***************************************************************** */00006050
 /* PENSJONSGIVENDE INNTEKT                                           */00006060
 /* HER MÅ VI TESTE PÅ EN PI-KODE FOR Å SE OM VI HAR FÅTT RAPPORTERT  */00006070
 /* INNTEKT = 0                                                       */00006080
 /* ***************************************************************** */00006090
                                                                        00006100
          IF ÅR_FØR_UFØRHET            > 66     THEN                    00006110
             IF B01.PINNTEKT.PI_KODE(                                   00006120
                               SØKER_IND,ÅR_FØR_UFØRHET) = ' ' !        00006130
                B01.PINNTEKT.PI_KODE(                                   00006140
                               SØKER_IND,ÅR_FØR_UFØRHET) = 'F' THEN     00006150
                DO;                                                     00006160
                   IF U3S.PI > 0 THEN                                   00006170
                      DO;                                               00006180
                         B02.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'F';   00006190
                         B02.PI(SØKER_IND,ÅR_FØR_UFØRHET) =             00006200
                                                           U3S.PI / 100;00006210
                      END;                                              00006220
                END;                                                    00006230
                                                                        00006240
 /* ***************************************************************** */00006250
 /* UFØREHISTORIKK                                                    */00006260
 /* ***************************************************************** */00006270
                                                                        00006280
    DO I = 1 TO 7;                    /*0697 HL*/                       00006290
       IF (B01.UFØRHIST.UFT_ÅM(SØKER_IND,I) = F_SNU_DATO(U3S.UFT_MÅ))   00006300
          THEN                                                          00006310
 /* ***************************************************************** */00006320
 /* D.V.S VI HAR EN PERIODE FRA FØR MED SAMME UFTIDSPUNKT             */00006330
 /* ***************************************************************** */00006340
                                                                        00006350
         DO;                                                            00006360
            DIV_PARAM_OMR.REGN_1291 = ' ';    /*HL*/                    00006370
                                                                        00006380
            UF_IND = I;                                                 00006390
            B02.UFØRHIST.UFG(SØKER_IND,I)= U3S.UFG;                     00006400
                                                                        00006410
 /*HL : UFKRIT BLE ALLTID SATT > 0 FOR YRKESSKADDE - RETTET 2.4.91*/    00006420
                                                                        00006430
            IF U3S.VILKÅR_8_4_3A = 'J' THEN                             00006440
               IF U3S.YSKADE_TILLEGG = 'J' THEN                         00006450
                  IF U3Y.KAP_11_7_UTLØST = 'J'    THEN                  00006460
                     B02.UFKRITERIER(SØKER_IND,I) = 5;                  00006470
                  ELSE                                                  00006480
                     B02.UFKRITERIER(SØKER_IND,I) = 4;                  00006490
               ELSE                                                     00006500
                  B02.UFKRITERIER(SØKER_IND,I) = 2;                     00006510
            ELSE                                                        00006520
               B02.UFKRITERIER(SØKER_IND,I) = 0;                        00006530
            IF B01.BUP_GAR_KODE(SØKER_IND,I) = 'A' THEN                 00006540
               DO;                                                      00006550
                  IF HJ_VIRK_DATO_ÅM >= TJUEÅRSDATO  THEN               00006560
                     B02.BUP_GAR_KODE(SØKER_IND,I) = 'B';               00006570
               END;                                                     00006580
            B02.UFØRHIST.OPPHØRSDATO_ÅM(SØKER_IND,I) = 0;               00006590
            B02.UFØRHIST.OPPHØRSKODE   (SØKER_IND,I) = ' ';             00006600
            I = 7;                    /*0697 HL*/                       00006610
         END;                                                           00006620
                                                                        00006630
       ELSE                                                             00006640
       IF B01.UFØRHIST.UFT_ÅM(SØKER_IND,I) = 0 THEN                     00006650
          DO;                                                           00006660
                                                                        00006670
 /* ***************************************************************** */00006680
 /* D.V.S. FINNER FØRSTE LEDIGE PLASS.                                */00006690
 /* ***************************************************************** */00006700
                                                                        00006710
              UF_IND = I;                                               00006720
                                                                        00006730
              B02.UFØRHIST.UFT_ÅM(SØKER_IND,I) =                        00006740
                                         F_SNU_DATO(U3S.UFT_MÅ);        00006750
              B02.UFØRHIST.UFG(SØKER_IND,I) = U3S.UFG;                  00006760
                                                                        00006770
              IF U3S.VILKÅR_8_4_3A = 'J' THEN                           00006780
                 IF U3S.YSKADE_TILLEGG = 'J' THEN                       00006790
                    IF U3Y.KAP_11_7_UTLØST = 'J'    THEN                00006800
                         B02.UFKRITERIER(SØKER_IND,I) = 5;              00006810
                    ELSE                                                00006820
                         B02.UFKRITERIER(SØKER_IND,I) = 4;              00006830
                 ELSE                                                   00006840
                    B02.UFKRITERIER(SØKER_IND,I) = 2;                   00006850
              ELSE;                                                     00006860
                                                                        00006870
 /* ***************************************************************** */00006880
 /* DETTE ER FØRSTE PERIODE                                           */00006890
 /* ***************************************************************** */00006900
                                                                        00006910
              IF UF_IND = 1              THEN                           00006920
                 CALL UNGE_UFØRE;                                       00006930
                                                                        00006940
 /* ***************************************************************** */00006950
 /* DET FINNES EN FORRIGE PERIODE                                     */00006960
 /* ***************************************************************** */00006970
                                                                        00006980
              ELSE                                                      00006990
                 DO;                                                    00007000
                    IF B02.UFØRHIST.OPPHØRSDATO_ÅM(                     00007010
                           SØKER_IND,UF_IND - 1 ) >                     00007020
                                    F_SNU_DATO(U3S.UFT_MÅ) THEN         00007030
                       DO;                                              00007040
                           B02.UFØRHIST.OPPHØRSDATO_ÅM(                 00007050
                            SØKER_IND,UF_IND - 1 ) =                    00007060
           /*                          F_SNU_DATO(U3S.UFT_MÅ); */       00007070
                               OPPH_ÅR*100+OPPH_MN;  /*9807*/           00007080
                       END;                                             00007090
                                                                        00007100
                                                                        00007110
 /* ***************************************************************** */00007120
 /* FEIL, UFØRETIDSPUNKTET LIGGER FØR OPPHØRSTIDSPUNKTET.             */00007130
 /* ***************************************************************** */00007140
      /* FJERNET 25.11.94 HL :                                          00007150
  L265:                                                                 00007160
                           DO;                                          00007170
                              FEIL_VED_LABEL = '265';                   00007180
                              FEIL_MELD_NR   = 1719;                    00007190
                              GO TO RETUR;                              00007200
                           END;                                         00007210
             HIT */                                                     00007220
                                                                        00007230
 /* ***************************************************************** */00007240
 /* HER OVERFØRES BUP-GARANTI OG KODE FRA FORRIGE PERIODE             */00007250
 /* ***************************************************************** */00007260
                                                                        00007270
                    B02.BUP_GARANTI(SØKER_IND,I) =                      00007280
                                    B02.BUP_GARANTI(SØKER_IND,(I-1));   00007290
                    B02.BUP_GAR_KODE(SØKER_IND,I) =                     00007300
                                   B02.BUP_GAR_KODE(SØKER_IND,(I-1));   00007310
                    IF B02.BUP_GAR_KODE(SØKER_IND,I) = 'A'              00007320
                                                               THEN     00007330
                       DO;                                              00007340
                          IF HJ_VIRK_DATO_ÅM >=                         00007350
                                              TJUEÅRSDATO   THEN        00007360
                             B02.BUP_GAR_KODE(                          00007370
                                                     SØKER_IND,I) = 'B';00007380
                       END;                                             00007390
                                                                        00007400
                                                                        00007410
                 END; /*END UF_IND ^= 1*/                               00007420
                 I = 7;           /*0697 HL*/                           00007430
              END; /*END UFT = 0 */                                     00007440
           ELSE                                                         00007450
              DO;                                                       00007460
                                                                        00007470
 /* ***************************************************************** */00007480
 /* ALLE UFØREPERIODENE ER UTFYLT                                     */00007490
 /* ***************************************************************** */00007500
                                                                        00007510
                  IF I = 7 THEN       /*0697 HL*/                       00007520
                     DO;                                                00007530
                                                                        00007540
 /* ***************************************************************** */00007550
 /* FEIL, ALLE UFØREPERIODENE ER UTFYLT, IKKE PLASS TIL EN TIL        */00007560
 /* ***************************************************************** */00007570
                                                                        00007580
  L270:                                                                 00007590
                          FEIL_VED_LABEL = '270';                       00007600
                          FEIL_MELD_NR   = 1715;                        00007610
                          GO TO RETUR;                                  00007620
                      END;                                              00007630
              END;                                                      00007640
         END; /*I = 1 TO 7*/                                            00007650
                                                                        00007660
              /* NY 93 */                                               00007670
    IF B02.BOSATT(SØKER_IND)         > 0 &                              00007680
       B02.VIRK_DATO_ÅM(SØKER_IND)   > 9212 &                           00007690
       B02.PENSJONSTRYGDET(SØKER_IND) ^= 'J' &                          00007700
 /*   (B02.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1) = 'B'   !                 00007710
       B02.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1) = 'E')  THEN     */       00007720
       B02.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1) ^= ' '   &                00007730
       B02.SPESOPPL.UNG_UFØR    (SØKER_IND  ) ^= 'J'   THEN             00007740
         DO;                                                            00007750
            DO M = 1 TO 7;                /*0697 HL*/                   00007760
             B02.BUP_GAR_KODE(SØKER_IND,M) = ' ';                       00007770
             B02.BUP_GARANTI(SØKER_IND,M) = 0;                          00007780
            END;                                                        00007790
          IF B02.UFØRPENS.STI(SØKER_IND) > 0 THEN                       00007800
     L271:                                                              00007810
              DO;                                                       00007820
                  FEIL_VED_LABEL = '271';                               00007830
                  FEIL_MELD_NR   =  386;                                00007840
                  GO TO RETUR;                                          00007850
              END;                                                      00007860
         END;                                                           00007870
 /* ***************************************************************** */00007880
 /* EKTEFELLES STATUS                                                 */00007890
 /* ***************************************************************** */00007900
                                                                        00007910
    IF B02.FNR(EKTEF_IND) > 0 THEN                                      00007920
       DO;                                                              00007930
          B02.SIVILSTAND(EKTEF_IND)   = B02.SIVILSTAND(SØKER_IND);      00007940
          B02.NAVN      (EKTEF_IND)   = B02.NAVN(EKTEF_IND);            00007950
          B02.SPRÅK     (EKTEF_IND)   = B02.SPRÅK(SØKER_IND);           00007960
          B02.VIRK_DATO_ÅM(EKTEF_IND) = F_SNU_DATO(U3S.VIRK_DATO_MÅ);   00007970
          /* KS 5/6-84 */                                               00007980
          B02.PENSJONSTYPE3  (EKTEF_IND) = ' ';                         00007990
          B02.SUM_YTELSE     (EKTEF_IND) = 0;                           00008000
          /* ENDRET 22/10-84 AV KARIN */                                00008010
          B02.FØRSTE_GANG_REG(EKTEF_IND) =                              00008020
          B02.FØRSTE_GANG_REG(SØKER_IND);                               00008030
  /*0296 HL : */                                                        00008040
          IF B01.STATUS_KODE_HIST(EKTEF_IND) = 'X'  THEN                00008050
             B02.FØRSTE_GANG_REG(EKTEF_IND) = 'N';                      00008060
          IF U3S.TILL_EK = 'J' THEN                                     00008070
             DO;                                                        00008080
                B02.STATUS.PENSJONSTYPE1(EKTEF_IND) = 'F';              00008090
                B02.STATUS.PENSJONSTYPE2(EKTEF_IND) = ' ';              00008100
              END;                                                      00008110
          ELSE                                                          00008120
            DO;                                                         00008130
               B02.STATUS.PENSJONSTYPE1(EKTEF_IND) = 'G';               00008140
               B02.STATUS.PENSJONSTYPE2(EKTEF_IND) = ' '; /*TRUDE 0594*/00008150
            END;                                                        00008160
        END;                                                            00008170
                                                                        00008180
    IF U3S.ATT_UF = 'A' THEN                                            00008190
       IF (B01.PENSJONSTYPE1(SØKER_IND)    = 'U' !                      00008200
           B01.PENSJONSTYPE1(SØKER_IND)    = 'Y')  &                    00008210
          B01.PENSJONSTYPE3(SØKER_IND)   ^= 'A'    &                    00008220
          B01.VIRK_DATO_ÅM(SØKER_IND)    ^=                             00008230
          F_SNU_DATO(U3S.VIRK_DATO_MÅ)          &                       00008240
          B01.STATUS_KODE_HIST(SØKER_IND) = ' ' THEN                    00008250
          DO;                                                           00008260
                                                                        00008270
 /* ***************************************************************** */00008280
 /* FEIL,SØKEREN HAR UFØRPENSJON FRA FØR.                             */00008290
 /* ***************************************************************** */00008300
                                                                        00008310
  L275:                                                                 00008320
             FEIL_VED_LABEL = '275';                                    00008330
             FEIL_MELD_NR   = 1717;                                     00008340
             GO TO RETUR;                                               00008350
          END;                                                          00008360
       ELSE                                                             00008370
  /* DENNE TESTEN ER BEGRENSET I FORB. MED FRAPP. 274. ERIK 16.1.86 */  00008380
          IF B01.PENSJONSTYPE3(SØKER_IND) = 'A'     &                   00008390
             (B01.PENSJONSTYPE1(SØKER_IND)   ^= 'U' &                   00008400
              B01.PENSJONSTYPE1(SØKER_IND)   ^= 'Y') &                  00008410
        /*   B01.VIRK_DATO_ÅM(SØKER_IND)    ^=                          00008420
             F_SNU_DATO(U3S.VIRK_DATO_MÅ)          THEN */              00008430
             B01.STATUS_KODE_HIST(SØKER_IND) = ' ' THEN                 00008440
             DO;                                                        00008450
                                                                        00008460
 /* ***************************************************************** */00008470
 /* FEIL,SØKEREN HAR ATTFØRING FRA FØR.                               */00008480
 /* ***************************************************************** */00008490
                                                                        00008500
 L277:                                                                  00008510
                FEIL_VED_LABEL = '277';                                 00008520
                FEIL_MELD_NR   = 1718;                                  00008530
                GO TO RETUR;                                            00008540
             END;                                                       00008550
          ELSE                                                          00008560
             B02.PENSJONSTYPE3(SØKER_IND) = 'A';                        00008570
                                                                        00008580
  RETUR:                                                                00008590
    END OPPRETT_STATUS_U3_SØKER;                                        00008600
