 /*       SIST ENDRET 28/07-98 12.51.13 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/07-98 12.27.48 AV   JDA7339                  */00000010
 /*       SIST ENDRET 25/03-98 14.18.15 AV   JDA7339                  */00000020
 /*       SIST ENDRET 16/03-98 14.39.56 AV   JDA7339                  */00000030
 /*       SIST ENDRET 10/02-98 12.03.53 AV   JDA7339                  */00000040
 /*       SIST ENDRET 10/02-98 11.59.10 AV   JDA7339                  */00000050
 /*       SIST ENDRET 28/01-98 15.14.31 AV   JDA7339                  */00000060
 /*       SIST ENDRET 28/01-98 15.12.42 AV   JDA7339                  */00000070
 /*       SIST ENDRET 24/10-97 11.58.58 AV   JDA7339                  */00000080
 /*       SIST ENDRET 25/09-97 09.55.22 AV   HLA7339                  */00000090
 /*       SIST ENDRET 29/08-97 12.29.10 AV   JDA7339                  */00000100
 /*       SIST ENDRET 28/08-97 08.53.29 AV   SPA7339                  */00000110
 /*       SIST ENDRET 28/04-97 11.12.24 AV   TSB7339                  */00000120
 /*       SIST ENDRET 03/04-96 09.29.17 AV   HLB0310                  */00000130
 /*       SIST ENDRET 05/03-96 09.21.10 AV   HLB0310                  */00000140
 /*       SIST ENDRET 06/07-95 10.12.40 AV   HLB0310                  */00000150
 /*       SIST ENDRET 24/10-94 13.29.56 AV   HLB0310                  */00000160
 /*       SIST ENDRET 05/09-94 10.08.57 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 11/07-94 13.12.47 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 24/05-94 14.09.04 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 25/02-94 12.56.45 AV   HERMAN                   */00000200
 /* **************************************************************** */ 00000210
 /*IDENTIFIKASJON:                                                   */ 00000220
 /*    R001U620 - PROSEDYRE I PLI        HOVEDPROGRAM                */ 00000230
 /*    PROGRAMMERER: HERMAN 0793                                     */ 00000240
 /*HENSIKT:                                                          */ 00000250
 /*    KONTROLLERE U3TRANS MOT STATUS FAMILIEFORHOLD.                */ 00000260
 /*    RUTINEN KONTROLLERER ALLE PERSONER I TRANSAKSJONEN MOT        */ 00000270
 /*    INFORMASJON I REGISTERET. FOR HVER FAMILIEPERSON SOM GÅR      */ 00000280
 /*    FEILFRI GJENNOM KONTROLLENE BLIR DET OPPRETTET NY STATUS      */ 00000290
 /*    FOR PERSONEN, OG SØKERENS STATUS OPPDATERES.                  */ 00000300
 /* ***************************************************************  */ 00000310
 /* ENDRET:                                                          */ 00000320
 /* ENDRINGEN GJELDER:                                               */ 00000330
 /* ENDRET AV:                                                       */ 00000340
 /* ***************************************************************  */ 00000350
 /*PROGRAMTILKNYTNING:                                               */ 00000360
 /*    KALLES OPP AV PROGRAM R0013520                                */ 00000370
 /*BRUK:                                                             */ 00000380
 /*    EXEC CICS XCTL PROGRAM ('R001U620') COMMAREA (KOM_OMR)        */ 00000390
 /*                                                                  */ 00000400
 /* **************************************************************** */ 00000410
                                                                        00000420
 %PAGE;                                                                 00000430
 U3TR:                                                                  00000440
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000450
                                                                        00000460
 %PAGE;                                                                 00000470
      %INCLUDE P001U601;                                                00000480
      %INCLUDE P0019906;                                                00000490
      %INCLUDE P0019908;                                                00000500
      %INCLUDE P0019910;                                                00000510
      %INCLUDE P0019912;                                                00000520
      %INCLUDE P0019913;                                                00000530
                                                                        00000540
   DCL (COMMAREA_PEKER,LOKAL_KOM_PTR) PTR;                              00000550
                                                                        00000560
 %PAGE;                                                                 00000570
   DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                       00000580
                                                                        00000590
 %PAGE;                                                                 00000600
   DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                       00000610
   DCL 1 HL_B02,               %INCLUDE P0019921;                       00000620
                                                                        00000630
 %PAGE;                                                                 00000640
   DCL 1 B00 BASED(B00_PEKER), %INCLUDE P0019921;                       00000650
                                                                        00000660
                                                                        00000670
   DCL                                                                  00000680
      BARN_IND       FIXED BIN(15),                                     00000690
      UF_IND         FIXED BIN(15),                                     00000700
      IND            FIXED BIN(15);                                     00000710
   DCL                                                                  00000720
      I              FIXED BIN(15),                                     00000730
      J              FIXED BIN(15);                                     00000740
                                                                        00000750
 /* ***************************************************************** */00000760
 /* HJELPE DCL FOR Å SNU DATO                                         */00000770
 /* ***************************************************************** */00000780
                                                                        00000790
   DCL                                                                  00000800
      HJ_VIRK_DATO_ÅM          PIC '9999';                              00000810
   DCL                                                                  00000820
      FNR                      PIC '(11)9',                             00000830
      FNR_R_M  POS (3) DEF FNR PIC '99',                                00000840
      FNR_R_MÅ POS (3) DEF FNR PIC '9999',                              00000850
      FNR_R_Å  POS (5) DEF FNR PIC '99',                                00000860
      FNR_R_ÅRHUNDRE                                                    00000870
               POS (7) DEF FNR PIC '9',                                 00000880
      SEKSTISJUÅRSDATO         PIC '99999',                             00000890
      SYTTIÅRSDATO             PIC '99999',                             00000900
      TJUEÅRSDATO              PIC '99999',                             00000910
      SISTE_PERIODE            PIC '99',                                00000920
      SISTE_UTFYLTE            PIC '99';                                00000930
   DCL                                                                  00000940
      1 ALDER_67 DEF SEKSTISJUÅRSDATO,                                  00000950
        2 ÅR                   PIC'999',                                00000960
        2 MND                  PIC'99';                                 00000970
                                                                        00000980
   DCL                                                                  00000990
      1 ALDER_70       DEF SYTTIÅRSDATO,                                00001000
        2 ÅR                   PIC'999',                                00001010
        2 MND                  PIC'99';                                 00001020
   DCL                                                                  00001030
      1 STATUS_TYPE_SØKER  CHAR(1);                                     00001040
   DCL                                                                  00001050
     (ADDR,                                                             00001060
      CSTG)BUILTIN;                                                     00001070
   DCL HJ_UFT_MÅ                       PIC'9999';                       00001080
   DCL HJ_UFT_M DEF HJ_UFT_MÅ POS(1)   PIC'99';                         00001090
   DCL HJ_UFT_Å DEF HJ_UFT_MÅ POS(3)   PIC'99';                         00001100
   DCL HJ_MÅ                           PIC'9999';                       00001110
   DCL HJ_M     DEF HJ_MÅ     POS(1)   PIC'99';                         00001120
   DCL HJ_Å     DEF HJ_MÅ     POS(3)   PIC'99';                         00001130
   DCL HJ_ÅM                           PIC'9999';                       00001140
   DCL HJ_ÅM_FIX              FIXED DEC (5) INIT (0);                   00001150
                                                                        00001160
   DCL MAX_BUP                FIXED DEC (3) INIT (0);                   00001170
   DCL TIL_ÅR                 FIXED DEC (3) INIT (0);                   00001180
   DCL JA                     FIXED BIN (1) INIT ('1'B);                00001190
   DCL NEI                    FIXED BIN (1) INIT ('0'B);                00001200
   DCL ÅR_IND                 FIXED BIN (15);                           00001210
   DCL TT_RED                 CHAR      (1) INIT (' ');                 00001220
   DCL TT_NORSK_FAKTISK_MND           FIXED DEC (3)   INIT (0);         00001230
   DCL HJ_TT_FRAMT                    FIXED DEC (3)   INIT (0);         00001240
   DCL OPPH                     PIC '(4)9';   /*9807*/                  00001250
   DCL OPPH_MN DEF OPPH POS(1)  PIC '99',                               00001260
       OPPH_ÅR DEF OPPH POS(3)  PIC '99';                               00001270
                                                                        00001280
                                                                        00001290
 /* ***************************************************************** */00001300
 /* PROGRAMMET STARTER HER                                            */00001310
 /* ***************************************************************** */00001320
                                                                        00001330
    ALLOCATE LOKAL_KOM_OMR;                                             00001340
                                                                        00001350
    HOVED_KOM_OMR_PTR   = COMMAREA_PEKER;                               00001360
    PROGRAM_ID          = 'R001U620';                                   00001370
    FNR                 = U3S.FNR;                                      00001380
    HJ_VIRK_DATO_ÅM     = F_SNU_DATO(U3S.VIRK_DATO_MÅ);                 00001390
    OPPH                = U3S.UFT_MÅ;                                   00001400
    IF OPPH_ÅR > 98     &                                               00001410
       OPPH_MN = 1      THEN                                            00001420
       DO;                                                              00001430
          OPPH_MN = 12;                                                 00001440
          OPPH_ÅR = OPPH_ÅR - 1;                                        00001450
       END;                                                             00001460
                                                                        00001470
    IF U3S.ATT_UF       = 'X'       THEN     /*DAGPENGER*/              00001480
       DO;                                                              00001490
          B01.SIVILSTAND(SØKER_IND) = 'U';                              00001500
          U3S.SIVILSTAND            = 'U';                              00001510
          DO I = 1 TO 13;                                               00001520
             B01.TILKN(SØKER_IND,I)    = '';                            00001530
          END;                                                          00001540
          B01.PERSON(EKTEF_IND)    = '';                                00001550
          B01.ANTALL_BARN(SØKER_IND) = 0;                               00001560
       END;                                                             00001570
                                                                        00001580
    IF FNR_R_ÅRHUNDRE < 5          THEN                                 00001590
       DO;                                                              00001600
          SEKSTISJUÅRSDATO    = F_SNU_DATO(FNR_R_MÅ) + 6700;            00001610
          SYTTIÅRSDATO        = F_SNU_DATO(FNR_R_MÅ) + 7000;            00001620
          TJUEÅRSDATO         = F_SNU_DATO(FNR_R_MÅ) + 2000;            00001630
       END;                                                             00001640
    ELSE                                                                00001650
       DO;                                                              00001660
          SEKSTISJUÅRSDATO    = F_SNU_DATO(FNR_R_MÅ) + 6700 - 10000;    00001670
          SYTTIÅRSDATO        = F_SNU_DATO(FNR_R_MÅ) + 7000 - 10000;    00001680
          TJUEÅRSDATO         = F_SNU_DATO(FNR_R_MÅ) + 2000 - 10000;    00001690
       END;                                                             00001700
                                                                        00001710
    TRANSTYPE           = 2;                                            00001720
    I                   = 0;                                            00001730
    IND                 = 0;                                            00001740
    SISTE_UTFYLTE       = 0;                                            00001750
                                                                        00001760
    DO I = 1 TO 7;                                                      00001770
                                                                        00001780
       IF B01.UFØRHIST.UFT_ÅM (SØKER_IND,I) = 0 THEN                    00001790
          DO;                                                           00001800
             SISTE_UTFYLTE    = I - 1;                                  00001810
                                                                        00001820
             IF I             = 1               THEN                    00001830
                SISTE_UTFYLTE = 1;                                      00001840
                                                                        00001850
             I                = 7;                                      00001860
          END;                                                          00001870
    END;                                                                00001880
                                                                        00001890
                                                                        00001900
 /* *************************************************************** */  00001910
 /*  GARANTI_TP . BLANKETTER MÅ AVVISES NÅR UFG REDUSERES.TS 0992   */  00001920
 /* *************************************************************** */  00001930
   L300:                                                                00001940
     IF B01.GARANTI_TP(SØKER_IND)  > 0  THEN                            00001950
       DO;                                                              00001960
         IF B01.UFØRHIST.UFG (SØKER_IND,SISTE_UTFYLTE) >                00001970
                U3S.UFG    THEN                                         00001980
                 DO;                                                    00001990
                   FEIL_VED_LABEL = '300';                              00002000
                   FEIL_MELD_NR   = 383;                                00002010
                   GO TO L999;                                          00002020
                 END;                                                   00002030
       END;                                                             00002040
                                                                        00002050
                                                                        00002060
    SISTE_PERIODE       = 7;                                            00002070
                                                                        00002080
 /* ***************************************************************** */00002090
 /* HVIS SØKEREN HAR PENSJONSSTATUS                                   */00002100
 /* ***************************************************************** */00002110
                                                                        00002120
                                                                        00002130
    STATUS_TYPE_SØKER = STATUS_TYPE;                                    00002140
                                                                        00002150
           /* ***********************************************  */       00002160
           /* ETTERFØLGENDE TESTER GJELDER DISSE STATUS-TYPER: */       00002170
           /* - B - BYGGER PÅ SISTE STATUS                     */       00002180
           /* - D - BYGGER PÅ NEST SISTE STATUS                */       00002190
           /* - G - BYGGER PÅ NEST SISTE STATUS, ER OPPHØRT I  */       00002200
           /*       SISTE STATUS MED X (IKKE DØD)              */       00002210
           /* ************************************************ */       00002220
                                                                        00002230
                                                                        00002240
      IF STATUS_TYPE_SØKER = 'B' !                                      00002250
         STATUS_TYPE_SØKER = 'D' !                                      00002260
         STATUS_TYPE_SØKER = 'G' THEN                                   00002270
         DO;                                                            00002280
           IF (B01.TKNR(SØKER_IND)  >  0        &                       00002290
               B01.TKNR(SØKER_IND)  ^= U3S.TKNR) &                      00002300
               B01.SIVILSTAND(SØKER_IND) ^= 'A' THEN                    00002310
                                                                        00002320
 /* ***************************************************************** */00002330
 /* SØKEREN ER REGISTRERT MED ET ANNET TKNR I STATUS ENN I TRANS      */00002340
 /* ***************************************************************** */00002350
                                                                        00002360
               DO;                                                      00002370
  L100:                                                                 00002380
                  FEIL_VED_LABEL     = '100';                           00002390
                  FEIL_MELD_NR       =  1702;                           00002400
                  GO TO L999;                                           00002410
               END;                                                     00002420
                                                                        00002430
                                                                        00002440
            IF B01.PENSJONSTYPE1(SØKER_IND)    = 'L' THEN               00002450
                                                                        00002460
 /* ***************************************************************** */00002470
 /* SØKER ER REGISTRERT FRA FØR SOM FORSØRGET BARN. FORSØRGINGS-      */00002480
 /* TILLEGGET MÅ OPPHØRE FØR UFØREPENSJON KAN REGISTRERES.            */00002490
 /* ***************************************************************** */00002500
                                                                        00002510
                    DO;                                                 00002520
  L102:                                                                 00002530
                      FEIL_VED_LABEL = '102';                           00002540
                      FEIL_MELD_NR   = 1720;                            00002550
                      GO TO L999;                                       00002560
                    END;                                                00002570
                                                                        00002580
            IF B01.PENSJONSTYPE1(SØKER_IND)    = 'K' THEN               00002590
                                                                        00002600
 /* ***************************************************************** */00002610
 /* SØKER HAR AVTALEFESTET PENSJON FRA FØR.                           */00002620
 /* ***************************************************************** */00002630
                                                                        00002640
               DO;                                                      00002650
        L103:                                                           00002660
                  FEIL_VED_LABEL = '103';                               00002670
                  FEIL_MELD_NR   = 1104;                                00002680
                  GO TO L999;                                           00002690
               END;                                                     00002700
                                                                        00002710
            IF (B01.PENSJONSTYPE1(SØKER_IND)               = 'U'  !     00002720
                B01.PENSJONSTYPE1(SØKER_IND)               = 'Y' )    & 00002730
               B01.UFT_ÅM       (SØKER_IND,SISTE_UTFYLTE) > F_SNU_DATO( 00002740
                                                   U3S.UFT_MÅ)        & 00002750
               U3S.ATT_UF  ^= 'A'                                       00002760
                                                              THEN      00002770
                                                                        00002780
 /* ***************************************************************** */00002790
 /* SØKER ER REGISTRERT FRA FØR SOM UFØREPENSJONIST MED ET UFØRE-     */00002800
 /* TIDSPUNKT SENERE ENN DET SOM NÅ BLIR RAPPORTERT                   */00002810
 /* ***************************************************************** */00002820
                                                                        00002830
                    DO;                                                 00002840
  L110:                                                                 00002850
                      FEIL_VED_LABEL = '110';                           00002860
                      FEIL_MELD_NR   = 1711;                            00002870
                      GO TO L999;                                       00002880
                    END;                                                00002890
            ELSE                                                        00002900
               IF B01.VERNEPLIKTÅR(SØKER_IND,1) > 0 &                   00002910
                  U3S.VP_ÅR(1) = 0 THEN                                 00002920
                                                                        00002930
 /* ***************************************************************** */00002940
 /* SØKEREN REGISTRERT MED OPPLYSNING OM VERNEPLIKTSÅR, TRANSAKSJONER */00002950
 /* INNEHOLDER IKKE DETTE                                             */00002960
 /* ***************************************************************** */00002970
                                                                        00002980
                  DO;                                                   00002990
  L120:                                                                 00003000
                     FEIL_VED_LABEL = '120';                            00003010
                     FEIL_MELD_NR   = 1707;                             00003020
                     GO TO L999;                                        00003030
                  END;                                                  00003040
               ELSE                                                     00003050
                  DO;                                                   00003060
                     IF B01.OPPHØRSDATO_ÅM(                             00003070
                        SØKER_IND,SISTE_PERIODE) > F_SNU_DATO(          00003080
                                                   U3S.UFT_MÅ) THEN     00003090
                                                                        00003100
 /* ***************************************************************** */00003110
 /* SØKER ER REGISTRERT MED OPPHØRSDATO I UFØREHISTORIKK SENERE ENN   */00003120
 /* UFØRETIDSPUNKT I TRANSEN                                          */00003130
 /* ***************************************************************** */00003140
                                                                        00003150
                              DO;                                       00003160
  L130:                                                                 00003170
                                 FEIL_VED_LABEL = '130';                00003180
                                 FEIL_MELD_NR   = 1712;                 00003190
                                 GO TO L999;                            00003200
                              END;                                      00003210
                  END;                                                  00003220
                                                                        00003230
 /* ***************************************************************** */00003240
 /* HVIS DET ER EN EKTEFELLE I TRANSEN                                */00003250
 /* ***************************************************************** */00003260
                                                                        00003270
            IF U3S.FNR_EK > 0 THEN                                      00003280
               DO;                                                      00003290
                                                                        00003300
 /* ***************************************************************** */00003310
 /* HVIS SØKEREN ER UGIFT                                             */00003320
 /* ***************************************************************** */00003330
                                                                        00003340
                  SELECT ( B01.SIVILSTAND(SØKER_IND));                  00003350
                     WHEN ('U')                                         00003360
                        DO;                                             00003370
   L140:                                                                00003380
                          FEIL_VED_LABEL = '140';                       00003390
                          FEIL_MELD_NR   = 1001;                        00003400
                          GO TO L999;                                   00003410
                        END;                                            00003420
                                                                        00003430
 /* ***************************************************************** */00003440
 /* HVIS SØKEREN ER SKILT                                             */00003450
 /* ***************************************************************** */00003460
                                                                        00003470
                     WHEN ('S')                                         00003480
                        DO;                                             00003490
  L150:                                                                 00003500
                           FEIL_VED_LABEL = '150';                      00003510
                           FEIL_MELD_NR   = 1002;                       00003520
                           GO TO L999;                                  00003530
                        END;                                            00003540
                                                                        00003550
 /* ***************************************************************** */00003560
 /* HVIS SØKEREN ER ETTERLATT                                         */00003570
 /* ***************************************************************** */00003580
                                                                        00003590
                     WHEN ('E')                                         00003600
                        DO;                                             00003610
  L160:                                                                 00003620
                           FEIL_VED_LABEL = '160';                      00003630
                           FEIL_MELD_NR   = 1003;                       00003640
                           GO TO L999;                                  00003650
                        END;                                            00003660
                                                                        00003670
 /* ***************************************************************** */00003680
 /* ELLERS ER SØKEREN GIFT                                            */00003690
 /* ***************************************************************** */00003700
                                                                        00003710
                     OTHERWISE                                          00003720
                        DO;                                             00003730
                                                                        00003740
 /* ***************************************************************** */00003750
 /* HVIS DET ER EN ANNEN EKTEFELLE I SØKERENS PENSJONSSTATUS          */00003760
 /* ***************************************************************** */00003770
                                                                        00003780
                           IF B01.FNR(EKTEF_IND) ^= U3S.                00003790
                                                        FNR_EK THEN     00003800
                              DO;                                       00003810
  L170:                                                                 00003820
                                 FEIL_VED_LABEL = '170';                00003830
                                 FEIL_MELD_NR   = 1004;                 00003840
                                 GO TO L999;                            00003850
                              END;                                      00003860
                                                                        00003870
 /* ***************************************************************** */00003880
 /* DET FORUTSETTES NÅ AT EKTEFELLEN ER I SØKERENS PENSJONSSTATUS     */00003890
 /* ***************************************************************** */00003900
                                                                        00003910
                           ELSE                                         00003920
                              DO;                                       00003930
                                                                        00003940
 /* ***************************************************************** */00003950
 /* HVIS DET SØKES OM EKTEFELLETILLEGG                                */00003960
 /* ***************************************************************** */00003970
                                                                        00003980
                              IF U3S.TILL_EK = 'J' THEN                 00003990
                                    DO;                                 00004000
 /* ***************************************************************** */00004010
 /* HVIS EKTEFELLEN HAR EGEN PENSJON                                  */00004020
 /* ***************************************************************** */00004030
                                                                        00004040
                                       IF (                             00004050
                                           B01.PENSJONSTYPE1(EKTEF_IND) 00004060
                                                              = 'A' !   00004070
                                           B01.PENSJONSTYPE1(EKTEF_IND) 00004080
                                                              = 'U' !   00004090
                                           B01.PENSJONSTYPE1(EKTEF_IND) 00004100
                                                              = 'Y' !   00004110
                                           B01.PENSJONSTYPE1(EKTEF_IND) 00004120
                                                              = 'K'  )  00004130
                                                                   THEN 00004140
                                          DO;                           00004150
  L180:                                                                 00004160
                                             FEIL_VED_LABEL = '180';    00004170
                                             FEIL_MELD_NR   = 1011;     00004180
                                             GO TO L999;                00004190
                                          END;                          00004200
                                                                        00004210
 /* ***************************************************************** */00004220
 /* EKTEFELLEN HAR IKKE PENSJON                                       */00004230
 /* ***************************************************************** */00004240
                                                                        00004250
                                       ELSE                             00004260
                                          DO;                           00004270
                                             CALL                       00004280
                                                 FLYTT_B01_TIL_B02(     00004290
                                                            SØKER_IND); 00004300
                                             IF FEIL_MELD_NR > 0 THEN   00004310
                                                GO TO L999;             00004320
                                             CALL                       00004330
                                                 FLYTT_B01_TIL_B02(     00004340
                                                            EKTEF_IND); 00004350
                                             IF FEIL_MELD_NR > 0 THEN   00004360
                                                GO TO L999;             00004370
                                             CALL                       00004380
                                              AJOURFØR_B02_MED_U3TRANS; 00004390
                                             IF FEIL_MELD_NR > 0 THEN   00004400
                                               GO TO L999;              00004410
                                          END;                          00004420
                                    END;                                00004430
                                                                        00004440
 /* ***************************************************************** */00004450
 /* DET SØKES IKKE OM EKTEFELLETILLEGG                                */00004460
 /* ***************************************************************** */00004470
                                                                        00004480
                                 ELSE                                   00004490
                                    DO;                                 00004500
                                       CALL                             00004510
                                       FLYTT_B01_TIL_B02(SØKER_IND);    00004520
                                       IF FEIL_MELD_NR > 0 THEN         00004530
                                          GO TO L999;                   00004540
                                       CALL                             00004550
                                       FLYTT_B01_TIL_B02(EKTEF_IND);    00004560
                                       IF FEIL_MELD_NR > 0 THEN         00004570
                                          GO TO L999;                   00004580
                                       CALL                             00004590
                                       AJOURFØR_B02_MED_U3TRANS;        00004600
                                       IF FEIL_MELD_NR > 0 THEN         00004610
                                          GO TO L999;                   00004620
                                    END;                                00004630
                              END;                                      00004640
                        END;                                            00004650
                  END;                                                  00004660
               END;                                                     00004670
                                                                        00004680
 /* ***************************************************************** */00004690
 /* DET ER INGEN EKTEFELLE I TRANSEN                                  */00004700
 /* ***************************************************************** */00004710
                                                                        00004720
            ELSE                                                        00004730
                                                                        00004740
 /* ***************************************************************** */00004750
 /* HVIS SØKERENS SIVILSTAND ER 'G' ELLER 'A'...                      */00004760
 /* ***************************************************************** */00004770
                                                                        00004780
                  IF (                                                  00004790
                       B01.SIVILSTAND(SØKER_IND) = 'G' !                00004800
     /*9710 HL*/       B01.SIVILSTAND(SØKER_IND) = 'P' !                00004810
                       B01.SIVILSTAND(SØKER_IND) = 'W' !                00004820
                       B01.SIVILSTAND(SØKER_IND) = 'V' !                00004830
                       B01.SIVILSTAND(SØKER_IND) = 'A') THEN            00004840
                     DO;                                                00004850
   L190:                                                                00004860
                        FEIL_VED_LABEL = '190';                         00004870
                        FEIL_MELD_NR   = 1102;                          00004880
                        GO TO L999;                                     00004890
                     END;                                               00004900
                  ELSE                                                  00004910
                     DO;                                                00004920
                        IF SØKER_IND > 3                      THEN      00004930
                           CALL FLYTT_B01_TIL_B02(3);                   00004940
                        ELSE                                            00004950
                           CALL FLYTT_B01_TIL_B02(SØKER_IND);           00004960
                        IF FEIL_MELD_NR > 0 THEN                        00004970
                           GO TO L999;                                  00004980
                                                                        00004990
                        PROGRAM_ID          = 'R001U620'   ;            00005000
                                                                        00005010
                        IF (B01.PENSJONSTYPE1(SØKER_IND) = 'B' !        00005020
                            B01.PENSJONSTYPE1(SØKER_IND) = 'N') THEN    00005030
                           DO;  /* AVDØD MOR/FAR FLYTTES */             00005040
                              B02.PERSON(1) = B01.PERSON(1);            00005050
                              B02.PERSON(2) = B01.PERSON(2);            00005060
                           END;                                         00005070
                        IF B01.PENSJONSTYPE1(SØKER_IND) = 'E' !         00005080
                           B01.PENSJONSTYPE2(SØKER_IND) = 'E'   THEN    00005090
                           B02.PERSON(EKTEF_IND) =                      00005100
                                            B01.PERSON(EKTEF_IND);      00005110
                        CALL AJOURFØR_B02_MED_U3TRANS;                  00005120
                        IF FEIL_MELD_NR > 0 THEN                        00005130
                           GO TO L999;                                  00005140
                     END;                                               00005150
         END;                                                           00005160
      ELSE                                                              00005170
         DO;                                                            00005180
                                                                        00005190
 /* **************************************************************** */ 00005200
 /* SØKER ER I BASEN, HAR IKKE PENSJONSSTATUS                        */ 00005210
 /* ELLER HAR EN OPPHØRT PENSJONSSTATUS (STATUS_KODE_HIST = O / X)   */ 00005220
 /* **************************************************************** */ 00005230
 /* KS 6/12-84 */                                                       00005240
            /**************************************************/        00005250
            /* DET ETTERFØLGENDE GJELDER DISSE STATUS_TYPER:  */        00005260
            /* - A - IKKE STATUS-SEGMENT ELLER STATUS-SEGMENT */        00005270
            /*       SOM ER OPPHØRT, STATUS_KODE_HIST = 'O'   */        00005280
            /*       INGEN OPPL. FRA STATUS SKAL MED I B02    */        00005290
            /* - C - IKKE STATUS_SEGMENT                      */        00005300
            /* - I - HAR STATUS_SEGMENT(SS) SOM ER HISTORISK, */        00005310
            /*       STATUS_KODE_HIST = 'X', UFØREHISTORIKKEN */        00005320
            /*       SKAL VÆRE MED OVER TIL B02               */        00005330
            /* - K - HAR STATUS_SEGMENT(NS) SOM ER HISTORISK  */        00005340
            /*       STATUS_KODE_HIST = 'X', UFØREHISTORIKKEN */        00005350
            /*       SKAL VÆRE MED OVER TIL B02.              */        00005360
            /* ********************************************** */        00005370
                                                                        00005380
                                                                        00005390
            IF B01.FNR(SØKER_IND) > 0 THEN                              00005400
               DO;                                                      00005410
                  IF SØKER_IND > 3                      THEN            00005420
                     CALL FLYTT_B01_TIL_B02(3);                         00005430
                  ELSE                                                  00005440
                     CALL FLYTT_B01_TIL_B02(SØKER_IND);                 00005450
                  IF FEIL_MELD_NR > 0 THEN                              00005460
                     GO TO L999;                                        00005470
                  B02.NAVN(SØKER_IND)     =  U3S.NAVN;                  00005480
               END;                                                     00005490
            ELSE                                                        00005500
                                                                        00005510
 /* ***************************************************************** */00005520
 /* ROTSEGMENTOPPLYSNINGER.                                           */00005530
 /* ***************************************************************** */00005540
                                                                        00005550
               DO;                                                      00005560
                  B02.FNR (SØKER_IND)     =  U3S.FNR;                   00005570
                  B02.NAVN(SØKER_IND)     =  U3S.NAVN;                  00005580
                  B02.TKNR(SØKER_IND)     =  U3S.TKNR;                  00005590
                  B02.SPRÅK(SØKER_IND)    =  U3S.SPRÅK;                 00005600
                  B02.SIVILSTAND(SØKER_IND)    =  U3S.SIVILSTAND;       00005610
               END;                                                     00005620
                                                                        00005630
 /* ***************************************************************** */00005640
 /* HVIS DET ER EKTEFELLE I TRANSEN                                   */00005650
 /* ***************************************************************** */00005660
                                                                        00005670
            IF U3S.FNR_EK > 0 THEN                                      00005680
               DO;                                                      00005690
                  POS_I_B01 = EKTEF_IND;                                00005700
                  SEARCH_FNR = U3S.FNR_EK;                              00005710
                  EXEC CICS LINK PROGRAM('R0019928') COMMAREA(KOM_OMR); 00005720
                  IF FEIL_MELD_NR > 0 THEN                              00005730
                     GO TO L999;                                        00005740
                  ELSE                                                  00005750
                     PROGRAM_ID = 'R001U620';                           00005760
                                                                        00005770
 /* ***************************************************************** */00005780
 /* HVIS EKTEFELLEN IKKE HAR PENSJONSSTATUS                           */00005790
 /* ***************************************************************** */00005800
                                                                        00005810
                  IF STATUS_TYPE = 'A' !                                00005820
                     STATUS_TYPE = 'I' !                                00005830
                     STATUS_TYPE = 'K' !   /* KS 6/12-84 */             00005840
                     STATUS_TYPE = 'C' THEN                             00005850
                     DO;                                                00005860
                                                                        00005870
 /* ***************************************************************** */00005880
 /* HVIS EKTEFELLEN ER I BASEN MEN IKKE HAR PENSJONSSTATUS            */00005890
 /* ***************************************************************** */00005900
                                                                        00005910
                        IF B01.FNR(EKTEF_IND) > 0 THEN                  00005920
                           DO;                                          00005930
                              CALL FLYTT_B01_TIL_B02 (EKTEF_IND);       00005940
                              IF FEIL_MELD_NR > 0 THEN                  00005950
                                 GO TO L999;                            00005960
                              B02.NAVN(EKTEF_IND)     =  U3S.NAVN_EK;   00005970
                              B02.TKNR(EKTEF_IND)     =  U3S.TKNR;      00005980
                           END;                                         00005990
                        ELSE                                            00006000
                                                                        00006010
 /* ***************************************************************** */00006020
 /* ROTSEGMENTOPPLYSNINGER.                                           */00006030
 /* ***************************************************************** */00006040
                                                                        00006050
                           DO;                                          00006060
                              B02.FNR (EKTEF_IND)     =  U3S.FNR_EK;    00006070
                              B02.NAVN(EKTEF_IND)     =  U3S.NAVN_EK;   00006080
                              B02.TKNR(EKTEF_IND)     =  U3S.TKNR;      00006090
                              B02.SPRÅK(EKTEF_IND)    =  U3S.SPRÅK;     00006100
                           END;                                         00006110
                                                                        00006120
                        CALL OPPRETT_STATUS_U3_SØKER;                   00006130
                        IF FEIL_MELD_NR > 0 THEN                        00006140
                           GO TO L999;                                  00006150
                                                                        00006160
                        IF B01.PENSJONSTYPE1(EKTEF_IND) = ' ' &         00006170
  /*0296 HL*/   B01.STATUS_KODE_HIST(EKTEF_IND) ^= 'X'   THEN           00006180
                           B02.FØRSTE_GANG_REG(EKTEF_IND) = 'J';        00006190
                                                                        00006200
                        CALL KOBLE_TO_PERSONER(SØKER_IND,               00006210
                                                      EKTEF_IND);       00006220
                     END;                                               00006230
                  ELSE                                                  00006240
                     DO;                                                00006250
                                                                        00006260
 /* ***************************************************************** */00006270
 /* HVIS EKTEFELLEN HAR PENSJONSSTATUS                                */00006280
 /* ***************************************************************** */00006290
                                                                        00006300
                        IF STATUS_TYPE = 'F' !                          00006310
                           STATUS_TYPE = 'H' THEN                       00006320
  L195:                                                                 00006330
                           DO;                                          00006340
                              FEIL_VED_LABEL = '195';                   00006350
                              FEIL_MELD_NR   = 1716;                    00006360
                              GO TO L999;                               00006370
                           END;                                         00006380
                        ELSE                                            00006390
                           DO;                                          00006400
                              FEIL_VED_LABEL = '195';                   00006410
                              FEIL_MELD_NR   = 1008;                    00006420
                              GO TO L999;                               00006430
                                                                        00006440
                           END;                                         00006450
                     END;                                               00006460
               END;                                                     00006470
            ELSE                                                        00006480
               DO;                                                      00006490
                  CALL OPPRETT_STATUS_U3_SØKER;                         00006500
                  IF FEIL_MELD_NR > 0 THEN                              00006510
                     GO TO L999;                                        00006520
               END;                                                     00006530
                                                                        00006540
         END; /*ER FLYTTET FØR TEST PÅ REDUSERT ANTALL_BUP_ÅR */        00006550
              /*TRUDE 270792                                  */        00006560
                                                                        00006570
 /*NY NORDISK KONVENSJON FRA 1.1.94 :       1195 HL   */                00006580
     HL_B02 = B02;                                                      00006590
     IF B02.TT_16_66(SØKER_IND) > 0 THEN                                00006600
        TT_NORSK_FAKTISK_MND = B02.TT_16_66(SØKER_IND);                 00006610
     ELSE                                                               00006620
        TT_NORSK_FAKTISK_MND  =  B02.TT_FØR_1967(SØKER_IND) * 12 +      00006630
                             B02.TT_ETTER_1966(SØKER_IND);              00006640
     DIV_PARAM_OMR.TT_NORSK_FAKTISK =                                   00006650
                        (TT_NORSK_FAKTISK_MND + 6) / 12;                00006660
     IF DIV_PARAM_OMR.TT_NORSK_FAKTISK > 40      THEN                   00006670
        DIV_PARAM_OMR.TT_NORSK_FAKTISK = 40;                            00006680
     HJ_TT_FRAMT = B02.TT_FRAMT(SØKER_IND);                             00006690
     DIV_PARAM_OMR.TT_NORSK_FRAMT = B02.TT_FRAMT(SØKER_IND);            00006700
                                                                        00006710
  /*     IF B02.TT_FAKTISK_NORDEN(SØKER_IND)   > 0         THEN         00006720
            B02.TT_FRAMT(SØKER_IND) = B02.TT_FRAMT(SØKER_IND) *         00006730
            DIV_PARAM_OMR.TT_NORSK_FAKTISK /                            00006740
            (DIV_PARAM_OMR.TT_NORSK_FAKTISK +                           00006750
              B02.TT_FAKTISK_NORDEN(SØKER_IND)) + 0.5;                  00006760
        HIT ***********/                                                00006770
                                                                        00006780
 /*LOVENDRING 1.1.91 - REDUSERT ANTALL BUP_ÅR - HL : */                 00006790
                                                                        00006800
     MAX_BUP = (HJ_TT_FRAMT + 6) / 12;                                  00006810
     /*TT_RED BLIR INITIERT I N824*/                                    00006820
     IF TT_RED = 'J'    &                 /*FEIL 8 - 9803 HL*/          00006830
        MAX_BUP < 40    THEN                                            00006840
        DO;                                                             00006850
            TIL_ÅR  = B02.UFØRHIST.UFT_ÅM(SØKER_IND,UF_IND) / 100       00006860
                      + MAX_BUP;                                        00006870
      /*    IF (ALDER_67.ÅR - 1) > TIL_ÅR         THEN      */          00006880
            IF (ALDER_67.ÅR) > TIL_ÅR         THEN                      00006890
               B02.UFØRHIST.REDUSERT_ANT_BUP_ÅR(SØKER_IND,UF_IND)       00006900
                   = MAX_BUP;                                           00006910
        END;                                                            00006920
 /* ************************************************************* */    00006930
 /* BARN TILKNYTTET SØKER MED L (FORSØRGEDE BARN)                 */    00006940
 /* ************************************************************* */    00006950
                                                                        00006960
  IF    B02.PENSJONSTYPE1(SØKER_IND) = 'U' !                            00006970
        B02.PENSJONSTYPE1(SØKER_IND) = 'Y' THEN                         00006980
                                                                        00006990
     DO;                                                                00007000
        B02.ANTALL_BARN(SØKER_IND) = 0;                                 00007010
        DO I = 1 TO 13 WHILE                                            00007020
                        (B02.TILKN.FNR_TILKN(SØKER_IND,I) > 0 );        00007030
           IF B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'L'  !          00007040
              B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'V'  !          00007050
              B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'W'  THEN       00007060
              B02.ANTALL_BARN(SØKER_IND) =                              00007070
                                 B02.ANTALL_BARN(SØKER_IND) + 1;        00007080
        END;                                                            00007090
     END;                                                               00007100
                                                                        00007110
                                                                        00007120
 /* ************************************************************* */    00007130
 /* NYTT UFØRE-TILFELLE . DET KAN ENDRE EN PERSONS POENG.         */    00007140
 /* DATA SKRIVES UT TIL NORTRYGD-KONTORENE .                      */    00007150
 /* ************************************************************* */    00007160
                                                                        00007170
  CALL P900_NOR_DATA ((B02.FNR(SØKER_IND)),(B02.TKNR(SØKER_IND)));      00007180
                                                                        00007190
  IF   FEIL_MELD_NR                 =  0                        THEN    00007200
       PROGRAM_ID                   = 'R001U620'                   ;    00007210
                                                                        00007220
  L999:                                                                 00007230
     EXEC CICS RETURN;                                                  00007240
                                                                        00007250
                                                                        00007260
                                                                        00007270
 %PAGE;                                                                 00007280
        %INCLUDE R001U621;  /* OPPRETT_STATUS_U3_SØKER   */             00007290
        %INCLUDE R001U622;  /* AJOURFØR B02 MED U3 TRANS */             00007300
        %INCLUDE R001U623;  /* UNGE UFØRE                */             00007310
        %INCLUDE R001N824;  /* F_BEREGN_TT_FRAMT_UTLAND  */             00007320
        %INCLUDE R0019703;  /* FKS_TIDSBEGR_ATTF         */             00007330
        %INCLUDE R0019704;  /* FKS_SKJERM_ATTF           */             00007340
        %INCLUDE R0019905;  /* REGN ALDER PR VIRKDATO    */             00007350
        %INCLUDE R0019913;  /* SNU DATO                  */             00007360
        %INCLUDE R0019923;  /* OPPRETT STATUS FOR BARN   */             00007370
        %INCLUDE R0019924;  /* KOBLE TO PERSONER         */             00007380
        %INCLUDE R0019926;  /* FLYTT B01 TIL B02         */             00007390
        %INCLUDE R0019957;  /* P900_NOR_DATA (FNR,TKNR)  */             00007400
        %INCLUDE R0019940;  /* UFØREPENSJON OPPHØRER     */             00007410
        %INCLUDE R0019934;  /* OPPHØR_KOBLING_TO_PERSONER*/             00007420
        %INCLUDE R0019954;  /* RULL_FORVENTET            */             00007430
        %INCLUDE R0019967;  /* RULL_FAI                  */             00007440
        %INCLUDE R0019968;  /* F_RULL_FORSI              */             00007450
                                                                        00007460
                                                                        00007470
   END U3TR;                                                            00007480
