 /*       SIST ENDRET 25/07-94 13.50.08 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 25/02-94 12.32.17 AV   HERMAN                   */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /*    R001UC02  -                                                    */00000030
 /*    PROGRAMMERER:                                                  */00000040
 /*HENSIKT:                                                           */00000050
 /*    R001UC02 INNHOLDER:                                            */00000060
 /*      PROSEDYRER FOR BLANKING AV FO_TRANS_OMR.                     */00000070
 /*ENDRING:                                                           */00000080
 /*    PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL          */00000090
 /*    FO_TRANS_OMR ER SKILT UT OG LAGT I R001UC09.                   */00000100
 /*PROGRAMTILKNYTNING:                                                */00000110
 /*    PROSEDYRENE INCLUDES I BEHANDLINGA AV FORSØRGINGSTILLEGG FOR   */00000120
 /*    EKTEFELLE OG /ELLER BARN TIL DET MASKINELLE                    */00000130
 /*    FOLKETRYGDSYSTEMET.                                            */00000140
 /*    ARBEIDSOMRÅDE: P001UC01                                        */00000150
 /*BRUK:                                                              */00000160
 /*    %INCLUDE R001UC02;                                             */00000170
 /*    BLANK_FO_SØKER:    BLANKER SØKERDELEN                          */00000180
 /*    BLANK_FO_BARN:     BLANKER BARNEDELEN                          */00000190
 /*    BLANK_FO_MELDNR:   SETTER 0 I MELDINGSNUMMERNE                 */00000200
 %PAGE;                                /*   */                          00000210
 /* ***************************************************************** */00000220
 /*                                                                   */00000230
 /*    PROSEDYREN BLANKER FO_SØKERDELEN I FO_TRANS_OMR I              */00000240
 /*    KOM_OMR FOR FORSØRGINGSTILLEGG EKTEFELLE OG/ELLER BARN.        */00000250
 /*                                                                   */00000260
 /* ***************************************************************** */00000270
 %SKIP(2);                             /*   */                          00000280
 BLANK_FO_SØKER:                                                        00000290
   PROC;                                                                00000300
      FOS.REGDATO = 0;                                                  00000310
      FOS.TERMID = '    ';                                              00000320
      FOS.FNR = 0;                                                      00000330
      FOS.FNR_GML = 0;                                                  00000340
      FOS.TKNR = 0;                                                     00000350
      FOS.TILL_EK = ' ';                                                00000360
      FOS.BT_ANT = 0;                                                   00000370
      FOS.VIRK_DATO_MÅ = 0;                                             00000380
      FOS.FNR_EK = 0;                                                   00000390
      FOS.FNR_GML_EK = 0;                                               00000400
      FOS.MINST_4G   = ' ';                                             00000410
                                                                        00000420
   END BLANK_FO_SØKER;                                                  00000430
 BLANK_FO_SØKER2:                                                       00000440
   PROC;                                                                00000450
      FOS.PENSJONSINNTEKT  = 0;                                         00000460
      FOS.ARBEIDSINNTEKT  = 0;                                          00000470
      FOS.PENSJONSINNTEKT_EK = 0;                                       00000480
      FOS.ARBEIDSINNTEKT_EK = 0;                                        00000490
   END BLANK_FO_SØKER2;                                                 00000500
 %PAGE;                                /*   */                          00000510
 /* ***************************************************************** */00000520
 /*                                                                   */00000530
 /*    PROSEDYREN BLANKER FO_BARNEDELEN I FO_TRANS_OMR I              */00000540
 /*    KOM_OMR FOR FORSØRGINGSTILLEGG FOR EKTEFELLE OG/ELLER BARN.    */00000550
 /*                                                                   */00000560
 /* ***************************************************************** */00000570
 %SKIP;                                                                 00000580
 BLANK_FO_BARN:                                                         00000590
   PROC;                                                                00000600
   DCL                                                                  00000610
      ANT_BARN FIXED BIN (15);                                          00000620
 %SKIP;                                                                 00000630
      DO ANT_BARN = 1 TO 12;                                            00000640
         FOB.FNR_BARN(ANT_BARN) = 0;                                    00000650
         FOB.FNR_GML_BARN(ANT_BARN) = 0;                                00000660
                                                                        00000670
         FOB.FELLES_ETTER0591(ANT_BARN) = ' ';                          00000680
         FOB.FELLES_FØR0591(ANT_BARN) = ' ';                            00000690
      END;                                                              00000700
   END BLANK_FO_BARN;                                                   00000710
 %PAGE;                                /* */                            00000720
 BLANK_FO_BARN_REST:                                                    00000730
   PROC;                                                                00000740
   DCL                                                                  00000750
      ANT_BARN FIXED BIN (15),                                          00000760
      WS       FIXED BIN (15);                                          00000770
 %SKIP;                                                                 00000780
      WS   = FOS.BT_ANT + 1;                                            00000790
      IF WS < 13  THEN                                                  00000800
      DO;                                                               00000810
         DO ANT_BARN = WS TO 12;                                        00000820
            FOB.FNR_BARN(ANT_BARN) = 0;                                 00000830
            FOB.FNR_GML_BARN(ANT_BARN) = 0;                             00000840
                                                                        00000850
            FOB.FELLES_ETTER0591(ANT_BARN) = ' ';                       00000860
            FOB.FELLES_FØR0591(ANT_BARN) = ' ';                         00000870
        END;                                                            00000880
     END;                                                               00000890
   END BLANK_FO_BARN_REST;                                              00000900
 %PAGE;                                /* */                            00000910
 /* ***************************************************************** */00000920
 /*                                                                   */00000930
 /*    PROSEDYRE FOR Å SETTE 0  MELDINGSNUMMERNE I FO_TRANS_OMR I     */00000940
 /*    KOM_OMR.                                                       */00000950
 /*                                                                   */00000960
 /* ***************************************************************** */00000970
 %SKIP(2);                                                              00000980
 BLANK_FO_MELDNR:                                                       00000990
   PROC;                                                                00001000
   DCL                                                                  00001010
      ANT_BARN FIXED BIN (15);                                          00001020
 %SKIP(2);                                                              00001030
 /*  0 I MELDINGSNUMMERNE I  SØKERDELEN   */                            00001040
 %SKIP(2);                                                              00001050
      FOS.REGDATONR = 0;                                                00001060
      FOS.TERMIDNR = 0;                                                 00001070
      FOS.FNRNR = 0;                                                    00001080
      FOS.TKNRNR = 0;                                                   00001090
      FOS.TILL_EKNR = 0;                                                00001100
      FOS.BT_ANTNR = 0;                                                 00001110
      FOS.VIRK_DATO_MÅNR = 0;                                           00001120
      FOS.FNR_EKNR = 0;                                                 00001130
      FOS.MINST_4GNR = 0;                                               00001140
      FOS.PENSJONSINNTEKTNR = 0;                                        00001150
      FOS.ARBEIDSINNTEKTNR = 0;                                         00001160
      FOS.PENSJONSINNTEKT_EKNR = 0;                                     00001170
      FOS.ARBEIDSINNTEKT_EKNR = 0;                                      00001180
 %SKIP(2);                             /*  */                           00001190
 /*  0 I MELDINGSNUMMERNE I  BARNEDELEN   */                            00001200
 %SKIP(2);                                                              00001210
      DO ANT_BARN = 1 TO 12;                                            00001220
         FOB.FNR_BARNNR(ANT_BARN) = 0;                                  00001230
         FOB.FELLES_ETTER0591NR(ANT_BARN) = 0;                          00001240
         FOB.FELLES_FØR0591NR(ANT_BARN) = 0;                            00001250
      END;                                                              00001260
   END BLANK_FO_MELDNR;                                                 00001270
