 /*       SIST ENDRET 29/03-88 13.25.28 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 08/10-82 14.02.58 AV   LUNDEBY                  */00000010
 /*       SIST ENDRET 20/09-82 11.55.09 AV   OLSEN                    */00000020
 /*       SIST ENDRET 10/09-82 11.55.56 AV   HELEN                    */00000030
 /*       SIST ENDRET 09/09-82 14.20.02 AV   HELEN                    */00000040
 /*       SIST ENDRET 23/08-82 12.45.39 AV   OLAV                     */00000050
 /*       SIST ENDRET 23/08-82 09.57.02 AV   OLAV                     */00000060
 /* **************************************************************** */ 00000070
 /* IDENTIFIKASJON:   R0017201                                       */ 00000080
 /* PROGRAMMERER:  HELEN    JULI, 1982                              */  00000090
 /* HENSIKT:                                                         */ 00000100
 /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT     */ 00000110
 /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER         */ 00000120
 /*        HVER AJOURFØRT TRANSAKSJON.                               */ 00000130
 /* PROGRAMTILKNYTNING:                                              */ 00000140
 /*        PROGRAMMET KALLES OPP AV R0017001                         */ 00000150
 /*                                                                  */ 00000160
 /* **************************************************************** */ 00000170
 LAG_BARNEP_EN_HEND:                                                    00000180
      PROC (B_IND) ;                                                    00000190
 DCL  B_IND        FIXED BIN(15);                                       00000200
 DCL  IND          FIXED BIN(15);                                       00000210
 DCL  Y_BARN_IND   FIXED BIN(15);                                       00000220
 /* **************************************************************** */ 00000230
 /* PROGRAMMET BEGYNNER HER.                                         */ 00000240
 /* VI BLANKER W_HENDELSE OG  FINNER YNGSTE BARN.                    */ 00000250
 /* **************************************************************** */ 00000260
    W_HENDELSE            = '';                                         00000270
    DO IND = 3 TO 14;                                                   00000280
 /*   ENDRET 15.03.88   SATISH                                      */  00000290
 /*    IF B02.PERSON.STATUS.PENSJONSTYPE2(IND) = 'Y' THEN           */  00000300
 /*   HITTIL                                                        */  00000310
       IF B02.PERSON.STATUS.PENSJONSTYPE2(IND) = 'P' &                  00000320
         (B02.PERSON.STATUS.PENSJONSTYPE1(IND) = 'B' !                  00000330
          B02.PERSON.STATUS.PENSJONSTYPE1(IND) = 'N' )  THEN            00000340
          DO;                                                           00000350
             Y_BARN_IND = IND;                                          00000360
             IND = 14;                                                  00000370
          END;                                                          00000380
    END;                                                                00000390
    W_HENDELSE.HENDDATO   =    B02.PERSON.STATUS.VIRK_DATO_ÅM(B_IND);   00000400
    W_HENDELSE.VERSJON    =    W_ROT.NESTE_SB_VERSJON_NR;               00000410
    W_HENDELSE.TERMINAL   =    EIBLK.EIBTRMID;                          00000420
    IF B02.PERSON.STATUS.PENSJONSTYPE3(B_IND) = 'U'     THEN            00000430
       DO;                                                              00000440
       W_HENDELSE.GP_BRUTTO = B02.PERSON.UFØRPENS.GP(B_IND);            00000450
       W_HENDELSE.GP_NETTO  = B02.PERSON.UFØRPENS.GP(B_IND);            00000460
       W_HENDELSE.TP_BRUTTO = B02.PERSON.UFØRPENS.TP(B_IND);            00000470
       W_HENDELSE.TP_NETTO  = B02.PERSON.UFØRPENS.TP(B_IND);            00000480
       W_HENDELSE.ST        = B02.PERSON.UFØRPENS.ST(B_IND);            00000490
       W_HENDELSE.KT        = B02.PERSON.UFØRPENS.KT(B_IND);            00000500
       W_HENDELSE.UF_GRAD   = B02.PERSON.UFØRPENS.UFG(B_IND);           00000510
       END;                                                             00000520
    ELSE                                                                00000530
       DO;                                                              00000540
       W_HENDELSE.GP_BRUTTO  =    B02.PERSON.ETTEBARN.GP(B_IND);        00000550
       W_HENDELSE.GP_NETTO   =    B02.PERSON.ETTEBARN.GP(B_IND);        00000560
       END;                                                             00000570
    W_HENDELSE.ANTALL_BARN = B02.PERSON.STATUS.ANTALL_BARN(Y_BARN_IND); 00000580
    W_HENDELSE.ANTALL_BARN_TIDL = B01.PERSON.STATUS.ANTALL_BARN(3);     00000590
    W_HENDELSE.TT          = B02.PERSON.STATUS.TT_ANV(B_IND);           00000600
    CALL PLASSER_TEKSTTYPE_A_KODE;                                      00000610
 /* CALL  PLASSER_TEKSTYPE_B2_KODE */                                   00000620
    W_HENDELSE.TEKSTYPE_B2_KODE  = 9;                                   00000630
 /* CALL  PLASSER_TEKSTYPE_C_KODE  */                                   00000640
    W_HENDELSE.TEKSTYPE_C_KODE  = 9;                                    00000650
 /* **************************************************************** */ 00000660
 /* HENDELSE SEGMENT SKRIVES UT.                                     */ 00000670
 /* **************************************************************** */ 00000680
    CALL INSERT_HENDELSE;                                               00000690
 /* **************************************************************** */ 00000700
 /*VI OPPBEVARER NØKKEL TIL HENDELSE SEGMENT I TILFELLE VI MÅ FJERNE */ 00000710
 /*DEN DERSOM DET OPPSTÅR FEIL VED BEHANDLING AV SENERE HENDELSER.   */ 00000720
 /* **************************************************************** */ 00000730
 /* IF W_HENDELSE.TP > 0  THEN                                       */ 00000740
 /*    CALL BYGG_OPP_BEREGNINGS_VEDLEGG_SEGMENT                      */ 00000750
 END  LAG_BARNEP_EN_HEND;                                               00000760
