 /*       SIST ENDRET 10/03-87 08.56.22 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 08/09-83 12.32.49 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 04/03-83 12.30.04 AV   KARIN                    */00000020
 /*       SIST ENDRET 03/03-83 13.47.51 AV   KARIN                    */00000030
 /*       SIST ENDRET 01/03-83 10.38.18 AV   KARIN                    */00000040
 /*       SIST ENDRET 28/02-83 16.34.07 AV   KARIN                    */00000050
 /*       SIST ENDRET 28/02-83 13.01.54 AV   KARIN                    */00000060
 /*       SIST ENDRET 14/10-82 15.29.42 AV   FARVIK                   */00000070
 /*       SIST ENDRET 14/10-82 09.12.05 AV   PERB                     */00000080
 /*       SIST ENDRET 13/10-82 16.53.34 AV   PERB                     */00000090
 /*       SIST ENDRET 11/10-82 12.08.47 AV   FARVIK                   */00000100
  /* **************************************************************** */00000110
  /*IDENTIFIKASJON:                                                   */00000120
  /*    R0010905 - PROSEDYRE I PLI                                    */00000130
  /*    PROGRAMMERER: GEIR, JULI 1981                                 */00000140
  /*HENSIKT:                                                          */00000150
  /*    PROSEDYREN KONTROLLERER DATA I SPESIELLE OPPLYSNINGER         */00000160
  /*    FOR ETTERLATT FAMILIEPLEIER.                                  */00000170
  /*BRUK:                                                             */00000180
  /*    CALL KONTROLL_EF_SPES(FEIL_FUNNET);                           */00000190
  /*PARAMETRE INN:                                                    */00000200
  /*    INGEN, MEN BRUKER EFSP DATAENE I EF_TRANS_OMR.                */00000210
  /*PARAMETRE UT:                                                     */00000220
  /*    FEIL_FUNNET                                                   */00000230
  /* **************************************************************** */00000240
  %SKIP;                                                                00000250
  /* **************************************************************** */00000260
  /*                                                                  */00000270
  /*   MODULEN KONTROLLERER ETTERLATT FAMILIEPLEIER SPESIELLE         */00000280
  /*   OPPLYSNINGER OM SØKEREN OG RETURNERER MED FEIL_FUNNET = '1'B   */00000290
  /*   HVIS FEIL, '0'B HVIS RIKTIG.                                   */00000300
  /*                                                                  */00000310
  /* **************************************************************** */00000320
                                                                        00000330
  KONTROLL_EF_SPES:                                                     00000340
    PROC(FEIL_FUNNET);                                                  00000350
    DCL                                                                 00000360
       FEIL_FUNNET      BIT (1);                                        00000370
   DCL                                                                  00000380
      KEY_BIT1                   BIT(32) BASED (KEY_PEKER1),            00000390
      KEY_BIT2                   BIT(32) BASED (KEY_PEKER2),            00000400
      KEY_PEKER1                 POINTER,                               00000410
      KEY_PEKER2                 POINTER,                               00000420
      ST_RECL                    CHAR (35);                             00000430
    DCL T_FNR           PIC'(11)9';                                     00000440
    DCL 1 FNR DEF T_FNR,                                                00000450
        2 DG PIC'99',                                                   00000460
        2 MN PIC'99',                                                   00000470
        2 ÅR PIC'99',                                                   00000480
        2 PERSNR,                                                       00000490
          3 ÅRHUNDRE    PIC'999',                                       00000500
          3 REST        PIC'99';                                        00000510
    DCL                                                                 00000520
        FYLT_SEKSTISJU  PIC'9999';                                      00000530
    DCL                                                                 00000540
        MAKS_FRAMT_TT   PIC'9999',                                      00000550
        FRAMT_TT_ÅR     PIC'9999';                                      00000560
    DCL                                                                 00000570
       ALDER            FIXED DEC(5),                                   00000580
       DATO             PIC'9999';                                      00000590
                                                                        00000600
    DCL                                                                 00000610
       MAKS_TT_FØR_1967 PIC'99',                                        00000620
       TT_TIL_TPK       PIC'9999',                                      00000630
       TT_E66_ÅM        PIC'9999';                                      00000640
                                                                        00000650
    KEY_PEKER1          = ADDR(EFSP.STATSBORGER);                       00000660
    KEY_PEKER2          = ADDR(EFSP.BOSATT);                            00000670
    T_FNR               = EFS.FNR;                                      00000680
    TT_E66_ÅM           = (EFSP.TT_E66_Å * 100) + EFSP.TT_E66_M;        00000690
                                                                        00000700
  %SKIP;                                                                00000710
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(EFSP.STATSBORGER)) THEN            00000720
       DO;                                                              00000730
          FEIL_FUNNET        = '1'B;                                    00000740
          EFSP.STATSBORGERNR = 200;                                     00000750
       END;                                                             00000760
    ELSE                                                                00000770
       DO;                                                              00000780
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND1);               00000790
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT1)       00000800
                                               INTO(ST_RECL);           00000810
              GOTO STAT_UT;                                             00000820
          NOTFND1:                                                      00000830
              FEIL_FUNNET        = '1'B;                                00000840
              EFSP.STATSBORGERNR = 24;                                  00000850
              LEAVE;                                                    00000860
          STAT_UT:                                                      00000870
       END;                                                             00000880
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(EFSP.BOSATT)) THEN                 00000890
       DO;                                                              00000900
          FEIL_FUNNET   = '1'B;                                         00000910
          EFSP.BOSATTNR = 200;                                          00000920
       END;                                                             00000930
    ELSE                                                                00000940
       DO;                                                              00000950
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND2);               00000960
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT2)       00000970
                                               INTO(ST_RECL);           00000980
              GOTO BO_UT;                                               00000990
          NOTFND2:                                                      00001000
              FEIL_FUNNET   = '1'B;                                     00001010
              EFSP.BOSATTNR = 25;                                       00001020
              LEAVE;                                                    00001030
          BO_UT:                                                        00001040
        END;                                                            00001050
    IF VERIFY(EFSP.FRAVIK_BOSATT,'JN ') ^= 0 THEN                       00001060
       DO;                                                              00001070
          FEIL_FUNNET          = '1'B;                                  00001080
          EFSP.FRAVIK_BOSATTNR = 160;                                   00001090
       END;                                                             00001100
    IF VERIFY(EFSP.TRYGDET_3ÅR,'JN') ^= 0 THEN                          00001110
       DO;                                                              00001120
          FEIL_FUNNET        = '1'B;                                    00001130
          EFSP.TRYGDET_3ÅRNR = 56;                                      00001140
       END;                                                             00001150
    IF VERIFY(EFSP.FRA_TRY_3ÅR,'J ') ^= 0 THEN                          00001160
       DO;                                                              00001170
          FEIL_FUNNET        = '1'B;                                    00001180
          EFSP.FRA_TRY_3ÅRNR = 120;                                     00001190
       END;                                                             00001200
    IF VERIFY(EFSP.FRAVIK_10_1,'J ') ^= 0 THEN                          00001210
       DO;                                                              00001220
          FEIL_FUNNET        = '1'B;                                    00001230
          EFSP.FRAVIK_10_1NR = 78;                                      00001240
       END;                                                             00001250
    IF VERIFY(EFSP.KONVENSJON,'J ') ^= 0 THEN                           00001260
       DO;                                                              00001270
          FEIL_FUNNET       = '1'B;                                     00001280
          EFSP.KONVENSJONNR = 125;                                      00001290
       END;                                                             00001300
    IF EFSP.FRAVIK_19_3 ^= ' ' THEN                                     00001310
       IF VERIFY(EFSP.FRAVIK_19_3,'012345678') ^= 0 THEN                00001320
          DO;                                                           00001330
             FEIL_FUNNET        = '1'B;                                 00001340
             EFSP.FRAVIK_19_3NR = 28;                                   00001350
          END;                                                          00001360
    IF VERIFY(EFSP.FRAVIK_FLYKT,'J ') ^= 0 THEN                         00001370
       DO;                                                              00001380
          FEIL_FUNNET         = '1'B;                                   00001390
          EFSP.FRAVIK_FLYKTNR = 26;                                     00001400
       END;                                                             00001410
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(EFSP.TT_ETTER_OPPHØR)) THEN        00001420
       DO;                                                              00001430
          FEIL_FUNNET            = '1'B;                                00001440
          EFSP.TT_ETTER_OPPHØRNR = 200;                                 00001450
       END;                                                             00001460
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR2(EFSP.TT_F67)) THEN                 00001470
       DO;                                                              00001480
          FEIL_FUNNET   = '1'B;                                         00001490
          EFSP.TT_F67NR = 200;                                          00001500
       END;                                                             00001510
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR2(EFSP.TT_E66_Å)) THEN               00001520
       DO;                                                              00001530
          FEIL_FUNNET     = '1'B;                                       00001540
          EFSP.TT_E66_ÅNR = 200;                                        00001550
       END;                                                             00001560
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR2(EFSP.TT_E66_M)) THEN               00001570
       DO;                                                              00001580
          FEIL_FUNNET     = '1'B;                                       00001590
          EFSP.TT_E66_MNR = 200;                                        00001600
       END;                                                             00001610
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR2(EFSP.TT_FRAMT_10_1)) THEN          00001620
       DO;                                                              00001630
          FEIL_FUNNET          = '1'B;                                  00001640
          EFSP.TT_FRAMT_10_1NR = 200;                                   00001650
       END;                                                             00001660
  %PAGE;                                                                00001670
  /* **************************************************************** */00001680
  /*   KRYSSKONTROLLER                                                */00001690
  /*                                                                  */00001700
  /* **************************************************************** */00001710
  %SKIP;                                                                00001720
  IF ^FEIL_FUNNET THEN                                                  00001730
     DO;                                                                00001740
        ALDER           = F_ALDER(EFS.FNR,EFS.VIRK_DATO_MÅ);            00001750
        IF EFSP.BOSATT = 0 & EFSP.FRAVIK_BOSATT = 'J' THEN              00001760
           DO;                                                          00001770
              FEIL_FUNNET          = '1'B;                              00001780
              EFSP.BOSATTNR        = 110;                               00001790
              EFSP.FRAVIK_BOSATTNR = 999;                               00001800
           END;                                                         00001810
                                                                        00001820
                                                                        00001830
                                                                        00001840
        IF EFSP.FRAVIK_BOSATT = 'N' &(EFSP.TT_F67 > 0 !                 00001850
           EFSP.TT_E66_Å > 0 ! EFSP.TT_E66_M > 0) THEN                  00001860
           DO;                                                          00001870
              FEIL_FUNNET          = '1'B;                              00001880
              EFSP.FRAVIK_BOSATTNR = 143;                               00001890
              EFSP.TT_F67NR        = 999;                               00001900
              EFSP.TT_E66_ÅNR      = 999;                               00001910
              EFSP.TT_E66_MNR      = 999;                               00001920
           END;                                                         00001930
        IF EFSP.FRAVIK_10_1 = ' ' & EFSP.TT_FRAMT_10_1 > 0 THEN         00001940
           DO;                                                          00001950
              FEIL_FUNNET          = '1'B;                              00001960
              EFSP.FRAVIK_10_1NR   = 237;                               00001970
              EFSP.TT_FRAMT_10_1NR = 999;                               00001980
           END;                                                         00001990
        IF EFSP.FRAVIK_10_1 = 'J' & EFSP.KONVENSJON = 'J' THEN          00002000
           DO;                                                          00002010
              FEIL_FUNNET          = '1'B;                              00002020
              EFSP.FRAVIK_10_1NR   = 155;                               00002030
              EFSP.KONVENSJONNR    = 999;                               00002040
           END;                                                         00002050
   /*   IF EFSP.BOSATT > 0 & (EFSP.FRAVIK_BOSATT = ' ' &                00002060
                              EFSP.KONVENSJON = ' ') THEN               00002070
           DO;                                                          00002080
              FEIL_FUNNET          = '1'B;                              00002090
              EFSP.FRAVIK_BOSATTNR = 128;                               00002100
              EFSP.BOSATTNR        = 999;                               00002110
              EFSP.KONVENSJONNR    = 999;                               00002120
           END;                                                         00002130
        IF EFSP.BOSATT > 0 & (EFSP.FRAVIK_BOSATT = 'N' &                00002140
                              EFSP.KONVENSJON = ' ') THEN               00002150
           DO;                                                          00002160
              FEIL_FUNNET          = '1'B;                              00002170
              EFSP.FRAVIK_BOSATTNR = 128;                               00002180
              EFSP.BOSATTNR        = 999;                               00002190
              EFSP.KONVENSJONNR    = 999;                               00002200
           END;                                       */                00002210
        IF EFSP.TRYGDET_3ÅR = 'J' THEN                                  00002220
           DO;                                                          00002230
             IF EFSP.FRA_TRY_3ÅR = 'J' THEN                             00002240
                DO;                                                     00002250
                  FEIL_FUNNET          = '1'B;                          00002260
                  EFSP.TRYGDET_3ÅRNR   = 103;                           00002270
                  EFSP.FRA_TRY_3ÅRNR   = 999;                           00002280
                END;                                                    00002290
           END;                                                         00002300
        ELSE     /* TRYGDET_3ÅR = N  */                                 00002310
           DO;                                                          00002320
             IF EFSP.FRA_TRY_3ÅR = 'J' & EFSP.KONVENSJON = 'J' THEN     00002330
                DO;                                                     00002340
                  FEIL_FUNNET         = '1'B;                           00002350
                  EFSP.FRA_TRY_3ÅRNR  = 105;                            00002360
                  EFSP.KONVENSJONNR   = 999;                            00002370
                END;                                                    00002380
     /*      IF EFSP.FRA_TRY_3ÅR = ' ' & EFSP.KONVENSJON = ' ' THEN     00002390
                DO;                                                     00002400
                  FEIL_FUNNET         = '1'B;                           00002410
                  EFSP.TRYGDET_3ÅRNR  = 147;                            00002420
                  EFSP.FRA_TRY_3ÅRNR  = 999;                            00002430
                  EFSP.KONVENSJONNR   = 999;                            00002440
                END;                               */                   00002450
           END;                                                         00002460
                                                                        00002470
  /* **************************************************** */            00002480
  /* 0 I TT SKAL IKKE GÅ AN.                              */            00002490
  /* ERIK 22.12.86.                                       */            00002500
  /* **************************************************** */            00002510
                                                                        00002520
                                                                        00002530
                                                                        00002540
                                                                        00002550
        IF EFSP.TRYGDET_3ÅR = 'N' &                                     00002560
           (EFSP.FRA_TRY_3ÅR = ' ' !                                    00002570
            EFSP.FRA_TRY_3ÅR = 'N') &                                   00002580
           EFSP.TT_F67 = 0 &                                            00002590
           EFSP.TT_E66_Å = 0 &                                          00002600
           EFSP.TT_E66_M = 0  THEN                                      00002610
           DO;                                                          00002620
              FEIL_FUNNET          = '1'B;                              00002630
              EFSP.TRYGDET_3ÅRNR   = 147;                               00002640
              EFSP.FRA_TRY_3ÅRNR   = 999;                               00002650
           END;                                                         00002660
                                                                        00002670
                                                                        00002680
                                                                        00002690
                                                                        00002700
        IF ^FEIL_FUNNET THEN                                            00002710
           DO;                                                          00002720
             IF EFSP.TRYGDET_3ÅR = 'J' & EFSP.BOSATT = 0 &              00002730
                EFSP.KONVENSJON = 'J' THEN                              00002740
                DO;                                                     00002750
                  FEIL_FUNNET          = '1'B;                          00002760
                  EFSP.BOSATTNR        = 240;                           00002770
                  EFSP.TRYGDET_3ÅRNR   = 999;                           00002780
                  EFSP.KONVENSJONNR    = 999;                           00002790
                END;                                                    00002800
             IF EFSP.FRAVIK_BOSATT = 'N' &                              00002810
                EFSP.KONVENSJON = 'J' THEN                              00002820
                DO;                                                     00002830
                  FEIL_FUNNET          = '1'B;                          00002840
                  EFSP.FRAVIK_BOSATTNR = 105;                           00002850
                  EFSP.KONVENSJONNR    = 999;                           00002860
                END;                                                    00002870
             IF EFSP.FRAVIK_BOSATT = 'J' &                              00002880
                EFSP.KONVENSJON = 'J' THEN                              00002890
                DO;                                                     00002900
                  FEIL_FUNNET          = '1'B;                          00002910
                  EFSP.FRAVIK_BOSATTNR = 189;                           00002920
                  EFSP.KONVENSJONNR    = 999;                           00002930
                END;                                                    00002940
             IF EFSP.BOSATT = 0 &                                       00002950
                EFSP.FRAVIK_10_1 = 'J' THEN                             00002960
                DO;                                                     00002970
                  FEIL_FUNNET          = '1'B;                          00002980
                  EFSP.TRYGDET_3ÅRNR   = 141;                           00002990
                  EFSP.FRAVIK_BOSATTNR = 999;                           00003000
                  EFSP.FRAVIK_10_1NR   = 999;                           00003010
                END;                                                    00003020
           END;    /* FEIL_FUNNET  */                                   00003030
        IF (FNR.ÅR + 1900 + 16 > 1967) & EFSP.FRAVIK_19_3 ^= ' ' THEN   00003040
           DO;                                                          00003050
              FEIL_FUNNET          = '1'B;                              00003060
              EFSP.FRAVIK_19_3NR   = 102;                               00003070
           END;                                                         00003080
        IF EFSP.FRAVIK_19_3 ^= ' ' & EFSP.BOSATT = '000' THEN           00003090
           DO;                                                          00003100
              FEIL_FUNNET          = '1'B;                              00003110
              EFSP.FRAVIK_19_3NR   = 27;                                00003120
              EFSP.BOSATTNR        = 999;                               00003130
           END;                                                         00003140
        IF EFSP.FRAVIK_19_3 = '0'  & EFSP.TT_F67 ^= 0 THEN              00003150
           DO;                                                          00003160
              FEIL_FUNNET          = '1'B;                              00003170
              EFSP.FRAVIK_19_3NR   = 83;                                00003180
              EFSP.TT_F67NR        = 999;                               00003190
           END;                                                         00003200
        IF EFSP.TT_E66_M > 12 THEN                                      00003210
           DO;                                                          00003220
              FEIL_FUNNET     = '1'B;                                   00003230
              EFSP.TT_E66_MNR = 112;                                    00003240
           END;                                                         00003250
                                                                        00003260
        CALL TT_UP_EP(EFS.FNR,EFS.VIRK_DATO_MÅ,MAKS_TT_FØR_1967,        00003270
                                                           TT_TIL_TPK); 00003280
        IF EFSP.TT_F67 > MAKS_TT_FØR_1967 THEN                          00003290
           DO;                                                          00003300
              FEIL_FUNNET     = '1'B;                                   00003310
              EFSP.TT_F67NR   = 31;                                     00003320
           END;                                                         00003330
        IF TT_E66_ÅM > TT_TIL_TPK THEN                                  00003340
           DO;                                                          00003350
              FEIL_FUNNET     = '1'B;                                   00003360
              EFSP.TT_E66_ÅNR = 112;                                    00003370
              EFSP.TT_E66_MNR = 999;                                    00003380
           END;                                                         00003390
        IF EFSP.FRAVIK_19_3 = '3' THEN                                  00003400
           IF EFSP.TT_F67 + EFSP.TT_E66_Å < 40 ! ALDER < 6200 THEN      00003410
              DO;                                                       00003420
                 FEIL_FUNNET          = '1'B;                           00003430
                 EFSP.FRAVIK_19_3NR   = 86;                             00003440
                 EFSP.TT_F67NR        = 999;                            00003450
              END;                                                      00003460
           IF EFSP.TT_FRAMT_10_1 ^= 0 THEN                              00003470
              DO;                                                       00003480
                 MAKS_FRAMT_TT    = 6700 - ALDER;                       00003490
                 FRAMT_TT_ÅR      = EFSP.TT_FRAMT_10_1 * 100;           00003500
                 IF FRAMT_TT_ÅR  >= MAKS_FRAMT_TT THEN                  00003510
                    DO;                                                 00003520
                       FEIL_FUNNET          = '1'B;                     00003530
                       EFSP.TT_FRAMT_10_1NR = 80;                       00003540
                    END;                                                00003550
              END;                                                      00003560
           IF EFSP.FRAVIK_FLYKT = 'J' & (EFSP.TT_F67 > 0 !              00003570
                            EFSP.TT_E66_Å > 0 ! EFSP.TT_E66_M > 0) THEN 00003580
              DO;                                                       00003590
                 FEIL_FUNNET         = '1'B;                            00003600
                 EFSP.FRAVIK_FLYKTNR = 157;                             00003610
              END;                                                      00003620
     END; /* FOR ^FEIL_FUNNET */                                        00003630
  END KONTROLL_EF_SPES;                                                 00003640
