 /*       SIST ENDRET 14/01-93 14.16.33 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 27/02-92 14.06.13 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 06/09-90 13.34.28 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 13/08-90 14.08.13 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 03/08-90 14.33.24 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 14/03-90 14.37.19 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 08/11-89 14.44.01 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 16/10-89 12.46.17 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 14/04-89 13.56.52 AV   HERMAN                   */00000080
 /*       SIST ENDRET 02/09-86 12.02.08 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 07/02-85 17.47.02 AV   GRAESMO                  */00000100
 /*       SIST ENDRET 08/01-85 09.06.44 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 20/01-84 11.02.09 AV   GRAESMO                  */00000120
 /* **************************************************************** */ 00000130
 /* IDENTIFIKASJON:  R0019055                                        */ 00000140
 /* PROGRAMMERER :   GRÆSMO  DESEMBER 1982                           */ 00000150
 /* HENSIKT:                                                         */ 00000160
 /*        BESTEMMER HVILKEN T_TEKST SOM SKAL SKRIVES PÅ STØNADS-    */ 00000170
 /*        BREVET OG HVILE VARIABLE SOM SKAL INNSKYTES PÅ SKRIVELINJA*/ 00000180
 /*        GJELDER      -TEKSTBASE.                                  */ 00000190
 /* PROGRAM TILKNYTNING:                                             */ 00000200
 /*        PROGRAM INCLUDES I R0019001(REDIGERING_AV_STØNADSPAKKE)   */ 00000210
 /*                                                                  */ 00000220
 /*                                                                  */ 00000230
 /* **************************************************************** */ 00000240
                                                                        00000250
 BESTEMME_T_TEKST:                                                      00000260
    PROC OPTIONS(REENTRANT);                                            00000270
                                                                        00000280
    /* ************************************************************* */ 00000290
    /*                                                               */ 00000300
    /* BESTEMMER OG STYRER UTSKRIFT AV T ---TEKSTER                  */ 00000310
    /*                                                               */ 00000320
    /* ************************************************************* */ 00000330
    DCL IDAG_ÅM                                 CHAR(4); /*JD 11.89*/   00000340
    DCL HJ_FRDATO                               CHAR(4); /*JD 11.89*/   00000350
    DCL 1 W_FRDATO,                                                     00000360
          2 MND                        CHAR(2),                         00000370
          2 ÅR                         CHAR(2);                         00000380
    DCL W_FRDATO_D DEF W_FRDATO        CHAR(4);                         00000390
    IDAG_ÅM                        = DATO.ÅR!!DATO.MND; /*JD 11.89*/    00000400
    OM_TEKSTTYPE_T_KODE(*)                       =   '';                00000410
    TT_IND1                                      =   1;                 00000420
    TT_IND2                                      =   2;                 00000430
    STCX_TEKST                                   =   '';                00000440
    FELLES_LINJE                                 =   STCX_LINJE_D;      00000450
    CALL                   SKRIV_STØNADSBREV;            /* R0019051 */ 00000460
  /* PUT EDIT ('ENGANGSBELOEP = ', OM_YRKE_ENGANGSBELØP_11_7(TT_IND1))  00000470
             (SKIP,A,P'9999999');                                       00000480
    PUT EDIT ('ENGANGSBELOP2 = ', OM_YRKE_ENGANGSBELØP_11_7(TT_IND2))   00000490
             (SKIP,A,P'9999999'); */                                    00000500
       IF (OM_PENSJONSTYPE1(TT_IND1)             =  'Y')  &    /*YS*/   00000510
          (OM_YRKE_UFG(TT_IND1)  ^= OM_UF_GRAD (TT_IND1)) &    /*YS*/   00000520
          (OM_TEKSTTYPE_A_KODE(TT_IND1) ^= 'A323'         &    /*YS*/   00000530
           OM_TEKSTTYPE_A_KODE(TT_IND1) ^= 'A079'         &    /*YS*/   00000540
           OM_TEKSTTYPE_A_KODE(TT_IND1) ^= 'A045'         &    /*YS*/   00000550
           OM_TEKSTTYPE_A_KODE(TT_IND1) ^= 'A331')        THEN /*YS*/   00000560
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T313';    /*YS*/   00000570
                                                                        00000580
  /*   IF (OM_PENSJONSTYPE1(TT_IND1)             =  'E')   &            00000590
          (OM_PENSJONSTYPE2(TT_IND1)             =  'P')   &            00000600
          (OM_DØD_AV_YSKADE(TT_IND1)             =  'E') THEN           00000610
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T311';    */       00000620
                                                                        00000630
                                                                        00000640
    /* IF (OM_PENSJONSTYPE1(TT_IND1)             =  'E')   &            00000650
          (OM_PENSJONSTYPE2(TT_IND1)             =  'O')   &            00000660
          (OM_DØD_AV_YSKADE(TT_IND1)             =  'E')  THEN          00000670
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T312';   */        00000680
                                                                        00000690
    /* IF((OM_PENSJONSTYPE1(TT_IND1)             =  'A')   !            00000700
          (OM_PENSJONSTYPE1(TT_IND1)             =  'U'))  &            00000710
          (OM_DØD_AV_YSKADE(TT_IND1)             =  'E') THEN           00000720
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T306';        */   00000730
                                                                        00000740
                                                                        00000750
    DO WHILE ( TT_IND2    <=   OM_TELLER);                              00000760
                                                                        00000770
       IF (OM_PENSJONSTYPE1(TT_IND1)             =  'Y')   &   /*YS*/   00000780
          (OM_PENSJONSTYPE1(TT_IND2)             =  'A')  THEN /*YS*/   00000790
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T301';    /*YS*/   00000800
                                                                        00000810
                                                                        00000820
       IF (OM_PENSJONSTYPE1(TT_IND1)            ^=  'A')   &            00000830
          (OM_PENSJONSTYPE1(TT_IND2)             =  'A')  THEN          00000840
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T001';             00000850
                                                                        00000860
       IF (OM_PENSJONSTYPE1(TT_IND1)             =  'K')   &   /*AFP*/  00000870
          (OM_PENSJONSTYPE1(TT_IND2)             =  'A')  THEN /*AFP*/  00000880
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T001';    /*AFP*/  00000890
                                                                        00000900
       IF (OM_PENSJONSTYPE1(TT_IND1)!!                                  00000910
           OM_PENSJONSTYPE2(TT_IND1)             =  'AE')  &            00000920
          (OM_PENSJONSTYPE1(TT_IND2)!!                                  00000930
           OM_PENSJONSTYPE2(TT_IND2)             =  'AP')  THEN         00000940
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T016';             00000950
                                                                        00000960
       IF (OM_PENSJONSTYPE1(TT_IND1)             =  'E')   &            00000970
          (OM_PENSJONSTYPE1(TT_IND2)             =  'U')   THEN         00000980
          IF OM_PENSJONSTYPE3(TT_IND2)             =  'A'   THEN        00000990
             OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T013';           00001000
          ELSE                                                          00001010
             OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T002';           00001020
       IF (OM_PENSJONSTYPE1(TT_IND1)!!                                  00001030
           OM_PENSJONSTYPE2(TT_IND1)             =  'UE')  &            00001040
          (OM_PENSJONSTYPE1(TT_IND2)!!                                  00001050
           OM_PENSJONSTYPE2(TT_IND2)             =  'UP')  THEN         00001060
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T016';             00001070
                                                                        00001080
       IF (OM_PENSJONSTYPE2(TT_IND1)           ^=  'E')   &             00001090
          (OM_PENSJONSTYPE1(TT_IND1)           ^=  'E')   &             00001100
          (OM_PENSJONSTYPE2(TT_IND2)            =  'E')   THEN          00001110
              OM_TEKSTTYPE_T_KODE(TT_IND2)       =  'T003';             00001120
   /* ENDRING TEST T003 TEST T004 GAAR UT JD 03.08.90 */                00001130
                                                                        00001140
   /*  IF (OM_PENSJONSTYPE1(TT_IND1)            =  'U')   &             00001150
          (OM_PENSJONSTYPE2(TT_IND1)            =  'F')   &             00001160
          (OM_PENSJONSTYPE2(TT_IND2)            =  'E')   &             00001170
          (OM_ET_BRUTTO(TT_IND1)            >  0)  THEN                 00001180
              OM_TEKSTTYPE_T_KODE(TT_IND2)       =  'T003';  */         00001190
                                                                        00001200
    /* IF (OM_PENSJONSTYPE1(TT_IND1)            =  'U')   &             00001210
          (OM_PENSJONSTYPE2(TT_IND1)            =  'P')   &             00001220
          (OM_DØD_AV_YSKADE(TT_IND2)            =  ' ')   &             00001230
          (OM_PENSJONSTYPE2(TT_IND2)            =  'E') THEN            00001240
              OM_TEKSTTYPE_T_KODE(TT_IND2)       =  'T004';  */         00001250
                                                                        00001260
    /* IF (OM_PENSJONSTYPE1(TT_IND1)            =  'Y')   &             00001270
          (OM_PENSJONSTYPE2(TT_IND1)            =  'F')   &             00001280
          (OM_PENSJONSTYPE2(TT_IND2)            =  'E')   &             00001290
          (OM_ET_BRUTTO(TT_IND1)            >  0)  THEN                 00001300
              OM_TEKSTTYPE_T_KODE(TT_IND2)       =  'T333';             00001310
                                                                        00001320
       IF (OM_PENSJONSTYPE1(TT_IND1)            =  'Y')   &             00001330
          (OM_PENSJONSTYPE2(TT_IND1)            =  'P')   &             00001340
          (OM_PENSJONSTYPE2(TT_IND2)            =  'E') THEN            00001350
              OM_TEKSTTYPE_T_KODE(TT_IND2)       =  'T334';     */      00001360
                                                                        00001370
       IF (OM_PENSJONSTYPE1(TT_IND1)            =  'Y')   &  /*YS*/     00001380
          (OM_PENSJONSTYPE2(TT_IND1)            =  'P')   &  /*YS*/     00001390
          (OM_PENSJONSTYPE3(TT_IND1)            =  'A')   &  /*YS*/     00001400
          (OM_PENSJONSTYPE2(TT_IND2)            =  'E') THEN /*YS*/     00001410
              OM_TEKSTTYPE_T_KODE(TT_IND2)       =  'T404';  /*YS*/     00001420
                                                                        00001430
       IF (OM_PENSJONSTYPE1(TT_IND1)            =  'Y')   &  /*YS*/     00001440
          (OM_PENSJONSTYPE2(TT_IND1)            =  'P')   &  /*YS*/     00001450
          (OM_PENSJONSTYPE3(TT_IND1)            =  'A')   &  /*YS*/     00001460
          (OM_PENSJONSTYPE2(TT_IND2)            =  'E')   &  /*YS*/     00001470
          (OM_TP_BRUTTO(TT_IND1) < OM_TP_BRUTTO(TT_IND2))    /*YS*/     00001480
                             THEN                                       00001490
              OM_TEKSTTYPE_T_KODE(TT_IND2)       =  'T403';  /*YS*/     00001500
                                                                        00001510
                                                                        00001520
       IF (OM_PENSJONSTYPE1(TT_IND1)             =  'U')   &            00001530
          (OM_PENSJONSTYPE1(TT_IND2)             =  'A')  THEN          00001540
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T005';             00001550
                                                                        00001560
       IF (OM_PENSJONSTYPE1(TT_IND1)             =  'U')   &   /*YS*/   00001570
          (OM_PENSJONSTYPE1(TT_IND2)             =  'Y')  THEN /*YS*/   00001580
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T302';    /*YS*/   00001590
                                                                        00001600
                                                                        00001610
       IF (OM_PENSJONSTYPE1(TT_IND1)             =  'U')  &    /*YS*/   00001620
          (OM_PENSJONSTYPE1(TT_IND2)             =  'Y')  &    /*YS*/   00001630
          (OM_PENSJONSTYPE3(TT_IND2)             =  'A')   &   /*YS*/   00001640
          (OM_YRKE_UFG(TT_IND2)  = OM_UF_GRAD (TT_IND2)) THEN /*YS*/    00001650
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T408';    /*YS*/   00001660
                                                                        00001670
       IF((OM_PENSJONSTYPE1(TT_IND1)       =  'A')   !   /*YS*/         00001680
          (OM_PENSJONSTYPE1(TT_IND1)       =  'Y')   !   /*YS*/         00001690
          (OM_PENSJONSTYPE1(TT_IND1)       =  'U'))  &   /*YS*/         00001700
          (OM_PENSJONSTYPE2(TT_IND1)      ^=  'E')   &   /*YS*/         00001710
          (OM_DØD_AV_YSKADE(TT_IND2)       =  'E')   &   /*YS*/         00001720
          (OM_PENSJONSTYPE2(TT_IND2)       =  'E') THEN  /*YS*/         00001730
          DO;                                                           00001740
              OM_TEKSTTYPE_T_KODE(TT_IND2)    =  'T303';                00001750
          END;                                                          00001760
                                                                        00001770
       IF (OM_PENSJONSTYPE1(TT_IND2)             =  'E')  &             00001780
          (OM_PENSJONSTYPE1(TT_IND1)             =  'O')  THEN          00001790
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T006';             00001800
                                                                        00001810
       IF ((OM_PENSJONSTYPE1(TT_IND1)            =  'B' )  !            00001820
          (OM_PENSJONSTYPE1(TT_IND1)             =  'N'))  &            00001830
          (OM_PENSJONSTYPE1(TT_IND2)             =  'U')  THEN          00001840
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T007';             00001850
                                                                        00001860
       IF ((OM_PENSJONSTYPE1(TT_IND1)            =  'B' )  !            00001870
          (OM_PENSJONSTYPE1(TT_IND1)             =  'N'))  &            00001880
          (OM_PENSJONSTYPE1(TT_IND2)             =  'U')   &            00001890
          (OM_PENSJONSTYPE2(TT_IND2)             =  'O')  THEN          00001900
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T008';             00001910
                                                                        00001920
       IF ((OM_PENSJONSTYPE1(TT_IND1)            =  'B' )  !            00001930
          (OM_PENSJONSTYPE1(TT_IND1)             =  'N'))  &            00001940
          (OM_PENSJONSTYPE1(TT_IND2)             =  'E')   &            00001950
          (OM_PENSJONSTYPE2(TT_IND2)             =  'P')  THEN          00001960
           OM_TEKSTTYPE_T_KODE(TT_IND2)          =  'T009';             00001970
                                                                        00001980
       IF  ^(OM_TEKSTTYPE_T_KODE(TT_IND2)        =  '    ')  THEN       00001990
          DO;                                                           00002000
             TXT_KEY.KEY         =   OM_TEKSTTYPE_T_KODE(TT_IND2);      00002010
             CALL        SUBSTITUTE_TEKST;             /* R0019061 */   00002020
             STCX_TEKST                          =   '';                00002030
             FELLES_LINJE                        =   STCX_LINJE_D;      00002040
             CALL        SKRIV_STØNADSBREV;            /* R0019051 */   00002050
          END;                                                          00002060
       TT_IND1                             =   TT_IND1 + 1;             00002070
       TT_IND2                             =   TT_IND2 + 1;             00002080
    END;                                                                00002090
                                                                        00002100
    IF ((OM_PENSJONSTYPE2(OM_TELLER)       =  'O')  &                   00002110
        (OM_FRAMLEGGS_KODE(OM_TELLER)      =  'O')) THEN                00002120
        DO;                                                             00002130
           OM_TEKSTTYPE_T_KODE(OM_TELLER)  =  'T010';                   00002140
           TXT_KEY.KEY       =   OM_TEKSTTYPE_T_KODE(OM_TELLER);        00002150
           CALL              SUBSTITUTE_TEKST;  /* R0019061 */          00002160
           STCX_TEKST                      =   '';                      00002170
           FELLES_LINJE                    =   STCX_LINJE_D;            00002180
        END;                                                            00002190
    W_FRDATO_D            = W_HENDELSE.FRAMLEGGS_DATO;                  00002200
    HJ_FRDATO                    = W_FRDATO.ÅR !! W_FRDATO.MND;         00002210
    IF  (OM_PENSJONSTYPE2(OM_TELLER)       =  'O')  &                   00002220
        (OM_FRAMLEGGS_KODE(OM_TELLER)      =  'A')  &                   00002230
        (HJ_FRDATO                       > IDAG_ÅM          ) THEN      00002240
        DO;     /* TEST PAA FRAMLEGGSDATO LAGT INN 12.88  J.D */        00002250
           OM_TEKSTTYPE_T_KODE(OM_TELLER)  =  'T011';                   00002260
           TXT_KEY.KEY       =   OM_TEKSTTYPE_T_KODE(OM_TELLER);        00002270
           CALL              SUBSTITUTE_TEKST;   /* R0019061 */         00002280
           STCX_TEKST                      =   '';                      00002290
           FELLES_LINJE                    =   STCX_LINJE_D;            00002300
           PUT DATA ( TXT_KEY.KEY );                                    00002310
        END;                                                            00002320
                                                                        00002330
    IF   W_OPPHØRS_KODE                    =  'D'   THEN                00002340
        DO;                                                             00002350
           OM_TEKSTTYPE_T_KODE(OM_TELLER)  =  'T014';                   00002360
           TXT_KEY.KEY       =   OM_TEKSTTYPE_T_KODE(OM_TELLER);        00002370
           CALL              SUBSTITUTE_TEKST;   /* R0019061 */         00002380
           STCX_TEKST                      =   '';                      00002390
           FELLES_LINJE                    =   STCX_LINJE_D;            00002400
        END;                                                            00002410
                                                                        00002420
    IF   W_OPPHØRS_KODE                    =  'O'   !                   00002430
         W_OPPHØRS_KODE                    =  'X'   THEN                00002440
        DO;                                                             00002450
           OM_TEKSTTYPE_T_KODE(OM_TELLER)  =  'T015';                   00002460
           TXT_KEY.KEY       =   OM_TEKSTTYPE_T_KODE(OM_TELLER);        00002470
           CALL              SUBSTITUTE_TEKST;   /* R0019061 */         00002480
           STCX_TEKST                      =   '';                      00002490
           FELLES_LINJE                    =   STCX_LINJE_D;            00002500
        END;                                                            00002510
                                                                        00002520
    IF (OM_YRKE_ENGANGSBELØP_11_7(OM_TELLER)  > 0   ) THEN  /*YS*/      00002530
        DO;                                                             00002540
           OM_TEKSTTYPE_T_KODE(OM_TELLER)        =  'T310';    /*YS*/   00002550
           TXT_KEY.KEY       =   OM_TEKSTTYPE_T_KODE(OM_TELLER);        00002560
           CALL              SUBSTITUTE_TEKST;   /* R0019061 */         00002570
           STCX_TEKST                      =   '';                      00002580
           FELLES_LINJE                    =   STCX_LINJE_D;            00002590
        END;                                                            00002600
 END BESTEMME_T_TEKST;                                                  00002610
