 /*       SIST ENDRET 25/05-83 12.59.17 AV   OLAV                     */00000000
 /* ***************************************************************** */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /*    R0014725 - F_TILL_P_BARN     - INTERN FUNKSJON I PLI           */00000030
 /*    PROGRAMMERER: OLAV ØYSTEIN HANSEN MAI 1983                     */00000040
 /*HENSIKT:                                                           */00000050
 /*    FUNKSJONEN REGNER UT TILLEGGSPENSJON SOM BLIR RETURNERT.       */00000060
 /*    DETTE GJØRES PÅ GRUNNLAG AV MOTTATT FØDSELSÅR (2 SIFF),        */00000070
 /*    SLUTTPOENGTALL,OVERKOMP.SLUTTPOENGTALL , ANTALL POENGÅR OG     */00000080
 /*    PENSJONSGRAD.                                                  */00000090
 /*PROGRAMTILKNYTNING:                                                */00000100
 /*    FUNKSJONEN BLIR INKLUDERT I OVERLIGGENDE PROGRAM.              */00000110
 /*BRUK:                                                              */00000120
 /*    TP=F_TILL_P_BARN(FÅ,SPT,OPT,PÅ,UFG,TP_PROSENT);                */00000130
 /* ***************************************************************** */00000140
 F_TILL_P_BARN:                                                         00000150
  PROC(FÅ,G,SPT,OPT,PÅ,UFG,TP_PROSENT) RETURNS(DEC FIXED(7,2));         00000160
  DCL                                                                   00000170
     FÅ                 PIC '99',                                       00000180
     G                  FIXED DEC(5),                                   00000190
     SPT                FIXED DEC(3,2),                                 00000200
     OPT                FIXED DEC(3,2),                                 00000210
     PÅ                 FIXED DEC(3),                                   00000220
     UFG                FIXED DEC(5,2),                                 00000230
     TP_PROSENT         FIXED DEC(3),                                   00000240
     OÅ                 FIXED DEC(3),                                   00000250
     TP_WORK            FIXED DEC(11,4),                                00000260
     TP_WORK_2          FIXED DEC(11,4),                                00000270
     TP                 FIXED DEC(7,2);                                 00000280
                                                                        00000290
   DCL PGNAVN         CHAR (8);                                         00000300
   PGNAVN = 'R0014725';                                                 00000310
                                                                        00000320
  IF PÅ > 2               !                                             00000330
     (FÅ = 99 & PÅ = 2)   !                                             00000340
     (FÅ = 98 & PÅ = 1)        THEN                                     00000350
     DO;                                                                00000360
        IF FÅ > 36 & FÅ < 98        THEN                                00000370
           DO;                                                          00000380
            /* TP_WORK = G * 0.45 * SPT * (PÅ / 40) * (UFG / 100)       00000390
                           * (TP_PROSENT / 100) / 12              */    00000400
              TP_WORK = G * 45 /100;                                    00000410
              TP_WORK = TP_WORK * SPT;                                  00000420
              TP_WORK = TP_WORK * PÅ / 40;                              00000430
              TP_WORK = TP_WORK * UFG /100;                             00000440
              TP_WORK = TP_WORK * TP_PROSENT / 100;                     00000450
              TP_WORK = TP_WORK / 12;                                   00000460
           END;                                                         00000470
        ELSE                                                            00000480
           DO;                                                          00000490
              IF FÅ > 17 & FÅ < 98     THEN                             00000500
                 OÅ = 20 + FÅ - 17;                                     00000510
              ELSE                                                      00000520
                 OÅ = 20;                                               00000530
              IF SPT > OPT THEN                                         00000540
                 DO;                                                    00000550
                /* TP_WORK = ((G * 0.45 * OPT * (PÅ / OÅ)) +            00000560
                              (G * 0.45 * (SPT - OPT) * (PÅ / 40))) *   00000570
                               (UFG / 100) *                            00000580
                               (TP_PROSENT / 100) / 12                */00000590
                    TP_WORK = G * 45 /100;                              00000600
                    TP_WORK = TP_WORK * OPT;                            00000610
                    TP_WORK = TP_WORK * PÅ / OÅ;                        00000620
                    TP_WORK_2 = G * 45 / 100;                           00000630
                    TP_WORK_2 = TP_WORK_2 * (SPT - OPT);                00000640
                    TP_WORK_2 = TP_WORK_2 * PÅ / 40;                    00000650
                    TP_WORK = (TP_WORK + TP_WORK_2) * UFG /100;         00000660
                    TP_WORK = TP_WORK * TP_PROSENT / 100;               00000670
                    TP_WORK = TP_WORK / 12;                             00000680
                 END;                                                   00000690
              ELSE                                                      00000700
                 DO;                                                    00000710
                 /* TP_WORK = G * 0.45 * SPT * (PÅ / OÅ) * (UFG / 100)  00000720
                               * (TP_PROSENT / 100) / 12              */00000730
                    TP_WORK = G * 45 / 100;                             00000740
                    TP_WORK = TP_WORK * SPT;                            00000750
                    TP_WORK = TP_WORK * PÅ / OÅ;                        00000760
                    TP_WORK = TP_WORK * UFG /100;                       00000770
                    TP_WORK = TP_WORK * TP_PROSENT / 100;               00000780
                    TP_WORK = TP_WORK / 12;                             00000790
                 END;                                                   00000800
           END;                                                         00000810
     END;                                                               00000820
  ELSE                                                                  00000830
     TP_WORK = 0;                                                       00000840
  TP = TP_WORK;                                                         00000850
  RETURN(TP);                                                           00000860
                                                                        00000870
 END F_TILL_P_BARN;                                                     00000880
