 /*       SIST ENDRET 06/01-93 12.29.22 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 24/02-92 14.42.45 AV   HERMAN                   */00000010
 /*       SIST ENDRET 22/11-91 08.45.29 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 10/10-91 13.57.27 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 11/12-90 13.21.25 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 16/05-88 12.27.39 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 21/10-83 08.48.07 AV   OLAV                     */00000060
 /*       SIST ENDRET 08/09-83 12.33.14 AV   DYBVIK                   */00000070
  /* **************************************************************** */00000080
  /*IDENTIFIKASJON:                                                   */00000090
  /*    R0010903 - PROSEDYRE I PLI                                    */00000100
  /*    PROGRAMMERER: GEIR, JULI 1981                                 */00000110
  /*HENSIKT:                                                          */00000120
  /*    PROSEDYREN FORETAR KONTROLL AV DATA FOR EF_SØKER              */00000130
  /*    FRA GRUNNBLANKETT  ETTERLATT FAMILIEPLEIER.                   */00000140
  /*PROGRAMTILKNYTNING:                                               */00000150
  /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLING AV ETTERLATT       */00000160
  /*    FAMILIEPLEIERPENSJON.                                         */00000170
  /*    INCLUDES I R0010901.                                          */00000180
  /*BRUK:                                                             */00000190
  /*    CALL KONTROLL_EF_SØKER (FEIL_I_EF_SØKER);                     */00000200
  /*                                                                  */00000210
 /*ENDRET: 13.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000220
 /* ******                                                            */00000230
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000240
 /*    OM FNR ER ENDRET (R0019906).                                   */00000250
  /* **************************************************************** */00000260
  /*                                                                  */00000270
  /*    MODULEN KONTROLLERER EF_SØKER OG RETURNERER MED               */00000280
  /*    FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG.               */00000290
  /*                                                                  */00000300
  /* **************************************************************** */00000310
  %SKIP(2);                                                             00000320
  KONTROLL_EF_SØKER:                                                    00000330
    PROC (FEIL_FUNNET);                                                 00000340
    DCL                                                                 00000350
       FEIL_FUNNET BIT (1);                                             00000360
   DCL                                                                  00000370
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00000380
      KEY_PEKER                  POINTER,                               00000390
      TK_RECL                    CHAR (101);                            00000400
    DCL                                                                 00000410
       TT_FRAM_TIL                         PIC'(3)9',                   00000420
       ALDER                               FIXED DEC (5);               00000430
  %PAGE;                    /*      */                                  00000440
  /*   HJELPE DCL FOR Å SNU DATO                                      */00000450
                                                                        00000460
    DCL                                                                 00000470
      HJ_FNR                                    PIC'(11)9';             00000480
    DCL                                                                 00000490
      1 FNR DEF HJ_FNR,                                                 00000500
        2 DAG                                   PIC'(2)9',              00000510
        2 MND                                   PIC'(2)9',              00000520
        2 AAR                                   PIC'(2)9',              00000530
        2 ÅRHUNDRE                              PIC'9',                 00000540
        2 REST                                  PIC'(4)9';              00000550
    DCL                                                                 00000560
       HJ_VIRK_DATO_ÅM                             PIC '9999',          00000570
       VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅM POS(1)      PIC '99',            00000580
       VIRK_DATO_M DEF HJ_VIRK_DATO_ÅM POS(3)      PIC '99';            00000590
    DCL                                                                 00000600
       HJ_VIRK_DATO_MÅ                             PIC '9999',          00000610
       HJ_VIRK_DATO_M DEF HJ_VIRK_DATO_MÅ POS(1)   PIC '99',            00000620
       HJ_VIRK_DATO_Å DEF HJ_VIRK_DATO_MÅ POS(3)   PIC '99';            00000630
                                                                        00000640
  /*   HJELPE DCL FOR Å SNU DATO                                      */00000650
                                                                        00000660
    DCL                                                                 00000670
       HJ_FRAML_DATO_ÅM                            PIC '9999',          00000680
       FRAML_DATO_Å DEF HJ_FRAML_DATO_ÅM POS(1)    PIC '99',            00000690
       FRAML_DATO_M DEF HJ_FRAML_DATO_ÅM POS(3)    PIC '99';            00000700
    DCL                                                                 00000710
       HJ_FRAML_DATO_MÅ                            PIC'9999',           00000720
       HJ_FRAML_DATO_M DEF HJ_FRAML_DATO_MÅ POS(1) PIC'99',             00000730
       HJ_FRAML_DATO_Å DEF HJ_FRAML_DATO_MÅ POS(3) PIC'99';             00000740
                                                                        00000750
    DCL 1 FNR_REG,                                                      00000760
          2 FNR1       FIXED DEC(11),                                   00000770
          2 FNR2       FIXED DEC(11),                                   00000780
          2 BRUKERID   CHAR     ( 4);                                   00000790
                                                                        00000800
                                                                        00000810
       FNR_REG.BRUKERID =  DIV_PARAM_OMR.CICS_IND;                      00000820
       ANT_FEIL_SKREVET =  0;                                           00000830
       FEIL_FUNNET      = '0'B;                                         00000840
       KEY_PEKER        =  ADDR(EFS.TKNR);                              00000850
                                                                        00000860
                                                                        00000870
    HJ_VIRK_DATO_MÅ  = EFS.VIRK_DATO_MÅ;                                00000880
    VIRK_DATO_Å      = HJ_VIRK_DATO_Å;                                  00000890
    VIRK_DATO_M      = HJ_VIRK_DATO_M;                                  00000900
                                                                        00000910
       IF ^ F_NUMERISK(F_FELT_PIC_CHAR11(EFS.FNR)) THEN                 00000920
          DO;                                                           00000930
            FEIL_FUNNET = '1'B;                                         00000940
            EFS.FNRNR   = 200;                                          00000950
          END;                                                          00000960
       ELSE                                                             00000970
       IF ^ F_GYLDIG_FNR(EFS.FNR) THEN                                  00000980
          DO;                                                           00000990
            FEIL_FUNNET = '1'B;                                         00001000
            EFS.FNRNR   = 1;                                            00001010
          END;                                                          00001020
       ELSE                                                             00001030
          DO;                                                           00001040
             FNR_REG.FNR1 = EFS.FNR;                                    00001050
             EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);      00001060
             IF FNR_REG.FNR2 > 0 THEN                                   00001070
                DO;                                                     00001080
                   EFS.FNRNR   = 203;                                   00001090
                   EFS.FNR_GML = EFS.FNR;                               00001100
                   EFS.FNR     = FNR_REG.FNR2;                          00001110
                END;                                                    00001120
          END;                                                          00001130
       IF EFS.NAVN       = (25)' ' THEN                                 00001140
          DO;                                                           00001150
             FEIL_FUNNET = '1'B;                                        00001160
             EFS.NAVNNR  = 2;                                           00001170
          END;                                                          00001180
       IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(EFS.TKNR)) THEN                 00001190
          DO;                                                           00001200
            FEIL_FUNNET = '1'B;                                         00001210
            EFS.TKNRNR  = 200;                                          00001220
          END;                                                          00001230
       ELSE                                                             00001240
          DO;                                                           00001250
               EXEC CICS HANDLE CONDITION NOTFND(NOTFND);               00001260
               EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)       00001270
                                                  INTO(TK_RECL);        00001280
               GOTO TKNR_UT;                                            00001290
            NOTFND:                                                     00001300
               FEIL_FUNNET = '1'B;                                      00001310
               EFS.TKNRNR  = 3;                                         00001320
               LEAVE;                                                   00001330
            TKNR_UT:                                                    00001340
               DIV_PARAM_OMR.DIV_TKNR = SUBSTR(TK_RECL,1,4);            00001350
          END;                                                          00001360
       IF VERIFY(EFS.SIVILSTAND,'USE') ^= 0 THEN                        00001370
          DO;                                                           00001380
            FEIL_FUNNET      = '1'B;                                    00001390
            EFS.SIVILSTANDNR = 5;                                       00001400
          END;                                                          00001410
       IF VERIFY(EFS.SPRÅK,'NB ') ^= 0 THEN                             00001420
          DO;                                                           00001430
            FEIL_FUNNET = '1'B;                                         00001440
            EFS.SPRÅKNR = 6;                                            00001450
          END;                                                          00001460
       IF VERIFY(EFS.NORSK_BOSATT,'JN') ^= 0 THEN                       00001470
          DO;                                                           00001480
            FEIL_FUNNET        = '1'B;                                  00001490
            EFS.NORSK_BOSATTNR = 8;                                     00001500
          END;                                                          00001510
       IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(EFS.FORVENTET)) THEN            00001520
          DO;                                                           00001530
            FEIL_FUNNET     = '1'B;                                     00001540
            EFS.FORVENTETNR = 200;                                      00001550
          END;                                                          00001560
       IF VERIFY(EFS.GP_OS_KODE,'PO') ^= 0 THEN                         00001570
          DO;                                                           00001580
            FEIL_FUNNET      = '1'B;                                    00001590
            EFS.GP_OS_KODENR = 68;                                      00001600
          END;                                                          00001610
       IF VERIFY(EFS.HJEMMEL_10_8,'JN') ^= 0 THEN                       00001620
          DO;                                                           00001630
            FEIL_FUNNET        = '1'B;                                  00001640
            EFS.HJEMMEL_10_8NR = 70;                                    00001650
          END;                                                          00001660
       IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(EFS.FRAML_DATO_MÅ)) THEN        00001670
          DO;                                                           00001680
            FEIL_FUNNET         = '1'B;                                 00001690
            EFS.FRAML_DATO_MÅNR = 200;                                  00001700
          END;                                                          00001710
       ELSE                                                             00001720
       IF ^F_GYLDIG_DATO(EFS.FRAML_DATO_MÅ) &                           00001730
          EFS.FRAML_DATO_MÅ > 0 THEN                                    00001740
          DO;                                                           00001750
            FEIL_FUNNET         = '1'B;                                 00001760
            EFS.FRAML_DATO_MÅNR = 71;                                   00001770
          END;                                                          00001780
       IF VERIFY(EFS.FRAMLEGGSKODE,'AO ') ^= 0 THEN                     00001790
          DO;                                                           00001800
            FEIL_FUNNET         = '1'B;                                 00001810
            EFS.FRAMLEGGSKODENR = 73;                                   00001820
          END;                                                          00001830
       IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(EFS.VIRK_DATO_MÅ)) THEN         00001840
          DO;                                                           00001850
            FEIL_FUNNET        = '1'B;                                  00001860
            EFS.VIRK_DATO_MÅNR = 200;                                   00001870
          END;                                                          00001880
       ELSE                                                             00001890
       IF ^F_GYLDIG_DATO(EFS.VIRK_DATO_MÅ) THEN                         00001900
          DO;                                                           00001910
            FEIL_FUNNET        = '1'B;                                  00001920
            EFS.VIRK_DATO_MÅNR = 9;                                     00001930
          END;                                                          00001940
                                                                        00001950
  /* HER SETTES VERDIER INN I MENY_OMR  */                              00001960
                                                                        00001970
     FØDSNUMMER    = EFS.FNR;                                           00001980
     VIRKNINGSDATO = EFS.VIRK_DATO_MÅ;                                  00001990
  %SKIP (3);                    /*    */                                00002000
  /*    KRYSSKONTROLLER        */                                       00002010
  %SKIP;                                                                00002020
       IF ^FEIL_FUNNET THEN                                             00002030
          DO;                                                           00002040
            ALDER            = F_ALDER(EFS.FNR, EFS.VIRK_DATO_MÅ);      00002050
            HJ_VIRK_DATO_MÅ  = EFS.VIRK_DATO_MÅ;                        00002060
            VIRK_DATO_Å      = HJ_VIRK_DATO_Å;                          00002070
            VIRK_DATO_M      = HJ_VIRK_DATO_M;                          00002080
            HJ_FRAML_DATO_MÅ = EFS.FRAML_DATO_MÅ;                       00002090
            FRAML_DATO_Å     = HJ_FRAML_DATO_Å;                         00002100
            FRAML_DATO_M     = HJ_FRAML_DATO_M;                         00002110
                                                                        00002120
 /*LOVENDRING - HL : */                                                 00002130
                                                                        00002140
       IF ALDER < 1800                                         !        00002150
          ALDER > 6912                                         !        00002160
          (ALDER > 6612 & VIRK_DATO_Å > 72 & VIRK_DATO_Å < 91) !        00002170
          (ALDER > 6700 & VIRK_DATO_Å > 90)               THEN          00002180
          DO;                                                           00002190
             FEIL_FUNNET        = '1'B;                                 00002200
             EFS.FNRNR          = 100;                                  00002210
             EFS.VIRK_DATO_MÅNR = 999;                                  00002220
          END;                                                          00002230
       END;                                                             00002240
                                                                        00002250
       IF EFS.NORSK_BOSATT = 'J' THEN                                   00002260
          DO;                                                           00002270
             HJ_FNR      = EFS.FNR;                                     00002280
             IF FNR.ÅRHUNDRE < 5       THEN                             00002290
                DO;                                                     00002300
                   EFSP.TT_F67  = 67 - (FNR.AAR + 16);                  00002310
                   TT_FRAM_TIL  = FNR.AAR + 67;                         00002320
                END;                                                    00002330
             ELSE                                                       00002340
                DO;                                                     00002350
                   EFSP.TT_F67  = 67 - (FNR.AAR + 16 - 100);            00002360
                   TT_FRAM_TIL  = FNR.AAR + 70 - 100;                   00002370
                END;                                                    00002380
             IF TT_FRAM_TIL < 67 THEN                                   00002390
                DO;                                                     00002400
                   EFSP.TT_E66_Å = 0;                                   00002410
                   EFSP.TT_E66_M = 0;                                   00002420
                END;                                                    00002430
             ELSE                                                       00002440
                DO;                                                     00002450
                   EFSP.TT_E66_Å = TT_FRAM_TIL - 67;                    00002460
                   EFSP.TT_E66_M = FNR.MND;                             00002470
                END;                                                    00002480
          END;                                                          00002490
  END KONTROLL_EF_SØKER;                                                00002500
