 /*       SIST ENDRET 19/06-98 08.32.11 AV   JDA7339                  */00000000
 /*       SIST ENDRET 19/06-98 08.30.39 AV   JDA7339                  */00000010
 /*       SIST ENDRET 19/05-98 13.03.38 AV   JDA7339                  */00000020
 /*       SIST ENDRET 19/05-98 12.50.43 AV   JDA7339                  */00000030
 /*       SIST ENDRET 20/06-97 09.44.58 AV   JDA7339                  */00000040
 /*       SIST ENDRET 11/06-96 08.44.44 AV   TSB0310                  */00000050
 /*       SIST ENDRET 25/07-94 13.56.04 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 22/06-93 08.54.19 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 08/06-93 14.01.52 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 10/07-92 11.25.55 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 05/06-92 12.14.00 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 05/05-92 14.33.21 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 23/04-92 13.25.26 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 27/01-92 13.50.26 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 10/10-91 13.58.14 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 31/07-91 13.06.00 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 11/07-91 14.25.46 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 14/06-91 13.27.53 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 26/04-91 12.22.16 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 08/04-91 12.11.25 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 04/02-91 14.03.15 AV   DYBVIK                   */00000200
                                                                        00000210
 /* ***************************************************************** */00000220
 /* IDENTIFIKASJON                                                    */00000230
 /*     R0019H01 - GRUNNBELØPS_ENDRING - CICS-HOVEDPROG I PLI         */00000240
 /*     PROGRAMMERER: TOM JØRGENSEN, OKTOBER 1982.                    */00000250
 /* HENSIKT                                                           */00000260
 /*     KJØRES HVER GANG DET ER GRUNNBELØPS-ENDRING.                  */00000270
 /* ***************************************************************** */00000280
 /* ***************************************************************** */00000290
 /* GRUNNBELØPS-ENDRING                                               */00000300
 /*        PROGRAMMET LESER SEKVENSIELT GJENNOM PEPO-BASEN.           */00000310
 /*           NÅR EN PERSON MED PENSJON UTEN MERKE OM TIDLIGERE BE-   */00000320
 /*           HANDLET (BARE YNGSTE BARN I ET BARNEKULL BLIR LEST)     */00000330
 /*           SKJER FØLGENDE:                                         */00000340
 /*              - SISTE STATUS FOR FAMILIEN BLIR OPPRETTET GJENNOM   */00000350
 /*                MODULEN OPPRETT-SISTE-STATUS-FOR-FAMILIEN-BATCH    */00000360
 /*              - FAMILIEN BLIR OMREGNET MED DET NYE GRUNNBELØPET    */00000370
 /*                I MODULEN BEREGNING                                */00000380
 /*              - EKTEFELLE SOM HAR PENSJON BLIR MERKET SLIK AT      */00000390
 /*                FAMILIEN IKKE SKAL BLI BEHANDLET EN GANG TIL       */00000400
 /*                NÅR EKTEFELLEN BLIR LEST UNDER DEN SEKVENSIELLE    */00000410
 /*                LESINGEN.                                          */00000420
 /*           ETTER AT FAMILIEN ER OMREGNET SKAL RESULTATET SKRIVES   */00000430
 /*           UT PÅ ET DATASETT FOR VIDERE Å BLI SENDT TIL DATA-      */00000440
 /*           SENTRALENE.  DETTE DATASETTET KAN VI LISTE FOR KONTROLL */00000450
 /*           AV BEREGNINGEN.                                         */00000460
 /*           NÅR EN PERSON MED MERKE BLIR LEST UNDER DEN SEKVEN-     */00000470
 /*           SIELLE LESINGEN SKJER FØLGENDE:                         */00000480
 /*              - MERKE OM ALLEREDE OMREGNET FJERNES.                */00000490
 /*              - PERSONEN SKRIVES TILBAKE PÅ BASEN.                 */00000500
 /*                                                                   */00000510
 /* ***************************************************************** */00000520
 /*                                                                   */00000530
                                                                        00000540
 R0019H:                                                                00000550
    PROC             (COMMAREA_PEKER)                                   00000560
             OPTIONS (MAIN);                                            00000570
                                                                        00000580
                                                                        00000590
    %PAGE;                                                              00000600
    %INCLUDE P0014009;                              /* POTALL_OPPL    */00000610
                                                                        00000620
    %PAGE;                                                              00000630
    %INCLUDE P0019906;                              /* TRANS_OPPL_OMR */00000640
                                                                        00000650
    %PAGE;                                                              00000660
    %INCLUDE P0019908;                              /* KOM_OMR        */00000670
                                                                        00000680
    %PAGE;                                                              00000690
    %INCLUDE P0019910;                              /* STYRINGS_OMR   */00000700
                                                                        00000710
    %PAGE;                                                              00000720
    %INCLUDE P0019912;                              /* DIV_PARAM_OMR  */00000730
                                                                        00000740
    %PAGE;                                                              00000750
    %INCLUDE P0019014;                              /* FNR TAB/ST.BREV*/00000760
                                                                        00000770
    %PAGE;                                                              00000780
       DCL 1 B00              BASED (B00_PEKER),                        00000790
    %INCLUDE P0019921;                              /* B00            */00000800
                                                                        00000810
    %PAGE;                                                              00000820
       DCL 1 B01              BASED (B01_PEKER),                        00000830
    %INCLUDE P0019921;                              /* B01            */00000840
                                                                        00000850
    %PAGE;                                                              00000860
       DCL 1 B02              BASED (B02_PEKER),                        00000870
    %INCLUDE P0019921;                              /* B02            */00000880
                                                                        00000890
    %PAGE;                                                              00000900
    %INCLUDE P0019924;                                                  00000910
                                                                        00000920
    %PAGE;                                                              00000930
    %INCLUDE P0019925;                                                  00000940
    %PAGE;                                                              00000950
    %INCLUDE S0019H  ;                              /* MAP : OMREGNING*/00000960
                                                                        00000970
                                                                        00000980
    /*----------------------------------------------------------------*/00000990
    /*  DLI. LES/SKRIV-OMR, SSA'ER, DLIUIB-OMR, PCB'ENE               */00001000
    /*----------------------------------------------------------------*/00001010
                                                                        00001020
    DCL 1 SEGMENTER,                                                    00001030
                                                                        00001040
           2 ROTSEGM,                                                   00001050
              3 FNR        FIXED DEC (11),                              00001060
              3 NAVN             CHAR(25),                              00001070
              3 TKNR       FIXED DEC ( 5),                              00001080
              3 SPROG            CHAR( 1),                              00001090
              3 AI         FIXED DEC ( 5),                              00001100
              3 SPERRE           CHAR( 1),                              00001110
                                                                        00001120
           2 STATUSSEGM,                                                00001130
             %INCLUDE P0019930;               /* STATUS_SEGM        */  00001140
                                                                        00001150
    DCL EN               FIXED BIN  (31) INIT (1),                      00001160
        TO               FIXED BIN  (31) INIT (2),                      00001170
        TRE              FIXED BIN  (31) INIT (3),                      00001180
        FIRE             FIXED BIN  (31) INIT (4),                      00001190
        FEM              FIXED BIN  (31) INIT (5),                      00001200
        SEKS             FIXED BIN  (31) INIT (6);                      00001210
                                                                        00001220
    DCL 1 SSA_ROT_GU,                                                   00001230
           2 SSA_ROT_NAVN      CHAR (11) INIT ('RF0PERSN*D('),          00001240
           2 FELT1             CHAR ( 8) INIT ('FNR     ')   ,          00001250
           2 RELOOP1           CHAR ( 2) INIT ('^=')         ,          00001260
           2 FNR         FIXED DEC  (11) INIT (0)            ,          00001270
           2 HØYRE_PARENTES    CHAR ( 1) INIT (')')          ;          00001280
                                                                        00001290
                                                                        00001300
    DCL 1 SSA_ROT,                                                      00001310
           2 SSA_ROT_NAVN      CHAR(11) INIT ('RF0PERSN*D ') ;          00001320
                                                                        00001330
    DCL 1 SSA_STATUS,                                                   00001340
          2 SSA_STATUS_FELT    CHAR(9)  INIT ('STATUS  (')   ,          00001350
          2 FELT1              CHAR(8)  INIT ('STATKODE' )   ,          00001360
          2 RELOOP1            CHAR(2)  INIT (' ='       )   ,          00001370
          2 SSA_STATUS_KODE    CHAR(1)  INIT ('S'        )   ,          00001380
          2 CONC               CHAR(1)  INIT ('&'        )   ,          00001390
          2 FELT2              CHAR(8)  INIT ('STKODHST' )   ,          00001400
          2 RELOOP2            CHAR(2)  INIT (' ='       )   ,          00001410
          2 SSA_STATUS_HIST    CHAR(1)  INIT (' '        )   ,          00001420
          2 HØYRE_PARENTES     CHAR(1)  INIT (')'        )   ;          00001430
                                                                        00001440
    DCL SSA_UQUAL              CHAR(9)  INIT ('STATUS   ')   ;          00001450
                                                                        00001460
                                                                        00001470
    /*----------------------------------------------------------------*/00001480
    /*  DLIUIB    ,   PCB_UIB_PEKER_OMR  ,   PCB'ENE RF1 OG RF4       */00001490
    /*----------------------------------------------------------------*/00001500
                                                                        00001510
    %INCLUDE DLIUIB        ;                                            00001520
                                                                        00001530
    %INCLUDE P0012002      ;                                            00001540
                                                                        00001550
    DCL 1 RF4                  BASED    (RF4_PCB_PEKER),                00001560
          %INCLUDE P0012003;                                            00001570
                                                                        00001580
                                                                        00001590
    /*----------------------------------------------------------------*/00001600
    /*   OUTPUT - OMR. : TRKLISTE                                     */00001610
    /*----------------------------------------------------------------*/00001620
                                                                        00001630
    %INCLUDE P0019H90      ;                                            00001640
                                                                        00001650
                                                                        00001660
    DCL 1 TRANS,                                                        00001670
           2 TRANSKODE       CHAR(4)    INIT ('AUTO'),                  00001680
           2 FILLER          CHAR(1)    INIT (' '),                     00001690
           2 FNR             PIC'(11)9' INIT ('00000000000'),           00001700
           2 GRUNNBL_DATO    PIC'9999',                                 00001710
           2 BLANKETTYPE     CHAR(2)    INIT ('  '),                    00001720
           2 TRANSTYPE       CHAR(2)    INIT ('27');                    00001730
                                                                        00001740
                                                                        00001750
    /*----------------------------------------------------------------*/00001760
    /*   OUTPUT - OMR. : ETTEPMELD                                    */00001770
    /*----------------------------------------------------------------*/00001780
                                                                        00001790
    DCL 1 ETTEPMELD,                                                    00001800
           2 FNR             PIC '(11)9',                               00001810
           2 NAVN            CHAR (25),                                 00001820
           2 SPROG           CHAR (1),                                  00001830
           2 TKNR            PIC '(4)9',                                00001840
           2 INNTGRENSE      PIC '(7)9';                                00001850
                                                                        00001860
    DCL 1 ETTEP_BER,                                                    00001870
           2 GP_PR_AAR       FIXED DEC (5),                             00001880
           2 TP_PR_AAR       FIXED DEC (5),                             00001890
           2 G_HALVE         FIXED DEC (5);                             00001900
                                                                        00001910
    DCL INNTGRENSE_BER       FIXED DEC (7);                             00001920
                                                                        00001930
                                                                        00001940
    /*----------------------------------------------------------------*/00001950
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00001960
    /*----------------------------------------------------------------*/00001970
                                                                        00001980
    DCL                                                                 00001990
      ( ADDR , CSTG , LOW , STG ,  SUBSTR , DATE , VERIFY , SYSPRINT,   00002000
        NULL , UNSPEC , STORAGE )  BUILTIN                          ,   00002010
        PLITDLI                    ENTRY                            ;   00002020
                                                                        00002030
                                                                        00002040
    /*----------------------------------------------------------------*/00002050
    /*   FORSKJELLIGE HJELPE-OMRÅDER                                  */00002060
    /*----------------------------------------------------------------*/00002070
                                                                        00002080
                                                                        00002090
     DCL                                                                00002100
         UIB_RC_OK                 BIT  (8) INIT ( 0 )             ,    00002110
         COMMAREA_PEKER            POINTER                         ,    00002120
         OMR_FEIL_PEKER            POINTER                         ;    00002130
                                                                        00002140
                                                                        00002150
    DCL                                                                 00002160
        MELDING          CHAR      (78)     INIT ((78)' ')         ;    00002170
    DCL                                                                 00002180
      1 FEIL_STRUC,                                                     00002190
        2 FEIL_NR        FIXED DEC ( 5)     INIT (  0    )         ,    00002200
        2 FEIL_MELDING   CHAR      (78)     INIT ((78)' ')         ,    00002210
        2 KOM_OMR_PEKER  POINTER                                   ;    00002220
    DCL                                                                 00002230
      1 FEIL_TAB,                                                       00002240
        2 MELD     (15)  CHAR      (78)                            ,    00002250
                                                                        00002260
        F_IND            FIXED BIN (15)     INIT  (0)              ;    00002270
                                                                        00002280
                                                                        00002290
    DCL DAGENS_DATO      CHAR (6)                                  ;    00002300
                                                                        00002310
    DCL DAGENS_DATO_ÅR   DEF  DAGENS_DATO POS (1) PIC '99'         ,    00002320
        DAGENS_DATO_MND  DEF  DAGENS_DATO POS (3) PIC '99'         ,    00002330
        DAGENS_DATO_DAG  DEF  DAGENS_DATO POS (5) PIC '99'         ;    00002340
                                                                        00002350
    DCL W_GET            CHAR (4)         INIT ('    ')            ;    00002360
    DCL W_DATO           CHAR (6)                                  ;    00002370
                                                                        00002380
    DCL W_DATO_DAG       DEF  W_DATO      POS (1) PIC '99'         ,    00002390
        W_DATO_MND       DEF  W_DATO      POS (3) PIC '99'         ,    00002400
        W_DATO_ÅR        DEF  W_DATO      POS (5) PIC '99'         ;    00002410
                                                                        00002420
                                                                        00002430
    DCL FNR_PIC          PIC '(11)9'                               ,    00002440
                                                                        00002450
        FNR_DAG          DEF FNR_PIC       POS (1) PIC '99'        ,    00002460
        FNR_MND          DEF FNR_PIC       POS (3) PIC '99'        ,    00002470
        FNR_ÅR           DEF FNR_PIC       POS (5) PIC '99'        ,    00002480
        FNR_INDSIFF      DEF FNR_PIC       POS (7) PIC '999'       ,    00002490
        FNR_KJØNN        DEF FNR_PIC       POS (9) PIC '9'         ,    00002500
                                                                        00002510
        FNR_CHAR         DEF FNR_PIC       POS (1) CHAR (11)       ;    00002520
                                                                        00002530
                                                                        00002540
    DCL INGEN_FEIL             BIT  (1) INIT('1'B),                     00002550
        TRUE                   BIT  (1) INIT('1'B),                     00002560
        FALSE                  BIT  (1) INIT('0'B),                     00002570
        MER_DATA               BIT  (1) INIT('1'B),                     00002580
        W_ANT_OMR_FAM_OPPD     BIT  (1) INIT('0'B),                     00002590
        W_ANT_SPERRET_OPPD     BIT  (1) INIT('0'B),                     00002600
        W_ANT_SPERRER_OPH_OPPD BIT  (1) INIT('0'B),                     00002610
        W_ANT_TIL_TRKLIST_OPPD BIT  (1) INIT('0'B),                     00002620
        W_ANT_TIL_OMRNULL_OPPD BIT  (1) INIT('0'B),                     00002630
        FEIL_INPUT             BIT  (1) INIT('0'B);                     00002640
                                                                        00002650
    DCL KJØRE_SLUTT_TID_CHAR   CHAR (4),                                00002660
        KJØRE_SLUTT_TIM        PIC '99' DEF KJØRE_SLUTT_TID_CHAR,       00002670
        KJØRE_SLUTT_MIN        PIC '99' DEF KJØRE_SLUTT_TID_CHAR POS(3),00002680
                                                                        00002690
        KJØRE_SLUTT_TID_DEC    FIXED DEC ( 7);                          00002700
                                                                        00002710
                                                                        00002720
    DCL W_GRUNNBL_DATO         FIXED DEC ( 7);                          00002730
                                                                        00002740
    DCL DIFFERANSE         PIC'9999';                                   00002750
    DCL FORRIGE_TID        PIC'999B99B99'  INIT (0);                    00002760
    DCL NÅ_TID             PIC'999B99B99'  INIT (0);                    00002770
    DCL NÅ_TID_MIN         PIC'99'         DEF  NÅ_TID      POS(5);     00002780
    DCL NÅ_TID_TIM         PIC'999'        DEF  NÅ_TID;                 00002790
    DCL FORRIGE_TID_MIN    PIC'99'         DEF  FORRIGE_TID POS(5);     00002800
    DCL FORRIGE_TID_TIM    PIC'999'        DEF  FORRIGE_TID;            00002810
    DCL START_TID          PIC'999B99B99'  INIT (0);                    00002820
    DCL SLUTT_TID          PIC'999B99B99'  INIT (0);                    00002830
    DCL LES_TELLER         PIC'(7)9'       INIT (0);                    00002840
    DCL SPERRE_TELLER      PIC'(7)9'       INIT (0);                    00002850
    DCL BEH_TELLER         PIC'(7)9'       INIT (0);                    00002860
    DCL NEDRE_GR           PIC'(4)9'       INIT (0);                    00002870
    DCL OEVRE_GR           PIC'(4)9'       INIT (0);                    00002880
    DCL OMR_DATO           PIC'(4)9'       INIT (0);                    00002890
    DCL PIC4               PIC'(4)9'       INIT (0);                    00002900
    DCL PIC4_POS1          PIC'(2)9'  DEF  PIC4 POS(1);                 00002910
    DCL PIC4_POS3          PIC'(2)9'  DEF  PIC4 POS(3);                 00002920
                                                                        00002930
    DCL MAP_CHAR           CHAR(250)  BASED (BMSMAPBR);                 00002940
    DCL MAP_XX             CHAR(250) INIT ((250)' ');                   00002950
    DCL KONTROLL_S         CHAR(1)    INIT  (' ');                      00002960
    DCL BRI_NUM_MDT        CHAR(1)    INIT  ('P');                      00002970
    DCL BRI_PROT_MDT       CHAR(1)    INIT  ('Z');                      00002980
    DCL NOR_NUM_MDT        CHAR(1)    INIT  ('J');                      00002990
    DCL NOR_NUM            CHAR(1)    INIT  ('&');                      00003000
    DCL FEIL_RBA           POINTER;                                     00003010
    DCL RBA_PEKER          POINTER;                                     00003020
    DCL LOGG_RBA           POINTER;                                     00003030
    DCL NULL_RBA           POINTER;                                     00003040
    DCL BMSMAPBR           POINTER;                                     00003050
    DCL ANT_BEH            PIC '(8)Z9'    INIT (0);                     00003060
    DCL ANT_FEIL           PIC '(8)Z9'    INIT (0);                     00003070
    DCL INTERVALL_TELL     PIC '(9)9'     INIT (1);                     00003080
    DCL FIXED_BIN15        FIXED BIN (15);                              00003090
    DCL W_SØKER_IND        FIXED BIN (15);                              00003100
    DCL BARN_IND           FIXED BIN (15);                              00003110
    DCL TILKN_IND          FIXED BIN (15);                              00003120
    DCL PLASS_I_B02_IND    FIXED BIN (15);                              00003130
    DCL I                  FIXED BIN (15);                              00003140
    DCL J                  FIXED DEC ( 3);                              00003150
    DCL K                  FIXED DEC ( 3);                              00003160
    DCL G_NÅ               FIXED DEC ( 5)  INIT ( 0 );                  00003170
    DCL G_FØR              FIXED DEC ( 5)  INIT ( 0 );                  00003180
    DCL TEKST              CHAR      (20)  INIT ((20)' ');              00003190
    DCL GRUNN_OMR1         CHAR      (1202);                            00003200
    DCL GRUNN_OMR2         CHAR      (1202);                            00003210
    DCL GRUNN_IDENT        CHAR      ( 8);                              00003220
                                                                        00003230
    DCL TIDS_PEKER         POINTER                      ,               00003240
        TIDS_TEST          CHAR (4)   BASED (TIDS_PEKER),               00003250
        TID_UTE            CHAR (4)                     ;               00003260
                                                                        00003270
    DCL W_FNR              PIC '(11)9';                                 00003280
    DCL W_FNR_ÅM           PIC '(4)9';                                  00003290
    DCL  1 W_FNR_R DEF W_FNR,                                           00003300
           2 W_DAG       PIC '99',                                      00003310
           2 W_MND       PIC '99',                                      00003320
           2 W_ÅR        PIC '99',                                      00003330
           2 W_ÅRHUNDRE  PIC '9',                                       00003340
           2 W_REST      PIC '(4)9';                                    00003350
                                                                        00003360
                                                                        00003370
                                                                        00003380
    /* ************************************************************** */00003390
    /*                                                                */00003400
    /*   SLUTT PÅ DEKLARASJONENE .   EKSEKVERINGEN STARTER            */00003410
    /*                                                                */00003420
    /* ************************************************************** */00003430
                                                                        00003440
                                                                        00003450
    EXEC CICS HANDLE CONDITION ERROR   (CICS_ABEND);                    00003460
                                                                        00003470
    ON ERROR SNAP                                                       00003480
       BEGIN;                                                           00003490
          ON ERROR SYSTEM;                                              00003500
          INGEN_FEIL               =  FALSE                           ; 00003510
          MELDING                  = 'STOPP P.G.A PLI - ABEND, FNR: '!! 00003520
                      FNR_PIC     !! ' TA HARD-COPY !! TRYKK ENTER !!'; 00003530
          GOTO L999            ;                                        00003540
    END;                                                                00003550
                                                                        00003560
                                                                        00003570
    ALLOCATE POTALL_OPPL                                              ; 00003580
    ALLOCATE PCB_UIB_PEKER_OMR                                        ; 00003590
    ALLOCATE B00 ,B01 ,B02                                            ; 00003600
    ALLOCATE GV_TAB_RE                                                 ;00003610
    ALLOCATE G_TAB_RE                                                 ; 00003620
                                                                        00003630
    KOM_OMR.STYRINGS_PEKER          = ADDR (KOM_OMR.STYRINGS_OMR   ) ;  00003640
    KOM_OMR.TRANS_OPPL_PEKER        = ADDR (KOM_OMR.TRANS_OPPL_OMR ) ;  00003650
    KOM_OMR.TRANS_PEKER             = ADDR (KOM_OMR.TRANS_OMR      ) ;  00003660
    KOM_OMR.TRANS_LISTE_PEKER       = ADDR (KOM_OMR.TRANS_LISTE_OMR) ;  00003670
    KOM_OMR.DIV_PARAM_PEKER         = ADDR (KOM_OMR.DIV_PARAM_OMR  ) ;  00003680
    KOM_OMR.GV_PEKER                = ADDR (GRUNN_OMR1             ) ;  00003690
    KOM_OMR.G_PEKER                 = ADDR (GRUNN_OMR2             ) ;  00003700
    FEIL_STRUC.KOM_OMR_PEKER        = COMMAREA_PEKER                 ;  00003710
    START_TID                       = EIBTIME                        ;  00003720
    FORRIGE_TID                     = EIBTIME                        ;  00003730
    DAGENS_DATO                     = DATE        ; /* ÅR MND DAG   */  00003740
    TID_UTE                         = '"@" '      ; /* X'40008000'  */  00003750
                                                                        00003760
                                                                        00003770
    B00                             =  ''  ;                            00003780
    B01                             =  ''  ;                            00003790
    B02                             =  ''  ;                            00003800
    GV_TAB_RE                       =  ''  ;                            00003810
    G_TAB_RE                        =  ''  ;                            00003820
    TRANS_LISTE_OMR                 =  ''  ;                            00003830
    POTALL_OPPL                     =  ''  ;                            00003840
    SEGMENTER                       =  ''  ;                            00003850
    FEIL_TAB                        =  ''  ;                            00003860
    I                               =   1  ;                            00003870
    INGEN_FEIL                      =  TRUE;                            00003880
    MER_DATA                        =  TRUE;                            00003890
                                                                        00003900
                                                                        00003910
    TRANS_OPPL_OMR.TRANSKODE        = 'AUTO'; /* IKKE AUTOBEREGNING  */ 00003920
    TRANS_OPPL_OMR.NY_GML_TRANS_IND = ' '   ;                           00003930
    TRANS_OPPL_OMR.FØDSNUMMER       =  0    ;                           00003940
    TRANS_OPPL_OMR.VIRKNINGSDATO    =  9999 ;                           00003950
    TRANS_OPPL_OMR.BLANKETTYPE      = '  '  ;                           00003960
    TRANS_OPPL_OMR.TRANSTYPE        =  27   ;                           00003970
    TRANS_OPPL_OMR.TRANS_RETURKODE  = '    ';                           00003980
    DIV_PARAM_OMR. FEIL_MELD_NR     =  0    ;                           00003990
    DIV_PARAM_OMR. KJØRINGS_TYPE    = 'S'   ;                           00004000
                                                                        00004010
    GRUNN_IDENT                     = 'P0019924';                       00004020
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                      00004030
    GRUNN_IDENT                     = 'P0019925';                       00004040
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                      00004050
                                                                        00004060
    /*------------------------------------------------------------*/    00004070
    /* KOMMER FRA R0010426 FØRSTE GANG VI KOMMER INN .            */    00004080
    /*------------------------------------------------------------*/    00004090
                                                                        00004100
    IF PROGRAM_ID    = 'R0010426' THEN                                  00004110
       DO;                                                              00004120
          PROGRAM_ID = 'R0019H01';                                      00004130
          EXEC CICS HANDLE CONDITION NOTFND(NOTFND)  ENDFILE(NOTFND);   00004140
          EXEC CICS STARTBR  DATASET('OMRLOGG') RIDFLD(LOGG_RBA) RBA;   00004150
                                                                        00004160
          DO WHILE ('A' = 'A');                                         00004170
             EXEC CICS READNEXT DATASET('OMRLOGG') RIDFLD(LOGG_RBA) RBA 00004180
                                                   SET(BMSMAPBR);       00004190
          END;                                                          00004200
                                                                        00004210
          /*--------------------------------------------------------*/  00004220
          /* HENT FRA FILE                                          */  00004230
          /*--------------------------------------------------------*/  00004240
                                                                        00004250
  TILBAKE:                                                              00004260
                                                                        00004270
          EXEC CICS LOAD   PROGRAM ('S0019H3');                         00004280
          EXEC CICS SEND   MAP     ('S0019H' ) MAPSET ('S0019H3')       00004290
                                               CURSOR   ERASE     ;     00004300
          EXEC CICS RETURN TRANSID ('RH01'   ) COMMAREA(KOM_OMR)  ;     00004310
                                                                        00004320
  NOTFND:                                                               00004330
          IF S0019HO .FNRO          =  99999999999 THEN                 00004340
             DO;                                                        00004350
                MAP_CHAR            =  LOW (250);                       00004360
                S0019HO .FNRO       =  0;                               00004370
                S0019HI .DATO_MÅL   = -1;                               00004380
                S0019HO .DATO_MÅA   =  BRI_NUM_MDT;                     00004390
                S0019HO .MELDINGO   = 'HER ER ALT I ORDEN FOR OPPSTART' 00004400
                                       !!' FRA BEGYNNELSEN AV BASEN'  ; 00004410
             END;                                                       00004420
                                                                        00004430
          ELSE IF S0019HO .RECORD_TYPEO  ^=  'S' THEN                   00004440
             DO;                                                        00004450
                S0019HO .FNRA             =  BRI_NUM_MDT;               00004460
                S0019HI .FNRI             =  LOW (11)   ;               00004470
                S0019HI .FNRL             =  -1         ;               00004480
                S0019HO .STOPP_TIDA       =  BRI_NUM_MDT;               00004490
                S0019HI .STOPP_TIDI       =  LOW (4)    ;               00004500
                S0019HI .ANT_Ø_BEHI       =  LOW (8)    ;               00004510
                S0019HO .ANT_Ø_BEHA       =  BRI_NUM_MDT;               00004520
                S0019HI .ANT_G_STATI      =  LOW (7)    ;               00004530
                S0019HI .ANT_OMR_FAMI     =  LOW (7)    ;               00004540
                S0019HI .ANT_TIL_TRKLISTI =  LOW (7)    ;               00004550
                S0019HI .ANT_TIL_OMRNULLI =  LOW (7)    ;               00004560
                S0019HO .MELDINGO         = 'HER HAR DET VÆRT '    !!   00004570
                                            'UKONTROLLERT AVBRUDD '!!   00004580
                                            'SJEKK START-FNR NØYE'  ;   00004590
             END;                                                       00004600
                                                                        00004610
          ELSE                       /*  S0019HO .RECORD_TYPEO = 'S' */ 00004620
             DO;                                                        00004630
                S0019HO .FNRA             =  NOR_NUM_MDT;               00004640
                S0019HO .STOPP_TIDA       =  BRI_NUM_MDT;               00004650
                S0019HI .STOPP_TIDI       =  LOW (4)    ;               00004660
                S0019HI .ANT_Ø_BEHL       =  -1         ;               00004670
                S0019HI .ANT_Ø_BEHI       =  LOW (8)    ;               00004680
                S0019HO .ANT_Ø_BEHA       =  BRI_NUM_MDT;               00004690
                S0019HI .ANT_G_STATI      =  LOW (7)    ;               00004700
                S0019HI .ANT_OMR_FAMI     =  LOW (7)    ;               00004710
                S0019HI .ANT_TIL_TRKLISTI =  LOW (7)    ;               00004720
                S0019HI .ANT_TIL_OMRNULLI =  LOW (7)    ;               00004730
                S0019HO .MELDINGO         = 'HER ER ALT I ORDEN '     !!00004740
                                            'FOR OPPSTART'             ;00004750
             END;                                                       00004760
                                                                        00004770
                                                                        00004780
          /*--------------------------------------------------------*/  00004790
          /* SKRIVER START-INFO PÅ FEIL-LOGGEN .                    */  00004800
          /*--------------------------------------------------------*/  00004810
                                                                        00004820
          F_IND        =   1                                          ; 00004830
          PIC4         =   EIBTIME / 100                              ; 00004840
                                                                        00004850
          DAGENS_DATO  =   DATE                                       ; 00004860
          W_DATO_DAG   =   DAGENS_DATO_DAG                            ; 00004870
          W_DATO_MND   =   DAGENS_DATO_MND                            ; 00004880
          W_DATO_ÅR    =   DAGENS_DATO_ÅR                             ; 00004890
                                                                        00004900
                                                                        00004910
          MELDING      =  (78)' '                                     ; 00004920
          CALL P050_SKRIV_OMRFEIL                                     ; 00004930
                                                                        00004940
                                                                        00004950
          MELDING = ' GRUNNBELØPSENDRING       START KL.: ' !! PIC4 !!  00004960
                    '   DATO : ' !! W_DATO                            ; 00004970
                                                                        00004980
          FEIL_STRUC.FEIL_MELDING  =   MELDING                        ; 00004990
          FEIL_TAB.MELD  (F_IND)   =   MELDING                        ; 00005000
          CALL P050_SKRIV_OMRFEIL                                     ; 00005010
                                                                        00005020
          F_IND                    =   F_IND        + 1               ; 00005030
          FEIL_STRUC.FEIL_MELDING  =   S0019HO .MELDINGO              ; 00005040
          FEIL_TAB.MELD  (F_IND)   =   S0019HO .MELDINGO              ; 00005050
          CALL P050_SKRIV_OMRFEIL                                     ; 00005060
                                                                        00005070
                                                                        00005080
          GOTO TILBAKE;                                                 00005090
       END;                                                             00005100
                                                                        00005110
                                                                        00005120
    EXEC CICS RECEIVE MAP ('S0019H' ) MAPSET ('S0019H3')                00005130
                                      SET    (BMSMAPBR);                00005140
                                                                        00005150
                                                                        00005160
    IF S0019HI .FUNKSJONSKODEL >  0   &                                 00005170
    VERIFY(S0019HI.FUNKSJONSKODEI,'RVEFIAX') = 0 THEN                   00005180
       DO;                                                              00005190
          STYRINGS_OMR.FUNKSJONSKODE = S0019HI.FUNKSJONSKODEI ;         00005200
          EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR);       00005210
       END;                                                             00005220
                                                                        00005230
    ELSE                                                                00005240
       IF S0019HI.STYRE_KODEL > 0  THEN                                 00005250
          DO;                                                           00005260
             STYRINGS_OMR.STYREKODE =  S0019HI.STYRE_KODEI;             00005270
             EXEC CICS XCTL PROGRAM  ('R0010420')                       00005280
                            COMMAREA ( KOM_OMR  );                      00005290
          END;                                                          00005300
                                                                        00005310
                                                                        00005320
    KJØRE_SLUTT_TID_CHAR   = S0019HI .STOPP_TIDI;                       00005330
                                                                        00005340
                                                                        00005350
    IF ^ F_NUMERISK (S0019HI .DATO_MÅI) THEN                            00005360
       DO;                                                              00005370
          S0019HI .DATO_MÅL = -1;                                       00005380
          MELDING           = 'TEGN SOM IKKE ER TALL I DATOFELT';       00005390
       END;                                                             00005400
                                                                        00005410
    ELSE IF ^ F_GYLDIG_DATO(S0019HO .DATO_MÅO) THEN                     00005420
       DO;                                                              00005430
          S0019HI .DATO_MÅL = -1;                                       00005440
          MELDING           = 'UGYLDIG DATO';                           00005450
       END;                                                             00005460
                                                                        00005470
    ELSE IF ^ F_NUMERISK(S0019HI .FNRI) THEN                            00005480
       DO;                                                              00005490
          S0019HI .FNRL = -1;                                           00005500
          MELDING       ='TEGN SOM IKKE ER TALL I FØDSELSNUMMER - FELT';00005510
       END;                                                             00005520
                                                                        00005530
    ELSE IF ^ F_GYLDIG_FNR(S0019HO .FNRO) & S0019HO .FNRO  > 0 THEN     00005540
       DO;                                                              00005550
          S0019HI .FNRL = -1;                                           00005560
          MELDING       = 'UGYLDIG FØDSELSNUMMER ';                     00005570
       END;                                                             00005580
                                                                        00005590
    ELSE IF ^ F_NUMERISK(S0019HI .ANT_Ø_BEHI) THEN                      00005600
       DO;                                                              00005610
          S0019HI .ANT_Ø_BEHL = -1;                                     00005620
          MELDING             = 'TEGN SOM IKKE ER TALL I ANTALL - FELT';00005630
       END;                                                             00005640
                                                                        00005650
    ELSE IF  S0019HO .ANT_Ø_BEHO = 1 & S0019HI .FNRI = 0 THEN           00005660
       DO;                                                              00005670
          S0019HI .ANT_Ø_BEHL    = -1;                                  00005680
          MELDING ='FEIL KOMBINASJON - KJØRE-ANTALL = 1 OG FNR = 0';    00005690
       END;                                                             00005700
                                                                        00005710
    ELSE IF                                                             00005720
         S0019HO.ANT_Ø_BEHO    = 9999             !                     00005730
         S0019HO.ANT_Ø_BEHO    = 99999            !                     00005740
         S0019HO.ANT_Ø_BEHO    = 999999           !                     00005750
         S0019HO.ANT_Ø_BEHO    = 9999999          THEN                  00005760
         DO;                                                            00005770
            S0019HI.ANT_Ø_BEHL = -1;                                    00005780
            MELDING            = 'ALLE ÅTTE  9  TALLENE MÅ OPPGIS ';    00005790
         END;                                                           00005800
                                                                        00005810
    ELSE IF ^ F_NUMERISK(S0019HI .STOPP_TIDI) THEN                      00005820
       DO;                                                              00005830
          S0019HI .STOPP_TIDL = -1;                                     00005840
          MELDING             = 'TEGN SOM IKKE ER TALL I TIDS - FELT';  00005850
       END;                                                             00005860
                                                                        00005870
    ELSE IF KJØRE_SLUTT_MIN   > 59 THEN                                 00005880
       DO;                                                              00005890
          S0019HI .STOPP_TIDL = -1;                                     00005900
          MELDING             = 'URIKTIG TIDSANGIVELSE';                00005910
       END;                                                             00005920
    ELSE                                                                00005930
       DO;                                                              00005940
          KJØRE_SLUTT_TID_DEC  = S0019HO .STOPP_TIDO * 100;             00005950
          EXEC CICS POST   TIME (KJØRE_SLUTT_TID_DEC) SET(TIDS_PEKER);  00005960
          EXEC CICS HANDLE CONDITION EXPIRED(EXPIRED);                  00005970
          EXEC CICS POST   TIME (KJØRE_SLUTT_TID_DEC) SET(TIDS_PEKER);  00005980
          LEAVE;                                                        00005990
  EXPIRED:                                                              00006000
           S0019HI .STOPP_TIDL = -1;                                    00006010
           MELDING             = 'TIDSANGIVELSEN STOPPER TASKEN, '   !! 00006020
                                 'DEN ER MULIGENS FØR NÅ - TIDSPUNKT' ; 00006030
       END;                                                             00006040
                                                                        00006050
                                                                        00006060
                                                                        00006070
    /*----------------------------------------------------*/            00006080
    /*HVIS FEIL SENDES UT MELDING OG RETURN TIL CICS      */            00006090
    /*----------------------------------------------------*/            00006100
                                                                        00006110
    IF MELDING             ^= (78) ' '  THEN                            00006120
       CALL P040_MAP_UT_OG_RETUR;                                       00006130
                                                                        00006140
                                                                        00006150
    IF S0019HO.ANT_Ø_BEHO  = 88888888 THEN    /* TEST FOR SISTE FNR */  00006160
       KONTROLL_S  = 'J';                    /* UNDER BEHANDLING    */  00006170
    /*-------------------------------------------------------------*/   00006180
    /* SENDER UT MAP MED BESKJED OM OPPSTART                       */   00006190
    /*-------------------------------------------------------------*/   00006200
                                                                        00006210
    S0019HO .MELDINGO                  =  'BEHANDLINGEN FOREGÅR   ' ;   00006220
    S0019HO .RECORD_TYPEO              =  'O'                       ;   00006230
    S0019HO .DATO_MÅA                  =   BRI_PROT_MDT             ;   00006240
    S0019HO .FNRA                      =   BRI_PROT_MDT             ;   00006250
    S0019HO .ANT_Ø_BEHA                =   BRI_PROT_MDT             ;   00006260
    S0019HO .STOPP_TIDA                =   BRI_PROT_MDT             ;   00006270
    S0019HO .START_TIDO                =   EIBTIME / 100            ;   00006280
    S0019HO .KLOKKE_LOGO               =   EIBTIME / 100            ;   00006290
    S0019HI .DATO_LOGI                 =   DATE()                   ;   00006300
                                                                        00006310
    EXEC CICS SEND  MAP    ('S0019H' ) MAPSET('S0019H3') WAIT DATAONLY; 00006320
    EXEC CICS WRITE DATASET('OMRLOGG') FROM  (MAP_CHAR )                00006330
                                       RIDFLD(LOGG_RBA ) RBA;           00006340
                                                                        00006350
                                                                        00006360
                                                                        00006370
    /*----------------------------------------------------*/            00006380
    /*  INITIERING DATABASEN                              */            00006390
    /*----------------------------------------------------*/            00006400
                                                                        00006410
                                                                        00006420
    CALL P030_DATABASE    ('OPEN')                         ;            00006430
                                                                        00006440
    IF MELDING         ^= (78)' '                       THEN            00006450
       GOTO L999;                                                       00006460
                                                                        00006470
                                                                        00006480
    /*-------------------------------------------------------*/         00006490
    /* INITIERER W_GET OG POSISJONERER TIL OPPGITT PERSON    */         00006500
    /* HVIS FNR > 0                                          */         00006510
    /*-------------------------------------------------------*/         00006520
                                                                        00006530
    W_GET                              =   'GHU '             ;         00006540
                                                                        00006550
    IF S0019HO.FNRO                    >    0           THEN            00006560
       DO;                                                              00006570
          SSA_ROT_GU.RELOOP1           =   ' ='               ;         00006580
          SSA_ROT_GU.FNR               =    S0019HO.FNRO      ;         00006590
          CALL  P080_LES_ROT_STATUS_SEGM  ('KV_ROT_ST','GHU ');         00006600
          W_GET                        =   'GHN '             ;         00006610
       END;                                                             00006620
                                                                        00006630
    IF DIV_PARAM_OMR.FEIL_MELD_NR      >    0           THEN            00006640
       GOTO L999;                                                       00006650
                                                                        00006660
    /*-------------------------------------------------------*/         00006670
    /* LESER 1. PERSON SOM HAR PENSJON.                      */         00006680
    /*   ):  GHU / GHN PÅ RF0PERSN OG STATUS MED             */         00006690
    /*       STATUS_KODE = S OG STATUS_KODE_HIST = BLANK     */         00006700
    /*-------------------------------------------------------*/         00006710
                                                                        00006720
    SSA_ROT_GU.RELOOP1                 =   '^='               ;         00006730
                                                                        00006740
    IF S0019HO.ANT_Ø_BEHO              >    1              THEN         00006750
       CALL  P080_LES_ROT_STATUS_SEGM     ('KV_ROT_ST',W_GET) ;         00006760
                                                                        00006770
    IF DIV_PARAM_OMR.FEIL_MELD_NR      >    0              THEN         00006780
       GOTO L999;                                                       00006790
                                                                        00006800
                                                                        00006810
    S0019HO .RECORD_TYPEO              =   'L';                         00006820
    FNR_PIC                            =    S0019HO.FNRO         ;      00006830
                                                                        00006840
       PIC4                            =  F_SNU_DATO(S0019HO .DATO_MÅO);00006850
       NEDRE_GR                        =  0                           ; 00006860
       OEVRE_GR                        =  0                           ; 00006870
                                                                        00006880
       DO I=1 TO 60  UNTIL (NEDRE_GR  <=  PIC4  &                       00006890
                            OEVRE_GR  >=  PIC4  );                      00006900
          NEDRE_GR                     =  PERIODE_START_ÅMD (I) / 100 ; 00006910
          OEVRE_GR                     =  PERIODE_SLUTT_ÅMD (I) / 100 ; 00006920
       END;                                                             00006930
                                                                        00006940
       G_NÅ                            =  G_TAB_PERIODE.GRUNNBELØP(I);  00006950
                                                                        00006960
       G_FØR                      =  G_TAB_PERIODE.GRUNNBELØP(I - 1);   00006970
                                                                        00006980
                                                                        00006990
  /*  ======>    ENTRY POINT                                  */        00007000
                                                                        00007010
    DO ANT_BEH = 1 TO  S0019HO.ANT_Ø_BEHO  WHILE (MER_DATA    &         00007020
                                                  INGEN_FEIL  &         00007030
                                                  TIDS_TEST = LOW (4) );00007040
                                                                        00007050
       DIV_PERIODE = '';                                                00007060
                                                                        00007070
       FNR_PIC                         =   ROTSEGM.FNR                 ;00007080
       OMR_DATO                        =   F_SNU_DATO(S0019HO.DATO_MÅO);00007090
                                                                        00007100
                                                                        00007110
    /*-------------------------------------------------------*/         00007120
    /* TESTER UT OM STATISTIKK ER UTE AV OMREGNING           */         00007130
    /* IF-TEST SKAL IKKE KOMENTERES UT.                      */         00007140
    /*-------------------------------------------------------*/         00007150
                                                                        00007160
       IF STATUSSEGM.G_DATO_ÅM        ^=   OMR_DATO               THEN  00007170
          DO;                                                           00007180
             W_ANT_OMR_FAM_OPPD        =   FALSE                       ;00007190
             W_ANT_SPERRET_OPPD        =   FALSE                       ;00007200
             W_ANT_SPERRER_OPH_OPPD    =   FALSE                       ;00007210
             W_ANT_TIL_TRKLIST_OPPD    =   FALSE                       ;00007220
             W_ANT_TIL_OMRNULL_OPPD    =   FALSE                       ;00007230
                                                                        00007240
             /*----------------------------------------------*/         00007250
             /* SYNCPOINT OG INIT PÅ BASENE TAS              */         00007260
             /* HVIS SISTE BEHANDLING VAR FEILFRI .          */         00007270
             /*----------------------------------------------*/         00007280
                                                                        00007290
             IF DIV_PARAM_OMR.FEIL_MELD_NR  = 0           THEN          00007300
                DO;                                                     00007310
                   EXEC CICS SYNCPOINT                       ;          00007320
                   CALL P030_DATABASE   ('OPEN'   )          ;          00007330
                                                                        00007340
                   /*----------------------------------------------*/   00007350
                   /* POS. PCB4 TIL SIST BEH. PERSON               */   00007360
                   /*----------------------------------------------*/   00007370
                                                                        00007380
                   SSA_ROT_GU.FNR         =  ROTSEGM.FNR             ;  00007390
                   SSA_ROT_GU.RELOOP1     = ' ='                     ;  00007400
                   CALL P080_LES_ROT_STATUS_SEGM ('KV_ROT_ST','GHU ');  00007410
                                                                        00007420
                END;                                                    00007430
                                                                        00007440
                                                                        00007450
             /*------------------------------------------------------*/ 00007460
             /* INITIERING FØR LES AV FAMILIEN. SISTE STATUS         */ 00007470
             /*------------------------------------------------------*/ 00007480
                                                                        00007490
             S0019HO.ANT_G_STATO          =  S0019HO.ANT_G_STATO + 1 ;  00007500
             DIV_PARAM_OMR.FEIL_MELD_NR   =  0                       ;  00007510
             SØKER_IND                    =  0                       ;  00007520
             FAMILIE_IND                  =  0                       ;  00007530
                                                                        00007540
             /*------------------------------------------------------*/ 00007550
             /* PERSONEN MERKET, ER ALLEREDE OMREGNET.MERKET FJERNES */ 00007560
             /*------------------------------------------------------*/ 00007570
             IF KONTROLL_S          = 'J'      THEN                     00007580
                DO;                                                     00007590
                   W_FNR  =  ROTSEGM.FNR             ;                  00007600
                                                                        00007610
                   MAP_XX   = 'SISTE FNR FOR BEHANDLING' !! W_FNR;      00007620
                                                                        00007630
                   EXEC CICS WRITE DATASET ('OMRLOGG') FROM( MAP_XX  )  00007640
                             RIDFLD  ( LOGG_RBA) RBA;                   00007650
                END;                                                    00007660
             IF ROTSEGM.SPERRE            = 'J'                    THEN 00007670
                CALL P060_OPPHEV_SPERRE                               ; 00007680
             ELSE                                                       00007690
                DO;                                                     00007700
                   /*------------------------------------------------*/ 00007710
                                                                        00007720
                                                                        00007730
                   /* BARNEPENSJONIST YNGSTE BARN                    */ 00007740
                   /*------------------------------------------------*/ 00007750
                                                                        00007760
                   IF (STATUSSEGM.PENSJONSTYPE1 = 'N' !                 00007770
                       STATUSSEGM.PENSJONSTYPE1 = 'B') &                00007780
                       STATUSSEGM.PENSJONSTYPE2 = 'P'  THEN             00007790
                                                                        00007800
                      SØKER_IND = 3;                                    00007810
                   ELSE                                                 00007820
                                                                        00007830
                      /*---------------------------------------------*/ 00007840
                      /* PENSJONIST                                  */ 00007850
                      /*---------------------------------------------*/ 00007860
                                                                        00007870
                      IF (STATUSSEGM.PENSJONSTYPE1 = 'A' !              00007880
                          STATUSSEGM.PENSJONSTYPE1 = 'E' !              00007890
                          STATUSSEGM.PENSJONSTYPE1 = 'J' !              00007900
                          STATUSSEGM.PENSJONSTYPE1 = 'K' !              00007910
                          STATUSSEGM.PENSJONSTYPE1 = 'Y' !              00007920
                          STATUSSEGM.PENSJONSTYPE1 = 'U') THEN          00007930
                                                                        00007940
                         DO;                                            00007950
                            IF F_KJØNN (FNR_PIC)   = 'K'          THEN  00007960
                               SØKER_IND           =  1              ;  00007970
                            ELSE                                        00007980
                               SØKER_IND           =  2              ;  00007990
                         END;                                           00008000
                                                                        00008010
                                                                        00008020
                   IF SØKER_IND                        >  0        THEN 00008030
                      DO;                                               00008040
                         /*-------------------------------------------*/00008050
                         /* LESER SISTE STATUS FOR EN FAMILIE TIL B01 */00008060
                         /*   PARAMETRE : FNR OG SØKER_IND,EKTEF_IND  */00008070
                         /*-------------------------------------------*/00008080
                                                                        00008090
                         B01                           =  ''           ;00008100
                         POTALL_OPPL                   =  ''           ;00008110
                         DIV_PARAM_OMR. ØNSKET_STATUS  =  ' '          ;00008120
                         TRANS_OPPL_OMR.VIRKNINGSDATO  =  9999         ;00008130
                         TRANS_OPPL_OMR.FØDSNUMMER     =  ROTSEGM.FNR  ;00008140
                                                                        00008150
                                                                        00008160
                         EXEC CICS LINK PROGRAM  ('R0013101')           00008170
                                        COMMAREA (KOM_OMR   )          ;00008180
                                                                        00008190
                         IF FEIL_MELD_NR      > 0                   THEN00008200
                            DO;                                         00008210
                               CALL P010_FEIL_I_BEH                    ;00008220
                               GOTO BEH_NESTE                          ;00008230
                            END;                                        00008240
                         ELSE                                           00008250
                            DIV_PARAM_OMR.PROGRAM_ID    = 'R0019H01'   ;00008260
                                                                        00008270
                                                                        00008280
                         IF SØKER_IND                   = 1         THEN00008290
                            EKTEF_IND                   = 2            ;00008300
                         ELSE                                           00008310
                            IF SØKER_IND                = 2         THEN00008320
                               EKTEF_IND                = 1            ;00008330
                                                                        00008340
                         CALL P020_BEREGNING                           ;00008350
                                                                        00008360
                         IF FEIL_MELD_NR > 0                        THEN00008370
                            DO;                                         00008380
                               CALL P010_FEIL_I_BEH                    ;00008390
                               GOTO BEH_NESTE                          ;00008400
                            END;                                        00008410
                         ELSE                                           00008420
                            DO;                                         00008430
                               DIV_PARAM_OMR.PROGRAM_ID  = 'R0019H01'  ;00008440
                               W_ANT_OMR_FAM_OPPD        =  TRUE       ;00008450
                               S0019HO.ANT_OMR_FAMO      =              00008460
                                                S0019HO.ANT_OMR_FAMO +1;00008470
                            END;                                        00008480
                                                                        00008490
                      /*BØ9207 - TEST FOR GARANTIER IKKE KOMPLETT   -*/ 00008500
                      /*    UTVIDET DENNE NÅ, MEN IKKE KJØRT TEST.   */ 00008510
                      /*    TATT VEKK TEST PÅ ALDERSP/AFP.           */ 00008520
                      /*    PERSONER MED YTELSE (RF-VIRK) > G-DATO   */ 00008530
                      /*    MÅ FORTSATT TAS HENSYN TIL. (R0021100??).*/ 00008540
                      /*----------------------------------------------  00008550
                       *IF B02.PERSON(SØKER_IND).STATUS.                00008560
                       *                 PENSJONSTYPE1 ='A' !           00008570
                       *   B02.PERSON(SØKER_IND).STATUS.                00008580
                       *                 PENSJONSTYPE1 ='K' !           00008590
                       *UT 9706 SVERRE LUNDEBY, DATA-UTVIKLING          00008600
                       *   IF B02.PENSJONSTYPE1(SØKER_IND)  = 'U' !     00008610
                       *      B02.PENSJONSTYPE1(SØKER_IND)  = 'Y' !     00008620
                       *INN 9706 TEST PÅ ST PGA. SATSENDR.              00008630
                       *----------------------------------------------- 00008640
                       *INN 9806 TEST PÅ BT PGA. SATSENDR.    SL        00008650
                       *----------------------------------------------- 00008660
                       */                                               00008670
                        IF  B02.PERSON(SØKER_IND).ALDERSP.BT       > 0 !00008680
                            B02.PERSON(SØKER_IND).UFØRPENS.BT      > 0 !00008690
                            B02.PERSON(SØKER_IND).YRKEPENS.BT      > 0 !00008700
                            B02.PERSON(SØKER_IND).FORSI.BT_SÆRBARN > 0 !00008710
                                                                        00008720
                            B02.PERSON(SØKER_IND).ALDERSP.ST   >  0 !   00008730
                            B02.PERSON(SØKER_IND).UFØRPENS.ST  >  0 !   00008740
                            B02.PERSON(SØKER_IND).ETTEPENS.ST  >  0 !   00008750
                            B02.PERSON(SØKER_IND).YRKEPENS.ST  >  0 !   00008760
                            B02.PERSON(SØKER_IND).ETTEBARN.ST  >  0 !   00008770
                                                                        00008780
                           (B02.PERSON(SØKER_IND).STATUS.               00008790
                                         GARANTI_TP       > 0 !         00008800
                            B02.PERSON(SØKER_IND).STATUS.               00008810
                                         GT_TILLEGG_LOV92 > 0 !         00008820
                                                                        00008830
                            B02.PERSON(SØKER_IND).FORSI.                00008840
                                         GARANTITILLEGG_EK> 0 !         00008850
                            B02.PERSON(SØKER_IND).FORSI.                00008860
                                         GARANTITILLEGG_BARN    > 0 !   00008870
                            B02.PERSON(SØKER_IND).FORSI.                00008880
                                         GARANTITILLEGG_SÆRBARN > 0 ) ! 00008890
                                                                        00008900
                           (B01.PERSON(SØKER_IND).STATUS.               00008910
                                         GARANTI_TP       > 0 !         00008920
                            B01.PERSON(SØKER_IND).STATUS.               00008930
                                         GT_TILLEGG_LOV92 > 0 !         00008940
                                                                        00008950
                            B01.PERSON(SØKER_IND).FORSI.                00008960
                                         GARANTITILLEGG_EK> 0 !         00008970
                            B01.PERSON(SØKER_IND).FORSI.                00008980
                                         GARANTITILLEGG_BARN    > 0 !   00008990
                            B01.PERSON(SØKER_IND).FORSI.                00009000
                                         GARANTITILLEGG_SÆRBARN > 0 )   00009010
                                                                  THEN  00009020
                            DO;                                         00009030
                               EXEC CICS LINK PROGRAM  ('R0016001')     00009040
                                              COMMAREA ( KOM_OMR  );    00009050
                                                                        00009060
                               IF FEIL_MELD_NR > 0 THEN                 00009070
                                  DO;                                   00009080
                                     CALL P010_FEIL_I_BEH;              00009090
                                     GOTO BEH_NESTE;                    00009100
                                  END;                                  00009110
                               ELSE                                     00009120
                               PROGRAM_ID =    'R0019H01' ;             00009130
                            END;                                        00009140
                                                                        00009150
                        /*BØ9207 - SLUTT */                             00009160
                                                                        00009170
                         /*-------------------------------------------*/00009180
                         /* REPLACE PÅ RF-DB MED DE NYE BELØPENE      */00009190
                         /*-------------------------------------------*/00009200
                                                                        00009210
                         EXEC CICS LINK PROGRAM  ('R0019H50')           00009220
                                        COMMAREA (KOM_OMR   )          ;00009230
                                                                        00009240
                         IF FEIL_MELD_NR > 0                        THEN00009250
                            DO;                                         00009260
                               CALL P010_FEIL_I_BEH                    ;00009270
                               GOTO BEH_NESTE                          ;00009280
                            END;                                        00009290
                         ELSE                                           00009300
                            DIV_PARAM_OMR.PROGRAM_ID    = 'R0019H01'   ;00009310
                                                                        00009320
                         /*-------------------------------------------*/00009330
                         /* STATISTIKK. KALLES IKKE FOM. 01.01.86     */00009340
                         /*-------------------------------------------*/00009350
                                                                        00009360
                                                                        00009370
                         CALL P070_LAG_LISTE_TIL_TRYGDEKONTOR;          00009380
                                                                        00009390
                                                                        00009400
                      END;                   /* IF SØKER_IND > 0     */ 00009410
                                                                        00009420
                                                                        00009430
                END;                 /* ELSE TIL IF ROT.SPERRE = JA  */ 00009440
                                                                        00009450
                                                                        00009460
             /*-----------------------------------------------------*/  00009470
             /* FAMILIE-BEH. OK . BLANKER FEILMELDINS-TABELLEN      */  00009480
             /*-----------------------------------------------------*/  00009490
                                                                        00009500
             FEIL_TAB                         =   ''                 ;  00009510
                                                                        00009520
          END; /* IF STATUS.G_DATO_ÅM E_HIST ^=   OMR_DATO_ÅM       */  00009530
                                                                        00009540
                                                                        00009550
  BEH_NESTE:                                                            00009560
                                                                        00009570
       IF INTERVALL_TELL * 10000 <=  ANT_BEH    THEN                    00009580
          DO;                                                           00009590
             EXEC CICS ASKTIME;                                         00009600
             NÅ_TID               = EIBTIME;                            00009610
             S0019HO .KLOKKE_LOGO = EIBTIME / 100;                      00009620
             S0019HI .DATO_LOGI   = DATE();                             00009630
             DIFFERANSE           = NÅ_TID_TIM * 60 + NÅ_TID_MIN -      00009640
                  FORRIGE_TID_TIM * 60         - FORRIGE_TID_MIN ;      00009650
             S0019HO .MELDINGO    =                                     00009660
                                  'MIN SISTE 10000 ER KJØRT PÅ: '    !! 00009670
                                   DIFFERANSE !! ',ANT:'!! ANT_BEH!!    00009680
                                   ' '        !!   FNR_PIC             ;00009690
                                                                        00009700
             EXEC CICS SEND  MAP     ('S0019H' ) MAPSET('S0019H3')      00009710
                                                 WAIT    DATAONLY;      00009720
             EXEC CICS WRITE DATASET ('OMRLOGG') FROM  ( MAP_CHAR)      00009730
                             RIDFLD  ( LOGG_RBA) RBA;                   00009740
                                                                        00009750
             S0019HO .ANT_G_STATO      = 0;                             00009760
             S0019HO .ANT_OMR_FAMO     = 0;                             00009770
             S0019HO .ANT_TIL_TRKLISTO = 0;                             00009780
             S0019HO .ANT_TIL_OMRNULLO = 0;                             00009790
             INTERVALL_TELL            = INTERVALL_TELL + 1;            00009800
             FORRIGE_TID               = NÅ_TID;                        00009810
          END;                                                          00009820
                                                                        00009830
                                                                        00009840
       IF MER_DATA  &  INGEN_FEIL                                 THEN  00009850
                                                                        00009860
          IF S0019HO .ANT_Ø_BEHO       > 1                        THEN  00009870
             DO;                                                        00009880
                SSA_ROT_GU.RELOOP1     = '^='                        ;  00009890
                CALL P080_LES_ROT_STATUS_SEGM  ('N_ROT_STAT','GHN ') ;  00009900
             END;                                                       00009910
          ELSE                                                          00009920
             IF S0019HO .ANT_Ø_BEHO    = '1'                      THEN  00009930
                MER_DATA               =  FALSE                      ;  00009940
                                                                        00009950
    END;  /* DO WHILE .....                                           */00009960
                                                                        00009970
    /*----------------------------------------------------------------*/00009980
    /*   SLUTT PÅ STYREMODUL .  INTERNE PROCEDURER FØLGER .           */00009990
    /*----------------------------------------------------------------*/00010000
                                                                        00010010
  L999:                                                                 00010020
    CALL   P999_SLUTT ;                                                 00010030
                                                                        00010040
                                                                        00010050
                                                                        00010060
                                                                        00010070
                                                                        00010080
    /* ************************************************************** */00010090
    /*                                                                */00010100
    /* PROCEDURE SOM SLETTER OPPDATERINGER , OG SKRIVER UT FEILMELD.  */00010110
    /*                                                                */00010120
    /* ************************************************************** */00010130
                                                                        00010140
                                                                        00010150
    P010_FEIL_I_BEH:                                                    00010160
      PROC;                                                             00010170
                                                                        00010180
                                                                        00010190
        /*------------------------------------------------------------*/00010200
        /* SLETTER OPPDATERINGER. SJEKKER OM TIDLIGERE SKREVNE FEIL   */00010210
        /* ER SLETTET (ROLLBACK). TAR VARE PÅ SISTE FEILMELDING .     */00010220
        /* DUMMY-TELLING AV ANTALL FEIL.                              */00010230
        /*------------------------------------------------------------*/00010240
                                                                        00010250
        ANT_FEIL               =     ANT_FEIL    +  1                  ;00010260
        EXEC CICS SYNCPOINT ROLLBACK                                   ;00010270
                                                                        00010280
                                                                        00010290
        DO F_IND = 1 TO 15 WHILE    (FEIL_TAB.MELD (F_IND) ^= (78)' ') ;00010300
                                                                        00010310
           FEIL_STRUC.FEIL_MELDING = FEIL_TAB.MELD (F_IND);             00010320
           CALL P050_SKRIV_OMRFEIL;                                     00010330
        END;                                                            00010340
                                                                        00010350
                                                                        00010360
        IF F_IND               >  13           THEN                     00010370
           DO;                                                          00010380
              INGEN_FEIL       = FALSE;                               ; 00010390
              MELDING          = 'BEH. AV 7 FNR I SEKV. HAR GITT ' !!   00010400
                                 'FEIL. SJEKK FEILEN ! TRYKK ENTER !!'; 00010410
              GOTO RETUR;                                               00010420
           END;                                                         00010430
                                                                        00010440
                                                                        00010450
        FEIL_STRUC.FEIL_MELDING = 'PROGRAM: '!! DIV_PARAM_OMR.PROGRAM_ID00010460
              !! ' FEIL VED LABEL: ' !! DIV_PARAM_OMR.FEIL_VED_LABEL  !!00010470
                 ' DB-STATUSKODE: '  !! DIV_PARAM_OMR.DB_STATUS_KODE  !!00010480
                 ' HOVEDFNR: '       !! FNR_PIC                        ;00010490
                                                                        00010500
                                                                        00010510
        FEIL_TAB.MELD (F_IND)    =   FEIL_STRUC.FEIL_MELDING           ;00010520
        CALL P050_SKRIV_OMRFEIL;                                        00010530
                                                                        00010540
                                                                        00010550
        F_IND                    =   F_IND        + 1                  ;00010560
        FEIL_STRUC.KOM_OMR_PEKER =   COMMAREA_PEKER                    ;00010570
        FEIL_STRUC.FEIL_NR       =   DIV_PARAM_OMR.FEIL_MELD_NR        ;00010580
        CALL P030_DATABASE         ('OPEN')                            ;00010590
                                                                        00010600
                                                                        00010610
        EXEC CICS  LINK PROGRAM    ('R0019921') COMMAREA(FEIL_STRUC)   ;00010620
                                                                        00010630
        FEIL_TAB.MELD (F_IND)    =   FEIL_STRUC.FEIL_MELDING           ;00010640
        CALL P050_SKRIV_OMRFEIL;                                        00010650
                                                                        00010660
                                                                        00010670
        F_IND                    =   F_IND        + 1                  ;00010680
        FEIL_STRUC.FEIL_MELDING  =   ' '                               ;00010690
        CALL P050_SKRIV_OMRFEIL                                        ;00010700
                                                                        00010710
        /*------------------------------------------------------------*/00010720
        /* POS. PCB4 TIL SIST BEH. PERSON                             */00010730
        /*------------------------------------------------------------*/00010740
                                                                        00010750
        SSA_ROT_GU.FNR           =  ROTSEGM.FNR                        ;00010760
        SSA_ROT_GU.RELOOP1       =  ' ='                               ;00010770
        CALL P080_LES_ROT_STATUS_SEGM ('KV_ROT_ST','GHU ')             ;00010780
                                                                        00010790
                                                                        00010800
  RETUR:                                                                00010810
        IF ^INGEN_FEIL                           THEN                   00010820
            CALL P045_MAP_UT_OG_AVSLUTT                                ;00010830
                                                                        00010840
 END P010_FEIL_I_BEH;                                                   00010850
                                                                        00010860
                                                                        00010870
                                                                        00010880
                                                                        00010890
    /* ************************************************************** */00010900
    /*                                                                */00010910
    /* PROCEDURE SOM JUSTERE FORV. INNTEKT,INDEXENE OG KALLER BEREGN  */00010920
    /*                                                                */00010930
    /* ************************************************************** */00010940
                                                                        00010950
    P020_BEREGNING:                                                     00010960
       PROCEDURE;                                                       00010970
                                                                        00010980
                                                                        00010990
       TRANS_OPPL_OMR.VIRKNINGSDATO    =  S0019HO .DATO_MÅO           ; 00011000
       TRANS_OPPL_OMR.TRANSTYPE        =  27                          ; 00011010
       B02                             =  B01                         ; 00011020
                                                                        00011030
                                                                        00011040
                                                                        00011050
       W_FNR        = B02.FNR(SØKER_IND);                               00011060
       W_FNR_ÅM     = W_FNR_R.W_ÅR!!W_FNR_R.W_MND;                      00011070
                                                                        00011080
       IF B02.ETTEPENS.FORVENTET(SØKER_IND)  >  0               &       00011090
          B02.GT_TILLEGG_LOV92(SØKER_IND)    =  0             THEN      00011100
          B02.ETTEPENS.FORVENTET(SØKER_IND)  =                          00011110
              B02.ETTEPENS.FORVENTET(SØKER_IND) * G_NÅ / G_FØR ;        00011120
                                                                        00011130
           /* --------------------------------------------- */          00011140
           /* VI MÅ RULLERE FORSI-INNTEKTER OG ALDERSP.FAI  */          00011150
           /* PGA REGELENDRINGER 0591 OG 0192. TRUDE 0492   */          00011160
           /* --------------------------------------------- */          00011170
                                                                        00011180
       IF (W_FNR_ÅM                  > 2412 &                           00011190
           W_FNR_R.W_ÅRHUNDRE        < 5    &                           00011200
           B02.KONV_P_KODE(SØKER_IND) ^= 'K') !                         00011210
          (B02.KONV_P_KODE(SØKER_IND) = 'K'  &                          00011220
           B02.UTTAKSDATO_ÅM(SØKER_IND) > 9200 ) THEN                   00011230
             DO;                                                        00011240
               IF B02.ALDERSP.FAI(SØKER_IND)  >  0        THEN          00011250
                  B02.ALDERSP.FAI(SØKER_IND)  =                         00011260
                      B02.ALDERSP.FAI(SØKER_IND) * G_NÅ / G_FØR ;       00011270
             END;                                                       00011280
                                                                        00011290
       IF B02.FORSI.ARBEIDSINNTEKT(SØKER_IND) >  0   THEN               00011300
          B02.FORSI.ARBEIDSINNTEKT(SØKER_IND) =                         00011310
              B02.FORSI.ARBEIDSINNTEKT(SØKER_IND) * G_NÅ / G_FØR ;      00011320
                                                                        00011330
       IF B02.FORSI.PENSJONSINNTEKT(SØKER_IND) >  0   THEN              00011340
          B02.FORSI.PENSJONSINNTEKT(SØKER_IND) =                        00011350
              B02.FORSI.PENSJONSINNTEKT(SØKER_IND) * G_NÅ / G_FØR ;     00011360
                                                                        00011370
       IF B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND) >  0   THEN            00011380
          B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND) =                      00011390
              B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND) * G_NÅ / G_FØR ;   00011400
                                                                        00011410
       IF B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND) >  0   THEN           00011420
          B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND) =                     00011430
              B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND) * G_NÅ / G_FØR ;  00011440
                                                                        00011450
           /* TIL HIT REGELENDRINGER 0591 OG 0192. TRUDE 0492   */      00011460
                                                                        00011470
                                                                        00011480
       IF SØKER_IND                    =    3           THEN            00011490
          DO;                                                           00011500
             IF B02.FNR (1)            >    0           THEN            00011510
                FAMILIE_IND            =    1              ;            00011520
             ELSE                                                       00011530
                IF B02.FNR (2)         >    0           THEN            00011540
                   FAMILIE_IND         =    2              ;            00011550
          END;                                                          00011560
       ELSE                                                             00011570
          DO;                                                           00011580
             IF SØKER_IND              =    1           THEN            00011590
                DO;                                                     00011600
                   IF B02.FNR (2)      >    0           THEN            00011610
                      FAMILIE_IND      =    2              ;            00011620
                END;                                                    00011630
             ELSE                                                       00011640
                IF B02.FNR (1)         >    0           THEN            00011650
                   FAMILIE_IND         =    1              ;            00011660
          END;                                                          00011670
                                                                        00011680
                                                                        00011690
       /*------------------------------------------------------------*/ 00011700
       /* FAMILIEN BLIR OMREGNET EFTER DET NYE GRUNNBELØPET          */ 00011710
       /*    PARAMETRE ER :  B01,B02,SØKER_IND,FAMILIE_IND,          */ 00011720
       /*                    POENGREKKENE                            */ 00011730
       /*------------------------------------------------------------*/ 00011740
                                                                        00011750
       EXEC CICS LINK PROGRAM ('R0014001') COMMAREA (KOM_OMR)        ;  00011760
                                                                        00011770
                                                                        00011780
    END  P020_BEREGNING;                                                00011790
                                                                        00011800
                                                                        00011810
                                                                        00011820
    /* ************************************************************** */00011830
    /*                                                                */00011840
    /* PROCEDURE SOM FORETAR INITIERINGS OG TERMINERINGS KALL         */00011850
    /*                                                                */00011860
    /* ************************************************************** */00011870
                                                                        00011880
    P030_DATABASE:                                                      00011890
      PROC  (STYRING);                                                  00011900
                                                                        00011910
      DCL                                                               00011920
        STYRING                               CHAR(4),                  00011930
        NULL                                  BUILTIN,                  00011940
        UNSPEC                                BUILTIN;                  00011950
                                                                        00011960
                                                                        00011970
     /* ************************************************************ */ 00011980
     /*DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-KALL*/ 00011990
     /* ************************************************************ */ 00012000
                                                                        00012010
     DCL                                                                00012020
       W01_PSB_NAVN                CHAR (8)       INIT('B0019H01'),     00012030
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB '),         00012040
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00012050
                                                                        00012060
     /* ************************************************************ */ 00012070
     /* DLI CALL-PARAMETRE                                           */ 00012080
     /* ************************************************************ */ 00012090
                                                                        00012100
     DCL 1  W01_DLI_PARAM,                                              00012110
            2   W02_GU             CHAR (4)       INIT('GU  '),         00012120
            2   W02_PARM_CT_1      FIXED BIN(31)  INIT(1),              00012130
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT(3),              00012140
            2   W02_PARM_CT_4      FIXED BIN(31)  INIT(4);              00012150
                                                                        00012160
                                                                        00012170
                                                                        00012180
      IF STYRING = 'OPEN' THEN                                          00012190
         DO;                                                            00012200
            CALL   PLITDLI                        (W02_PARM_CT_3,       00012210
                                                   W01_PCB_FUNCTION,    00012220
                                                   W01_PSB_NAVN,        00012230
                                                   UIBPTR);             00012240
                                                                        00012250
            IF DLIUIB.UIBFCTR                  =  '00000000'B THEN      00012260
               DO;                                                      00012270
                  PCB_UIB_PEKER_OMR.PCB_PEKER  =   UIBPCBAL;            00012280
                  PCB_UIB_PEKER_OMR.UIB_PEKER  =   UIBPTR;              00012290
               END;                                                     00012300
            ELSE                                                        00012310
               DO;                                                      00012320
  L100:                                                                 00012330
                  DIV_PARAM_OMR.FEIL_MELD_NR   =    500                ;00012340
                  DIV_PARAM_OMR.FEIL_VED_LABEL =   '110'               ;00012350
                  INGEN_FEIL                   =    FALSE              ;00012360
                  MELDING                      =   'NOE ER GALT '     !!00012370
                                                   'MED DB PÅ ÅPNINGS'!!00012380
                                                   'KALLET, KODE: '   !!00012390
                                                    UNSPEC(UIBFCTR)   !!00012400
                                                   ' '!!UNSPEC(UIBDLTR);00012410
                  GOTO P030_END;                                        00012420
               END;                                                     00012430
         END;                                                           00012440
      ELSE                                                              00012450
         DO;                                                            00012460
            CALL   PLITDLI                        (W02_PARM_CT_1,       00012470
                                                   W01_TERM_FUNCTION);  00012480
            KOM_OMR.PCB_UIB_PEKER = NULL;                               00012490
         END;                                                           00012500
                                                                        00012510
  P030_END:                                                             00012520
                                                                        00012530
    END P030_DATABASE;                                                  00012540
                                                                        00012550
                                                                        00012560
    /* ************************************************************** */00012570
    /* PROC. SOM SKRIVER UT BILDE OG RETURNERER TIL CICS MED TRANSID  */00012580
    /* ************************************************************** */00012590
                                                                        00012600
                                                                        00012610
    P040_MAP_UT_OG_RETUR:                                               00012620
      PROC;                                                             00012630
                                                                        00012640
         S0019HO .MELDINGO      =   MELDING;                            00012650
         EXEC CICS SEND   MAP     ('S0019H' ) MAPSET   ('S0019H3')      00012660
                                    DATAONLY CURSOR               ;     00012670
         EXEC CICS RETURN TRANSID ('RH01'  ) COMMAREA ( KOM_OMR ) ;     00012680
                                                                        00012690
    END P040_MAP_UT_OG_RETUR;                                           00012700
                                                                        00012710
                                                                        00012720
                                                                        00012730
    /* ************************************************************** */00012740
    /* PROC. SOM SKRIVER UT BILDE OG AVSLUTTER MED PAUSEBILDET        */00012750
    /* ************************************************************** */00012760
                                                                        00012770
                                                                        00012780
    P045_MAP_UT_OG_AVSLUTT:                                             00012790
      PROC;                                                             00012800
                                                                        00012810
          S0019HO .MELDINGO      =   MELDING;                           00012820
          EXEC CICS SEND    MAP     ('S0019H' ) MAPSET ('S0019H3')      00012830
                                                DATAONLY CURSOR    ;    00012840
                                                                        00012850
          EXEC CICS RECEIVE MAP     ('S0019H' ) MAPSET ('S0019H3')      00012860
                                                SET    (BMSMAPBR)  ;    00012870
                                                                        00012880
          /*------------------------------------------------------*/    00012890
          /* SKRIVER PAUSEBILDE OG RETURNERER TIL CICS            */    00012900
          /*------------------------------------------------------*/    00012910
                                                                        00012920
          EXEC CICS SEND MAP ('S001012') MAPSET ('S001013')             00012930
                                         MAPONLY  ERASE            ;    00012940
          EXEC CICS RETURN                                         ;    00012950
                                                                        00012960
    END P045_MAP_UT_OG_AVSLUTT;                                         00012970
                                                                        00012980
                                                                        00012990
                                                                        00013000
    /* ************************************************************** */00013010
    /* PROC. SOM SKRIVER FEIL-MELDINGER UT PÅ FEIL-LOGGEN             */00013020
    /* ************************************************************** */00013030
                                                                        00013040
                                                                        00013050
    P050_SKRIV_OMRFEIL:                                                 00013060
      PROC;                                                             00013070
                                                                        00013080
         EXEC CICS WRITE DATASET  ('OMRFEIL')                           00013090
              FROM (FEIL_STRUC.FEIL_MELDING )  RIDFLD (FEIL_RBA) RBA;   00013100
                                                                        00013110
    END P050_SKRIV_OMRFEIL;                                             00013120
                                                                        00013130
                                                                        00013140
                                                                        00013150
                                                                        00013160
   /* *************************************************************** */00013170
   /* PROCEDURE SOM FJERNER SPERRINGENE                               */00013180
   /* *************************************************************** */00013190
                                                                        00013200
                                                                        00013210
   P060_OPPHEV_SPERRE:                                                  00013220
      PROC;                                                             00013230
                                                                        00013240
      DCL   W080_REPL           CHAR (4)   INIT ('REPL')               ;00013250
                                                                        00013260
                                                                        00013270
  /*  S0019HO.ANT_SPERRER_OPHO       =  S0019HO.ANT_SPERRER_OPHO + 1;*/ 00013280
      ROTSEGM.SPERRE                 =   ' ';                           00013290
                                                                        00013300
                                                                        00013310
      CALL PLITDLI                         (TRE                      ,  00013320
                                            W080_REPL                ,  00013330
                                            RF4                      ,  00013340
                                            SEGMENTER               );  00013350
                                                                        00013360
                                                                        00013370
                                                                        00013380
      IF DLIUIB.UIBFCTR               ^=   '00000000'B             THEN 00013390
         DO;                                                            00013400
  L110:                                                                 00013410
            DIV_PARAM_OMR.FEIL_MELD_NR =    500                        ;00013420
            DIV_PARAM_OMR.FEIL_VED_LABEL=  '110'                       ;00013430
            INGEN_FEIL                 =    FALSE                      ;00013440
            MELDING                    =   'UIB-FEIL I P060 I RF-DB. '!!00013450
                                            UNSPEC (UIBFCTR) !! ' '   !!00013460
                                            UNSPEC (UIBDLTR)          !!00013470
                                          ' FNR: ' !! FNR_PIC          ;00013480
            GOTO P060_END;                                              00013490
         END;                                                           00013500
                                                                        00013510
      /*--------------------------------------------------------------*/00013520
      /* SJEKKER OM  REPLACE GIKK.                                    */00013530
      /*--------------------------------------------------------------*/00013540
                                                                        00013550
      IF RF4.STATUS_KODE              ^=   '  '                     THEN00013560
         DO;                                                            00013570
  L120:                                                                 00013580
            DIV_PARAM_OMR.FEIL_MELD_NR =    500                        ;00013590
            DIV_PARAM_OMR.FEIL_VED_LABEL=  '120'                       ;00013600
            INGEN_FEIL                 =    FALSE                      ;00013610
            MELDING                    =   'FEIL VED REPL I P060_. '  !!00013620
                                           'I RF-DB. STATUS-KODE : '  !!00013630
                                            RF4.STATUS_KODE    !! ' ' !!00013640
                                           'FNR: ' !! FNR_PIC          ;00013650
         END;                                                           00013660
                                                                        00013670
  P060_END:                                                             00013680
                                                                        00013690
 END P060_OPPHEV_SPERRE;                                                00013700
                                                                        00013710
                                                                        00013720
                                                                        00013730
    /* ************************************************************** */00013740
    /*                                                                */00013750
    /* PROCEDURE SOM LAGER LISTE TIL TRYGDEKONTORENE                  */00013760
    /*                                                                */00013770
    /* ************************************************************** */00013780
                                                                        00013790
                                                                        00013800
    P070_LAG_LISTE_TIL_TRYGDEKONTOR:                                    00013810
      PROC;                                                             00013820
                                                                        00013830
      IF B02.PENSJONSTYPE1 (3)       = 'N'    !                         00013840
         B02.PENSJONSTYPE1 (3)       = 'B'                        THEN  00013850
                                                                        00013860
         DO I = 3 TO 14                 WHILE (B02.FNR(I) > 0);         00013870
                                                                        00013880
            TRKLISTE                 =  '';                             00013890
            TRKLISTE.FNR             =  B02.FNR           (I);          00013900
            TRKLISTE.NAVN            =  B02.NAVN          (I);          00013910
            TRKLISTE.PENSJONSTYPE1   =  B02.PENSJONSTYPE1 (I);          00013920
            TRKLISTE.PENSJONSTYPE2   =  B02.PENSJONSTYPE2 (I);          00013930
            TRKLISTE.GP              =  B02.ETTEBARN.GP   (I);          00013940
            TRKLISTE.TP_AVD          =  B02.ETTEBARN.TP   (I);          00013950
            TRKLISTE.ST              =  B02.ETTEBARN.ST   (I);          00013960
       /*   TRKLISTE.TAI             =  0 */                            00013970
                                                                        00013980
            IF B02.PENSJONSTYPE3 (I) = 'U' THEN                         00013990
               DO;                                                      00014000
                  TRKLISTE.GP        =  B02.UFØRPENS.GP (I);            00014010
                  TRKLISTE.TP_EGEN   =  B02.UFØRPENS.TP (I);            00014020
                  TRKLISTE.ET        =  B02.UFØRPENS.ET (I);            00014030
                  TRKLISTE.BT        =  B02.UFØRPENS.BT (I);            00014040
                  TRKLISTE.ST        =  B02.UFØRPENS.ST (I);            00014050
                  TRKLISTE.ÅFT       =  B02.UFØRPENS.ÅFT(I);            00014060
                  TRKLISTE.APD_UFG   =  B02.UFØRPENS.UFG(I);            00014070
               END;                                                     00014080
                                                                        00014090
            TRKLISTE.SUM_YTELSE      =  B02.SUM_YTELSE  (I);            00014100
            TRKLISTE.TKNR            =  B02.TKNR        (I);            00014110
                                                                        00014120
            EXEC CICS  WRITE DATASET  ('TRKLIST') FROM   (TRKLISTE )    00014130
                                        RBA       RIDFLD (RBA_PEKER)   ;00014140
                                                                        00014150
            S0019HO.ANT_TIL_TRKLISTO =  S0019HO.ANT_TIL_TRKLISTO + 1   ;00014160
            W_ANT_TIL_TRKLIST_OPPD   =  TRUE                           ;00014170
         END;                                                           00014180
      ELSE                                                              00014190
                                                                        00014200
         DO I = 1 TO 2;                                                 00014210
                                                                        00014220
            IF (B02.DØDSDATO_ÅMD (I) = 0      &                         00014230
                B02.FNR          (I) > 0      &                         00014240
                B02.SUM_YTELSE   (I) > 0      &                         00014250
              ^(B02.PENSJONSTYPE1(I) = 'F' !                            00014260
                B02.PENSJONSTYPE2(I) = 'N' !                            00014270
                B02.PENSJONSTYPE1(I) = 'G')) THEN                       00014280
                                                                        00014290
                /*----------------------------------------------------*/00014300
                /* FORSØRGET PERSON                                   */00014310
                /*----------------------------------------------------*/00014320
                DO;                                                     00014330
                   TRKLISTE               = '';                         00014340
                   TRKLISTE.FNR           = B02.FNR          (I);       00014350
                   TRKLISTE.NAVN          = B02.NAVN         (I);       00014360
                   TRKLISTE.PENSJONSTYPE1 = B02.PENSJONSTYPE1(I);       00014370
                   TRKLISTE.PENSJONSTYPE2 = B02.PENSJONSTYPE2(I);       00014380
                   TRKLISTE.SUM_YTELSE    = B02.SUM_YTELSE   (I);       00014390
                   TRKLISTE.TKNR          = B02.TKNR         (I);       00014400
                   TRKLISTE.GARANTI_TP    = B02.STATUS.GARANTI_TP(I);   00014410
                                                                        00014420
                                                                        00014430
                SELECT  (B02.PENSJONSTYPE1(I));                         00014440
                                                                        00014450
                   WHEN ('A','K')                                       00014460
                                                                        00014470
                      /*----------------------------------------------*/00014480
                      /* ALDERSPENSJON                                */00014490
                      /*----------------------------------------------*/00014500
                      DO;                                               00014510
                         TRKLISTE.GP      = B02.ALDERSP.AP_GP_NETTO(I); 00014520
      /*NETTO 04.92 JD*/ TRKLISTE.TP_EGEN = B02.ALDERSP.AP_TP_NETTO(I); 00014530
                         TRKLISTE.ET      = B02.ALDERSP.ET         (I); 00014540
                         TRKLISTE.BT      = B02.ALDERSP.BT         (I); 00014550
                         TRKLISTE.ST      = B02.ALDERSP.ST         (I); 00014560
        /*HL TRKLISTE.TAI = DIV_PARAM_OMR.TAI(I) /1000 BORT 0596 TS */  00014570
                         TRKLISTE.APD_UFG = B02.ALDERSP.APD        (I); 00014580
                         TRKLISTE.VT_GP   = B02.ALDERSP.VT_GP      (I); 00014590
                         TRKLISTE.VT_TP   = B02.ALDERSP.VT_TP      (I); 00014600
      /* NY 04.93 JD */  TRKLISTE.AFP_TILLEGG = B02.AFP_TILLEGG    (I); 00014610
                     /*  TRKLISTE.KONV_P_KODE = B02.KONV_P_KODE   */    00014620
                                                                        00014630
                         IF B02.PENSJONSTYPE2 (I) = 'E'            THEN 00014640
                            DO;                                         00014650
                                                                        00014660
                               TRKLISTE.TP_AVD =                        00014670
                                              B02.ETTEPENS.TP_BRUTTO(I);00014680
                               TRKLISTE.GP_N   =  TRKLISTE.GP;          00014690
                               TRKLISTE.TP_N   =  TRKLISTE.TP_AVD;      00014700
                            END;                                        00014710
                                                                        00014720
                      END;                                              00014730
                                                                        00014740
                   WHEN ('U')                                           00014750
                                                                        00014760
                      /*----------------------------------------------*/00014770
                      /* UFØREPENSJO                                  */00014780
                      /*----------------------------------------------*/00014790
                      DO;                                               00014800
                         TRKLISTE.GP      = B02.UFØRPENS.GP        (I); 00014810
                         TRKLISTE.TP_EGEN = B02.UFØRPENS.TP        (I); 00014820
                         TRKLISTE.ET      = B02.UFØRPENS.ET        (I); 00014830
                         TRKLISTE.BT      = B02.UFØRPENS.BT        (I); 00014840
                         TRKLISTE.ST      = B02.UFØRPENS.ST        (I); 00014850
                   /*    TRKLISTE.TAI     = 0   */                      00014860
                         TRKLISTE.ÅFT     = B02.UFØRPENS.ÅFT       (I); 00014870
                         TRKLISTE.APD_UFG = B02.UFØRPENS.UFG       (I); 00014880
                                                                        00014890
                         IF B02.PENSJONSTYPE2 (I) = 'E' THEN            00014900
                            DO;                                         00014910
                                                                        00014920
                               IF B02.ETTEPENS.GP_BRUTTO (I) > 0   THEN 00014930
                                  DO;                                   00014940
                                     TRKLISTE.GP             =          00014950
                                             B02.ETTEPENS.GP_BRUTTO (I);00014960
                                     TRKLISTE.FORVENTET      =          00014970
                                             B02.ETTEPENS.FORVENTET (I);00014980
                                     TRKLISTE.GP_N           =          00014990
                                             B02.ETTEPENS.GP_NETTO  (I);00015000
                                     TRKLISTE.TP_N           =          00015010
                                             B02.ETTEPENS.TP_NETTO  (I);00015020
                                     TRKLISTE.ST             =          00015030
                                             B02.ETTEPENS.ST        (I);00015040
                                  END;                                  00015050
                                                                        00015060
                               TRKLISTE.TP_AVD               =          00015070
                                             B02.ETTEPENS.TP_BRUTTO (I);00015080
                            END;                                        00015090
                      END;                                              00015100
                                                                        00015110
                   WHEN ('E','J')                                       00015120
                                                                        00015130
                      /*----------------------------------------------*/00015140
                      /* ETTERLATTEPENSJON OG ETTERLATTE FAMILIEPLEIER*/00015150
                      /*----------------------------------------------*/00015160
                      DO;                                               00015170
                         TRKLISTE.GP        = B02.ETTEPENS.GP_BRUTTO(I);00015180
                         TRKLISTE.TP_AVD    = B02.ETTEPENS.TP_BRUTTO(I);00015190
                         TRKLISTE.FORVENTET = B02.ETTEPENS.FORVENTET(I);00015200
                         TRKLISTE.GP_N      = B02.ETTEPENS.GP_NETTO (I);00015210
                         TRKLISTE.TP_N      = B02.ETTEPENS.TP_NETTO (I);00015220
                         TRKLISTE.ST        = B02.ETTEPENS.ST       (I);00015230
                /*       TRKLISTE.TAI       = 0;  */                    00015240
                      END;                                              00015250
                                                                        00015260
                   WHEN ('Y')                                           00015270
                                                                        00015280
                      /*----------------------------------------------*/00015290
                      /* YRKEPENSJO                                  */ 00015300
                      /*----------------------------------------------*/00015310
                      DO;                                               00015320
                         TRKLISTE.GP      = B02.UFØRPENS.GP        (I)  00015330
                                            + B02.YRKEPENS.GP      (I); 00015340
                         TRKLISTE.TP_EGEN = B02.UFØRPENS.TP        (I)  00015350
                                            + B02.YRKEPENS.TP      (I); 00015360
                         TRKLISTE.ET      = B02.UFØRPENS.ET        (I); 00015370
                         TRKLISTE.ST      = B02.UFØRPENS.ST        (I); 00015380
                         TRKLISTE.BT      = B02.UFØRPENS.BT        (I)  00015390
                                            + B02.YRKEPENS.BT      (I); 00015400
           /*            TRKLISTE.TAI     = 0 */                        00015410
                         TRKLISTE.ÅFT     = B02.UFØRPENS.ÅFT       (I); 00015420
                         TRKLISTE.APD_UFG = B02.UFØRPENS.UFG       (I); 00015430
                                                                        00015440
                         IF B02.PENSJONSTYPE2 (I) = 'E' THEN            00015450
                            DO;                                         00015460
                                                                        00015470
                               IF B02.ETTEPENS.GP_BRUTTO (I) > 0   THEN 00015480
                                  DO;                                   00015490
                                     TRKLISTE.GP             =          00015500
                                             B02.ETTEPENS.GP_BRUTTO (I);00015510
                                     TRKLISTE.FORVENTET      =          00015520
                                             B02.ETTEPENS.FORVENTET (I);00015530
                                     TRKLISTE.GP_N           =          00015540
                                             B02.ETTEPENS.GP_NETTO  (I);00015550
                                     TRKLISTE.TP_N           =          00015560
                                             B02.ETTEPENS.TP_NETTO  (I);00015570
                                     TRKLISTE.ST             =          00015580
                                             B02.ETTEPENS.ST        (I);00015590
                                  END;                                  00015600
                                                                        00015610
                               TRKLISTE.TP_AVD               =          00015620
                                             B02.ETTEPENS.TP_BRUTTO (I);00015630
                            END;                                        00015640
                      END;                                              00015650
                                                                        00015660
                                                                        00015670
                   OTHERWISE;                                           00015680
                      /*----------------------------------------------*/00015690
                      /* PERSONEN HAR INGEN EGEN YTELSE               */00015700
                      /*----------------------------------------------*/00015710
                                                                        00015720
                END;                           /* SELECT ..           */00015730
                                                                        00015740
 /*TILLEGG 1.5.91 HL : */                                               00015750
                                                                        00015760
              TRKLISTE.GT_TILLEGG_L92 = B02.GT_TILLEGG_LOV92(I);/*L92*/ 00015770
                TRKLISTE.EK_GR   = B02.GARANTITILLEGG_EK  (I);          00015780
                TRKLISTE.BA_GR   = B02.GARANTITILLEGG_BARN(I);          00015790
                TRKLISTE.SB_TILL = B02.BT_SÆRBARN(I);                   00015800
                TRKLISTE.SB_GR   = B02.GARANTITILLEGG_SÆRBARN(I);       00015810
                                                                        00015820
                EXEC CICS  WRITE DATASET ('TRKLIST') FROM   (TRKLISTE ) 00015830
                                           RBA       RIDFLD (RBA_PEKER);00015840
                                                                        00015850
                S0019HO.ANT_TIL_TRKLISTO = S0019HO.ANT_TIL_TRKLISTO + 1;00015860
                W_ANT_TIL_TRKLIST_OPPD   = TRUE                        ;00015870
             END;                                                       00015880
                                                                        00015890
                                                                        00015900
            ELSE                                                        00015910
               IF  (B02.PENSJONSTYPE1(I) = 'E'  &                       00015920
                    B02.SUM_YTELSE   (I) =  0   &                       00015930
                    B02.FNR          (I) >  0   &                       00015940
                    B02.DØDSDATO_ÅMD (I) =  0 )         THEN            00015950
                                                                        00015960
                  DO;                                                   00015970
                                                                        00015980
                     ETTEPMELD            = '';                         00015990
                     ETTEPMELD.FNR        = B02.FNR (I);                00016000
                     ETTEPMELD.NAVN       = B02.NAVN(I);                00016010
                     ETTEPMELD.TKNR       = B02.TKNR(I);                00016020
                     ETTEPMELD.SPROG      = B02.SPRÅK(I);               00016030
                                                                        00016040
                     ETTEP_BER.GP_PR_AAR      =                         00016050
                                       B02.ETTEPENS.GP_BRUTTO(I) * 12;  00016060
                     ETTEP_BER.TP_PR_AAR      =                         00016070
                                       B02.ETTEPENS.TP_BRUTTO(I) * 12;  00016080
                                                                        00016090
                     INNTGRENSE_BER = (ETTEP_BER.GP_PR_AAR +            00016100
                                       ETTEP_BER.TP_PR_AAR) * 2.5 ;     00016110
                                                                        00016120
                     ETTEP_BER.G_HALVE = (G_NÅ / 2);                    00016130
                     INNTGRENSE_BER = INNTGRENSE_BER +                  00016140
                                                    ETTEP_BER.G_HALVE;  00016150
                                                                        00016160
                     ETTEPMELD.INNTGRENSE = INNTGRENSE_BER;             00016170
                                                                        00016180
                     EXEC CICS WRITE DATASET ('OMRNULL')                00016190
                                 FROM (ETTEPMELD) RIDFLD (NULL_RBA) RBA;00016200
                                                                        00016210
                     S0019HO.ANT_TIL_OMRNULLO =                         00016220
                                 S0019HO.ANT_TIL_OMRNULLO + 1          ;00016230
                     W_ANT_TIL_OMRNULL_OPPD   = TRUE                   ;00016240
                                                                        00016250
                  END;                                                  00016260
                                                                        00016270
       END;                                                             00016280
                                                                        00016290
    END P070_LAG_LISTE_TIL_TRYGDEKONTOR;                                00016300
   %PAGE;                                                               00016310
                                                                        00016320
                                                                        00016330
                                                                        00016340
                                                                        00016350
    /* ************************************************************** */00016360
    /*                                                                */00016370
    /* LESER BARE ROT-SEGM ELLER ROT OG STATUS AVHENGIG AV SSA_IND .  */00016380
    /*                                                                */00016390
    /* ************************************************************** */00016400
                                                                        00016410
                                                                        00016420
    P080_LES_ROT_STATUS_SEGM:                                           00016430
      PROC (W080_SSA_IND,W080_GET);                                     00016440
                                                                        00016450
                                                                        00016460
      DCL   W080_SSA_IND        CHAR (9),                               00016470
            W080_GET            CHAR (4);                               00016480
                                                                        00016490
      IF W080_SSA_IND                  =   'ROT_STAT' THEN              00016500
                                                                        00016510
         /*---------------------------------------------------------*/  00016520
         /* LESER ROT OG SISTE STATUS, IKKE OPPHØRTE PERSONER.      */  00016530
         /*---------------------------------------------------------*/  00016540
                                                                        00016550
         CALL PLITDLI                      (FEM                      ,  00016560
                                            W080_GET                 ,  00016570
                                            RF4                      ,  00016580
                                            SEGMENTER                ,  00016590
                                            SSA_ROT                  ,  00016600
                                            SSA_STATUS              );  00016610
                                                                        00016620
      ELSE                                                              00016630
         /*---------------------------------------------------------*/  00016640
         /* KVALIFISERER PÅ ROT                                     */  00016650
         /*---------------------------------------------------------*/  00016660
                                                                        00016670
         CALL PLITDLI                      (FEM                      ,  00016680
                                            W080_GET                 ,  00016690
                                            RF4                      ,  00016700
                                            SEGMENTER                ,  00016710
                                            SSA_ROT_GU               ,  00016720
                                            SSA_STATUS              );  00016730
                                                                        00016740
                                                                        00016750
                                                                        00016760
      IF DLIUIB.UIBFCTR               ^=   '00000000'B             THEN 00016770
         DO;                                                            00016780
  L130:                                                                 00016790
            DIV_PARAM_OMR.FEIL_MELD_NR =    500                        ;00016800
            DIV_PARAM_OMR.FEIL_VED_LABEL=  '130'                       ;00016810
            INGEN_FEIL                 =    FALSE                      ;00016820
            MELDING                    =   'UIB-FEIL I P080_. RF-DB ' !!00016830
                                           'KODER : '                 !!00016840
                                            UNSPEC (UIBFCTR) !! ' '   !!00016850
                                            UNSPEC (UIBDLTR)          !!00016860
                                          ' FNR: ' !! FNR_PIC          ;00016870
            GOTO P080_END;                                              00016880
         END;                                                           00016890
                                                                        00016900
                                                                        00016910
      SELECT (RF4.STATUS_KODE);                                         00016920
                                                                        00016930
         WHEN ('  ','GA','GK')                                          00016940
            DO;                                                         00016950
               MER_DATA                =    TRUE;                       00016960
            END;                                                        00016970
                                                                        00016980
         WHEN ('GB')                                                    00016990
            DO;                                                         00017000
               MER_DATA                =    FALSE;                      00017010
               MELDING  = 'DATABASEN HAR NÅ BLITT GJENNOMLEST OG ' !!   00017020
                          'OPPDATERT VED HJELP AV NYE GRUNNBELØP GB';   00017030
            END;                                                        00017040
                                                                        00017050
         WHEN ('GE')                                                    00017060
            DO;                                                         00017070
               IF W080_GET             =   'GHU '   !                   00017080
                  W080_GET             =   'GU  '                 THEN  00017090
                  DO;                                                   00017100
                     MELDING =                                          00017110
                        'DETTE FØDSELSNUMMER FINNES IKKE I DATABASEN';  00017120
                     CALL P040_MAP_UT_OG_RETUR;                         00017130
                  END;                                                  00017140
               ELSE                                                     00017150
                  MELDING = 'DATABASEN HAR NÅ BLITT GJENNOMLEST OG ' !! 00017160
                            'OPPDATERT VED HJELP AV NYE GRUNNBELØP GE'; 00017170
                                                                        00017180
               MER_DATA                =   FALSE;                       00017190
            END;                                                        00017200
                                                                        00017210
         OTHERWISE                                                      00017220
            /*--------------------------------------------------------*/00017230
            /* FEIL STATUSKODE                                        */00017240
            /*--------------------------------------------------------*/00017250
            DO;                                                         00017260
  L140:                                                                 00017270
               DIV_PARAM_OMR.FEIL_MELD_NR  =   500                     ;00017280
               DIV_PARAM_OMR.FEIL_VED_LABEL=  '140'                    ;00017290
               INGEN_FEIL                  =   FALSE                   ;00017300
               MELDING                     =  'FEIL DLI-STATUSSKODE '!! 00017310
                                               RF4.STATUS_KODE       !! 00017320
                                             ' FRA ' !! W080_GET      ; 00017330
            END;                                                        00017340
                                                                        00017350
      END;  /* SELECT ..                                             */ 00017360
                                                                        00017370
                                                                        00017380
  P080_END:                                                             00017390
                                                                        00017400
 END P080_LES_ROT_STATUS_SEGM;                                          00017410
                                                                        00017420
                                                                        00017430
                                                                        00017440
  /*----------------------------------------------------------------*/  00017450
  /*                                                                */  00017460
  /* DENNE KALLES VED NORMAL OG UNORMAL AVSLUTNING PÅ KJØRINGEN .   */  00017470
  /*                                                                */  00017480
  /*----------------------------------------------------------------*/  00017490
                                                                        00017500
                                                                        00017510
  P999_SLUTT:                                                           00017520
    PROC;                                                               00017530
                                                                        00017540
                                                                        00017550
    DCL UNORMAL_AVSLUTNING     BIT (1)     INIT ('0'B)               ;  00017560
                                                                        00017570
                                                                        00017580
    EXEC CICS HANDLE    CONDITION ERROR   (ABEND)                    ;  00017590
                                                                        00017600
    IF ( S0019HO .ANT_Ø_BEHO = ( ANT_BEH - 1 ) !                        00017610
        TIDS_TEST           =  TID_UTE )       &                        00017620
                                                                        00017630
        MELDING             = (78)' '       THEN                        00017640
                                                                        00017650
        MELDING             =  'NORMALT AVSLUTTET PÅ FNR : ' !!         00017660
                                FNR_PIC !! '    TRYKK ENTER  !! '    ;  00017670
                                                                        00017680
    ELSE                                                                00017690
      IF ^INGEN_FEIL                                              THEN  00017700
         DO;                                                            00017710
            /*--------------------------------------------------------*/00017720
            /* FEIL I BEH. OPPDATERINGENE FJERNES OG TELLERE RESTILLES*/00017730
            /*--------------------------------------------------------*/00017740
                                                                        00017750
            EXEC CICS SYNCPOINT ROLLBACK                               ;00017760
                                                                        00017770
            S0019HO .ANT_G_STATO       =  S0019HO .ANT_G_STATO      - 1;00017780
                                                                        00017790
            IF W_ANT_OMR_FAM_OPPD                                   THEN00017800
               S0019HO .ANT_OMR_FAMO   =  S0019HO .ANT_OMR_FAMO     - 1;00017810
                                                                        00017820
            IF W_ANT_TIL_TRKLIST_OPPD                               THEN00017830
               S0019HO .ANT_TIL_TRKLISTO= S0019HO .ANT_TIL_TRKLISTO - 1;00017840
                                                                        00017850
            IF W_ANT_TIL_OMRNULL_OPPD                               THEN00017860
               S0019HO .ANT_TIL_OMRNULLO= S0019HO .ANT_TIL_OMRNULLO - 1;00017870
                                                                        00017880
            UNORMAL_AVSLUTNING         =  TRUE                         ;00017890
         END;                                                           00017900
                                                                        00017910
                                                                        00017920
    /*---------------------------------------------------------------*/ 00017930
    /* SKRIVER UT FEILMELDINGER FRA TAB. SOM TIDLIGERE ER FJERNET    */ 00017940
    /* VED  :     SYNCPOINT  ROLLBACK                                */ 00017950
    /*---------------------------------------------------------------*/ 00017960
                                                                        00017970
    DO F_IND = 1 TO 15 WHILE    (FEIL_TAB.MELD (F_IND) ^=  (78)' '    );00017980
                                                                        00017990
       FEIL_STRUC.FEIL_MELDING = FEIL_TAB.MELD (F_IND);                 00018000
       CALL P050_SKRIV_OMRFEIL;                                         00018010
    END;                                                                00018020
                                                                        00018030
                                                                        00018040
    EXEC CICS ASKTIME                                                 ; 00018050
    S0019HO .KLOKKE_LOGO     =  EIBTIME / 100                         ; 00018060
    S0019HI .DATO_LOGI       =  DATE()                                ; 00018070
    FEIL_STRUC.FEIL_MELDING  =  FNR_PIC    !! '   ' !!                  00018080
                                S0019HO .KLOKKE_LOGO                  ; 00018090
    CALL P050_SKRIV_OMRFEIL;                                            00018100
                                                                        00018110
                                                                        00018120
    S0019HO .MELDINGO        =   MELDING;                               00018130
    FEIL_STRUC.FEIL_MELDING  =   MELDING;                               00018140
    CALL P050_SKRIV_OMRFEIL;                                            00018150
                                                                        00018160
    /*------------------------------------------------------------*/    00018170
    /*    TERMINERER PSB'EN                                       */    00018180
    /*    SENDER UT MAP'EN OG SKRIVER PÅ LOGGEN .                 */    00018190
    /*    SIMULERER NY INNGANG FRA R0010426 HVIS ABEND            */    00018200
    /*------------------------------------------------------------*/    00018210
                                                                        00018220
    CALL P030_DATABASE    ('TERM')                                ;     00018230
                                                                        00018240
    EXEC CICS SEND MAP ('S0019H' ) MAPSET ('S0019H3') WAIT              00018250
                                           DATAONLY;                    00018260
    S0019HO .RECORD_TYPEO    = 'S';                                     00018270
    S0019HO .FNRO            =  FNR_PIC;                                00018280
                                                                        00018290
                                                                        00018300
    IF ANT_BEH               >  0                               THEN    00018310
                                                                        00018320
       EXEC CICS WRITE DATASET ('OMRLOGG') FROM     ( MAP_CHAR)         00018330
                                           RIDFLD   ( LOGG_RBA) RBA;    00018340
                                                                        00018350
                                                                        00018360
    IF UNORMAL_AVSLUTNING                                       THEN    00018370
       DO;                                                              00018380
          DIV_PARAM_OMR.PROGRAM_ID  = 'R0010426'                   ;    00018390
          EXEC CICS RETURN TRANSID   ('RH01') COMMAREA ( KOM_OMR ) ;    00018400
       END;                                                             00018410
    ELSE                                                                00018420
       DO;                                                              00018430
          EXEC CICS RECEIVE MAP ('S0019H' ) MAPSET ('S0019H3')          00018440
                                            SET    (BMSMAPBR);          00018450
                                                                        00018460
          /*------------------------------------------------------*/    00018470
          /* SKRIVER PAUSEBILDE                                   */    00018480
          /*------------------------------------------------------*/    00018490
                                                                        00018500
          EXEC CICS SEND MAP ('S001012') MAPSET ('S001013')             00018510
                                         MAPONLY  ERASE            ;    00018520
          EXEC CICS RETURN                                         ;    00018530
       END;                                                             00018540
                                                                        00018550
  END P999_SLUTT;                                                       00018560
                                                                        00018570
                                                                        00018580
                                                                        00018590
                                                                        00018600
  /* ********************************************************** */      00018610
  /* LABLER VED ABEND-SITUASJONER                               */      00018620
  /* ********************************************************** */      00018630
                                                                        00018640
                                                                        00018650
  CICS_ABEND:                                                           00018660
    INGEN_FEIL =  FALSE                                            ;    00018670
    MELDING    = 'STOPP P.G.A CICS - ABEND, FNR: ' !!                   00018680
                  FNR_PIC  !! ' TA HARD-COPY !! TRYKK ENTER !! '   ;    00018690
                                                                        00018700
    CALL P999_SLUTT ;                                                   00018710
                                                                        00018720
                                                                        00018730
  ABEND:                                                                00018740
    EXEC CICS ABEND ABCODE ('FEIL')                                ;    00018750
                                                                        00018760
                                                                        00018770
                                                                        00018780
  /* ********************************************************** */      00018790
  /*          E K S T E R N E    P R O C E D U R E R            */      00018800
  /* ********************************************************** */      00018810
                                                                        00018820
                                                                        00018830
 %PAGE;                                                                 00018840
 %INCLUDE R0019901;          /*     F_GYLDIG_DATO       */              00018850
 %PAGE;                                                                 00018860
 %INCLUDE R0019902;          /*     F_KJØNN             */              00018870
 %PAGE;                                                                 00018880
 %INCLUDE R0019904;          /*     F_GYLDIG_FNR        */              00018890
 %PAGE;                                                                 00018900
 %INCLUDE R0019910;          /*     F_NUMERISK          */              00018910
 %PAGE;                                                                 00018920
 %INCLUDE R0019913;          /*     F_SNU_DATO          */              00018930
 %PAGE;                                                                 00018940
 %INCLUDE R0019956;          /*     P9956_BER_G_CICS    */              00018950
                                                                        00018960
                                                                        00018970
 END R0019H;                                                            00018980
                                                                        00018990
