 /*       SIST ENDRET 25/07-94 13.56.34 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 25/02-94 12.55.34 AV   HERMAN                   */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /* **********************                                            */00000040
 /*  PROGRAM-IDENT : R001UC01 KONTROLL_GRUNNBLANKETT_FO  HOVEDPROG    */00000050
 /*  PROGRAM-SPRÅK : PLI - CICS                                       */00000060
 /*  PROGRAMMERER  : SATISH PATHAK                                    */00000070
 /*  PROGRAMMET BLE LAGET : NOV        1993                           */00000080
 /* ***************************************************************** */00000090
 /*HENSIKT:                                                           */00000100
 /* **********                                                        */00000110
 /*  PROGRAMMET KONTROLLERER GRUNNBLANKETT FORSØRGINGSTILLEGG.        */00000120
 /*  BLANKETTEN KONTROLLERES ISOLERT - IKKE MOT STATUS.               */00000130
 /*  OPERATØREN KAN BRUKE PF-TASTENE :                                */00000140
 /*    PF1  FØRER TIL OPPBEVARING AV TRANSEN I VENTEREGISTERET.       */00000150
 /*    PF2  FØRER TIL AT TRANSAKSJONEN FORKASTES -                    */00000160
 /*    I BEGGE TILFELLER SKRIVES DET UT MELDING PÅ SKJERM, OG         */00000170
 /*    PROGRAM R0010401 SØRGER FOR Å LEGGE UT NYTT BILDE FOR          */00000180
 /*    REGISTRERING AV A1 - TRANSKODE RN41.                           */00000190
 /*  NÅR INGEN FEIL MER FINNES SETTES TRANSKODE = R042, OG DET        */00000200
 /*  RETURNERES TIL R0010401.                                         */00000210
 /*                                                                   */00000220
 /* ***************************************************************** */00000230
 /*PROGRAMTILKNYTTING:                                                */00000240
 /* ********************                                              */00000250
 /*  PROGRAMMET KALLES FRA R001C401                                   */00000260
 /*  PROGRAMMET HAR EXEC CICS XCTL TIL :                              */00000270
 /*             R0010301 - VALG_AV_FUNKSJON                           */00000280
 /*             R0010401 - REGISTRERING                               */00000290
 /*  PROGRAMMET HAR EXEC CICS LINK TIL :                              */00000300
 /*             R0010490 - SKRIV_UT_PÅ_VENTEREG                       */00000310
 /* ***************************************************************** */00000320
 R001UC:                                                                00000330
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000340
 %PAGE;                                                                 00000350
 %INCLUDE S001UC;    /*  FO-MAPSETTET   */                              00000360
 %PAGE;                                                                 00000370
 %INCLUDE P001UC01;  /*  TRANSOMR FOR FORSØRGINGSTILL.EKTEF/BARN */     00000380
 %PAGE;                                                                 00000390
 %INCLUDE P0019906;  /*  TRANS-OPPL-OMRÅDE (BASED)      */              00000400
 %PAGE;                                                                 00000410
 %INCLUDE P0019908;  /*  KOM-OMRÅDE (BASED)             */              00000420
 %PAGE;                                                                 00000430
 %INCLUDE P0019910;  /*  STYRINGS-OMRÅDE (BASED)        */              00000440
 %PAGE;                                                                 00000450
 %INCLUDE P0019912;  /*  DIV-PARAM-OMRÅDE (BASED)       */              00000460
 %PAGE;                                                                 00000470
 %INCLUDE DFHBMSCA;                                                     00000480
 %PAGE;                                                                 00000490
   DCL                                                                  00000500
      (BMSMAPBR,COMMAREA_PEKER) PTR;                                    00000510
   DCL                                                                  00000520
      (ADDR,UNSPEC,CSTG,ONCODE,VERIFY,SUBSTR) BUILTIN;                  00000530
   DCL                                                                  00000540
      FEIL_FUNNET  BIT (1),                                             00000550
      ONKODE PIC'9999',                                                 00000560
      CURSOR_POS FIXED BIN(15) INIT(-1),                                00000570
      ONK DEF ONKODE CHAR(4),                                           00000580
      FEILKODE       CHAR(4),                                           00000590
      DSNAVN         CHAR(8),                                           00000600
      ANT_FEIL_SKREVET FIXED DEC (3);                                   00000610
 %SKIP(1);                                                              00000620
 %PAGE;                                                                 00000630
      ON ERROR SNAP BEGIN       ;                                       00000640
         ON ERROR SYSTEM        ;                                       00000650
         ONKODE=ONCODE          ;                                       00000660
         FEILKODE = ONK         ;                                       00000670
         DSNAVN   = EIBDS       ;                                       00000680
         GO TO FEILBEH          ;                                       00000690
      END;                                                              00000700
                                                                        00000710
 FEILKODE   = 'FEIL'    ;                                               00000720
 DSNAVN     = '        ';                                               00000730
                                                                        00000740
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00000750
                                                                        00000760
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00000770
                                                                        00000780
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000790
                                                                        00000800
                                                                        00000810
 IF FRA_CICS THEN                                                       00000820
  DO;                                                                   00000830
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);00000840
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);     00000850
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);  00000860
  END;                                                                  00000870
                                                                        00000880
 IF HENT_FRAM_MAP  THEN                                                 00000890
   DO;                                                                  00000900
     EXEC CICS SEND MAP('S001UC1') MAPSET('S001UC3') MAPONLY            00000910
                                                   SET (BMSMAPBR);      00000920
     ALLOCATE S001UC1O;                                                 00000930
     S001UC1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                     00000940
   END;                                                                 00000950
                                                                        00000960
 RECEIVE_MAP:                                                           00000970
                                                                        00000980
                                                                        00000990
 IF ^HENT_FRAM_MAP THEN                                                 00001000
    DO;                                                                 00001010
       EXEC CICS RECEIVE MAP('S001UC1')                                 00001020
                                    MAPSET('S001UC3') SET(BMSMAPBR);    00001030
       CALL BLANK_FO_MELDNR;                                            00001040
       FEIL_MELD_NR = 0;                                                00001050
    END;                                                                00001060
 IF FUNKSJONSKODEL > 0 THEN                                             00001070
    DO;                                                                 00001080
       FUNKSJONSKODE = FUNKSJONSKODEI;                                  00001090
       EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);            00001100
    END;                                                                00001110
                                                                        00001120
 IF STYRE_KODEL > 0 THEN                                                00001130
    DO;                                                                 00001140
       STYREKODE = STYRE_KODEI;                                         00001150
       TRANSKODE = 'R041';                                              00001160
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00001170
    END;                                                                00001180
                                                                        00001190
                                                                        00001200
 IF STYREKODE ^= 'FO'  &  FRA_CICS THEN                                 00001210
    TRANSKODE = 'R041';                                                 00001220
                                                                        00001230
 ELSE                                                                   00001240
  DO;                                                                   00001250
   TRANS_RETURKODE = TRANSKODE;                                         00001260
   ANT_FEIL_SKREVET = 0;                                                00001270
   FEIL_FUNNET = '0'B;                                                  00001280
                                                                        00001290
                                                                        00001300
   SELECT (TRANSKODE);                                                  00001310
    WHEN('RUC0')                                                        00001320
       DO;                                                              00001330
          CALL BLANK_FO_SØKER;                           /*UC02*/       00001340
          CALL BLANK_FO_SØKER2;                          /*UC02*/       00001350
          CALL BLANK_FO_MELDNR;                          /*UC02*/       00001360
          CALL BLANK_FO_BARN;                           /*UC02*/        00001370
          CALL OVERFØR_FO_SØKER;                                        00001380
          CALL KONTROLL_FO_SØKER(FEIL_FUNNET);          /*UC03*/        00001390
       END;                                                             00001400
    WHEN('RUC1')                                                        00001410
       DO;                                                              00001420
         CALL BLANK_FO_MELDNR;                           /*UC02*/       00001430
         IF FUNKSJONSKODE ^= 'V' THEN                                   00001440
            CALL BLANK_FO_BARN;                          /*UC02*/       00001450
         CALL OVERFØR_FO_SØKER;                         /*UC07*/        00001460
         CALL KONTROLL_FO_SØKER(FEIL_FUNNET);                           00001470
       END;                                                             00001480
    WHEN('RUC2')                                                        00001490
       DO;                                                              00001500
          CALL BLANK_FO_MELDNR;                                         00001510
          CALL OVERFØR_FO_SØKER;                                        00001520
          CALL OVERFØR_FO_SØKER2;                     /*UC09*/          00001530
          CALL BLANK_FO_BARN_REST;                                      00001540
          CALL OVERFØR_FO_BARN;                       /*UC10*/          00001550
          CALL KONTROLL_FO_SØKER(FEIL_FUNNET);                          00001560
          IF F_FELT_PIC_CHAR2(FOS.BT_ANT) = '00' THEN                   00001570
             CALL BLANK_FO_BARN;                                        00001580
          ELSE                                                          00001590
             CALL KONTROLL_FO_BARN(FEIL_FUNNET);      /*UC04*/          00001600
                                                                        00001610
                                                                        00001620
          IF FOS.TILL_EK = 'J'                      THEN                00001630
                    CALL KONTROLL_ARBEIDSINNTEKT (FOS.VIRK_DATO_MÅ);    00001640
                                                                        00001650
       END;                                                             00001660
    WHEN('RUC3')                                                        00001670
       DO;                                                              00001680
          CALL BLANK_FO_MELDNR;                                         00001690
          CALL OVERFØR_FO_SØKER;                                        00001700
          CALL OVERFØR_FO_SØKER2;                                       00001710
          CALL KONTROLL_FO_SØKER(FEIL_FUNNET);                          00001720
                                                                        00001730
          IF FOS.TILL_EK = 'J'                      THEN                00001740
                    CALL KONTROLL_ARBEIDSINNTEKT (FOS.VIRK_DATO_MÅ);    00001750
       END;                                                             00001760
    OTHERWISE;                                                          00001770
       /* INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER */00001780
   END;  /*   SELECT   */                                               00001790
                                                                        00001800
    IF F_FELT_PIC_CHAR2(FOS.BT_ANT) ^= '00' & ^FEIL_FUNNET THEN         00001810
       TRANSKODE = 'RUC2';                                              00001820
    IF F_FELT_PIC_CHAR2(FOS.BT_ANT) = '00' & ^FEIL_FUNNET THEN          00001830
       TRANSKODE = 'RUC3';                                              00001840
    IF TRANSKODE = 'RUC2' & F_FELT_PIC_CHAR2(FOS.BT_ANT) = '00' THEN    00001850
       TRANSKODE = 'RUC1';                                              00001860
                                                                        00001870
                                                                        00001880
 IF FEIL_FUNNET ! HENT_FRAM_MAP ! FRA_UTEN_DIALOG !                     00001890
    TRANS_RETURKODE ^= TRANSKODE THEN                                   00001900
    DO;                                                                 00001910
       IF TRANSKODE = 'RUC0' THEN                                       00001920
          TRANSKODE = 'RUC1';                                           00001930
       CALL BLANK_FO_MAP;                                               00001940
       CALL OVERFØR_FO_SØKER_MAP;                                       00001950
                                                                        00001960
       SELECT (TRANSKODE);                                              00001970
          WHEN ('RUC1')                                                 00001980
             DO;                                                        00001990
                CALL FJERN_TEKST_BARN;                                  00002000
                CALL FJERN_TEKST_SØKER2;                                00002010
                CALL BLOKKERE_BARN;                                     00002020
             END;                                                       00002030
          WHEN ('RUC2')                                                 00002040
             DO;                                                        00002050
                CALL TEKST_BARN;                                        00002060
                CALL BLANK_FO_BARN_REST;                                00002070
                CALL OVERFØR_FO_BARN_MAP;                               00002080
                CALL TEKST_SØKER2;                                      00002090
                CALL OVERFØR_FO_SØKER2_MAP;                             00002100
             END;                                                       00002110
          WHEN ('RUC3')                                                 00002120
             DO;                                                        00002130
                CALL FJERN_TEKST_BARN;                                  00002140
                CALL BLOKKERE_BARN;                                     00002150
                CALL TEKST_SØKER2;                                      00002160
                CALL OVERFØR_FO_SØKER2_MAP;                             00002170
             END;                                                       00002180
          OTHERWISE;                                                    00002190
       END;                                                             00002200
                                                                        00002210
      IF HENT_FRAM_MAP THEN                                             00002220
        EXEC CICS SEND MAP('S001UC1') MAPSET('S001UC3') ERASE CURSOR;   00002230
      ELSE                                                              00002240
        EXEC CICS SEND MAP('S001UC1') MAPSET('S001UC3') ERASEAUP        00002250
                                                     DATAONLY CURSOR;   00002260
      HENT_FRAM_MAP = '0'B;                                             00002270
      FEIL_MELD_NR  = 666;                                              00002280
                                                                        00002290
      IF  FRA_CICS THEN                                                 00002300
        EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);          00002310
      ELSE                                                              00002320
        GOTO RECEIVE_MAP;                                               00002330
    END;                                                                00002340
                                                                        00002350
   ELSE                                                                 00002360
                                                                        00002370
    DO;                                                                 00002380
                                                                        00002390
      IF TRANSKODE = 'RUC0' THEN                                        00002400
        TRANS_RETURKODE = 'RUC1';                                       00002410
      ELSE                                                              00002420
        TRANS_RETURKODE = TRANSKODE;                                    00002430
      IF  FRA_CICS  THEN                                                00002440
        DO;                                                             00002450
          BLANKETTYPE = STYREKODE;                                      00002460
          TRANSKODE = 'R042';                                           00002470
        END;                                                            00002480
    END;                                                                00002490
  END;                                                                  00002500
                                                                        00002510
  CALL UTGANG;                                                          00002520
                                                                        00002530
  UTGANG: PROC;                                                         00002540
    IF  FRA_CICS THEN                                                   00002550
      EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);             00002560
    ELSE                                                                00002570
      EXEC CICS RETURN;                                                 00002580
  END UTGANG;                                                           00002590
                                                                        00002600
  FEILBEH:                                                              00002610
                                                                        00002620
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00002630
                                                                        00002640
     PROGRAM_ID = 'R001NC01';                                           00002650
     S001UC1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                     00002660
                                                                        00002670
     S001UC1O.MELDING2O =                                               00002680
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00002690
                                                                        00002700
     S001UC1O.MELDING3O =                                               00002710
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00002720
                                                                        00002730
     S001UC1O.MELDING4O =                                               00002740
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00002750
                                         !! '. DATASETT : ' !! DSNAVN;  00002760
                                                                        00002770
     S001UC1O.MELDING5O =                                               00002780
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00002790
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00002800
                                                                        00002810
     S001UC1O.MELDING6O =                                               00002820
                   'TA UTSKRIFO!!!. TRYKK DERETTER "ENTER".';           00002830
                                                                        00002840
                                                                        00002850
     EXEC CICS SEND MAP('S001UC1')                                      00002860
                                                 MAPSET('S001UC3');     00002870
                                                                        00002880
     EXEC CICS RECEIVE MAP('S001UC1')                                   00002890
                                    MAPSET('S001UC3') SET(BMSMAPBR);    00002900
                                                                        00002910
                                                                        00002920
     EXEC CICS SYNCPOINT ROLLBACK;                                      00002930
                                                                        00002940
                                                                        00002950
     TERMINERINGS_IND = 'F';                                            00002960
                                                                        00002970
     TRANSKODE  = 'R041';                                               00002980
                                                                        00002990
     CALL UTGANG;                                                       00003000
                                                                        00003010
  ABEND:                                                                00003020
     EXEC CICS ABEND ABCODE(FEIL);                                      00003030
                                                                        00003040
  PF1:                                                                  00003050
                                                                        00003060
 /* LEGGER UNDERKJENT TRANS UT PÅ VENTEDATABASE HVIS GYLDIG     */      00003070
 /* FNR OG VIRKNINGSDATO,ELLERS FORKASTES TRANSAKSJONEN.        */      00003080
                                                                        00003090
     IF ^(FOS.FNRNR = 1          !                                      00003100
          FOS.FNRNR = 200        !                                      00003110
          FOS.VIRK_DATO_MÅNR = 9 !                                      00003120
          FOS.VIRK_DATO_MÅNR = 200) THEN                                00003130
        DO;                                                             00003140
                                                                        00003150
           IF FØDSNUMMER    = 0   THEN                                  00003160
                                                                        00003170
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER FORKASTET.           */      00003180
                                                                        00003190
              DO;                                                       00003200
                 FEIL_MELD_NR  = 0;                                     00003210
                 S001UC1O.MELDING6O =                                   00003220
                         'REGISTERINGEN ER IKKE AVSLUTTET MED "ENTER"'!!00003230
                         '.TRANSAKSJONEN ER FORKASTET.';                00003240
                                                                        00003250
              END;                                                      00003260
           ELSE                                                         00003270
              DO;                                                       00003280
                                                                        00003290
                 SEARCH_FNR  = TRANS_OPPL_OMR.FØDSNUMMER;               00003300
                 IF FRA_CICS THEN                                       00003310
                    BLANKETTYPE = STYREKODE;                            00003320
                                                                        00003330
                                                                        00003340
                 IF FEIL_MELD_NR = 666 &      /*BLANKETTKONTROLLFEIL*/  00003350
                    ^FRA_MED_DIALOG     THEN  /*IKKE BASEKONTROLLFEIL*/ 00003360
                    FUNKSJONSKODE = 'B';                                00003370
                                                                        00003380
                 IF F_FELT_PIC_CHAR2(FOS.BT_ANT) ^= '00'  THEN          00003390
                    DO;                                                 00003400
                       CALL BLANK_FO_MELDNR;                            00003410
                       CALL BLANK_FO_BARN_REST;                         00003420
                       CALL OVERFØR_FO_BARN_MAP;                        00003430
                    END;                                                00003440
                                                                        00003450
                 FEIL_MELD_NR  = 0;                                     00003460
                                                                        00003470
                 EXEC CICS LINK PROGRAM('R0010490') COMMAREA(KOM_OMR);  00003480
                                                                        00003490
                 IF FEIL_MELD_NR > 0 THEN                               00003500
                    DO;                                                 00003510
                       DSNAVN   = 'R0010490';                           00003520
                       FEILKODE = DB_STATUS_KODE;                       00003530
                       GO TO FEILBEH;                                   00003540
                    END;                                                00003550
                                                                        00003560
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER LAGT UT PÅ VENTEBASE.*/      00003570
                                                                        00003580
                                                                        00003590
                 S001UC1O.MELDING6O =                                   00003600
                         'TRANSAKSJONEN ER LAGT UT PÅ VENTEREGISTER.';  00003610
              END;                                                      00003620
                                                                        00003630
                                                                        00003640
           EXEC CICS SEND MAP('S001UC1') MAPSET('S001UC3')              00003650
                                                           DATAONLY;    00003660
     /* DUMMY SEND-KALL.                              */                00003670
                                                                        00003680
           EXEC CICS SEND MAP('S001UC1')                                00003690
                                                  MAPSET('S001UC3');    00003700
           EXEC CICS DELAY INTERVAL(005);                               00003710
                                                                        00003720
           TERMINERINGS_IND = 'F';                                      00003730
                                                                        00003740
           TRANSKODE  = 'R041';                                         00003750
                                                                        00003760
           CALL UTGANG;                                                 00003770
                                                                        00003780
        END;                                                            00003790
     ELSE                                                               00003800
        DO;                                                             00003810
           TERMINERINGS_IND = 'F';                                      00003820
                                                                        00003830
           TRANSKODE = 'R041';                                          00003840
                                                                        00003850
           S001UC1O.MELDING6O =                                         00003860
                                                                        00003870
   'NB** TRANSAKSJONEN ER FORKASTET P.G.A. UGYLDIG FNR EL. VDATO **NB'; 00003880
                                                                        00003890
           EXEC CICS SEND MAP('S001UC1') MAPSET('S001UC3')              00003900
                                                           DATAONLY;    00003910
     /* DUMMY SEND-KALL.                            */                  00003920
                                                                        00003930
           EXEC CICS SEND MAP('S001UC1')                                00003940
                                    MAPSET('S001UC3');                  00003950
                                                                        00003960
           EXEC CICS DELAY INTERVAL(005);                               00003970
           CALL UTGANG;                                                 00003980
        END;                                                            00003990
                                                                        00004000
                                                                        00004010
  PF2:                                                                  00004020
     TERMINERINGS_IND   = 'F';                                          00004030
                                                                        00004040
     S001UC1O.MELDING6O =                                               00004050
      'NBNBNBNBNB***    TRANSAKSJONEN ER FORKASTET.    ***NBNBNBNBNB';  00004060
                                                                        00004070
     EXEC CICS SEND MAP('S001UC1') MAPSET('S001UC3')                    00004080
                                                      DATAONLY ;        00004090
     /* DUMMY SEND-KALL.                                     */         00004100
                                                                        00004110
     EXEC CICS SEND MAP('S001UC1')                                      00004120
                                    MAPSET('S001UC3');                  00004130
     EXEC CICS DELAY INTERVAL(005);                                     00004140
                                                                        00004150
                                                                        00004160
     TRANSKODE = 'R041';                                                00004170
                                                                        00004180
     CALL UTGANG;                                                       00004190
 %PAGE;                                                                 00004200
      %INCLUDE R001UC02;               /* BLANK  ARBEIDSOMRÅDE */       00004210
      %INCLUDE R001UC03;               /* KONTROLL AV SØKERDELEN */     00004220
      %INCLUDE R001UC04;               /* KONTROLL AV BARNEDATA */      00004230
      %INCLUDE R001UC05;               /* KONTROLL AV EK_INNTEKT*/      00004240
      %INCLUDE R001UC06;               /* ARBEIDSOMRÅDE -> MAP */       00004250
      %INCLUDE R001UC07;               /* FORTEKSTER OG ATTRIBUTTER*/   00004260
                                       /* SØKER-DEL2       */           00004270
      %INCLUDE R001UC09;               /* MAP -> ARBEIDSOMRÅDE */       00004280
      %INCLUDE R001UC10;               /* FLYTTING AV BARNEDATA */      00004290
 %PAGE;                                                                 00004300
      %INCLUDE R0019901;               /*  TESTER OM DATO ER GYLDIG */  00004310
      %INCLUDE R0019902;               /*  FINNE KJØNN     */           00004320
      %INCLUDE R0019904;               /* FØDSELSNUMMERKONTROLL */      00004330
      %INCLUDE R0019905;               /* F_ALDER               */      00004340
      %INCLUDE R0019910;               /* NUMERISK KONTROLL */          00004350
      %INCLUDE R0019911;               /*  DATO KONTROLL  */            00004360
      %INCLUDE R0019912;  /* KONVERTERING CHAR ==> PIC / PIC ==> CHAR */00004370
      %INCLUDE R0019913;               /* F_SNU_DATO     */             00004380
      %INCLUDE R0019944;               /* SKRIV_FEIL      */            00004390
      %INCLUDE R0019964;               /* DAGENS DATO + 6 MDR */        00004400
      %INCLUDE R0019956;          /*     P9956_BER_G_CICS    */         00004410
                                                                        00004420
   END R001UC;                                                          00004430
