 /*       SIST ENDRET 30/10-98 10.35.28 AV   JDA7339                  */00000000
 /*       SIST ENDRET 30/10-98 10.32.24 AV   JDA7339                  */00000010
 /*       SIST ENDRET 27/05-98 14.00.52 AV   JDA7339                  */00000020
 /*       SIST ENDRET 27/05-98 13.55.28 AV   JDA7339                  */00000030
 /*       SIST ENDRET 03/03-98 12.42.05 AV   JDA7339                  */00000040
 /*       SIST ENDRET 03/03-98 12.36.43 AV   JDA7339                  */00000050
 /* NB!!! FJERNET CALL TIL R0016001       TRUDE 01.09.97              */00000060
 /*       SIST ENDRET 28/07-97 12.33.44 AV   HLA7339                  */00000070
 /*       SIST ENDRET 12/06-97 09.32.48 AV   HLA7339                  */00000080
 /*       SIST ENDRET 07/03-96 17.44.06 AV   HLB0310                  */00000090
 /*       SIST ENDRET 16/11-94 09.39.03 AV   JDA0310                  */00000100
 /*       SIST ENDRET 30/08-94 09.49.38 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 24/05-94 14.03.51 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 05/01-93 14.07.43 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 08/05-92 09.03.22 AV   HERMAN                   */00000140
 /*       SIST ENDRET 04/05-92 11.41.44 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 08/04-92 09.03.32 AV   HERMAN                   */00000160
 /*       SIST ENDRET 03/04-92 14.52.28 AV   HERMAN                   */00000170
 /*       SIST ENDRET 17/01-92 11.20.18 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 18/12-91 17.00.44 AV   HERMAN                   */00000190
 /*       SIST ENDRET 06/03-91 14.32.23 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 07/09-90 14.11.49 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 30/08-90 08.54.59 AV   DYBVIK                   */00000220
 /*       SIST ENDRET 08/03-90 13.10.16 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 16/10-89 13.07.15 AV   DYBVIK                   */00000240
 /*       SIST ENDRET 12/05-89 08.38.06 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 14/04-89 14.46.41 AV   DYBVIK                   */00000260
 /*       SIST ENDRET 11/11-86 11.52.11 AV   DYBVIK                   */00000270
 /*       SIST ENDRET 11/06-86 15.46.55 AV   FARVIK                   */00000280
 /*       SIST ENDRET 05/11-85 08.57.39 AV   LUNDEBY                  */00000290
 /*       SIST ENDRET 14/10-85 10.43.27 AV   FARVIK                   */00000300
 /*       SIST ENDRET 19/12-84 09.54.10 AV   FARVIK                   */00000310
 /*       SIST ENDRET 03/12-84 14.47.02 AV   HERMAN                   */00000320
 /*       SIST ENDRET 13/11-84 11.05.02 AV   FARVIK                   */00000330
 /*       SIST ENDRET 06/11-84 15.22.59 AV   HERMAN                   */00000340
 /*       SIST ENDRET 06/11-84 13.46.36 AV   TRY                      */00000350
 /*       SIST ENDRET 30/10-84 16.26.48 AV   FARVIK                   */00000360
 /*       SIST ENDRET 05/10-84 14.33.31 AV   FARVIK                   */00000370
 /*       SIST ENDRET 17/09-84 16.34.16 AV   FARVIK                   */00000380
                                                                        00000390
                                                                        00000400
 /* ***************************************************************** */00000410
 /*IDENTIFIKASJON:                                                    */00000420
 /*     R0013001 - PROCEDYRE I PLI                                    */00000430
 /*     PROGRAMMERER: P. BERGESTAD, FEBRUAR 1982                      */00000440
 /*     FULLSTENDIG ENDRET AV HANSEN/FARVIK.DES -82.                  */00000450
 /*HENSIKT:                                                           */00000460
 /*                                                                   */00000470
 /*PROGRAMTILKNYTNING:                                                */00000480
 /*                                                                   */00000490
 /*                                                                   */00000500
 /*BRUK:                                                              */00000510
 /*                                                                   */00000520
 /* ***************************************************************** */00000530
 R00130:                                                                00000540
   PROC(COMMAREA_PEKER)  OPTIONS(MAIN);                                 00000550
                                                                        00000560
 %PAGE;                                                                 00000570
 %INCLUDE S00101  ;  /*  MENY-MAPSET             */                     00000580
 %PAGE;                                                                 00000590
 %INCLUDE P0019908;  /*  KOM_OMR        (BASED)  */                     00000600
 %PAGE;                                                                 00000610
 %INCLUDE P0019906;  /*  TRANS_OPPL_OMR (BASED)  */                     00000620
 %PAGE;                                                                 00000630
 %INCLUDE P0019910;  /*  STYRINGS_OMR   (BASED)  */                     00000640
 %PAGE;                                                                 00000650
 %INCLUDE P0019014;  /*  COPYMBR FOR 70/7101     */                     00000660
 %PAGE;                                                                 00000670
                                                                        00000680
 DCL                                                                    00000690
   1 TRANS_LISTE_OMR UNAL BASED      (TRANS_LISTE_PEKER),               00000700
     3 TRANS_LISTE_LINJE(5),                                            00000710
 %INCLUDE P0019911;  /*  TRANS-LISTE UNDERNIVÅ   */                     00000720
 %PAGE;                                                                 00000730
                                                                        00000740
 DCL                                                                    00000750
   1 WORK_TRANS_LISTE UNAL BASED      (WORK_TRANS_LISTE_PEKER),         00000760
 %INCLUDE P0019911;  /* TRANS-LISTE UNDERNIVÅ     */                    00000770
 %PAGE;                                                                 00000780
                                                                        00000790
 %INCLUDE P0019912;  /*  DIV_PARAM_OMR  (BASED)  */                     00000800
 %PAGE;                                                                 00000810
 DCL                                                                    00000820
     1 B00 BASED(B00_PEKER),                                            00000830
 %INCLUDE P0019921;                                                     00000840
 %PAGE;                                                                 00000850
 DCL                                                                    00000860
     1 B01 BASED(B01_PEKER),                                            00000870
 %INCLUDE P0019921;                                                     00000880
 %PAGE;                                                                 00000890
 DCL                                                                    00000900
     1 B02 BASED(B02_PEKER),                                            00000910
 %INCLUDE P0019921;                                                     00000920
 %PAGE;                                                                 00000930
   DCL                                                                  00000940
      HUSK_TRANS_OPPL_PEKER      POINTER,                               00000950
  /*  WORK_TRANS_OPPL_PEKER      POINTER, */                            00000960
      HUSK_TRANS_PEKER           POINTER,                               00000970
      START_TRANS_OPPL_PEKER     POINTER,                               00000980
      START_TRANS_PEKER          POINTER,                               00000990
      START_DIV_PARAM_PEKER      POINTER,                               00001000
      BMSMAPBR                   POINTER,                               00001010
      JA                         BIT(1)       INIT  ('1'B),             00001020
      NEI                        BIT(1)       INIT  ('0'B),             00001030
      HFELT                      CHAR(20),                              00001040
      STOP                       CHAR(4)      INIT  ('STOP'),           00001050
      OPPBEVARE                  CHAR(1)      INIT  ('O'),              00001060
      FORKASTE                   CHAR(1)      INIT  ('F'),              00001070
      ENTER                      CHAR(1)      INIT  ('A'),              00001080
      FATAL_FEIL                 CHAR(1)      INIT  ('S'),              00001090
      I                          FIXED   BIN(15),                       00001100
      W_ANTALL_TRANS_I_TRANS_LISTE FIXED BIN(15),                       00001110
      ANTALL_TRANSER_IGJEN       PIC '9',                               00001120
      ONKODE                     PIC'9999',                             00001130
      CURSOR_POS                 FIXED BIN(15) INIT(-1),                00001140
      ONK             DEF ONKODE CHAR(4),                               00001150
      WORK_TRANS_RETURKODE       CHAR(4),                               00001160
      FEILKODE                   CHAR(4),                               00001170
      W_VIRKDATO                 PIC '9999',                            00001180
      W_TRANSTYPE                PIC '99',                              00001190
      DSNAVN                     CHAR(8),                               00001200
      GML_VIRK_DATO_ÅM           FIXED   DEC(4);                        00001210
                                                                        00001220
  /*YS*/                                                                00001230
  /*YS*/ DCL  K                  FIXED BIN(15),                         00001240
  /*YS*/      M                  FIXED BIN(15);                         00001250
  /*YS*/                                                                00001260
                                                                        00001270
  DCL FNR_PIC                    PIC '(11)9'  INIT ( 0 )  ;             00001280
  DCL FNR_CHAR                   CHAR (11)    DEF FNR_PIC ;             00001290
                                                                        00001300
  DCL COMMAREA_PEKER             POINTER;                               00001310
                                                                        00001320
    DCL                                                                 00001330
       1 FEIL_STRUC,                                                    00001340
         2 FEIL_NR          FIXED DEC(5),                               00001350
         2 FEIL_MELDING     CHAR(78),                                   00001360
         2 KOM_OMR_PEKER    POINTER;                                    00001370
                                                                        00001380
   DCL                                                                  00001390
      1 DATO    CHAR(6),                                                00001400
      1 DAT DEF DATO,                                                   00001410
         2 ÅR   PIC'99',                                                00001420
         2 MN   PIC'99',                                                00001430
         2 DG   PIC'99';                                                00001440
   DCL                                                                  00001450
      ( ONCODE, UNSPEC, DATE , CSTG , VERIFY , NULL ,                   00001460
        ADDR , SUBSTR )                         BUILTIN;                00001470
                                                                        00001480
   /* ON ERROR SNAP BEGIN       ;                                       00001490
         ON ERROR SYSTEM        ;                                       00001500
         ONKODE=ONCODE          ;                                       00001510
         FEILKODE   = ONK       ;                                       00001520
         DSNAVN     = EIBDS     ;                                       00001530
         GO TO FEILBEH          ;                                       00001540
      END;*/                                                            00001550
                                                                        00001560
   DCL BLANKE CHAR (5) INIT (' ');                                      00001570
   DCL SPART_1291           CHAR (1) INIT (' ');      /*9810*/          00001580
                                                                        00001590
 FEILKODE  = 'FEIL'     ;                                               00001600
 DSNAVN   = '      '    ;                                               00001610
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00001620
                                                                        00001630
 %PAGE;                                                                 00001640
                                                                        00001650
   ALLOCATE WORK_TRANS_LISTE,FNRTAB;                                    00001660
                                                                        00001670
                                                                        00001680
   ALLOCATE B00, B01, B02;                                              00001690
   NY_FNR_IND             = JA;                                         00001700
   START_TRANS_OPPL_PEKER = KOM_OMR.TRANS_OPPL_PEKER;                   00001710
   START_TRANS_PEKER      = KOM_OMR.TRANS_PEKER;                        00001720
   START_DIV_PARAM_PEKER  = KOM_OMR.DIV_PARAM_PEKER;                    00001730
   TERMINERINGS_IND       = ENTER;                                      00001740
                                                                        00001750
  /* FJERNET 11.6.86 BF: KJØRINGSTYPE SETTES I R0012001 I STEDET FOR */ 00001760
  /*                     HER, FOR IKKE Å OVERSTYRE KJØRINGSTYPE 'N'  */ 00001770
  /*                     SOM BLIR SATT I R001NO10.                   */ 00001780
                                                                        00001790
  /*  KJØRINGS_TYPE          = 'O';   */                                00001800
                                                                        00001810
   DATO                   = DATE;                                       00001820
   B00                    = '';                                         00001830
   B01                    = '';                                         00001840
   B02                    = '';                                         00001850
   WORK_TRANS_RETURKODE   = '    ';                                     00001860
   TRANS_OPPL_OMR.TRANSTYPE = 0;                                        00001870
   FNRTAB                 = '';                                         00001880
                                                                        00001890
   DIV_PARAM_OMR.STATISK_MELD    =  0;                                  00001900
                                                                        00001910
   /**** CALL PLASSER-PRIORITET-I-TRANS(NY-TRANS)   ******/             00001920
                                                                        00001930
                                                                        00001940
   DO  UNTIL((NY_FNR_IND       = NEI)       !                           00001950
             (TERMINERINGS_IND = OPPBEVARE) !                           00001960
             (TERMINERINGS_IND = FORKASTE));                            00001970
                                                                        00001980
      WORK_TRANS_LISTE = '';                                            00001990
                                                                        00002000
      DO I = 1 TO 5;                                                    00002010
  /*    TRANS_LISTE_OMR.TRANS_LISTE_LINJE(I) = WORK_TRANS_LISTE; */     00002020
        TRANS_LISTE_OMR.TRANS_LISTE_LINJE(I) = '';                      00002030
      END;                                                              00002040
                                                                        00002050
      /* ---------------------------------------------------------- */  00002060
      /* DEN NYE TRANSEN MERKES 'NY'.                               */  00002070
      /* ---------------------------------------------------------- */  00002080
                                                                        00002090
      CALL  OPPDATER_TRANSLISTE;                                        00002100
                                                                        00002110
      NY_FNR_IND     =  NEI ;                                           00002120
      ØNSKET_STATUS  =  ' ' ;                                           00002130
      STATUS_TYPE    =  ' ' ;                                           00002140
                                                                        00002150
      /* ---------------------------------------------------------- */  00002160
      /* LINKER MED CICS TIL OPPRETT_STATUS_FOR_FAMILIEN            */  00002170
      /* ---------------------------------------------------------- */  00002180
                                                                        00002190
      EXEC CICS LINK PROGRAM('R0013101') COMMAREA(KOM_OMR);             00002200
                                                                        00002210
      IF FEIL_MELD_NR > 0 THEN                                          00002220
         DO;                                                            00002230
            IF TERMINERINGS_IND = FATAL_FEIL THEN                       00002240
               GOTO L999;                                               00002250
                                                                        00002260
            /* ---------------------------------------------------- */  00002270
            /* HAVNER VI HER ER DET FEIL FORBUNDET MED DEN NYE      */  00002280
            /* TRANSEN.                                             */  00002290
            /* VI TILLATER TERMINAL - BRUKEREN Å JUSTERE            */  00002300
            /* INNTASTINGEN OG TERMINERE PÅ NYTT.                   */  00002310
            /* ---------------------------------------------------- */  00002320
                                                                        00002330
            CALL OPPDATER_TRANSLISTE;                                   00002340
                                                                        00002350
            /* -------------------------------------------------- */    00002360
            /* STYREPARAMETRE I DIV_PARAM_OMR BLIR HER SATT       */    00002370
            /* -------------------------------------------------- */    00002380
                                                                        00002390
            DIV_PARAM_OMR.FRA_CICS        = '0'B;                       00002400
            DIV_PARAM_OMR.HENT_FRAM_MAP   = '1'B;                       00002410
            DIV_PARAM_OMR.FRA_MED_DIALOG  = '1'B;                       00002420
            DIV_PARAM_OMR.FRA_UTEN_DIALOG = '0'B;                       00002430
                                                                        00002440
            /* -------------------------------------------------- */    00002450
            /* GÅR TIL SAKSBEHANDLER-DIALOG U/AJOURFØRING         */    00002460
            /* -------------------------------------------------- */    00002470
                                                                        00002480
                                                                        00002490
            IF KJØRINGS_TYPE ^= 'N'                             THEN    00002500
               EXEC CICS LINK PROGRAM ('R0013301') COMMAREA (KOM_OMR);  00002510
            ELSE                                                        00002520
               DO;                                                      00002530
                  FREE WORK_TRANS_LISTE, B00, B01, B02;                 00002540
                  EXEC CICS RETURN;                                     00002550
               END;                                                     00002560
                                                                        00002570
                                                                        00002580
            IF TERMINERINGS_IND    = ENTER                      THEN    00002590
               NY_FNR_IND          = JA;                                00002600
                                                                        00002610
            FEIL_MELD_NR           = 0;                                 00002620
                                                                        00002630
         END;                                                           00002640
      ELSE                                                              00002650
         DO;                                                            00002660
            TRANS_LISTE_INDEX      =   1;                               00002670
            STØNADSBREV_ØNSKET_IND = NEI;                               00002680
            FAMILIE_SPLITTET_IND   = NEI;                               00002690
                                                                        00002700
            CALL BEREGN_SØKER_EKTEF_IND;                                00002710
                                                                        00002720
            GML_VIRK_DATO_ÅM    =   B01.STATUS.VIRK_DATO_ÅM(SØKER_IND); 00002730
                                                                        00002740
                                                                        00002750
            DO UNTIL((NY_FNR_IND        = JA                        ) ! 00002760
                     (TRANS_LISTE_INDEX > ANTALL_TRANS_I_TRANS_LISTE) ! 00002770
                     (TERMINERINGS_IND  = OPPBEVARE                 ) ! 00002780
                     (TERMINERINGS_IND  = FORKASTE                  ) );00002790
                                                                        00002800
               /*----------------------------------------------------*/ 00002810
               /* HER BLIR TRANS_OPPL_OMR OG TRANS_OMR               */ 00002820
               /* ADDRESSERT TIL AKTUELL PLASS I TRANS-LISTE         */ 00002830
               /*----------------------------------------------------*/ 00002840
                                                                        00002850
               KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER               =     00002860
                             ADDR (TRANS_LISTE_LINJE.FAST_DEL           00002870
                                  (TRANS_LISTE_INDEX));                 00002880
                                                                        00002890
               KOM_OMR.PEKER_LISTE.TRANS_PEKER                    =     00002900
                             ADDR (TRANS_LISTE_LINJE.VARIABEL_DEL       00002910
                                  (TRANS_LISTE_INDEX));                 00002920
                                                                        00002930
               SPART_1291 = DIV_PERIODE.REGN_1291;        /*9810*/      00002940
                                                                        00002950
               IF ( TRANS_LISTE_OMR.NY_GML_TRANS_IND                    00002960
                   (TRANS_LISTE_INDEX)                = 'N')  THEN      00002970
                                                                        00002980
                  /*------------------------------------------------*/  00002990
                  /*  AJOURFØRE_FAM_STATUS_MED_DIALOG               */  00003000
                  /*------------------------------------------------*/  00003010
                                                                        00003020
                  EXEC CICS LINK PROGRAM('R0013501') COMMAREA(KOM_OMR); 00003030
                                                                        00003040
               ELSE                                                     00003050
                  /*------------------------------------------------*/  00003060
                  /*  AJOURFØRE_FAM_STATUS_UTEN_DIALOG              */  00003070
                  /*------------------------------------------------*/  00003080
                                                                        00003090
                  EXEC CICS LINK PROGRAM('R0013601') COMMAREA(KOM_OMR); 00003100
                                                                        00003110
                                                                        00003120
               IF TERMINERINGS_IND = FATAL_FEIL THEN                    00003130
                  GOTO L999;                                            00003140
                                                                        00003150
               IF TERMINERINGS_IND = ENTER &                            00003160
                  NY_FNR_IND       = NEI           THEN                 00003170
                  DO;                                                   00003180
                           /*---------------------------------------*/  00003190
                           /* LOV ENDRING AV 0192                   */  00003200
                           /*---------------------------------------*/  00003210
         /*          IF DIV_PARAM_OMR.REGN_1291 = 'J'   &     */        00003220
                     IF SPART_1291              = 'J'   &   /*9810*/    00003230
                       (TRANS_LISTE_OMR.NY_GML_TRANS_IND                00003240
                       (TRANS_LISTE_INDEX)               = 'N') THEN    00003250
                               CALL BEREGN_POENGTALL_1291;              00003260
                                                                        00003270
                                                                        00003280
                     IF TRANS_LISTE_OMR.NY_GML_TRANS_IND                00003290
                       (TRANS_LISTE_INDEX)               = 'N'  THEN    00003300
                                                                        00003310
                        STØNADSBREV_ØNSKET_IND           = JA;          00003320
                                                                        00003330
                     IF SUBSTR(CICS_IND,2)     = 'I'   THEN             00003340
                        STØNADSBREV_ØNSKET_IND =  NEI; /*TRUDE 11.94*/  00003350
                                                                        00003360
                                                                        00003370
                     IF TRANS_LISTE_OMR.TRANSTYPE                       00003380
                       (TRANS_LISTE_INDEX)               < 50   THEN    00003390
                        DO;                                             00003400
                           /*---------------------------------------*/  00003410
                           /* STYREPROGRAM FOR BEREGNING AV PENSJON */  00003420
                           /*---------------------------------------*/  00003430
                                                                        00003440
                           EXEC CICS LINK PROGRAM  ('R0014001')         00003450
                                          COMMAREA ( KOM_OMR  )      ;  00003460
                                                                        00003470
                           IF FEIL_MELD_NR           > 0          THEN  00003480
                              DO;                                       00003490
                                 TERMINERINGS_IND    = FATAL_FEIL;      00003500
                                 GO TO L999;                            00003510
                              END;                                      00003520
                                                                        00003530
                           IF SUBSTR(CICS_IND,2)    = 'I'     THEN      00003540
                              STØNADSBREV_ØNSKET_IND =  NEI;            00003550
                                                                        00003560
                           IF STØNADSBREV_ØNSKET_IND =  JA     &        00003570
                              SUBSTR(CICS_IND,2)    ^= 'A'     THEN     00003580
                              DO;                                       00003590
                                /*----------------------------------*/  00003600
                                /*  LAG_STØNADSBREV_TRANSER         */  00003610
                                /*----------------------------------*/  00003620
     /*-------------------------------------------------------------*/  00003630
     /*FOR REHABILITERINGSPENGER/DAGYTELSE SKAL DET BARE SKRIVES    */  00003640
     /* BREV PR VIRKNINGSDATO :            HL-0395                  */  00003650
     /*-------------------------------------------------------------*/  00003660
                                                                        00003670
     /*           IF DIV_PARAM_OMR.DAGPENGER_DATO_ÅM > 0  &             00003680
                     DIV_PARAM_OMR.DAGPENGER_DATO_ÅM <                  00003690
                     B02.VIRK_DATO_ÅM(SØKER_IND)         THEN;          00003700
                  ELSE                                                  00003710
     */                                                                 00003720
                                EXEC CICS LINK PROGRAM   ('R0017001')   00003730
                                               COMMAREA  ( KOM_OMR  );  00003740
                                                                        00003750
                                IF FEIL_MELD_NR > 0 THEN                00003760
                                   DO;                                  00003770
                                      TERMINERINGS_IND = FATAL_FEIL;    00003780
                                      GOTO L999;                        00003790
                                   END;                                 00003800
                                                                        00003810
                                                                        00003820
             IF B02.PENSJONSTYPE1(SØKER_IND) = 'Y' THEN                 00003830
                DO;                                                     00003840
                                DO K = 5 TO 1 BY -1 UNTIL(B02.          00003850
                                   YRKEHIST.YUFT_ÅM(SØKER_IND,K) > 0);  00003860
                                   M = K;                               00003870
                                END;                                    00003880
                                IF B02.KAP_11_7_UTLØST(SØKER_IND,M)     00003890
                                                    = 'J'   THEN        00003900
                                    DO;                                 00003910
                                   CALL ENGANGSUTLØST_PENSJON_OPPHØRER; 00003920
                                                                        00003930
                                    END;                                00003940
                END;                                                    00003950
                              END;                                      00003960
                                                                        00003970
                        END;  /*** TRANSTYPE < 50  ***/                 00003980
                                                                        00003990
 /* *************************************************************** */  00004000
 /* TILLEGG 6.11.84  HL  :                                          */  00004010
 /* VED OPPHØR MÅ STØNADSBREV-RUTINA KALLES FOR Å                   */  00004020
 /* UNDERSØKE OM DET FINNES TRANSAKSJONER FRA FØR  :                */  00004030
 /* *************************************************************** */  00004040
                                                                        00004050
                     ELSE                                               00004060
                        IF TRANS_LISTE_OMR.TRANSTYPE                    00004070
                          (TRANS_LISTE_INDEX)           =  54    !      00004080
                           TRANS_LISTE_OMR.TRANSTYPE                    00004090
                          (TRANS_LISTE_INDEX)           =  55    THEN   00004100
                                                                        00004110
                           IF STØNADSBREV_ØNSKET_IND    =  JA    &      00004120
                              SUBSTR(CICS_IND,2)       ^= 'A'    THEN   00004130
                              DO;                                       00004140
                                /*----------------------------------*/  00004150
                                /*  LAG_STØNADSBREV_TRANSER         */  00004160
                                /*----------------------------------*/  00004170
                                                                        00004180
                                EXEC CICS LINK PROGRAM  ('R0017001')    00004190
                                               COMMAREA ( KOM_OMR  ) ;  00004200
                                                                        00004210
                                IF FEIL_MELD_NR > 0 THEN                00004220
                                   DO;                                  00004230
                                      TERMINERINGS_IND = FATAL_FEIL;    00004240
                                      GOTO L999;                        00004250
                                   END;                                 00004260
                              END;                                      00004270
                           ELSE;                                        00004280
                        ELSE                                            00004290
                                                                        00004300
 /* *************************************************************** */  00004310
 /* ENDRET 18.08.90  FOR BEHADLING AV TRANSTYPE 63 64 61            */  00004320
 /* CALL PROGRAM R005411 FOR REPLASE AV ROOT MEN IKKE FORANDERS     */  00004330
 /* STATUS ELLER ANDER SEGMENT                                      */  00004340
 /* *************************************************************** */  00004350
                                                                        00004360
                     IF TRANS_LISTE_OMR.NY_GML_TRANS_IND                00004370
                       (TRANS_LISTE_INDEX)              = 'N'    &      00004380
                       ( TRANS_LISTE_OMR.TRANSTYPE                      00004390
                               (TRANS_LISTE_INDEX)      =  61    !      00004400
                         TRANS_LISTE_OMR.TRANSTYPE                      00004410
                               (TRANS_LISTE_INDEX)      =  63    !      00004420
                         TRANS_LISTE_OMR.TRANSTYPE                      00004430
                               (TRANS_LISTE_INDEX)      =  64 )  THEN   00004440
                        DO;                                             00004450
                            EXEC CICS LINK PROGRAM('R0015411')          00004460
                                            COMMAREA(KOM_OMR);          00004470
                                                                        00004480
                            IF FEIL_MELD_NR        > 0         THEN     00004490
                               DO;                                      00004500
                                  TERMINERINGS_IND = FATAL_FEIL;        00004510
                                  GOTO L999;                            00004520
                               END;                                     00004530
                     KOM_OMR.TRANS_OPPL_PEKER = START_TRANS_OPPL_PEKER; 00004540
                     KOM_OMR.TRANS_PEKER      = START_TRANS_PEKER;      00004550
                     KOM_OMR.DIV_PARAM_PEKER  = START_DIV_PARAM_PEKER;  00004560
                                                                        00004570
                            FREE WORK_TRANS_LISTE, B00, B01, B02;       00004580
                            EXEC CICS RETURN;                           00004590
                        END;                                            00004600
                                                                        00004610
 /* *************************************************************** */  00004620
 /* HIT 6.11.84  HL                                                 */  00004630
 /* *************************************************************** */  00004640
                       ELSE                                             00004650
                        IF STØNADSBREV_ØNSKET_IND    = JA        THEN   00004660
                           DO;                                          00004670
                              IF FEIL_MELD_NR        > 0         THEN   00004680
                                 DO;                                    00004690
                                    TERMINERINGS_IND = FATAL_FEIL;      00004700
                                    GOTO L999;                          00004710
                                 END;                                   00004720
                           END;                                         00004730
                                                                        00004740
                     IF STØNADSBREV_ØNSKET_IND       = JA        &      00004750
        /*0594 HL*/     B02.PENSJONSTYPE2(SØKER_IND) ^= 'A'      THEN   00004760
                        DO;                                             00004770
                         /*----------------------------------------*/   00004780
                         /* PROGRAM FOR DYNAMISK_STATISTIKK_TRANS  */   00004790
                         /*----------------------------------------*/   00004800
                                                                        00004810
                          EXEC CICS LINK PROGRAM  ('R0016001')          00004820
                                         COMMAREA ( KOM_OMR  )  ;       00004830
                                                                        00004840
                           IF FEIL_MELD_NR        > 0           THEN    00004850
                              DO;                                       00004860
                                 TERMINERINGS_IND = FATAL_FEIL;         00004870
                                 GOTO L999;                             00004880
                              END;                                      00004890
                        END;                                            00004900
                                                                        00004910
  /*9803*/           IF   TRANS_LISTE_OMR.                              00004920
                       BLANKETTYPE(TRANS_LISTE_INDEX)  ^= 'UA' &        00004930
 /*                  IF TRANS_OPPL_OMR.BLANKETTYPE ^= 'UA'    & */      00004940
                        GML_VIRK_DATO_ÅM         ^=                     00004950
                           F_SNU_DATO     (TRANS_LISTE_OMR.             00004960
                             VIRKNINGSDATO(TRANS_LISTE_INDEX))  THEN    00004970
                        DO;                                             00004980
                           IF GML_VIRK_DATO_ÅM    > 0           THEN    00004990
                              B00                 = B01;                00005000
                                                                        00005010
                           /*---------------------------------------*/  00005020
                           /* NÅR VI BEHANDLER DEN SISTE TRANS VIL  */  00005030
                           /* B00 VÆRE NEST-SISTE-STATUS            */  00005040
                           /*---------------------------------------*/  00005050
                                                                        00005060
                           GML_VIRK_DATO_ÅM =                           00005070
                              F_SNU_DATO      (TRANS_LISTE_OMR.         00005080
                                VIRKNINGSDATO (TRANS_LISTE_INDEX) ) ;   00005090
                                                                        00005100
                        END;                                            00005110
                                                                        00005120
   /*                IF TRANS_OPPL_OMR.BLANKETTYPE ^= 'UA'  THEN */     00005130
                        B01 = B02;                                      00005140
                     TRANS_LISTE_INDEX = TRANS_LISTE_INDEX + 1;         00005150
                                                                        00005160
                     /*---------------------------------------------*/  00005170
                     /* HVIS AKTUELL SØKER ER DØD,MÅ VI AVBRYTE     */  00005180
                     /*---------------------------------------------*/  00005190
                                                                        00005200
                     DO K = 1 TO 14;                                    00005210
                                                                        00005220
                        IF B01.FNR(K)     > 0                      THEN 00005230
                                                                        00005240
                           IF B01.FNR(K)  = TRANS_LISTE_OMR.FØDSNUMMER  00005250
                                           (TRANS_LISTE_INDEX)     THEN 00005260
                                                                        00005270
                              IF B01.DØDSDATO_ÅMD(K) > 0 THEN           00005280
                                 DO;                                    00005290
  L100:                                                                 00005300
                                    PROGRAM_ID     = 'R0013001';        00005310
                                    FEIL_VED_LABEL = '100';             00005320
                                    FEIL_MELD_NR   = 0602;              00005330
                                    K = 15;                             00005340
                                 END;                                   00005350
                     END;                                               00005360
                                                                        00005370
                     IF FEIL_MELD_NR > 0 THEN                           00005380
                        DO;                                             00005390
                           TERMINERINGS_IND = FATAL_FEIL;               00005400
                           GOTO L999;                                   00005410
                        END;                                            00005420
                                                                        00005430
                     STATUS_TYPE = 'B';                                 00005440
                                                                        00005450
                                                                        00005460
                     IF TRANS_LISTE_OMR.FØDSNUMMER(                     00005470
                                      TRANS_LISTE_INDEX) = 0 THEN       00005480
                        DO;                                             00005490
      /*                   IF DG < 20    THEN                           00005500
                              DO;                                       00005510
                                 IF MN = 12 THEN                        00005520
                                    NESTE_HENDELSE_DATO_ÅM =            00005530
                                                 (ÅR + 1) * 100 + 1;    00005540
                                 ELSE                                   00005550
                                    NESTE_HENDELSE_DATO_ÅM =            00005560
                                                 (ÅR * 100 + MN + 1);   00005570
                              END;                                      00005580
                           ELSE                                         00005590
                              DO;                        */             00005600
                                 IF MN < 11 THEN                        00005610
                                    NESTE_HENDELSE_DATO_ÅM =            00005620
                                                 (ÅR * 100 + MN + 2);   00005630
                                 ELSE                                   00005640
                                    DO;                                 00005650
                                       IF MN = 11 THEN                  00005660
                                          NESTE_HENDELSE_DATO_ÅM =      00005670
                                                 (ÅR + 1) * 100 + 1;    00005680
                                       ELSE                             00005690
                                          NESTE_HENDELSE_DATO_ÅM =      00005700
                                                 (ÅR + 1) * 100 + 2;    00005710
                                    END;                                00005720
     /*                       END;                         */           00005730
                        END;                                            00005740
                     ELSE                                               00005750
                        NESTE_HENDELSE_DATO_ÅM           =  F_SNU_DATO  00005760
                          (TRANS_LISTE_OMR.VIRKNINGSDATO                00005770
                          (TRANS_LISTE_INDEX)                        ); 00005780
                                                                        00005790
                        DO K = 1 TO 14;                                 00005800
                                                                        00005810
                           IF B01.FNR              (K)   >  0     &     00005820
                              B01.STATUS_KODE_HIST (K)   = ' '    &     00005830
                              SUBSTR(CICS_IND,2)        ^= 'A'    THEN  00005840
                              DO;                                       00005850
                                                                        00005860
                                 EXEC CICS LINK PROGRAM  ( 'R0014901')  00005870
                                                COMMAREA (  KOM_OMR  ); 00005880
                                                                        00005890
                                 IF FEIL_MELD_NR         >  0 THEN      00005900
                                    DO;                                 00005910
                                       TERMINERINGS_IND  =  FATAL_FEIL; 00005920
                                       GOTO L999;                       00005930
                                    END;                                00005940
                                                                        00005950
                                 K                       = 15;          00005960
                              END;                                      00005970
                        END;                                            00005980
                                                                        00005990
                                                                        00006000
                     IF FAMILIE_SPLITTET_IND = JA THEN                  00006010
                        DO;                                             00006020
                                                                        00006030
             /*        AVBRUTT BEHANDLING PGA FAMILIEN ER BLITT         00006040
              *        SPLITTET. UTLISTEDE TRANSAKSJONER ER FJERNET     00006050
              *        OG MÅ LEGGES INN IGJEN.                          00006060
              *        CALL LIST_ØVRIGE_TRANS_PÅ_SKJERM_OG_FJERN_DEM(   00006070
              *        TRANS_LISTE,TRANS_LISTE_INDEX,FEIL_MELD_NR,      00006080
              *        ANTALL_TRANS_I_TRANS_LISTE);*/                   00006090
                                                                        00006100
                           IF TRANS_LISTE_INDEX ^>                      00006110
                                  ANTALL_TRANS_I_TRANS_LISTE     THEN   00006120
                              DO;                                       00006130
                                 ANTALL_TRANSER_IGJEN =                 00006140
                                         ANTALL_TRANS_I_TRANS_LISTE -   00006150
                                               TRANS_LISTE_INDEX + 1;   00006160
                                                                        00006170
                                 W_ANTALL_TRANS_I_TRANS_LISTE =         00006180
                                           ANTALL_TRANS_I_TRANS_LISTE;  00006190
                                                                        00006200
                                 ANTALL_TRANS_I_TRANS_LISTE =           00006210
                                         ANTALL_TRANS_I_TRANS_LISTE -   00006220
                                                ANTALL_TRANSER_IGJEN;   00006230
                                                                        00006240
                                 HUSK_TRANS_OPPL_PEKER =                00006250
                                                TRANS_OPPL_PEKER;       00006260
                                 HUSK_TRANS_PEKER      = TRANS_PEKER;   00006270
                                                                        00006280
                                 DO I = TRANS_LISTE_INDEX TO            00006290
                                          W_ANTALL_TRANS_I_TRANS_LISTE; 00006300
                                    TRANS_OPPL_PEKER =                  00006310
                                               ADDR(TRANS_LISTE_OMR.    00006320
                                                          FAST_DEL(I)); 00006330
                                    TRANS_PEKER =                       00006340
                                               ADDR(TRANS_LISTE_OMR.    00006350
                                                       VARIABEL_DEL(I));00006360
                                                                        00006370
                                   /* ------------------------------ */ 00006380
                                   /*  FJERNER RESTERENDE TRANSER    */ 00006390
                                   /* ------------------------------ */ 00006400
                                                                        00006410
                                                                        00006420
                                    EXEC CICS LINK PROGRAM ('R0010460') 00006430
                                                   COMMAREA( KOM_OMR  );00006440
                                                                        00006450
                                    IF FEIL_MELD_NR > 0 THEN            00006460
                                       DO;                              00006470
                                          TERMINERINGS_IND = FATAL_FEIL;00006480
                                          GOTO L999;                    00006490
                                       END;                             00006500
                                                                        00006510
                                   /* ------------------------------ */ 00006520
                                   /* SKRIVER UT FJERNEDE TRANSER    */ 00006530
                                   /* ------------------------------ */ 00006540
                                                                        00006550
                                    EXEC CICS LINK PROGRAM ('R0010470') 00006560
                                                   COMMAREA( KOM_OMR  );00006570
                                                                        00006580
                                    IF FEIL_MELD_NR > 0 THEN            00006590
                                       DO;                              00006600
                                          TERMINERINGS_IND = FATAL_FEIL;00006610
                                          GOTO L999;                    00006620
                                       END;                             00006630
                                 END;                                   00006640
                                                                        00006650
                                 TRANS_OPPL_PEKER =                     00006660
                                                 HUSK_TRANS_OPPL_PEKER; 00006670
                                 TRANS_PEKER      =                     00006680
                                                 HUSK_TRANS_PEKER;      00006690
                                                                        00006700
                                 WORK_TRANS_RETURKODE= 'R040';          00006710
                                                                        00006720
                                 TRANS_LISTE_INDEX =                    00006730
                                      ANTALL_TRANS_I_TRANS_LISTE + 1;   00006740
                                 TERMINERINGS_IND = ENTER;              00006750
                                                                        00006760
                              END;                                      00006770
                                                                        00006780
                        END;                                            00006790
                                                                        00006800
                     B01 = B02;                                         00006810
                                                                        00006820
                     /* ------------------------------------------- */  00006830
                     /* JUSTERING AV SØKER_IND                      */  00006840
                     /* ------------------------------------------- */  00006850
                                                                        00006860
                     CALL BEREGN_SØKER_EKTEF_IND;                       00006870
                                                                        00006880
                  END;  /**IF TERMINERINGS_IND = ENTER!NY_FNR_IND*/     00006890
                                                                        00006900
            END;        /**  DO UNTILL NY_FNR_IND = JA  **/             00006910
                                                                        00006920
         END;          /**  ELSE FOR IF FEIL_MELD_NR > 0 **/            00006930
                                                                        00006940
                                                                        00006950
         KOM_OMR.TRANS_OPPL_PEKER = START_TRANS_OPPL_PEKER;             00006960
         KOM_OMR.TRANS_PEKER      = START_TRANS_PEKER;                  00006970
         KOM_OMR.DIV_PARAM_PEKER  = START_DIV_PARAM_PEKER     ;         00006980
                                                                        00006990
                                                                        00007000
   END;    /**  DO UNTIL  NY_FNR_IND = NEI **/                          00007010
                                                                        00007020
                                                                        00007030
   /* --------------------------------------------------------------*/  00007040
   /* TEST NY_FNR_IND = NEI; TERMINERINGS_IND = ENTER;              */  00007050
   /* --------------------------------------------------------------*/  00007060
                                                                        00007070
   SELECT(TERMINERINGS_IND);                                            00007080
      WHEN(ENTER)                                                       00007090
         DO;                                                            00007100
            /*------------------------------------------------------*/  00007110
            /* SKRIV_NY_OG_ENDREDE_TRANS_TIL_BASEN                  */  00007120
            /*------------------------------------------------------*/  00007130
                                                                        00007140
            EXEC CICS LINK PROGRAM ('R0015301') COMMAREA (KOM_OMR);     00007150
                                                                        00007160
            IF FEIL_MELD_NR                   > 0                THEN   00007170
               DO;                                                      00007180
                  TERMINERINGS_IND            = FATAL_FEIL;             00007190
                  GOTO L999;                                            00007200
               END;                                                     00007210
                                                                        00007220
            /*------------------------------------------------------*/  00007230
            /* SKRIV_STATUS_RECS_TIL_BASEN                          */  00007240
            /*------------------------------------------------------*/  00007250
                                                                        00007260
 /* TILLEGGSTEST 0894 HL : */                                           00007270
                                                                        00007280
            IF DIV_PERIODE.AFP_SERVICE ^= 'J'      THEN                 00007290
            EXEC CICS LINK PROGRAM ('R0015401') COMMAREA (KOM_OMR);     00007300
                                                                        00007310
            IF FEIL_MELD_NR > 0 THEN                                    00007320
               DO;                                                      00007330
                  TERMINERINGS_IND = FATAL_FEIL;                        00007340
                  GOTO L999;                                            00007350
               END;                                                     00007360
                                                                        00007370
            /*------------------------------------------------------*/  00007380
            /* JUSTER_SB_ROT_SEGMENTSTØNADSBREVBASEN               */   00007390
            /*------------------------------------------------------*/  00007400
                                                                        00007410
            EXEC CICS LINK PROGRAM ('R0017101') COMMAREA (KOM_OMR);     00007420
                                                                        00007430
            IF FEIL_MELD_NR > 0 THEN                                    00007440
               DO;                                                      00007450
                  TERMINERINGS_IND = FATAL_FEIL;                        00007460
                  GOTO L999;                                            00007470
               END;                                                     00007480
                                                                        00007490
                                                                        00007500
            IF FAMILIE_SPLITTET_IND = JA THEN                           00007510
                                                                        00007520
               IF WORK_TRANS_RETURKODE = 'R040' THEN                    00007530
                  DO;                                                   00007540
                     TRANS_OPPL_OMR.TRANS_RETURKODE = 'R040';           00007550
                                                                        00007560
                     EXEC CICS SEND MAP ('S001014') MAPSET ('S001013')  00007570
                                                    ERASE    MAPONLY  ; 00007580
                     ALLOCATE S001014O;                                 00007590
                                                                        00007600
                     S001014O.MELDINGO =                                00007610
                                                  'FAM.SPLITT. ' !!     00007620
                                            ANTALL_TRANSER_IGJEN !!     00007630
                                                    ' TRANS(ER)' !!     00007640
                                                      ' FJERNET.';      00007650
                                                                        00007660
                     EXEC CICS SEND MAP ('S001014') MAPSET ('S001013')  00007670
                                                    DATAONLY          ; 00007680
                  END;                                                  00007690
         END;                                                           00007700
                                                                        00007710
      WHEN (OPPBEVARE)                                                  00007720
         DO;                                                            00007730
             /*********                                                 00007740
               NB! NB!  NB!                                             00007750
               DENNE FUNKSJONEN BLIR IKKE IMPLEMENTERT I FØRSTE         00007760
               VERSJON AV SYSTEMET                                      00007770
                                                                        00007780
               CALL  PLASSER_NY_TRANS_I_VENTEREG(NY_TRANS,              00007790
                     VENTE_REGISTER);                                   00007800
                     IF FEIL_MELD_NR > 0 THEN                           00007810
                        DO;                                             00007820
                          TERMINERINGS_IND = FATAL_FEIL;                00007830
                          GOTO L999;                                    00007840
                        END;                                            00007850
                                                                        00007860
               CALL  FJERNE TRANSER_FRA_STØNADSBREV_BASEN               00007870
                     (STØNADSBREV_NØKKEL_TABELL)                        00007880
                     IF FEIL_MELD_NR > 0 THEN                           00007890
                        DO;                                             00007900
                          TERMINERINGS_IND = FATAL_FEIL;                00007910
                          GOTO L999;                                    00007920
                        END;                                            00007930
                                                                        00007940
               CALL  FJERNE TRANSER_FRA_STATISTIKK_TRANS_BASEN          00007950
                     (STATISTIKK_TRANS_NØKKEL_TABELL)                   00007960
                     IF FEIL_MELD_NR > 0 THEN                           00007970
                        DO;                                             00007980
                          TERMINERINGS_IND = FATAL_FEIL;                00007990
                          GOTO L999;                                    00008000
                        END;                                            00008010
                                                                        00008020
               CALL  SKRIV_MELDING_TIL_ST_BREV_BASE(                    00008030
                     (FNR_SØKER,TRANS OPPBEVART I VENTEREGISTER );      00008040
                     IF FEIL_MELD_NR > 0 THEN                           00008050
                        DO;                                             00008060
                          TERMINERINGS_IND = FATAL_FEIL;                00008070
                          GOTO L999;                                    00008080
                        END;                                            00008090
                                                                        00008100
               **********/                                              00008110
         END;                                                           00008120
      WHEN(FORKASTE)                                                    00008130
         DO;                                                            00008140
            /* **************************************************** */  00008150
            /*    FJERNER SPERREN ELLER RF0PERSN  AVHENGIG AV KODEN */  00008160
            /* **************************************************** */  00008170
                                                                        00008180
            FEIL_MELD_NR = 0 ;                                          00008190
                                                                        00008200
                                                                        00008210
               /*********                                               00008220
                                                                        00008230
               CALL  FJERNE TRANSER_FRA_STØNADSBREV_BASEN               00008240
                     (STØNADSBREV_NØKKEL_TABELL)                        00008250
                     IF FEIL_MELD_NR > 0 THEN                           00008260
                        DO;                                             00008270
                          TERMINERINGS_IND = FATAL_FEIL;                00008280
                          GOTO L999;                                    00008290
                        END;                                            00008300
                                                                        00008310
               CALL  FJERNE TRANSER_FRA_STATISTIKK_TRANS_BASEN          00008320
                     (STATISTIKK_TRANS_NØKKEL_TABELL)                   00008330
                     IF FEIL_MELD_NR > 0 THEN                           00008340
                        DO;                                             00008350
                          TERMINERINGS_IND = FATAL_FEIL;                00008360
                          GOTO L999;                                    00008370
                        END;                                            00008380
                                                                        00008390
               CALL  SKRIV_MELDING_TIL_ST_BREV_BASE(                    00008400
                     (FNR_SØKER,TRANS ER FORKASTET );                   00008410
                     IF FEIL_MELD_NR > 0 THEN                           00008420
                        DO;                                             00008430
                          TERMINERINGS_IND = FATAL_FEIL;                00008440
                          GOTO L999;                                    00008450
                        END;                                            00008460
                                                                        00008470
               CALL  SKRIV_AVBRUTT_ÅRSAK_PÅ_TERMINALEN                  00008480
                     (FEIL_MELD_NR,FEIL_MELD_FNR );                     00008490
                                                                        00008500
               **********/                                              00008510
         END;                                                           00008520
      OTHERWISE                                                         00008530
             ;                                                          00008540
   END;                                                                 00008550
                                                                        00008560
         /********                                                      00008570
   ST_BREV_NØKKEL_TABELL           = 0;                                 00008580
   STATISTIKK_TRANS_NØKKEL_TABELL  = 0;                                 00008590
         ********/                                                      00008600
                                                                        00008610
  FREE WORK_TRANS_LISTE, B00;                                           00008620
  EXEC CICS RETURN;                                                     00008630
                                                                        00008640
  OPPDATER_TRANSLISTE:                                                  00008650
  PROC;                                                                 00008660
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.TRANSKODE(1) =         00008670
                                            TRANS_OPPL_OMR.TRANSKODE;   00008680
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.FØDSNUMMER(1) =        00008690
                                           TRANS_OPPL_OMR.FØDSNUMMER;   00008700
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.VIRKNINGSDATO(1) =     00008710
                                        TRANS_OPPL_OMR.VIRKNINGSDATO;   00008720
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.BLANKETTYPE(1) =       00008730
                                          TRANS_OPPL_OMR.BLANKETTYPE;   00008740
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.TRANSTYPE(1) =         00008750
                                            TRANS_OPPL_OMR.TRANSTYPE;   00008760
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.TRANS_RETURKODE(1) =   00008770
                                      TRANS_OPPL_OMR.TRANS_RETURKODE;   00008780
      TRANS_LISTE_OMR.NY_GML_TRANS_IND(1) = 'N';                        00008790
                                                                        00008800
      TRANS_LISTE_OMR.VARIABEL_DEL(1) = KOM_OMR.TRANS_OMR;              00008810
  END OPPDATER_TRANSLISTE;                                              00008820
                                                                        00008830
 L999:                                                                  00008840
                                                                        00008850
  FEILBEH:                                                              00008860
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00008870
                                                                        00008880
     DIV_PARAM_OMR.STATISK_MELD    =  1;                                00008890
     IF FEIL_MELD_NR > 0 THEN                                           00008900
        DO;                                                             00008910
           TERMINERINGS_IND = FORKASTE                          ;       00008920
                                                                        00008930
           DIV_PARAM_OMR.FRA_CICS        = '0'B                 ;       00008940
           DIV_PARAM_OMR.HENT_FRAM_MAP   = '1'B                 ;       00008950
           DIV_PARAM_OMR.FRA_MED_DIALOG  = '0'B                 ;       00008960
           DIV_PARAM_OMR.FRA_UTEN_DIALOG = '1'B                 ;       00008970
                                                                        00008980
                                                                        00008990
   /* ENDRET 11.9.86 BF  HVIS KJØRINGS_TYPE = 'N' SKAL IKKE 3301  */    00009000
   /*                    LINKES.                                  */    00009010
                                                                        00009020
           IF KJØRINGS_TYPE = 'N'     THEN                              00009030
              DO;                                                       00009040
                 FREE WORK_TRANS_LISTE, B00;                            00009050
                 EXEC CICS RETURN;                                      00009060
              END;                                                      00009070
                                                                        00009080
   /* HIT    11.9.86 BF                                           */    00009090
                                                                        00009100
                                                                        00009110
   /* ENDRET 11.5.89 BF  ROLLBACK PÅ BASENE MÅ TAS HER, ELLERS    */    00009120
   /*                    SETTES FEIL_MELD_NR = 0 I R0010490       */    00009130
   /*                    (SKRIV TIL VENTETRANS) OG SYNCPOINT      */    00009140
   /*                    BACK VIL IKKE BLI FORETATT.              */    00009150
                                                                        00009160
           IF FEIL_MELD_NR > 499 THEN                                   00009170
                                                                        00009180
              EXEC CICS SYNCPOINT ROLLBACK                      ;       00009190
                                                                        00009200
   /* HIT    11.5.89 BF                                           */    00009210
                                                                        00009220
                                                                        00009230
           EXEC CICS LINK PROGRAM('R0013301') COMMAREA (KOM_OMR);       00009240
                                                                        00009250
           IF FEIL_MELD_NR > 499 THEN                                   00009260
                                                                        00009270
              EXEC CICS SYNCPOINT ROLLBACK                      ;       00009280
                                                                        00009290
           KOM_OMR.TRANS_OPPL_PEKER = START_TRANS_OPPL_PEKER    ;       00009300
           KOM_OMR.TRANS_PEKER      = START_TRANS_PEKER         ;       00009310
           KOM_OMR.DIV_PARAM_PEKER  = START_DIV_PARAM_PEKER     ;       00009320
           FEIL_MELD_NR  = 0;                                           00009330
           TRANS_OPPL_OMR.TRANSKODE      = 'R041'               ;       00009340
           FUNKSJONSKODE                 = 'R'                  ;       00009350
                                                                        00009360
        END;                                                            00009370
     ELSE                                                               00009380
        DO;                                                             00009390
                                                                        00009400
   /* ENDRET 11.9.86 BF  HVIS KJØRINGS_TYPE = 'N' SKAL KONTROLLEN */    00009410
   /*                    TILBAKE TIL R001NO20.                    */    00009420
                                                                        00009430
           IF KJØRINGS_TYPE = 'N'     THEN                              00009440
              DO;                                                       00009450
                 FREE WORK_TRANS_LISTE, B00;                            00009460
                 FEIL_MELD_NR = 9999;                                   00009470
                 EXEC CICS RETURN;                                      00009480
              END;                                                      00009490
                                                                        00009500
   /* HIT    11.9.86 BF                                           */    00009510
                                                                        00009520
           PROGRAM_ID = 'R0013001';                                     00009530
                                                                        00009540
           TERMINERINGS_IND = 'F';                                      00009550
           FEIL_MELD_NR  = 0;                                           00009560
                                                                        00009570
           KOM_OMR.TRANS_OPPL_PEKER = START_TRANS_OPPL_PEKER;           00009580
           KOM_OMR.TRANS_PEKER      = START_TRANS_PEKER;                00009590
           KOM_OMR.DIV_PARAM_PEKER  = START_DIV_PARAM_PEKER     ;       00009600
                                                                        00009610
           TRANS_OPPL_OMR.TRANS_RETURKODE = 'R040';                     00009620
           TRANS_OPPL_OMR.TRANSKODE       = 'R040';                     00009630
                                                                        00009640
           ALLOCATE S001014O;                                           00009650
                                                                        00009660
           EXEC CICS SEND MAP(                                          00009670
                        'S001014') MAPSET('S001013')                    00009680
                                                   ERASE MAPONLY;       00009690
                                                                        00009700
           S001014O.MELDINGO =                                          00009710
              'FEIL HAR OPPSTÅTT !.TRANS FORKASTET.INGEN OPPDATERING.'; 00009720
                                                                        00009730
           EXEC CICS SEND MAP(                                          00009740
                       'S001014') MAPSET('S001013')                     00009750
                                                   DATAONLY;            00009760
           EXEC CICS RECEIVE MAP('S001014')                             00009770
                                    MAPSET('S001013') SET(BMSMAPBR);    00009780
                                                                        00009790
           EXEC CICS SYNCPOINT ROLLBACK;                                00009800
        END;                                                            00009810
                                                                        00009820
  FREE WORK_TRANS_LISTE, B00;                                           00009830
  EXEC CICS RETURN;                                                     00009840
                                                                        00009850
  ABEND:                                                                00009860
      EXEC CICS ABEND ABCODE(FEIL);                                     00009870
                                                                        00009880
                                                                        00009890
  BEREGN_SØKER_EKTEF_IND:                                               00009900
  PROC;                                                                 00009910
      SØKER_IND = 0;                                                    00009920
      DO I = 1 TO 14 WHILE(SØKER_IND = 0);                              00009930
         IF B01.RF0PERSN.FNR(I) =                                       00009940
                                  TRANS_LISTE_OMR.FØDSNUMMER            00009950
                                         (TRANS_LISTE_INDEX) THEN       00009960
            SØKER_IND = I;                                              00009970
      END;                                                              00009980
      IF SØKER_IND = 0 THEN                                             00009990
         DO;                                                            00010000
            IF TRANS_LISTE_OMR.BLANKETTYPE                              00010010
                           (TRANS_LISTE_INDEX) = 'FB' !                 00010020
                            TRANS_LISTE_OMR.BLANKETTYPE                 00010030
      /* SP */             (TRANS_LISTE_INDEX) = 'B6' !                 00010040
                            TRANS_LISTE_OMR.BLANKETTYPE                 00010050
                           (TRANS_LISTE_INDEX) = 'BP' THEN              00010060
               SØKER_IND = 3;                                           00010070
            ELSE                                                        00010080
               DO;                                                      00010090
                  IF F_KJØNN(TRANS_LISTE_OMR.FØDSNUMMER                 00010100
                              (TRANS_LISTE_INDEX)) = 'K' THEN           00010110
                     SØKER_IND = 1;                                     00010120
                  ELSE                                                  00010130
                     SØKER_IND = 2;                                     00010140
               END;                                                     00010150
         END;                                                           00010160
                                                                        00010170
      IF SØKER_IND = 1 THEN                                             00010180
         EKTEF_IND = 2;                                                 00010190
      ELSE                                                              00010200
         IF SØKER_IND = 2 THEN                                          00010210
            EKTEF_IND = 1;                                              00010220
  END BEREGN_SØKER_EKTEF_IND;                                           00010230
                                                                        00010240
  BEREGN_POENGTALL_1291 :                                               00010250
  PROC;                                                                 00010260
   IF TRANS_OPPL_OMR.BLANKETTYPE = 'O1' THEN GOTO  L500;                00010270
    W_VIRKDATO = TRANS_OPPL_OMR.VIRKNINGSDATO;                          00010280
    W_TRANSTYPE = TRANS_OPPL_OMR.TRANSTYPE;                             00010290
    IF W_TRANSTYPE = 2                   THEN                           00010300
       DIV_PARAM_OMR.REGN_1291 = '2';                                   00010310
    TRANS_OPPL_OMR.VIRKNINGSDATO = 1291;                                00010320
    TRANS_OPPL_OMR.TRANSTYPE     = 27;                                  00010330
    EXEC CICS LINK PROGRAM  ('R0014001')                                00010340
                                COMMAREA ( KOM_OMR  )      ;            00010350
    IF FEIL_MELD_NR           > 0          THEN                         00010360
       DO;                                                              00010370
          TERMINERINGS_IND    = FATAL_FEIL;                             00010380
          GO TO L999;                                                   00010390
       END;                                                             00010400
    DIV_PARAM_OMR.REGN_1291 = ' ';                                      00010410
    TRANS_OPPL_OMR.VIRKNINGSDATO = W_VIRKDATO;                          00010420
    TRANS_OPPL_OMR.TRANSTYPE     = W_TRANSTYPE;                         00010430
    IF W_TRANSTYPE = 2                   THEN         /*9810*/          00010440
       DIV_PARAM_OMR.REGN_1291 = '3';                                   00010450
    I = SØKER_IND;                                                      00010460
    IF SØKER_IND < 3                        THEN                        00010470
       DO I = 1 TO 2;                                                   00010480
          CALL LOOP_SELECT;                                             00010490
       END;                                                             00010500
    ELSE                                                                00010510
       CALL LOOP_SELECT;                                                00010520
                                                                        00010530
  LOOP_SELECT : PROC;                                                   00010540
                                                                        00010550
     SELECT (B02.PENSJONSTYPE1(I));                                     00010560
                                                                        00010570
     WHEN('A')                                                          00010580
        DO;                                                             00010590
           IF B02.TP_BRUTTO(I) > 0           THEN                       00010600
              DO;                                                       00010610
                 B02.GT_LOV92(I)         = B02.ETTEPENS.TP_BRUTTO(I)    00010620
                                         + B02.ALDERSP.TP(I);           00010630
                 B02.ALDERSP.SPT_1291(I) = B02.ALDERSP.SPT(I);          00010640
                 B02.ALDERSP.OPT_1291(I) = B02.ALDERSP.OPT(I);          00010650
                 B02.ALDERSP.PÅ_1291 (I) = B02.ALDERSP.PÅ (I);          00010660
                 B02.ETTEPENS.SPT_1291(I) = B02.ETTEPENS.SPT_AVD(I);    00010670
                 B02.ETTEPENS.OPT_1291(I) = B02.ETTEPENS.OPT_AVD(I);    00010680
                 B02.ETTEPENS.PÅ_1291(I)  = B02.ETTEPENS.PÅ_AVD(I);     00010690
              END;                                                      00010700
        END;                                                            00010710
     WHEN('K')                                                          00010720
        DO;                                                             00010730
           B02.GT_LOV92(I)         = B02.ALDERSP.TP(I);                 00010740
           B02.ALDERSP.SPT_1291(I) = B02.ALDERSP.SPT(I);                00010750
           B02.ALDERSP.OPT_1291(I) = B02.ALDERSP.OPT(I);                00010760
           B02.ALDERSP.PÅ_1291 (I) = B02.ALDERSP.PÅ (I);                00010770
        END;                                                            00010780
                                                                        00010790
     WHEN('U', 'Y')                                                     00010800
        DO;                                                             00010810
           DCL                                                          00010820
              SISTE  FIXED BIN(15);                                     00010830
              SISTE = 0;                                                00010840
                                                                        00010850
     /** FINNE SISTE UTFYLLTE UFT_ÅM   **/                              00010860
     /*0697 HL:*/                                                       00010870
           DO J = 7 TO 1 BY -1 UNTIL(B02.UFØRHIST.UFT_ÅM                00010880
                                  (I,J) > 0);                           00010890
              SISTE = J;                                                00010900
           END;                                                         00010910
           IF B02.UFØRHIST.BUP(I,SISTE) > 5      THEN                   00010920
         DO;                                                            00010930
           B02.GT_LOV92(I)          = B02.UFØRPENS.TP(I)                00010940
                                    + B02.YRKEPENS.TP(I)                00010950
                                    + B02.ETTEPENS.TP_BRUTTO(I);        00010960
           B02.UFØRPENS.SPT_1291(I) = B02.UFØRPENS.SPT(I);              00010970
           B02.UFØRPENS.OPT_1291(I) = B02.UFØRPENS.OPT(I);              00010980
           B02.UFØRPENS.PÅ_1291 (I) = B02.UFØRPENS.PÅ (I);              00010990
           B02.YRKE_POENG_1291(I)   = B02.YRKEPENS.YPT(I);              00011000
           B02.ETTEPENS.SPT_1291(I) = B02.ETTEPENS.SPT_AVD(I);          00011010
           B02.ETTEPENS.OPT_1291(I) = B02.ETTEPENS.OPT_AVD(I);          00011020
           B02.ETTEPENS.PÅ_1291(I)  = B02.ETTEPENS.PÅ_AVD(I);           00011030
         END;                                                           00011040
        END;                                                            00011050
                                                                        00011060
        WHEN('E')                                                       00011070
           DO;                                                          00011080
              B02.GT_LOV92(I)          = B02.ETTEPENS.TP_BRUTTO(I);     00011090
              B02.ETTEPENS.SPT_1291(I) = B02.ETTEPENS.SPT_AVD(I);       00011100
              B02.ETTEPENS.OPT_1291(I) = B02.ETTEPENS.OPT_AVD(I);       00011110
              B02.ETTEPENS.PÅ_1291(I)  = B02.ETTEPENS.PÅ_AVD(I);        00011120
           END;                                                         00011130
        WHEN('B')                                                       00011140
           DO;                                                          00011150
              B02.GT_LOV92(I)          = B02.ETTEBARN.TP(I);            00011160
              B02.SPT_1291_MOR(I)      = B02.SPT_MOR(I);                00011170
              B02.OPT_1291_MOR(I)      = B02.OPT_MOR(I);                00011180
              B02.PÅ_1291_MOR(I)       = B02.PÅ_MOR(I);                 00011190
              B02.SPT_1291_FAR(I)      = B02.SPT_FAR(I);                00011200
              B02.OPT_1291_FAR(I)      = B02.OPT_FAR(I);                00011210
              B02.PÅ_1291_FAR(I)       = B02.PÅ_FAR(I);                 00011220
           END;                                                         00011230
                                                                        00011240
        OTHERWISE;                                                      00011250
     END;  /*OF SELECT*/                                                00011260
    END LOOP_SELECT;                                                    00011270
  L500:                                                                 00011280
                                                                        00011290
  END BEREGN_POENGTALL_1291;                                            00011300
                                                                        00011310
 %PAGE;                                                                 00011320
 %INCLUDE R0019902;  /**** F_KJØNN         ****/                        00011330
 %PAGE;                                                                 00011340
 %INCLUDE R001994Y;  /**** ENGANGSUTLØST_PENSJON_OPPHØRER    ****/      00011350
 %PAGE;                                                                 00011360
 %INCLUDE R0019934;  /**** OPPHØR_KOBLING_TO_PERSONER   TS   ****/      00011370
 %PAGE;                                                                 00011380
 %INCLUDE R0019913;  /**** F_SNU_DATO      ****/                        00011390
 %SKIP(2);                                                              00011400
                                                                        00011410
 END R00130;                                                            00011420
