 /*       SIST ENDRET 04/11-98 13.18.12 AV   JDA7339                  */00000000
 /*       SIST ENDRET 04/11-98 13.17.08 AV   JDA7339                  */00000010
 /*       SIST ENDRET 16/09-98 11.59.06 AV   JDA7339                  */00000020
 /*       SIST ENDRET 16/09-98 11.56.12 AV   JDA7339                  */00000030
 /*       SIST ENDRET 18/10-94 15.13.08 AV   JDA0310                  */00000040
 /*       SIST ENDRET 28/07-94 13.10.59 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 05/06-92 12.13.22 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 14/04-89 13.59.16 AV   HERMAN                   */00000070
 /*       SIST ENDRET 12/01-87 09.18.50 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 27/11-86 12.50.35 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 23/11-83 08.52.27 AV   JANKR                    */00000100
 /*       SIST ENDRET 28/10-83 11.42.02 AV   JANKR                    */00000110
 /* ***************************************************************** */00000120
 /* IDENTIFIKASJON                                                    */00000130
 /*     R0019951 - OMREGNING_PGA_INNTEKTSENDRING.                     */00000140
 /*                SUBRUTINE I PLI.                                   */00000150
 /*     PROGRAMMERER: JAN - H. KRISTENSEN AUGUST 1983.                */00000160
 /* HENSIKT                                                           */00000170
 /*     SE FORKLARING NEDENFOR.                                       */00000180
 /* PROGRAMTILKNYTNING                                                */00000190
 /*     INCLUDE MODUL.                                                */00000200
 /* ***************************************************************** */00000210
 /* ***************************************************************** */00000220
 /* OMREGNING ETTER INNTEKTSOPPDATERING.                              */00000230
 /*        MODULEN KALLER DE AKTUELLE PROGRAM SOM FORETAR             */00000240
 /*           BEREGNING, STØNADSBREVUTSKRIVING, DATABASESKRIV SAMT    */00000250
 /*           KALL PÅ STATISTIKKRUTINE.                               */00000260
 /*           NÅR EN PERSON I HOVEDREGISTERET ER BLITT OPPDATERT      */00000270
 /*           MED INNTEKT ELLER DET ER FORETATT INNTEKTSENDRING,      */00000280
 /*           KAN DET VÆRE GRUNN TIL Å FORETA OMREGNING AV            */00000290
 /*           YTELSENE OM SLIKE FINNES. DET ER AKTUELT                */00000300
 /*              - FOR ALDERS- OG UFØREPENSJONISTER NÅR DET GJELDER   */00000310
 /*                EGEN INNTEKT                                       */00000320
 /*              - VED SAMMENSTØTENDE PENSJON NÅR INNTEKTEN GJELDER   */00000330
 /*                EKTEFELLEN                                         */00000340
 /*              - FOR ETTERLATTE NÅR INNTEKTEN GJELDER DEN DØDE SOM  */00000350
 /*                AVGIR YTELSE                                       */00000360
 /*                                                                   */00000370
 /* ***************************************************************** */00000380
                                                                        00000390
                                                                        00000400
    OMREGNING_PGA_INNTEKTSENDRING: PROC (VSAM_RECORD_VIRKDATO_ÅM);      00000410
                                                                        00000420
                                                                        00000430
       DCL IND1               FIXED BIN(15);                            00000440
       DCL IND2               FIXED BIN(15);                            00000450
       DCL SAVE_KJØRINGSTYPE  CHAR(1);                                  00000460
                                                                        00000470
                                                                        00000480
       DCL DATE BUILTIN;                                                00000490
                                                                        00000500
       DCL DAGENS_DATO_ÅMD                    PIC '999999',             00000510
           DAGENS_DATO_ÅM DEF DAGENS_DATO_ÅMD PIC '9999',               00000520
           DAGENS_DATO_Å  DEF DAGENS_DATO_ÅMD PIC '99',                 00000530
           DAGENS_DATO_M  DEF DAGENS_DATO_ÅMD                           00000540
                                           POS(3)  PIC '99',            00000550
           DAGENS_DATO_D  DEF DAGENS_DATO_ÅMD                           00000560
                                           POS(5)  PIC '99';            00000570
                                                                        00000580
                                                                        00000590
       DCL HJ_DAGENS_DATO_ÅM                       PIC '9999',          00000600
           HJ_DAGENS_DATO_Å  DEF HJ_DAGENS_DATO_ÅM PIC '99',            00000610
           HJ_DAGENS_DATO_M  DEF HJ_DAGENS_DATO_ÅM                      00000620
                                           POS(3)  PIC '99';            00000630
                                                                        00000640
       DCL VSAM_RECORD_VIRKDATO_ÅM FIXED DEC (5);                       00000650
                                                                        00000660
                                                                        00000670
  DCL W_FNR         PIC '(11)9';                                        00000680
  DCL W_FNR_ÅM      PIC '(4)9';                                         00000690
  DCL  1 W_FNR_R DEF W_FNR,                                             00000700
         2 W_DAG      PIC '99',                                         00000710
         2 W_MND      PIC '99',                                         00000720
         2 W_ÅR       PIC '99',                                         00000730
         2 W_ÅRHUNDRE PIC '9',                                          00000740
         2 W_REST     PIC '(4)9';                                       00000750
                                                                        00000760
  DCL B01_TP_SUM    FIXED DEC (7) INIT (0);                             00000770
  DCL B02_TP_SUM    FIXED DEC (7) INIT (0);                             00000780
  DCL NEDSATT_DATO_ÅM  PIC '9999';                                      00000790
  DCL W_DATO_ÅM        PIC '9999';                                      00000800
  DCL SAVE_TRANSTYPE   PIC '99';                                        00000810
                                                                        00000820
  /*FOR Å FÅ RETT DATO I BEREGNINGSPROGRAM 4001 : */                    00000830
                                                                        00000840
  SAVE_TRANSTYPE = TRANS_OPPL_OMR.TRANSTYPE;                            00000850
  IF TRANS_OPPL_OMR.TRANSTYPE = 10             THEN                     00000860
     TRANS_OPPL_OMR.TRANSTYPE = 22;                                     00000870
                                                                        00000880
       DAGENS_DATO_ÅMD = DATE ();                                       00000890
                                                                        00000900
 /*FØRST FINNER VI DATO FOR UTSKRIVING AV BREV NÅR PENSJONEN GÅR NED*/  00000910
                                                                        00000920
       HJ_DAGENS_DATO_ÅM = DAGENS_DATO_ÅM + 1;                          00000930
                                                                        00000940
       IF HJ_DAGENS_DATO_M > 12 THEN                                    00000950
          DO;                                                           00000960
            HJ_DAGENS_DATO_Å = HJ_DAGENS_DATO_Å + 1;                    00000970
            HJ_DAGENS_DATO_M = HJ_DAGENS_DATO_M - 12;                   00000980
          END;                                                          00000990
                                                                        00001000
       NEDSATT_DATO_ÅM = HJ_DAGENS_DATO_ÅM;                             00001010
                                                                        00001020
 /*DERETTER FINNER VI DATO FOR BEREGNING AV PENSJON SOM GåR OPP : */    00001030
                                                                        00001040
       HJ_DAGENS_DATO_ÅM = DAGENS_DATO_ÅM + 1;                          00001050
                                                                        00001060
       IF HJ_DAGENS_DATO_M > 12 THEN                                    00001070
          DO;                                                           00001080
            HJ_DAGENS_DATO_Å = HJ_DAGENS_DATO_Å + 1;                    00001090
            HJ_DAGENS_DATO_M = HJ_DAGENS_DATO_M - 12;                   00001100
          END;                                                          00001110
                                                                        00001120
       NESTE_HENDELSE_DATO_ÅM = HJ_DAGENS_DATO_ÅM;                      00001130
                                                                        00001140
       TRANS_OPPL_OMR.VIRKNINGSDATO                                     00001150
                            = F_SNU_DATO(NESTE_HENDELSE_DATO_ÅM);       00001160
                                                                        00001170
 /* ***************************************************************** */00001180
 /* BEREGNING UTFØRES                                                 */00001190
 /* ***************************************************************** */00001200
       EXEC CICS LINK PROGRAM('R0014001') COMMAREA(KOM_OMR);            00001210
                                                                        00001220
       IF FEIL_MELD_NR > 0 THEN                                         00001230
          GOTO SLUTT;                                                   00001240
                                                                        00001250
       B02_TP_SUM    =                                                  00001260
          (B02.ALDERSP .TP       (SØKER_IND) +                          00001270
           B02.UFØRPENS.TP       (SØKER_IND) +                          00001280
           B02.YRKEPENS.TP       (SØKER_IND) +                          00001290
           B02.ETTEPENS.TP_BRUTTO(SØKER_IND) +                          00001300
           B02.ETTEBARN.TP       (SØKER_IND) )    ;                     00001310
                                                                        00001320
       B01_TP_SUM    =                                                  00001330
          (B01.ALDERSP .TP       (SØKER_IND) +                          00001340
           B01.UFØRPENS.TP       (SØKER_IND) +                          00001350
           B01.YRKEPENS.TP       (SØKER_IND) +                          00001360
           B01.ETTEPENS.TP_BRUTTO(SØKER_IND) +                          00001370
           B01.ETTEBARN.TP       (SØKER_IND) )    ;                     00001380
                                                                        00001390
       IF B02_TP_SUM = B01_TP_SUM THEN  ;                               00001400
                                                                        00001410
       ELSE                                                             00001420
                                                                        00001430
           DO;                                                          00001440
              IF B02_TP_SUM < B01_TP_SUM      THEN                      00001450
                 VSAM_RECORD_VIRKDATO_ÅM = NEDSATT_DATO_ÅM;             00001460
                                                                        00001470
              /* *************************************************** */ 00001480
              /* R0014901 LINKES FORDI STØNADSBREVET SKAL INNEHOLDE  */ 00001490
              /* OPPL. OM ETTERBETALING.  ERIK 24.9.86               */ 00001500
              /* *************************************************** */ 00001510
                                                                        00001520
              IF VSAM_RECORD_VIRKDATO_ÅM <= B02.STATUS.VIRK_DATO_ÅM     00001530
                                           (SØKER_IND) THEN             00001540
                                                                        00001550
                 DO;                                                    00001560
                                                                        00001570
                   TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO            00001580
                          (B02.STATUS.VIRK_DATO_ÅM(SØKER_IND));         00001590
                                                                        00001600
                   IF B01.FORVENTET(SØKER_IND) > 0       &              00001610
                      B01.GT_TILLEGG_LOV92(SØKER_IND) = 0   THEN        00001620
                                                                        00001630
                   CALL RULL_FORVENTET(NESTE_HENDELSE_DATO_ÅM,          00001640
                         B02.STATUS.VIRK_DATO_ÅM(SØKER_IND),            00001650
                         B02.FORVENTET(SØKER_IND));                     00001660
                                                                        00001670
                   /*-----------------------------------------------*/  00001680
                   /*VI MÅ RULLERE FORSI-INNTEKTER OG FAI           */  00001690
                   /*NYE REGLER FRA 0591 OG 0192.   270492,TRUDE    */  00001700
                   /*-----------------------------------------------*/  00001710
                                                                        00001720
                   W_FNR     = B02.FNR(SØKER_IND);                      00001730
                   W_FNR_ÅM  = W_FNR_R.W_ÅR!!W_FNR_R.W_MND;             00001740
                                                                        00001750
                   IF (W_FNR_ÅM                  > 2412 &               00001760
                       W_FNR_R.W_ÅRHUNDRE        < 5    &               00001770
                       B02.KONV_P_KODE(SØKER_IND) ^= 'K') !             00001780
                      (B02.KONV_P_KODE(SØKER_IND) = 'K'  &              00001790
                       B02.UTTAKSDATO_ÅM(SØKER_IND) > 9200 ) THEN       00001800
                       DO;                                              00001810
                         IF B02.ALDERSP.FAI    (SØKER_IND) > 0 THEN     00001820
                           DO;                                          00001830
                               DCL W_FAI FIXED DEC(7) INIT (0);         00001840
                               DCL FAI2 FIXED DEC(7) INIT (0);          00001850
                               W_FAI=                                   00001860
                               B02.ALDERSP.FAI (SØKER_IND);             00001870
                             CALL RULL_FAI(                             00001880
                                  NESTE_HENDELSE_DATO_ÅM,               00001890
                                  B02.STATUS.VIRK_DATO_ÅM(SØKER_IND),   00001900
                                  B02.ALDERSP.FAI(SØKER_IND));          00001910
                                FAI2 =                                  00001920
                                    B02.ALDERSP.FAI(SØKER_IND);         00001930
                           END;                                         00001940
                       END;                                             00001950
                                                                        00001960
                   IF B02.FORSI.ARBEIDSINNTEKT(SØKER_IND) > 0 THEN      00001970
                    DO;                                                 00001980
                       DCL INNT  FIXED DEC(7) INIT (0);                 00001990
                       DCL INNT2 FIXED DEC(7) INIT (0);                 00002000
                       INNT =                                           00002010
                          B02.FORSI.ARBEIDSINNTEKT(SØKER_IND);          00002020
                       B02.FORSI.ARBEIDSINNTEKT(SØKER_IND) =            00002030
                           F_RULL_FORSI(                                00002040
                            NESTE_HENDELSE_DATO_ÅM,                     00002050
                            B02.STATUS.VIRK_DATO_ÅM(SØKER_IND),         00002060
                            B02.FORSI.ARBEIDSINNTEKT(SØKER_IND));       00002070
                       INNT2 =                                          00002080
                          B02.FORSI.ARBEIDSINNTEKT(SØKER_IND);          00002090
                    END;                                                00002100
                                                                        00002110
                   IF B02.FORSI.PENSJONSINNTEKT(SØKER_IND) > 0 THEN     00002120
                    DO;                                                 00002130
                       DCL PINNT  FIXED DEC(7) INIT (0);                00002140
                       DCL PINNT2 FIXED DEC(7) INIT (0);                00002150
                       PINNT =                                          00002160
                          B02.FORSI.PENSJONSINNTEKT(SØKER_IND);         00002170
                       B02.FORSI.PENSJONSINNTEKT(SØKER_IND) =           00002180
                           F_RULL_FORSI(                                00002190
                            NESTE_HENDELSE_DATO_ÅM,                     00002200
                            B02.STATUS.VIRK_DATO_ÅM(SØKER_IND),         00002210
                            B02.FORSI.PENSJONSINNTEKT(SØKER_IND));      00002220
                       PINNT2 =                                         00002230
                          B02.FORSI.PENSJONSINNTEKT(SØKER_IND);         00002240
                    END;                                                00002250
                                                                        00002260
                   IF B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND) > 0 THEN   00002270
                    DO;                                                 00002280
                       DCL AINNT  FIXED DEC(7) INIT (0);                00002290
                       DCL AINNT2 FIXED DEC(7) INIT (0);                00002300
                       AINNT =                                          00002310
                          B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND);       00002320
                       B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND) =         00002330
                           F_RULL_FORSI(                                00002340
                            NESTE_HENDELSE_DATO_ÅM,                     00002350
                            B02.STATUS.VIRK_DATO_ÅM(SØKER_IND),         00002360
                            B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND));    00002370
                       AINNT2 =                                         00002380
                          B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND);       00002390
                    END;                                                00002400
                                                                        00002410
                   IF B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND) > 0 THEN  00002420
                    DO;                                                 00002430
                       DCL EINNT  FIXED DEC(7) INIT (0);                00002440
                       DCL EINNT2 FIXED DEC(7) INIT (0);                00002450
                       EINNT =                                          00002460
                          B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND);      00002470
                       B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND) =        00002480
                           F_RULL_FORSI(                                00002490
                            NESTE_HENDELSE_DATO_ÅM,                     00002500
                            B02.STATUS.VIRK_DATO_ÅM(SØKER_IND),         00002510
                            B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND));   00002520
                      EINNT2 =                                          00002530
                          B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND);      00002540
                                                                        00002550
                    END;                                                00002560
                                                                        00002570
 /* RULLERING AV EKTEFELLES INNTEKTER - 9809 HL */                      00002580
                                                                        00002590
    IF B02.ALDERSP.FAI(EKTEF_IND) > 0   THEN                            00002600
       CALL RULL_FAI(NESTE_HENDELSE_DATO_ÅM,                            00002610
                     B02.VIRK_DATO_ÅM(EKTEF_IND),                       00002620
                     B02.ALDERSP.FAI(EKTEF_IND));                       00002630
                                                                        00002640
    IF B02.FORSI.PENSJONSINNTEKT(EKTEF_IND) > 0  THEN                   00002650
       B02.FORSI.PENSJONSINNTEKT(EKTEF_IND) =                           00002660
           F_RULL_FORSI(NESTE_HENDELSE_DATO_ÅM,                         00002670
                 B02.VIRK_DATO_ÅM(EKTEF_IND),                           00002680
                 B02.FORSI.PENSJONSINNTEKT(EKTEF_IND));                 00002690
                                                                        00002700
    IF B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND) > 0  THEN                    00002710
       B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND) =                            00002720
           F_RULL_FORSI(NESTE_HENDELSE_DATO_ÅM,                         00002730
                 B02.VIRK_DATO_ÅM(EKTEF_IND),                           00002740
                 B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND));                  00002750
                                                                        00002760
    IF B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND) > 0  THEN                00002770
       B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND) =                        00002780
           F_RULL_FORSI(NESTE_HENDELSE_DATO_ÅM,                         00002790
                  B02.VIRK_DATO_ÅM(EKTEF_IND),                          00002800
                  B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND));             00002810
                                                                        00002820
    IF B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND) > 0  THEN                 00002830
       B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND) =                         00002840
           F_RULL_FORSI(NESTE_HENDELSE_DATO_ÅM,                         00002850
                 B02.VIRK_DATO_ÅM(EKTEF_IND),                           00002860
                 B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND));               00002870
                                                                        00002880
                   STØNADSBREV_ØNSKET_IND = '1'B;                       00002890
                                                                        00002900
                   EXEC CICS LINK PROGRAM('R0014001') COMMAREA(KOM_OMR);00002910
                                                                        00002920
                   CALL STAT_SKRIV;                                     00002930
                                                                        00002940
                   B01 = B02 ;                                          00002950
                                                                        00002960
                   IF TRANS_OPPL_OMR.VIRKNINGSDATO =                    00002970
                                       NESTE_HENDELSE_DATO_ÅM  THEN;    00002980
                   ELSE                                                 00002990
                                                                        00003000
                   EXEC CICS LINK PROGRAM('R0014901') COMMAREA(KOM_OMR);00003010
                                                                        00003020
                 END;                                                   00003030
                                                                        00003040
              ELSE                                                      00003050
                 DO;                                                    00003060
                    DCL HL_ÅM  FIXED DEC (4) INIT (0);                  00003070
                    W_DATO_ÅM              = VSAM_RECORD_VIRKDATO_ÅM;   00003080
                    DIV_PERIODE.INTENDR_ÅM = W_DATO_ÅM;                 00003090
                    HL_ÅM = DIV_PERIODE.INTENDR_ÅM;                     00003100
                    TRANS_OPPL_OMR.VIRKNINGSDATO =                      00003110
                       F_SNU_DATO(W_DATO_ÅM);                           00003120
                    CALL STAT_SKRIV;                                    00003130
                    DIV_PERIODE.INTENDR_ÅM = 0;                         00003140
                 END;                                                   00003150
                                                                        00003160
              CALL RYDD_OPP;                                            00003170
                                                                        00003180
         END;                                                           00003190
                                                                        00003200
  STAT_SKRIV: PROC;                                                     00003210
              /* *************************************************** */ 00003220
              /* STATISTIKK - TRANS BLIR LAGET PÅ GRUNNLAG AV        */ 00003230
              /* ENDRINGER B01 TIL B02                               */ 00003240
              /* *************************************************** */ 00003250
  /*ROLF */   EXEC CICS LINK PROGRAM('R0016001') COMMAREA(KOM_OMR);     00003260
                                                                        00003270
              IF FEIL_MELD_NR > 0 THEN                                  00003280
                 GOTO SLUTT;                                            00003290
                                                                        00003300
                                                                        00003310
              /* *************************************************** */ 00003320
              /* STØNADSBREV SKRIVES                                 */ 00003330
              /* *************************************************** */ 00003340
                                                                        00003350
              TRANS_OPPL_OMR.TRANSTYPE = SAVE_TRANSTYPE;                00003360
              EXEC CICS LINK PROGRAM('R0017001') COMMAREA(KOM_OMR);     00003370
              IF FEIL_MELD_NR > 0 THEN                                  00003380
                 DO;                                                    00003390
                    EXEC CICS LINK PROGRAM('R0016401')                  00003400
                                    COMMAREA(KOM_OMR);                  00003410
                                                                        00003420
                    GOTO SLUTT;                                         00003430
                 END;                                                   00003440
                                                                        00003450
  END STAT_SKRIV;                                                       00003460
                                                                        00003470
                                                                        00003480
       SLUTT:;                                                          00003490
                                                                        00003500
    %INCLUDE R0019954;         /*     RULL_FORVENTET           */       00003510
    %INCLUDE R0019967;         /*     RULL_FAI                 */       00003520
    %INCLUDE R0019968;         /*     RULL_FORSI               */       00003530
                                                                        00003540
       RYDD_OPP: PROC;                                                  00003550
                                                                        00003560
                                                                        00003570
                                                                        00003580
              IF FEIL_MELD_NR = 0 THEN                                  00003590
                 DO;                                                    00003600
                                                                        00003610
 /* ***************************************************************** */00003620
 /* FAMILIEN BLIR SKREVET TILBAKE PÅ BASEN                            */00003630
 /* ***************************************************************** */00003640
                                                                        00003650
                    EXEC CICS LINK PROGRAM('R0015401')                  00003660
                                    COMMAREA(KOM_OMR);                  00003670
                                                                        00003680
                                                                        00003690
                    EXEC CICS LINK PROGRAM('R0017101')                  00003700
                                    COMMAREA(KOM_OMR);                  00003710
                                                                        00003720
                                                                        00003730
                 END;                                                   00003740
                                                                        00003750
              IF FEIL_MELD_NR > 0 THEN                                  00003760
                                                                        00003770
                                                                        00003780
                    EXEC CICS LINK PROGRAM('R0016401')                  00003790
                                    COMMAREA(KOM_OMR);                  00003800
                                                                        00003810
                                                                        00003820
       END RYDD_OPP;                                                    00003830
                                                                        00003840
    END OMREGNING_PGA_INNTEKTSENDRING;                                  00003850
