 /*       SIST ENDRET 12/10-95 14.12.52 AV   JDA0310                  */00000000
  /* **************************************************************** */00000010
  /*IDENTIFIKASJON:                                                   */00000020
  /*    R0015502 - HOVEDPROGRAM I PLI                                 */00000030
  /*                                                                  */00000040
  /*    PROGRAMMERER: PATHAK             OKTOBER  1995                */00000050
  /*                                                                  */00000060
  /*HENSIKT:                                                          */00000070
  /*    FJERNER US TRANSER     FRA    DB.                             */00000080
  /*                                                                  */00000090
  /*PROGRAMTILKNYTNING:                                               */00000100
  /*                                                                  */00000110
  /*BRUKER                                                            */00000120
  /*                                                                  */00000130
  /* **************************************************************** */00000140
                                                                        00000150
  R001550:                                                              00000160
    PROC            (LOKAL_KOM_PTR)                                     00000170
           OPTIONS  (MAIN);                                             00000180
                                                                        00000190
    %PAGE;                                                              00000200
    %INCLUDE P0019908;                         /* KOM_OMR         (B) */00000210
                                                                        00000220
    %PAGE;                                                              00000230
    %INCLUDE P0019912;                         /* DIV_PARAM_OMR   (B) */00000240
    %INCLUDE P0019913;                         /* LOKAL_KOM_OMR   (B) */00000250
                                                                        00000260
    %PAGE;                                                              00000270
    /* ************************************************************** */00000280
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00000290
    /* ************************************************************** */00000300
                                                                        00000310
       DCL                                                              00000320
         ( ADDR , CSTG , LOW , STG , SUBSTR )  BUILTIN;                 00000330
       DCL                                                              00000340
         PLITDLI ENTRY;                                                 00000350
                                                                        00000360
       DCL                                                              00000370
         ( LOKAL_KOM_PTR, COMMAREA_PEKER , W01_HJELPE_PEKER ) POINTER;  00000380
    /* ************************************************************** */00000390
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000400
    /* ************************************************************** */00000410
                                                                        00000420
    %INCLUDE DLIUIB;                                                    00000430
                                                                        00000440
       DCL                                                              00000450
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00000460
                                                                        00000470
                                                                        00000480
    %PAGE;                                                              00000490
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00000500
                                                                        00000510
                                                                        00000520
    /* ************************************************************** */00000530
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00000540
    /* ************************************************************** */00000550
                                                                        00000560
    %PAGE;                                                              00000570
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                   00000580
    %INCLUDE P0012003;                         /* PCB                 */00000590
                                                                        00000600
                                                                        00000610
    /* ************************************************************** */00000620
    /*   OPPTELINGS- OG LOOP-PARAMETRE M.M                            */00000630
    /* ************************************************************** */00000640
                                                                        00000650
       DCL 1  W01                       UNALIGNED,                      00000660
              2   MER_DATA                    BIT  (1)   INIT ('1'B),   00000670
              2   BARN_IKKE_LEST              BIT  (1)   INIT ('1'B),   00000680
              2   PERSON_IKKE_FUNNET          BIT  (1)   INIT ('1'B),   00000690
              2   TO_GRUNNBYP_LEST            BIT  (1)   INIT ('0'B),   00000700
              2   GRUNNBYP_IKKE_LEST          BIT  (1)   INIT ('1'B),   00000710
              2   TO_GRUNNEES_LEST            BIT  (1)   INIT ('0'B),   00000720
              2   GRUNNEES_IKKE_LEST          BIT  (1)   INIT ('1'B),   00000730
              2   NAVN                        CHAR (25)  INIT ((25)' '),00000740
              2   VIRK_DATO_ÅM                PIC '9999' INIT ( 0  ),   00000750
              2   VTP_ÅM_SISTE                PIC '9999' INIT ( 0  ),   00000760
              2   I                    FIXED  BIN  (15)  INIT (1),      00000770
              2   J                    FIXED  BIN  (15)  INIT (1);      00000780
                                                                        00000790
    /* ************************************************************** */00000800
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00000810
    /* ************************************************************** */00000820
                                                                        00000830
 /*    DCL 1  W01_DLI_PARAM,    OMRÅDET MÅ VÆRE UNALIGNED      */       00000840
 /*                             NY VERSJON AV IMS  120788 BF   */       00000850
                                                                        00000860
       DCL 1  W01_DLI_PARAM      UNALIGNED,                             00000870
              2   W02_GU                  CHAR (4)   INIT ('GU  '),     00000880
              2   W02_GN                  CHAR (4)   INIT ('GN  '),     00000890
              2   W02_GHN                 CHAR (4)   INIT ('GHN '),     00000900
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),     00000910
              2   W02_DLET                CHAR (4)   INIT ('DLET'),     00000920
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00000930
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00000940
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),          00000950
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');  00000960
                                                                        00000970
       DCL    W01_IO                CHAR (265)       INIT ( (265) ' ' ),00000980
              W01_HJELPE_IO         CHAR (265) BASED (W01_HJELPE_PEKER);00000990
                                                                        00001000
    /* ************************************************************** */00001010
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00001020
    /* ************************************************************** */00001030
                                                                        00001040
       DCL    SSA_UQUAL                       CHAR (9) INIT ((9)' ');   00001050
                                                                        00001060
       DCL 1  SSA1_TRANHIST_CMD               ,                         00001070
              2    HDEL                       CHAR (19)  INIT           00001080
                                                ('TRANHIST*P(GRBLKODE'),00001090
              2    REL_OP_1                   CHAR (2)   INIT ('^='),   00001100
              2    GRBLKODE                   CHAR (2)   INIT ('US'),   00001110
              2    HP                         CHAR (1)   INIT (')');    00001120
                                                                        00001130
                                                                        00001140
                                                                        00001150
       DCL 1  SSA_UQUAL_CMD          UNALIGNED,                         00001160
              2   NAVN                        CHAR (8) INIT('TRANHIST'),00001170
              2   KODE                        CHAR (2) INIT('*P');      00001180
                                                                        00001190
       DCL 1  SSA1_RF0PERSN          UNALIGNED,                         00001200
              2    HDEL                       CHAR (17)  INIT           00001210
                                                  ('RF0PERSN(FNR     '),00001220
              2    REL_OP                     CHAR (2)   INIT (' ='),   00001230
              2    PKEY              FIXED    DEC  (11),                00001240
              2    HP                         CHAR (1)   INIT (')' );   00001250
                                                                        00001260
       DCL 1  SSA1_TRANHIST          UNALIGNED,                         00001270
              2    HDEL                       CHAR (19)  INIT           00001280
                                                ('TRANHIST*P(VIRKDATO'),00001290
              2    REL_OP_1                   CHAR (1)   INIT (' '),    00001300
              2    REL_OP_2                   CHAR (1)   INIT ('>'),    00001310
              2    VTP               FIXED    DEC  (4)   INIT ( 0 ),    00001320
              2    KONKAT                     CHAR (1)   INIT ('&'),    00001330
              2    MDEL                       CHAR (8)   INIT           00001340
                                                        ('GRBLKODE'),   00001350
              2    REL_OP_3                   CHAR (2)   INIT ('^='),   00001360
              2    GRBLKODE                   CHAR (2)   INIT ('US'),   00001370
              2    HP                         CHAR (1)   INIT (')');    00001380
                                                                        00001390
                                                                        00001400
    /* ************************************************************** */00001410
    /*                                                                */00001420
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00001430
    /*     ---------------------------------------------------        */00001440
    /*                                                                */00001450
    /*                                                                */00001460
    /*      INITIERING AV PARAMETRE TIL DIV_PARAM_OMR.                */00001470
    /*                                                                */00001480
    /*      SETTER UIBPTR = UIB_PEKER   SOM OVERFØRES ETTER           */00001490
    /*      INITIERINGS-KALL   I     R0012001 .                       */00001500
    /*                                                                */00001510
    /* ************************************************************** */00001520
                                                                        00001530
                                                                        00001540
                                                                        00001550
                                                                        00001560
    COMMAREA_PEKER =  HOVED_KOM_OMR_PTR;                                00001570
    PROGRAM_ID                              =   'R0015502'             ;00001580
    UIBPTR                                  =    UIB_PEKER             ;00001590
                                                                        00001600
                                                                        00001610
    IF SUBSTR(CICS_NAVN,1,4) = 'HELP'     THEN                          00001620
             SSA1_TRANHIST_CMD.REL_OP_1 = ' =' ;                        00001630
                                                                        00001640
                                                                        00001650
    /* ********************************************************** */    00001660
    /* SETTER INN VERDIENE I SSA'ENE.                             */    00001670
    /* ********************************************************** */    00001680
                                                                        00001690
    SSA1_RF0PERSN.PKEY              =   SEARCH_FNR                 ;    00001700
    CALL  P005_LES_ROT_GU;                                              00001710
       IF FEIL_MELD_NR         >     0               THEN               00001720
          GO   TO   L999;                                               00001730
                                                                        00001740
    DO I = 1 TO TRANS_ANT          WHILE (FEIL_MELD_NR = 0);            00001750
                                                                        00001760
       CALL P020_LES_NESTE_TRANHIST;                                    00001770
                                                                        00001780
       IF FEIL_MELD_NR         >     0               THEN               00001790
          GO   TO   L999;                                               00001800
                                                                        00001810
       CALL  P030_DLET_TRANHIST;                                        00001820
    END;                                                                00001830
                                                                        00001840
    /* ************************************************************** */00001850
    /* ************************************************************** */00001860
    /* ************************************************************** */00001870
                                                                        00001880
                                                                        00001890
    %PAGE;                                                              00001900
    /* ************************************************************** */00001910
    /*                                                                */00001920
    /* PROCEDURE FOR LESE ROT-SEGM              ( GHU   )             */00001930
    /*                                                                */00001940
    /* ************************************************************** */00001950
                                                                        00001960
    P005_LES_ROT_GU:                                                    00001970
      PROC;                                                             00001980
                                                                        00001990
      CALL PLITDLI                              (W02_PARM_CT_4,         00002000
                                                 W02_GU,                00002010
                                                 RF1,                   00002020
                                                 W01_IO,                00002030
                                                 SSA1_RF0PERSN);        00002040
                                                                        00002050
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00002060
        DO;                                                             00002070
          SELECT  ( RF1.STATUS_KODE );                                  00002080
                                                                        00002090
            WHEN  ( '  ' )                                              00002100
              W01.MER_DATA                 =    '1'B;                   00002110
                                                                        00002120
            WHEN  ( 'GE' )                                              00002130
              W01.MER_DATA                 =    '0'B;                   00002140
                                                                        00002150
            OTHERWISE                                                   00002160
              DO;                                                       00002170
                /* ************************************************** */00002180
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00002190
                /* ************************************************** */00002200
  L110:                                                                 00002210
                DB_STATUS_KODE             = RF1.STATUS_KODE;           00002220
                FEIL_MELD_NR               =     500;                   00002230
                FEIL_VED_LABEL             =    '110';                  00002240
                                                                        00002250
              END;                                                      00002260
          END;                                                          00002270
        END;                                                            00002280
      ELSE                                                              00002290
        DO;                                                             00002300
          /* ************************************************** */      00002310
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00002320
          /* ************************************************** */      00002330
  L120:                                                                 00002340
          DB_STATUS_KODE             = RF1.STATUS_KODE;                 00002350
          FEIL_MELD_NR               =     500;                         00002360
          FEIL_VED_LABEL             =    '120';                        00002370
        END;                                                            00002380
    END P005_LES_ROT_GU;                                                00002390
                                                                        00002400
                                                                        00002410
                                                                        00002420
    /* ************************************************************** */00002430
    /*                                                                */00002440
    /* PROCEDURE FOR LESE NESTE TRANHIST (GN    UKVALIFISERT  )       */00002450
    /*                                                                */00002460
    /* ************************************************************** */00002470
                                                                        00002480
    P020_LES_NESTE_TRANHIST:                                            00002490
      PROC;                                                             00002500
                                                                        00002510
      CALL PLITDLI                              (W02_PARM_CT_5,         00002520
                                                 W02_GHN,               00002530
                                                 RF1,                   00002540
                                                 W01_IO,                00002550
                                                 SSA1_RF0PERSN,         00002560
                                                 SSA1_TRANHIST_CMD);    00002570
                                                                        00002580
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00002590
        DO;                                                             00002600
          SELECT ( RF1.STATUS_KODE );                                   00002610
                                                                        00002620
            WHEN ( '  ' , 'GA' , 'GK' )                                 00002630
              W01.MER_DATA                 =    '1'B;                   00002640
                                                                        00002650
            WHEN ( 'GE' , 'GB' )                                        00002660
              W01.MER_DATA                 =    '0'B;                   00002670
                                                                        00002680
            OTHERWISE                                                   00002690
              DO;                                                       00002700
                /* ************************************************** */00002710
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00002720
                /* ************************************************** */00002730
  L130:                                                                 00002740
                DB_STATUS_KODE             = RF1.STATUS_KODE;           00002750
                FEIL_MELD_NR               =     500;                   00002760
                FEIL_VED_LABEL             =    '130';                  00002770
                                                                        00002780
              END;                                                      00002790
          END;                                                          00002800
        END;                                                            00002810
      ELSE                                                              00002820
        DO;                                                             00002830
          /* ************************************************** */      00002840
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00002850
          /* ************************************************** */      00002860
  L140:                                                                 00002870
          DB_STATUS_KODE             = RF1.STATUS_KODE;                 00002880
          FEIL_MELD_NR               =     500;                         00002890
          FEIL_VED_LABEL             =    '140';                        00002900
        END;                                                            00002910
    END P020_LES_NESTE_TRANHIST;                                        00002920
                                                                        00002930
                                                                        00002940
                                                                        00002950
                                                                        00002960
    /* ************************************************************** */00002970
    /*                                                                */00002980
    /* PROCEDURE FOR FJRENE THRANHIST                                 */00002990
    /*                                                                */00003000
    /* ************************************************************** */00003010
                                                                        00003020
    P030_DLET_TRANHIST:                                                 00003030
      PROC;                                                             00003040
                                                                        00003050
      CALL PLITDLI                              (W02_PARM_CT_3,         00003060
                                                 W02_DLET,              00003070
                                                 RF1,                   00003080
                                                 W01_IO);               00003090
                                                                        00003100
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00003110
        DO;                                                             00003120
          SELECT ( RF1.STATUS_KODE );                                   00003130
            WHEN ( '  ' , 'GA' , 'GK' )                                 00003140
              W01.MER_DATA                 =    '1'B;                   00003150
            WHEN ( 'GE' , 'GB' )                                        00003160
              W01.MER_DATA                 =    '0'B;                   00003170
            OTHERWISE                                                   00003180
              DO;                                                       00003190
                /* ************************************************** */00003200
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00003210
                /* ************************************************** */00003220
  L150:                                                                 00003230
                DB_STATUS_KODE             = RF1.STATUS_KODE;           00003240
                FEIL_MELD_NR               =     500;                   00003250
                FEIL_VED_LABEL             =    '150';                  00003260
                                                                        00003270
              END;                                                      00003280
          END;                                                          00003290
        END;                                                            00003300
      ELSE                                                              00003310
        DO;                                                             00003320
          /* ************************************************** */      00003330
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00003340
          /* ************************************************** */      00003350
  L160:                                                                 00003360
          DB_STATUS_KODE             = RF1.STATUS_KODE;                 00003370
          FEIL_MELD_NR               =     500;                         00003380
          FEIL_VED_LABEL             =    '160';                        00003390
        END;                                                            00003400
    END P030_DLET_TRANHIST;                                             00003410
                                                                        00003420
                                                                        00003430
                                                                        00003440
                                                                        00003450
    /* ************************************************************ */  00003460
    /*                                                              */  00003470
    /*  LESER NESTE TRANS MED :                   VTP  >   VTP.NS   */  00003480
    /*                                                              */  00003490
    /* ************************************************************ */  00003500
                                                                        00003510
    P030_LES_TRANHIST_GN_QUAL:                                          00003520
      PROC;                                                             00003530
                                                                        00003540
      CALL PLITDLI                              (W02_PARM_CT_5,         00003550
                                                 W02_GN,                00003560
                                                 RF1,                   00003570
                                                 W01_IO,                00003580
                                                 SSA1_RF0PERSN,         00003590
                                                 SSA1_TRANHIST);        00003600
                                                                        00003610
                                                                        00003620
                                                                        00003630
      IF   UIBFCTR                        ^=     UIB_RC_OK    THEN      00003640
        DO;                                                             00003650
          /* ************************************************** */      00003660
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00003670
          /* ************************************************** */      00003680
  L170:                                                                 00003690
          DB_STATUS_KODE             = RF1.STATUS_KODE;                 00003700
          FEIL_MELD_NR               =     500;                         00003710
          FEIL_VED_LABEL             =    '170';                        00003720
          GO   TO  RETUR;                                               00003730
        END;                                                            00003740
                                                                        00003750
      SELECT ( RF1.STATUS_KODE );                                       00003760
                                                                        00003770
        WHEN ( '  ' , 'GA' , 'GK' )                                     00003780
          DO;                                                           00003790
            /* ************************************** */                00003800
            /*  VTP LEST TRANS    >    VTP NST SISTE  */                00003810
            /* ************************************** */                00003820
                                                                        00003830
            W01.MER_DATA                   =    '1'B;                   00003840
          END;                                                          00003850
                                                                        00003860
        WHEN ( 'GE' , 'GB' )                                            00003870
          DO;                                                           00003880
            /* ************************************** */                00003890
            /*  FINNES INGEN TRANS                    */                00003900
            /* ************************************** */                00003910
                                                                        00003920
            W01.MER_DATA         =   '0'B;                              00003930
          END;                                                          00003940
                                                                        00003950
        OTHERWISE                                                       00003960
          DO;                                                           00003970
            /* ************************************************** */    00003980
            /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */    00003990
            /* ************************************************** */    00004000
                                                                        00004010
  L180:                                                                 00004020
            DB_STATUS_KODE             = RF1.STATUS_KODE;               00004030
            FEIL_MELD_NR               =     500;                       00004040
            FEIL_VED_LABEL             =    '180';                      00004050
          END;                                                          00004060
                                                                        00004070
      END;  /*      SELECT  (RF1.STATUS_KODE)                      */   00004080
                                                                        00004090
  RETUR:                                                                00004100
    END P030_LES_TRANHIST_GN_QUAL;                                      00004110
                                                                        00004120
                                                                        00004130
                                                                        00004140
    /* ********************************************************* */     00004150
    /*                                                           */     00004160
    /* *****  PROC SOM KALLER RIKTIG BLANKETT-OMRÅDET  *******   */     00004170
    /*                                                           */     00004180
    /* ********************************************************* */     00004190
                                                                        00004200
  L999:                                                                 00004210
                                                                        00004220
    EXEC CICS RETURN;                                                   00004230
  END R001550;                                                          00004240
