 /*       SIST ENDRET 11/07-91 14.24.53 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 14/06-91 13.30.23 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 11/03-91 09.56.10 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 06/03-91 14.37.25 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 12/06-90 13.36.37 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 29/03-88 13.21.53 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 10/03-87 09.07.14 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 10/10-83 14.16.24 AV   OLAV                     */00000070
 /*       SIST ENDRET 02/05-83 11.37.08 AV   OLAV                     */00000080
 /*       SIST ENDRET 14/04-83 08.38.58 AV   OLAV                     */00000090
 /*********************************************************************/00000100
 /*IDENTIFIKASJON:                                                    */00000110
 /*    R0014601 - BEREGN_ETTERLATT_FAMILIEPLEIER -HOVEDPROGRAM I PLI  */00000120
 /*    PROGRAMMERER : KARIN SVENDSEN AUGUST 1982                      */00000130
 /*HENSIKT:                                                           */00000140
 /*    PROGRAMMET FORETAR BEREGNING FOR ETTERLATT FAMILIEPLEIER OG    */00000150
 /*    INKLUDERER DE NØDVENDIGE UNDERMODULER.                         */00000160
 /*PROGRAMTILKNYTNING:                                                */00000170
 /*    PROGRAMMET BLIR LINKET FRA R0014001 - BEREGNING                */00000180
 /*BRUK:                                                              */00000190
 /*    EXEC CICS LINK PROGRAM('R0014601') COMMAREA(KOM_OMR);          */00000200
 /*********************************************************************/00000210
 R001460:                                                               00000220
   PROC(COMMAREA_PEKER) OPTIONS (MAIN);                                 00000230
                                                                        00000240
 %PAGE;                                                                 00000250
 %INCLUDE P0019906;   /* TRANS_OPPL_OMRÅDE(BASED)   */                  00000260
 %PAGE;                                                                 00000270
 %INCLUDE P0019908;   /* KOM_OMRÅDE (BASED)         */                  00000280
 %PAGE;                                                                 00000290
 %INCLUDE P0019912;   /* DIV PARAM OMRÅDE (BASED)   */                  00000300
 %PAGE;                                                                 00000310
 DCL 1 B01 BASED(B01_PEKER),                                            00000320
 %INCLUDE P0019921;   /* B01_OMRÅDE       (BASED)   */                  00000330
 %PAGE;                                                                 00000340
 DCL 1 B02 BASED(B02_PEKER),                                            00000350
 %INCLUDE P0019921;   /* B02_OMRÅDE       (BASED)   */                  00000360
                                                                        00000370
 %PAGE;                                                                 00000380
 DCL COMMAREA_PEKER          PTR;                                       00000390
 DCL                                                                    00000400
     EKTEF_IND               FIXED BIN(15),                             00000410
     I                       FIXED BIN(15),                             00000420
     W_FRADRAG_F             FIXED DEC(5),                              00000430
     W_ST                    FIXED DEC(7,2),                            00000440
     W_KT                    FIXED DEC(5,2),                            00000450
     W_FORH_INDIKATOR        CHAR(1) INIT ('N'),                        00000460
     W_KOMPFAKTOR            FIXED DEC(3,1),                            00000470
     W_ANTALL_BARN           FIXED DEC(3) INIT (0),                     00000480
     FNR                     PIC'(11)9',                                00000490
     ÅRHUNDRE DEF FNR POS(7) PIC '9',                                   00000500
     ÅR       DEF FNR POS(5) PIC '99';                                  00000510
                                                                        00000520
  DCL W_TT_KONV_ÅR  FIXED DEC (3) INIT (0);                             00000530
                                                                        00000540
 /* **************************************************************** */ 00000550
 /* PROGRAMMET STARTER HER                                           */ 00000560
 /* **************************************************************** */ 00000570
                                                                        00000580
 IF TRANS_OPPL_OMR.BLANKETTYPE = 'E4' THEN   /*NY0191*/                 00000590
    CALL HENT_FRA_E4;                                                   00000600
                                                                        00000610
 CALL BEREGN_GP_FAMILIEPLEIER;                                          00000620
                                                                        00000630
 /* W_ST HAR TO DESIMALER OG ER IKKE FORHØYET */                        00000640
                                                                        00000650
 W_ST = F_BEREGN_SÆRTILLEGG(                                            00000660
                            0,0,'J',                                    00000670
                            ST_PROSENT_ENSLIG,                          00000680
                            100,                                        00000690
                            B02.TT_ANV(BER_SØ_IND));                    00000700
                                                                        00000710
 /* W_KT HAR TO DESIMALER OG ER IKKE FORHØYET */                        00000720
                                                                        00000730
 W_KOMPFAKTOR = 1;   /* FULLT KOMPTILLEGG     */                        00000740
                                                                        00000750
 /*   ENDRET  10.02.88   SATISH                              */         00000760
 /*  W_KT = F_BEREGN_KOMPENSASJONSTILLEGG                    */         00000770
 /*         (B02.PENSJONSTYPE2(BER_SØ_IND),                  */         00000780
 /*          B02.TT_ANV(BER_SØ_IND),                         */         00000790
 /*          0,W_KOMPFAKTOR,'J');                            */         00000800
 /*  HIT TIL                                                 */         00000810
                                                                        00000820
 IF G > 34100 THEN                                                      00000830
    W_KT = 0;                                                           00000840
 ELSE                                                                   00000850
    W_KT = F_BEREGN_KOMPENSASJONSTILLEGG(                               00000860
            B02.PENSJONSTYPE1(BER_SØ_IND),                              00000870
            B02.PENSJONSTYPE2(BER_SØ_IND),                              00000880
            B02.TT_ANV(BER_SØ_IND),                                     00000890
            0,W_KOMPFAKTOR,'J');                                        00000900
                                                                        00000910
  /* ***********************************************************  */    00000920
  /* DEN PÅFØLGENDE TESTEN SKAL UNNGÅ Å GI UTENLANDSBOENDE KOMP.  */    00000930
  /* ERIK 22.12.86.                                               */    00000940
  /* ***********************************************************  */    00000950
                                                                        00000960
                                                                        00000970
  IF B02.SPESOPPL.BOSATT(BER_SØ_IND) > 0 THEN W_KT = 0 ;                00000980
                                                                        00000990
                                                                        00001000
                                                                        00001010
                                                                        00001020
 IF B02.FORVENTET(BER_SØ_IND) * 100 > 0.5 * G THEN                      00001030
    DO;                                                                 00001040
       /* JUSTERER ST OG KT OG BEREGNER GP_NETTO   */                   00001050
                                                                        00001060
       CALL JUSTER_MED_FORVENTET_INNTEKT(W_KT);                         00001070
 /*KOMP.TILLEGGET ENDRET FRA 1.5.91 ( G > 34100 ) */                    00001080
                                                                        00001090
        IF G > 34100 THEN                                               00001100
        B02.ETTEPENS.KT(BER_SØ_IND) = 0;                                00001110
                                                                        00001120
       B02.SUM_YTELSE(BER_SØ_IND)  = B02.GP_NETTO(BER_SØ_IND)           00001130
                                     + B02.ETTEPENS.KT(BER_SØ_IND)      00001140
                                     + B02.ETTEPENS.ST(BER_SØ_IND);     00001150
    END;                                                                00001160
 ELSE                                                                   00001170
    DO;                                                                 00001180
       B02.GP_NETTO(BER_SØ_IND)    = B02.GP_BRUTTO(BER_SØ_IND);         00001190
       B02.FORVENTET  (BER_SØ_IND) = 0;                                 00001200
       B02.ETTEPENS.KT(BER_SØ_IND) = W_KT;                              00001210
       B02.ETTEPENS.ST(BER_SØ_IND) = W_ST;                              00001220
                                                                        00001230
       B02.SUM_YTELSE(BER_SØ_IND)  = B02.GP_BRUTTO(BER_SØ_IND)          00001240
                                     + B02.ETTEPENS.KT(BER_SØ_IND)      00001250
                                     + B02.ETTEPENS.ST(BER_SØ_IND);     00001260
    END;                                                                00001270
                                                                        00001280
   HENT_FRA_E4: PROC;                                                   00001290
      %INCLUDE P001N901; /*E4-OMR*/                                     00001300
      W_TT_KONV_ÅR = E4SP.TT_KONVENSJON_ÅR;                             00001310
   END HENT_FRA_E4;                                                     00001320
                                                                        00001330
 EXEC CICS RETURN;                                                      00001340
 %PAGE;                                                                 00001350
 %INCLUDE R0014621;   /* BEREGN_GP_FAMILIEPLEIER    */                  00001360
 %INCLUDE R0014133;   /* F_BEREGN_SÆRTILLEGG   */                       00001370
 %INCLUDE R0014134;   /* F_BEREGN_KOMPTILLEGG  */                       00001380
 %INCLUDE R0014324;   /* JUSTER_MED_FORVENTET_INNTEKT */                00001390
 %INCLUDE R0019913;   /* F_SNU_DATO            */                       00001400
 END R001460;                                                           00001410
