 /*       SIST ENDRET 16/10-86 14.57.07 AV   LUNDEBY                  */00000000
 /*       SIST ENDRET 04/07-85 08.41.18 AV   LUNDEBY                  */00000010
 /*       SIST ENDRET 30/10-84 11.44.01 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 05/03-84 14.57.03 AV   FARVIK                   */00000030
 /*       SIST ENDRET 01/03-84 08.33.25 AV   FARVIK                   */00000040
  /* **************************************************************** */00000050
  /* IDENTIFIKASJON:  R0017101                                        */00000060
  /* PROGRAMMERER:    HELEN ,  JULI 1982.                             */00000070
  /* HENSIKT:                                                         */00000080
  /*        NÅR ALLE TRANSAKSJONER ER BEHANDLET  OG ALLE              */00000090
  /*        HENDELSENE SKREVET UT PÅ SB_BASEN, MÅ ROTEN OPPDATERES    */00000100
  /*        MED INFORMASJON SOM ER MIDLERTIDIG OPPBEVART I FNR_TABELL.*/00000110
  /*        ALLE PERSONER SOM SKAL FÅ ST-BREV HAR FNR I FNR-TABELLEN  */00000120
  /*        OG MÅ OPPDATERES.INFORMASJONEN I ROTEN BRUKES I UTSKRIFTS-*/00000130
  /*        RUTINEN.                                                  */00000140
  /* PROGRAM TILKNYTNING:                                             */00000150
  /*        PROGRAMMET KALLES OPP I BEHANDLE_TRANS.                   */00000160
  /*                                                                  */00000170
  /* ENDRET: 15.10.86 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S           */00000180
  /*                     LA INN TILORDNING FOR UIB-PEKER.             */00000190
  /*                     RYDDET OG REDIGERTE OM PROGRAMMET.           */00000200
  /*                                                                  */00000210
  /* **************************************************************** */00000220
  R001710:                                                              00000230
        PROC(COMMAREA_PEKER) OPTIONS (MAIN);                            00000240
                                                                        00000250
  %INCLUDE  P0019912;                                                   00000260
                                                                        00000270
  DCL 01 B02 BASED (B02_PEKER),                                         00000280
  %INCLUDE  P0019921;                                                   00000290
                                                                        00000300
  DCL COMMAREA_PEKER          POINTER;                                  00000310
                                                                        00000320
  % INCLUDE  P0019906;   /*TRANS_OPPL_OMR   */                          00000330
                                                                        00000340
  % INCLUDE  P0019908;   /*KOMM_OMR   */                                00000350
                                                                        00000360
  % INCLUDE  P0019014;   /*   FNR_TABELL R0017001/R0017101            */00000370
                                                                        00000380
  % INCLUDE  P0019001;   /*   W_ROT, W_HENDELSE, W_BEREGNVEDL         */00000390
                                                                        00000400
  % INCLUDE  DLIUIB;                                                    00000410
                                                                        00000420
  DCL  PLITDLI         ENTRY;                                           00000430
                                                                        00000440
  DCL  UIB_RC_OK       BIT(8)  INIT('00000000'B);                       00000450
                                                                        00000460
  DCL  I               FIXED BIN(15);                                   00000470
                                                                        00000480
  /* **************************************************************** */00000490
  /*     INNEBYGDE PLI-FUNKSJONER                                     */00000500
  /* **************************************************************** */00000510
                                                                        00000520
     DCL                                                                00000530
       ( ADDR , LOW , CSTG , DATE , TIME ) BUILTIN;                     00000540
                                                                        00000550
                                                                        00000560
  /* **************************************************************** */00000570
  /*     DATO-HÅNDTERING                                              */00000580
  /* **************************************************************** */00000590
                                                                        00000600
   DCL 1  DATO,                                                         00000610
          2  AAR                           CHAR (2),                    00000620
          2  MND                           CHAR (2),                    00000630
          2  DAG                           CHAR (2);                    00000640
   DCL DATO_D        DEFINED   DATO        CHAR (6);                    00000650
                                                                        00000660
   DCL 1  W_D_DATO_ÅMD                     PIC '999999';                00000670
                                                                        00000680
   DCL 1  W_D_DATO_ÅM DEF W_D_DATO_ÅMD     PIC '9999';                  00000690
                                                                        00000700
   DCL W_VIRK_DATO                         PIC  '9999',                 00000710
       W_VIRK_DATO_CH  DEF W_VIRK_DATO     CHAR (4);                    00000720
                                                                        00000730
  /* **************************************************************** */00000740
  /*     TIDS-HÅNDTERING                                              */00000750
  /* **************************************************************** */00000760
                                                                        00000770
   DCL 1  TID,                                                          00000780
          2  TID1                          CHAR (6), /* TT,MM,.SEK    */00000790
          2  TID2                          CHAR (3); /* MILL.SEK.     */00000800
  DCL TID_D          DEFINED   TID         CHAR (9);                    00000810
                                                                        00000820
  DCL TID1_PIC                             PIC '999999' INIT (0);       00000830
                                                                        00000840
                                                                        00000850
  /* **************************************************************** */00000860
  /*     DLI CALL-PARAMETRE                                           */00000870
  /* **************************************************************** */00000880
                                                                        00000890
     DCL      GU                 CHAR     (4)   STATIC INIT('GU  '),    00000900
              GN                 CHAR     (4)   STATIC INIT('GN  '),    00000910
              GHU                CHAR     (4)   STATIC INIT('GHU '),    00000920
              GHNP               CHAR     (4)   STATIC INIT('GHNP'),    00000930
              REPL               CHAR     (4)   STATIC INIT('REPL'),    00000940
              ISRT               CHAR     (4)   STATIC INIT('ISRT'),    00000950
              DLET               CHAR     (4)   STATIC INIT('DLET'),    00000960
              PARM_CT_3          FIXED BIN(31)  STATIC INIT(3),         00000970
              PARM_CT_4          FIXED BIN(31)  STATIC INIT(4),         00000980
              PARM_CT_5          FIXED BIN(31)  STATIC INIT(5);         00000990
                                                                        00001000
  /* **************************************************************** */00001010
  /*     DL1 SSA-OMRÅDER FOR  ROT OG STATUS-SEGMENTER.                */00001020
  /* **************************************************************** */00001030
                                                                        00001040
     DCL 1  SSA1_SB0PERSN          STATIC,                              00001050
            2    HDEL                            CHAR (17)  INIT        00001060
                 ('SB0PERSN(FNR     '),                                 00001070
            2    REL_OP                          CHAR (2)   INIT (' ='),00001080
            2    PKEY               FIXED        DEC  (11)  INIT ( 0 ), 00001090
            2    HP                              CHAR (1)   INIT (')'); 00001100
                                                                        00001110
  %INCLUDE  P0012002;                                                   00001120
                                                                        00001130
      DCL 1  PCB_SB1         BASED        (SB1_PCB_PEKER),              00001140
         %INCLUDE  P0012003;                                            00001150
                                                                        00001160
                                                                        00001170
                                                                        00001180
  /* *************************************************************** */ 00001190
  /*                                                                 */ 00001200
  /*   PROGRAMMET BEGYNNER HER.                                      */ 00001210
  /*                                                                 */ 00001220
  /* *************************************************************** */ 00001230
                                                                        00001240
                                                                        00001250
  PROGRAM_ID   =  'R0017101';                                           00001260
  UIBPTR       =  UIB_PEKER;                                            00001270
  DATO_D       =  DATE;                                                 00001280
  TID_D        =  TIME;                                                 00001290
  TID1_PIC     =  TID1;                                                 00001300
                                                                        00001310
                                                                        00001320
  DO I = 1 TO 14 WHILE (FNR_TABELL.FNR(I) > 0);                         00001330
                                                                        00001340
    SSA1_SB0PERSN.PKEY = FNR_TABELL.FNR(I);                             00001350
    TID1_PIC           = TID1_PIC + 1;                                  00001360
                                                                        00001370
    CALL PLITDLI         (PARM_CT_4,                                    00001380
                          GHU,                                          00001390
                          PCB_SB1,                                      00001400
                          W_ROT,                                        00001410
                          SSA1_SB0PERSN);                               00001420
                                                                        00001430
    /*------------------------------------------------------------*/    00001440
    /* SJEKKER RETURKODE FRA DL1 OG UIB                           */    00001450
    /*------------------------------------------------------------*/    00001460
                                                                        00001470
    IF PCB_SB1.STATUS_KODE  ^= '  '          !                          00001480
       DLIUIB.UIBFCTR       ^= UIB_RC_OK     THEN                       00001490
       DO;                                                              00001500
 L140:                                                                  00001510
          FEIL_MELD_NR       = 500;                                     00001520
          FEIL_VED_LABEL     = 'L140';                                  00001530
          DB_STATUS_KODE     = PCB_SB1.STATUS_KODE;                     00001540
          GO TO L999;                                                   00001550
       END;                                                             00001560
    ELSE                                                                00001570
       DO;                                                              00001580
          W_ROT.NESTE_SB_VERSJON_NR = W_ROT.NESTE_SB_VERSJON_NR + 1;    00001590
          W_ROT.SISTE_TERMINAL_NR   = EIBTRMID;                         00001600
          SISTE_REG_TIDSPUNKT       = TID1_PIC!!DATO_D;                 00001610
                                                                        00001620
          CALL         PLITDLI        (PARM_CT_3,                       00001630
                                       REPL,                            00001640
                                       PCB_SB1,                         00001650
                                       W_ROT);                          00001660
       END;                                                             00001670
                                                                        00001680
       IF PCB_SB1.STATUS_KODE      ^= '  '         !                    00001690
          DLIUIB.UIBFCTR           ^= UIB_RC_OK    THEN                 00001700
          DO;                                                           00001710
 L150:                                                                  00001720
             FEIL_MELD_NR           = 500;                              00001730
             FEIL_VED_LABEL         = 'L150';                           00001740
             DB_STATUS_KODE         = PCB_SB1.STATUS_KODE;              00001750
             GO TO L999;                                                00001760
         END;                                                           00001770
 END;                                                                   00001780
                                                                        00001790
 L999:                                                                  00001800
  EXEC CICS RETURN;                                                     00001810
                                                                        00001820
 END R001710;                                                           00001830
