 /*       SIST ENDRET 06/09-94 11.18.45 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 28/07-94 13.21.57 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 25/02-94 13.07.55 AV   HERMAN                   */00000020
 /*       SIST ENDRET 21/01-91 14.15.28 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 12/05-87 09.16.25 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 10/01-85 09.27.26 AV   OLAV                     */00000050
 /*       SIST ENDRET 13/11-84 15.37.29 AV   FARVIK                   */00000060
 /*       SIST ENDRET 05/10-84 14.00.50 AV   FARVIK                   */00000070
 /*       SIST ENDRET 17/09-84 09.30.15 AV   FARVIK                   */00000080
 /*       SIST ENDRET 11/09-84 11.00.36 AV   FARVIK                   */00000090
 /* ***************************************************************** */00000100
 /*FEILENDRINGER:                                                     */00000110
 /* *******************                                               */00000120
 /*                                                                   */00000130
 /*  10.01.85               OLAV                                      */00000140
 /*          LAGT INN AT FEILMELINGSNR. PÅ BLANKETTEN BLANKES         */00000150
 /*          FØR BLANKETTEN LEGGES På VENTETRANS BASEN.               */00000160
 /*                                                                   */00000170
 /* ***************************************************************** */00000180
 R00112:                                                                00000190
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000200
 %PAGE;                                                                 00000210
 %INCLUDE S00112;    /*  FT-MAPSETTET   */                              00000220
 %PAGE;                                                                 00000230
 %INCLUDE P0011201;  /*  TRANSOMR FOR FORSØRGINGSTILL.EKTEF/BARN */     00000240
 %PAGE;                                                                 00000250
 %INCLUDE P0019906;  /*  TRANS-OPPL-OMRÅDE (BASED)      */              00000260
 %PAGE;                                                                 00000270
 %INCLUDE P0019908;  /*  KOM-OMRÅDE (BASED)             */              00000280
 %PAGE;                                                                 00000290
 %INCLUDE P0019910;  /*  STYRINGS-OMRÅDE (BASED)        */              00000300
 %PAGE;                                                                 00000310
 %INCLUDE P0019912;  /*  DIV-PARAM-OMRÅDE (BASED)       */              00000320
 %PAGE;                                                                 00000330
 %INCLUDE DFHBMSCA;                                                     00000340
 %PAGE;                                                                 00000350
   DCL                                                                  00000360
      (BMSMAPBR,COMMAREA_PEKER) PTR;                                    00000370
   DCL                                                                  00000380
      (ADDR,UNSPEC,CSTG,ONCODE,VERIFY,SUBSTR) BUILTIN;                  00000390
   DCL                                                                  00000400
      FEIL_FUNNET  BIT (1),                                             00000410
      ONKODE PIC'9999',                                                 00000420
      CURSOR_POS FIXED BIN(15) INIT(-1),                                00000430
      ONK DEF ONKODE CHAR(4),                                           00000440
      FEILKODE       CHAR(4),                                           00000450
      DSNAVN         CHAR(8),                                           00000460
      ANT_FEIL_SKREVET FIXED DEC (3);                                   00000470
 %SKIP(1);                                                              00000480
 %PAGE;                                                                 00000490
      ON ERROR SNAP BEGIN       ;                                       00000500
         ON ERROR SYSTEM        ;                                       00000510
         ONKODE=ONCODE          ;                                       00000520
         FEILKODE = ONK         ;                                       00000530
         DSNAVN   = EIBDS       ;                                       00000540
         GO TO FEILBEH          ;                                       00000550
      END;                                                              00000560
                                                                        00000570
 FEILKODE   = 'FEIL'    ;                                               00000580
 DSNAVN     = '        ';                                               00000590
                                                                        00000600
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00000610
                                                                        00000620
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00000630
                                                                        00000640
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000650
                                                                        00000660
 IF FRA_CICS THEN                                                       00000670
  DO;                                                                   00000680
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);00000690
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);     00000700
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);  00000710
  END;                                                                  00000720
                                                                        00000730
 IF HENT_FRAM_MAP  THEN                                                 00000740
   DO;                                                                  00000750
     EXEC CICS SEND MAP('S001121') MAPSET('S001123') MAPONLY            00000760
                                                   SET (BMSMAPBR);      00000770
     ALLOCATE S001121O;                                                 00000780
     S001121O.CICS_INFOO= CICS_NAVN;                                    00000790
   END;                                                                 00000800
                                                                        00000810
 RECEIVE_MAP:                                                           00000820
                                                                        00000830
                                                                        00000840
 IF ^HENT_FRAM_MAP THEN                                                 00000850
    DO;                                                                 00000860
       EXEC CICS RECEIVE MAP('S001121')                                 00000870
                                    MAPSET('S001123') SET(BMSMAPBR);    00000880
       CALL BLANK_FT_MELDNR;                                            00000890
       FEIL_MELD_NR = 0;                                                00000900
    END;                                                                00000910
 IF FUNKSJONSKODEL > 0 THEN                                             00000920
    DO;                                                                 00000930
       FUNKSJONSKODE = FUNKSJONSKODEI;                                  00000940
       EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);            00000950
    END;                                                                00000960
                                                                        00000970
 IF STYRE_KODEL > 0 THEN                                                00000980
    DO;                                                                 00000990
       STYREKODE = STYRE_KODEI;                                         00001000
       TRANSKODE = 'R041';                                              00001010
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00001020
    END;                                                                00001030
                                                                        00001040
                                                                        00001050
 IF STYREKODE ^= 'FT'  &  FRA_CICS THEN                                 00001060
    TRANSKODE = 'R041';                                                 00001070
                                                                        00001080
 ELSE                                                                   00001090
  DO;                                                                   00001100
   TRANS_RETURKODE = TRANSKODE;                                         00001110
   ANT_FEIL_SKREVET = 0;                                                00001120
   FEIL_FUNNET = '0'B;                                                  00001130
                                                                        00001140
   SELECT (TRANSKODE);                                                  00001150
    WHEN('R120')                                                        00001160
       DO;                                                              00001170
          CALL BLANK_FT_SØKER;                                          00001180
          CALL BLANK_FT_MELDNR;                                         00001190
          CALL BLANK_FT_BARN;                                           00001200
          CALL OVERFØR_FT_SØKER;                                        00001210
          CALL KONTROLL_FT_SØKER(FEIL_FUNNET);                          00001220
       END;                                                             00001230
    WHEN('R121')                                                        00001240
       DO;                                                              00001250
         CALL BLANK_FT_MELDNR;                                          00001260
         IF FUNKSJONSKODE ^= 'V' THEN                                   00001270
            CALL BLANK_FT_BARN;                                         00001280
         CALL OVERFØR_FT_SØKER;                                         00001290
         CALL KONTROLL_FT_SØKER(FEIL_FUNNET);                           00001300
       END;                                                             00001310
    WHEN('R122')                                                        00001320
       DO;                                                              00001330
          CALL BLANK_FT_MELDNR;                                         00001340
          CALL OVERFØR_FT_SØKER;                                        00001350
          CALL OVERFØR_FT_BARN;                                         00001360
          CALL KONTROLL_FT_SØKER(FEIL_FUNNET);                          00001370
          IF F_FELT_PIC_CHAR2(FTS.BT_ANT) = '00' THEN                   00001380
             CALL BLANK_FT_BARN;                                        00001390
          ELSE                                                          00001400
             CALL KONTROLL_FT_BARN(FEIL_FUNNET);                        00001410
       END;                                                             00001420
    OTHERWISE;                                                          00001430
       /* INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER */00001440
   END;  /*   SELECT   */                                               00001450
                                                                        00001460
    IF F_FELT_PIC_CHAR2(FTS.BT_ANT) ^= '00' & ^FEIL_FUNNET THEN         00001470
       TRANSKODE = 'R122';                                              00001480
    IF TRANSKODE = 'R122' & F_FELT_PIC_CHAR2(FTS.BT_ANT) = '00' THEN    00001490
       TRANSKODE = 'R121';                                              00001500
                                                                        00001510
                                                                        00001520
 IF FEIL_FUNNET ! HENT_FRAM_MAP ! FRA_UTEN_DIALOG !                     00001530
    TRANS_RETURKODE ^= TRANSKODE THEN                                   00001540
    DO;                                                                 00001550
       IF TRANSKODE = 'R120' THEN                                       00001560
          TRANSKODE = 'R121';                                           00001570
       CALL BLANK_FT_MAP;                                               00001580
       CALL OVERFØR_FT_SØKER_MAP;                                       00001590
       SELECT (TRANSKODE);                                              00001600
          WHEN ('R121')                                                 00001610
             DO;                                                        00001620
                CALL FJERN_TEKST_BARN;                                  00001630
                CALL BLOKKERE_BARN;                                     00001640
             END;                                                       00001650
          WHEN ('R122')                                                 00001660
             DO;                                                        00001670
                CALL TEKST_BARN;                                        00001680
                CALL OVERFØR_FT_BARN_MAP;                               00001690
             END;                                                       00001700
          OTHERWISE;                                                    00001710
       END;                                                             00001720
                                                                        00001730
      IF HENT_FRAM_MAP THEN                                             00001740
        EXEC CICS SEND MAP('S001121') MAPSET('S001123') ERASE CURSOR;   00001750
      ELSE                                                              00001760
        EXEC CICS SEND MAP('S001121') MAPSET('S001123') ERASEAUP        00001770
                                                     DATAONLY CURSOR;   00001780
      HENT_FRAM_MAP = '0'B;                                             00001790
      FEIL_MELD_NR  = 666;                                              00001800
                                                                        00001810
      IF  FRA_CICS THEN                                                 00001820
        EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);          00001830
      ELSE                                                              00001840
        GOTO RECEIVE_MAP;                                               00001850
    END;                                                                00001860
                                                                        00001870
   ELSE                                                                 00001880
                                                                        00001890
    DO;                                                                 00001900
                                                                        00001910
      IF TRANSKODE = 'R120' THEN                                        00001920
        TRANS_RETURKODE = 'R121';                                       00001930
      ELSE                                                              00001940
        TRANS_RETURKODE = TRANSKODE;                                    00001950
      IF  FRA_CICS  THEN                                                00001960
        DO;                                                             00001970
          BLANKETTYPE = STYREKODE;                                      00001980
          TRANSKODE = 'R042';                                           00001990
        END;                                                            00002000
    END;                                                                00002010
  END;                                                                  00002020
                                                                        00002030
  CALL UTGANG;                                                          00002040
                                                                        00002050
  UTGANG: PROC;                                                         00002060
    IF  FRA_CICS THEN                                                   00002070
      EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);             00002080
    ELSE                                                                00002090
      EXEC CICS RETURN;                                                 00002100
  END UTGANG;                                                           00002110
                                                                        00002120
  FEILBEH:                                                              00002130
                                                                        00002140
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00002150
                                                                        00002160
     PROGRAM_ID = 'R0011201';                                           00002170
                                                                        00002180
     S001121O.MELDING2O =                                               00002190
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00002200
                                                                        00002210
     S001121O.MELDING3O =                                               00002220
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00002230
                                                                        00002240
     S001121O.MELDING4O =                                               00002250
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00002260
                                         !! '. DATASETT : ' !! DSNAVN;  00002270
                                                                        00002280
     S001121O.MELDING5O =                                               00002290
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00002300
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00002310
                                                                        00002320
     S001121O.MELDING6O =                                               00002330
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00002340
                                                                        00002350
                                                                        00002360
     EXEC CICS SEND MAP('S001121')                                      00002370
                                                 MAPSET('S001123');     00002380
                                                                        00002390
     EXEC CICS RECEIVE MAP('S001121')                                   00002400
                                    MAPSET('S001123') SET(BMSMAPBR);    00002410
                                                                        00002420
                                                                        00002430
     EXEC CICS SYNCPOINT ROLLBACK;                                      00002440
                                                                        00002450
                                                                        00002460
     TERMINERINGS_IND = 'F';                                            00002470
                                                                        00002480
     TRANSKODE  = 'R041';                                               00002490
                                                                        00002500
     CALL UTGANG;                                                       00002510
                                                                        00002520
  ABEND:                                                                00002530
     EXEC CICS ABEND ABCODE(FEIL);                                      00002540
                                                                        00002550
  PF1:                                                                  00002560
                                                                        00002570
 /* LEGGER UNDERKJENT TRANS UT PÅ VENTEDATABASE HVIS GYLDIG     */      00002580
 /* FNR OG VIRKNINGSDATO,ELLERS FORKASTES TRANSAKSJONEN.        */      00002590
                                                                        00002600
     IF ^(FTS.FNRNR = 1          !                                      00002610
          FTS.FNRNR = 200        !                                      00002620
          FTS.VIRK_DATO_MÅNR = 9 !                                      00002630
          FTS.VIRK_DATO_MÅNR = 200) THEN                                00002640
        DO;                                                             00002650
                                                                        00002660
           IF FØDSNUMMER    = 0   THEN                                  00002670
                                                                        00002680
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER FORKASTET.           */      00002690
                                                                        00002700
              DO;                                                       00002710
                 FEIL_MELD_NR  = 0;                                     00002720
                 S001121O.MELDING6O =                                   00002730
                         'REGISTERINGEN ER IKKE AVSLUTTET MED "ENTER"'!!00002740
                         '.TRANSAKSJONEN ER FORKASTET.';                00002750
                                                                        00002760
              END;                                                      00002770
           ELSE                                                         00002780
              DO;                                                       00002790
                                                                        00002800
                 SEARCH_FNR  = TRANS_OPPL_OMR.FØDSNUMMER;               00002810
                 IF FRA_CICS THEN                                       00002820
                    BLANKETTYPE = STYREKODE;                            00002830
                                                                        00002840
                                                                        00002850
                 IF FEIL_MELD_NR = 666 &      /*BLANKETTKONTROLLFEIL*/  00002860
                    ^FRA_MED_DIALOG     THEN  /*IKKE BASEKONTROLLFEIL*/ 00002870
                    FUNKSJONSKODE = 'B';                                00002880
                                                                        00002890
                 IF F_FELT_PIC_CHAR2(FTS.BT_ANT) ^= '00'  THEN          00002900
                    DO;                                                 00002910
                       CALL BLANK_FT_MELDNR;                            00002920
                       CALL OVERFØR_FT_BARN_MAP;                        00002930
                    END;                                                00002940
                                                                        00002950
                 FEIL_MELD_NR  = 0;                                     00002960
                                                                        00002970
                 EXEC CICS LINK PROGRAM('R0010490') COMMAREA(KOM_OMR);  00002980
                                                                        00002990
                 IF FEIL_MELD_NR > 0 THEN                               00003000
                    DO;                                                 00003010
                       DSNAVN   = 'R0010490';                           00003020
                       FEILKODE = DB_STATUS_KODE;                       00003030
                       GO TO FEILBEH;                                   00003040
                    END;                                                00003050
                                                                        00003060
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER LAGT UT PÅ VENTEBASE.*/      00003070
                                                                        00003080
                                                                        00003090
                 S001121O.MELDING6O =                                   00003100
                         'TRANSAKSJONEN ER LAGT UT PÅ VENTEREGISTER.';  00003110
              END;                                                      00003120
                                                                        00003130
                                                                        00003140
           EXEC CICS SEND MAP('S001121') MAPSET('S001123')              00003150
                                                           DATAONLY;    00003160
     /* DUMMY SEND-KALL.                              */                00003170
                                                                        00003180
           EXEC CICS SEND MAP('S001121')                                00003190
                                                  MAPSET('S001123');    00003200
           EXEC CICS DELAY INTERVAL(005);                               00003210
                                                                        00003220
           TERMINERINGS_IND = 'F';                                      00003230
                                                                        00003240
           TRANSKODE  = 'R041';                                         00003250
                                                                        00003260
           CALL UTGANG;                                                 00003270
                                                                        00003280
        END;                                                            00003290
     ELSE                                                               00003300
        DO;                                                             00003310
           TERMINERINGS_IND = 'F';                                      00003320
                                                                        00003330
           TRANSKODE = 'R041';                                          00003340
                                                                        00003350
           S001121O.MELDING6O =                                         00003360
                                                                        00003370
   'NB** TRANSAKSJONEN ER FORKASTET P.G.A. UGYLDIG FNR EL. VDATO **NB'; 00003380
                                                                        00003390
           EXEC CICS SEND MAP('S001121') MAPSET('S001123')              00003400
                                                           DATAONLY;    00003410
     /* DUMMY SEND-KALL.                            */                  00003420
                                                                        00003430
           EXEC CICS SEND MAP('S001121')                                00003440
                                    MAPSET('S001123');                  00003450
                                                                        00003460
           EXEC CICS DELAY INTERVAL(005);                               00003470
           CALL UTGANG;                                                 00003480
        END;                                                            00003490
                                                                        00003500
                                                                        00003510
  PF2:                                                                  00003520
     TERMINERINGS_IND   = 'F';                                          00003530
                                                                        00003540
     S001121O.MELDING6O =                                               00003550
      'NBNBNBNBNB***    TRANSAKSJONEN ER FORKASTET.    ***NBNBNBNBNB';  00003560
                                                                        00003570
     EXEC CICS SEND MAP('S001121') MAPSET('S001123')                    00003580
                                                      DATAONLY ;        00003590
     /* DUMMY SEND-KALL.                                     */         00003600
                                                                        00003610
     EXEC CICS SEND MAP('S001121')                                      00003620
                                    MAPSET('S001123');                  00003630
     EXEC CICS DELAY INTERVAL(005);                                     00003640
                                                                        00003650
                                                                        00003660
     TRANSKODE = 'R041';                                                00003670
                                                                        00003680
     CALL UTGANG;                                                       00003690
 %PAGE;                                                                 00003700
      %INCLUDE R0011202;               /* BLANK  ARBEIDSOMRÅDE */       00003710
 %PAGE;                                                                 00003720
      %INCLUDE R0011203;               /* KONTROLL AV SØKERDELEN */     00003730
 %PAGE;                                                                 00003740
      %INCLUDE R0011204;               /* KONTROLL AV BARNEDATA */      00003750
 %PAGE;                                                                 00003760
      %INCLUDE R0011206;               /* ARBEIDSOMRÅDE -> MAP */       00003770
 %PAGE;                                                                 00003780
      %INCLUDE R0011207;               /* FORTEKTSTER OG ATTRIBUTTER    00003790
                                       BARN OG SPES.DEL */              00003800
 %PAGE;                                                                 00003810
      %INCLUDE R0011209;               /* MAP -> ARBEIDSOMRÅDE */       00003820
 %PAGE;                                                                 00003830
      %INCLUDE R0011210;               /* FLYTTING AV BARNEDATA */      00003840
 %PAGE;                                                                 00003850
      %INCLUDE R0010508;               /* BEREGN TT AF */               00003860
 %PAGE;                                                                 00003870
      %INCLUDE R0010608;               /* BEREGN TT UF */               00003880
 %PAGE;                                                                 00003890
      %INCLUDE R0019901;               /*  TESTER OM DATO ER GYLDIG */  00003900
 %PAGE;                                                                 00003910
      %INCLUDE R0019902;               /*  FINNE KJØNN     */           00003920
 %PAGE;                                                                 00003930
      %INCLUDE R0019903;               /* EKTEFELLES ALDER GYLDIG */    00003940
 %PAGE;                                                                 00003950
      %INCLUDE R0019904;               /* FØDSELSNUMMERKONTROLL */      00003960
 %PAGE;                                                                 00003970
      %INCLUDE R0019905;               /* BEREGNER ALDER */             00003980
 %PAGE;                                                                 00003990
      %INCLUDE R0019908;               /* DAGENS DATO PLUSS 1 */        00004000
 %PAGE;                                                                 00004010
      %INCLUDE R0019909;               /* KONTROLL TRYGDETID */         00004020
 %PAGE;                                                                 00004030
      %INCLUDE R0019910;               /* NUMERISK KONTROLL */          00004040
 %PAGE;                                                                 00004050
      %INCLUDE R0019911;               /*  DATO KONTROLL  */            00004060
 %PAGE;                                                                 00004070
      %INCLUDE R0019912;  /* KONVERTERING CHAR ==> PIC / PIC ==> CHAR */00004080
 %PAGE;                                                                 00004090
      %INCLUDE R0019913;               /* F_SNU_DATO     */             00004100
 %PAGE;                                                                 00004110
      %INCLUDE R0019944;               /* SKRIV_FEIL      */            00004120
      %INCLUDE R0019959;               /* F_2MDR          */            00004130
                                                                        00004140
   END R00112;                                                          00004150
