 /*       SIST ENDRET 19/09-97 10.50.03 AV   JDA7339                  */00000000
 /*       SIST ENDRET 19/09-97 10.26.44 AV   JDA7339                  */00000010
 /*       SIST ENDRET 28/09-94 12.19.26 AV   JDA0310                  */00000020
 /*       SIST ENDRET 06/07-94 07.59.01 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 02/09-93 14.47.43 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 06/05-93 10.24.56 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 22/02-93 13.22.14 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 15/12-92 13.51.28 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 18/09-92 12.22.04 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 09/09-92 13.50.14 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 05/06-92 12.13.08 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 15/04-92 12.28.02 AV   TRUDE                    */00000110
 /*       SIST ENDRET 19/03-92 11.08.24 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 21/02-92 12.55.47 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 13/02-92 08.58.08 AV   TRUDE                    */00000140
 /*       SIST ENDRET 10/01-92 14.34.41 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 03/01-92 14.14.19 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 13/12-91 12.21.52 AV   DYBVIK                   */00000170
 /* ***************************************************************** */00000180
 /*IDENTIFIKASJON:                                                    */00000190
 /*    R0014139 - PROSEDYRE I PLI.                                    */00000200
 /*    PROGRAMMERER: TRUDE SEP 91 VARIASJON AV R0014324               */00000210
 /*HENSIKT:                                                           */00000220
 /*    RUTINEN OPPDATERER TP_NETTO,GP_NETTO,SÆRTILLEGG OG KOMPTILLEGG */00000230
 /*    HERETTER ER ALDERSP.GP/TP/ST BRUTTO BELØPENE                   */00000240
 /*    HERETTER ER ALDERSP.AP_GP_NETTO /-TP-/-ST- NETTO -BELØPENE     */00000250
 /*PROGRAMTILKNYTNING:                                                */00000260
 /*    PROGRAMMET BLIR INKLUDERT I R001                               */00000270
 /*BRUK:                                                              */00000280
 /*    CALL JUSTER_MED_FORVENTET_INNTEKT_AP_EP;                       */00000290
 /* ***************************************************************** */00000300
                                                                        00000310
 JUSTER_MED_FORVENTET_INNTEKT_AP: PROC(W_KT);                           00000320
                                                                        00000330
    DCL                                                                 00000340
       W_KT          DEC FIXED(3);                                      00000350
    DCL                                                                 00000360
       I             FIXED BIN(15),                                     00000370
       EP_SUM_YTELSE DEC FIXED(7) INIT (0),                             00000380
       FRADRAG_F     DEC FIXED(7) INIT (0),                             00000390
       G_HALVE       DEC FIXED(7) INIT (0),                             00000400
       HJ_AP         DEC FIXED(7) INIT (0),                             00000410
       REST_FRADRAG  DEC FIXED(5)  INIT (0),                            00000420
       TREDEC        DEC FIXED(3) INIT (0),                             00000430
       W_BRUTTO_AP   DEC FIXED(7) INIT (0),                             00000440
       W_BRUTTO_GP   DEC FIXED(5) INIT (0),                             00000450
       W_BRUTTO_TP   DEC FIXED(5) INIT (0),                             00000460
       W_BRUTTO_TP_EP DEC FIXED(7) INIT (0),                            00000470
       W_BRUTTO_ST   DEC FIXED(5) INIT (0),                             00000480
       W_BRUTTO_GT   DEC FIXED(7) INIT (0),                             00000490
       W_SUM_TP      DEC FIXED(7) INIT (0),                             00000500
       W_YP_AP       DEC FIXED(7) INIT (0),                             00000510
       W_YP          DEC FIXED(7) INIT (0),                             00000520
       W_NETTO_AP    DEC FIXED(7) INIT (0),                             00000530
       W_FULL_KT     DEC FIXED(5,2) INIT (0),                           00000540
       W_TEI         DEC FIXED(7)  INIT (0),                            00000550
       W_TAI         DEC FIXED(7)  INIT (0),                            00000560
       W_BRP         DEC FIXED(7,2) INIT (0),                           00000570
       W_TAK         DEC FIXED(7)  INIT (0),                            00000580
       W_APD_ANVENDT DEC FIXED(3)  INIT (0),                            00000590
       W_KT_FRADRAG  DEC FIXED(3)  INIT (0),                            00000600
       W_ST_FRADRAG  DEC FIXED(5)  INIT (0),                            00000610
       W_GP_FRADRAG  DEC FIXED(5)  INIT (0),                            00000620
       W_ALDER_ÅM    PIC '9999',                                        00000630
       W_ETTER92     DEC FIXED(7)  INIT (0);                            00000640
                                                                        00000650
    DCL KODE         CHAR (1) INIT (' ');                               00000660
    DCL HJ_FAI       FIXED DEC (7);                                     00000670
                                                                        00000680
    DCL ROUND        BUILTIN;                                           00000690
                                                                        00000700
                                                                        00000710
   DIV_PARAM_OMR.AP_KODE_AEY(BER_SØ_IND)  =  'A';     /**TS*/           00000720
   W_ALDER_ÅM   = F_ALDER(W_FNR,TRANS_OPPL_OMR.VIRKNINGSDATO);          00000730
                                                                        00000740
   IF W_ALDER_ÅM  > 7000  THEN                                          00000750
     DO;                                                                00000760
       B02.ALDERSP.FAI(BER_SØ_IND)        = 0;                          00000770
       B02.ETTEPENS.FORVENTET(BER_SØ_IND)  = 0;                         00000780
     END;                                                               00000790
                                                                        00000800
   /* VED ETTERLATT ER ALDERSP.TP ER ALEREDE OPPDATERT MED */           00000810
   /* EGEN YP . TRUDE 0492                                       */     00000820
                                                                        00000830
   IF B02.KONV_P_KODE(BER_SØ_IND)   = 'Y'  &                            00000840
      B02.PENSJONSTYPE2(BER_SØ_IND) ^=   'E'   THEN   /*TS0492*/        00000850
     DO;                                                                00000860
      B02.ALDERSP.APD(BER_SØ_IND)  = 100;                               00000870
      CALL BEREGN_AP_OVERGANG_FRA_YP;                                   00000880
     END;                                                               00000890
                                                                        00000900
                                                                        00000910
   /* GP OG TP BRUTTO ER UTREGNET TIDLIGERE   */                        00000920
                                                                        00000930
   DIV_PARAM_OMR.FULLT_SÆRTILLEGG(BER_SØ_IND) = 0;                      00000940
   W_BRUTTO_GP  = B02.ALDERSP.GP(BER_SØ_IND);                           00000950
   W_BRUTTO_TP  = B02.ALDERSP.TP(BER_SØ_IND);                           00000960
   W_BRUTTO_ST  = B02.ALDERSP.ST(BER_SØ_IND);                           00000970
   W_BRUTTO_TP_EP = B02.TP_BRUTTO(BER_SØ_IND);                          00000980
   W_ETTER92    = W_BRUTTO_TP + W_BRUTTO_ST + W_BRUTTO_TP_EP;           00000990
                                                                        00001000
   IF B02.GT_LOV92(BER_SØ_IND)  > W_ETTER92        THEN                 00001010
      W_BRUTTO_GT = B02.GT_LOV92(BER_SØ_IND) - W_ETTER92;               00001020
                                                                        00001030
   W_BRUTTO_AP       = W_BRUTTO_GP + W_BRUTTO_TP + W_BRUTTO_ST          00001040
                       + B02.TP_BRUTTO(BER_SØ_IND) + W_KT               00001050
                       + W_BRUTTO_GT;                                   00001060
                                                                        00001070
   W_SUM_TP          = W_BRUTTO_TP                                      00001080
                       + B02.TP_BRUTTO(BER_SØ_IND);                     00001090
                                                                        00001100
   DIV_PARAM_OMR.FULLT_SÆRTILLEGG(BER_SØ_IND) = W_BRUTTO_ST;            00001110
                                                                        00001120
   CALL TIDLIGERE_ARBEIDSINNTEKT(W_TAI,W_BRP);       /*R0014135 */      00001130
                                                                        00001140
   W_TEI      = W_TAI * 1000;                                           00001150
   AP_TEI     = W_TEI;                                                  00001160
                                                                        00001170
                                                                        00001180
   /*TIDLIGERE LAV ARBEIDSINNTEKT:  GJENNOMSNITT SKAL IKKE < 3 G */     00001190
   /*FORHØYES OPP TIL NÆRMESTE HELE TUSEN                        */     00001200
   /*AFP FOM 0197 SKAL IKKE DENNE REGEL GJELDE                   */     00001210
                                                                        00001220
    IF (B02.PENSJONSTYPE1(BER_SØ_IND)   = 'K' &                         00001230
        B02.UTTAKSDATO_ÅM(BER_SØ_IND)   > 9709 ) !                      00001240
       (B02.KONV_P_KODE  (BER_SØ_IND)   = 'K' &                         00001250
        B02.UTTAKSDATO_ÅM(BER_SØ_IND)   > 9709) THEN ;                  00001260
    ELSE                                                                00001270
     DO;                                                                00001280
          IF W_TEI < ( 3 * G ) THEN                                     00001290
            DO;                                                         00001300
             W_TEI = 3 * G + 999; /* ENDRET FRA 500 TIL 999, 5.7.94 TS*/00001310
             TREDEC = W_TEI / 1000;                                     00001320
             W_TEI = TREDEC * 1000;                                     00001330
             DIV_PARAM_OMR.TAI(BER_SØ_IND) = W_TEI; /*TRUDE 020993*/    00001340
            END;                                                        00001350
     END;                                                               00001360
                                                                        00001370
                                /* ER DET ETTERLATT MED F ?? */         00001380
  /*IF B01.FORVENTET(BER_SØ_IND)  > 0      &                            00001390
       B01.PENSJONSTYPE1(BER_SØ_IND) = 'E' &                            00001400
       B02.FAI(BER_SØ_IND)        = 0  THEN   */                        00001410
                                                                        00001420
   /* FAI FRA AP-BLANKETT BLE 0                               */        00001430
   /* TRUDE 180992                                            */        00001440
  /*IF B02.KONV_P_KODE(BER_SØ_IND)   = 'E'  THEN                        00001450
       B02.FAI(BER_SØ_IND) = B01.FORVENTET(BER_SØ_IND);    ????*/       00001460
   /* PRØVER SLIK 180992 :                                     */       00001470
                                                                        00001480
    IF B02.FAI(BER_SØ_IND) = 0    THEN                                  00001490
      IF B02.KONV_P_KODE(BER_SØ_IND)   = 'E'  THEN                      00001500
         B02.FAI(BER_SØ_IND) = B01.FORVENTET(BER_SØ_IND);               00001510
         /* HIT 180992 */                                               00001520
                                                                        00001530
    G_HALVE   = G / 2;                                                  00001540
    W_FULL_KT = W_KT;                                                   00001550
    HJ_FAI  = B02.FAI(BER_SØ_IND) * 100;                                00001560
                                                                        00001570
 IF HJ_FAI  > G THEN                                                    00001580
   DO;                                                                  00001590
    FRADRAG_F = (B02.FAI(BER_SØ_IND) * 100);                            00001600
    FRADRAG_F = FRADRAG_F - G;                                          00001610
                                                                        00001620
    IF FRADRAG_F > 0 THEN                                               00001630
       FRADRAG_F = ( FRADRAG_F * 0.5 ) / 12;                            00001640
                                                                        00001650
   IF FRADRAG_F > W_BRUTTO_AP THEN                                      00001660
       DO;                                                              00001670
        IF B02.KONV_P_KODE(BER_SØ_IND)  = 'E' !                         00001680
           B02.PENSJONSTYPE2(BER_SØ_IND)  = 'E' THEN GOTO L999;         00001690
                                                                        00001700
      /*   B02.ALDERSP.GP         (BER_SØ_IND)    = 0;  */              00001710
           B02.ALDERSP.AP_GP_NETTO(BER_SØ_IND)    = 0;                  00001720
     /*    B02.ALDERSP.TP         (BER_SØ_IND)    = 0;   */             00001730
           B02.ALDERSP.AP_TP_NETTO(BER_SØ_IND)    = 0;                  00001740
           B02.TP_NETTO           (BER_SØ_IND)    = 0;                  00001750
           B02.ALDERSP.ST         (BER_SØ_IND)    = 0;                  00001760
           B02.ALDERSP.KT         (BER_SØ_IND)    = 0;                  00001770
           W_KT                                   = 0;                  00001780
       END;                                                             00001790
                                                                        00001800
   ELSE                                                                 00001810
       DO;                                                              00001820
                                                                        00001830
 /* ***************************************************************** */00001840
 /* FRADRAGET ER MINDRE ENN GP + TP + ST                              */00001850
 /* ***************************************************************** */00001860
                                                                        00001870
          DIV_PARAM_OMR.AP_KODE_AEY(BER_SØ_IND)  =  'A';                00001880
                                                                        00001890
          W_NETTO_AP    = W_BRUTTO_AP - FRADRAG_F;                      00001900
                                                                        00001910
          /*-----------------------------------------------------*/     00001920
          /*SUMMEN AV PENSJON OG FREMTIDIG ARBEIDSINNTEKT KAN    */     00001930
          /*IKKE UTGJØRE MER ENN TIDLIGERER ARBEIDSINNTEKT.      */     00001940
          /*-----------------------------------------------------*/     00001950
                                                                        00001960
          W_TAK =   W_TEI -  (B02.FAI(BER_SØ_IND) * 100);               00001970
          IF W_TAK   > 0  THEN                                          00001980
             W_TAK   = W_TAK / 12;                                      00001990
                                                                        00002000
          IF W_TAK   > 0           &                                    00002010
             W_TAK   < W_NETTO_AP  THEN                                 00002020
            DO;                                                         00002030
             DIV_PARAM_OMR.AP_KODE_AEY(BER_SØ_IND)  =  'B';             00002040
             W_NETTO_AP   =  W_TAK;                                     00002050
             FRADRAG_F    = W_BRUTTO_AP - W_NETTO_AP;                   00002060
            END;                                                        00002070
          ELSE                                                          00002080
            IF W_TAK <=  0  THEN   /*TS0492*/                           00002090
              DO;                                                       00002100
               IF B02.KONV_P_KODE(BER_SØ_IND)  = 'E' THEN GOTO L999;    00002110
                                                                        00002120
          /*     B02.ALDERSP.GP (BER_SØ_IND)    = 0;       ***0492 TS*/ 00002130
                 B02.ALDERSP.AP_GP_NETTO(BER_SØ_IND)    = 0;  /*0492TS*/00002140
         /*      B02.ALDERSP.TP (BER_SØ_IND)    = 0;     **** 0492 TS*/ 00002150
                 B02.ALDERSP.AP_TP_NETTO(BER_SØ_IND)    = 0;  /*0492TS*/00002160
                 B02.TP_NETTO   (BER_SØ_IND)    = 0;                    00002170
                 B02.ALDERSP.ST (BER_SØ_IND)    = 0;                    00002180
                 B02.ALDERSP.KT (BER_SØ_IND)    = 0;                    00002190
                 GOTO L500;    /*ENDRET FRA L999 TIL L500 220293 TS */  00002200
              END;                                                      00002210
                                                                        00002220
          IF B02.KONV_P_KODE(BER_SØ_IND)   = 'Y'   THEN                 00002230
             W_YP = F_OVERGANG_FRA_YP(W_YP_AP);      /*R0014140 */      00002240
                                                                        00002250
                                   /* GARANTERT YRKEPENSJONSDELEN */    00002260
          IF W_YP > W_NETTO_AP   THEN                                   00002270
            DO;                                                         00002280
               W_NETTO_AP   =  W_YP;                                    00002290
               FRADRAG_F    =  W_BRUTTO_AP - (W_NETTO_AP + W_KT);       00002300
               DIV_PARAM_OMR.AP_KODE_AEY(BER_SØ_IND)   =  'Y';          00002310
               IF FRADRAG_F  <=  0 THEN              /*TS < 0  050593*/ 00002320
                              /*STM NEDENFOR LAGT INN 060593, TRUDE */  00002330
                  DO;                                                   00002340
        B02.AP_GP_NETTO(BER_SØ_IND)   = B02.ALDERSP.GP(BER_SØ_IND);     00002350
        B02.AP_TP_NETTO(BER_SØ_IND)   = B02.ALDERSP.TP(BER_SØ_IND);     00002360
        B02.TP_NETTO(BER_SØ_IND)      = B02.TP_BRUTTO (BER_SØ_IND);     00002370
        B02.ALDERSP.ST(BER_SØ_IND)    = B02.ALDERSP.ST(BER_SØ_IND);     00002380
        B02.ALDERSP.KT(BER_SØ_IND)    = W_KT;                           00002390
        GOTO L500;  /*TS  050593*/                                      00002400
                  END;   /*FRADRAG <= 0 */                              00002410
            END;                                                        00002420
                                                                        00002430
                                                                        00002440
          B02.AP_GP_NETTO(BER_SØ_IND) = ROUND(W_BRUTTO_GP *             00002450
                                      W_NETTO_AP / W_BRUTTO_AP , 0);    00002460
                                                                        00002470
          REST_FRADRAG = FRADRAG_F - W_BRUTTO_GP                        00002480
                                   + B02.AP_GP_NETTO(BER_SØ_IND);       00002490
          IF B02.TP_BRUTTO(BER_SØ_IND) > 0 THEN                         00002500
            DO;                                                         00002510
             DCL TRUDE_TP  FIXED DEC (5);                               00002520
               B02.TP_NETTO(BER_SØ_IND) =                               00002530
                                   ROUND(B02.TP_BRUTTO(BER_SØ_IND)      00002540
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);    00002550
               TRUDE_TP  = B02.TP_NETTO(BER_SØ_IND);                    00002560
               REST_FRADRAG =  REST_FRADRAG -                           00002570
                               B02.TP_BRUTTO(BER_SØ_IND) +              00002580
                               B02.TP_NETTO(BER_SØ_IND);                00002590
            END;                                                        00002600
                                                                        00002610
          IF W_BRUTTO_GT   > 0 THEN                                     00002620
            DO;                                                         00002630
             B02.GT_TILLEGG_LOV92(BER_SØ_IND)  =                        00002640
                              ROUND(W_BRUTTO_GT                         00002650
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);    00002660
              REST_FRADRAG =  REST_FRADRAG -                            00002670
                               W_BRUTTO_GT +                            00002680
                               B02.GT_TILLEGG_LOV92(BER_SØ_IND);        00002690
            END;                                                        00002700
          ELSE                                                          00002710
            DO;                                                         00002720
             B02.GT_TILLEGG_LOV92(BER_SØ_IND)  = 0;                     00002730
            END;                                                        00002740
                      /*ENDRET REKKEFØLGEN PÅ STM. PGA KT  */           00002750
          IF W_BRUTTO_TP > 0 THEN                                       00002760
            DO;                                                         00002770
              IF G > 35500    THEN                                      00002780
                DO;                                                     00002790
                 IF B02.ALDERSP.ST(BER_SØ_IND)  =  0 THEN               00002800
                    B02.AP_TP_NETTO(BER_SØ_IND) =                       00002810
                             B02.ALDERSP.TP(BER_SØ_IND) - REST_FRADRAG; 00002820
                 ELSE                                                   00002830
                  DO;                                                   00002840
                   B02.AP_TP_NETTO(BER_SØ_IND) = ROUND(W_BRUTTO_TP *    00002850
                                  W_NETTO_AP / W_BRUTTO_AP , 0);        00002860
                   REST_FRADRAG =  REST_FRADRAG -                       00002870
                                   W_BRUTTO_TP +                        00002880
                                   B02.AP_TP_NETTO(BER_SØ_IND);         00002890
                  END;                                                  00002900
                END;                                                    00002910
              ELSE                                                      00002920
                 DO;                                                    00002930
                   B02.AP_TP_NETTO(BER_SØ_IND) = ROUND(W_BRUTTO_TP *    00002940
                                  W_NETTO_AP / W_BRUTTO_AP , 0);        00002950
                   REST_FRADRAG =  REST_FRADRAG -                       00002960
                                   W_BRUTTO_TP +                        00002970
                                   B02.AP_TP_NETTO(BER_SØ_IND);         00002980
                 END;                                                   00002990
            END;                                                        00003000
                                                                        00003010
          IF B02.ALDERSP.ST(BER_SØ_IND)   > 0 THEN                      00003020
            DO;                                                         00003030
             IF W_KT  = 0 THEN                                          00003040
                 B02.ALDERSP.ST(BER_SØ_IND)  =                          00003050
                           B02.ALDERSP.ST(BER_SØ_IND) - REST_FRADRAG;   00003060
             ELSE                                                       00003070
                DO;                                                     00003080
                   B02.ALDERSP.ST(BER_SØ_IND) =                         00003090
                              ROUND(B02.ALDERSP.ST(BER_SØ_IND)          00003100
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);    00003110
                    REST_FRADRAG =  REST_FRADRAG -                      00003120
                                    W_BRUTTO_ST +                       00003130
                                    B02.ALDERSP.ST(BER_SØ_IND);         00003140
                END;                                                    00003150
            END;                                                        00003160
                                                                        00003170
          IF W_KT > 0 THEN                                              00003180
            DO;                                                         00003190
                                                                        00003200
             IF W_KT >= REST_FRADRAG THEN                               00003210
                W_KT = W_KT - REST_FRADRAG;                             00003220
             ELSE                                                       00003230
                W_KT  = 0;                                              00003240
                                                                        00003250
             B02.ALDERSP.KT(BER_SØ_IND) = W_KT;                         00003260
            END;                                                        00003270
                                                                        00003280
     END;                                                               00003290
                                                                        00003300
    IF B02.AP_GP_NETTO(BER_SØ_IND) +                                    00003310
       B02.AP_TP_NETTO(BER_SØ_IND) < 10 THEN                            00003320
                                                                        00003330
       DO;                                                              00003340
      /*  B02.ALDERSP.GP(BER_SØ_IND)        = 0;  */                    00003350
          B02.AP_GP_NETTO(BER_SØ_IND)       = 0;                        00003360
     /*   B02.ALDERSP.TP(BER_SØ_IND)        = 0; */                     00003370
          B02.AP_TP_NETTO(BER_SØ_IND)       = 0;                        00003380
          B02.ALDERSP.ST(BER_SØ_IND)        = 0;                        00003390
          B02.ALDERSP.KT(BER_SØ_IND)        = 0;                        00003400
          B02.GT_LOV92  (BER_SØ_IND)        = 0;                        00003410
                                                                        00003420
          B02.GARANTITILLEGG_EK(BER_SØ_IND)           = 0;              00003430
          B02.GARANTITILLEGG_BARN(BER_SØ_IND)         = 0;              00003440
          B02.BT_SÆRBARN(BER_SØ_IND)                  = 0;              00003450
          B02.GARANTITILLEGG_SÆRBARN(BER_SØ_IND)      = 0;              00003460
          B02.FT_SKAL_BEREGNES(BER_SØ_IND)            = 'D';            00003470
                                                                        00003480
       END;                                                             00003490
   END;                                                                 00003500
 ELSE   /*FRADRAGET ER MINDRE ENN G */                                  00003510
     DO;                                                                00003520
        B02.AP_GP_NETTO(BER_SØ_IND)   = B02.ALDERSP.GP(BER_SØ_IND);     00003530
        B02.AP_TP_NETTO(BER_SØ_IND)   = B02.ALDERSP.TP(BER_SØ_IND);     00003540
        B02.TP_NETTO(BER_SØ_IND)      = B02.TP_BRUTTO (BER_SØ_IND);     00003550
        B02.ALDERSP.ST(BER_SØ_IND)    = B02.ALDERSP.ST(BER_SØ_IND);     00003560
        B02.ALDERSP.KT(BER_SØ_IND)    = W_KT;                           00003570
     END;                                                               00003580
                                                                        00003590
 L500:                                                                  00003600
                                                                        00003610
  B02.ALDERSP.UTTAKS_APD(BER_SØ_IND) = 000; /* 999 ØNSKE FRA NORTYGD */ 00003620
  B02.ALDERSP.APD(BER_SØ_IND) = 000;        /*  "  ØNSKE FRA NORTYGD */ 00003630
                                                                        00003640
  /*TRUDE 210292:  */                                                   00003650
  IF B02.ALDERSP.UTTAKSDATO_ÅM(BER_SØ_IND) = 0   THEN                   00003660
     B02.ALDERSP.UTTAKSDATO_ÅM(BER_SØ_IND) =                            00003670
                            B02.VIRK_DATO_ÅM(BER_SØ_IND);               00003680
                                                                        00003690
  DCL GT  FIXED DEC (7) INIT (0);                                       00003700
                                                                        00003710
  GT  =             B02.GT_TILLEGG_LOV92(BER_SØ_IND);                   00003720
  W_SUM_YTELSE    = B02.AP_GP_NETTO(BER_SØ_IND) +                       00003730
                    B02.AP_TP_NETTO(BER_SØ_IND) +                       00003740
                    B02.TP_NETTO(BER_SØ_IND) +                          00003750
                    B02.ALDERSP.ST(BER_SØ_IND)  +                       00003760
                    B02.ALDERSP.KT(BER_SØ_IND)  +                       00003770
                    B02.GT_TILLEGG_LOV92(BER_SØ_IND);                   00003780
                                                                        00003790
                                                                        00003800
  /* ALLE NYE AFP PENSJONISTER SKAL HA KODE 'N' */                      00003810
                                                                        00003820
    IF (B02.PENSJONSTYPE1(BER_SØ_IND)   = 'K' &                         00003830
        B02.UTTAKSDATO_ÅM(BER_SØ_IND)   > 9709 ) !                      00003840
       (B02.KONV_P_KODE  (BER_SØ_IND)   = 'K' &                         00003850
        B02.UTTAKSDATO_ÅM(BER_SØ_IND)   > 9709) THEN                    00003860
          DIV_PARAM_OMR.AP_KODE_AEY(BER_SØ_IND)   =  'N';     /**TS*/   00003870
                                                                        00003880
                                                                        00003890
  L999:                                                                 00003900
                                                                        00003910
 END JUSTER_MED_FORVENTET_INNTEKT_AP;                                   00003920
