 /*       SIST ENDRET 03/07-97 10.51.17 AV   JDA7339                  */00000000
 /*       SIST ENDRET 01/10-92 13.22.32 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 08/08-89 08.52.25 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 07/02-89 13.10.00 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 28/09-82 07.23.53 AV   FARVIK                   */00000040
 /*       SIST ENDRET 16/09-82 09.27.59 AV   JANKR                    */00000050
  /* ***************************************************************  */00000060
  /*IDENTIFIKASJON:                                                   */00000070
  /*    R0019944 - INTERN PROSEDYRE I PLI/CICS.                       */00000080
  /*    PROGRAMMERER:  JAN-H. KRISTENSEN MAI 1982.                    */00000090
  /*HENSIKT:                                                          */00000100
  /*    PROSEDYREN BLIR OPPKALT FRA OVERFØR_TIL_MAP PROSEDYRENE.      */00000110
  /*    DEN SETTER INN AKTUELLE FEILMELDINGER PÅ MELDINGSFELTENE TIL  */00000120
  /*    MAPENE VIA LINK TIL R0019921 SOM GÅR INN I FEILMELDINGSBASEN. */00000130
  /*PROGRAMTILKNYTNING:                                               */00000140
  /*    PROSEDYREN INKLUDERES I DIALOG-PROGRAMMENE.                   */00000150
  /*BRUK:                                                             */00000160
  /*    CALL SKRIV_FEIL(FEILNR)                                       */00000170
  /*                                                                  */00000180
  /* ***************************************************************  */00000190
  % PAGE;                                                               00000200
     SKRIV_FEIL:                                                        00000210
       PROC (FEILNR);                                                   00000220
       DCL                                                              00000230
          FEILNR UNAL FIXED DEC (5),                                    00000240
          1 FEIL_STRUC,                                                 00000250
            2 FEIL_NR          FIXED DEC(5),                            00000260
            2 FEIL_MELDING     CHAR(78),                                00000270
            2 KOM_OMR_PEKER    POINTER;                                 00000280
                                                                        00000290
         DCL W_SEARCH_FNR      PIC '(11)9';                             00000300
                                                                        00000310
         W_SEARCH_FNR = DIV_PARAM_OMR.SEARCH_FNR;                       00000320
                                                                        00000330
         IF FRA_UTEN_DIALOG ! FRA_MED_DIALOG THEN                       00000340
                                                                        00000350
           IF FEIL_MELD_NR > 0 THEN                                     00000360
             DO;                                                        00000370
               MELDING1O = 'PROGRAM ' !! DIV_PARAM_OMR.PROGRAM_ID !!    00000380
                           ' GÅR I FEIL VED LABEL NR. '           !!    00000390
                           DIV_PARAM_OMR.FEIL_VED_LABEL !!              00000400
                           ' DB STATUS   ' !!                           00000410
                           DIV_PARAM_OMR.DB_STATUS_KODE ;               00000420
               ANT_FEIL_SKREVET = 2;                                    00000430
             END;                                                       00000440
                                                                        00000450
           IF FEIL_MELD_NR = 382  THEN                                  00000460
             DO;                                                        00000470
               MELDING1O = 'AVVIST IDAG - MÅ TAS OM IGJEN - ' !!        00000480
                      W_SEARCH_FNR !! '  VAR I HISTORIKK  REG. '  ;     00000490
               ANT_FEIL_SKREVET = 2;                                    00000500
             END;                                                       00000510
                                                                        00000520
                                                                        00000530
          IF ANT_FEIL_SKREVET < 7 THEN                                  00000540
             DO;                                                        00000550
               KOM_OMR_PEKER = COMMAREA_PEKER;                          00000560
               FEIL_NR       = FEILNR;                                  00000570
               EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC); 00000580
                                                                        00000590
               ANT_FEIL_SKREVET = ANT_FEIL_SKREVET + 1;                 00000600
               IF ANT_FEIL_SKREVET = 1 THEN                             00000610
                  MELDING1O = FEIL_MELDING;                             00000620
               ELSE                                                     00000630
                  IF ANT_FEIL_SKREVET = 2 THEN                          00000640
                     MELDING2O = FEIL_MELDING;                          00000650
                  ELSE                                                  00000660
                     IF ANT_FEIL_SKREVET = 3 THEN                       00000670
                        MELDING3O = FEIL_MELDING;                       00000680
                     ELSE                                               00000690
                        IF ANT_FEIL_SKREVET = 4 THEN                    00000700
                           MELDING4O = FEIL_MELDING;                    00000710
                        ELSE                                            00000720
                           IF ANT_FEIL_SKREVET = 5 THEN                 00000730
                              MELDING5O = FEIL_MELDING;                 00000740
                           ELSE                                         00000750
                              IF ANT_FEIL_SKREVET = 6 THEN              00000760
                                 MELDING6O = FEIL_MELDING;              00000770
             END;                                                       00000780
       END SKRIV_FEIL;                                                  00000790
