 TT_EP:                                                                 R0000010
   PROC(FNR,DØDSDATO,MAKS_TT_FØR_1967,TT_TIL_67_ÅR);                    R0000020
 /* ***************************************************************** */R0000030
 /* PARAMETER INN: FNR,DØDSDATO                                       */R0000040
 /* PARAMETER UT : MAKS_TT_FØR_1967,TT_TIL_67_ÅR                      */R0000050
 /*                                                                   */R0000060
 /* RUTINEN KALLES OPP FRA R0019909 (KONTROLL_TT), OG BEREGNER MAKS   */R0000070
 /* TT FØR 1967 (MAKS_TT_FØR_1967), OG TT FRA 1966 TIL 67-ÅRS DAGEN   */R0000080
 /* (TT_TIL_67_ÅR)                                                    */R0000090
 /* ***************************************************************** */R0000100
   DCL                                                                  R0000110
      FNR              PIC'(11)9';                                      R0000120
   DCL                                                                  R0000130
      DØDSDATO         PIC'(4)9';                                       R0000140
   DCL                                                                  R0000150
      MAKS_TT_FØR_1967 PIC'(2)9',                                       R0000160
      TT_TIL_67_ÅR     PIC'(4)9';                                       R0000170
   DCL                                                                  R0000180
      FYLT_SEKSTISJU   PIC'(5)9';                                       R0000190
   DCL                                                                  R0000200
      W_FNR_MN         PIC'(2)9' DEF FNR POS(3),                        R0000210
      W_FNR_ÅR         PIC'(2)9' DEF FNR POS(5),                        R0000220
      W_PERSNR         PIC'(3)9' DEF FNR POS(7);                        R0000230
      IF W_FNR_ÅR <= 11 ! W_PERSNR >= 500 THEN                          R0000240
         MAKS_TT_FØR_1967 = 40;                                         R0000250
      ELSE                                                              R0000260
         MAKS_TT_FØR_1967 = 1967 - (                                    R0000270
         W_FNR_ÅR + 1900 + 16);                                         R0000280
      IF W_PERSNR <= '499' THEN                                         R0000290
         FYLT_SEKSTISJU = ((W_FNR_ÅR + 67) * 100) + W_FNR_MN;           R0000300
      ELSE                                                              R0000310
         FYLT_SEKSTISJU = (((W_FNR_ÅR + 67) - 100) * 100)+              R0000320
         W_FNR_MN;                                                      R0000330
      IF FYLT_SEKSTISJU >= 6700 THEN                                    R0000340
         TT_TIL_67_ÅR = FYLT_SEKSTISJU - 6700;                          R0000350
      ELSE                                                              R0000360
         TT_TIL_67_ÅR = 0;                                              R0000370
      RETURN;                                                           R0000380
   END TT_EP;                                                           R0000390
