 /*       SIST ENDRET 25/02-97 11.54.17 AV   JDA7339                  */00000000
 /*       SIST ENDRET 06/02-96 13.27.11 AV   JDA0310                  */00000010
 /*       SIST ENDRET 10/01-96 11.01.36 AV   TSB0310                  */00000020
 /* ***************************************************************** */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /* **********************                                            */00000050
 /*  PROGRAM-IDENT : R00104FO  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000060
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000070
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000080
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000090
 /*                                                                   */00000100
 /* ***************************************************************** */00000110
 /*HENSIKT:                                                           */00000120
 /* **********                                                        */00000130
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000140
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000150
 /*    FORHÅND.                                                       */00000160
 /*    MAPS HØRER INN UNDER MAPSET 'S001F3'.                         */ 00000170
 /*                                                                   */00000180
 /* ***************************************************************** */00000190
 /*PROGRAMTILKNYTTING:                                                */00000200
 /* ********************                                              */00000210
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000220
 /*                                                                   */00000230
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000240
 /*    BRUK :                                                         */00000250
 /*    EXEC CICS XCTL PROGRAM ('R00104FO') COMMAREA(KOM_OMR);         */00000260
 /*    PROGRAMMET INCLUDER :                                          */00000270
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    FO       */00000280
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       FO       */00000290
 /* ***************************************************************** */00000300
 /*DATASETTOPPLYSNINGER:                                              */00000310
 /* ***********************                                           */00000320
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000330
 /*                                                                   */00000340
 /* ***************************************************************** */00000350
 /*FEILMELDINGER:                                                     */00000360
 /* *******************                                               */00000370
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000380
 /*                                                                   */00000390
 /* ***************************************************************** */00000400
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000410
                                                                        00000420
          %INCLUDE P0019906;                                            00000430
          %INCLUDE P0019908;                                            00000440
          %INCLUDE P0019910;                                            00000450
          %INCLUDE P0019912;                                            00000460
          %INCLUDE P0019913;                                            00000470
                                                                        00000480
 DCL                                                                    00000490
    CSTG                   BUILTIN,                                     00000500
    COMMAREA_PEKER         PTR,                                         00000510
    LOKAL_KOM_PTR          PTR,                                         00000520
    SIDE_TELL              FIXED BIN(15) INIT (1),                      00000530
    I                      FIXED BIN(15),                               00000540
    START                  FIXED BIN(15) INIT(1),                       00000550
    LENGTH                 FIXED BIN(15),                               00000560
    LABEL_Y                LABEL,                                       00000570
    LOW_CHAR_BASED         CHAR(1200) BASED(BMSMAPBR),                  00000580
    ADDR                   BUILTIN;                                     00000590
                                                                        00000600
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000610
 DCL                                                                    00000620
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000630
    DFHBMUNP             CHAR(1) INIT(' '),                             00000640
    DFHBMBRY             CHAR(1) INIT('H'),                             00000650
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000660
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000670
    MELDING6O            CHAR(10),                                      00000680
    YMELDING6O           CHAR(10);                                      00000690
                                                                        00000700
          %INCLUDE S001F3  ;                                            00000710
          %INCLUDE P001UC01;                                            00000720
                                                                        00000730
                                                                        00000740
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000750
                                                                        00000760
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000770
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000780
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000790
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000800
                                                                        00000810
                                                                        00000820
                                                                        00000830
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000840
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000850
                                                                        00000860
           CALL OVERFØR_FO_SØKER_MAP;               /* R001UC06 */      00000870
           CALL TEKST_SØKER2;                       /* R001UC07 */      00000880
           CALL OVERFØR_FO_SØKER2_MAP;               /* R001UC06 */     00000890
           S001UC1O.DUMMYA = 'Ø';                   /* PROT,DARK  */    00000900
           IF TRANS_OMR.FOS.BT_ANT > 0 THEN                             00000910
              DO;                                                       00000920
                 CALL TEKST_BARN;                   /* R0011207 */      00000930
                 CALL OVERFØR_FO_BARN_MAP;    /* R0011206 */            00000940
              END;                                                      00000950
                                                                        00000960
           /* FREE TRANS_OMR,TRANS_OPPL_OMR; */                         00000970
                                                                        00000980
                                                                        00000990
                                                                        00001000
      EXEC CICS RETURN;                                                 00001010
                                                                        00001020
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00001030
      PROC(FIXED_DEC_5);                                                00001040
                                                                        00001050
      DCL                                                               00001060
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00001070
                                                                        00001080
   END SKRIV_FEIL;                                                      00001090
                                                                        00001100
        SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001110
                                                                        00001120
           DCL                                                          00001130
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001140
                                                                        00001150
        END SKRIV_FEIL_YP;                                              00001160
                                                                        00001170
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001180
                                                                        00001190
           DCL                                                          00001200
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001210
                                                                        00001220
        END SKRIV_FEIL_SP;                                              00001230
                                                                        00001240
          %INCLUDE R0019912;                                            00001250
          %INCLUDE R001UC06;                                            00001260
          %INCLUDE R001UC07;                                            00001270
                                                                        00001280
 END R001041;                                                           00001290
