 /*       SIST ENDRET 24/08-90 11.56.04 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 05/07-90 09.24.18 AV   DYBVIK                   */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0014182 - PROSEDYRE I PLI                                     */00000040
 /*    PROGRAMMERER: TRUDE SPONBERG MARS 1990                         */00000050
 /*HENSIKT:                                                           */00000060
 /*    BEREGNE GRUNNPENSJON ETTERLATT-AP    BOSATT UTLAND             */00000070
 /*PROGRAMTILKNYTNING:                                                */00000080
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV ETTERLATTEPEN-  */00000090
 /*    SJONSBEREGNINGEN                                               */00000100
 /*    INCLUDES I R0014101                                            */00000110
 /*BRUK:                                                              */00000120
 /*    CALL BEREGN_GP_ETTERLATT_AP_UTLAND;                            */00000130
 /*                                                                   */00000140
 /*FORUTSETTER AT TRYGDETIDEN ER REGNET RIKTIG I R0014380             */00000150
 /* ***************************************************************** */00000160
                                                                        00000170
 /*------------------------------------------------------------------*/ 00000180
 /* KRAV OM PENSJON/OVERGANGSSTØNAD UNDER BOSETTING I UTLANDET       */ 00000190
 /* GRUNNPENSJON. BEREGNINGSREGLENES PUNKT 6.1.1.2 . TRUDE, 21.03.90 */ 00000200
 /*                                                                  */ 00000210
 /*------------------------------------------------------------------*/ 00000220
                                                                        00000230
 BEREGN_GP_ETTERLATT_AP_UTLAND:                                         00000240
  PROC;                                                                 00000250
  DCL BOTID_EGEN   FIXED DEC (3) INIT(0),                               00000260
      BOTID_EK     FIXED DEC (3) INIT(0);                               00000270
                                                                        00000280
  DCL FAKTISK_BOTID_EGEN   FIXED DEC (3) INIT(0),                       00000290
      FAKTISK_BOTID_EK     FIXED DEC (3) INIT(0);                       00000300
                                                                        00000310
  DCL TT_MED_FREMT_ÅR_EGEN  FIXED DEC (3) INIT(0),                      00000320
      TT_MED_FREMT_ÅR_EK    FIXED DEC (3) INIT(0);                      00000330
                                                                        00000340
  DCL TT_ANV_GP    FIXED DEC (3) INIT(0);                               00000350
                                                                        00000360
  DCL GRUNNPENSJON  FIXED DEC (11,4) INIT(0);                           00000370
                                                                        00000380
  BOTID_EGEN   = B02.TT_FØR_1967(BER_SØ_IND) +                          00000390
                 B02.TT_FRAMT_VED_FRAVIK_10_1(BER_SØ_IND) +             00000400
                 B02.TT_FRAMT_DØD(BER_SØ_IND) +                         00000410
                ((B02.TT_ETTER_1966(BER_SØ_IND) + 11) / 12);            00000420
                                                                        00000430
  IF BOTID_EGEN > 40   THEN                                             00000440
     BOTID_EGEN = 40;                                                   00000450
                                                                        00000460
                                                                        00000470
  TT_MED_FREMT_ÅR_EGEN = B02.TT_FØR_1967(BER_SØ_IND) +                  00000480
                       ((B02.TT_ETTER_1966(BER_SØ_IND) +                00000490
                         B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);          00000500
                                                                        00000510
                                                                        00000520
  TT_MED_FREMT_ÅR_EK   = B02.TT_FØR_1967(BER_EK_IND) +                  00000530
                       ((B02.TT_ETTER_1966(BER_EK_IND) +                00000540
                         B02.TT_FRAMT(BER_EK_IND) + 11) / 12);          00000550
                                                                        00000560
  IF TT_MED_FREMT_ÅR_EGEN > 40  THEN                                    00000570
     TT_MED_FREMT_ÅR_EGEN = 40 ;                                        00000580
                                                                        00000590
  IF TT_MED_FREMT_ÅR_EK   > 40  THEN                                    00000600
     TT_MED_FREMT_ÅR_EK   = 40 ;                                        00000610
                                                                        00000620
  IF B02.STATUS.VILKÅR_8_4_3A(BER_EK_IND)  = 'J' THEN                   00000630
    DO;                                                                 00000640
        IF TT_MED_FREMT_ÅR_EK > 20 !                                    00000650
           TT_MED_FREMT_ÅR_EGEN > 20 THEN                               00000660
            DO;                                                         00000670
               IF TT_MED_FREMT_ÅR_EGEN > TT_MED_FREMT_ÅR_EK THEN        00000680
                  TT_ANV_GP = TT_MED_FREMT_ÅR_EGEN;                     00000690
               ELSE                                                     00000700
                  TT_ANV_GP = TT_MED_FREMT_ÅR_EK;                       00000710
             B02.TT_ANV(BER_EK_IND) = TT_MED_FREMT_ÅR_EK;  /*210890TS*/ 00000720
             GO TO L100;                                                00000730
            END;                                                        00000740
    END;                                                                00000750
                                                                        00000760
  BOTID_EK     = B02.TT_FØR_1967(BER_EK_IND) +                          00000770
                ((B02.TT_ETTER_1966(BER_EK_IND) + 11) / 12);            00000780
                                                                        00000790
  IF BOTID_EK   > 40   THEN                                             00000800
     BOTID_EK   = 40;                                                   00000810
                                                                        00000820
  FAKTISK_BOTID_EGEN   = B02.TT_FØR_1967(BER_SØ_IND) +                  00000830
                       ((B02.TT_ETTER_1966(BER_SØ_IND) + 11) / 12);     00000840
  FAKTISK_BOTID_EK     = B02.TT_FØR_1967(BER_EK_IND) +                  00000850
                       ((B02.TT_ETTER_1966(BER_EK_IND) + 11) / 12);     00000860
                                                                        00000870
  IF FAKTISK_BOTID_EGEN > 40 THEN                                       00000880
     FAKTISK_BOTID_EGEN = 40;                                           00000890
                                                                        00000900
  IF FAKTISK_BOTID_EK   > 40 THEN                                       00000910
     FAKTISK_BOTID_EK   = 40;                                           00000920
                                                                        00000930
  IF (B02.TRYGDET_DØD(BER_SØ_IND)    = 'J' !                            00000940
      B02.TRYGDET_DØD(BER_EK_IND)    = 'J')  &                          00000950
     (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND)    = 'J' !                        00000960
      B02.TRYGDET_3ÅR_DØD(BER_EK_IND)    = 'J') THEN                    00000970
   DO;                                                                  00000980
                                                                        00000990
      /*PUNKT 1.1 MINST 20 ÅR BOTID , SAMME REGLER SOM BOSATT(6.1.1.1)*/00001000
                                                                        00001010
      /* PUNKT 1.2 :  */                                                00001020
                                                                        00001030
                                                                        00001040
      IF  (BOTID_EGEN              >  9  &                              00001050
           BOTID_EGEN              < 20 ) !                             00001060
          (BOTID_EK                >  9  &                              00001070
           BOTID_EK                < 20 )  THEN                         00001080
         DO;                                                            00001090
            IF BOTID_EGEN          >=  BOTID_EK  THEN                   00001100
               TT_ANV_GP           =   BOTID_EGEN;                      00001110
            ELSE                                                        00001120
               TT_ANV_GP           = BOTID_EK  ;                        00001130
         END;                                                           00001140
        B02.TT_ANV(BER_EK_IND) = BOTID_EK;  /*210890TS*/                00001150
   END;                                                                 00001160
                                                      /*PUNKT 2: */     00001170
                                                                        00001180
   IF (B02.BOSATT(BER_SØ_IND)   > 0 &                                   00001190
       B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J') !                        00001200
      (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J' &                         00001210
       B02.TRYGDET_DØD(BER_EK_IND)      = 'J' ) THEN                    00001220
     DO;                                                                00001230
        IF FAKTISK_BOTID_EGEN > FAKTISK_BOTID_EK  THEN                  00001240
          TT_ANV_GP   = FAKTISK_BOTID_EGEN;                             00001250
        ELSE                                                            00001260
          TT_ANV_GP   = FAKTISK_BOTID_EK  ;                             00001270
        B02.TT_ANV(BER_EK_IND) = FAKTISK_BOTID_EK;  /*210890TS*/        00001280
     END;                                                               00001290
                                                                        00001300
                                                       /*PUNKT 3: */    00001310
                                                                        00001320
   IF (B02.BOSATT(BER_SØ_IND)   > 0 &                                   00001330
       B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J') !                        00001340
      (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J' &                         00001350
       B02.TRYGDET_DØD(BER_EK_IND)     ^= 'J' ) THEN                    00001360
     DO;                                                                00001370
        IF FAKTISK_BOTID_EGEN >= FAKTISK_BOTID_EK  THEN                 00001380
          TT_ANV_GP   = FAKTISK_BOTID_EGEN;                             00001390
        ELSE                                                            00001400
          TT_ANV_GP   = FAKTISK_BOTID_EK  ;                             00001410
        B02.TT_ANV(BER_EK_IND) = FAKTISK_BOTID_EK;  /*210890TS*/        00001420
     END;                                                               00001430
                                                                        00001440
                                                                        00001450
                                                        /*PUNKT 4: */   00001460
                                                                        00001470
   IF (B02.BOSATT(BER_SØ_IND)   > 0 &                                   00001480
       B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) = 'J') !                         00001490
      (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J' &                         00001500
       B02.TRYGDET_DØD(BER_EK_IND)     ^= 'J' ) THEN                    00001510
     DO;                                                                00001520
        IF FAKTISK_BOTID_EGEN >= FAKTISK_BOTID_EK  THEN                 00001530
          TT_ANV_GP   = FAKTISK_BOTID_EGEN;                             00001540
        ELSE                                                            00001550
          TT_ANV_GP   = FAKTISK_BOTID_EK  ;                             00001560
        B02.TT_ANV(BER_EK_IND) = FAKTISK_BOTID_EK;  /*210890TS*/        00001570
     END;                                                               00001580
                                                                        00001590
                                                                        00001600
                                              /*6.1.1.4 KONVENSJON   */ 00001610
                                                                        00001620
  IF B02.KONVENSJON(BER_SØ_IND) = 'J' THEN   /* DEN STØRSTE TT ??? */   00001630
    DO;                                                                 00001640
     IF FAKTISK_BOTID_EGEN >= FAKTISK_BOTID_EK  THEN                    00001650
        TT_ANV_GP          = FAKTISK_BOTID_EGEN;                        00001660
     ELSE                                                               00001670
        TT_ANV_GP          = FAKTISK_BOTID_EK  ;                        00001680
     B02.TT_ANV(BER_EK_IND) = FAKTISK_BOTID_EK;  /*210890TS*/           00001690
    END;                                                                00001700
                                                     /* PUNKT 1.3 :  */ 00001710
                                                                        00001720
 /*IF B02.ETTEPENS.PÅ_AVD (BER_SØ_IND)  >  BOTID_EK    THEN             00001730
                    TT_ANV_GP = B02.ETTEPENS.PÅ_AVD(BER_SØ_IND); ? */   00001740
                                                                        00001750
   IF B02.ETTEPENS.TP_BRUTTO(BER_SØ_IND) > 0   THEN                     00001760
     DO;                                                                00001770
       IF TT_ANV_GP < B02.ETTEPENS.PÅ_AVD(BER_SØ_IND) THEN              00001780
         DO;                                                            00001790
          TT_ANV_GP = B02.ETTEPENS.PÅ_AVD(BER_SØ_IND);                  00001800
          B02.TT_ANV(BER_EK_IND) = TT_ANV_GP;         /*210890TS*/      00001810
         END;                                                           00001820
     END;                                                               00001830
 L100:                                                                  00001840
  IF (TT_ANV_GP  >  3 ) !                                               00001850
     (TT_ANV_GP < 3   & B02.KONVENSJON(BER_SØ_IND) = 'J') THEN          00001860
     DO;                                                                00001870
       GRUNNPENSJON                       = G * TT_ANV_GP / 40;         00001880
       GRUNNPENSJON                       = (GRUNNPENSJON / 12) + 0.5;  00001890
       B02.ALDERSP.GP(BER_SØ_IND)         = GRUNNPENSJON;               00001900
       B02.TT_ANV(BER_SØ_IND)             = TT_ANV_GP;                  00001910
     END;                                                               00001920
  ELSE                                                                  00001930
       B02.ALDERSP.GP(BER_SØ_IND) = 0;                                  00001940
                                                                        00001950
                                                                        00001960
 /*------------------------------------------------------------------*/ 00001970
 /* KRAV OM PENSJON/OVERGANGSSTØNAD UNDER BOSETTING I UTLANDET       */ 00001980
 /* TIL HIT. TRUDE                                                   */ 00001990
 /*------------------------------------------------------------------*/ 00002000
                                                                        00002010
 /* *********************************************************** */      00002020
 /* YS - BEREGNING                                              */      00002030
 /* *********************************************************** */      00002040
                                                                        00002050
 /*YS*/ DCL KAP11_GP     FIXED DEC (5);                                 00002060
 /*YS*/ DCL VANLIG_GP    FIXED DEC (5);                                 00002070
 /*YS*/                                                                 00002080
 /*YS*/                                                                 00002090
 /*YS*/ IF B02.YRKEPENS.YUG(BER_EK_IND) > 0      THEN                   00002100
 /*YS*/    DO;                                                          00002110
 /*YS*/       KAP11_GP = G*B02.YRKEPENS.YUG(BER_EK_IND)/(100*12)+ 0.5;  00002120
 /*YS*/       IF B02.YRKEPENS.YUG(BER_EK_IND) = 100    THEN             00002130
 /*YS*/          B02.ALDERSP.GP(BER_SØ_IND) = KAP11_GP;                 00002140
 /*YS*/       ELSE                                                      00002150
 /*YS*/          DO;                                                    00002160
 /*YS*/             VANLIG_GP = B02.ALDERSP.GP(BER_SØ_IND) *            00002170
 /*YS*/                         B02.YRKEPENS.YUG(BER_EK_IND)/100 + 0.5; 00002180
 /*YS*/             B02.ALDERSP.GP(BER_SØ_IND) =                        00002190
 /*YS*/                               B02.ALDERSP.GP(BER_SØ_IND) +      00002200
 /*YS*/                               KAP11_GP - VANLIG_GP;             00002210
 /*YS*/          END;                                                   00002220
 /*YS*/    END;                                                         00002230
                                                                        00002240
  IF B02.IKKE_GP(BER_SØ_IND)  = 'J' THEN                                00002250
     B02.ALDERSP.GP(BER_SØ_IND) = 0 ;                                   00002260
                                                                        00002270
 /*------------------------------------------------------------------*/ 00002280
 /* KRAV OM PENSJON/OVERGANGSSTØNAD UNDER BOSETTING I UTLANDET       */ 00002290
 /* TIL HIT. TRUDE                                                   */ 00002300
 /*------------------------------------------------------------------*/ 00002310
                                                                        00002320
   END BEREGN_GP_ETTERLATT_AP_UTLAND;                                   00002330
