 /*       SIST ENDRET 14/08-98 14.05.23 AV   JDA7339                  */00000000
 /*       SIST ENDRET 14/08-98 14.03.10 AV   JDA7339                  */00000010
 /*       SIST ENDRET 16/09-97 10.25.36 AV   JDA7339                  */00000020
 /*       SIST ENDRET 15/09-97 13.32.21 AV   JDA7339                  */00000030
 /*       SIST ENDRET 29/08-97 12.31.43 AV   JDA7339                  */00000040
 /*       SIST ENDRET 28/08-97 08.55.25 AV   SPA7339                  */00000050
 /*       SIST ENDRET 27/10-95 14.03.19 AV   HLB0310                  */00000060
 /*       SIST ENDRET 12/10-95 14.15.28 AV   JDA0310                  */00000070
 /*       SIST ENDRET 28/09-94 12.28.44 AV   JDA0310                  */00000080
 /*       SIST ENDRET 24/08-92 12.28.18 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 03/03-92 09.54.13 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 17/02-92 13.51.16 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 13/12-91 13.01.39 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 14/06-91 13.28.54 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 06/03-91 14.35.00 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 02/10-90 10.18.39 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 05/07-90 09.38.21 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 01/12-89 09.00.49 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 10/03-87 09.06.40 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 09/11-83 10.29.14 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 12/10-83 12.41.09 AV   OLAV                     */00000200
 /*       SIST ENDRET 10/10-83 13.30.02 AV   OLAV                     */00000210
 /* **************************************************************** */ 00000220
 /*IDENTIFIKASJON:                                                   */ 00000230
 /*    R0014301 - PROSEDYRE I PLI                                    */ 00000240
 /*    PROGRAMMERER: JAN KR., JUNI-82.                               */ 00000250
 /*HENSIKT:                                                          */ 00000260
 /*    BEREGNE ETTERLATTEPENSJON                                     */ 00000270
 /*                                                                  */ 00000280
 /*PROGRAMTILKNYTNING:                                               */ 00000290
 /*    KALLES OPP AV PROGRAM R0013520                                */ 00000300
 /*BRUK:                                                             */ 00000310
 /*    EXEC CICS XCTL PROGRAM ('R0014301') COMMAREA (KOM_OMR)        */ 00000320
 /* **************************************************************** */ 00000330
 %PAGE;                                                                 00000340
 REGN_EP:                                                               00000350
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000360
 %PAGE;                                                                 00000370
  /*  %INCLUDE P0010801;   ETTERLATTE-BLANKETTEN*/                      00000380
  /*  %INCLUDE P001N801;   E3-NY0191 -BLANKETTEN*/                      00000390
      %INCLUDE P0019906; /* TRANS_OMR_OPL */                            00000400
      %INCLUDE P0019908; /* KOM_OMR       */                            00000410
      %INCLUDE P0019910; /* STYRINGS_OMR  */                            00000420
      %INCLUDE P0019912; /* DIV_PARAM_OMR */                            00000430
      %INCLUDE P0014009; /* POTALL_OPPL   */                            00000440
      %INCLUDE P0014002; /* W_POREKKE     */                            00000450
      %INCLUDE P0014003; /* TAB           */                            00000460
      %INCLUDE P0019924; /* GV_TAB_RE     */                            00000470
      %INCLUDE P0019925; /* G_TAB_RE      */                            00000480
 %PAGE;                                                                 00000490
   DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                       00000500
   DCL COMMAREA_PEKER PTR;                                              00000510
 %PAGE;                                                                 00000520
   DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                       00000530
 %PAGE;                                                                 00000540
   DCL                                                                  00000550
      CSTG                                BUILTIN,                      00000560
      W_ST_FRADRAG                        FIXED DEC(5),                 00000570
      W_ST                                FIXED DEC(7),                 00000580
      W_KT                                FIXED DEC(5);                 00000590
 %PAGE;                                                                 00000600
                                                                        00000610
   DCL                                                                  00000620
      TRYGDETID_KONV    FIXED DEC (3) INIT (0),                         00000630
      Y_TILLEGG         CHAR (1);                                       00000640
                                                                        00000650
                                                                        00000660
          DCL ADDR      BUILTIN;                                        00000670
          DCL DATE      BUILTIN;                                        00000680
          DCL DATO      CHAR(6);                                        00000690
                                                                        00000700
          DCL 1 DAGENS_DATO  DEF  DATO,                                 00000710
                2  ÅR        PIC'99',                                   00000720
                2  MND       PIC'99',                                   00000730
                2  DAG       PIC'99';                                   00000740
                                                                        00000750
          DCL J       FIXED DEC (2);                                    00000760
                                                                        00000770
          DCL  W_TILLEGG_LOV92         FIXED DEC (5) INIT (0);          00000780
          DCL  W_TP_PROSENT            FIXED DEC (3);                   00000790
          DCL  W_FNR_EK                        PIC '(11)9';             00000800
          DCL  W_FNR_EK_ÅR DEF W_FNR_EK POS(5) PIC '99';                00000810
          DCL  W_FNR_EK_ÅRHUNDRE DEF W_FNR_EK POS(7) PIC '9';           00000820
     DCL                                                                00000830
         W_TT_EGEN                       FIXED(5) INIT (0),             00000840
         W_TT_AVDØD                      FIXED(5) INIT (0);             00000850
     DCL                                                                00000860
         1 DØDSDATO_ÅMD                  PIC '(6)9',                    00000870
         1 DØDSTP DEF DØDSDATO_ÅMD,                                     00000880
           2 ÅR                          PIC '99',                      00000890
           2 MND                         PIC '99',                      00000900
           2 DAG                         PIC '99';                      00000910
     DCL FULL_TT               CHAR (1)  INIT (' ');  /* HL*/           00000920
     DCL BRUKT_TT              FIXED DEC (3) INIT (0);/* HL*/           00000930
                                                                        00000940
 /* ***************************************************************** */00000950
 /* PROGRAMMET STARTER HER                                            */00000960
 /* ***************************************************************** */00000970
                                                                        00000980
     DATO = DATE;                                                       00000990
     DØDSDATO_ÅMD = B02.DØDSDATO_ÅMD(BER_EK_IND);                       00001000
     W_FNR_EK     = B02.FNR         (BER_EK_IND);                       00001010
                                                                        00001020
    DIV_PARAM_OMR.FULLT_SÆRTILLEGG(BER_SØ_IND) = 0;                     00001030
                                                                        00001040
    IF TRANS_OPPL_OMR.BLANKETTYPE  = 'EP' THEN                          00001050
       CALL HENT_FRA_EP;                                                00001060
    ELSE                                                                00001070
    IF TRANS_OPPL_OMR.BLANKETTYPE  = 'E3' THEN                          00001080
       CALL HENT_FRA_E3;                                                00001090
    ELSE                                                                00001100
    IF TRANS_OPPL_OMR.BLANKETTYPE  = 'EE' THEN                          00001110
       CALL HENT_FRA_EE;                                                00001120
                                                                        00001130
 /* ***************************************************************** */00001140
 /* KALL UNDERPROGRAM SOM BEREGNER                                    */00001150
 /* ***************************************************************** */00001160
                                                                        00001170
                                                                        00001180
        IF Y_TILLEGG    = 'J'  THEN               /*NY0191*/            00001190
           CALL BEREGN_POENG_AÅI_AVDØD;           /*4128*/              00001200
                                                                        00001210
    CALL BEREGN_TP_ETTERLATT;                                           00001220
                                                                        00001230
 /*0795 HL : ******** */                                                00001240
                                                                        00001250
   IF FULL_TT = ' '                       THEN                          00001260
     DO;                                                                00001270
       IF (B02.DØDSDATO_ÅMD(BER_EK_IND) < 930000) THEN                  00001280
          DO;                                                           00001290
            IF B02.IKKE_GP(BER_SØ_IND) = 'J'   THEN                     00001300
               B02.GP_BRUTTO(BER_SØ_IND) = 0;                           00001310
            ELSE                                                        00001320
               B02.GP_BRUTTO(BER_SØ_IND) =                              00001330
                   G*B02.TT_ANV(BER_SØ_IND)/(12*40) + 0.5;              00001340
          END;                                                          00001350
       ELSE                                                             00001360
          DO;                                                           00001370
            IF B02.TT_ANV(BER_EK_IND) < B02.TT_ANV(BER_SØ_IND) THEN     00001380
               B02.TT_ANV(BER_EK_IND) = B02.TT_ANV(BER_SØ_IND);         00001390
            IF B02.SPESOPPL.KONVENSJON(BER_EK_IND) ^= 'J'  THEN         00001400
               IF B02.TT_ANV(BER_EK_IND) < B02.PÅ_AVD(BER_SØ_IND) THEN  00001410
                  B02.TT_ANV(BER_EK_IND) = B02.PÅ_AVD(BER_SØ_IND);      00001420
            B02.TT_GARANTI(BER_SØ_IND) = 0;                             00001430
            B02.GP_BRUTTO(BER_SØ_IND) =                                 00001440
                G*B02.TT_ANV(BER_EK_IND)/(12*40) + 0.5;                 00001450
          END;                                                          00001460
     END;                                                               00001470
   ELSE                                                                 00001480
   IF  FULL_TT = 'J'                       THEN                         00001490
     DO;                                                                00001500
        B02.TT_ANV(BER_EK_IND) = 40;                                    00001510
        B02.GP_BRUTTO(BER_SØ_IND) = G / 12 + 0.5;                       00001520
        IF (B02.DØDSDATO_ÅMD(BER_EK_IND) < 930000) THEN                 00001530
           DO;                                                          00001540
             B02.TT_ANV(BER_SØ_IND) = 40;                               00001550
             B02.TT_GARANTI(BER_SØ_IND) = 40;                           00001560
           END;                                                         00001570
        ELSE                                                            00001580
           B02.TT_GARANTI(BER_EK_IND) = 40;                             00001590
     END;                                                               00001600
   ELSE  /*DA ER NORSK_BOSATT = N */                                    00001610
     IF (B02.DØDSDATO_ÅMD(BER_EK_IND) < 930000) THEN                    00001620
       DO;                                                              00001630
         IF B02.BOSATT(SØKER_IND)        >  0     &                     00001640
            (B02.TT_16_66(SØKER_IND)      =  0     &                    00001650
            B02.TT_16_66(BER_EK_IND)      =  0) THEN                    00001660
            CALL BEREGN_GP_ETTERLATT_UTLAND;  /* 4380 */                00001670
         ELSE                                                           00001680
            CALL BEREGN_GP_ETTERLATT;            /*4321*/               00001690
       END;                                                             00001700
     ELSE                                                               00001710
        CALL GP_TT_AVD;                   /*4381*/                      00001720
                                                                        00001730
    IF FEIL_MELD_NR > 0  THEN                                           00001740
       GO TO L999;                                                      00001750
    ELSE                                                                00001760
       PROGRAM_ID = 'R0014301';                                         00001770
                                                                        00001780
 /* ***************************************************************** */00001790
 /* KALL FUNKSJON SOM BEREGNER KOMPENSASJONSTILLEGG                   */00001800
 /* ***************************************************************** */00001810
    W_KT                          = F_BEREGN_KOMPENSASJONSTILLEGG(      00001820
                                     B02.PENSJONSTYPE1(SØKER_IND),      00001830
                                     B02.PENSJONSTYPE2(SØKER_IND),      00001840
                                     B02.TT_ANV(SØKER_IND),             00001850
                                     0,1,'J');                          00001860
                                                                        00001870
 /* ***************************************************************** */00001880
 /* DEN PÅFØLGENDE TESTEN SKAL UNNGÅ Å GI UTENLANDSBOENDE KOMP.       */00001890
 /* ERIK 22.12.86.                                                    */00001900
 /* ***************************************************************** */00001910
                                                                        00001920
  /*IF B02.SPESOPPL.BOSATT(SØKER_IND) > 0 THEN W_KT = 0;  */            00001930
                               /*TAR OGSÅ MED TEST PÅ TKNR 2101 */      00001940
                               /*                  TRUDE, 021090*/      00001950
    IF B02.SPESOPPL.BOSATT(SØKER_IND) > 0 !                             00001960
       B02.TKNR           (SØKER_IND) =  2101 THEN                      00001970
       W_KT = 0;                                                        00001980
                                                                        00001990
 /* ***************************************************************** */00002000
 /* PENSJON ER NÅ BEREGNET ETTER VANLIGE REGLER - PROGRAM 4326 GIR    */00002010
 /* BEREGNING MED HEL ELLER DELVIS YRKESSKADEFORDEL :                 */00002020
 /* ***************************************************************** */00002030
                                                                        00002040
        IF B02.YRKEPENS.YUG(BER_EK_IND) > 0      THEN                   00002050
              CALL BEREGN_ETTERLATT_YP;              /*4326*/           00002060
                                                                        00002070
  IF B02.GT_LOV92(BER_SØ_IND) > 0   !                                   00002080
     (B02.VIRK_DATO_ÅM(BER_SØ_IND) = 9201   &                           00002090
      B02.ETTEPENS.SPT_1291(BER_SØ_IND) > 0)      !   /* 0395 HL */     00002100
     B02.GT_LOV92(BER_EK_IND) > 0      THEN                             00002110
    DO;                                                                 00002120
       B02.GT_LOV92(BER_SØ_IND) = F_TILLEGGSPENSJON(W_FNR_EK_ÅR,        00002130
                                  35500,                                00002140
                                  B02.ETTEPENS.SPT_1291(BER_SØ_IND),    00002150
                                  B02.ETTEPENS.OPT_1291(BER_SØ_IND),    00002160
                                  B02.ETTEPENS.PÅ_1291(BER_SØ_IND),     00002170
                                  100,W_TP_PROSENT,'J');                00002180
                                                                        00002190
      IF B02.GT_LOV92(BER_SØ_IND) > B02.TP_BRUTTO(SØKER_IND)     THEN   00002200
         DO;                                                            00002210
            W_TILLEGG_LOV92       =                                     00002220
                B02.GT_LOV92(BER_SØ_IND) - B02.TP_BRUTTO(SØKER_IND);    00002230
            W_ST_FRADRAG          = B02.GT_LOV92(BER_SØ_IND);           00002240
         END;                                                           00002250
      ELSE                                                              00002260
         DO;                                                            00002270
            W_ST_FRADRAG                     = B02.TP_BRUTTO(SØKER_IND);00002280
            B02.GT_LOV92(BER_SØ_IND)         = 0;                       00002290
            B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                       00002300
            B02.GT_LOV92(BER_EK_IND)         = 0;                       00002310
            B02.GT_TILLEGG_LOV92(BER_EK_IND) = 0;                       00002320
         END;                                                           00002330
    END;                                                                00002340
  ELSE                                                                  00002350
     W_ST_FRADRAG                     = B02.TP_BRUTTO(SØKER_IND);       00002360
                                                                        00002370
    IF B02.BOSATT(BER_SØ_IND)  >  0   &     /* PENSJON UTLAND   */      00002380
      (B02.TT_16_66(SØKER_IND) = 0   &        /*NY0191*/                00002390
       B02.TT_16_66(BER_EK_IND)    = 0)  THEN     /*NY0191*/            00002400
       W_ST = F_SÆRTILLEGG_UTLAND_EP(W_ST_FRADRAG);   /*4183*/          00002410
    ELSE                                        /* TIL HIT, TRUDE */    00002420
       DO;                                                              00002430
          IF DØDSDATO_ÅMD < 930000 THEN                                 00002440
             BRUKT_TT = B02.TT_ANV(BER_SØ_IND);                         00002450
          ELSE                                                          00002460
             BRUKT_TT = B02.TT_ANV(BER_EK_IND);                         00002470
          W_ST = F_BEREGN_SÆRTILLEGG(                                   00002480
                                  W_ST_FRADRAG,0,'J',                   00002490
                                  ST_PROSENT_ENSLIG,                    00002500
                                  100,                                  00002510
                             /*   B02.TT_ANV(BER_SØ_IND));  */          00002520
                                  BRUKT_TT);                            00002530
       END;   /* ANTAR DET SKAL VÆRE END HER - 9709 HL*/                00002540
                                                                        00002550
    IF B02.FORVENTET(SØKER_IND) * 100 <=  0.5 * G THEN                  00002560
       DO;                                                              00002570
          B02.ETTEPENS.ST(SØKER_IND) = W_ST;                            00002580
          B02.ETTEPENS.KT(SØKER_IND) = W_KT;                            00002590
          B02.GP_NETTO (SØKER_IND)   = B02.GP_BRUTTO  (SØKER_IND);      00002600
          B02.TP_NETTO (SØKER_IND)   = B02.TP_BRUTTO  (SØKER_IND);      00002610
          B02.GT_TILLEGG_LOV92 (SØKER_IND)   = W_TILLEGG_LOV92;         00002620
 /*KOMP.TILLEGGET ENDRET FRA 1.5.91 ( G > 34100 ) */                    00002630
                                                                        00002640
  IF G > 34100 THEN                                                     00002650
     IF B02.ETTEPENS.KT(BER_SØ_IND) > B02.ETTEPENS.ST(BER_SØ_IND) THEN  00002660
        B02.ETTEPENS.KT(BER_SØ_IND) =                                   00002670
        B02.ETTEPENS.KT(BER_SØ_IND) - B02.ETTEPENS.ST(BER_SØ_IND);      00002680
     ELSE                                                               00002690
        B02.ETTEPENS.KT(BER_SØ_IND) = 0;                                00002700
                                                                        00002710
          B02.SUM_YTELSE(SØKER_IND)  = B02.GP_BRUTTO  (SØKER_IND) +     00002720
                                       B02.TP_BRUTTO  (SØKER_IND) +     00002730
                                       B02.ETTEPENS.ST(SØKER_IND) +     00002740
                                  B02.GT_TILLEGG_LOV92(SØKER_IND) +     00002750
                                       B02.ETTEPENS.KT(SØKER_IND) ;     00002760
       END;                                                             00002770
    ELSE                                                                00002780
       DO;                                                              00002790
          CALL JUSTER_MED_FORVENTET_INNTEKT(W_KT);                      00002800
 /*KOMP.TILLEGGET ENDRET FRA 1.5.91 ( G > 34100 ) */                    00002810
                                                                        00002820
  IF G > 34100 THEN                                                     00002830
     IF B02.ETTEPENS.KT(BER_SØ_IND) > B02.ETTEPENS.ST(BER_SØ_IND) THEN  00002840
        B02.ETTEPENS.KT(BER_SØ_IND) =                                   00002850
        B02.ETTEPENS.KT(BER_SØ_IND) - B02.ETTEPENS.ST(BER_SØ_IND);      00002860
     ELSE                                                               00002870
        B02.ETTEPENS.KT(BER_SØ_IND) = 0;                                00002880
                                                                        00002890
          B02.SUM_YTELSE(SØKER_IND) = B02.GP_NETTO   (SØKER_IND) +      00002900
                                      B02.TP_NETTO   (SØKER_IND) +      00002910
                                      B02.ETTEPENS.ST(SØKER_IND) +      00002920
                                  B02.GT_TILLEGG_LOV92(SØKER_IND) +     00002930
                                      B02.ETTEPENS.KT(SØKER_IND) ;      00002940
       END;                                                             00002950
                                                                        00002960
  HENT_FRA_EP: PROC;                                                    00002970
   %INCLUDE P0010801;  /* EP_OMRÅDET*/                                  00002980
   IF EPS.YSKADE_TILLEGG  = 'J' THEN                                    00002990
          Y_TILLEGG       = 'J';                                        00003000
   IF EPS.NORSK_BOSATT_EK = 'N'        !                                00003010
      EPS.NORSK_BOSATT    = 'N'       THEN                              00003020
      FULL_TT = 'N';                                                    00003030
   ELSE                                                                 00003040
      FULL_TT = 'J';                                                    00003050
  END HENT_FRA_EP;                                                      00003060
                                                                        00003070
  HENT_FRA_E3: PROC;                                                    00003080
   %INCLUDE P001N801;  /* E3_OMRÅDET*/                                  00003090
   IF E3S.YSKADE_TILLEGG  = 'J' THEN                                    00003100
          Y_TILLEGG       = 'J';                                        00003110
   IF E3SP.TT_KONVENSJON_ÅR > 0  THEN                                   00003120
          TRYGDETID_KONV   = E3SP.TT_KONVENSJON_ÅR;                     00003130
   IF E3S.NORSK_BOSATT_EK = 'N'        !                                00003140
      E3S.NORSK_BOSATT    = 'N'       THEN                              00003150
      FULL_TT = 'N';                                                    00003160
   ELSE                                                                 00003170
      FULL_TT = 'J';                                                    00003180
  END HENT_FRA_E3;                                                      00003190
                                                                        00003200
  HENT_FRA_EE: PROC;                                                    00003210
   %INCLUDE P001U801;  /* EE_OMRÅDET*/                                  00003220
   IF EES.YSKADE_TILLEGG  = 'J' THEN                                    00003230
          Y_TILLEGG       = 'J';                                        00003240
   IF EESP.TT_KONVENSJON_ÅR > 0  THEN                                   00003250
          TRYGDETID_KONV   = EESP.TT_KONVENSJON_ÅR;                     00003260
   IF EES.NORSK_BOSATT_EK = 'N'        !                                00003270
      EES.NORSK_BOSATT    = 'N'       THEN                              00003280
      FULL_TT = 'N';                                                    00003290
   ELSE                                                                 00003300
      FULL_TT = 'J';                                                    00003310
  END HENT_FRA_EE;                                                      00003320
                                                                        00003330
        %INCLUDE R0014128;  /* BEREGN_POENG_AÅI_AVDØD        */         00003340
        %INCLUDE R0014133;  /* F_BEREGN_SÆRTILLEGG           */         00003350
        %INCLUDE R0014134;  /* F_BEREGN_KOMPENSASJONSTILLEGG */         00003360
        %INCLUDE R0014142;  /* F_TILLEGGSPENSJON             */         00003370
        %INCLUDE R0014143;  /* POENG_TILLEGG                 */         00003380
        %INCLUDE R0014148;  /* F_TP92                        */         00003390
        %INCLUDE R0014183;  /* F_SÆRTILLEGG_UTLAND_EP        */         00003400
        %INCLUDE R0014199;  /* SPT_GARANTI_E                 */         00003410
        %INCLUDE R0014321;  /* BEREGN_GP_ETTERLATT           */         00003420
        %INCLUDE R0014323;  /* BEREGN_TP_ETTERLATT           */         00003430
        %INCLUDE R0014324;  /* JUSTER_MED_FORVENTET_INNTEKT  */         00003440
        %INCLUDE R0014326;  /* BEREGN_ETTERLATT_YP           */         00003450
        %INCLUDE R0014327;  /* UNGE_DØDE_E                   */         00003460
        %INCLUDE R0014380;  /* BEREGN_GP_ETTERLATT_UTLAND    */         00003470
        %INCLUDE R0014381;  /* GP_TT_AVD                     */         00003480
        %INCLUDE R0019905;  /* F_ALDER                       */         00003490
        %INCLUDE R0019913;  /* F_SNU_DATO                    */         00003500
                                                                        00003510
   L999:                                                                00003520
    EXEC CICS RETURN;                                                   00003530
                                                                        00003540
   END REGN_EP;                                                         00003550
