 /*       SIST ENDRET 13/12-91 12.22.12 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 17/03-87 12.49.11 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 16/01-86 14.25.21 AV   HERMAN                   */00000020
 /*       SIST ENDRET 30/11-83 15.57.50 AV   HERMAN                   */00000030
 /*       SIST ENDRET 08/11-82 11.49.59 AV   FARVIK                   */00000040
 /*       SIST ENDRET 01/10-82 13.41.30 AV   FARVIK                   */00000050
 /* ***************************************************************** */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /*    R0014146 - FAI_GRENSER - INTERN PROC I PLI.                    */00000080
 /*    PROGRAMMERER: KRISTENSEN, MAI 1982.                            */00000090
 /*    ENDRET AV KARIN I JULI                                         */00000100
 /*HENSIKT:                                                           */00000110
 /*    RUTINE FOR BEREGNING AV VED HVILKE INNTEKT PENSJONEN BØR       */00000120
 /*    REVURDERES FOR ENDRING AV APD. RUITINEN KALLES BARE OPP DERSOM */00000130
 /*    ÅTTI PROSENT-REGELEN BLIR BRUKT.                               */00000140
 /*PROGRAMTILKNYTNING:                                                */00000150
 /*    PROGRAMMET BLIR INKLUDERT I R0017031                           */00000160
 /*                                R0014101                           */00000170
 /*                                R0014201                           */00000180
 /*BRUK:                                                              */00000190
 /*    CALL FAI_GRENSER(W_APD,W_TAI,W_FAI_MAX);                       */00000200
 /* ***************************************************************** */00000210
 FAI_GRENSER: PROC(W_APD,W_TAI,W_FAI_MAX);                              00000220
                                                                        00000230
 DCL                                                                    00000240
    W_APD               FIXED DEC(7,3),                                 00000250
    W_TAI               FIXED DEC(7),                                   00000260
    W_FAI_MAX           FIXED DEC(7),                                   00000270
    ÅRSPENSJON          FIXED DEC(7);                                   00000280
                                                                        00000290
                                                                        00000300
    ÅRSPENSJON =           (B02.ALDERSP.GP (BER_SØ_IND) * 12            00000310
                         +  B02.ALDERSP.TP (BER_SØ_IND) * 12            00000320
                         +  B02.ALDERSP.ET (BER_SØ_IND) * 12            00000330
                         +  B02.ALDERSP.ST (BER_SØ_IND) * 12            00000340
                         +  B02.ALDERSP.KT (BER_SØ_IND) * 12            00000350
                         +  B02.TP_BRUTTO  (BER_SØ_IND) * 12);          00000360
                                                                        00000370
                                                                        00000380
 /* W_FAI_MAX = (0.8 * W_TAI * 1000 - ÅRSPENSJON) * 1.1;         */     00000390
                           /* MULTPL. MED 1,1 INNEBÆRER 10 % MARGIN */  00000400
                                                                        00000410
 /* ENDRET 15.1.86 - HL - FAI_MAX SKAL IKKE REGNES MED 10 % MARGIN */   00000420
 /*                       JFR. BREV FRA P1, 26.11.85, FEILRAPP 291 */   00000430
                                                                        00000440
    W_FAI_MAX = (0.8 * W_TAI * 1000 - ÅRSPENSJON);                      00000450
                                                                        00000460
 /* FORHØYNING TIL NÆRMESTE HELE HUNDRE KRONER   */                     00000470
                                                                        00000480
 W_FAI_MAX = ROUND(W_FAI_MAX + 49, -2);                                 00000490
                                                                        00000500
   /* DET SKAL SKRIVES TEKSTER OM RAPPORTERING AV ENDRET INNTEKT  */    00000510
                                                                        00000520
 END FAI_GRENSER;                                                       00000530
