 /*       SIST ENDRET 14/03-96 15.45.33 AV   HLB0310                  */00000000
 /*       SIST ENDRET 21/11-95 11.30.05 AV   JDA0310                  */00000010
 /*       SIST ENDRET 12/10-95 14.00.05 AV   JDA0310                  */00000020
 /*       SIST ENDRET 18/10-94 15.12.50 AV   JDA0310                  */00000030
 /*       SIST ENDRET 28/09-94 12.26.16 AV   JDA0310                  */00000040
 /*       SIST ENDRET 05/01-94 12.54.38 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 12/03-92 13.40.46 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 18/12-91 16.20.38 AV   HERMAN                   */00000070
 /*       SIST ENDRET 13/12-91 12.35.04 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 04/09-90 12.53.21 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 19/03-90 10.41.34 AV   HERMAN                   */00000100
 /*       SIST ENDRET 13/12-89 08.00.30 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 01/12-89 08.42.04 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 14/04-89 13.40.25 AV   HERMAN                   */00000130
 /*       SIST ENDRET 11/07-85 14.04.57 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 08/07-85 09.58.45 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 31/10-83 10.10.16 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 23/10-83 17.44.45 AV   OLAV                     */00000170
 /*       SIST ENDRET 23/10-83 15.12.26 AV   OLAV                     */00000180
 /*       SIST ENDRET 20/10-83 12.32.08 AV   OLAV                     */00000190
 /*       SIST ENDRET 19/10-83 15.42.38 AV   DYBVIK                   */00000200
  /* *************************************************************** */ 00000210
  /* IDENTIFIKASJON:   R0017033                                      */ 00000220
  /* PROGRAMMERER:  HELEN    JULI, 1982                              */ 00000230
  /* HENSIKT:                                                        */ 00000240
  /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT    */ 00000250
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */ 00000260
  /*        HVER AJOURFØRT TRANSAKSJON.                              */ 00000270
  /* PROGRAMTILKNYTNING:                                             */ 00000280
  /*        PROGRAMMET INKLUDERES I  R0017001                        */ 00000290
  /* *************************************************************** */ 00000300
  LAG_ETTERLATT_HEND:                                                   00000310
      PROC(IND);                                                        00000320
                                                                        00000330
    EXEC CICS ADDRESS EIB(DFHEIPTR);                                    00000340
                                                                        00000350
    DCL   IND             FIXED BIN (15);                               00000360
    DCL   AVD_IND         FIXED BIN (15);                               00000370
                                                                        00000380
  /* *************************************************************** */ 00000390
  /* PROGRAMMET BEGYNNER HER.                                        */ 00000400
  /* VI FINNER AVDØDES INDEKS OG BLANKER W_HENDELSE.                 */ 00000410
  /* *************************************************************** */ 00000420
                                                                        00000430
    IF  IND = 1 THEN                                                    00000440
        AVD_IND = 2;                                                    00000450
    ELSE                                                                00000460
        AVD_IND = 1;                                                    00000470
    W_HENDELSE              =    '';                                    00000480
    OMR_DATO                = F_SNU_DATO(TRANS_OPPL_OMR.VIRKNINGSDATO); 00000490
                                                                        00000500
    IF TRANS_OPPL_OMR.TRANSTYPE = 27 THEN                               00000510
                                                                        00000520
       DO;                                                              00000530
          HENDDATO  =  OMR_DATO;                                        00000540
       END;                                                             00000550
                                                                        00000560
    ELSE                                                                00000570
                                                                        00000580
       DO;                                                              00000590
          IF DIV_PERIODE.INTENDR_ÅM > 0   THEN                          00000600
             HENDDATO    = DIV_PERIODE.INTENDR_ÅM;                      00000610
          ELSE                                                          00000620
             DO;                                                        00000630
                R_HENDDATO_D =  B02.PERSON.STATUS.VIRK_DATO_ÅM(IND);    00000640
                HENDDATO     =  R_HENDDATO.AAR !!R_HENDDATO.MND;        00000650
             END;                                                       00000660
       END;                                                             00000670
                                                                        00000680
    W_HENDELSE.FNR_EKTEF  =    B02.PERSON.RF0PERSN.FNR(AVD_IND);        00000690
    W_HENDELSE.NAVN_EKTEF =    B02.PERSON.RF0PERSN.NAVN(AVD_IND);       00000700
    W_HENDELSE.VERSJON    =    W_ROT.NESTE_SB_VERSJON_NR;               00000710
    W_HENDELSE.TERMINAL   =    EIBTRMID;                                00000720
    W_HENDELSE.PENSJONSTYPE1 = B02.STATUS.PENSJONSTYPE1(IND);           00000730
    W_HENDELSE.PENSJONSTYPE2 = B02.STATUS.PENSJONSTYPE2(IND);           00000740
    W_HENDELSE.PENSJONSTYPE3 = B02.STATUS.PENSJONSTYPE3(IND);           00000750
    W_HENDELSE.GP_BRUTTO     = B02.PERSON.ETTEPENS.GP_BRUTTO(IND);      00000760
    W_HENDELSE.GP_NETTO      = B02.PERSON.ETTEPENS.GP_NETTO(IND);       00000770
    W_HENDELSE.TP_BRUTTO     = B02.PERSON.ETTEPENS.TP_BRUTTO(IND);      00000780
    W_HENDELSE.TP_NETTO      = B02.PERSON.ETTEPENS.TP_NETTO(IND);       00000790
 /*YS*/   IF B02.STATUS.SIVILSTAND(IND) ^= 'S' THEN                     00000800
       W_HENDELSE.TP_PROSENT     = 55;                                  00000810
    ELSE                                                                00000820
       W_HENDELSE.TP_PROSENT     = B02.ETTEPENS.TP_PROSENT(IND);        00000830
    W_HENDELSE.FORVENTET_INNTEKT = B02.ETTEPENS.FORVENTET(IND);         00000840
    R_FRAMDATO_D                 = B02.FRAMLEGGSDATO_ÅM(IND);           00000850
    W_HENDELSE.FRAMLEGGS_DATO    = R_FRAMDATO.MND !!R_FRAMDATO.AAR;     00000860
    W_HENDELSE.FRAMLEGGS_KODE    = B02.FRAMLEGGSKODE(IND);              00000870
    W_HENDELSE.ST                = B02.ETTEPENS.ST(IND);                00000880
    W_HENDELSE.KT                = B02.ETTEPENS.KT(IND);                00000890
                                                                        00000900
 /* FOR DØDSFALL I 93 OG SENERE ER DET AVDØDES TT SOM SKAL BRUKES :*/   00000910
 /* FOR Å LETTE TESTENE LEGGES NÅ DEN HØYESTE AV TRYGDETIDENE      */   00000920
 /* INN I W_HENDELSE.TT */                                              00000930
                                                                        00000940
    IF    B02.STATUS.TT_ANV(IND) > B02.STATUS.TT_ANV(AVD_IND) THEN      00000950
       W_HENDELSE.TT             = B02.STATUS.TT_ANV(IND);              00000960
    ELSE                                                                00000970
       W_HENDELSE.TT             = B02.STATUS.TT_ANV(AVD_IND);          00000980
 /* HIT HL 1195*/                                                       00000990
                                                                        00001000
    W_HENDELSE.TT_EK             = B02.STATUS.TT_ANV(AVD_IND);          00001010
    W_HENDELSE.SIVILSTAND_EK     = B02.STATUS.SIVILSTAND(AVD_IND);      00001020
    W_HENDELSE.BOSATT            = B02.BOSATT    (IND);/*JD 8.90*/      00001030
    W_HENDELSE.DØD_AV_YSKADE     = B02.DØD_AV_YRKESSKADE(IND);  /*YS*/  00001040
                                                                        00001050
 /* IF DIV_PARAM_OMR.BEREGNINGS_ALT_AVD = '3' THEN  */                  00001060
    IF B02.YRKEPENS.YUG(AVD_IND) > 0 THEN                               00001070
       DO;                                                              00001080
         W_HENDELSE.YRKE_UFG_AVD =  B02.YRKEPENS.YUG(AVD_IND);/*YS*/    00001090
         W_HENDELSE.YRKE_KODE_AVD = B02.YRKEPENS.YPT_KODE(AVD_IND);     00001100
                                                                        00001110
         IF B02.YRKEPENS.YPT(AVD_IND) < B02.YRKE_POENG_1291(AVD_IND)    00001120
            THEN                                                        00001130
            W_HENDELSE.YRKE_YPT_AVD  = B02.YRKE_POENG_1291(AVD_IND);    00001140
         ELSE                                                           00001150
            W_HENDELSE.YRKE_YPT_AVD  = B02.YRKEPENS.YPT(AVD_IND);       00001160
                                                                        00001170
  /*     W_HENDELSE.YRKE_YPT_AVD  = B02.YRKEPENS.YPT(AVD_IND);     */   00001180
         W_HENDELSE.YRKE_SPT_AVD  = B02.YRKEPENS.SPT(AVD_IND); /*YS*/   00001190
  /*L92*/W_HENDELSE.YRKE_PÅ_ETTER91_AVD =                               00001200
                B02.YRKEPENS.PÅ_ETTER91(AVD_IND);                       00001210
       END;                                                             00001220
                                                                        00001230
 /*TILLEGG 14.3.90 HL : */                                              00001240
                                                                        00001250
    W_HENDELSE.FULLT_SÆRTILLEGG =                                       00001260
              DIV_PARAM_OMR.FULLT_SÆRTILLEGG(IND)     ;                 00001270
                                                                        00001280
  /* *************************************************************** */ 00001290
  /* FØLGENDE FELT HENTES FRA YRKESSKADEHISTORIKKK                   */ 00001300
  /* *************************************************************** */ 00001310
                                                                        00001320
  IF       B02.YRKEHIST.YUFT_ÅM(AVD_IND,1) > 0     THEN         /*YS*/  00001330
     DO;                                                        /*YS*/  00001340
                                                                        00001350
        DCL M                 FIXED BIN(15) INIT (0);           /*YS*/  00001360
                                                                /*YS*/  00001370
        /* FINNE SISTE YUFT  */                                 /*YS*/  00001380
        DO M = 5 TO 1 BY -1  UNTIL (B02.YRKEHIST.YUFT_ÅM        /*YS*/  00001390
                                             (AVD_IND,M) > 0);  /*YS*/  00001400
        END;                                                    /*YS*/  00001410
        W_HENDELSE.YRKE_YUFT_ÅM_AVD =                           /*YS*/  00001420
                                B02.YRKEHIST.YUFT_ÅM(AVD_IND,M);/*YS*/  00001430
        W_HENDELSE.YRKE_YST_ÅM_AVD  =                           /*YS*/  00001440
                                B02.YRKEHIST.YST_ÅM (AVD_IND,M);/*YS*/  00001450
        IF B02.YRKEHIST.AÅI (AVD_IND,M) = 9999999 THEN          /*YS*/  00001460
           W_HENDELSE.YRKE_AÅI_AVD         = 0;                 /*YS*/  00001470
        ELSE                                                    /*YS*/  00001480
           W_HENDELSE.YRKE_AÅI_AVD  =                           /*YS*/  00001490
                                B02.YRKEHIST.AÅI (AVD_IND,M);   /*YS*/  00001500
        W_HENDELSE.YRKE_YRKE11_AVD  =                           /*YS*/  00001510
                                B02.YRKEHIST.YRKE11 (AVD_IND,M);/*YS*/  00001520
        W_HENDELSE.YRKE_PAÅ_AVD     =                           /*YS*/  00001530
                                B02.YRKEHIST.PAÅ   (AVD_IND,M); /*YS*/  00001540
     END;                                                       /*YS*/  00001550
                                                                        00001560
                                                                        00001570
  /* *************************************************************** */ 00001580
  /* NY LOV 0192     JD 11.91                                        */ 00001590
  /* *************************************************************** */ 00001600
                                                                        00001610
    W_HENDELSE.GT_LOV92    =  B02.STATUS.GT_LOV92(IND);                 00001620
    W_HENDELSE.GT_TILLEGG_LOV92 = B02.STATUS.GT_TILLEGG_LOV92(IND);     00001630
    W_HENDELSE.GARANTI_DATO_ÅM  = B02.STATUS.GARANTI_DATO_ÅM(IND);      00001640
    W_HENDELSE.SPT_1291_EK      = B02.ETTEPENS.SPT_1291     (IND);      00001650
    W_HENDELSE.OPT_1291_EK      = B02.ETTEPENS.OPT_1291     (IND);      00001660
    W_HENDELSE.PÅ_1291_EK      = B02.ETTEPENS.PÅ_1291     (IND);        00001670
    W_HENDELSE.PÅ_ETTER91_EK   = B02.ETTEPENS.PÅ_ETTER91  (IND);        00001680
    W_HENDELSE.YRKE_PÅ_ETTER91 = B02.YRKEPENS.PÅ_ETTER91  (IND);        00001690
    W_HENDELSE.YRKE_POENG_1291 = B02.YRKEPENS.YRKE_POENG_1291(IND);     00001700
             /* HIT JD 1191 */                                          00001710
    W_HENDELSE.PÅ_EK             = B02.ETTEPENS.PÅ_AVD  (IND);          00001720
    W_HENDELSE.OPT_EK            = B02.ETTEPENS.OPT_AVD (IND);          00001730
    W_HENDELSE.SPT_EK            = B02.ETTEPENS.SPT_AVD (IND);          00001740
                                                                        00001750
  /* *************************************************************** */ 00001760
  /* FØLGENDE FELT HENTES FRA EØS-INFO  (HL AUG 95                   */ 00001770
  /* *************************************************************** */ 00001780
                                                                        00001790
    W_HENDELSE.TT_PRORATA_MND = B02.TT_PRO_RATA_MND(AVD_IND);           00001800
    W_HENDELSE.TT_TEORETISK_EØS_MND =                                   00001810
                                B02.TT_TEORETISK_EØS_MND(AVD_IND);      00001820
                                                                        00001830
    W_HENDELSE.SPT_EØS                     =                            00001840
                                B02.SPT_EØS(AVD_IND);                   00001850
    W_HENDELSE.OPT_EØS                     =                            00001860
                        B02.OPT_EØS(AVD_IND);                           00001870
                                                                        00001880
    W_HENDELSE.ALTERNATIV_GP       = B02.ALTERNATIV_GP(AVD_IND);        00001890
    W_HENDELSE.ALTERNATIV_TP       = B02.ALTERNATIV_TP(AVD_IND);        00001900
    W_HENDELSE.ALTERNATIV_ST       = B02.ALTERNATIV_ST(AVD_IND);        00001910
    W_HENDELSE.ALTERNATIV_ET       = B02.ALTERNATIV_ET(AVD_IND);        00001920
    W_HENDELSE.ALTERNATIV_BT       = B02.ALTERNATIV_BT(AVD_IND);        00001930
    W_HENDELSE.ALTERNATIV_SUM_PENSJON =                                 00001940
                            B02.ALTERNATIV_SUM_PENSJON(AVD_IND);        00001950
    W_HENDELSE.ANTALL_NORSKE_PÅ     = B02.ANTALL_NORSKE_PÅ(AVD_IND);    00001960
    W_HENDELSE.ANTALL_NORSKE_PÅ_ETTER91 =                               00001970
                            B02.ANTALL_NORSKE_PÅ_ETTER91(AVD_IND);      00001980
    W_HENDELSE.PRO_RATA_BEREGNING   = B02.PRO_RATA_BEREGNING(AVD_IND);  00001990
    W_HENDELSE.BEREGN_FOLKETRYGD    = B02.BEREGN_FOLKETRYGD(AVD_IND);   00002000
    W_HENDELSE.TEORETISK_BELØP_GP   = DIV_PARAM_OMR.TEORETISK_BELØP_GP; 00002010
    W_HENDELSE.TEORETISK_BELØP_TP   = DIV_PARAM_OMR.TEORETISK_BELØP_TP; 00002020
    W_HENDELSE.EØS_8_4_3A           = B02.EØS_8_4_3A(AVD_IND);          00002030
    W_HENDELSE.PÅ_EØS_FAKTISK   = DIV_PARAM_OMR.PÅ_EØS_FAKTISK(AVD_IND);00002040
  W_HENDELSE.PÅ_NORSK_FAKTISK = DIV_PARAM_OMR.PÅ_NORSK_FAKTISK(AVD_IND);00002050
    W_HENDELSE.TT_NORSK_FAKTISK     = DIV_PARAM_OMR.TT_NORSK_FAKTISK;   00002060
    W_HENDELSE.TT_SUM_FAKTISK     = DIV_PARAM_OMR.TT_SUM_FAKTISK;       00002070
    W_HENDELSE.TT_TEORETISK       = DIV_PARAM_OMR.TT_TEORETISK;         00002080
        /* EØS-INFO TIL HIT HL AUG 95  */                               00002090
                                                                        00002100
  /* *************************************************************** */ 00002110
  /* FØLGENDE FELT HENTES FRA P0014009                               */ 00002120
  /* *************************************************************** */ 00002130
                                                                        00002140
    W_HENDELSE.ÅR_BUP_FPP_EK = POREKKE.BUP_FPP_ÅR(AVD_IND);             00002150
                                                                        00002160
    CALL PLASSER_TEKST(IND,AVD_IND);                                    00002170
                                                                        00002180
 /* **************************************************************** */ 00002190
 /* HENDELSE SEGMENT SKRIVES UT.                                     */ 00002200
 /* **************************************************************** */ 00002210
                                                                        00002220
    CALL INSERT_HENDELSE;                                               00002230
                                                                        00002240
                                                                        00002250
  /* *************************************************************** */ 00002260
  /*   DERSOM AVDØDES SLUTTPOENGTALL ER HØYERE ENN 0 SKAL DET BYGGES */ 00002270
  /*   BEREGNINGSGRUNNLAGSEGMENT FOR AVDØD                           */ 00002280
  /* *************************************************************** */ 00002290
                                                                        00002300
    IF (B02.PENSJONSTYPE1(IND) = 'E' &                                  00002310
        B02.PENSJONSTYPE1(AVD_IND) = 'D' ) !                            00002320
       (W_HENDELSE.SPT_EK  > 0 ! W_HENDELSE.OPT_EK > 0) THEN            00002330
        DO;                                                             00002340
           CALL BYGG_OPP_BERGRUNL_SEGMENT_DØD(AVD_IND);                 00002350
        END;                                                            00002360
                                                                        00002370
                                                                        00002380
  END  LAG_ETTERLATT_HEND;                                              00002390
