 /*       SIST ENDRET 10/08-98 12.26.35 AV   JDA7339                  */00000000
 /*       SIST ENDRET 10/08-98 12.21.50 AV   JDA7339                  */00000010
 /*       SIST ENDRET 15/07-98 11.17.31 AV   JDA7339                  */00000020
 /*       SIST ENDRET 15/07-98 11.14.23 AV   JDA7339                  */00000030
 /*       SIST ENDRET 20/04-98 09.15.59 AV   JDA7339                  */00000040
 /*       SIST ENDRET 20/04-98 09.12.27 AV   JDA7339                  */00000050
 /*       SIST ENDRET 14/04-98 10.36.01 AV   JDA7339                  */00000060
 /*       SIST ENDRET 14/04-98 10.34.18 AV   JDA7339                  */00000070
 /*       SIST ENDRET 31/03-98 14.26.20 AV   JDA7339                  */00000080
 /*       SIST ENDRET 31/03-98 14.25.09 AV   JDA7339                  */00000090
 /*       SIST ENDRET 28/01-98 15.14.06 AV   JDA7339                  */00000100
 /*       SIST ENDRET 28/01-98 15.12.14 AV   JDA7339                  */00000110
 /*       SIST ENDRET 26/01-98 08.46.50 AV   HLA7339                  */00000120
 /*       SIST ENDRET 10/02-97 14.22.14 AV   JDA7339                  */00000130
 /*       SIST ENDRET 14/08-96 11.29.57 AV   JDA0310                  */00000140
 /*       SIST ENDRET 23/07-96 14.16.47 AV   HLB0310                  */00000150
 /*       SIST ENDRET 17/06-96 14.21.29 AV   TSB0310                  */00000160
 /*       SIST ENDRET 15/03-95 12.31.46 AV   HLB0310                  */00000170
 /*       SIST ENDRET 24/05-94 14.22.23 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 06/04-94 14.54.20 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 31/03-92 13.29.24 AV   HERMAN                   */00000200
 /*       SIST ENDRET 13/12-91 12.23.31 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 05/09-85 11.11.45 AV   HERMAN                   */00000220
 /*       SIST ENDRET 03/02-83 14.09.42 AV   OLAV                     */00000230
 /*       SIST ENDRET 16/11-82 12.49.11 AV   FARVIK                   */00000240
 /*       SIST ENDRET 12/11-82 08.17.20 AV   FARVIK                   */00000250
 /*       SIST ENDRET 11/11-82 11.45.50 AV   FARVIK                   */00000260
 /*       SIST ENDRET 10/11-82 07.31.52 AV   FARVIK                   */00000270
 /*       SIST ENDRET 18/10-82 14.08.42 AV   OLAV                     */00000280
 /*       SIST ENDRET 18/10-82 09.18.57 AV   FARVIK                   */00000290
 /*       SIST ENDRET 01/10-82 13.33.12 AV   FARVIK                   */00000300
 /*                                                                   */00000310
 /*IDENTIFIKASJON:                                                    */00000320
 /*    R0014171 - SUBRUTINE I PLI                                     */00000330
 /*    PROGRAMMERER: PER F. BERGESTAD, JUNI 1982                      */00000340
 /*HENSIKT:                                                           */00000350
 /*    RUTINEN REGNER UT BUP/FPP.                                     */00000360
 /*BRUK   :                                                           */00000370
 /*    CALL REGN_BUP_FPP(INNT_START_ÅR,IND);                          */00000380
 /*ENDRET I FORB MED NY LOV I 1992 - HL                               */00000390
 /*                                                                   */00000400
 /*                                                                   */00000410
 /* ***************************************************************** */00000420
  REGN_BUP_FPP:                                                         00000430
    PROC(INNT_START_ÅR,INDEKS);                                         00000440
 %SKIP(2);                                                              00000450
    DCL                                                                 00000460
       SUM                      BUILTIN,                                00000470
       K                        FIXED BIN(15)  INIT(0),                 00000480
       L                        FIXED BIN(15)  INIT(0),                 00000490
       I                        FIXED BIN(15)  INIT(0),                 00000500
       J                        FIXED BIN(15)  INIT(0),                 00000510
       M                        FIXED BIN(15)  INIT(0);                 00000520
    DCL                                                                 00000530
       INNT_START_ÅR                 PIC'999',                          00000540
       TIDLIGSTE_ÅR                 PIC'999',            /*5.9.85*/     00000550
       SLUTT_ÅR                 PIC'999'        INIT(0),                00000560
       ANTALL_ÅR                PIC'999'        INIT(0);                00000570
    DCL                                                                 00000580
       MAX                      BUILTIN;                                00000590
                                                                        00000600
    DCL HALVPARTEN               PIC'999'        INIT(0);               00000610
    DCL OMSBUP                  FIXED DEC(3,2) INIT(0);                 00000620
    DCL ST_ÅR  PIC '99' INIT (0);                                       00000630
    DCL SL_ÅR  PIC '99' INIT (0);                                       00000640
                                                                        00000650
                                                                        00000660
    DCL                                                                 00000670
       INDEKS                   FIXED BIN(15);                          00000680
    DCL                                                                 00000690
       POENG_TAB(63:150)        FIXED DEC(5,3);                         00000700
    DCL                                                                 00000710
       STØRSTE_POENG(20)        FIXED DEC(5,3);                         00000720
    DCL                                                                 00000730
       POENG_SISTE_3ÅR          FIXED DEC(5,3) INIT(0),                 00000740
       POENG_HALVPARTEN         FIXED DEC(5,3) INIT(0);                 00000750
    DCL                                                                 00000760
       RUNDING                  FIXED DEC(5,3) INIT(0.005);             00000770
    DCL RESULTAT                FIXED DEC(3,2) INIT(0);        /*HL*/   00000780
                                                                        00000790
   /*-----DCL AV FELTER FOR BEREGNING AV BUP VED OMSORGSPOENG  */       00000800
                                                                        00000810
  DCL  W1_RESULTAT        FIXED DEC(3,2) INIT (0);                      00000820
  DCL  W_RESULTAT_TRE     FIXED DEC(3,2) INIT (0);                      00000830
  DCL  W_RESULTAT_20      FIXED DEC(3,2) INIT (0);                      00000840
  DCL  T_POENG_TAB(63:150)  FIXED DEC(5,3);                             00000850
  DCL  V_POENG_TAB(63:150)  FIXED DEC(5,3);                             00000860
  DCL  O_POENG_TAB(63:150)  FIXED DEC(5,3);                             00000870
  DCL  X_POENG_TAB(63:150)  FIXED DEC(5,3);                             00000880
  DCL  W_POENG_TAB(63:150)  FIXED DEC(5,3);                             00000890
  DCL  Z_POENG_TAB(63:150)  FIXED DEC(5,3);                             00000900
  DCL  ZZZ                  FIXED DEC(5,3);                             00000910
                                                                        00000920
  DCL A                  FIXED DEC (3) INIT (0);                        00000930
  DCL B                  FIXED DEC (3) INIT (0);                        00000940
  DCL C                  FIXED DEC (3) INIT (0);                        00000950
  DCL X                  FIXED DEC (3) INIT (0);                        00000960
  DCL IX                 FIXED DEC (3) INIT (0);                        00000970
  DCL N                  FIXED DEC (3) INIT (0);                        00000980
  DCL T                  FIXED DEC (3) INIT (0);                        00000990
  DCL Z                  FIXED DEC (3) INIT (0);                        00001000
  DCL S                  FIXED DEC (3) INIT (1);                        00001010
  DCL JJ                 FIXED DEC (3) INIT (0);                        00001020
  DCL TELL_OMSÅR         FIXED DEC (3) INIT (0);                        00001030
                                                                        00001040
    DCL VANLIG_ÅR(3) PIC '99' INIT (0);                                 00001050
    DCL VANLIG_PP(3)  PIC '9.99' INIT (0);                              00001060
    DCL VANLIG_SNITT  PIC '9.99' INIT (0);                              00001070
    DCL VANLIG        FIXED DEC (5,3) INIT (0);                         00001080
    DCL PI_BUP        FIXED DEC (5,3) INIT (0);                         00001090
    DCL PI_BUP_SNITT  FIXED DEC (5,3) INIT (0);                         00001100
    DCL HJELP1             FIXED DEC (5,3)INIT (0);                     00001110
    DCL HJELP2             FIXED DEC (5,3)  INIT (0);                   00001120
    DCL HJELP3             FIXED DEC (5,3)  INIT (0);                   00001130
    DCL HJELP4             FIXED DEC (5,3)  INIT (0);                   00001140
    DCL SNITT_BLANDET      FIXED DEC (5,3) INIT (0);                    00001150
    DCL TRE_BESTE_OMS      FIXED DEC (5,3) INIT (0);                    00001160
    DCL TRE_OMS_SNITT      FIXED DEC (5,3) INIT (0);                    00001170
    DCL HJELP_POENG_ALLE   FIXED DEC (5,3) INIT (0);                    00001180
    DCL W_BUP              FIXED DEC (5,3) INIT (0);                    00001190
    DCL BUP_MED_OMS        FIXED DEC (5,3) INIT (0);                    00001200
    DCL TABELL_SLUTT_ÅR    FIXED DEC (3)   INIT (0);                    00001210
    DCL SLUTT_OMS_TRE      FIXED DEC (3)   INIT (0);                    00001220
    DCL W_TABELL_SLUTT_ÅR  FIXED DEC (3)   INIT (0);                    00001230
    DCL TRE_SISTE_O          FIXED DEC (3) INIT (0);                    00001240
    DCL LAVESTE_OMS_ÅR       FIXED DEC (3) INIT (0);                    00001250
    DCL Y_PI_POENG(40)       FIXED DEC (5,3);                           00001260
    DCL X_STØRSTE_P(40)      FIXED DEC (5,3);                           00001270
    DCL W_STØRSTE_P(40)          FIXED DEC (5,3);                       00001280
    DCL W_STØRSTE_POENG(20)      FIXED DEC (5,3);                       00001290
                                                                        00001300
    DCL  W_ANTALL_ÅR           FIXED DEC (3) INIT (0);                  00001310
    DCL  OMS_ÅR_PI             FIXED DEC (3) INIT (0);                  00001320
    DCL  OMSÅR_HALVPARTEN(20)  FIXED DEC (5,3);                         00001330
    DCL  BESTE_HALVPARTEN      FIXED DEC (5,3) INIT (0);                00001340
    DCL STØRSTE_POENG_ALLE   (3)   FIXED DEC (5,3) INIT (0);            00001350
    DCL W_OMSÅR_HALVPARTEN(20) FIXED DEC (5,3)  INIT(0);                00001360
    DCL ANTALL_ÅR_BO       PIC '99' INIT (0);                           00001370
                                                                        00001380
   /*-----DCL AV FELTER FOR BEREGNING AV BUP VED OMSORGSPOENG  HIT */   00001390
                                                                        00001400
 %PAGE;                                                                 00001410
    PROGRAM_ID = 'R0014171';                                            00001420
                                                                        00001430
    POENG_TAB(*) = 0;           /*HL 0796*/                             00001440
    O_POENG_TAB(*) = 0;                                                 00001450
                                                                        00001460
 /* ENDRING 5.9.85 HL - SE FEILRAPPORT 234 -                  */        00001470
                                                                        00001480
    IF INNT_START_ÅR < 67            THEN                               00001490
                                                                        00001500
       DO;                                                              00001510
                                                                        00001520
          TIDLIGSTE_ÅR = INDEKS - 4;                                    00001530
          IF TIDLIGSTE_ÅR > 67       THEN                               00001540
             TIDLIGSTE_ÅR = 67;                                         00001550
                                                                        00001560
          IF INNT_START_ÅR < TIDLIGSTE_ÅR       THEN                    00001570
             INNT_START_ÅR = TIDLIGSTE_ÅR;                              00001580
                                                                        00001590
       END;                                                             00001600
                                                                        00001610
  SLUTT_ÅR = INDEKS - 1;                                                00001620
       IF VIRK_LOV92_ÅM < 9200        THEN                              00001630
     DO;                                                                00001640
        DO I = INNT_START_ÅR TO SLUTT_ÅR;                               00001650
           POENG_TAB(I) = TAB.POENG_ANVENDT(I);                         00001660
           O_POENG_TAB(I) = TAB.POENG_ANVENDT(I);                       00001670
        END;                                                            00001680
        CALL UTREGNING;                                                 00001690
        TAB.BUP_FPP(INDEKS) = RESULTAT;                                 00001700
        BUP_FPP92(INDEKS)   = RESULTAT;         /*9807*/                00001710
     END;                                                               00001720
  ELSE                                                                  00001730
     IF INDEKS < 92               THEN                                  00001740
     DO;                                                                00001750
        DO I = INNT_START_ÅR TO SLUTT_ÅR;                               00001760
           POENG_TAB(I) = TAB.POENG_ANVENDT(I);                         00001770
           O_POENG_TAB(I) = TAB.POENG_ANVENDT(I);                       00001780
        END;                                                            00001790
        CALL UTREGNING;                                                 00001800
        TAB.BUP_FPP(INDEKS) = RESULTAT;                                 00001810
        IF RESULTAT > 5.00          THEN                                00001820
           DO;                                                          00001830
              DO I = INNT_START_ÅR TO SLUTT_ÅR;                         00001840
                 POENG_TAB(I) = TAB.POENG_ANVENDT_LOV92(I);             00001850
                 O_POENG_TAB(I) = TAB.POENG_ANVENDT_LOV92(I);           00001860
              END;                                                      00001870
              CALL UTREGNING;                                           00001880
              IF RESULTAT > 5.00       THEN                             00001890
                 BUP_FPP92(INDEKS) = RESULTAT;      /*9807*/            00001900
              ELSE                                                      00001910
                 BUP_FPP92(INDEKS) = 5.00;             /*9807*/         00001920
           END;                                                         00001930
        ELSE                                                            00001940
           BUP_FPP92(INDEKS) = RESULTAT;            /*9807*/            00001950
     END;                                                               00001960
  ELSE                                                                  00001970
     DO;                                                                00001980
        DO I = INNT_START_ÅR TO SLUTT_ÅR;                               00001990
   /*      IF I < UNG_UFØR_START_ÅR      THEN                           00002000
              TAB.POENG_ANVENDT_LOV92(I) =                              00002010
              TAB.INNT_POENG_LOV92(I) + 0.005;      9807*/              00002020
           POENG_TAB(I) = TAB.POENG_ANVENDT_LOV92(I);                   00002030
           O_POENG_TAB(I) = TAB.POENG_ANVENDT_LOV92(I);                 00002040
        END;                                                            00002050
        CALL UTREGNING;                                                 00002060
        TAB.BUP_FPP(INDEKS) = RESULTAT;                                 00002070
        BUP_FPP92(INDEKS)   = RESULTAT;              /*9807*/           00002080
     END;                                                               00002090
 IF TAB.UFØR_PERIODE (INDEKS) ^= 'D'          THEN                      00002100
    BUP92_UFØR = BUP_FPP92(INDEKS);                   /*9807*/          00002110
                                                                        00002120
 UTREGNING : PROC;                                                      00002130
                                                                        00002140
  ANTALL_ÅR  = SLUTT_ÅR - INNT_START_ÅR + 1;                            00002150
  HALVPARTEN = (ANTALL_ÅR / 2) + 0.5;                                   00002160
  IF HALVPARTEN > 20 THEN                                               00002170
     HALVPARTEN = 20;                                                   00002180
  IF ANTALL_ÅR > 6 THEN                                                 00002190
 /*                                                                   */00002200
 /*  REGNER UT GJ.SNITTSPOENGET FOR DE 3 SISTE ÅRENE                  */00002210
 /*                                                                   */00002220
     POENG_SISTE_3ÅR = (POENG_TAB(SLUTT_ÅR - 2) +                       00002230
                        POENG_TAB(SLUTT_ÅR - 1) +                       00002240
                        POENG_TAB(SLUTT_ÅR)) / 3 + RUNDING;             00002250
                                                                        00002260
     DCL  POENG1 FIXED DEC (3,2) INIT (0);                              00002270
     DCL  POENG2 FIXED DEC (3,2) INIT (0);                              00002280
     DCL  POENG3 FIXED DEC (3,2) INIT (0);                              00002290
     DCL  TS_PO  FIXED DEC (3,2) INIT (0);                              00002300
     POENG1          =  POENG_TAB(SLUTT_ÅR - 2);                        00002310
     POENG2          =  POENG_TAB(SLUTT_ÅR - 1);                        00002320
     POENG3          =  POENG_TAB(SLUTT_ÅR );                           00002330
                                                                        00002340
                                                                        00002350
  STØRSTE_POENG = 0;                                                    00002360
  DO I = 1 TO HALVPARTEN;                                               00002370
 /*                                                                   */00002380
 /*  PLUKKER UT HALVPARTEN AV DE BESTE POENGENE                       */00002390
 /*                                                                   */00002400
     DO J = INNT_START_ÅR TO SLUTT_ÅR;                                  00002410
        IF POENG_TAB(J) > STØRSTE_POENG(I) THEN                         00002420
           DO;                                                          00002430
              STØRSTE_POENG(I) = POENG_TAB(J);                          00002440
              K = J;                                                    00002450
           END;                                                         00002460
     END;                                                               00002470
     TS_PO = POENG_TAB(K);                                              00002480
     POENG_TAB(K) = 0;                                                  00002490
  END;                                                                  00002500
                                                                        00002510
  POENG_HALVPARTEN = SUM(STØRSTE_POENG) / HALVPARTEN + RUNDING;         00002520
                                                                        00002530
  IF POENG_HALVPARTEN > POENG_SISTE_3ÅR THEN                            00002540
 /*                                                                   */00002550
 /*  GJENNOMSNITTSPOENGET FOR HALVPARTEN AV ÅRENE ER BEST             */00002560
 /*                                                                   */00002570
     RESULTAT     = POENG_HALVPARTEN;                                   00002580
  ELSE                                                                  00002590
 /*                                                                   */00002600
 /*  GJENNOMSNITTSPOENGET FOR DE 3 SISTE ÅRENE ER BEST                */00002610
 /*                                                                   */00002620
     RESULTAT     = POENG_SISTE_3ÅR;                                    00002630
                                                                        00002640
  /* ER DET OMSORGPOENG FOR SMÅ BARN ? */                               00002650
                                                                        00002660
  DCL B01KODE  CHAR(1) INIT(' ');                                       00002670
  DCL B02KODE  CHAR(1) INIT(' ');                                       00002680
  DCL INDKODE  FIXED DEC (3) INIT(0);                                   00002690
  DCL INT_KODE  CHAR (1) INIT(' ');                                     00002700
  INDKODE = IND;                                                        00002710
                                                                        00002720
 /*REGLENE GJELDER ALLE TYPER OMSORGSPOENG - IKKE BARE FOR BARN*/       00002730
 /*PROGRAMMET OMARBEIDET I NOV 97 HL*/                                  00002740
                                                                        00002750
  DO  M = SLUTT_ÅR TO 92 BY -1;                                         00002760
    IF  B01.PI_KODE(IND,M) = 'J'  !                                     00002770
        B01.PI_KODE(IND,M) = 'K'  !                                     00002780
        B01.PI_KODE(IND,M) = 'L'  THEN                                  00002790
      DO;                                                               00002800
        TAB.OMSORG_KODE (M) = 'J';                                      00002810
        INT_KODE = 'J';                                                 00002820
      END;                                                              00002830
  END;                                                                  00002840
                                                                        00002850
  IF  INT_KODE = 'J'  THEN                                              00002860
        CALL REGN_OMS;                                                  00002870
                                                                        00002880
  IF  W1_RESULTAT > RESULTAT  THEN                                      00002890
      RESULTAT    =  W1_RESULTAT;                                       00002900
                                                                        00002910
 END UTREGNING;                                                         00002920
                                                                        00002930
   /*------------------------------------------------------*/           00002940
 REGN_OMS : PROC;   /* BEREGNING AV BUP MED OMSORGSPOENG */             00002950
                                                                        00002960
                                                                        00002970
                                                                        00002980
  /* VI MÅ UNDERSØKE OM FOREGÅENDE ÅR ER OMSORGSÅR        */            00002990
  /* DERSOM DETTE ER SANT,MÅ VI GÅ LENGER TILBAKE         */            00003000
  /* ELLERS ER SLUTT ÅR SATT. BEHØVER IKKE ????           */            00003010
  /* PGA TEST TIDLIGERE. OMSÅR I TRE SISTE ÅR  ????       */            00003020
                                                                        00003030
   DO  I = 1 TO 40;                                                     00003040
       Y_PI_POENG(I)  = 0;                                              00003050
       W_STØRSTE_P(I) = 0;                                              00003060
   END;                                                                 00003070
                                                                        00003080
   DO  I = INNT_START_ÅR TO SLUTT_ÅR;                                   00003090
       IF   TAB.OMSORG_KODE(I)  ^= 'J'  THEN    /*HL*/                  00003100
         DO;                                                            00003110
            W_ANTALL_ÅR  = W_ANTALL_ÅR + 1;                             00003120
         END;                                                           00003130
   END;                                                                 00003140
   DCL SÅR  FIXED DEC (3) INIT (0);                                     00003150
   SÅR = SLUTT_ÅR;                                                      00003160
   SÅR = INNT_START_ÅR;                                                 00003170
                                                                        00003180
   DO  I = INNT_START_ÅR TO SLUTT_ÅR;                                   00003190
 /*       ZZZ            = TAB.POENG_ANVENDT(I);                        00003200
          POENG_TAB(I)   = TAB.POENG_ANVENDT(I);                        00003210
          T_POENG_TAB(I) = TAB.POENG_ANVENDT(I);                        00003220
          V_POENG_TAB(I) = TAB.POENG_ANVENDT(I);                        00003230
          Y_POENG_TAB(I) = TAB.POENG_ANVENDT(I);                        00003240
          X_POENG_TAB(I) = TAB.POENG_ANVENDT(I);                        00003250
          W_POENG_TAB(I) = TAB.POENG_ANVENDT(I);                        00003260
          Z_POENG_TAB(I) = TAB.POENG_ANVENDT(I);      */                00003270
 /*9804 HL- POENG_ANVENDT ERSTATTES MED POENG_TAB I DET FØLGENDE*/      00003280
          ZZZ            = O_POENG_TAB(I);                              00003290
          T_POENG_TAB(I) = O_POENG_TAB(I);                              00003300
          V_POENG_TAB(I) = O_POENG_TAB(I);                              00003310
   /*     Y_POENG_TAB(I) = O_POENG_TAB(I);   */                         00003320
          X_POENG_TAB(I) = O_POENG_TAB(I);                              00003330
          W_POENG_TAB(I) = O_POENG_TAB(I);                              00003340
          Z_POENG_TAB(I) = O_POENG_TAB(I);                              00003350
   END;                                                                 00003360
  DCL PIKODE   CHAR (1) INIT(' ');                                      00003370
                                                                        00003380
  DO   A  = SLUTT_ÅR TO INNT_START_ÅR BY -1;                            00003390
       IF   TAB.OMSORG_KODE(A)     ^= 'J'  &         /*HL*/             00003400
            TAB.OMSORG_KODE(A - 1) ^= 'J'  THEN      /*HL*/             00003410
          DO;                                                           00003420
            SLUTT_OMS_TRE  =  A - 1;                                    00003430
          END;                                                          00003440
       IF   SLUTT_OMS_TRE  > 0  THEN                                    00003450
            LEAVE;                                                      00003460
  END;                                                                  00003470
                                                                        00003480
  IF  SLUTT_OMS_TRE < INNT_START_ÅR THEN                                00003490
      SLUTT_OMS_TRE = INNT_START_ÅR;                                    00003500
                                                 /*HL: */               00003510
   IF   TAB.OMSORG_KODE(SLUTT_ÅR)       = 'J'  !                        00003520
        TAB.OMSORG_KODE(SLUTT_ÅR - 1) = 'J'    !                        00003530
        TAB.OMSORG_KODE(SLUTT_ÅR - 2) = 'J' THEN                        00003540
      DO;                                                               00003550
         IF   TAB.OMSORG_KODE(SLUTT_ÅR)       = 'J'  THEN               00003560
                 TRE_SISTE_O     =  TRE_SISTE_O   + 1;                  00003570
                                                                        00003580
         IF   TAB.OMSORG_KODE(SLUTT_ÅR - 1) = 'J'    THEN               00003590
                 TRE_SISTE_O     =  TRE_SISTE_O   + 1;                  00003600
                                                                        00003610
         IF   TAB.OMSORG_KODE(SLUTT_ÅR - 2) = 'J' THEN                  00003620
                 TRE_SISTE_O     =  TRE_SISTE_O   + 1;                  00003630
                                                                        00003640
                 W_TABELL_SLUTT_ÅR = SLUTT_ÅR - (TRE_SISTE_O     + 3);  00003650
                                                                        00003660
  /*   CALL TRE_SISTE_OMS;          */                                  00003670
       CALL OMSORG;                                                     00003680
      END;                                                              00003690
                                                                        00003700
   CALL TJUE_BESTE_OMS;                                                 00003710
                                                                        00003720
  OMSORG:                                                               00003730
    PROC;                                                               00003740
    DCL                                                                 00003750
       FØRSTE_OMÅR   FIXED BIN(15) INIT (0),                            00003760
       TELLER        FIXED BIN(15) INIT (0),                            00003770
       ALT(4)        FIXED DEC(7,4),                                    00003780
       OMPOENG(3)    FIXED DEC(5,4);                                    00003790
                                                                        00003800
    OMPOENG(*) = 0;                                                     00003810
    ALT    (*) = 0;                                                     00003820
                                                                        00003830
  /*FINN TRE BESTE ÅR MED OMSORGSPOENG, SORTER DEM MED HØYESTE */       00003840
  /*POENG PÅ FØRSTE PLASS                                       */      00003850
  /*VI GÅR IKKE LENGRE TILBAKE ENN SISTE TRE ÅR UTEN OMSORGSP.  */      00003860
                                                                        00003870
    DO I = SLUTT_ÅR TO 89 BY -1 WHILE(TELLER < 4);                      00003880
       IF TAB.OMSORG_KODE(I) ^= 'J' THEN                                00003890
          TELLER = TELLER + 1;                                          00003900
       ELSE                                                             00003910
       DO;                                                              00003920
          IF OMPOENG(1) < O_POENG_TAB(I) THEN                           00003930
             DO;                                                        00003940
                OMPOENG(3) = OMPOENG(2);                                00003950
                OMPOENG(2) = OMPOENG(1);                                00003960
                OMPOENG(1) = O_POENG_TAB(I);                            00003970
             END;                                                       00003980
          ELSE                                                          00003990
          IF OMPOENG(2) < O_POENG_TAB(I) THEN                           00004000
             DO;                                                        00004010
                OMPOENG(3) = OMPOENG(2);                                00004020
                OMPOENG(2) = O_POENG_TAB(I);                            00004030
             END;                                                       00004040
          ELSE                                                          00004050
          IF OMPOENG(3) < O_POENG_TAB(I) THEN                           00004060
             DO;                                                        00004070
                OMPOENG(3) = O_POENG_TAB(I);                            00004080
             END;                                                       00004090
       END;                                                             00004100
    END; /*DO I = SLUTT_ÅR TO 89*/                                      00004110
                                                                        00004120
 /*LAG INNTIL FIRE ALTERNATIVER */                                      00004130
                                                                        00004140
    TELLER = 3;                                                         00004150
    ALT(4) = OMPOENG(1) + OMPOENG(2) + OMPOENG(3);                      00004160
    DO I = SLUTT_ÅR TO 89 BY -1 WHILE(TELLER > 0);                      00004170
       IF TAB.OMSORG_KODE(I) ^= 'J'     THEN                            00004180
       DO;                                                              00004190
          OMPOENG(TELLER) = O_POENG_TAB(I);                             00004200
          ALT(TELLER) = OMPOENG(1) + OMPOENG(2) + OMPOENG(3);           00004210
          TELLER = TELLER - 1;                                          00004220
       END;                                                             00004230
    END;                                                                00004240
                                                                        00004250
  /*FINN BESTE ALTERNATIV*/                                             00004260
                                                                        00004270
    IF ALT(1) > ALT(2)  THEN                                            00004280
       IF ALT(1) > ALT(3)  THEN                                         00004290
          IF ALT(1) > ALT(4)  THEN                                      00004300
             W_RESULTAT_TRE   = ALT(1) / 3 + RUNDING;                   00004310
          ELSE                                                          00004320
             W_RESULTAT_TRE   = ALT(4) / 3 + RUNDING;                   00004330
       ELSE                                                             00004340
       IF ALT(3) > ALT(4)  THEN                                         00004350
          W_RESULTAT_TRE   = ALT(3) / 3 + RUNDING;                      00004360
       ELSE                                                             00004370
          W_RESULTAT_TRE   = ALT(4) / 3 + RUNDING;                      00004380
    ELSE                                                                00004390
    IF ALT(2) > ALT(3) THEN                                             00004400
       IF ALT(2) > ALT(4)  THEN                                         00004410
          W_RESULTAT_TRE   = ALT(2) / 3 + RUNDING;                      00004420
       ELSE                                                             00004430
          W_RESULTAT_TRE   = ALT(4) / 3 + RUNDING;                      00004440
    ELSE                                                                00004450
    IF ALT(3) > ALT(4)   THEN                                           00004460
       W_RESULTAT_TRE   = ALT(3) / 3 + RUNDING;                         00004470
    ELSE                                                                00004480
       W_RESULTAT_TRE   = ALT(4) / 3 + RUNDING;                         00004490
                                                                        00004500
 END OMSORG;                                                            00004510
  TRE_SISTE_OMS : PROC;  /*------------------------------*/             00004520
                                                                        00004530
  /*1.FINNE GJENNOMSNITT AV DE TRE SISTE ÅR MED PI:       */            00004540
  /*DETTE RESULTAT FINNES I 4171 .                        */            00004550
                                                                        00004560
 DO N = 1 TO 3;                                                         00004570
    STØRSTE_POENG_ALLE (N) = 0;                                         00004580
 END;                                                                   00004590
                                                                        00004600
  /* FINNE SISTE ÅR UTEN OMSORGSPOENG                     */            00004610
                                                                        00004620
   /* VI MÅ FINNE GJENNOMSNITT AV TRE SISTE ÅR UTEN OMSORGSPOENG*/      00004630
   /* DETTE TAS IKKE HENSYN TIL I 4171                          */      00004640
   JJ = 0;                                                              00004650
   DO   N = SLUTT_ÅR TO INNT_START_ÅR BY -1;                            00004660
        IF   TAB.OMSORG_KODE(N) ^= 'J'  THEN                            00004670
          DO;                                                           00004680
   /*        PI_BUP         = PI_BUP + TAB.POENG_ANVENDT(N);            00004690
             Z_POENG_TAB(N) = TAB.POENG_ANVENDT(N);     */              00004700
             PI_BUP         = PI_BUP + O_POENG_TAB(N);                  00004710
             Z_POENG_TAB(N) = O_POENG_TAB(N);                           00004720
             JJ             = JJ + 1;                                   00004730
          END;                                                          00004740
        IF   JJ = 3 THEN LEAVE;                                         00004750
   END;                                                                 00004760
                                                                        00004770
   PI_BUP_SNITT  = PI_BUP / 3 + 0.005;                                  00004780
                                                                        00004790
   /* FINNE GJENNOMSNITT AV 'TRE SISTE' HVOR DET ER OPPTJENT*/          00004800
   /* OMSORGSPOENG FOR SMÅ BARN.                            */          00004810
                                                                        00004820
   /* MÅ FINNE LAVESTE ÅR MED OMSORGSPOENG */                           00004830
                                                                        00004840
        DO   N =  92 TO SLUTT_ÅR ;                                      00004850
          IF   TAB.OMSORG_KODE(N) = 'J' THEN                            00004860
             DO;                                                        00004870
                LAVESTE_OMS_ÅR  = N;                                    00004880
             END;                                                       00004890
           IF  LAVESTE_OMS_ÅR  > 0 THEN                                 00004900
             LEAVE;                                                     00004910
        END;                                                            00004920
                                                                        00004930
        DO   N =  92 TO SLUTT_ÅR ;                                      00004940
          IF   TAB.OMSORG_KODE(N) = 'J' &                               00004950
 /*            TAB.POENG_ANVENDT(N)    > 0 THEN       */                00004960
               O_POENG_TAB(N)          > 0 THEN                         00004970
             DO;                                                        00004980
                OMS_ÅR_PI  = OMS_ÅR_PI + 1;                             00004990
             END;                                                       00005000
        END;                                                            00005010
   DCL OMSTRE  FIXED DEC (5,3) INIT (0);                                00005020
   IF   OMS_ÅR_PI > 2 THEN                                              00005030
     DO;                                                                00005040
        DO   M = 1 TO 3;                                                00005050
          DO   N = SLUTT_ÅR TO SLUTT_OMS_TRE BY -1;                     00005060
             IF   TAB.OMSORG_KODE(N) = 'J' &                            00005070
                  W_POENG_TAB(N) > 0 THEN                               00005080
               DO;                                                      00005090
                 IF W_POENG_TAB(N) > STØRSTE_POENG_ALLE(M) THEN         00005100
                 DO;                                                    00005110
                   STØRSTE_POENG_ALLE(M) = W_POENG_TAB(N);              00005120
                   K = N;                                               00005130
                 END;                                                   00005140
               END;                                                     00005150
          END;                                                          00005160
         OMSTRE        =  W_POENG_TAB(K);                               00005170
         TRE_BESTE_OMS = TRE_BESTE_OMS + W_POENG_TAB(K);                00005180
         W_POENG_TAB(K) = 0;                                            00005190
        END;                                                            00005200
                                                                        00005210
       TRE_OMS_SNITT = TRE_BESTE_OMS / 3 + 0.005;                       00005220
     END;                                                               00005230
                                                                        00005240
    OMSTRE =  SUM(STØRSTE_POENG_ALLE);                                  00005250
                                                                        00005260
   /* PLUKKE UT BESTE POENG I DENNE REKKEN MED OMSORGSPOENG   */        00005270
   /* ÅR UTEN OMSORGSPOENG MÅ VÆRE MED -KAN IKKE HOPPES OVER  */        00005280
   /* ELLERS KAN VI VELGE BESTE ÅR                            */        00005290
                                                                        00005300
      DO   N =  LAVESTE_OMS_ÅR TO SLUTT_ÅR ;                            00005310
        IF   TAB.OMSORG_KODE(N) ^= 'J' THEN                             00005320
          DO;                                                           00005330
             HJELP1 =  X_POENG_TAB(N) + HJELP1;                         00005340
             K      = N;                                                00005350
             T      = T + 1; /*TELLE OPP ÅR UTEN*/                      00005360
          END;                                                          00005370
                                                                        00005380
        X_POENG_TAB(K) = 0;                                             00005390
        IF T >= 3 THEN LEAVE;                                           00005400
      END;                                                              00005410
                                                                        00005420
   DO   N = 1 TO 3;                                                     00005430
        STØRSTE_POENG_ALLE (N) = 0;                                     00005440
   END;                                                                 00005450
                                                                        00005460
                                                                        00005470
   IF   T < 0 THEN T = 0;                                               00005480
                                                                        00005490
   IF   T < 3  THEN    /* NÅ SKAL VI TA MED POENG OMS.ÅR     */         00005500
                       /* T = ANTALL ÅR UTEN OMS.ÅR          */         00005510
        Z = 3 - T;     /* Z = ANTALL ÅR VI SKAL HA MED OMS.ÅR*/         00005520
   ELSE                                                                 00005530
        Z = 3;                                                          00005540
                                                                        00005550
   DCL PPP1 FIXED DEC (5,3) INIT (0);                                   00005560
   DCL PPP2 FIXED DEC (5,3) INIT (0);                                   00005570
   DCL PPP3 FIXED DEC (5,3) INIT (0);                                   00005580
   N = 0;                                                               00005590
       DO   M = 1 TO (Z);                                               00005600
          DO   N =  (LAVESTE_OMS_ÅR - 1) TO SLUTT_ÅR ;                  00005610
               IF X_POENG_TAB(N) > STØRSTE_POENG_ALLE(M) THEN           00005620
                DO;                                                     00005630
                  STØRSTE_POENG_ALLE(M)  = X_POENG_TAB(N);              00005640
                  K = N;                                                00005650
                END;                                                    00005660
                        /*    T             = T + 1;  */                00005670
            X_POENG_TAB(K) = 0;                                         00005680
          END;                                                          00005690
                       /*IF T >= 3 THEN LEAVE; */                       00005700
       PPP1 =      STØRSTE_POENG_ALLE(M);                               00005710
       END;                                                             00005720
                                                                        00005730
    /*LAGE ET ALTERNATIV TIL DER VI TAR BORT SISTE ÅR UTEN          */  00005740
    /*OMSORGSPOENG, DVS SLUTT ÅR - 1 UNØDVENDIG PGA PLUKKE UT BESTE */  00005750
    /* SE LOOP OVER  */                                                 00005760
                                                                        00005770
  SNITT_BLANDET =  SUM(STØRSTE_POENG_ALLE) ;                            00005780
  SNITT_BLANDET =  (SNITT_BLANDET + HJELP1)  / 3 + 0.005;               00005790
                                                                        00005800
  W_RESULTAT_TRE = MAX(PI_BUP_SNITT,SNITT_BLANDET,TRE_OMS_SNITT);       00005810
 /* *****  IF   PI_BUP_SNITT > SNITT_BLANDET  THEN                      00005820
         W_RESULTAT_TRE = PI_BUP_SNITT;                                 00005830
  ELSE                                                                  00005840
         W_RESULTAT_TRE  = SNITT_BLANDET;  **** */                      00005850
                                                                        00005860
  END TRE_SISTE_OMS;                                                    00005870
  /*-------------------------------*/                                   00005880
                                                                        00005890
  TJUE_BESTE_OMS: PROC;                                                 00005900
                                                                        00005910
                                                                        00005920
  VANLIG        = 0;                                                    00005930
  /*  PLUKKER UT HALVPARTEN AV DE BESTE VANLIGE POENGENE  */            00005940
  /*  DETTE ER GJORT I 4171                               */            00005950
                                                                        00005960
  /*  FINNE HALVPARTEN UTEN OMSORGSPOENG                  */            00005970
                                                                        00005980
  DO   I = 1 TO 20;                                                     00005990
       STØRSTE_POENG(I)   = 0;                                          00006000
       W_STØRSTE_POENG(I) = 0;                                          00006010
       OMSÅR_HALVPARTEN(I) = 0;                                         00006020
  END;                                                                  00006030
                                                                        00006040
  K = INNT_START_ÅR;                 /*0395 HL */                       00006050
  HALVPARTEN = (W_ANTALL_ÅR / 2) + 0.5;                                 00006060
  DCL H_P  FIXED DEC(5,2) INIT (0);                                     00006070
  DO   I = 1 TO HALVPARTEN;                                             00006080
     DO   J = INNT_START_ÅR TO SLUTT_ÅR;                                00006090
       IF   B01.PI_KODE(IND,J) ^= 'J' THEN                              00006100
        DO;                                                             00006110
          IF   V_POENG_TAB(J) > STØRSTE_POENG(I) THEN                   00006120
            DO;                                                         00006130
                STØRSTE_POENG(I) = V_POENG_TAB(J);                      00006140
                W_STØRSTE_P(I)   = V_POENG_TAB(J);                      00006150
                K = J;                                                  00006160
                A = I;                                                  00006170
            END;                                                        00006180
        END;                                                            00006190
     END;                                                               00006200
                                                                        00006210
     VANLIG  = VANLIG + V_POENG_TAB(K);                                 00006220
     V_POENG_TAB(K) = 0;                                                00006230
  END;                                                                  00006240
                                                                        00006250
  POENG_HALVPARTEN = SUM(STØRSTE_POENG) / HALVPARTEN + 0.005;           00006260
                                                                        00006270
  /* LEGGE TIL ET ÅR I POENGREKKEN MED BESTE OMSÅR */                   00006280
                                                                        00006290
    DO I = 92 TO SLUTT_ÅR;                                              00006300
     IF B01.PI_KODE(IND,I)  = 'J' &                                     00006310
        T_POENG_TAB(I) > 0 THEN                                         00006320
       DO;                                                              00006330
         TELLER = TELLER + 1; /*MULIGE ANTALL OMSÅR*/                   00006340
       END;                                                             00006350
  END;                                                                  00006360
                                                                        00006370
   /*-------GÅR DETTE ???--------------------------------*/             00006380
   /*-------SJEKK AT A + I IKKE GÅR UTOVER 20------------*/             00006390
                                                                        00006400
  IF  TELLER > 0 THEN                                                   00006410
    DO;                                                                 00006420
       DO I = 1 TO TELLER;                                              00006430
         DO J = INNT_START_ÅR TO SLUTT_ÅR;                              00006440
            IF B01.PI_KODE(IND,J) = 'J' &                               00006450
               T_POENG_TAB(J) > 0 THEN                                  00006460
                DO;                                                     00006470
                  IF T_POENG_TAB(J) > W_STØRSTE_POENG(I) THEN           00006480
                        DO;                                             00006490
                          W_STØRSTE_POENG(I) = T_POENG_TAB(J);          00006500
                          W_STØRSTE_P(I + A) = T_POENG_TAB(J);          00006510
                          STØRSTE_POENG(I + A) = T_POENG_TAB(J);        00006520
                          K = J;                                        00006530
                        END;                                            00006540
                  END;                                                  00006550
         END;                                                           00006560
       CALL W_BEREGNING;                                                00006570
       T_POENG_TAB(K) = 0;                                              00006580
       END;                                                             00006590
    END;                                                                00006600
                                                                        00006610
   W_BEREGNING: PROC;                                                   00006620
                                                                        00006630
   W_ANTALL_ÅR = W_ANTALL_ÅR + 1;                                       00006640
   HALVPARTEN = (W_ANTALL_ÅR / 2) + 0.5;                                00006650
   IF   HALVPARTEN > 20 THEN                                            00006660
        HALVPARTEN = 20;                                                00006670
                                                                        00006680
     DO X = 1 TO  40;                                                   00006690
        Y_PI_POENG(X)   =  0;                                           00006700
        X_STØRSTE_P(X)  =  0;                                           00006710
     END;                                                               00006720
     DO X = 1 TO 40;                                                    00006730
        Y_PI_POENG(X)  =  W_STØRSTE_P(X);                               00006740
        H_P            =  W_STØRSTE_P(X);                               00006750
     END;                                                               00006760
  DO B = 1 TO HALVPARTEN;                                               00006770
 /*  PLUKKER UT HALVPART AV DE BESTE    POENGENE  */                    00006780
     DO N = 1 TO (HALVPARTEN + TELLER);                                 00006790
          IF Y_PI_POENG(N) > X_STØRSTE_P(B) THEN                        00006800
            DO;                                                         00006810
             X_STØRSTE_P(B) = Y_PI_POENG(N);                            00006820
             M = N;                                                     00006830
            END;                                                        00006840
     END;                                                               00006850
     H_P  = Y_PI_POENG(M);                                              00006860
     Y_PI_POENG(M) = 0;                                                 00006870
  END;                                                                  00006880
         /*S ER INITIERT MED 1 */                                       00006890
                                                                        00006900
  OMSÅR_HALVPARTEN(S) =   SUM(X_STØRSTE_P)                              00006910
                               / HALVPARTEN + 0.005;                    00006920
                                                                        00006930
   S = S + 1;                                                           00006940
    END W_BEREGNING;                                                    00006950
   /*----------------------------------------------------*/             00006960
   /*  FINNE BESTE ALTERNATIV                            */             00006970
   /*----------------------------------------------------*/             00006980
  BESTE_HALVPARTEN = 0;                                                 00006990
  DCL AA1   FIXED DEC (5,3) INIT (0);                                   00007000
  DCL AA2   FIXED DEC (5,3) INIT (0);                                   00007010
  DCL AA3   FIXED DEC (5,3) INIT (0);                                   00007020
  DCL AA4   FIXED DEC (5,3) INIT (0);                                   00007030
  AA1  = OMSÅR_HALVPARTEN(1);                                           00007040
  AA2  = OMSÅR_HALVPARTEN(2);                                           00007050
  AA3  = OMSÅR_HALVPARTEN(3);                                           00007060
  AA4  = OMSÅR_HALVPARTEN(4);                                           00007070
  DO   T = 1 TO S;                                                      00007080
    IF   OMSÅR_HALVPARTEN(T) > BESTE_HALVPARTEN  THEN                   00007090
      DO;                                                               00007100
        BESTE_HALVPARTEN = OMSÅR_HALVPARTEN(T);                         00007110
      END;                                                              00007120
  END;                                                                  00007130
                                                                        00007140
  IF   BESTE_HALVPARTEN <  POENG_HALVPARTEN  THEN                       00007150
       W_RESULTAT_20    =  POENG_HALVPARTEN;                            00007160
  ELSE                                                                  00007170
       W_RESULTAT_20    =  BESTE_HALVPARTEN;                            00007180
                                                                        00007190
  END TJUE_BESTE_OMS;                                                   00007200
                                                                        00007210
  IF   W_RESULTAT_TRE > W_RESULTAT_20  THEN                             00007220
       W1_RESULTAT     = W_RESULTAT_TRE;                                00007230
  ELSE                                                                  00007240
       W1_RESULTAT     = W_RESULTAT_20;                                 00007250
                                                                        00007260
  END REGN_OMS;                                                         00007270
   /**-----------------------------------------------------------*/     00007280
                                                                        00007290
                                                                        00007300
  END REGN_BUP_FPP;                                                     00007310
