 /*       SIST ENDRET 24/08-88 09.30.10 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 09/02-88 13.21.28 AV   DYBVIK                   */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /* **********************                                            */00000040
 /*  PROGRAM-IDENT : R001NO12  UNDERPROGRAM SOM BRUKES AV R001NO10    */00000050
 /*                            KONTROLL UP-BLANKETT.                  */00000060
 /*  PROGRAM-SPRÅK : PLI                                              */00000070
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */00000080
 /*  PROGRAMMET BLE LAGET : AUG 1987                                  */00000090
 /* ***************************************************************** */00000100
 /*  ENDRINGERSDATO :   230888                                        */00000110
 /*  ENDRINGEN GJELDER: LAGT INN CALL TIL BLANK_UP_SPES.  ABENDER I   */00000120
 /*                     GRUNNBLANKETTRUTINA SKYLDTES UGYLDIGE         */00000130
 /*                     VERDIER I UPSP.                               */00000140
 /*  ENDRINGEN BLE UTFØRT AV : BRITT                                  */00000150
 /*                                                                   */00000160
 /* ***************************************************************** */00000170
 /*BRUK:                                                              */00000180
 /* ********                                                          */00000190
 /*                                                                   */00000200
 /*  %INCLUDE R001NO12                                                */00000210
 /*                                                                   */00000220
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */00000230
 /*                                                                   */00000240
 /*    R0010602   BLANK TRANSOMR                                      */00000250
 /*    R0010603   KONTR UP SØKER                                      */00000260
 /*    R0010604   KONTR UP BARN                                       */00000270
 /*    FUNKSJONER SOM BRUKES ER INCLUDET I HOVEDPROGRAMMET.           */00000280
 /*                                                                   */00000290
 /* ***************************************************************** */00000300
 /*                                                                   */00000310
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR UP OG FLYTTER DERETTER        */00000320
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */00000330
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */00000340
 /*  NUMRE TATT VARE PÅ.                                              */00000350
 /*                                                                   */00000360
 /* ***************************************************************** */00000370
                                                                        00000380
 P106_BEHANDLE_UP: PROC;                                                00000390
                                                                        00000400
                                                                        00000410
 %INCLUDE P0010601;                      /* TRANSOMRÅDE UP */           00000420
                                                                        00000430
                                                                        00000440
          CALL BLANK_UP_SØKER;                         /* R0010602 */   00000450
          CALL BLANK_UP_BARN;                          /* R0010602 */   00000460
          CALL BLANK_UP_MELDNR;                        /* R0010602 */   00000470
          CALL BLANK_UP_SPES;                          /* R0010602 */   00000480
          CALL OVERF_UP_BLANKETT;                                       00000490
          CALL KONTROLL_UP_SØKER(FEIL_FUNNET);         /* R0010603 */   00000500
                                                                        00000510
          IF ^FEIL_FUNNET                         &                     00000520
             F_FELT_PIC_CHAR2(UPS.BT_ANT) ^= '00' THEN                  00000530
             DO;                                                        00000540
                CALL OVERF_UP_BARN;                                     00000550
                CALL KONTROLL_UP_BARN(FEIL_FUNNET);    /* R0010604 */   00000560
             END;                                                       00000570
                                                                        00000580
          IF UPS.NORSK_BOSATT = 'N'   THEN                              00000590
             DO;                                                        00000600
                FEIL_I_BOSATT = TRUE;                                   00000610
                FEIL_FUNNET   = TRUE;                                   00000620
             END;                                                       00000630
                                                                        00000640
          IF FEIL_FUNNET      THEN                                      00000650
             CALL FINN_FEIL_UP;                                         00000660
                                                                        00000670
                                                                        00000680
                                                                        00000690
                                                                        00000700
 /* ***************************************************************** */00000710
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */00000720
 /*    RECORDEN TIL UP TRANSOMRÅDE FOR UP SØKER.                      */00000730
 /* ***************************************************************** */00000740
 OVERF_UP_BLANKETT:PROC;                                                00000750
                                                                        00000760
          UPS.ATT_UF       =  UP_BLANKETT.YTELSE;                       00000770
          UPS.REGDATO      =  BLANKETT_RECORD.TRANS_DATO_ÅMD;           00000780
          UPS.TERMID       = 'NORT';                                    00000790
          UPS.FNR          =  BLANKETT_RECORD.FNR;                      00000800
          UPS.NAVN         =  BLANKETT_RECORD.NAVN;                     00000810
          UPS.SPRÅK        =  UP_BLANKETT.SPRÅK;                        00000820
          UPS.TKNR         =  BLANKETT_RECORD.TKNR;                     00000830
          UPS.SIVILSTAND   =  UP_BLANKETT.SIVILSTAND;                   00000840
          UPS.TILL_EK      =  UP_BLANKETT.EKTEFELLETILLEGG;             00000850
          UPS.VIRK_DATO_MÅ =  UP_BLANKETT.VIRK_DATO_MÅ;                 00000860
                                                                        00000870
          IF F_FELT_PIC_CHAR3 (UP_BLANKETT.ANT_BARN) ^= '   '    THEN   00000880
             UPS.BT_ANT    =  UP_BLANKETT.ANT_BARN;                     00000890
                                                                        00000900
          UPS.NORSK_BOSATT =  UP_BLANKETT.NORSK_BOSATT;                 00000910
                                                                        00000920
          DO I = 1 TO 4;                                                00000930
             IF F_FELT_PIC_CHAR2 (UP_BLANKETT.VP_ÅR(I)) ^= '  ' THEN    00000940
                UPS.VP_ÅR(I) =  UP_BLANKETT.VP_ÅR(I);                   00000950
          END;                                                          00000960
                                                                        00000970
          UPS.VILKÅR_8_1   =  UP_BLANKETT.VILKÅR_8_1B;                  00000980
          UPS.VILKÅR_8_4   =  UP_BLANKETT.VILKÅR_8_4_3A;                00000990
                                                                        00001000
          IF F_FELT_PIC_CHAR3 (UP_BLANKETT.UFG) ^= '   '         THEN   00001010
             UPS.UFG       =  UP_BLANKETT.UFG;                          00001020
                                                                        00001030
          IF F_FELT_PIC_CHAR4 (UP_BLANKETT.UFT) ^= (4)' '   THEN        00001040
             UPS.UFT_MÅ    =  UP_BLANKETT.UFT;                          00001050
                                                                        00001060
          IF F_FELT_PIC_CHAR5 (UP_BLANKETT.PI) ^= (5)' '   THEN         00001070
             UPS.PI        =  UP_BLANKETT.PI * 100;                     00001080
                                                                        00001090
          IF F_FELT_PIC_CHAR2 (UP_BLANKETT.YRKE) ^= '  '   THEN         00001100
             UPS.YRKE      =  UP_BLANKETT.YRKE;                         00001110
                                                                        00001120
          IF F_FELT_PIC_CHAR11 (UP_BLANKETT.FNR_EK) ^= (11)' '   THEN   00001130
             UPS.FNR_EK    =  UP_BLANKETT.FNR_EK;                       00001140
                                                                        00001150
          UPS.NAVN_EK      =  UP_BLANKETT.NAVN_EK;                      00001160
          UPS.EK_INNT      =  UP_BLANKETT.EK_INNT;                      00001170
                                                                        00001180
                                                                        00001190
    END OVERF_UP_BLANKETT;                                              00001200
                                                                        00001210
                                                                        00001220
 /* ***************************************************************** */00001230
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */00001240
 /*    RECORDEN TIL UP TRANSOMRÅDE FOR UP BARN.                       */00001250
 /* ***************************************************************** */00001260
 OVERF_UP_BARN:PROC;                                                    00001270
                                                                        00001280
                                                                        00001290
          DO I = 1 TO 12 WHILE (F_FELT_PIC_CHAR11                       00001300
                               (UP_BLANKETT.FNR_BARN (I)) ^= (11)' ');  00001310
             UPB.FNR_BARN(I) = UP_BLANKETT.FNR_BARN(I);                 00001320
             UPB.RBT_BARN(I) = UP_BLANKETT.RED_BT(I);                   00001330
          END;                                                          00001340
                                                                        00001350
                                                                        00001360
    END OVERF_UP_BARN;                                                  00001370
                                                                        00001380
                                                                        00001390
                                                                        00001400
 /* ***************************************************************** */00001410
 /*    PROCEDURE SOM FINNER OG TAR VARE PÅ FEIL_MELD_NR NÅR DET ER    */00001420
 /*    FEIL I DEN OVERFØRTE RECORDEN.                                 */00001430
 /* ***************************************************************** */00001440
 FINN_FEIL_UP:PROC;                                                     00001450
                                                                        00001460
    DCL ANT_BARN              FIXED BIN (15);                           00001470
                                                                        00001480
          FEIL_IND = 1;                                                 00001490
                                                                        00001500
          IF UPS.ATT_UFNR ^= 0 &                                        00001510
             UPS.ATT_UFNR ^= 999 THEN                                   00001520
             DO;                                                        00001530
                W01_FEIL_NR(FEIL_IND) = UPS.ATT_UFNR;                   00001540
                FEIL_IND = FEIL_IND + 1;                                00001550
             END;                                                       00001560
                                                                        00001570
          IF UPS.FNRNR ^= 0 &                                           00001580
             UPS.FNRNR ^= 999 THEN                                      00001590
             DO;                                                        00001600
                W01_FEIL_NR(FEIL_IND) = UPS.FNRNR;                      00001610
                FEIL_IND = FEIL_IND + 1;                                00001620
             END;                                                       00001630
                                                                        00001640
          IF UPS.TKNRNR ^= 0 &                                          00001650
             UPS.TKNRNR ^= 999 THEN                                     00001660
             DO;                                                        00001670
                W01_FEIL_NR(FEIL_IND) = UPS.TKNRNR;                     00001680
                IF FEIL_IND ^= 3 THEN                                   00001690
                   FEIL_IND = FEIL_IND + 1;                             00001700
             END;                                                       00001710
                                                                        00001720
          IF UPS.NAVNNR ^= 0 &                                          00001730
             UPS.NAVNNR ^= 999 THEN                                     00001740
             DO;                                                        00001750
                W01_FEIL_NR(FEIL_IND) = UPS.NAVNNR;                     00001760
                IF FEIL_IND ^= 3 THEN                                   00001770
                   FEIL_IND  = FEIL_IND + 1;                            00001780
             END;                                                       00001790
                                                                        00001800
          IF UPS.SPRÅKNR ^= 0 &                                         00001810
             UPS.SPRÅKNR ^= 999 THEN                                    00001820
             DO;                                                        00001830
                W01_FEIL_NR(FEIL_IND) = UPS.SPRÅKNR;                    00001840
                IF FEIL_IND ^= 3 THEN                                   00001850
                   FEIL_IND  = FEIL_IND + 1;                            00001860
             END;                                                       00001870
                                                                        00001880
          IF UPS.SIVILSTANDNR ^= 0 &                                    00001890
             UPS.SIVILSTANDNR ^= 999 THEN                               00001900
             DO;                                                        00001910
                W01_FEIL_NR(FEIL_IND) = UPS.SIVILSTANDNR;               00001920
                IF FEIL_IND ^= 3 THEN                                   00001930
                   FEIL_IND  = FEIL_IND + 1;                            00001940
             END;                                                       00001950
                                                                        00001960
          IF UPS.TILL_EKNR ^= 0 &                                       00001970
             UPS.TILL_EKNR ^= 999 THEN                                  00001980
             DO;                                                        00001990
                W01_FEIL_NR(FEIL_IND) = UPS.TILL_EKNR;                  00002000
                IF FEIL_IND ^= 3 THEN                                   00002010
                   FEIL_IND  = FEIL_IND + 1;                            00002020
             END;                                                       00002030
                                                                        00002040
          IF UPS.NORSK_BOSATTNR ^= 0 &                                  00002050
             UPS.NORSK_BOSATTNR ^= 999 THEN                             00002060
             DO;                                                        00002070
                W01_FEIL_NR(FEIL_IND) = UPS.NORSK_BOSATTNR;             00002080
                IF FEIL_IND ^= 3 THEN                                   00002090
                   FEIL_IND  = FEIL_IND + 1;                            00002100
             END;                                                       00002110
                                                                        00002120
          IF UPS.BT_ANTNR ^= 0 &                                        00002130
             UPS.BT_ANTNR ^= 999 THEN                                   00002140
             DO;                                                        00002150
                W01_FEIL_NR(FEIL_IND) = UPS.BT_ANTNR;                   00002160
                IF FEIL_IND ^= 3 THEN                                   00002170
                   FEIL_IND  = FEIL_IND + 1;                            00002180
             END;                                                       00002190
                                                                        00002200
          DO I = 1 TO 4;                                                00002210
             IF UPS.VP_ÅRNR(I) ^= 0 &                                   00002220
                UPS.VP_ÅRNR(I) ^= 999 THEN                              00002230
                DO;                                                     00002240
                   W01_FEIL_NR(FEIL_IND) = UPS.VP_ÅRNR(I);              00002250
                   IF FEIL_IND ^= 3 THEN                                00002260
                      FEIL_IND = FEIL_IND + 1;                          00002270
                END;                                                    00002280
          END;                                                          00002290
                                                                        00002300
          IF UPS.VILKÅR_8_1NR ^= 0 &                                    00002310
             UPS.VILKÅR_8_1NR ^= 999 THEN                               00002320
             DO;                                                        00002330
                W01_FEIL_NR(FEIL_IND) = UPS.VILKÅR_8_1NR;               00002340
                IF FEIL_IND ^= 3 THEN                                   00002350
                   FEIL_IND  = FEIL_IND + 1;                            00002360
             END;                                                       00002370
                                                                        00002380
          IF UPS.VILKÅR_8_4NR ^= 0 &                                    00002390
             UPS.VILKÅR_8_4NR ^= 999 THEN                               00002400
             DO;                                                        00002410
                W01_FEIL_NR(FEIL_IND) = UPS.VILKÅR_8_4NR;               00002420
                IF FEIL_IND ^= 3 THEN                                   00002430
                   FEIL_IND  = FEIL_IND + 1;                            00002440
             END;                                                       00002450
                                                                        00002460
          IF UPS.UFGNR ^= 0 &                                           00002470
             UPS.UFGNR ^= 999 THEN                                      00002480
             DO;                                                        00002490
                W01_FEIL_NR(FEIL_IND) = UPS.UFGNR;                      00002500
                IF FEIL_IND ^= 3 THEN                                   00002510
                   FEIL_IND  = FEIL_IND + 1;                            00002520
             END;                                                       00002530
                                                                        00002540
          IF UPS.UFT_MÅNR ^= 0 &                                        00002550
             UPS.UFT_MÅNR ^= 999 THEN                                   00002560
             DO;                                                        00002570
                W01_FEIL_NR(FEIL_IND) = UPS.UFT_MÅNR;                   00002580
                IF FEIL_IND ^= 3 THEN                                   00002590
                   FEIL_IND  = FEIL_IND + 1;                            00002600
             END;                                                       00002610
                                                                        00002620
          IF UPS.PINR ^= 0 &                                            00002630
             UPS.PINR ^= 999 THEN                                       00002640
             DO;                                                        00002650
                W01_FEIL_NR(FEIL_IND) = UPS.PINR;                       00002660
                IF FEIL_IND ^= 3 THEN                                   00002670
                   FEIL_IND  = FEIL_IND + 1;                            00002680
             END;                                                       00002690
                                                                        00002700
          IF UPS.YRKENR ^= 0 &                                          00002710
             UPS.YRKENR ^= 999 THEN                                     00002720
             DO;                                                        00002730
                W01_FEIL_NR(FEIL_IND) = UPS.YRKENR;                     00002740
                IF FEIL_IND ^= 3 THEN                                   00002750
                   FEIL_IND  = FEIL_IND + 1;                            00002760
             END;                                                       00002770
                                                                        00002780
          IF UPS.VIRK_DATO_MÅNR ^= 0 &                                  00002790
             UPS.VIRK_DATO_MÅNR ^= 999 THEN                             00002800
             DO;                                                        00002810
                W01_FEIL_NR(FEIL_IND) = UPS.VIRK_DATO_MÅNR;             00002820
                IF FEIL_IND ^= 3 THEN                                   00002830
                   FEIL_IND  = FEIL_IND + 1;                            00002840
             END;                                                       00002850
                                                                        00002860
          IF UPS.FNR_EKNR ^= 0 &                                        00002870
             UPS.FNR_EKNR ^= 999 THEN                                   00002880
             DO;                                                        00002890
                W01_FEIL_NR(FEIL_IND) = UPS.FNR_EKNR;                   00002900
                IF FEIL_IND ^= 3 THEN                                   00002910
                   FEIL_IND  = FEIL_IND + 1;                            00002920
             END;                                                       00002930
                                                                        00002940
          IF UPS.NAVN_EKNR ^= 0 &                                       00002950
             UPS.NAVN_EKNR ^= 999 THEN                                  00002960
             DO;                                                        00002970
                W01_FEIL_NR(FEIL_IND) = UPS.NAVN_EKNR;                  00002980
                IF FEIL_IND ^= 3 THEN                                   00002990
                   FEIL_IND  = FEIL_IND + 1;                            00003000
             END;                                                       00003010
                                                                        00003020
          IF UPS.EK_INNTNR ^= 0 &                                       00003030
             UPS.EK_INNTNR ^= 999 THEN                                  00003040
             DO;                                                        00003050
                W01_FEIL_NR(FEIL_IND) = UPS.EK_INNTNR;                  00003060
                IF FEIL_IND ^= 3 THEN                                   00003070
                   FEIL_IND  = FEIL_IND + 1;                            00003080
             END;                                                       00003090
                                                                        00003100
                                                                        00003110
          DO ANT_BARN = 1 TO 12 WHILE (F_FELT_PIC_CHAR11                00003120
                                   (UPB.FNR_BARN(ANT_BARN)) ^= (11)'0');00003130
                                                                        00003140
             IF UPB.FNR_BARNNR(ANT_BARN) ^= 0   &                       00003150
                UPB.FNR_BARNNR(ANT_BARN) ^= 999 THEN                    00003160
                DO;                                                     00003170
                   W01_FEIL_NR(FEIL_IND) = UPB.FNR_BARNNR(ANT_BARN);    00003180
                   IF FEIL_IND ^= 3 THEN                                00003190
                      FEIL_IND  = FEIL_IND + 1;                         00003200
                END;                                                    00003210
                                                                        00003220
             IF UPB.RBT_BARNNR(ANT_BARN) ^= 0   &                       00003230
                UPB.RBT_BARNNR(ANT_BARN) ^= 999 THEN                    00003240
                DO;                                                     00003250
                   W01_FEIL_NR(FEIL_IND) = UPB.RBT_BARNNR(ANT_BARN);    00003260
                   IF FEIL_IND ^= 3 THEN                                00003270
                      FEIL_IND  = FEIL_IND + 1;                         00003280
                END;                                                    00003290
                                                                        00003300
          END;                                                          00003310
                                                                        00003320
                                                                        00003330
                                                                        00003340
    END FINN_FEIL_UP;                                                   00003350
                                                                        00003360
                                                                        00003370
                                                                        00003380
 %PAGE;                                                                 00003390
 /* ***************************************************************** */00003400
 /*          E K S T E R N E    P R O C E D U R E R                   */00003410
 /* ***************************************************************** */00003420
                                                                        00003430
 %PAGE;                                                                 00003440
 %INCLUDE R0010602;          /*     BLANK UP TRANSOMR   */              00003450
 %PAGE;                                                                 00003460
 %INCLUDE R0010603;          /*     KONTR UP SØKER      */              00003470
 %PAGE;                                                                 00003480
 %INCLUDE R0010604;          /*     KONTR UP BARN       */              00003490
                                                                        00003500
                                                                        00003510
 END P106_BEHANDLE_UP;                                                  00003520
                                                                        00003530
                                                                        00003540
