 /*       SIST ENDRET 09/02-88 13.23.06 AV   DYBVIK                   */00000000
 %SKIP(3);                                                              00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /* **********************                                            */00000040
 /*  PROGRAM-IDENT : R001NO19  UNDERPROGRAM SOM BRUKES AV R001NO10    */00000050
 /*                            KONTROLL E2-BLANKETT.                  */00000060
 /*  PROGRAM-SPRÅK : PLI                                              */00000070
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */00000080
 /*  PROGRAMMET BLE LAGET : AUGUST 1987                               */00000090
 /*  ENDRINGERSDATO :                                                 */00000100
 /*  ENDRINGEN GJELDER:                                               */00000110
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000120
 /*                                                                   */00000130
 /* ***************************************************************** */00000140
 /*BRUK:                                                              */00000150
 /* ********                                                          */00000160
 /*                                                                   */00000170
 /*  %INCLUDE R001NO19                                                */00000180
 /*                                                                   */00000190
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */00000200
 /*                                                                   */00000210
 /*    R0011502   BLANK E2 TRANSOMR                                   */00000220
 /*    R0011503   KONTR E2 SØKER                                      */00000230
 /*    FUNKSJONER SOM BLIR BRUKT ER INKLUDERT I HOVEDPROGRAMMET       */00000240
 /*                                                                   */00000250
 /* ***************************************************************** */00000260
 /*                                                                   */00000270
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR E2 OG FLYTTER DERETTER        */00000280
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */00000290
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */00000300
 /*  NUMRE TATT VARE PÅ.                                              */00000310
 /*                                                                   */00000320
 /* ***************************************************************** */00000330
                                                                        00000340
 P115_BEHANDLE_E2: PROC;                                                00000350
                                                                        00000360
                                                                        00000370
 %INCLUDE P0011501;                               /* TRANSOMR E2 */     00000380
                                                                        00000390
                                                                        00000400
          FEIL_I_BOSATT = '0'B;                                         00000410
          FEIL_BLANKETT = '0'B;                                         00000420
          FEIL_FUNNET   = '0'B;                                         00000430
          CALL BLANK_E2_SØKER;                   /* R0011502 */         00000440
          CALL BLANK_E2_MELDNR;                  /* R0011502 */         00000450
          CALL OVERFØR_E2_BLANKETT;                                     00000460
          CALL KONTROLL_E2_SØKER(FEIL_FUNNET);   /* R0011503 */         00000470
                                                                        00000480
          IF FEIL_FUNNET     THEN                                       00000490
             DO;                                                        00000500
                CALL FINN_FEIL_E2;                                      00000510
             END;                                                       00000520
                                                                        00000530
                                                                        00000540
                                                                        00000550
 /* ***************************************************************** */00000560
 /*   PROSEDYRE FOR Å OVERFØRE FELT FRA OVERFØRINGSRECORDEN           */00000570
 /*   TIL E2.TRANS_OMR I KOM_OMR FOR ENDRINGSBLANKETT 2.              */00000580
 /* ***************************************************************** */00000590
 OVERFØR_E2_BLANKETT: PROC;                                             00000600
                                                                        00000610
                                                                        00000620
          E2S.FNR            = BLANKETT_RECORD.FNR;                     00000630
          E2S.TKNR_FRA       = BLANKETT_RECORD.TKNR;                    00000640
          E2S.TKNR_TIL       = E2_BLANKETT.TKNR_NYTT;                   00000650
                                                                        00000660
                                                                        00000670
    END OVERFØR_E2_BLANKETT;                                            00000680
                                                                        00000690
                                                                        00000700
 /* ***************************************************************** */00000710
 /*   PROSEDYRE SOM FINNER OG TAR VARE PÅ FEILMELDINGSNUMRE DERSOM    */00000720
 /*   DET ER FEIL I DEN OVERFØRTE RECORDEN.                           */00000730
 /* ***************************************************************** */00000740
 FINN_FEIL_E2:PROC;                                                     00000750
                                                                        00000760
                                                                        00000770
          FEIL_IND = 1;                                                 00000780
                                                                        00000790
          IF E2S.FNRNR ^= 0  &                                          00000800
             E2S.FNRNR ^= 999 THEN                                      00000810
             DO;                                                        00000820
                W01_FEIL_NR(FEIL_IND) = E2S.FNRNR;                      00000830
                FEIL_IND = FEIL_IND + 1;                                00000840
             END;                                                       00000850
                                                                        00000860
          IF E2S.TKNR_FRANR ^= 0 &                                      00000870
             E2S.TKNR_FRANR ^= 999 THEN                                 00000880
             DO;                                                        00000890
                W01_FEIL_NR(FEIL_IND) = E2S.TKNR_FRANR;                 00000900
                FEIL_IND = FEIL_IND + 1;                                00000910
             END;                                                       00000920
                                                                        00000930
          IF E2S.TKNR_TILNR ^= 0 &                                      00000940
             E2S.TKNR_TILNR ^= 999 THEN                                 00000950
             DO;                                                        00000960
                W01_FEIL_NR(FEIL_IND) = E2S.TKNR_TILNR;                 00000970
                FEIL_IND = FEIL_IND + 1;                                00000980
             END;                                                       00000990
                                                                        00001000
                                                                        00001010
    END FINN_FEIL_E2;                                                   00001020
                                                                        00001030
                                                                        00001040
 %PAGE;                                                                 00001050
 /* ***************************************************************** */00001060
 /*          E K S T E R N E    P R O C E D U R E R                   */00001070
 /* ***************************************************************** */00001080
                                                                        00001090
                                                                        00001100
 %PAGE;                                                                 00001110
 %INCLUDE R0011502;          /*     BLANK E2 TRANSOMR  */               00001120
                                                                        00001130
 %PAGE;                                                                 00001140
 %INCLUDE R0011503;          /*     KONTR E2 BLANKETT  */               00001150
                                                                        00001160
                                                                        00001170
 END P115_BEHANDLE_E2;                                                  00001180
                                                                        00001190
                                                                        00001200
