 /*       SIST ENDRET 04/09-98 09.43.19 AV   JDA7339                  */00000000
 /*       SIST ENDRET 04/09-98 09.37.42 AV   JDA7339                  */00000010
 /*       SIST ENDRET 21/03-94 15.01.15 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 27/02-92 13.34.22 AV   TRUDE                    */00000030
 /*       SIST ENDRET 21/02-92 14.48.49 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 13/12-91 12.24.02 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 03/09-91 14.25.16 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 04/07-91 12.50.32 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 26/04-91 11.45.47 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 21/01-91 13.52.04 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 18/12-90 15.56.45 AV   HERMAN                   */00000100
 /*       SIST ENDRET 11/12-90 13.22.50 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 17/08-90 13.28.51 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 05/07-90 09.22.43 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 13/04-89 15.41.57 AV   HERMAN                   */00000140
 /*       SIST ENDRET 07/04-89 11.27.10 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 06/04-89 11.54.32 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 17/03-89 15.01.56 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 29/03-88 13.14.13 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 26/01-88 08.53.12 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 10/03-87 08.57.30 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 13/06-84 13.58.43 AV   OLAV                     */00000210
 /*       SIST ENDRET 20/04-83 08.41.22 AV   OLAV                     */00000220
 /* *************************************************************** */  00000230
 /*IDENTIFIKASJON:                                                  */  00000240
 /*    R0014221 - PROSEDYRE I PLI                                   */  00000250
 /*    PROGRAMMERER:          ROLF FARVIK     MARS -82.             */  00000260
 /*HENSIKT:                                                         */  00000270
 /*    BEREGNE FØRSTE DEL AV ALDERSPENSJONEN.                       */  00000280
 /*     BEREGNER 100 % - APD ER IKKE REGNET UT ENNÅ                 */  00000290
 /*PROGRAMTILKNYTNING:                                              */  00000300
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV ALDERSPENSJON-*/  00000310
 /*    SBEREGNINGEN.                                                */  00000320
 /*    INCLUDES I R0014201                                          */  00000330
 /*BRUK:                                                            */  00000340
 /*    CALL BEREGN_AP_DEL1;                                         */  00000350
 /*                                                                 */  00000360
 /* *************************************************************** */  00000370
                                                                        00000380
 %SKIP(2);                                                              00000390
 BEREGN_AP_DEL1:                                                        00000400
   PROC;                                                                00000410
 %SKIP;                                                                 00000420
  DCL W_BT               FIXED DEC(5)  INIT(0),                         00000430
      SUM_TP             FIXED DEC(5);                                  00000440
 DCL W_FNR_EK           PIC'(11)9';                                     00000450
 DCL ALDER_EK            FIXED DEC(5)  INIT (0);     /*HL*/             00000460
 DCL W_DATO_ÅM          PIC'(4)9';                                      00000470
 DCL W_ÅR  DEF W_DATO_ÅM POS(1)   PIC'99';                              00000480
 DCL W_MN  DEF W_DATO_ÅM POS(3)   PIC'99';                              00000490
 DCL W_DATO_MÅ          PIC'9999';                                      00000500
                                                                        00000510
 W_DATO_ÅM = B02.VIRK_DATO_ÅM(BER_SØ_IND);                              00000520
 W_DATO_MÅ = W_MN !! W_ÅR;                                              00000530
 W_FNR_EK  = B02.FNR(BER_EK_IND);                                       00000540
                                                                        00000550
 /* ***************************************************************** */00000560
 /* KALL UNDERPROGRAM SOM BEREGNER TILLEGGSPENSJON                    */00000570
 /* ***************************************************************** */00000580
                                                                        00000590
 %SKIP;                                                                 00000600
    CALL BEREGN_TP_AP;                      /*4231*/                    00000610
                                                                        00000620
    IF FEIL_MELD_NR > 0  THEN                                           00000630
       GO TO RETUR;                                                     00000640
    ELSE                                                                00000650
       PROGRAM_ID = 'R0014201';                                         00000660
                                                                        00000670
 %SKIP;                                                                 00000680
                                                                        00000690
 /* ***************************************************************** */00000700
 /* KALL UNDERPROGRAM SOM BEREGNER GRUNNPENSJON.                      */00000710
 /* ***************************************************************** */00000720
                                                                        00000730
 %SKIP;                                                                 00000740
    CALL BEREGN_GP_AP;                      /*4232*/                    00000750
 /* */                                                                  00000760
    SUM_TP = B02.ALDERSP.TP(BER_SØ_IND) + B02.TP_BRUTTO(BER_SØ_IND)     00000770
             + B02.GT_TILLEGG_LOV92(BER_SØ_IND);                        00000780
                                                                        00000790
 /* ***************************************************************** */00000800
 /* KALL FUNKSJON SOM BEREGNER SÆRTILLEGG.     4133                   */00000810
 /* ***************************************************************** */00000820
                                                                        00000830
     /*PENSJONSRETT_FØR_91 ER OPPDATERT I R0014232  */                  00000840
 IF (B02.BOSATT(BER_SØ_IND)  > 0          &             /*UTLAND*/      00000850
     B02.TT_16_66(BER_SØ_IND) = 0 )   &    /*NY0191*/                   00000860
     B02.ALDERSP.UTTAKSDATO_ÅM(BER_SØ_IND) < 9100  THEN  /*TS 210292*/  00000870
    DO;                                                                 00000880
       IF B02.PENSJONSTYPE2(BER_SØ_IND)  = 'F' THEN                     00000890
         DO;                                                            00000900
                                                                        00000910
  /*LOVENDRING OM BEHOVSPRØVET FORSØRGINGSTILLEGG FRA 1.5.91 :*/        00000920
  /* SÅ SNART DET SKAL BEREGNES MED HØYERE GRUNNBELØP ENN     */        00000930
  /* PR 30.4.91, SÅ SKAL ALL BEREGNING SKJE I R0014011        */        00000940
                                                                        00000950
            IF G > 34100 THEN                                           00000960
               DO;                                                      00000970
                  B02.ALDERSP.ET(BER_SØ_IND) = 0;                       00000980
  /*HL*/          IF B02.FT_SKAL_BEREGNES(BER_SØ_IND) ^= 'J'  THEN      00000990
                     B02.FT_SKAL_BEREGNES(BER_SØ_IND) = 'N';            00001000
               END;                                                     00001010
            ELSE                                                        00001020
               DO;                                                      00001030
                  B02.ALDERSP.ET(BER_SØ_IND)=                           00001040
                  F_ET_UTLAND( B02.TT_FØR_1967(BER_SØ_IND), /*4181*/    00001050
                            B02.TT_FØR_1967(BER_EK_IND),                00001060
                            B02.TT_ETTER_1966(BER_SØ_IND),              00001070
                            B02.TT_ETTER_1966(BER_EK_IND));             00001080
                                                                        00001090
                  IF B02.PENSJONSTYPE2(BER_SØ_IND)  = 'S' !             00001100
                    (B02.PENSJONSTYPE2(BER_SØ_IND) = 'N' &              00001110
                    (B02.SIVILSTAND (BER_SØ_IND)   = 'G' !  /*0898HL*/  00001120
                     B02.SIVILSTAND (BER_SØ_IND)   = 'P' !              00001130
                     B02.SIVILSTAND (BER_SØ_IND)   = 'W') &             00001140
                     B02.PENSJONSTYPE2(BER_EK_IND) = 'P') THEN          00001150
                     B02.ALDERSP.ET(BER_SØ_IND) = 0;                    00001160
               END;                                                     00001170
         END;                                                           00001180
       ELSE                                           /*TRUDE 0991*/    00001190
                     B02.ALDERSP.ET(BER_SØ_IND) = 0;                    00001200
                                                                        00001210
      CALL SÆRTILLEGG_UTLAND(SUM_TP);  /* R0014180 */                   00001220
      GO TO L500;                                                       00001230
    END;                                             /* TIL HIT TS   */ 00001240
 IF B02.PENSJONSTYPE2(BER_SØ_IND)  = 'S'   !                            00001250
    (B02.PENSJONSTYPE2(BER_SØ_IND) = 'N'   &                            00001260
    (B02.SIVILSTAND   (BER_SØ_IND) = 'G'   !          /*0898HL*/        00001270
     B02.SIVILSTAND   (BER_SØ_IND) = 'P'   !                            00001280
     B02.SIVILSTAND   (BER_SØ_IND) = 'W')  &                            00001290
     B02.PENSJONSTYPE2(BER_EK_IND) = 'P')  THEN                         00001300
                                                                        00001310
     DO;                                                                00001320
        B02.ALDERSP.ET(BER_SØ_IND) = 0;                                 00001330
        B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(               00001340
                                         SUM_TP,0,'JA',                 00001350
                                         ST_PROSENT_SAMST,              00001360
                                         100,                           00001370
                                         B02.TT_ANV(BER_SØ_IND));       00001380
    END;                                                                00001390
 ELSE                                                                   00001400
                                                                        00001410
 /*ENDRET 2.3.89 HL - DOBBELT ST TIL DEN SOM FORSØRGER EK > 60 */       00001420
                                                                        00001430
                                                                        00001440
                         /*** ET  ***/                                  00001450
 IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'F' THEN                            00001460
                                                                        00001470
       DO;                                                              00001480
                                                                        00001490
                                                                        00001500
  /*LOVENDRING OM BEHOVSPRØVET FORSØRGINGSTILLEGG FRA 1.5.91 :*/        00001510
  /* SÅ SNART DET SKAL BEREGNES MED HØYERE GRUNNBELØP ENN     */        00001520
  /* PR 30.4.91, SÅ SKAL ALL BEREGNING SKJE I R0014011        */        00001530
                                                                        00001540
            IF G > 34100 THEN                                           00001550
               DO;                                                      00001560
                  B02.ALDERSP.ET(BER_SØ_IND) = 0;                       00001570
  /*HL*/          IF B02.FT_SKAL_BEREGNES(BER_SØ_IND) ^= 'J'  THEN      00001580
                     B02.FT_SKAL_BEREGNES(BER_SØ_IND) = 'N';            00001590
               END;                                                     00001600
            ELSE                                                        00001610
               B02.ALDERSP.ET(BER_SØ_IND) = 0.5 * G *                   00001620
                   B02.TT_ANV(BER_SØ_IND) / (12 * 40) + 0.5;            00001630
                                                                        00001640
                                                                        00001650
                                                                        00001660
 /*HL*/   ALDER_EK = F_ALDER(W_FNR_EK,W_DATO_MÅ);                       00001670
                                                                        00001680
 /*HL*/   IF (ALDER_EK       >= 6000   &                                00001690
              W_DATO_ÅM      >  8903   &                                00001700
              W_DATO_ÅM      <  9100  )    !                            00001710
             (ALDER_EK       >= 6001   &                                00001720
              W_DATO_ÅM      >  9100  )      THEN                       00001730
                                                                        00001740
             B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(          00001750
                                         SUM_TP,0,'JA',                 00001760
                                        (ST_PROSENT_SAMST * 2),         00001770
                                         100,                           00001780
                                         B02.TT_ANV(BER_SØ_IND));       00001790
          ELSE                                                          00001800
                                                                        00001810
             B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(          00001820
                                         SUM_TP,0,'JA',                 00001830
                                         ST_PROSENT_ENSLIG,             00001840
                                         100,                           00001850
                                         B02.TT_ANV(BER_SØ_IND));       00001860
                                                                        00001870
           /*TILLEGGSTEST 03.94 TRUDE */                                00001880
                                                                        00001890
           IF  ALDER_EK       >= 6001   &                               00001900
               W_DATO_ÅM      >  9312   THEN                            00001910
                                                                        00001920
             B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(          00001930
                                         SUM_TP,0,'JA',                 00001940
                                        (ST_PROSENT_ENSLIG * 2),        00001950
                                         100,                           00001960
                                         B02.TT_ANV(BER_SØ_IND));       00001970
                                         /*TRUDE HIT 0394*/             00001980
       END;                                                             00001990
                                                                        00002000
 ELSE                                                                   00002010
                                                                        00002020
   DO;                                                                  00002030
                                                                        00002040
       B02.ALDERSP.ET(BER_SØ_IND) = 0;                                  00002050
                                                                        00002060
       B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(                00002070
                                         SUM_TP,0,'JA',                 00002080
                                         ST_PROSENT_ENSLIG,             00002090
                                         100,                           00002100
                                         B02.TT_ANV(BER_SØ_IND));       00002110
                                                                        00002120
   END;                                                                 00002130
                                                                        00002140
                                                                        00002150
                                                                        00002160
 /* ***************************************************************** */00002170
 /* KALL FUNKSJON SOM BEREGNER KOMPENSASJONSTILLEGG.  4134            */00002180
 /* ***************************************************************** */00002190
                                                                        00002200
 %SKIP;                                                                 00002210
   /*    ENDRET   17.03.88    SATISH                                 */ 00002220
 /*                                                                   */00002230
 /* B02.ALDERSP.KT(BER_SØ_IND) = F_BEREGN_KOMPENSASJONSTILLEGG(       */00002240
 /*                                  B02.PENSJONSTYPE2(BER_SØ_IND),   */00002250
 /*                                  B02.TT_ANV(BER_SØ_IND),0,1,'J'); */00002260
   /*     HITTIL                                                      */00002270
  L500:                                                                 00002280
    B02.ALDERSP.KT(BER_SØ_IND) = F_BEREGN_KOMPENSASJONSTILLEGG(         00002290
                                     B02.PENSJONSTYPE1(BER_SØ_IND),     00002300
                                     B02.PENSJONSTYPE2(BER_SØ_IND),     00002310
                                     B02.TT_ANV(BER_SØ_IND),0,1,'J');   00002320
 /* ***************************************************************** */00002330
 /* DEN PÅFØLGENDE TESTEN SKAL UNNGÅ Å GI UTENLANDSBOENDE KOMP.       */00002340
 /* ERIK 22.12.86.                                                    */00002350
 /* ***************************************************************** */00002360
                                                                        00002370
    IF B02.SPESOPPL.BOSATT(BER_SØ_IND) > 0 THEN                         00002380
       B02.ALDERSP.KT(BER_SØ_IND) = 0 ;                                 00002390
                                                                        00002400
    CALL BEREGN_BT(W_BT,100);                   /*4233*/                00002410
                                                                        00002420
    B02.ALDERSP.BT(BER_SØ_IND) = W_BT;                                  00002430
                                                                        00002440
    RETUR:                                                              00002450
                                                                        00002460
                                                                        00002470
   END BEREGN_AP_DEL1;                                                  00002480
