 /*       SIST ENDRET 30/09-91 13.21.38 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 06/03-91 11.47.27 AV   DYBVIK                   */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /* **********************                                            */00000040
 /*  PROGRAM-IDENT : R001NN12  UNDERPROGRAM SOM BRUKES AV R001NO10    */00000050
 /*                            KONTROLL U2-BLANKETT.                  */00000060
 /*  PROGRAM-SPRÅK : PLI                                              */00000070
 /*  PROGRAMMERER  : TRUDE SPONBERG                                   */00000080
 /*  PROGRAMMET BLE LAGET : NOV 1990                                  */00000090
 /* ***************************************************************** */00000100
 /*  ENDRINGERSDATO :                                                 */00000110
 /*  ENDRINGEN GJELDER:                                               */00000120
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000130
 /*                                                                   */00000140
 /* ***************************************************************** */00000150
 /*BRUK:                                                              */00000160
 /* ********                                                          */00000170
 /*                                                                   */00000180
 /*  %INCLUDE R001NN12                                                */00000190
 /*                                                                   */00000200
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */00000210
 /*                                                                   */00000220
 /*    R001N602   BLANK TRANSOMR                                      */00000230
 /*    R001N603   KONTR U2 SØKER                                      */00000240
 /*    R001N604   KONTR U2 BARN                                       */00000250
 /*    FUNKSJONER SOM BRUKES ER INCLUDET I HOVEDPROGRAMMET.           */00000260
 /*                                                                   */00000270
 /* ***************************************************************** */00000280
 /*                                                                   */00000290
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR U2 OG FLYTTER DERETTER        */00000300
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */00000310
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */00000320
 /*  NUMRE TATT VARE PÅ.                                              */00000330
 /*                                                                   */00000340
 /* ***************************************************************** */00000350
                                                                        00000360
 P106_BEHANDLE_U2: PROC;                                                00000370
                                                                        00000380
                                                                        00000390
 %INCLUDE P001N601;                      /* TRANSOMRÅDE U2 */           00000400
                                                                        00000410
                                                                        00000420
          CALL BLANK_U2_SØKER;                         /* R001N602 */   00000430
          CALL BLANK_U2_BARN;                          /* R001N602 */   00000440
          CALL BLANK_U2_MELDNR;                        /* R001N602 */   00000450
          CALL BLANK_U2_SPES;                          /* R001N602 */   00000460
          CALL BLANK_YP_U2  ;                          /* R001N602 */   00000470
          CALL OVERF_U2_BLANKETT;                                       00000480
          CALL KONTROLL_U2_SØKER(FEIL_FUNNET);         /* R001N603 */   00000490
                                                                        00000500
          IF ^FEIL_FUNNET                         &                     00000510
             F_FELT_PIC_CHAR2(U2S.BT_ANT) ^= '00' THEN                  00000520
             DO;                                                        00000530
                CALL OVERF_U2_BARN;                                     00000540
                CALL KONTROLL_U2_BARN(FEIL_FUNNET);    /* R001N604 */   00000550
             END;                                                       00000560
                                                                        00000570
          IF U2S.NORSK_BOSATT = 'N'   THEN                              00000580
             DO;                                                        00000590
                FEIL_I_BOSATT = TRUE;                                   00000600
                FEIL_FUNNET   = TRUE;                                   00000610
             END;                                                       00000620
                                                                        00000630
          IF FEIL_FUNNET      THEN                                      00000640
             CALL FINN_FEIL_U2;                                         00000650
                                                                        00000660
                                                                        00000670
                                                                        00000680
                                                                        00000690
 /* ***************************************************************** */00000700
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */00000710
 /*    RECORDEN TIL U2 TRANSOMRÅDE FOR U2 SØKER.                      */00000720
 /* ***************************************************************** */00000730
 OVERF_U2_BLANKETT:PROC;                                                00000740
                                                                        00000750
          U2S.ATT_UF       =  U2_BLANKETT.YTELSE;                       00000760
          U2S.REGDATO      =  BLANKETT_RECORD.TRANS_DATO_ÅMD;           00000770
          U2S.TERMID       = 'NORT';                                    00000780
          U2S.FNR          =  BLANKETT_RECORD.FNR;                      00000790
          U2S.NAVN         =  BLANKETT_RECORD.NAVN;                     00000800
          U2S.SPRÅK        =  U2_BLANKETT.SPRÅK;                        00000810
          U2S.TKNR         =  BLANKETT_RECORD.TKNR;                     00000820
          U2S.SIVILSTAND   =  U2_BLANKETT.SIVILSTAND;                   00000830
          U2S.TILL_EK      =  U2_BLANKETT.EKTEFELLETILLEGG;             00000840
          U2S.VIRK_DATO_MÅ =  U2_BLANKETT.VIRK_DATO_MÅ;                 00000850
                                                                        00000860
          IF F_FELT_PIC_CHAR3 (U2_BLANKETT.ANT_BARN) ^= '   '    THEN   00000870
             U2S.BT_ANT    =  U2_BLANKETT.ANT_BARN;                     00000880
                                                                        00000890
          U2S.NORSK_BOSATT =  U2_BLANKETT.NORSK_BOSATT;                 00000900
                                                                        00000910
          DO I = 1 TO 4;                                                00000920
             IF F_FELT_PIC_CHAR2 (U2_BLANKETT.VP_ÅR(I)) ^= '  ' THEN    00000930
                U2S.VP_ÅR(I) =  U2_BLANKETT.VP_ÅR(I);                   00000940
          END;                                                          00000950
                                                                        00000960
          U2S.UTDANNING      =  U2_BLANKETT.UTDANNING;                  00000970
          U2S.VILKÅR_8_4_3A  =  U2_BLANKETT.VILKÅR_8_4_3A;              00000980
          U2S.YRKESM_ATTF    =  U2_BLANKETT.YRKESM_ATTF;                00000990
                                                                        00001000
          IF F_FELT_PIC_CHAR3 (U2_BLANKETT.UFG) ^= '   '         THEN   00001010
             U2S.UFG       =  U2_BLANKETT.UFG;                          00001020
                                                                        00001030
          IF F_FELT_PIC_CHAR4 (U2_BLANKETT.UFT) ^= (4)' '   THEN        00001040
             U2S.UFT_MÅ    =  U2_BLANKETT.UFT;                          00001050
                                                                        00001060
          IF F_FELT_PIC_CHAR5 (U2_BLANKETT.PI) ^= (5)' '   THEN         00001070
             U2S.PI        =  U2_BLANKETT.PI * 100;                     00001080
                                                                        00001090
          IF F_FELT_PIC_CHAR2 (U2_BLANKETT.YRKE) ^= '  '   THEN         00001100
             U2S.YRKE      =  U2_BLANKETT.YRKE;                         00001110
                                                                        00001120
          IF F_FELT_PIC_CHAR11 (U2_BLANKETT.FNR_EK) ^= (11)' '   THEN   00001130
             U2S.FNR_EK    =  U2_BLANKETT.FNR_EK;                       00001140
                                                                        00001150
          U2S.NAVN_EK      =  U2_BLANKETT.NAVN_EK;                      00001160
          U2S.MINST4G      =  U2_BLANKETT.MINST4G;                      00001170
                                                                        00001180
                                                                        00001190
    END OVERF_U2_BLANKETT;                                              00001200
                                                                        00001210
                                                                        00001220
 /* ***************************************************************** */00001230
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */00001240
 /*    RECORDEN TIL U2 TRANSOMRÅDE FOR U2 BARN.                       */00001250
 /* ***************************************************************** */00001260
 OVERF_U2_BARN:PROC;                                                    00001270
                                                                        00001280
                                                                        00001290
          DO I = 1 TO 12 WHILE (F_FELT_PIC_CHAR11                       00001300
                               (U2_BLANKETT.FNR_BARN (I)) ^= (11)' ');  00001310
             U2B.FNR_BARN(I) = U2_BLANKETT.FNR_BARN(I);                 00001320
             U2B.RBT_BARN(I) = U2_BLANKETT.RED_BT(I);                   00001330
          END;                                                          00001340
                                                                        00001350
                                                                        00001360
    END OVERF_U2_BARN;                                                  00001370
                                                                        00001380
                                                                        00001390
                                                                        00001400
 /* ***************************************************************** */00001410
 /*    PROCEDURE SOM FINNER OG TAR VARE PÅ FEIL_MELD_NR NÅR DET ER    */00001420
 /*    FEIL I DEN OVERFØRTE RECORDEN.                                 */00001430
 /* ***************************************************************** */00001440
 FINN_FEIL_U2:PROC;                                                     00001450
                                                                        00001460
    DCL ANT_BARN              FIXED BIN (15);                           00001470
                                                                        00001480
          FEIL_IND = 1;                                                 00001490
                                                                        00001500
          IF U2S.ATT_UFNR ^= 0 &                                        00001510
             U2S.ATT_UFNR ^= 999 THEN                                   00001520
             DO;                                                        00001530
                W01_FEIL_NR(FEIL_IND) = U2S.ATT_UFNR;                   00001540
                FEIL_IND = FEIL_IND + 1;                                00001550
             END;                                                       00001560
                                                                        00001570
          IF U2S.FNRNR ^= 0 &                                           00001580
             U2S.FNRNR ^= 999 THEN                                      00001590
             DO;                                                        00001600
                W01_FEIL_NR(FEIL_IND) = U2S.FNRNR;                      00001610
                FEIL_IND = FEIL_IND + 1;                                00001620
             END;                                                       00001630
                                                                        00001640
          IF U2S.TKNRNR ^= 0 &                                          00001650
             U2S.TKNRNR ^= 999 THEN                                     00001660
             DO;                                                        00001670
                W01_FEIL_NR(FEIL_IND) = U2S.TKNRNR;                     00001680
                IF FEIL_IND ^= 3 THEN                                   00001690
                   FEIL_IND = FEIL_IND + 1;                             00001700
             END;                                                       00001710
                                                                        00001720
          IF U2S.NAVNNR ^= 0 &                                          00001730
             U2S.NAVNNR ^= 999 THEN                                     00001740
             DO;                                                        00001750
                W01_FEIL_NR(FEIL_IND) = U2S.NAVNNR;                     00001760
                IF FEIL_IND ^= 3 THEN                                   00001770
                   FEIL_IND  = FEIL_IND + 1;                            00001780
             END;                                                       00001790
                                                                        00001800
          IF U2S.SPRÅKNR ^= 0 &                                         00001810
             U2S.SPRÅKNR ^= 999 THEN                                    00001820
             DO;                                                        00001830
                W01_FEIL_NR(FEIL_IND) = U2S.SPRÅKNR;                    00001840
                IF FEIL_IND ^= 3 THEN                                   00001850
                   FEIL_IND  = FEIL_IND + 1;                            00001860
             END;                                                       00001870
                                                                        00001880
          IF U2S.SIVILSTANDNR ^= 0 &                                    00001890
             U2S.SIVILSTANDNR ^= 999 THEN                               00001900
             DO;                                                        00001910
                W01_FEIL_NR(FEIL_IND) = U2S.SIVILSTANDNR;               00001920
                IF FEIL_IND ^= 3 THEN                                   00001930
                   FEIL_IND  = FEIL_IND + 1;                            00001940
             END;                                                       00001950
                                                                        00001960
          IF U2S.TILL_EKNR ^= 0 &                                       00001970
             U2S.TILL_EKNR ^= 999 THEN                                  00001980
             DO;                                                        00001990
                W01_FEIL_NR(FEIL_IND) = U2S.TILL_EKNR;                  00002000
                IF FEIL_IND ^= 3 THEN                                   00002010
                   FEIL_IND  = FEIL_IND + 1;                            00002020
             END;                                                       00002030
                                                                        00002040
          IF U2S.NORSK_BOSATTNR ^= 0 &                                  00002050
             U2S.NORSK_BOSATTNR ^= 999 THEN                             00002060
             DO;                                                        00002070
                W01_FEIL_NR(FEIL_IND) = U2S.NORSK_BOSATTNR;             00002080
                IF FEIL_IND ^= 3 THEN                                   00002090
                   FEIL_IND  = FEIL_IND + 1;                            00002100
             END;                                                       00002110
                                                                        00002120
          IF U2S.BT_ANTNR ^= 0 &                                        00002130
             U2S.BT_ANTNR ^= 999 THEN                                   00002140
             DO;                                                        00002150
                W01_FEIL_NR(FEIL_IND) = U2S.BT_ANTNR;                   00002160
                IF FEIL_IND ^= 3 THEN                                   00002170
                   FEIL_IND  = FEIL_IND + 1;                            00002180
             END;                                                       00002190
                                                                        00002200
          DO I = 1 TO 4;                                                00002210
             IF U2S.VP_ÅRNR(I) ^= 0 &                                   00002220
                U2S.VP_ÅRNR(I) ^= 999 THEN                              00002230
                DO;                                                     00002240
                   W01_FEIL_NR(FEIL_IND) = U2S.VP_ÅRNR(I);              00002250
                   IF FEIL_IND ^= 3 THEN                                00002260
                      FEIL_IND = FEIL_IND + 1;                          00002270
                END;                                                    00002280
          END;                                                          00002290
                                                                        00002300
                                                                        00002310
          IF U2S.UTDANNINGNR ^= 0 &                                     00002320
             U2S.UTDANNINGNR ^= 999 THEN                                00002330
             DO;                                                        00002340
                W01_FEIL_NR(FEIL_IND) = U2S.UTDANNINGNR;                00002350
                IF FEIL_IND ^= 3 THEN                                   00002360
                   FEIL_IND  = FEIL_IND + 1;                            00002370
             END;                                                       00002380
                                                                        00002390
          IF U2S.YRKESM_ATTFNR ^= 0 &                                   00002400
             U2S.YRKESM_ATTFNR ^= 999 THEN                              00002410
             DO;                                                        00002420
                W01_FEIL_NR(FEIL_IND) = U2S.YRKESM_ATTFNR;              00002430
                IF FEIL_IND ^= 3 THEN                                   00002440
                   FEIL_IND  = FEIL_IND + 1;                            00002450
             END;                                                       00002460
                                                                        00002470
          IF U2S.VILKÅR_8_4_3ANR ^= 0 &                                 00002480
             U2S.VILKÅR_8_4_3ANR ^= 999 THEN                            00002490
             DO;                                                        00002500
                W01_FEIL_NR(FEIL_IND) = U2S.VILKÅR_8_4_3ANR;            00002510
                IF FEIL_IND ^= 3 THEN                                   00002520
                   FEIL_IND  = FEIL_IND + 1;                            00002530
             END;                                                       00002540
                                                                        00002550
          IF U2S.UFGNR ^= 0 &                                           00002560
             U2S.UFGNR ^= 999 THEN                                      00002570
             DO;                                                        00002580
                W01_FEIL_NR(FEIL_IND) = U2S.UFGNR;                      00002590
                IF FEIL_IND ^= 3 THEN                                   00002600
                   FEIL_IND  = FEIL_IND + 1;                            00002610
             END;                                                       00002620
                                                                        00002630
          IF U2S.UFT_MÅNR ^= 0 &                                        00002640
             U2S.UFT_MÅNR ^= 999 THEN                                   00002650
             DO;                                                        00002660
                W01_FEIL_NR(FEIL_IND) = U2S.UFT_MÅNR;                   00002670
                IF FEIL_IND ^= 3 THEN                                   00002680
                   FEIL_IND  = FEIL_IND + 1;                            00002690
             END;                                                       00002700
                                                                        00002710
          IF U2S.PINR ^= 0 &                                            00002720
             U2S.PINR ^= 999 THEN                                       00002730
             DO;                                                        00002740
                W01_FEIL_NR(FEIL_IND) = U2S.PINR;                       00002750
                IF FEIL_IND ^= 3 THEN                                   00002760
                   FEIL_IND  = FEIL_IND + 1;                            00002770
             END;                                                       00002780
                                                                        00002790
          IF U2S.YRKENR ^= 0 &                                          00002800
             U2S.YRKENR ^= 999 THEN                                     00002810
             DO;                                                        00002820
                W01_FEIL_NR(FEIL_IND) = U2S.YRKENR;                     00002830
                IF FEIL_IND ^= 3 THEN                                   00002840
                   FEIL_IND  = FEIL_IND + 1;                            00002850
             END;                                                       00002860
                                                                        00002870
          IF U2S.VIRK_DATO_MÅNR ^= 0 &                                  00002880
             U2S.VIRK_DATO_MÅNR ^= 999 THEN                             00002890
             DO;                                                        00002900
                W01_FEIL_NR(FEIL_IND) = U2S.VIRK_DATO_MÅNR;             00002910
                IF FEIL_IND ^= 3 THEN                                   00002920
                   FEIL_IND  = FEIL_IND + 1;                            00002930
             END;                                                       00002940
                                                                        00002950
          IF U2S.FNR_EKNR ^= 0 &                                        00002960
             U2S.FNR_EKNR ^= 999 THEN                                   00002970
             DO;                                                        00002980
                W01_FEIL_NR(FEIL_IND) = U2S.FNR_EKNR;                   00002990
                IF FEIL_IND ^= 3 THEN                                   00003000
                   FEIL_IND  = FEIL_IND + 1;                            00003010
             END;                                                       00003020
                                                                        00003030
          IF U2S.NAVN_EKNR ^= 0 &                                       00003040
             U2S.NAVN_EKNR ^= 999 THEN                                  00003050
             DO;                                                        00003060
                W01_FEIL_NR(FEIL_IND) = U2S.NAVN_EKNR;                  00003070
                IF FEIL_IND ^= 3 THEN                                   00003080
                   FEIL_IND  = FEIL_IND + 1;                            00003090
             END;                                                       00003100
                                                                        00003110
          IF U2S.MINST4GNR ^= 0 &                                       00003120
             U2S.MINST4GNR ^= 999 THEN                                  00003130
             DO;                                                        00003140
                W01_FEIL_NR(FEIL_IND) = U2S.MINST4GNR;                  00003150
                IF FEIL_IND ^= 3 THEN                                   00003160
                   FEIL_IND  = FEIL_IND + 1;                            00003170
             END;                                                       00003180
                                                                        00003190
                                                                        00003200
          DO ANT_BARN = 1 TO 12 WHILE (F_FELT_PIC_CHAR11                00003210
                                   (U2B.FNR_BARN(ANT_BARN)) ^= (11)'0');00003220
                                                                        00003230
             IF U2B.FNR_BARNNR(ANT_BARN) ^= 0   &                       00003240
                U2B.FNR_BARNNR(ANT_BARN) ^= 999 THEN                    00003250
                DO;                                                     00003260
                   W01_FEIL_NR(FEIL_IND) = U2B.FNR_BARNNR(ANT_BARN);    00003270
                   IF FEIL_IND ^= 3 THEN                                00003280
                      FEIL_IND  = FEIL_IND + 1;                         00003290
                END;                                                    00003300
                                                                        00003310
             IF U2B.RBT_BARNNR(ANT_BARN) ^= 0   &                       00003320
                U2B.RBT_BARNNR(ANT_BARN) ^= 999 THEN                    00003330
                DO;                                                     00003340
                   W01_FEIL_NR(FEIL_IND) = U2B.RBT_BARNNR(ANT_BARN);    00003350
                   IF FEIL_IND ^= 3 THEN                                00003360
                      FEIL_IND  = FEIL_IND + 1;                         00003370
                END;                                                    00003380
                                                                        00003390
          END;                                                          00003400
                                                                        00003410
                                                                        00003420
                                                                        00003430
    END FINN_FEIL_U2;                                                   00003440
                                                                        00003450
                                                                        00003460
                                                                        00003470
 %PAGE;                                                                 00003480
 /* ***************************************************************** */00003490
 /*          E K S T E R N E    P R O C E D U R E R                   */00003500
 /* ***************************************************************** */00003510
                                                                        00003520
 %PAGE;                                                                 00003530
 %INCLUDE R001N602;          /*     BLANK U2 TRANSOMR   */              00003540
 %PAGE;                                                                 00003550
 %INCLUDE R001N603;          /*     KONTR U2 SØKER      */              00003560
 %PAGE;                                                                 00003570
 %INCLUDE R001N604;          /*     KONTR U2 BARN       */              00003580
                                                                        00003590
                                                                        00003600
 END P106_BEHANDLE_U2;                                                  00003610
                                                                        00003620
                                                                        00003630
