 /*       SIST ENDRET 24/07-92 10.10.44 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 23/03-92 14.59.18 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 08/01-92 15.45.05 AV   HERMAN                   */00000020
 /*       SIST ENDRET 13/12-91 12.20.48 AV   DYBVIK                   */00000030
 /* ***************************************************************** */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /*    R0014111 - BEREGN_GTLOV92_AE      - UNDERPROGRAM I PLI         */00000060
 /*    PROGRAMMERER: HERMAN        DES 1991                           */00000070
 /*HENSIKT:                                                           */00000080
 /*    REGNER B02.GT_LOV92                                            */00000090
 /*          (GAR92_EGEN, GAR92_EGEN_55 OG GAR92_AVD)                 */00000100
 /*PROGRAMTILKNYTNING:                                                */00000110
 /*    PROGRAMMET BLIR INKLUDERT I R0014101-(BEREGN_ETTERLATT_AP)     */00000120
 /*    OG CALLET FRA               R0014126-(BEREGN_ETTERLATT_AP_DEL3)*/00000130
 /* ***************************************************************** */00000140
                                                                        00000150
 BEREGN_GTLOV92_AE: PROC;                                               00000160
                                                                        00000170
   DCL  W_KAP11_TP_BRUTTO     FIXED DEC (11,4)  INIT (0);               00000180
   DCL  KAP11_TP_BRUTTO       FIXED DEC (5)     INIT (0);               00000190
   DCL  VANLIG_TP_BRUTTO      FIXED DEC (5)     INIT(0);                00000200
   DCL  W_APD                 FIXED DEC (3)     INIT(0);                00000210
    DCL MINUS             FIXED DEC (3,2) INIT (0);                     00000220
    DCL SPT_UTEN_PT       FIXED DEC (3,2) INIT (0);                     00000230
    DCL OPT_UTEN_PT       FIXED DEC (3,2) INIT (0);                     00000240
                                                                        00000250
   IF B02.ALDERSP.APD(BER_SØ_IND) = 0    &                              00000260
      W_FNR_ÅM > 2412                    &                              00000270
      FNR_R.ÅRHUNDRE < 500                 THEN                         00000280
      W_APD = 100;                                                      00000290
   ELSE                                                                 00000300
      W_APD = B02.ALDERSP.APD(BER_SØ_IND);                              00000310
                                                                        00000320
 /*HVIS GJENLEVENDE HAR POENGTILLEGG, SÅ MÅ DETTE FJERNES I EGENPENSJ.*/00000330
                                                                        00000340
          IF B01.POENGTILLEGG_KODE(BER_SØ_IND) = 'A'      THEN          00000350
             MINUS = 1;                                                 00000360
          ELSE                                                          00000370
          IF B01.POENGTILLEGG_KODE(BER_SØ_IND) = 'B'      THEN          00000380
             MINUS = 0.5;                                               00000390
          IF MINUS > 0       THEN                                       00000400
             DO;                                                        00000410
                SPT_UTEN_PT = B02.ALDERSP.SPT_1291(BER_SØ_IND) - MINUS; 00000420
                IF B02.ALDERSP.OPT_1291(BER_SØ_IND) > SPT_UTEN_PT THEN  00000430
                   OPT_UTEN_PT = SPT_UTEN_PT;                           00000440
                ELSE                                                    00000450
                   OPT_UTEN_PT = B02.ALDERSP.OPT_1291(BER_SØ_IND);      00000460
             END;                                                       00000470
          ELSE                                                          00000480
             DO;                                                        00000490
                SPT_UTEN_PT = B02.ALDERSP.SPT_1291(BER_SØ_IND);         00000500
                OPT_UTEN_PT = B02.ALDERSP.OPT_1291(BER_SØ_IND);         00000510
             END;                                                       00000520
                                                                        00000530
                                                                        00000540
   GAR92_EGEN        =  F_TILLEGGSPENSJON(FNR_R.ÅR,35500,               00000550
                         SPT_UTEN_PT,                                   00000560
                         OPT_UTEN_PT,                                   00000570
                           B02.ALDERSP.PÅ_1291(BER_SØ_IND),             00000580
                           W_APD,100,'J');                              00000590
                                                                        00000600
                                                                        00000610
   GAR92_EGEN_55     = F_TILLEGGSPENSJON(FNR_R.ÅR,35500,                00000620
                           B02.ALDERSP.SPT_1291(BER_SØ_IND),            00000630
                           B02.ALDERSP.OPT_1291(BER_SØ_IND),            00000640
                           B02.ALDERSP.PÅ_1291(BER_SØ_IND),             00000650
                           W_APD,55,'J');                               00000660
                                                                        00000670
                                                                        00000680
   GAR92_AVD         = F_TILLEGGSPENSJON(FNR_EK_R.ÅR_EK,35500,          00000690
                           B02.ETTEPENS.SPT_1291(BER_SØ_IND),           00000700
                           B02.ETTEPENS.OPT_1291(BER_SØ_IND),           00000710
                           B02.ETTEPENS.PÅ_1291(BER_SØ_IND),            00000720
                           W_APD,                                       00000730
                           B02.TP_PROSENT(BER_SØ_IND),'J');             00000740
                                                                        00000750
                                                                        00000760
   IF B02.YRKEPENS.YUG(BER_EK_IND) > 0       THEN                       00000770
      DO;                                                               00000780
         IF B02.YRKEPENS.YPT(BER_EK_IND) <                              00000790
            B02.YRKE_POENG_1291(BER_EK_IND)      THEN                   00000800
            B02.YRKEPENS.YPT(BER_EK_IND) =                              00000810
            B02.YRKE_POENG_1291(BER_EK_IND);                            00000820
         W_KAP11_TP_BRUTTO =  G * 0.45;                                 00000830
         W_KAP11_TP_BRUTTO =  W_KAP11_TP_BRUTTO / 12;                   00000840
         W_KAP11_TP_BRUTTO =  W_KAP11_TP_BRUTTO *                       00000850
                               B02.YRKEPENS.YPT(BER_EK_IND);            00000860
         W_KAP11_TP_BRUTTO =  W_KAP11_TP_BRUTTO *                       00000870
                               B02.YRKEPENS.YUG(BER_EK_IND);            00000880
         W_KAP11_TP_BRUTTO =  W_KAP11_TP_BRUTTO / 100;                  00000890
         W_KAP11_TP_BRUTTO =  W_KAP11_TP_BRUTTO *                       00000900
                               B02.TP_PROSENT(BER_SØ_IND);              00000910
         W_KAP11_TP_BRUTTO =  W_KAP11_TP_BRUTTO / 100;                  00000920
         KAP11_TP_BRUTTO   =  W_KAP11_TP_BRUTTO + 0.5;                  00000930
                                                                        00000940
         VANLIG_TP_BRUTTO = GAR92_AVD *                                 00000950
                     B02.YRKEPENS.YUG(BER_EK_IND) / 100 + 0.5;          00000960
                                                                        00000970
         IF KAP11_TP_BRUTTO > VANLIG_TP_BRUTTO       THEN               00000980
                     GAR92_AVD = GAR92_AVD + KAP11_TP_BRUTTO -          00000990
                                VANLIG_TP_BRUTTO;                       00001000
      END;                                                              00001010
                                                                        00001020
   IF GAR92_EGEN > (GAR92_EGEN_55 + GAR92_AVD)         THEN             00001030
      B02.GT_LOV92(BER_SØ_IND) = GAR92_EGEN;                            00001040
    ELSE                                                                00001050
       B02.GT_LOV92(BER_SØ_IND) = GAR92_EGEN_55 + GAR92_AVD;            00001060
                                                                        00001070
                                                                        00001080
 RETUR:                                                                 00001090
                                                                        00001100
 END BEREGN_GTLOV92_AE;                                                 00001110
