 /*       SIST ENDRET 08/05-98 12.39.43 AV   JDA7339                  */00000000
 /*       SIST ENDRET 05/05-98 13.02.40 AV   JDA7339                  */00000010
 /*       SIST ENDRET 24/02-97 13.13.50 AV   JDA7339                  */00000020
 /*       SIST ENDRET 31/01-97 14.00.13 AV   JDA0310                  */00000030
 /* ***************************************************************** */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /*    R0014016 - PROSEDYRE I PLI. (VERSJON AV 4244?)                 */00000060
 /*    PROGRAMMERER: HERMAN JAN 97                                    */00000070
 /*HENSIKT:                                                           */00000080
 /*    RUTINEN OPPDATERER TP_NETTO,GP_NETTO,SÆRTILLEGG OG KOMPTILLEGG */00000090
 /*    HERETTER ER ALDERSP.GP/TP/ST BRUTTO BELØPENE                   */00000100
 /*    HERETTER ER ALDERSP.AP_GP_NETTO /-TP-/-ST- NETTO -BELØPENE     */00000110
 /* PROGRAMMET ER EN ENDRET KOPI AV 4139 PGA LOVENDRING 0197          */00000120
 /* REDUKSJON ER ENDRET FRA 50 % TIL 40 %  (IKKE FOR TIDLIGERE AFP)   */00000130
 /*PROGRAMTILKNYTNING:                                                */00000140
 /*    PROGRAMMET BLIR INKLUDERT I R0014201 OG 4101                   */00000150
 /*BRUK:                                                              */00000160
 /*    CALL JUSTER_AP_40PROS                                          */00000170
 /* ***************************************************************** */00000180
                                                                        00000190
 JUSTER_MED_40PROS: PROC(INDEX);                                        00000200
                                                                        00000210
    DCL                                                                 00000220
        INDEX        FIXED BIN (15);                                    00000230
    DCL                                                                 00000240
       I             FIXED BIN(15),                                     00000250
       FRADRAG_F     DEC FIXED(7) INIT (0),                             00000260
       REST_FRADRAG  DEC FIXED(5)  INIT (0),                            00000270
       W_BRUTTO_AP   DEC FIXED(7) INIT (0),                             00000280
       W_BRUTTO_GP   DEC FIXED(5) INIT (0),                             00000290
       W_BRUTTO_TP   DEC FIXED(5) INIT (0),                             00000300
       W_BRUTTO_TP_EP DEC FIXED(7) INIT (0),                            00000310
       W_BRUTTO_ST   DEC FIXED(5) INIT (0),                             00000320
       W_BRUTTO_GT   DEC FIXED(7) INIT (0),                             00000330
       W_SUM_TP      DEC FIXED(7) INIT (0),                             00000340
       W_SUM_YTELSE  DEC FIXED(7) INIT (0),                             00000350
       W_YP_AP       DEC FIXED(7) INIT (0),                             00000360
       W_YP          DEC FIXED(7) INIT (0),                             00000370
       W_NETTO_AP    DEC FIXED(7) INIT (0),                             00000380
       W_ST_FRADRAG  DEC FIXED(5)  INIT (0),                            00000390
       W_GP_FRADRAG  DEC FIXED(5)  INIT (0),                            00000400
       W_TAI         DEC FIXED(7)  INIT (0),                            00000410
       W_ALDER_ÅM    PIC '9999',                                        00000420
       W_ETTER92     DEC FIXED(7)  INIT (0);                            00000430
                                                                        00000440
    DCL KODE         CHAR (1) INIT (' ');                               00000450
    DCL HJ_FAI       FIXED DEC (7);                                     00000460
    DCL W_FNR        FIXED DEC (11);                                    00000470
                                                                        00000480
    DCL ROUND        BUILTIN;                                           00000490
                                                                        00000500
   W_FNR  = B02.FNR(INDEX);                                             00000510
   DIV_PARAM_OMR.AP_KODE_AEY(INDEX)       =  'R';     /**HL*/           00000520
   W_ALDER_ÅM   = F_ALDER((W_FNR),(TRANS_OPPL_OMR.VIRKNINGSDATO));      00000530
                                                                        00000540
   IF W_ALDER_ÅM  > 7000  THEN                                          00000550
     DO;                                                                00000560
       B02.ALDERSP.FAI(INDEX)             = 0;                          00000570
       B02.ETTEPENS.FORVENTET(INDEX)       = 0;                         00000580
     END;                                                               00000590
                                                                        00000600
   /* VED ETTERLATT ER ALDERSP.TP ER ALEREDE OPPDATERT MED */           00000610
   /* EGEN YP . TRUDE 0492                                       */     00000620
                                                                        00000630
   IF B02.KONV_P_KODE(INDEX)        = 'Y'  &                            00000640
      B02.PENSJONSTYPE2(INDEX) ^=        'E'   THEN   /*TS0492*/        00000650
     DO;                                                                00000660
      B02.ALDERSP.APD(INDEX)       = 100;                               00000670
     END;                                                               00000680
                                                                        00000690
                                                                        00000700
   /* GP OG TP BRUTTO ER UTREGNET TIDLIGERE   */                        00000710
                                                                        00000720
   W_BRUTTO_GP  = B02.ALDERSP.GP(INDEX);                                00000730
   W_BRUTTO_TP  = B02.ALDERSP.TP(INDEX);                                00000740
   W_BRUTTO_ST  = DIV_PARAM_OMR.FULLT_SÆRTILLEGG(INDEX);                00000750
   B02.ALDERSP.ST(INDEX)  = W_BRUTTO_ST;                                00000760
   W_BRUTTO_TP_EP = B02.TP_BRUTTO(INDEX);                               00000770
   W_ETTER92    = W_BRUTTO_TP + W_BRUTTO_ST + W_BRUTTO_TP_EP;           00000780
                                                                        00000790
   IF B02.GT_LOV92(INDEX)       > W_ETTER92        THEN                 00000800
      W_BRUTTO_GT = B02.GT_LOV92(INDEX) - W_ETTER92;                    00000810
                                                                        00000820
   W_BRUTTO_AP       = W_BRUTTO_GP + W_BRUTTO_TP + W_BRUTTO_ST          00000830
                       + B02.TP_BRUTTO(INDEX)                           00000840
                       + W_BRUTTO_GT;                                   00000850
                                                                        00000860
   W_SUM_TP          = W_BRUTTO_TP                                      00000870
                       + B02.TP_BRUTTO(INDEX);                          00000880
   W_TAI    = DIV_PARAM_OMR.TAI(INDEX);                                 00000890
   HJ_FAI  = B02.FAI(INDEX) * 100;                                      00000900
                                                                        00000910
 IF HJ_FAI  > G THEN                                                    00000920
   DO;                                                                  00000930
    FRADRAG_F = (B02.FAI(INDEX) * 100);                                 00000940
    FRADRAG_F = FRADRAG_F - G;                                          00000950
                                                                        00000960
    IF FRADRAG_F > 0 THEN                                               00000970
       FRADRAG_F = ( FRADRAG_F * 0.4 ) / 12;                            00000980
                                                                        00000990
   IF FRADRAG_F > W_BRUTTO_AP THEN                                      00001000
       DO;                                                              00001010
        IF B02.KONV_P_KODE(INDEX)       = 'E' !                         00001020
           B02.PENSJONSTYPE2(INDEX)       = 'E' THEN GOTO L999;         00001030
                                                                        00001040
      /*   B02.ALDERSP.GP         (INDEX)         = 0;  */              00001050
           B02.ALDERSP.AP_GP_NETTO(INDEX)         = 0;                  00001060
     /*    B02.ALDERSP.TP         (INDEX)         = 0;   */             00001070
           B02.ALDERSP.AP_TP_NETTO(INDEX)         = 0;                  00001080
           B02.TP_NETTO           (INDEX)         = 0;                  00001090
           B02.ALDERSP.ST         (INDEX)         = 0;                  00001100
       END;                                                             00001110
                                                                        00001120
   ELSE                                                                 00001130
       DO;                                                              00001140
                                                                        00001150
 /* ***************************************************************** */00001160
 /* FRADRAGET ER MINDRE ENN GP + TP + ST                              */00001170
 /* ***************************************************************** */00001180
                                                                        00001190
          DIV_PARAM_OMR.AP_KODE_AEY(INDEX)       =  'R';  /*HL*/        00001200
                                                                        00001210
          W_NETTO_AP    = W_BRUTTO_AP - FRADRAG_F;                      00001220
                                                                        00001230
                                                                        00001240
          IF W_YP > W_NETTO_AP   THEN                                   00001250
            DO;                                                         00001260
               W_NETTO_AP   =  W_YP;                                    00001270
               FRADRAG_F    =  W_BRUTTO_AP - W_NETTO_AP;                00001280
               DIV_PARAM_OMR.AP_KODE_AEY(INDEX)        =  'Y';          00001290
               IF FRADRAG_F  <=  0 THEN              /*TS < 0  050593*/ 00001300
                              /*STM NEDENFOR LAGT INN 060593, TRUDE */  00001310
                  DO;                                                   00001320
        B02.AP_GP_NETTO(INDEX)        = B02.ALDERSP.GP(INDEX);          00001330
        B02.AP_TP_NETTO(INDEX)        = B02.ALDERSP.TP(INDEX);          00001340
        B02.TP_NETTO(INDEX)           = B02.TP_BRUTTO (INDEX);          00001350
        B02.ALDERSP.ST(INDEX)         = B02.ALDERSP.ST(INDEX);          00001360
        GOTO L500;  /*TS  050593*/                                      00001370
                  END;   /*FRADRAG <= 0 */                              00001380
            END;                                                        00001390
                                                                        00001400
                                                                        00001410
          B02.AP_GP_NETTO(INDEX) = ROUND(W_BRUTTO_GP *                  00001420
                                      W_NETTO_AP / W_BRUTTO_AP , 0);    00001430
                                                                        00001440
          REST_FRADRAG = FRADRAG_F - W_BRUTTO_GP                        00001450
                                   + B02.AP_GP_NETTO(INDEX);            00001460
          IF B02.TP_BRUTTO(INDEX) > 0 THEN                              00001470
            DO;                                                         00001480
             DCL TRUDE_TP  FIXED DEC (5);                               00001490
               B02.TP_NETTO(INDEX) =                                    00001500
                                   ROUND(B02.TP_BRUTTO(INDEX)           00001510
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);    00001520
               TRUDE_TP  = B02.TP_NETTO(INDEX);                         00001530
               REST_FRADRAG =  REST_FRADRAG -                           00001540
                               B02.TP_BRUTTO(INDEX) +                   00001550
                               B02.TP_NETTO(INDEX);                     00001560
            END;                                                        00001570
                                                                        00001580
          IF W_BRUTTO_GT   > 0 THEN                                     00001590
            DO;                                                         00001600
             B02.GT_TILLEGG_LOV92(INDEX)       =                        00001610
                              ROUND(W_BRUTTO_GT                         00001620
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);    00001630
              REST_FRADRAG =  REST_FRADRAG -                            00001640
                               W_BRUTTO_GT +                            00001650
                               B02.GT_TILLEGG_LOV92(INDEX);             00001660
            END;                                                        00001670
          ELSE                                                          00001680
            DO;                                                         00001690
             B02.GT_TILLEGG_LOV92(INDEX)       = 0;                     00001700
            END;                                                        00001710
          IF W_BRUTTO_TP > 0 THEN                                       00001720
            DO;                                                         00001730
                 IF B02.ALDERSP.ST(INDEX)       =  0 THEN               00001740
                    B02.AP_TP_NETTO(INDEX) =                            00001750
                             B02.ALDERSP.TP(INDEX) - REST_FRADRAG;      00001760
                 ELSE                                                   00001770
                  DO;                                                   00001780
                   B02.AP_TP_NETTO(INDEX) = ROUND(W_BRUTTO_TP *         00001790
                                  W_NETTO_AP / W_BRUTTO_AP , 0);        00001800
                   REST_FRADRAG =  REST_FRADRAG -                       00001810
                                   W_BRUTTO_TP +                        00001820
                                   B02.AP_TP_NETTO(INDEX);              00001830
                  END;                                                  00001840
            END;                                                        00001850
                                                                        00001860
          IF B02.ALDERSP.ST(INDEX)        > 0 THEN                      00001870
                 B02.ALDERSP.ST(INDEX)       =                          00001880
                           B02.ALDERSP.ST(INDEX) - REST_FRADRAG;        00001890
                                                                        00001900
     END;                                                               00001910
                                                                        00001920
    IF B02.AP_GP_NETTO(INDEX) +                                         00001930
       B02.AP_TP_NETTO(INDEX) < 10 THEN                                 00001940
                                                                        00001950
       DO;                                                              00001960
          B02.AP_GP_NETTO(INDEX)            = 0;                        00001970
          B02.AP_TP_NETTO(INDEX)            = 0;                        00001980
          B02.ALDERSP.ST(INDEX)             = 0;                        00001990
          B02.GT_LOV92  (INDEX)             = 0;                        00002000
                                                                        00002010
          B02.GARANTITILLEGG_EK(INDEX)                = 0;              00002020
          B02.GARANTITILLEGG_BARN(INDEX)              = 0;              00002030
          B02.BT_SÆRBARN(INDEX)                       = 0;              00002040
          B02.GARANTITILLEGG_SÆRBARN(INDEX)           = 0;              00002050
          B02.FT_SKAL_BEREGNES(INDEX)                 = 'D';            00002060
                                                                        00002070
       END;                                                             00002080
   END;                                                                 00002090
 ELSE   /*FRADRAGET ER MINDRE ENN G */                                  00002100
     DO;                                                                00002110
        B02.AP_GP_NETTO(INDEX)        = B02.ALDERSP.GP(INDEX);          00002120
        B02.AP_TP_NETTO(INDEX)        = B02.ALDERSP.TP(INDEX);          00002130
        B02.TP_NETTO(INDEX)           = B02.TP_BRUTTO (INDEX);          00002140
        B02.ALDERSP.ST(INDEX)         = B02.ALDERSP.ST(INDEX);          00002150
     END;                                                               00002160
                                                                        00002170
 L500:                                                                  00002180
                                                                        00002190
  B02.ALDERSP.UTTAKS_APD(INDEX) = 000;                                  00002200
  B02.ALDERSP.APD(INDEX) = 000;                                         00002210
                                                                        00002220
  /*TRUDE 210292:  */                                                   00002230
  IF B02.ALDERSP.UTTAKSDATO_ÅM(INDEX) = 0        THEN                   00002240
     B02.ALDERSP.UTTAKSDATO_ÅM(INDEX) =                                 00002250
                            B02.VIRK_DATO_ÅM(INDEX);                    00002260
                                                                        00002270
  DCL GT  FIXED DEC (7) INIT (0);                                       00002280
                                                                        00002290
  GT  =             B02.GT_TILLEGG_LOV92(INDEX);                        00002300
  W_SUM_YTELSE    = B02.AP_GP_NETTO(INDEX) +                            00002310
                    B02.AP_TP_NETTO(INDEX) +                            00002320
                    B02.TP_NETTO(INDEX) +                               00002330
                    B02.ALDERSP.ST(INDEX)       +                       00002340
                    B02.GT_TILLEGG_LOV92(INDEX);                        00002350
                                                                        00002360
  L999:                                                                 00002370
                                                                        00002380
 END JUSTER_MED_40PROS;                                                 00002390
