 /*       SIST ENDRET 12/02-97 09.13.06 AV   JDA7339                  */00000000
 /*       SIST ENDRET 12/10-95 14.09.06 AV   JDA0310                  */00000010
 /*       SIST ENDRET 15/03-94 13.56.44 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 25/02-94 14.02.26 AV   HERMAN                   */00000030
 /*       SIST ENDRET 26/04-91 12.38.04 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 18/12-89 12.36.34 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 14/09-84 11.16.14 AV   FARVIK                   */00000060
                                                                        00000070
 /* ***************************************************************** */00000080
 /*       R 0 0 1 0 4 9 0                                             */00000090
 /* ***************************************************************** */00000100
 /*IDENTIFIKASJON:                                                    */00000110
 /* **********************                                            */00000120
 /*  PROGRAM-IDENT : R0010490 - VENTETRANS SKRIVES UT PÅ VENTE-       */00000130
 /*                             TRANSBASEN - HOVEDPROGRAM             */00000140
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000150
 /*  PROGRAMMERER  : ROLF FARVIK,DATA-UTVIKLING A/S                   */00000160
 /*  PROGRAMMET BLE LAGET : APRIL 1983                                */00000170
 /*  ENDRINGEN BLE UTFØRT AV : SL                                     */00000180
 /*  ENDRINGSDATO : 13.10.89                                          */00000190
 /*  ENDRINGEN GJELDER: UNGE UFØRE FØR 1967                           */00000200
 /*  ENDRINGEN BLE UTFØRT AV : TRUDE                                  */00000210
 /*                                                                   */00000220
 /* ***************************************************************** */00000230
 /*HENSIKT:                                                           */00000240
 /* **********                                                        */00000250
 /*  PROGRAMMET SKRIVER NY OG ENDRET TRANS TIL VENTEDATABASEN.        */00000260
 /*                                                                   */00000270
 /* ***************************************************************** */00000280
 /*PROGRAMTILKNYTTING:                                                */00000290
 /* ********************                                              */00000300
 /*  PROGRAMMET BLIR AKTIVISERT VIA CICS FRA FORSKJELLIGE PROGRAM     */00000310
 /*  SLIK:                                                            */00000320
 /*    EXEC CICS LINK PROGRAM('R0010490') COOMAREA(KOM_OMR);          */00000330
 /*  PROGRAMMET INKLUDERER:                                           */00000340
 /*    R0015305   -   P50_SKRIV_AP_TRANS (TIL VENTEBASEN)             */00000350
 /*    R00153N5   -   P50_SKRIV_A1_TRANS (TIL VENTEBASEN)             */00000360
 /*    R0015306   -   P60_SKRIV_UP_TRANS (TIL VENTEBASEN)             */00000370
 /*    R00153N6   -   P60_SKRIV_U2_TRANS (TIL VENTEBASEN)             */00000380
 /*    R00153U6   -   P60_SKRIV_U3_TRANS (TIL VENTEBASEN)             */00000390
 /*    R0015307   -   P70_SKRIV_US_TRANS (TIL VENTEBASEN)             */00000400
 /*    R0015308   -   P80_SKRIV_EP_TRANS (TIL VENTEBASEN)             */00000410
 /*    R0015309   -   P90_SKRIV_EF_TRANS (TIL VENTEBASEN)             */00000420
 /*    R00153N9   -   P90_SKRIV_E4_TRANS (TIL VENTEBASEN)             */00000430
 /*    R0015310   -   P100_SKRIV_FB_TRANS (TIL VENTEBASEN)            */00000440
 /*    R00153NA   -   P100_SKRIV_F5_TRANS (TIL VENTEBASEN)            */00000450
 /*    R0015311   -   P110_SKRIV_BP_TRANS (TIL VENTEBASEN)            */00000460
 /*    R00153NB   -   P110_SKRIV_B6_TRANS (TIL VENTEBASEN)            */00000470
 /*    R0015312   -   P120_SKRIV_FT_TRANS (TIL VENTEBASEN)            */00000480
 /*    R00153NC   -   P120_SKRIV_F7_TRANS (TIL VENTEBASEN)            */00000490
 /*    R00153UC   -   P120_SKRIV_FO_TRANS (TIL VENTEBASEN)            */00000500
 /*    R0015314   -   P140_SKRIV_E1_TRANS (TIL VENTEBASEN)            */00000510
 /*    R00153UE   -   P140_SKRIV_EN_TRANS (TIL VENTEBASEN)            */00000520
 /*    R0015316   -   P160_SKRIV_O1_TRANS (TIL VENTEBASEN)            */00000530
 /*    R0015317   -   P170_SKRIV_O2_TRANS (TIL VENTEBASEN)            */00000540
 /*    R0015319   -   P190_SKRIV_AF_TRANS (TIL VENTEBASEN)            */00000550
 /*    R00153UJ   -   P190_SKRIV_KF_TRANS (TIL VENTEBASEN)            */00000560
 /*    R0015320   -   P183_SKRIV_UF_TRANS (TIL VENTEBASEN) UF!!!      */00000570
 /*    R0019913   -   SNU DATO (IKKE I BRUK I DETTE PROGRAMMET)       */00000580
 /*  INTERNE PROCEDURER:                                              */00000590
 /*    P001_SKRIV_ROT_AP   - DANNER OG SKRIVER ROTSEGM.OPPLYSNINGER   */00000600
 /*    P001_SKRIV_ROT_AF   -      -----------''----------------       */00000610
 /*    P001_SKRIV_ROT_KF   -      -----------''----------------       */00000620
 /*    P001_SKRIV_ROT_UP   -      -----------''----------------       */00000630
 /*    P001_SKRIV_ROT_U2   -      -----------''----------------       */00000640
 /*    P001_SKRIV_ROT_U3   -      -----------''----------------       */00000650
 /*    P001_SKRIV_ROT_US   -      -----------''----------------       */00000660
 /*    P001_SKRIV_ROT_EP   -      -----------''----------------       */00000670
 /*    P001_SKRIV_ROT_EF   -      -----------''----------------       */00000680
 /*    P001_SKRIV_ROT_E4   -      -----------''----------------       */00000690
 /*    P001_SKRIV_ROT_FB   -      -----------''----------------       */00000700
 /*    P001_SKRIV_ROT_F5   -      -----------''----------------       */00000710
 /*    P001_SKRIV_ROT_BP   -      -----------''----------------       */00000720
 /*    P001_SKRIV_ROT_B6   -      -----------''----------------       */00000730
 /*    P001_SKRIV_ROT_FT   -      -----------''----------------       */00000740
 /*    P001_SKRIV_ROT_F7   -      -----------''----------------       */00000750
 /*    P001_SKRIV_ROT_FO   -      -----------''----------------       */00000760
 /*    P001_SKRIV_ROT_E1   -      -----------''----------------       */00000770
 /*    P001_SKRIV_ROT_EN   -      -----------''----------------       */00000780
 /*    P001_SKRIV_ROT_O1   -      -----------''----------------       */00000790
 /*    P001_SKRIV_ROT_O2   -      -----------''----------------       */00000800
 /*    P001_SKRIV_ROT_UF   -      -----------''----------------   UF! */00000810
 /*    DATABASE            - ÅPNER OG CLOSER DATABASEN                */00000820
 /*    P010_SKRIV_TRANSHIST         - CALLES I UNDERLIGGENDE PROGRAM  */00000830
 /*    P020_SKRIV_BARN_AV_TRANSHIST - --------''--------------------  */00000840
 /*                                                                   */00000850
 /* ***************************************************************** */00000860
 /*DATASETTOPPLYSNINGER:                                              */00000870
 /* ***********************                                           */00000880
 /*  VENTETRANSBASEN BLIR OPPDATERT MED NYE OG ENDREDE TRANSER        */00000890
 /*                                                                   */00000900
 /* ***************************************************************** */00000910
 /*FEILMELDINGER:                                                     */00000920
 /* *******************                                               */00000930
 /* PROGRAMMET SKRIVER FEILMELDINGER PÅ SKJERMEN VED:                 */00000940
 /*   BACKOUT BLIR FORETATT I.F.M. MELDINGUTSKRIVING.                 */00000950
 /*                                                                   */00000960
 /* ***************************************************************** */00000970
                                                                        00000980
                                                                        00000990
                                                                        00001000
                                                                        00001010
  R001049 :                                                             00001020
    PROC            (COMMAREA_PEKER)                                    00001030
           OPTIONS  (MAIN);                                             00001040
                                                                        00001050
  %PAGE;                                                                00001060
  %INCLUDE P0012001;                      /*  TRANS_SEGM_OMR (B) */     00001070
                                                                        00001080
  %PAGE;                                                                00001090
  %INCLUDE P0019906;                      /*   TRANS_OPPL_OMR (B) */    00001100
                                                                        00001110
  %PAGE;                                                                00001120
  %INCLUDE P0019908;                      /*   KOM_OMR        (B) */    00001130
                                                                        00001140
  %PAGE;                                                                00001150
  %INCLUDE P0019910;                      /*   STYRINGS_OMR   (B) */    00001160
                                                                        00001170
  %PAGE;                                                                00001180
  %INCLUDE S00101  ;                      /*   MENYMAPSET     (B) */    00001190
                                                                        00001200
  %PAGE;                                                                00001210
  DCL                                                                   00001220
      1    TRANS_LISTE_OMR (5)  UNALIGNED  BASED (TRANS_LISTE_PEKER),   00001230
  %INCLUDE P0019911;                      /*  TRANS_LISTE_OMR(B)  */    00001240
                                                                        00001250
  %PAGE;                                                                00001260
  %INCLUDE P0019912;                      /*   DIV_PARAM_OMR  (B) */    00001270
                                                                        00001280
   DCL                                                                  00001290
       MAP_MELDING              CHAR(78)      INIT((78)' '),            00001300
       1  FEIL_STRUC,                                                   00001310
          2  FEIL_NR               FIXED DEC(5),                        00001320
          2  FEIL_MELDING          CHAR     (78),                       00001330
          2  FEIL_MELDNR           PIC '9',                             00001340
          2  KOM_OMR_PEKER         POINTER;                             00001350
  %PAGE;                                                                00001360
  /* **************************************************************** */00001370
  /*     INNEBYGDE PLI-FUNKSJONER  + PEKER-DEF.                       */00001380
  /* **************************************************************** */00001390
                                                                        00001400
     DCL                                                                00001410
       ( ADDR , LOW , CSTG , DATE , SUBSTR , STG , NULL)      BUILTIN;  00001420
                                                                        00001430
     DCL                                                                00001440
       PLITDLI ENTRY;                                                   00001450
                                                                        00001460
     DCL                                                                00001470
         ( COMMAREA_PEKER   , W001_HJELPE_PEKER , TRANS_SEGM_PEKER ,    00001480
           W001_TRANS_PEKER , W001_TRANS_OPPL_PEKER,W01_HJELPE_PTR )    00001490
                                   POINTER;                             00001500
                                                                        00001510
  /* **************************************************************** */00001520
  /*     ARBEIDSFELTER SOM BRUKES AV UIB OG PCB  .                    */00001530
  /* **************************************************************** */00001540
                                                                        00001550
  %INCLUDE DLIUIB;                                                      00001560
                                                                        00001570
     DCL                                                                00001580
         UIB_RC_OK                 BIT (8)       INIT( 0 );             00001590
                                                                        00001600
  %INCLUDE  P0012002;                  /* UIB_PCB_PEKER_OMR (BASED)   */00001610
                                                                        00001620
     DCL  1 VT1                    BASED (VT1_PCB_PEKER),               00001630
  %INCLUDE  P0012003;                  /* PCB    (BASED)             */ 00001640
                                                                        00001650
  /* **************************************************************** */00001660
  /*     ROTSEGMENTOMRÅDE.                                            */00001670
  /* **************************************************************** */00001680
                                                                        00001690
     DCL 1  ROTSEGM,                                                    00001700
            2   FNR                DEC FIXED (11) ,                     00001710
            2   NAVN               CHAR      (25) ,                     00001720
            2   TKNR               DEC FIXED  (5) ,                     00001730
            2   SPRÅK              CHAR       (1) ,                     00001740
            2   AI                 DEC FIXED  (5) ,                     00001750
            2   SPERRE             CHAR       (1) ;                     00001760
                                                                        00001770
                                                                        00001780
  /* **************************************************************** */00001790
  /*     OPPTELLINGS- OG LOOP-PARAMETRE M.M                           */00001800
  /* **************************************************************** */00001810
                                                                        00001820
     DCL 1  W001_OPPTELL_OMR,                                           00001830
            2   I                  FIXED    BIN   (15)   INIT ( 0 ),    00001840
            2   J                  FIXED    BIN   (15)   INIT ( 0 ),    00001850
            2   B                           CHAR  (1)    INIT (' ');    00001860
                                                                        00001870
     DCL    W001_TERMID                     CHAR  ( 4 ),                00001880
            W001_DATO                       CHAR  ( 6 )  INIT ((6)' '), 00001890
            W001_REG_DATO  DEF W001_DATO    PIC   '(6)9';               00001900
                                                                        00001910
     DCL  LOKAL_MELD_NO              PIC '999' INIT (0);                00001920
                                                                        00001930
  /* **************************************************************** */00001940
  /*     DLI CALL-PARAMETRE                                           */00001950
  /* **************************************************************** */00001960
                                                                        00001970
     DCL 1  W001_DLI               UNALIGNED,                           00001980
            2   FUNC               CHAR     (4)   INIT('    '),         00001990
            2   GHU                CHAR     (4)   INIT('GHU '),         00002000
            2   DLET               CHAR     (4)   INIT('DLET'),         00002010
            2   REPL               CHAR     (4)   INIT('REPL'),         00002020
            2   ISRT               CHAR     (4)   INIT('ISRT'),         00002030
            2   PARM_CT_1          FIXED BIN(31)  INIT(1),              00002040
            2   PARM_CT_2          FIXED BIN(31)  INIT(2),              00002050
            2   PARM_CT_3          FIXED BIN(31)  INIT(3),              00002060
            2   PARM_CT_4          FIXED BIN(31)  INIT(4),              00002070
            2   PARM_CT_5          FIXED BIN(31)  INIT(5),              00002080
            2   PARM_CT_6          FIXED BIN(31)  INIT(6),              00002090
            2   PARM_CT_7          FIXED BIN(31)  INIT(7),              00002100
            2   OUT2               CHAR     (20)  INIT                  00002110
                        ('                    ');                       00002120
                                                                        00002130
  %PAGE;                                                                00002140
  /* **************************************************************** */00002150
  /*     DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00002160
  /* **************************************************************** */00002170
                                                                        00002180
     DCL    SSA_UQUAL              STATIC        CHAR (9)  INIT((9)' ');00002190
                                                                        00002200
     DCL 1  SSA1_VT0PERSN          UNALIGNED,                           00002210
            2    HDEL                            CHAR (17) INIT         00002220
                 ('VT0PERSN(FNR     '),                                 00002230
            2    REL_OP                          CHAR (2)  INIT (' ='), 00002240
            2    PKEY               FIXED        DEC  (11) INIT ( 0 ),  00002250
            2    HP                              CHAR (1)  INIT (')');  00002260
                                                                        00002270
     DCL 1  SSA1_TRANHIST          UNALIGNED,                           00002280
            2    HDEL                            CHAR (17) INIT         00002290
                 ('TRANHIST(VTPBLKOD'),                                 00002300
            2    REL_OP                          CHAR (2)  INIT (' ='), 00002310
            2    VTP_KEY            FIXED        DEC  (4)  INIT ( 0 ),  00002320
            2    GRBLKODE                        CHAR (2)  INIT ('  '), 00002330
            2    HP                              CHAR (1)  INIT (')');  00002340
                                                                        00002350
     DCL    W001_IO               CHAR (265)  INIT (   ( 265 )  ' '  ), 00002360
            W001_HJELPE_IO        CHAR (265)  BASED (W001_HJELPE_PEKER),00002370
            W01_HJELPE_IO         CHAR (2650) BASED (W01_HJELPE_PTR);   00002380
                                                                        00002390
  DCL                                                                   00002400
      ONKODE                     PIC'9999',                             00002410
      ONK             DEF ONKODE CHAR(4),                               00002420
      FEILKODE                   CHAR(4),                               00002430
      DSNAVN                     CHAR(8);                               00002440
  %PAGE;                                                                00002450
  /* **************************************************************** */00002460
  /*                                                                  */00002470
  /*        SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00002480
  /*       ---------------------------------------------------        */00002490
  /*                                                                  */00002500
  /*                                                                  */00002510
  /*        INITIERER VISSE DEFAULTVERDIER.                           */00002520
  /*                                                                  */00002530
  /* **************************************************************** */00002540
                                                                        00002550
      ON ERROR SNAP BEGIN       ;                                       00002560
         ON ERROR SYSTEM        ;                                       00002570
         ONKODE=ONCODE          ;                                       00002580
         FEILKODE   = ONK       ;                                       00002590
         DSNAVN     = EIBDS     ;                                       00002600
         GO TO FEILBEH          ;                                       00002610
      END;                                                              00002620
                                                                        00002630
    FEILKODE                                =   'FEIL'           ;      00002640
    PROGRAM_ID                              =   'R0010490'       ;      00002650
    DSNAVN                                  =   '      '         ;      00002660
    EXEC CICS HANDLE CONDITION ERROR(FEILBEH)                    ;      00002670
    W001_TRANS_PEKER                        =    TRANS_PEKER     ;      00002680
    W001_TRANS_OPPL_PEKER                   =    TRANS_OPPL_PEKER;      00002690
                                                                        00002700
    ALLOCATE         TRANS_SEGM_OMR                            ;        00002710
    TRANS_SEGM_OMR                          =    ''            ;        00002720
    W001_DATO                               =    DATE          ;        00002730
    W001_TERMID                             =    EIBTRMID      ;        00002740
                                                                        00002750
                                                                        00002760
    IF FUNKSJONSKODE ^= 'E' &                                           00002770
       FUNKSJONSKODE ^= 'B' &    /* 'B' BLIR SATT I BLANKETTKONTRPGR*/  00002780
       FUNKSJONSKODE ^= 'V' THEN                                        00002790
       DO;                                                              00002800
          TRANS_OPPL_PEKER = ADDR (TRANS_LISTE_OMR.FAST_DEL (1))    ;   00002810
          TRANS_PEKER      = ADDR (TRANS_LISTE_OMR.VARIABEL_DEL (1));   00002820
          UIBPTR           = PCB_UIB_PEKER_OMR.UIB_PEKER;               00002830
       END;                                                             00002840
    ELSE                                                                00002850
       IF FUNKSJONSKODE = 'B' THEN                                      00002860
          DO;                                                           00002870
                                                                        00002880
             CALL DATABASE('OPEN');                                     00002890
          END;                                                          00002900
       ELSE                                                             00002910
          IF FUNKSJONSKODE = 'E' THEN                                   00002920
             UIBPTR           = PCB_UIB_PEKER_OMR.UIB_PEKER;            00002930
                                                                        00002940
    SSA1_VT0PERSN.PKEY  = TRANS_OPPL_OMR.FØDSNUMMER;                    00002950
    ROTSEGM.AI          =    0  ;                                       00002960
    ROTSEGM.SPERRE      =    ' ';                                       00002970
    FEIL_MELD_NR        =    0  ;                                       00002980
                                                                        00002990
    SELECT   (TRANS_OPPL_OMR.BLANKETTYPE     );                         00003000
                                                                        00003010
          WHEN ( 'AP' )                                                 00003020
            /* **************************************************** */  00003030
            /*  OVERFØRER ALDERSPENSJONS-OPPLYSNINGER TIL DB        */  00003040
            /* **************************************************** */  00003050
            DO;                                                         00003060
                                                                        00003070
               CALL P001_SKRIV_ROT_AP;                                  00003080
               IF   FEIL_MELD_NR              >      0       THEN       00003090
                                                                        00003100
                 DO;                                                    00003110
                    /* ******************************************** */  00003120
                    /* FEIL VED SKRIV AV :  ROT                     */  00003130
                    /* ******************************************** */  00003140
                                                                        00003150
                    GO TO L999;                                         00003160
                 END;                                                   00003170
                                                                        00003180
                                                                        00003190
               /* R0015305 */                                           00003200
               CALL P050_SKRIV_AP_TRANS;                                00003210
                                                                        00003220
               IF   FEIL_MELD_NR              >      0       THEN       00003230
                 DO;                                                    00003240
                    /* ******************************************** */  00003250
                    /* FEIL VED SKRIV AV :  TRANS                   */  00003260
                    /* ******************************************** */  00003270
                                                                        00003280
                    GO TO L999;                                         00003290
                 END;                                                   00003300
            END;                                                        00003310
                                                                        00003320
          WHEN ( 'A1' )                                                 00003330
            /* **************************************************** */  00003340
            /*  OVERFØRER ALDERSPENSJONS-OPPLYSNINGER TIL DB        */  00003350
            /* **************************************************** */  00003360
            DO;                                                         00003370
                                                                        00003380
               CALL P001_SKRIV_ROT_A1;                                  00003390
               IF   FEIL_MELD_NR              >      0       THEN       00003400
                                                                        00003410
                 DO;                                                    00003420
                    /* ******************************************** */  00003430
                    /* FEIL VED SKRIV AV :  ROT                     */  00003440
                    /* ******************************************** */  00003450
                                                                        00003460
                    GO TO L999;                                         00003470
                 END;                                                   00003480
                                                                        00003490
                                                                        00003500
               /* R00153N5 */                                           00003510
               CALL P050_SKRIV_A1_TRANS;                                00003520
                                                                        00003530
               IF   FEIL_MELD_NR              >      0       THEN       00003540
                 DO;                                                    00003550
                    /* ******************************************** */  00003560
                    /* FEIL VED SKRIV AV :  TRANS                   */  00003570
                    /* ******************************************** */  00003580
                                                                        00003590
                    GO TO L999;                                         00003600
                 END;                                                   00003610
            END;                                                        00003620
                                                                        00003630
          WHEN ( 'AF' )                                                 00003640
            /* **************************************************** */  00003650
            /*  OVERFØRER OPPL OM AVTALEFESTET PENSJON TIL DB       */  00003660
            /* **************************************************** */  00003670
            DO;                                                         00003680
                                                                        00003690
               CALL P001_SKRIV_ROT_AF;                                  00003700
               IF   FEIL_MELD_NR              >      0       THEN       00003710
                                                                        00003720
                 DO;                                                    00003730
                    /* ******************************************** */  00003740
                    /* FEIL VED SKRIV AV :  ROT                     */  00003750
                    /* ******************************************** */  00003760
                                                                        00003770
                    GO TO L999;                                         00003780
                 END;                                                   00003790
                                                                        00003800
                                                                        00003810
               /* R0015319 */                                           00003820
               CALL P190_SKRIV_AF_TRANS;                                00003830
                                                                        00003840
               IF   FEIL_MELD_NR              >      0       THEN       00003850
                 DO;                                                    00003860
                    /* ******************************************** */  00003870
                    /* FEIL VED SKRIV AV :  TRANS                   */  00003880
                    /* ******************************************** */  00003890
                                                                        00003900
                    GO TO L999;                                         00003910
                 END;                                                   00003920
            END;                                                        00003930
                                                                        00003940
          WHEN ( 'KF' )                                                 00003950
            /* **************************************************** */  00003960
            /*  OVERFØRER OPPL OM AVTALEFESTET PENSJON TIL DB       */  00003970
            /* **************************************************** */  00003980
                                                                        00003990
            DO;                                                         00004000
                                                                        00004010
               CALL P001_SKRIV_ROT_KF;                                  00004020
               IF   FEIL_MELD_NR              >      0       THEN       00004030
                                                                        00004040
                 DO;                                                    00004050
                                                                        00004060
                    /* ******************************************** */  00004070
                    /* FEIL VED SKRIV AV :  ROT                     */  00004080
                    /* ******************************************** */  00004090
                                                                        00004100
                    GO TO L999;                                         00004110
                 END;                                                   00004120
                                                                        00004130
                                                                        00004140
               /* R00153UJ */                                           00004150
                                                                        00004160
               CALL P190_SKRIV_KF_TRANS;                                00004170
                                                                        00004180
               IF   FEIL_MELD_NR              >      0       THEN       00004190
                 DO;                                                    00004200
                                                                        00004210
                    /* ******************************************** */  00004220
                    /* FEIL VED SKRIV AV :  TRANS                   */  00004230
                    /* ******************************************** */  00004240
                                                                        00004250
                    GO TO L999;                                         00004260
                 END;                                                   00004270
            END;                                                        00004280
                                                                        00004290
          WHEN ( 'UP' )                                                 00004300
            /* **************************************************** */  00004310
            /*  OVERFØRER UFØREPENSJONS-OPPLYSNINGER TIL DB         */  00004320
            /* **************************************************** */  00004330
            DO;                                                         00004340
               CALL P001_SKRIV_ROT_UP;                                  00004350
                                                                        00004360
               IF   FEIL_MELD_NR              >      0       THEN       00004370
                                                                        00004380
                 DO;                                                    00004390
                    /* ******************************************** */  00004400
                    /* FEIL VED SKRIV AV :  ROT                     */  00004410
                    /* ******************************************** */  00004420
                                                                        00004430
                    GO TO L999;                                         00004440
                 END;                                                   00004450
                                                                        00004460
                                                                        00004470
               /* R0015306 */                                           00004480
               CALL P060_SKRIV_UP_TRANS;                                00004490
                                                                        00004500
               IF   FEIL_MELD_NR              >      0       THEN       00004510
                 DO;                                                    00004520
                    /* ******************************************** */  00004530
                    /* FEIL VED SKRIV AV TRANS                      */  00004540
                    /* ******************************************** */  00004550
                                                                        00004560
                    GO TO L999;                                         00004570
                 END;                                                   00004580
            END;                                                        00004590
                                                                        00004600
          WHEN ( 'U2' )                                                 00004610
            /* **************************************************** */  00004620
            /*  OVERFØRER UFØREPENSJONS-OPPLYSNINGER TIL DB         */  00004630
            /* **************************************************** */  00004640
            DO;                                                         00004650
               CALL P001_SKRIV_ROT_U2;                                  00004660
                                                                        00004670
               IF   FEIL_MELD_NR              >      0       THEN       00004680
                                                                        00004690
                 DO;                                                    00004700
                    /* ******************************************** */  00004710
                    /* FEIL VED SKRIV AV :  ROT                     */  00004720
                    /* ******************************************** */  00004730
                                                                        00004740
                    GO TO L999;                                         00004750
                 END;                                                   00004760
                                                                        00004770
                                                                        00004780
               /* R00153N6 */                                           00004790
               CALL P060_SKRIV_U2_TRANS;                                00004800
                                                                        00004810
               IF   FEIL_MELD_NR              >      0       THEN       00004820
                 DO;                                                    00004830
                    /* ******************************************** */  00004840
                    /* FEIL VED SKRIV AV TRANS                      */  00004850
                    /* ******************************************** */  00004860
                                                                        00004870
                    GO TO L999;                                         00004880
                 END;                                                   00004890
            END;                                                        00004900
                                                                        00004910
          WHEN ( 'U3' )                                                 00004920
            /* **************************************************** */  00004930
            /*  OVERFØRER UFØREPENSJONS-OPPLYSNINGER TIL DB         */  00004940
            /* **************************************************** */  00004950
            DO;                                                         00004960
               CALL P001_SKRIV_ROT_U3;                                  00004970
                                                                        00004980
               IF   FEIL_MELD_NR              >      0       THEN       00004990
                                                                        00005000
                 DO;                                                    00005010
                    /* ******************************************** */  00005020
                    /* FEIL VED SKRIV AV :  ROT                     */  00005030
                    /* ******************************************** */  00005040
                                                                        00005050
                    GO TO L999;                                         00005060
                 END;                                                   00005070
                                                                        00005080
               /* R00153U6 */                                           00005090
               CALL P060_SKRIV_U3_TRANS;                                00005100
                                                                        00005110
               IF   FEIL_MELD_NR              >      0       THEN       00005120
                 DO;                                                    00005130
                    /* ******************************************** */  00005140
                    /* FEIL VED SKRIV AV TRANS                      */  00005150
                    /* ******************************************** */  00005160
                                                                        00005170
                    GO TO L999;                                         00005180
                 END;                                                   00005190
            END;                                                        00005200
                                                                        00005210
          WHEN ( 'UF' )                                                 00005220
            /* **************************************************** */  00005230
            /*  OVERFØRER UF-OPPLYSNINGER TIL DB                    */  00005240
            /* **************************************************** */  00005250
            DO;                                                         00005260
               CALL P001_SKRIV_ROT_UF;                                  00005270
                                                                        00005280
               IF   FEIL_MELD_NR              >      0       THEN       00005290
                                                                        00005300
                 DO;                                                    00005310
                    /* ******************************************** */  00005320
                    /* FEIL VED SKRIV AV :  ROT                     */  00005330
                    /* ******************************************** */  00005340
                                                                        00005350
                    GO TO L999;                                         00005360
                 END;                                                   00005370
                                                                        00005380
                                                                        00005390
               /* R0015320 */                                           00005400
               CALL P183_SKRIV_UF_TRANS;                                00005410
                                                                        00005420
               IF   FEIL_MELD_NR              >      0       THEN       00005430
                 DO;                                                    00005440
                    /* ******************************************** */  00005450
                    /* FEIL VED SKRIV AV TRANS                      */  00005460
                    /* ******************************************** */  00005470
                                                                        00005480
                    GO TO L999;                                         00005490
                 END;                                                   00005500
            END;                                                        00005510
                                                                        00005520
          WHEN ( 'US' )                                                 00005530
            /* **************************************************** */  00005540
            /*  OVERFØRER US-OPPLYSNINGER TIL DB                    */  00005550
            /* **************************************************** */  00005560
            DO;                                                         00005570
               CALL P001_SKRIV_ROT_US;                                  00005580
                                                                        00005590
               IF   FEIL_MELD_NR              >      0       THEN       00005600
                                                                        00005610
                 DO;                                                    00005620
                    /* ******************************************** */  00005630
                    /* FEIL VED SKRIV AV :  ROT                     */  00005640
                    /* ******************************************** */  00005650
                                                                        00005660
                    GO TO L999;                                         00005670
                 END;                                                   00005680
                                                                        00005690
               /*   R0015307   */                                       00005700
               CALL P070_SKRIV_US_TRANS;                                00005710
                                                                        00005720
               IF   FEIL_MELD_NR              >      0       THEN       00005730
                 DO;                                                    00005740
                    /* ******************************************** */  00005750
                    /* FEIL VED SKRIV AV TRANS                      */  00005760
                    /* ******************************************** */  00005770
                                                                        00005780
                    GO TO L999;                                         00005790
                 END;                                                   00005800
            END;                                                        00005810
                                                                        00005820
          WHEN ( 'EP' )                                                 00005830
            /* **************************************************** */  00005840
            /*  OVERFØRER EP-OPPLYSNINGER TIL DB                    */  00005850
            /* **************************************************** */  00005860
            DO;                                                         00005870
               CALL P001_SKRIV_ROT_EP;                                  00005880
                                                                        00005890
               IF   FEIL_MELD_NR              >      0       THEN       00005900
                                                                        00005910
                 DO;                                                    00005920
                    /* ******************************************** */  00005930
                    /* FEIL VED SKRIV AV :  ROT                     */  00005940
                    /* ******************************************** */  00005950
                                                                        00005960
                    GO TO L999;                                         00005970
                 END;                                                   00005980
                                                                        00005990
               /*   R0015308   */                                       00006000
               CALL P080_SKRIV_EP_TRANS;                                00006010
                                                                        00006020
               IF   FEIL_MELD_NR              >      0       THEN       00006030
                 DO;                                                    00006040
                    /* ******************************************** */  00006050
                    /* FEIL VED SKRIV AV TRANS                      */  00006060
                    /* ******************************************** */  00006070
                                                                        00006080
                    GO TO L999;                                         00006090
                 END;                                                   00006100
            END;                                                        00006110
                                                                        00006120
          WHEN ( 'E3' )                                                 00006130
            /* **************************************************** */  00006140
            /*  OVERFØRER EP-OPPLYSNINGER TIL DB                    */  00006150
            /* **************************************************** */  00006160
            DO;                                                         00006170
               CALL P001_SKRIV_ROT_E3;                                  00006180
                                                                        00006190
               IF   FEIL_MELD_NR              >      0       THEN       00006200
                                                                        00006210
                 DO;                                                    00006220
                    /* ******************************************** */  00006230
                    /* FEIL VED SKRIV AV :  ROT                     */  00006240
                    /* ******************************************** */  00006250
                                                                        00006260
                    GO TO L999;                                         00006270
                 END;                                                   00006280
                                                                        00006290
               /*   R00153N8   */                                       00006300
               CALL P080_SKRIV_E3_TRANS;                                00006310
                                                                        00006320
               IF   FEIL_MELD_NR              >      0       THEN       00006330
                 DO;                                                    00006340
                    /* ******************************************** */  00006350
                    /* FEIL VED SKRIV AV TRANS                      */  00006360
                    /* ******************************************** */  00006370
                                                                        00006380
                    GO TO L999;                                         00006390
                 END;                                                   00006400
            END;                                                        00006410
                                                                        00006420
          WHEN ( 'EE' )                                                 00006430
            /* **************************************************** */  00006440
            /*  OVERFØRER EP-OPPLYSNINGER TIL DB                    */  00006450
            /* **************************************************** */  00006460
            DO;                                                         00006470
               CALL P001_SKRIV_ROT_EE;                                  00006480
                                                                        00006490
               IF   FEIL_MELD_NR              >      0       THEN       00006500
                                                                        00006510
                 DO;                                                    00006520
                    /* ******************************************** */  00006530
                    /* FEIL VED SKRIV AV :  ROT                     */  00006540
                    /* ******************************************** */  00006550
                                                                        00006560
                    GO TO L999;                                         00006570
                 END;                                                   00006580
                                                                        00006590
               /*   R00153U8   */                                       00006600
               CALL P080_SKRIV_EE_TRANS;                                00006610
                                                                        00006620
               IF   FEIL_MELD_NR              >      0       THEN       00006630
                 DO;                                                    00006640
                    /* ******************************************** */  00006650
                    /* FEIL VED SKRIV AV TRANS                      */  00006660
                    /* ******************************************** */  00006670
                                                                        00006680
                    GO TO L999;                                         00006690
                 END;                                                   00006700
            END;                                                        00006710
                                                                        00006720
          WHEN ( 'EF' )                                                 00006730
            /* **************************************************** */  00006740
            /*  OVERFØRER EF-OPPLYSNINGER TIL DB                    */  00006750
            /* **************************************************** */  00006760
            DO;                                                         00006770
               CALL P001_SKRIV_ROT_EF;                                  00006780
                                                                        00006790
               IF   FEIL_MELD_NR              >      0       THEN       00006800
                                                                        00006810
                 DO;                                                    00006820
                    /* ******************************************** */  00006830
                    /* FEIL VED SKRIV AV :  ROT                     */  00006840
                    /* ******************************************** */  00006850
                                                                        00006860
                    GO TO L999;                                         00006870
                 END;                                                   00006880
                                                                        00006890
               /*   R0015309   */                                       00006900
               CALL P090_SKRIV_EF_TRANS;                                00006910
                                                                        00006920
               IF   FEIL_MELD_NR              >      0       THEN       00006930
                 DO;                                                    00006940
                    /* ******************************************** */  00006950
                    /* FEIL VED SKRIV AV TRANS                      */  00006960
                    /* ******************************************** */  00006970
                                                                        00006980
                    GO TO L999;                                         00006990
                 END;                                                   00007000
            END;                                                        00007010
                                                                        00007020
          WHEN ( 'E4' )                                                 00007030
            /* **************************************************** */  00007040
            /*  OVERFØRER EF-OPPLYSNINGER TIL DB                    */  00007050
            /* **************************************************** */  00007060
            DO;                                                         00007070
               CALL P001_SKRIV_ROT_E4;                                  00007080
                                                                        00007090
               IF   FEIL_MELD_NR              >      0       THEN       00007100
                                                                        00007110
                 DO;                                                    00007120
                    /* ******************************************** */  00007130
                    /* FEIL VED SKRIV AV :  ROT                     */  00007140
                    /* ******************************************** */  00007150
                                                                        00007160
                    GO TO L999;                                         00007170
                 END;                                                   00007180
                                                                        00007190
               /*   R00153N9   */                                       00007200
               CALL P090_SKRIV_E4_TRANS;                                00007210
                                                                        00007220
               IF   FEIL_MELD_NR              >      0       THEN       00007230
                 DO;                                                    00007240
                    /* ******************************************** */  00007250
                    /* FEIL VED SKRIV AV TRANS                      */  00007260
                    /* ******************************************** */  00007270
                                                                        00007280
                    GO TO L999;                                         00007290
                 END;                                                   00007300
            END;                                                        00007310
                                                                        00007320
          WHEN ( 'FB' )                                                 00007330
            /* **************************************************** */  00007340
            /*  OVERFØRER FB-OPPLYSNINGER TIL DB                    */  00007350
            /* **************************************************** */  00007360
            DO;                                                         00007370
               CALL P001_SKRIV_ROT_FB;                                  00007380
                                                                        00007390
                                                                        00007400
               IF   FEIL_MELD_NR              >      0       THEN       00007410
                                                                        00007420
                 DO;                                                    00007430
                    /* ******************************************** */  00007440
                    /* FEIL VED SKRIV AV :  ROT                     */  00007450
                    /* ******************************************** */  00007460
                                                                        00007470
                    GO TO L999;                                         00007480
                 END;                                                   00007490
                                                                        00007500
                                                                        00007510
               /*   R0015310   */                                       00007520
               CALL P100_SKRIV_FB_TRANS;                                00007530
                                                                        00007540
               IF   FEIL_MELD_NR              >      0       THEN       00007550
                 DO;                                                    00007560
                    /* ******************************************** */  00007570
                    /* FEIL VED SKRIV AV TRANS                      */  00007580
                    /* ******************************************** */  00007590
                                                                        00007600
                    GO TO L999;                                         00007610
                 END;                                                   00007620
            END;                                                        00007630
                                                                        00007640
                                                                        00007650
          WHEN ( 'BP' )                                                 00007660
            /* **************************************************** */  00007670
            /*  OVERFØRER BP-OPPLYSNINGER TIL DB                    */  00007680
            /* **************************************************** */  00007690
            DO;                                                         00007700
               CALL P001_SKRIV_ROT_BP;                                  00007710
                                                                        00007720
               IF   FEIL_MELD_NR              >      0       THEN       00007730
                                                                        00007740
                 DO;                                                    00007750
                    /* ******************************************** */  00007760
                    /* FEIL VED SKRIV AV :  ROT                     */  00007770
                    /* ******************************************** */  00007780
                                                                        00007790
                    GO TO L999;                                         00007800
                 END;                                                   00007810
                                                                        00007820
               /*   R0015311   */                                       00007830
               CALL P110_SKRIV_BP_TRANS;                                00007840
                                                                        00007850
               IF   FEIL_MELD_NR              >      0       THEN       00007860
                 DO;                                                    00007870
                    /* ******************************************** */  00007880
                    /* FEIL VED SKRIV AV TRANS                      */  00007890
                    /* ******************************************** */  00007900
                                                                        00007910
                    GO TO L999;                                         00007920
                 END;                                                   00007930
            END;                                                        00007940
                                                                        00007950
          WHEN ( 'B6' )                                                 00007960
            /* **************************************************** */  00007970
            /*  OVERFØRER BP-OPPLYSNINGER TIL DB                    */  00007980
            /* **************************************************** */  00007990
            DO;                                                         00008000
               CALL P001_SKRIV_ROT_B6;                                  00008010
                                                                        00008020
               IF   FEIL_MELD_NR              >      0       THEN       00008030
                                                                        00008040
                 DO;                                                    00008050
                    /* ******************************************** */  00008060
                    /* FEIL VED SKRIV AV :  ROT                     */  00008070
                    /* ******************************************** */  00008080
                                                                        00008090
                    GO TO L999;                                         00008100
                 END;                                                   00008110
                                                                        00008120
               /*   R00153NB   */                                       00008130
               CALL P110_SKRIV_B6_TRANS;                                00008140
                                                                        00008150
               IF   FEIL_MELD_NR              >      0       THEN       00008160
                 DO;                                                    00008170
                    /* ******************************************** */  00008180
                    /* FEIL VED SKRIV AV TRANS                      */  00008190
                    /* ******************************************** */  00008200
                                                                        00008210
                    GO TO L999;                                         00008220
                 END;                                                   00008230
            END;                                                        00008240
                                                                        00008250
          WHEN ( 'FT' )                                                 00008260
            /* **************************************************** */  00008270
            /*  OVERFØRER FT-OPPLYSNINGER TIL DB                    */  00008280
            /* **************************************************** */  00008290
            DO;                                                         00008300
               CALL P001_SKRIV_ROT_FT;                                  00008310
                                                                        00008320
               IF   FEIL_MELD_NR              >      0       THEN       00008330
                                                                        00008340
                 DO;                                                    00008350
                    /* ******************************************** */  00008360
                    /* FEIL VED SKRIV AV :  ROT                     */  00008370
                    /* ******************************************** */  00008380
                                                                        00008390
                    GO TO L999;                                         00008400
                 END;                                                   00008410
                                                                        00008420
               /* R0015312   */                                         00008430
               CALL P120_SKRIV_FT_TRANS;                                00008440
                                                                        00008450
               IF   FEIL_MELD_NR              >      0       THEN       00008460
                 DO;                                                    00008470
                    /* ******************************************** */  00008480
                    /* FEIL VED SKRIV AV TRANS                      */  00008490
                    /* ******************************************** */  00008500
                                                                        00008510
                    GO TO L999;                                         00008520
                 END;                                                   00008530
            END;                                                        00008540
                                                                        00008550
          WHEN ( 'F7' )                                                 00008560
            /* **************************************************** */  00008570
            /*  OVERFØRER F7-OPPLYSNINGER TIL DB                    */  00008580
            /* **************************************************** */  00008590
            DO;                                                         00008600
               CALL P001_SKRIV_ROT_F7;                                  00008610
                                                                        00008620
               IF   FEIL_MELD_NR              >      0       THEN       00008630
                                                                        00008640
                 DO;                                                    00008650
                    /* ******************************************** */  00008660
                    /* FEIL VED SKRIV AV :  ROT                     */  00008670
                    /* ******************************************** */  00008680
                                                                        00008690
                    GO TO L999;                                         00008700
                 END;                                                   00008710
                                                                        00008720
               /* R00153NC   */                                         00008730
               CALL P120_SKRIV_F7_TRANS;                                00008740
                                                                        00008750
               IF   FEIL_MELD_NR              >      0       THEN       00008760
                 DO;                                                    00008770
                    /* ******************************************** */  00008780
                    /* FEIL VED SKRIV AV TRANS                      */  00008790
                    /* ******************************************** */  00008800
                                                                        00008810
                    GO TO L999;                                         00008820
                 END;                                                   00008830
            END;                                                        00008840
                                                                        00008850
          WHEN ( 'FO' )                                                 00008860
            /* **************************************************** */  00008870
            /*  OVERFØRER FO-OPPLYSNINGER TIL DB                    */  00008880
            /* **************************************************** */  00008890
            DO;                                                         00008900
               CALL P001_SKRIV_ROT_FO;                                  00008910
                                                                        00008920
               IF   FEIL_MELD_NR              >      0       THEN       00008930
                                                                        00008940
                 DO;                                                    00008950
                    /* ******************************************** */  00008960
                    /* FEIL VED SKRIV AV :  ROT                     */  00008970
                    /* ******************************************** */  00008980
                                                                        00008990
                    GO TO L999;                                         00009000
                 END;                                                   00009010
                                                                        00009020
               /* R00153UC   */                                         00009030
               CALL P120_SKRIV_FO_TRANS;                                00009040
                                                                        00009050
               IF   FEIL_MELD_NR              >      0       THEN       00009060
                 DO;                                                    00009070
                    /* ******************************************** */  00009080
                    /* FEIL VED SKRIV AV TRANS                      */  00009090
                    /* ******************************************** */  00009100
                                                                        00009110
                    GO TO L999;                                         00009120
                 END;                                                   00009130
            END;                                                        00009140
                                                                        00009150
          WHEN ( 'E1' )                                                 00009160
            /* **************************************************** */  00009170
            /*  OVERFØRER E1-OPPLYSNINGER TIL DB                    */  00009180
            /* **************************************************** */  00009190
            DO;                                                         00009200
               CALL P001_SKRIV_ROT_E1;                                  00009210
                                                                        00009220
               IF   FEIL_MELD_NR              >      0       THEN       00009230
                                                                        00009240
                 DO;                                                    00009250
                    /* ******************************************** */  00009260
                    /* FEIL VED SKRIV AV :  ROT                     */  00009270
                    /* ******************************************** */  00009280
                                                                        00009290
                    GO TO L999;                                         00009300
                 END;                                                   00009310
                                                                        00009320
                                                                        00009330
               /*   R0015314   */                                       00009340
               CALL P140_SKRIV_E1_TRANS;                                00009350
                                                                        00009360
               IF   FEIL_MELD_NR              >      0       THEN       00009370
                 DO;                                                    00009380
                    /* ******************************************** */  00009390
                    /* FEIL VED SKRIV AV TRANS                      */  00009400
                    /* ******************************************** */  00009410
                                                                        00009420
                    GO TO L999;                                         00009430
                 END;                                                   00009440
            END;                                                        00009450
                                                                        00009460
          WHEN ( 'EN' )                                                 00009470
            /* **************************************************** */  00009480
            /*  OVERFØRER EN-OPPLYSNINGER TIL DB                    */  00009490
            /* **************************************************** */  00009500
            DO;                                                         00009510
               CALL P001_SKRIV_ROT_EN;                                  00009520
                                                                        00009530
               IF   FEIL_MELD_NR              >      0       THEN       00009540
                                                                        00009550
                 DO;                                                    00009560
                    /* ******************************************** */  00009570
                    /* FEIL VED SKRIV AV :  ROT                     */  00009580
                    /* ******************************************** */  00009590
                                                                        00009600
                    GO TO L999;                                         00009610
                 END;                                                   00009620
                                                                        00009630
                                                                        00009640
               /*   R00153UE   */                                       00009650
               CALL P140_SKRIV_EN_TRANS;                                00009660
                                                                        00009670
               IF   FEIL_MELD_NR              >      0       THEN       00009680
                 DO;                                                    00009690
                    /* ******************************************** */  00009700
                    /* FEIL VED SKRIV AV TRANS                      */  00009710
                    /* ******************************************** */  00009720
                                                                        00009730
                    GO TO L999;                                         00009740
                 END;                                                   00009750
            END;                                                        00009760
                                                                        00009770
          WHEN ( 'O1' )                                                 00009780
            /* **************************************************** */  00009790
            /*  OVERFØRER O1-OPPLYSNINGER TIL DB                    */  00009800
            /* **************************************************** */  00009810
            DO;                                                         00009820
               CALL P001_SKRIV_ROT_O1;                                  00009830
                                                                        00009840
                                                                        00009850
               IF   FEIL_MELD_NR              >      0       THEN       00009860
                                                                        00009870
                 DO;                                                    00009880
                    /* ******************************************** */  00009890
                    /* FEIL VED SKRIV AV :  ROT                     */  00009900
                    /* ******************************************** */  00009910
                                                                        00009920
                    GO TO L999;                                         00009930
                 END;                                                   00009940
                                                                        00009950
                                                                        00009960
               /* R0015316   */                                         00009970
               CALL P160_SKRIV_O1_TRANS;                                00009980
                                                                        00009990
               IF   FEIL_MELD_NR              >      0       THEN       00010000
                 DO;                                                    00010010
                    /* ******************************************** */  00010020
                    /* FEIL VED SKRIV AV TRANS                      */  00010030
                    /* ******************************************** */  00010040
                                                                        00010050
                    GO TO L999;                                         00010060
                 END;                                                   00010070
            END;                                                        00010080
                                                                        00010090
          WHEN ( 'O2' )                                                 00010100
            /* **************************************************** */  00010110
            /*  OVERFØRER O2-OPPLYSNINGER TIL DB                    */  00010120
            /* **************************************************** */  00010130
            DO;                                                         00010140
               CALL P001_SKRIV_ROT_O2;                                  00010150
                                                                        00010160
               IF   FEIL_MELD_NR              >      0       THEN       00010170
                                                                        00010180
                 DO;                                                    00010190
                    /* ******************************************** */  00010200
                    /* FEIL VED SKRIV AV :  ROT                     */  00010210
                    /* ******************************************** */  00010220
                                                                        00010230
                    GO TO L999;                                         00010240
                 END;                                                   00010250
                                                                        00010260
                                                                        00010270
               /* R0015317   */                                         00010280
               CALL P170_SKRIV_O2_TRANS;                                00010290
                                                                        00010300
               IF   FEIL_MELD_NR              >      0       THEN       00010310
                 DO;                                                    00010320
                    /* ******************************************** */  00010330
                    /* FEIL VED SKRIV AV TRANS                      */  00010340
                    /* ******************************************** */  00010350
                                                                        00010360
                    GO TO L999;                                         00010370
                 END;                                                   00010380
            END;                                                        00010390
                                                                        00010400
          OTHERWISE                                                     00010410
            /* **************************************************** */  00010420
            /*  FÅTT EN UKJENT TRANS-TYPE . KJØRING AVBRYTES        */  00010430
            /* **************************************************** */  00010440
            DO;                                                         00010450
   L100:                                                                00010460
               FEIL_MELD_NR           =    498 ;                        00010470
               FEIL_VED_LABEL         =   '100';                        00010480
               GO TO L999;                                              00010490
            END;                                                        00010500
                                                                        00010510
    END;   /* *****      SELECT ( BLANKETTYPE )          ****** */      00010520
                                                                        00010530
                                                                        00010540
                                                                        00010550
                                                                        00010560
                                                                        00010570
    /* ************************************************************** */00010580
    /* ************************************************************** */00010590
    /* ************************************************************** */00010600
    /* ************************************************************** */00010610
    /*                                                                */00010620
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00010630
    /*                                                                */00010640
    /* ************************************************************** */00010650
                                                                        00010660
    P001_SKRIV_ROT_AP:                                                  00010670
      PROC ;                                                            00010680
               %INCLUDE P0010501;           /*** TRANS_OMRÅDE AP ***/   00010690
               ROTSEGM.FNR    = APS.FNR;                                00010700
               ROTSEGM.NAVN   = APS.NAVN;                               00010710
               ROTSEGM.TKNR   = APS.TKNR;                               00010720
               ROTSEGM.SPRÅK  = APS.SPRÅK;                              00010730
                                                                        00010740
               CALL P005_SKRIV_ROT;                                     00010750
                                                                        00010760
                                                                        00010770
    END P001_SKRIV_ROT_AP;                                              00010780
                                                                        00010790
                                                                        00010800
                                                                        00010810
    P001_SKRIV_ROT_A1:                                                  00010820
      PROC ;                                                            00010830
               %INCLUDE P001N501;           /*** TRANS_OMRÅDE AP ***/   00010840
               ROTSEGM.FNR    = A1S.FNR;                                00010850
               ROTSEGM.NAVN   = A1S.NAVN;                               00010860
               ROTSEGM.TKNR   = A1S.TKNR;                               00010870
               ROTSEGM.SPRÅK  = A1S.SPRÅK;                              00010880
                                                                        00010890
               CALL P005_SKRIV_ROT;                                     00010900
                                                                        00010910
                                                                        00010920
    END P001_SKRIV_ROT_A1;                                              00010930
                                                                        00010940
    /* ************************************************************** */00010950
    /*                                                                */00010960
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00010970
    /*                                                                */00010980
    /* ************************************************************** */00010990
                                                                        00011000
         /* NY PROSEDYRE */                                             00011010
                                                                        00011020
    P001_SKRIV_ROT_AF:                                                  00011030
      PROC ;                                                            00011040
               %INCLUDE P0011901;           /*** TRANS_OMRÅDE AF ***/   00011050
               ROTSEGM.FNR    = AFP.FNR;                                00011060
               ROTSEGM.NAVN   = AFP.NAVN;                               00011070
               ROTSEGM.TKNR   = AFP.TKNR;                               00011080
               ROTSEGM.SPRÅK  = AFP.SPRÅK;                              00011090
                                                                        00011100
               CALL P005_SKRIV_ROT;                                     00011110
                                                                        00011120
                                                                        00011130
    END P001_SKRIV_ROT_AF;                                              00011140
                                                                        00011150
                                                                        00011160
    P001_SKRIV_ROT_KF:                                                  00011170
      PROC ;                                                            00011180
               %INCLUDE P001UJ01;       /*   *** TRANS_OMRÅDE KF * */   00011190
               ROTSEGM.FNR    = KFP.FNR;                                00011200
               ROTSEGM.NAVN   = KFP.NAVN;                               00011210
               ROTSEGM.TKNR   = KFP.TKNR;                               00011220
               ROTSEGM.SPRÅK  = KFP.SPRÅK;                              00011230
                                                                        00011240
               CALL P005_SKRIV_ROT;                                     00011250
                                                                        00011260
                                                                        00011270
    END P001_SKRIV_ROT_KF;                                              00011280
                                                                        00011290
         /* HIT          */                                             00011300
                                                                        00011310
                                                                        00011320
    /* ************************************************************** */00011330
    /*                                                                */00011340
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00011350
    /*                                                                */00011360
    /* ************************************************************** */00011370
                                                                        00011380
    P001_SKRIV_ROT_UP:                                                  00011390
      PROC ;                                                            00011400
               %INCLUDE P0010601;            /*** TRANS_OMRÅDE UP  ***/ 00011410
               ROTSEGM.FNR    = UPS.FNR;                                00011420
               ROTSEGM.NAVN   = UPS.NAVN;                               00011430
               ROTSEGM.TKNR   = UPS.TKNR;                               00011440
               ROTSEGM.SPRÅK  = UPS.SPRÅK;                              00011450
                                                                        00011460
                                                                        00011470
                                                                        00011480
               CALL P005_SKRIV_ROT;                                     00011490
                                                                        00011500
                                                                        00011510
    END P001_SKRIV_ROT_UP;                                              00011520
                                                                        00011530
    P001_SKRIV_ROT_U2:                                                  00011540
      PROC ;                                                            00011550
               %INCLUDE P001N601;            /*** TRANS_OMRÅDE U2  ***/ 00011560
               ROTSEGM.FNR    = U2S.FNR;                                00011570
               ROTSEGM.NAVN   = U2S.NAVN;                               00011580
               ROTSEGM.TKNR   = U2S.TKNR;                               00011590
               ROTSEGM.SPRÅK  = U2S.SPRÅK;                              00011600
                                                                        00011610
                                                                        00011620
                                                                        00011630
               CALL P005_SKRIV_ROT;                                     00011640
                                                                        00011650
                                                                        00011660
    END P001_SKRIV_ROT_U2;                                              00011670
                                                                        00011680
    P001_SKRIV_ROT_U3:                                                  00011690
      PROC ;                                                            00011700
               %INCLUDE P001U601;            /*** TRANS_OMRÅDE U3  ***/ 00011710
               ROTSEGM.FNR    = U3S.FNR;                                00011720
               ROTSEGM.NAVN   = U3S.NAVN;                               00011730
               ROTSEGM.TKNR   = U3S.TKNR;                               00011740
               ROTSEGM.SPRÅK  = U3S.SPRÅK;                              00011750
                                                                        00011760
                                                                        00011770
                                                                        00011780
               CALL P005_SKRIV_ROT;                                     00011790
                                                                        00011800
                                                                        00011810
    END P001_SKRIV_ROT_U3;                                              00011820
    /* ************************************************************** */00011830
    /*                                                                */00011840
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00011850
    /*                                                                */00011860
    /* ************************************************************** */00011870
                                                                        00011880
        P001_SKRIV_ROT_UF:                                              00011890
         PROC ;                                                         00011900
               %INCLUDE P0011831;            /*** TRANS_OMRÅDE UF  ***/ 00011910
               ROTSEGM.FNR    = UFS.FNR;                                00011920
                                                                        00011930
                                                                        00011940
               CALL P005_SKRIV_ROT;                                     00011950
                                                                        00011960
                                                                        00011970
        END P001_SKRIV_ROT_UF;                                          00011980
                                                                        00011990
                                                                        00012000
    /* ************************************************************** */00012010
    /*                                                                */00012020
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00012030
    /*                                                                */00012040
    /* ************************************************************** */00012050
                                                                        00012060
    P001_SKRIV_ROT_US:                                                  00012070
      PROC ;                                                            00012080
               %INCLUDE P0010701;          /*** TRANS_OMRÅDE US   ***/  00012090
               ROTSEGM.FNR    = USS.FNR;                                00012100
               ROTSEGM.TKNR   = USS.TKNR;                               00012110
                                                                        00012120
               CALL P005_SKRIV_ROT;                                     00012130
                                                                        00012140
                                                                        00012150
    END P001_SKRIV_ROT_US;                                              00012160
                                                                        00012170
                                                                        00012180
                                                                        00012190
                                                                        00012200
                                                                        00012210
    /* ************************************************************** */00012220
    /*                                                                */00012230
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00012240
    /*                                                                */00012250
    /* ************************************************************** */00012260
                                                                        00012270
    P001_SKRIV_ROT_EP:                                                  00012280
      PROC ;                                                            00012290
               %INCLUDE P0010801;       /*** TRANS_OMRÅDE EP  ***/      00012300
               ROTSEGM.FNR    = EPS.FNR;                                00012310
               ROTSEGM.NAVN   = EPS.NAVN;                               00012320
               ROTSEGM.TKNR   = EPS.TKNR;                               00012330
               ROTSEGM.SPRÅK  = EPS.SPRÅK;                              00012340
                                                                        00012350
               CALL P005_SKRIV_ROT;                                     00012360
                                                                        00012370
                                                                        00012380
    END P001_SKRIV_ROT_EP;                                              00012390
                                                                        00012400
                                                                        00012410
                                                                        00012420
    /* ************************************************************** */00012430
    /*                                                                */00012440
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00012450
    /*                                                                */00012460
    /* ************************************************************** */00012470
                                                                        00012480
    P001_SKRIV_ROT_E3:                                                  00012490
      PROC ;                                                            00012500
               %INCLUDE P001N801;       /*** TRANS_OMRÅDE E3  ***/      00012510
               ROTSEGM.FNR    = E3S.FNR;                                00012520
               ROTSEGM.NAVN   = E3S.NAVN;                               00012530
               ROTSEGM.TKNR   = E3S.TKNR;                               00012540
               ROTSEGM.SPRÅK  = E3S.SPRÅK;                              00012550
                                                                        00012560
               CALL P005_SKRIV_ROT;                                     00012570
                                                                        00012580
                                                                        00012590
    END P001_SKRIV_ROT_E3;                                              00012600
                                                                        00012610
                                                                        00012620
                                                                        00012630
    /* ************************************************************** */00012640
    /*                                                                */00012650
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00012660
    /*                                                                */00012670
    /* ************************************************************** */00012680
                                                                        00012690
    P001_SKRIV_ROT_EE:                                                  00012700
      PROC ;                                                            00012710
               %INCLUDE P001U801;       /*** TRANS_OMRÅDE E3  ***/      00012720
               ROTSEGM.FNR    = EES.FNR;                                00012730
               ROTSEGM.NAVN   = EES.NAVN;                               00012740
               ROTSEGM.TKNR   = EES.TKNR;                               00012750
               ROTSEGM.SPRÅK  = EES.SPRÅK;                              00012760
                                                                        00012770
               CALL P005_SKRIV_ROT;                                     00012780
                                                                        00012790
                                                                        00012800
    END P001_SKRIV_ROT_EE;                                              00012810
                                                                        00012820
                                                                        00012830
                                                                        00012840
    /* ************************************************************** */00012850
    /*                                                                */00012860
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00012870
    /*                                                                */00012880
    /* ************************************************************** */00012890
                                                                        00012900
    P001_SKRIV_ROT_EF:                                                  00012910
      PROC ;                                                            00012920
               %INCLUDE P0010901;       /*** TRANS_OMRÅDE EF   ***/     00012930
               ROTSEGM.FNR    = EFS.FNR;                                00012940
               ROTSEGM.NAVN   = EFS.NAVN;                               00012950
               ROTSEGM.TKNR   = EFS.TKNR;                               00012960
               ROTSEGM.SPRÅK  = EFS.SPRÅK;                              00012970
                                                                        00012980
                                                                        00012990
               CALL P005_SKRIV_ROT;                                     00013000
                                                                        00013010
                                                                        00013020
    END P001_SKRIV_ROT_EF;                                              00013030
                                                                        00013040
                                                                        00013050
                                                                        00013060
    P001_SKRIV_ROT_E4:                                                  00013070
      PROC ;                                                            00013080
               %INCLUDE P001N901;       /*** TRANS_OMRÅDE EF   ***/     00013090
               ROTSEGM.FNR    = E4S.FNR;                                00013100
               ROTSEGM.NAVN   = E4S.NAVN;                               00013110
               ROTSEGM.TKNR   = E4S.TKNR;                               00013120
               ROTSEGM.SPRÅK  = E4S.SPRÅK;                              00013130
                                                                        00013140
                                                                        00013150
               CALL P005_SKRIV_ROT;                                     00013160
                                                                        00013170
                                                                        00013180
    END P001_SKRIV_ROT_E4;                                              00013190
                                                                        00013200
                                                                        00013210
                                                                        00013220
                                                                        00013230
                                                                        00013240
                                                                        00013250
    /* ************************************************************** */00013260
    /*                                                                */00013270
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00013280
    /*                                                                */00013290
    /* ************************************************************** */00013300
                                                                        00013310
    P001_SKRIV_ROT_FB:                                                  00013320
      PROC ;                                                            00013330
               %INCLUDE P0011001;               /*** TRANS_OMRÅDE FB **/00013340
               ROTSEGM.FNR    = BARN.FNR_B(1);                          00013350
               ROTSEGM.NAVN   = BARN.NAVN_B(1);                         00013360
               ROTSEGM.TKNR   = BARN.TKNR(1);                           00013370
               ROTSEGM.SPRÅK  = BARN_GEN.SPRÅK;                         00013380
                                                                        00013390
               CALL P005_SKRIV_ROT;                                     00013400
                                                                        00013410
                                                                        00013420
    END P001_SKRIV_ROT_FB;                                              00013430
                                                                        00013440
                                                                        00013450
                                                                        00013460
                                                                        00013470
    /* ************************************************************** */00013480
    /*                                                                */00013490
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00013500
    /*                                                                */00013510
    /* ************************************************************** */00013520
                                                                        00013530
    P001_SKRIV_ROT_BP:                                                  00013540
      PROC ;                                                            00013550
               %INCLUDE P0011101;     /*** TRANS_OMRÅDE BP   ***/       00013560
               ROTSEGM.FNR    = BPB.TAB.FNR_BARN(1);                    00013570
               ROTSEGM.NAVN   = BPB.TAB.NAVN_BARN(1);                   00013580
               ROTSEGM.TKNR   = BPB.TAB.TKNR(1);                        00013590
               ROTSEGM.SPRÅK  = BPB.SPRÅK;                              00013600
                                                                        00013610
                                                                        00013620
               CALL P005_SKRIV_ROT;                                     00013630
                                                                        00013640
                                                                        00013650
    END P001_SKRIV_ROT_BP;                                              00013660
                                                                        00013670
                                                                        00013680
    P001_SKRIV_ROT_B6:                                                  00013690
      PROC ;                                                            00013700
               %INCLUDE P001NB01;     /*** TRANS_OMRÅDE BP   ***/       00013710
               ROTSEGM.FNR    = B6B.TAB.FNR_BARN(1);                    00013720
               ROTSEGM.NAVN   = B6B.TAB.NAVN_BARN(1);                   00013730
               ROTSEGM.TKNR   = B6B.TAB.TKNR(1);                        00013740
               ROTSEGM.SPRÅK  = B6B.SPRÅK;                              00013750
                                                                        00013760
                                                                        00013770
               CALL P005_SKRIV_ROT;                                     00013780
                                                                        00013790
                                                                        00013800
    END P001_SKRIV_ROT_B6;                                              00013810
                                                                        00013820
                                                                        00013830
                                                                        00013840
                                                                        00013850
                                                                        00013860
    /* ************************************************************** */00013870
    /*                                                                */00013880
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00013890
    /*                                                                */00013900
    /* ************************************************************** */00013910
                                                                        00013920
    P001_SKRIV_ROT_FT:                                                  00013930
      PROC ;                                                            00013940
               %INCLUDE P0011201;   /*** TRANS_OMRÅDE FT   ***/         00013950
               ROTSEGM.FNR    = FTS.FNR;                                00013960
               ROTSEGM.TKNR   = FTS.TKNR;                               00013970
               ROTSEGM.SPRÅK  = ' ';                                    00013980
                                                                        00013990
                                                                        00014000
               CALL P005_SKRIV_ROT;                                     00014010
                                                                        00014020
                                                                        00014030
    END P001_SKRIV_ROT_FT;                                              00014040
                                                                        00014050
    P001_SKRIV_ROT_F7:                                                  00014060
      PROC ;                                                            00014070
               %INCLUDE P001NC01;   /*** TRANS_OMRÅDE F7   ***/         00014080
               ROTSEGM.FNR    = F7S.FNR;                                00014090
               ROTSEGM.TKNR   = F7S.TKNR;                               00014100
               ROTSEGM.SPRÅK  = ' ';                                    00014110
                                                                        00014120
                                                                        00014130
               CALL P005_SKRIV_ROT;                                     00014140
                                                                        00014150
                                                                        00014160
    END P001_SKRIV_ROT_F7;                                              00014170
                                                                        00014180
                                                                        00014190
                                                                        00014200
    P001_SKRIV_ROT_FO:                                                  00014210
      PROC ;                                                            00014220
               %INCLUDE P001UC01;   /*** TRANS_OMRÅDE FO   ***/         00014230
               ROTSEGM.FNR    = FOS.FNR;                                00014240
               ROTSEGM.TKNR   = FOS.TKNR;                               00014250
               ROTSEGM.SPRÅK  = ' ';                                    00014260
                                                                        00014270
                                                                        00014280
               CALL P005_SKRIV_ROT;                                     00014290
                                                                        00014300
                                                                        00014310
    END P001_SKRIV_ROT_FO;                                              00014320
                                                                        00014330
                                                                        00014340
                                                                        00014350
                                                                        00014360
    /* ************************************************************** */00014370
    /*                                                                */00014380
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00014390
    /*                                                                */00014400
    /* ************************************************************** */00014410
                                                                        00014420
    P001_SKRIV_ROT_E1:                                                  00014430
      PROC ;                                                            00014440
               %INCLUDE P0011401;        /*** TRANS_OMRÅDE E1   ***/    00014450
               ROTSEGM.FNR    = E1S.FNR;                                00014460
               ROTSEGM.NAVN   = E1S.NAVN_NYTT;                          00014470
               ROTSEGM.TKNR   = E1S.TKNR;                               00014480
               ROTSEGM.SPRÅK  = E1S.SPRÅK;                              00014490
                                                                        00014500
                                                                        00014510
               CALL P005_SKRIV_ROT;                                     00014520
                                                                        00014530
                                                                        00014540
    END P001_SKRIV_ROT_E1;                                              00014550
                                                                        00014560
                                                                        00014570
    P001_SKRIV_ROT_EN:                                                  00014580
      PROC ;                                                            00014590
               %INCLUDE P001UE01;        /*** TRANS_OMRÅDE EN   ***/    00014600
               ROTSEGM.FNR    = ENS.FNR;                                00014610
               ROTSEGM.NAVN   = ENS.NAVN_NYTT;                          00014620
               ROTSEGM.TKNR   = ENS.TKNR;                               00014630
               ROTSEGM.SPRÅK  = ENS.SPRÅK;                              00014640
                                                                        00014650
                                                                        00014660
               CALL P005_SKRIV_ROT;                                     00014670
                                                                        00014680
                                                                        00014690
    END P001_SKRIV_ROT_EN;                                              00014700
                                                                        00014710
                                                                        00014720
                                                                        00014730
    /* ************************************************************** */00014740
    /*                                                                */00014750
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00014760
    /*                                                                */00014770
    /* ************************************************************** */00014780
                                                                        00014790
    P001_SKRIV_ROT_O1:                                                  00014800
      PROC ;                                                            00014810
               %INCLUDE P0011601;   /*** TRANS_OMRÅDE O1   ***/         00014820
               ROTSEGM.FNR    = O1.FNR_DØD;                             00014830
               ROTSEGM.TKNR   = O1.TKNR_DØD;                            00014840
               ROTSEGM.SPRÅK  = ' ';                                    00014850
                                                                        00014860
               CALL P005_SKRIV_ROT;                                     00014870
                                                                        00014880
                                                                        00014890
    END P001_SKRIV_ROT_O1;                                              00014900
                                                                        00014910
    /* ************************************************************** */00014920
    /*                                                                */00014930
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */ 00014940
    /*                                                                */00014950
    /* ************************************************************** */00014960
                                                                        00014970
    P001_SKRIV_ROT_O2:                                                  00014980
      PROC ;                                                            00014990
               %INCLUDE P0011701;   /* TRANS_OMRÅDE O2 ***/             00015000
               ROTSEGM.FNR    = O2.FNR;                                 00015010
               ROTSEGM.TKNR   = O2.TKNR;                                00015020
               ROTSEGM.SPRÅK  = ' ';                                    00015030
                                                                        00015040
               CALL P005_SKRIV_ROT;                                     00015050
                                                                        00015060
                                                                        00015070
    END P001_SKRIV_ROT_O2;                                              00015080
                                                                        00015090
    /* ************************************************************** */00015100
    /*                                                                */00015110
    /* PROCEDURE FOR Å LEGGE ROT-SEGMENTOPPLYSNINGER.                 */00015120
    /*                                                                */00015130
    /* ************************************************************** */00015140
                                                                        00015150
    P005_SKRIV_ROT:                                                     00015160
      PROC ;                                                            00015170
                                                                        00015180
                                                                        00015190
      W001_HJELPE_PEKER                =     ADDR ( ROTSEGM  ) ;        00015200
      W001_IO                          =     W001_HJELPE_IO    ;        00015210
      SSA_UQUAL                        =     'VT0PERSN '       ;        00015220
                                                                        00015230
      CALL PLITDLI                          (W001_DLI.PARM_CT_4,        00015240
                                             W001_DLI.ISRT,             00015250
                                             VT1,                       00015260
                                             W001_IO,                   00015270
                                             SSA_UQUAL);                00015280
                                                                        00015290
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN          00015300
        DO;                                                             00015310
           /* ******************************************** */           00015320
           /* FEIL VED SKRIV AV :  ROTSEGMENT              */           00015330
           /* ******************************************** */           00015340
  L090:                                                                 00015350
           FEIL_MELD_NR                =    500 ;                       00015360
           FEIL_VED_LABEL              =   '090';                       00015370
           GO   TO  RETUR;                                              00015380
        END;                                                            00015390
                                                                        00015400
      IF   VT1.STATUS_KODE             =   'II'    THEN                 00015410
        DO;                                                             00015420
          /* ******************************************** */            00015430
          /* SAMME ROTSEGM  LIGGER INNE FRA FØR.          */            00015440
          /* REPL FORETAES.                               */            00015450
          /* ******************************************** */            00015460
                                                                        00015470
          CALL PLITDLI                        (W001_DLI.PARM_CT_4,      00015480
                                               W001_DLI.GHU,            00015490
                                               VT1,                     00015500
                                               W001_IO,                 00015510
                                               SSA1_VT0PERSN);          00015520
                                                                        00015530
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                00015540
            ! VT1.STATUS_KODE         ^=       '  '         THEN        00015550
            DO;                                                         00015560
              /* ******************************************** */        00015570
              /* FEIL VED LES   AV :  ROTSEGM                 */        00015580
              /* ******************************************** */        00015590
  L092:                                                                 00015600
              FEIL_MELD_NR             =       500 ;                    00015610
              FEIL_VED_LABEL           =      '092';                    00015620
              DB_STATUS_KODE           =       VT1.STATUS_KODE;         00015630
              GO   TO  RETUR;                                           00015640
            END;                                                        00015650
                                                                        00015660
                                                                        00015670
          /* ******************************************** */            00015680
          /* KALLET GHU GIKK OK . FORETAR REPL AV ROTSEGM.*/            00015690
          /* ******************************************** */            00015700
                                                                        00015710
          W001_IO                      =       W001_HJELPE_IO;          00015720
          CALL PLITDLI                        (W001_DLI.PARM_CT_3,      00015730
                                               W001_DLI.REPL,           00015740
                                               VT1,                     00015750
                                               W001_IO);                00015760
                                                                        00015770
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                00015780
            ! VT1.STATUS_KODE         ^=       '  '         THEN        00015790
            DO;                                                         00015800
              /* ******************************************** */        00015810
              /* FEIL VED REPLACE AV :  ROTSEGM               */        00015820
              /* ******************************************** */        00015830
  L094:                                                                 00015840
              FEIL_MELD_NR             =       500 ;                    00015850
              FEIL_VED_LABEL           =      '094';                    00015860
              DB_STATUS_KODE           =       VT1.STATUS_KODE;         00015870
              GO   TO  RETUR;                                           00015880
            END;                                                        00015890
                                                                        00015900
                                                                        00015910
        END;                                                            00015920
      ELSE                                                              00015930
                                                                        00015940
        IF  VT1.STATUS_KODE           ^=       '  '         THEN        00015950
          DO;                                                           00015960
             /* ******************************************** */         00015970
             /* VT1.STATUS_KODE =/= 'II' OG '  '  ): DB-FEIL */         00015980
             /* ******************************************** */         00015990
  L096:                                                                 00016000
             FEIL_MELD_NR                =    500 ;                     00016010
             FEIL_VED_LABEL              =   '096';                     00016020
             DB_STATUS_KODE              =    VT1.STATUS_KODE;          00016030
             GO   TO  RETUR;                                            00016040
          END;                                                          00016050
                                                                        00016060
  RETUR:                                                                00016070
                                                                        00016080
    END P005_SKRIV_ROT;                                                 00016090
                                                                        00016100
                                                                        00016110
    %PAGE;                                                              00016120
    /* ************************************************************** */00016130
    /*                                                                */00016140
    /* PROCEDURE FOR Å LEGGE INN UNDERLIGGENDE SEGM. TIL ROT-SEGM.    */00016150
    /*                                                                */00016160
    /* ************************************************************** */00016170
                                                                        00016180
    P010_SKRIV_TRANHIST :                                               00016190
      PROC ;                                                            00016200
                                                                        00016210
                                                                        00016220
      W001_HJELPE_PEKER                =     ADDR ( TRANHIST ) ;        00016230
      W001_IO                          =     W001_HJELPE_IO    ;        00016240
      SSA_UQUAL                        =    'TRANHIST '        ;        00016250
      SSA1_TRANHIST.VTP_KEY            =     TRANHIST.VTP_KEY;          00016260
      SSA1_TRANHIST.GRBLKODE           =     TRANHIST.GRBLKODE;         00016270
                                                                        00016280
      CALL PLITDLI                          (W001_DLI.PARM_CT_5,        00016290
                                             W001_DLI.ISRT,             00016300
                                             VT1,                       00016310
                                             W001_IO,                   00016320
                                             SSA1_VT0PERSN,             00016330
                                             SSA_UQUAL);                00016340
                                                                        00016350
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN          00016360
        DO;                                                             00016370
           /* ******************************************** */           00016380
           /* FEIL VED SKRIV AV :  TRANHIST                */           00016390
           /* ******************************************** */           00016400
  L105:                                                                 00016410
           FEIL_MELD_NR                =    500 ;                       00016420
           FEIL_VED_LABEL              =   '105';                       00016430
           GO   TO  RETUR;                                              00016440
        END;                                                            00016450
                                                                        00016460
      IF   VT1.STATUS_KODE             =   'II'    THEN                 00016470
        DO;                                                             00016480
          /* ******************************************** */            00016490
          /* SAMME TRANHIST LIGGER INNE FRA FØR           */            00016500
          /* DETTE FJERNES FØR DET NYE LEGGES INN.        */            00016510
          /* ******************************************** */            00016520
                                                                        00016530
          CALL PLITDLI                        (W001_DLI.PARM_CT_5,      00016540
                                               W001_DLI.GHU,            00016550
                                               VT1,                     00016560
                                               W001_IO,                 00016570
                                               SSA1_VT0PERSN,           00016580
                                               SSA1_TRANHIST);          00016590
                                                                        00016600
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                00016610
            ! VT1.STATUS_KODE         ^=       '  '         THEN        00016620
            DO;                                                         00016630
              /* ******************************************** */        00016640
              /* FEIL VED LES   AV :  TRANHIST                */        00016650
              /* ******************************************** */        00016660
  L110:                                                                 00016670
              FEIL_MELD_NR             =       500 ;                    00016680
              FEIL_VED_LABEL           =      '110';                    00016690
              DB_STATUS_KODE           =       VT1.STATUS_KODE;         00016700
              GO   TO  RETUR;                                           00016710
            END;                                                        00016720
                                                                        00016730
                                                                        00016740
          /* ******************************************** */            00016750
          /* KALLET GHU GIKK OK . DELETER TRANHIST        */            00016760
          /* ******************************************** */            00016770
                                                                        00016780
          W001_IO                      =       W001_HJELPE_IO;          00016790
          CALL PLITDLI                        (W001_DLI.PARM_CT_3,      00016800
                                               W001_DLI.DLET,           00016810
                                               VT1,                     00016820
                                               W001_IO);                00016830
                                                                        00016840
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                00016850
            ! VT1.STATUS_KODE         ^=       '  '         THEN        00016860
            DO;                                                         00016870
              /* ******************************************** */        00016880
              /* FEIL VED DELETE  AV :  TRANHIST              */        00016890
              /* ******************************************** */        00016900
  L120:                                                                 00016910
              FEIL_MELD_NR             =       500 ;                    00016920
              FEIL_VED_LABEL           =      '120';                    00016930
              DB_STATUS_KODE           =       VT1.STATUS_KODE;         00016940
              GO   TO  RETUR;                                           00016950
            END;                                                        00016960
                                                                        00016970
                                                                        00016980
          /* ************************************************* */       00016990
          /* GML. TRANHIST ER FJERNET . DET NYE LEGGES INN     */       00017000
          /* ************************************************* */       00017010
                                                                        00017020
          W001_IO                      =       W001_HJELPE_IO;          00017030
          SSA_UQUAL                    =      'TRANHIST ';              00017040
          CALL PLITDLI                        (W001_DLI.PARM_CT_5,      00017050
                                               W001_DLI.ISRT,           00017060
                                               VT1,                     00017070
                                               W001_IO,                 00017080
                                               SSA1_VT0PERSN,           00017090
                                               SSA_UQUAL);              00017100
                                                                        00017110
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                00017120
            ! VT1.STATUS_KODE         ^=       '  '         THEN        00017130
            DO;                                                         00017140
              /* ******************************************** */        00017150
              /* FEIL VED SKRIV AV :  TRANS                   */        00017160
              /* ******************************************** */        00017170
  L130:                                                                 00017180
              FEIL_MELD_NR             =    500              ;          00017190
              FEIL_VED_LABEL           =   '130'             ;          00017200
              DB_STATUS_KODE           =    VT1.STATUS_KODE  ;          00017210
              GO   TO  RETUR;                                           00017220
            END;                                                        00017230
        END;                                                            00017240
      ELSE                                                              00017250
                                                                        00017260
        IF  VT1.STATUS_KODE           ^=       '  '         THEN        00017270
          DO;                                                           00017280
             /* ******************************************** */         00017290
             /* VT1.STATUS_KODE =/= 'II' OG '  '  ): DB-FEIL */         00017300
             /* ******************************************** */         00017310
  L140:                                                                 00017320
             FEIL_MELD_NR                =    500 ;                     00017330
             FEIL_VED_LABEL              =   '140';                     00017340
             DB_STATUS_KODE              =    VT1.STATUS_KODE;          00017350
             GO   TO  RETUR;                                            00017360
          END;                                                          00017370
  RETUR:                                                                00017380
                                                                        00017390
    END P010_SKRIV_TRANHIST;                                            00017400
                                                                        00017410
                                                                        00017420
                                                                        00017430
                                                                        00017440
    %PAGE;                                                              00017450
    /* ************************************************************** */00017460
    /*                                                                */00017470
    /* PROCEDURE FOR Å SKRIVE UT UNDERLIGGENDE SEGMENTER TIL TRANHIST.*/00017480
    /*                                                                */00017490
    /* ************************************************************** */00017500
                                                                        00017510
    P020_SKRIV_BARN_AV_TRANHIST :                                       00017520
      PROC;                                                             00017530
                                                                        00017540
      W001_IO                          =    W001_HJELPE_IO;             00017550
      CALL PLITDLI                         (W001_DLI.PARM_CT_6,         00017560
                                            W001_DLI.ISRT,              00017570
                                            VT1,                        00017580
                                            W001_IO,                    00017590
                                            SSA1_VT0PERSN,              00017600
                                            SSA1_TRANHIST,              00017610
                                            SSA_UQUAL);                 00017620
                                                                        00017630
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=    UIB_RC_OK                   00017640
        !  VT1.STATUS_KODE            ^=   '  '    THEN                 00017650
        DO;                                                             00017660
           /* ******************************************** */           00017670
           /* FEIL VED SKRIV AV :  TRANS                   */           00017680
           /* ******************************************** */           00017690
  L150:                                                                 00017700
           FEIL_MELD_NR                =    500 ;                       00017710
           FEIL_VED_LABEL              =   '150';                       00017720
           DB_STATUS_KODE              =    VT1.STATUS_KODE;            00017730
        END;                                                            00017740
    END P020_SKRIV_BARN_AV_TRANHIST;                                    00017750
                                                                        00017760
                                                                        00017770
                                                                        00017780
  L999:                                                                 00017790
                                                                        00017800
                                                                        00017810
    /* ************************************************************** */00017820
    /* RESTILLER   TRANS_PEKERENE                                     */00017830
    /* ************************************************************** */00017840
                                                                        00017850
    TRANS_PEKER                    =  W001_TRANS_PEKER     ;            00017860
    TRANS_OPPL_PEKER               =  W001_TRANS_OPPL_PEKER;            00017870
                                                                        00017880
                                                                        00017890
    IF FUNKSJONSKODE = 'B' THEN                                         00017900
       CALL DATABASE('CLOSE'); /* 020389 BRITT: CICS 1.7 */             00017910
                                                                        00017920
    EXEC CICS RETURN;                                                   00017930
                                                                        00017940
  FEILBEH:                                                              00017950
                                                                        00017960
    EXEC CICS HANDLE CONDITION ERROR(ABEND);                            00017970
                                                                        00017980
    PROGRAM_ID = 'R0010490'     ;                                       00017990
    EXEC CICS SYNCPOINT ROLLBACK;                                       00018000
                                                                        00018010
    TERMINERINGS_IND = 'F'      ;                                       00018020
    FEIL_MELD_NR     =  0       ;                                       00018030
                                                                        00018040
    KOM_OMR.TRANS_OPPL_PEKER = W001_TRANS_PEKER     ;                   00018050
    KOM_OMR.TRANS_PEKER      = W001_TRANS_OPPL_PEKER;                   00018060
                                                                        00018070
    TRANS_OPPL_OMR.TRANS_RETURKODE = 'R040';                            00018080
    TRANS_OPPL_OMR.TRANSKODE       = 'R040';                            00018090
                                                                        00018100
    EXEC CICS SEND MAP(                                                 00018110
                        'S001014') MAPSET('S001013')                    00018120
                                                   ERASE MAPONLY;       00018130
    ALLOCATE S001014O;                                                  00018140
                                                                        00018150
    S001014O.MELDINGO =                                                 00018160
             'FEIL HAR OPPSTÅTT !.TRANS FORKASTET.INGEN OPPDATERING.';  00018170
                                                                        00018180
    IF LOKAL_MELD_NO > 0    THEN                                        00018190
    S001014O.MELDINGO =                                                 00018200
             'FEIL HAR OPPSTÅTT I STATISTIKK REG. INGEN OPPDATERING.';  00018210
    LOKAL_MELD_NO = 0;                                                  00018220
                                                                        00018230
    EXEC CICS SEND MAP(                                                 00018240
                       'S001014') MAPSET('S001013')                     00018250
                                                   DATAONLY;            00018260
    EXEC CICS RETURN;                                                   00018270
                                                                        00018280
  ABEND:                                                                00018290
      EXEC CICS ABEND ABCODE(FEIL);                                     00018300
                                                                        00018310
                                                                        00018320
  /* **************************************************************** */00018330
  /*                                                                  */00018340
  /*  PROCEDURE FOR Å ÅPNE OG LUKKE VENTEDATABASEN.                   */00018350
  /*                                                                  */00018360
  /*                                                                  */00018370
  /* **************************************************************** */00018380
  /*                                                                    00018390
  */                                                                    00018400
  DATABASE:                                                             00018410
   PROC(STYRING);                                                       00018420
                                                                        00018430
   DCL                                                                  00018440
     STYRING                               CHAR(5),                     00018450
     NULL                                  BUILTIN,                     00018460
     UNSPEC                                BUILTIN,                     00018470
     PLITDLI                               ENTRY;                       00018480
                                                                        00018490
  %SKIP;                                                                00018500
  /*                                                                  */00018510
  /***** DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-****/00018520
  /*     KALL                                                         */00018530
  /*                                                                  */00018540
     DCL                                                                00018550
       W01_PSB_NAVN                CHAR (8)       INIT('B001R001');     00018560
     DCL                                                                00018570
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');         00018580
     DCL                                                                00018590
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00018600
  %PAGE;                                                                00018610
  /*                                                                  */00018620
  /****  DLI CALL-PARAMETRE                               *************/00018630
  /*                                                                  */00018640
  %SKIP(2);                                                             00018650
     DCL 1  W01_DLI_PARAM,                                              00018660
            2   W02_GU             CHAR (4)       INIT('GU  '),         00018670
            2   W02_PARM_CT_1      FIXED BIN(31)  INIT(1),              00018680
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT(3);              00018690
                                                                        00018700
  %PAGE;                                                                00018710
                                                                        00018720
       W01_PSB_NAVN      = DIV_PARAM_OMR.PSB_NAVN;                      00018730
     IF STYRING = 'OPEN' THEN                                           00018740
        DO;                                                             00018750
           CALL   PLITDLI                        (W02_PARM_CT_3,        00018760
                                                  W01_PCB_FUNCTION,     00018770
                                                  W01_PSB_NAVN,         00018780
                                                  UIBPTR);              00018790
                                                                        00018800
           IF DLIUIB.UIBFCTR                    =    '00000000'B THEN   00018810
              DO;                                                       00018820
                 ALLOCATE PCB_UIB_PEKER_OMR;                            00018830
                 PCB_UIB_PEKER_OMR.PCB_PEKER      =    UIBPCBAL;        00018840
              END;                                                      00018850
           ELSE                                                         00018860
              DO;                                                       00018870
                 FEIL_MELD_NR      =  500;                              00018880
 L555:           FEIL_VED_LABEL    = '555';                             00018890
                 MAP_MELDING =                                          00018900
                         'NOE ER GALT MED DATABASEN, KODE: ' !!         00018910
                           UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);   00018920
              END;                                                      00018930
        END;                                                            00018940
     ELSE                                                               00018950
        DO;                                                             00018960
           CALL   PLITDLI                        (W02_PARM_CT_1,        00018970
                                                  W01_TERM_FUNCTION);   00018980
           KOM_OMR.PCB_UIB_PEKER = NULL;                                00018990
        END;                                                            00019000
                                                                        00019010
  END DATABASE;                                                         00019020
                                                                        00019030
                                                                        00019040
    %INCLUDE R0015305; /* PROC. P050_SKRIV_AP_TRANS                  */ 00019050
                                                                        00019060
    %INCLUDE R00153N5; /* PROC. P050_SKRIV_A1_TRANS                  */ 00019070
                                                                        00019080
    %INCLUDE R0015306; /* PROC. P060_SKRIV_UP_TRANS                  */ 00019090
    %INCLUDE R00153N6; /* PROC. P060_SKRIV_U2_TRANS                  */ 00019100
    %INCLUDE R00153U6; /* PROC. P060_SKRIV_U3_TRANS                  */ 00019110
                                                                        00019120
    %INCLUDE R0015307; /* PROC. P070_SKRIV_US_TRANS                  */ 00019130
                                                                        00019140
    %INCLUDE R0015308; /* PROC. P080_SKRIV_EP_TRANS                  */ 00019150
    %INCLUDE R00153N8; /* PROC. P080_SKRIV_E3_TRANS                  */ 00019160
    %INCLUDE R00153U8; /* PROC. P080_SKRIV_E3_TRANS                  */ 00019170
                                                                        00019180
    %INCLUDE R0015309; /* PROC. P090_SKRIV_EF_TRANS                  */ 00019190
    %INCLUDE R00153N9; /* PROC. P090_SKRIV_E4_TRANS                  */ 00019200
                                                                        00019210
    %INCLUDE R0015310; /* PROC. P100_SKRIV_FB_TRANS                  */ 00019220
                                                                        00019230
    %INCLUDE R0015311; /* PROC. P110_SKRIV_BP_TRANS                  */ 00019240
    %INCLUDE R00153NB; /* PROC. P110_SKRIV_B6_TRANS                  */ 00019250
                                                                        00019260
    %INCLUDE R0015312; /* PROC. P120_SKRIV_FT_TRANS                  */ 00019270
    %INCLUDE R00153NC; /* PROC. P120_SKRIV_F7_TRANS                  */ 00019280
    %INCLUDE R00153UC; /* PROC. P120_SKRIV_FO_TRANS                  */ 00019290
                                                                        00019300
    %INCLUDE R0015314; /* PROC. P140_SKRIV_E1_TRANS                  */ 00019310
    %INCLUDE R00153UE; /* PROC. P140_SKRIV_EN_TRANS                  */ 00019320
                                                                        00019330
    %INCLUDE R0015316; /* PROC. P160_SKRIV_O1_TRANS                  */ 00019340
                                                                        00019350
    %INCLUDE R0015317; /* PROC. P170_SKRIV_O2_TRANS                  */ 00019360
                                                                        00019370
    %INCLUDE R0015319; /* PROC. P190_SKRIV_AF_TRANS                  */ 00019380
    %INCLUDE R00153UJ; /* PROC. P190_SKRIV_KF_TRANS                 */  00019390
                                                                        00019400
    %INCLUDE R0015320; /* PROC. P183_SKRIV_UF_TRANS                  */ 00019410
                                                                        00019420
                                                                        00019430
    %INCLUDE R0019913; /* PROC. FOR Å SNU DATO .     MMÅÅ -> ÅÅMM    */ 00019440
                                                                        00019450
  END  R001049;                                                         00019460
