 /*       SIST ENDRET 08/05-98 12.36.38 AV   JDA7339                  */00000000
 /*       SIST ENDRET 30/03-98 12.55.33 AV   JDA7339                  */00000010
 /*       SIST ENDRET 14/01-98 14.53.17 AV   JDA7339                  */00000020
 /*       SIST ENDRET 14/01-98 14.51.34 AV   JDA7339                  */00000030
 /*       SIST ENDRET 05/12-97 12.19.18 AV   JDA7339                  */00000040
 /*       SIST ENDRET 27/11-97 10.43.40 AV   JDA7339                  */00000050
 /*       SIST ENDRET 24/10-97 11.55.54 AV   JDA7339                  */00000060
 /*       SIST ENDRET 14/08-97 07.29.54 AV   HLA7339                  */00000070
 /*       SIST ENDRET 04/08-97 14.09.44 AV   JDA7339                  */00000080
 /*       SIST ENDRET 25/02-97 14.26.43 AV   JDA7339                  */00000090
 /*       SIST ENDRET 28/01-97 13.32.30 AV   JDA0310                  */00000100
 /*       SIST ENDRET 02/10-96 09.04.55 AV   JDA0310                  */00000110
 /*       SIST ENDRET 18/09-96 13.33.48 AV   TSB0310                  */00000120
 /*       SIST ENDRET 16/09-96 09.14.55 AV   JDA0310                  */00000130
 /*       SIST ENDRET 14/08-96 13.29.26 AV   JDA0310                  */00000140
 /*       SIST ENDRET 13/08-96 08.38.06 AV   JDA0310                  */00000150
 /*       SIST ENDRET 19/07-96 12.57.39 AV   HLB0310                  */00000160
 /*       SIST ENDRET 19/07-96 12.18.23 AV   HLB0310                  */00000170
 /*       SIST ENDRET 18/07-96 13.00.20 AV   HLB0310                  */00000180
 /*       SIST ENDRET 18/07-96 09.20.35 AV   HLB0310                  */00000190
 /*       SIST ENDRET 20/09-95 11.38.13 AV   JDA0310                  */00000200
 /*       SIST ENDRET 01/09-95 08.42.39 AV   JDA0310                  */00000210
 /*       SIST ENDRET 11/08-95 09.27.16 AV   HLB0310                  */00000220
 /*       SIST ENDRET 26/06-95 13.56.47 AV   JDA0310                  */00000230
 /*       SIST ENDRET 29/08-94 11.04.05 AV   DYBVIK                   */00000240
 /*       SIST ENDRET 16/08-94 11.17.15 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 12/08-94 09.54.16 AV   HERMAN                   */00000260
 /*       SIST ENDRET 11/07-94 12.39.17 AV   DYBVIK                   */00000270
 /*       SIST ENDRET 09/06-94 13.45.42 AV   DYBVIK                   */00000280
 /*       SIST ENDRET 06/06-94 09.31.48 AV   TRUDE                    */00000290
 /*       SIST ENDRET 24/05-94 14.01.15 AV   DYBVIK                   */00000300
 /*       SIST ENDRET 05/04-94 15.22.15 AV   HERMAN                   */00000310
 /*       SIST ENDRET 07/03-94 12.03.45 AV   DYBVIK                   */00000320
 /*       SIST ENDRET 25/02-94 12.24.22 AV   HERMAN                   */00000330
 /* ***************************************************************** */00000340
 /*IDENTIFIKASJON:                                                    */00000350
 /* **********************                                            */00000360
 /*  PROGRAM-IDENT : R001U603  KONTROLL_U3_SØKER   SUBPROGRAM         */00000370
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000380
 /*  PROGRAMMERER  : HERMAN                                           */00000390
 /*  PROGRAMMET BLE LAGET :     1993                                  */00000400
 /*                                                                   */00000410
 /* ***************************************************************** */00000420
 /*HENSIKT:                                                           */00000430
 /* **********                                                        */00000440
 /*  FORETAR KONTROLL AV GRUNNBLANKETT U3 - SØKERDELEN.               */00000450
 /*  RETURNERER FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RETT          */00000460
 /*                                                                   */00000470
 /*  FORETAR KONTROLL AV TILLEGGSBLANKETT YP.                         */00000480
 /*  RETURNERER FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RETT          */00000490
 /*                                                                   */00000500
 /* ***************************************************************** */00000510
 /*PROGRAMTILKNYTTING:                                                */00000520
 /* ********************                                              */00000530
 /*  PROGRAMMET INCLUDES AV R001U601 - KONTROLL_GRUNNBLANKETT_U3      */00000540
 /*  ARBEIDSOMRÅDET P001U601 ER INCLUDET I HOVEDPROG                  */00000550
 /*  BRUK :                                                           */00000560
 /*  CALL KONTROLL_U3_SØKER(FEIL_I_U3_SØKER);                         */00000570
 /*  EXEC CICS LINK TIL R0019906 - ER FNR ENDRET ?                    */00000580
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN ER INCLUDET I HOVEDPROG :    */00000590
 /*          R0019901 - F_GYLDIG_DATO                                 */00000600
 /*          R0019902 - F_KJØNN                                       */00000610
 /*          R0019903 - F_EK_ALDER                                    */00000620
 /*          R0019904 - F_GYLDIG_FNR                                  */00000630
 /*          R0019905 - F_ALDER                                       */00000640
 /*          R0019910 - F_NUMERISK                                    */00000650
 /*          R0019912 - F_FELT_PIC_CHAR11                             */00000660
 /*          R0019964 - F_6MDR                                        */00000670
 /*          VERIFY   - BUILTIN-FUNCTION                              */00000680
 /* ***************************************************************** */00000690
 /*DATASETTOPPLYSNINGER:                                              */00000700
 /* ***********************                                           */00000710
 /*   FØDSELSNR-ENDRINGSREG. LESES VED EXEC LINK TIL R0019906.        */00000720
 /*   TKNR_TAB.LESES VED EXEC CICS READ DATASET.                      */00000730
 /*                                                                   */00000740
 /* ***************************************************************** */00000750
 /*FEILMELDINGER:                                                     */00000760
 /* *******************                                               */00000770
 /*   MELDINGSNR LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM            */00000780
 /*   FEIL_FUNNET SETTES = '1'B.                                      */00000790
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDING PÅ SKJERMBILDET      */00000800
 /*                                                                   */00000810
 /* ***************************************************************** */00000820
 /*                                                                   */00000830
 /*   MODULEN KONTROLLERER U3_SØKER, OG RETURNERER                    */00000840
 /*   MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG              */00000850
 /*                                                                   */00000860
 /* ***************************************************************** */00000870
 KONTROLL_U3_SØKER:                                                     00000880
    PROC (FEIL_FUNNET);                                                 00000890
    /* -------------------------------------------------------------- */00000900
    DCL                                                                 00000910
         FEIL_FUNNET                BIT (1);                            00000920
    DCL                                                                 00000930
         KEY_BIT                    BIT(32) BASED (KEY_PEKER),          00000940
         KEY_PEKER                  POINTER,                            00000950
         TK_RECL                    CHAR (101);                         00000960
                                                                        00000970
    DCL                                                                 00000980
         01 W01_PRIM                CHAR(6);                            00000990
    DCL                                                                 00001000
         01 W01_SEKU                CHAR(6);                            00001010
    DCL                                                                 00001020
         01 W01_DIAG_PRIM DEF W01_PRIM,                                 00001030
            10 FILLER               CHAR(4),                            00001040
            10 W01_REST_PRIM        CHAR(2);                            00001050
    DCL                                                                 00001060
         01 W01_DIAG_SEKU DEF W01_SEKU,                                 00001070
            10 FILLER               CHAR(4),                            00001080
            10 W01_REST_SEKU        CHAR(2);                            00001090
    DCL                                                                 00001100
         01 W01_DIA_RECL,                                               00001110
            10 W01_DIA_RECL_KEY         CHAR(6);                        00001120
    DCL                                                                 00001130
         W_FNR                                     PIC'(11)9';          00001140
    DCL                                                                 00001150
         1 FNR DEF W_FNR,                                               00001160
           2 DAG                                   PIC'(2)9',           00001170
           2 MND                                   PIC'(2)9',           00001180
           2 AAR                                   PIC'(2)9',           00001190
           2 ÅRHUNDRE                              PIC'9',              00001200
           2 REST                                  PIC'(4)9';           00001210
    DCL                                                                 00001220
         W_FNR_EK                                  PIC'(11)9';          00001230
    DCL                                                                 00001240
         1 FNR_EK_DEF DEF W_FNR_EK,                                     00001250
           2 DAG                                   PIC'(2)9',           00001260
           2 MND                                   PIC'(2)9',           00001270
           2 AAR                                   PIC'(2)9',           00001280
           2 ÅRHUNDRE                              PIC'9',              00001290
           2 REST                                  PIC'(4)9';           00001300
    DCL                                                                 00001310
         TT_E66_ÅM                                 PIC'(4)9';           00001320
    DCL                                                                 00001330
         ALDER           FIXED DEC (5),                                 00001340
         ALDERSGRENSE    FIXED DEC (5),                                 00001350
         IÅR             FIXED BIN (15),                                00001360
         J               FIXED BIN (15),                                00001370
         TELL            FIXED BIN (15),                                00001380
         DATO            CHAR(6);                                       00001390
    DCL                                                                 00001400
         1 DAGENS_DATO   DEF DATO,                                      00001410
           2 ÅR          PIC'99',                                       00001420
           2 MN          PIC'99',                                       00001430
           2 DG          PIC'99';                                       00001440
    DCL (                                                               00001450
         DATE,                                                          00001460
         MOD )           BUILTIN;                                       00001470
    DCL                                                                 00001480
         DAGENS_DATO_ÅM  DEF DATO POS(1) PIC'(4)9';                     00001490
                                                                        00001500
    /*  HJELPE DCL FOR Å SNU DATO           */                          00001510
                                                                        00001520
    DCL                                                                 00001530
         HJ_VIRK_DATO_ÅM                        PIC '9999',             00001540
         VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅM POS(1) PIC '99',               00001550
         VIRK_DATO_M DEF HJ_VIRK_DATO_ÅM POS(3) PIC '99',               00001560
         HJ_UFT_ÅM                              PIC '9999',             00001570
         UFT_Å DEF HJ_UFT_ÅM POS(1)             PIC '99',               00001580
         UFT_M DEF HJ_UFT_ÅM POS(3)             PIC '99';               00001590
                                                                        00001600
    DCL                                                                 00001610
         HJ_VIRK_DATO_MÅ                           PIC '9999',          00001620
         HJ_VIRK_DATO_M DEF HJ_VIRK_DATO_MÅ POS(1) PIC '99',            00001630
         HJ_VIRK_DATO_Å DEF HJ_VIRK_DATO_MÅ POS(3) PIC '99',            00001640
         HJ_UFT_MÅ                                 PIC '9999',          00001650
         HJ_UFT_M DEF HJ_UFT_MÅ POS(1)             PIC '99',            00001660
         HJ_UFT_Å DEF HJ_UFT_MÅ POS(3)             PIC '99';            00001670
                                                                        00001680
    DCL  W603_DIAG                   CHAR (6)    INIT ('      '),       00001690
         W603_D_P DEF W603_DIAG      PIC '(6)9'  POS  ( 1)      ,       00001700
         W603_S12 DEF W603_DIAG      CHAR ( 2)   POS  ( 1)      ,       00001710
         W603_KEY DEF W603_DIAG      CHAR ( 5)   POS  ( 1)      ,       00001720
         W603_S6  DEF W603_DIAG      CHAR ( 1)   POS  ( 6)      ,       00001730
                                                                        00001740
         W603_DIAG_LENGTH     FIXED  BIN  (15)   INIT ( 6)      ,       00001750
         W603_KEY_LENGTH      FIXED  BIN  (15)   INIT ( 5)      ,       00001760
                                                                        00001770
         W603_KAP18                  BIT  ( 1)                  ;       00001780
                                                                        00001790
    DCL                                                                 00001800
        1 FNR_REG,                                                      00001810
          2 FNR1      FIXED DEC(11),                                    00001820
          2 FNR2      FIXED DEC(11),                                    00001830
          2 BRUKERID  CHAR     ( 4);                                    00001840
                                                                        00001850
 /*  DCL TT_FRA37_ÅM                  PIC '9999';          */           00001860
 /*  DCL TT_FRA37_Å DEF TT_FRA37_ÅM   POS (1)    PIC '99'; */           00001870
 /*  DCL TT_FRA37_M DEF TT_FRA37_ÅM   POS (3)    PIC '99'; */           00001880
    DCL TT_FRA37_M         FIXED DEC (3);                               00001890
    DCL TT_FRA37_Å         FIXED DEC (3);                               00001900
    DCL TT_HJELP_M         FIXED DEC (3);                               00001910
                                                                        00001920
    /* ============================================================== */00001930
    /* HOVEDPROGRAMMET STARTER HER                                    */00001940
    /* ============================================================== */00001950
                                                                        00001960
    DIV_PARAM_OMR.REGN_1291 = ' ';                                      00001970
    FNR_REG.BRUKERID =  DIV_PARAM_OMR.CICS_IND;                         00001980
    DATO             =  DATE ()        ;                                00001990
 /* FEIL_FUNNET      =  '0'B           ; */                             00002000
    KEY_PEKER        =  ADDR (U3S.TKNR);                                00002010
                                                                        00002020
    HJ_VIRK_DATO_MÅ  = U3S.VIRK_DATO_MÅ;                                00002030
    VIRK_DATO_Å      = HJ_VIRK_DATO_Å;                                  00002040
    VIRK_DATO_M      = HJ_VIRK_DATO_M;                                  00002050
    HJ_UFT_ÅM = F_SNU_DATO(U3S.UFT_MÅ);                                 00002060
                                                                        00002070
    IF HJ_VIRK_DATO_ÅM < 9308 & (U3S.SIVILSTAND = 'P')  THEN            00002080
       DO;                                                              00002090
          /* ----------------------------------------------------- */   00002100
          /* SIVILSTAND LIK P UGYLDIG FØR 01.08.93                 */   00002110
          /* ----------------------------------------------------- */   00002120
          FEIL_FUNNET = '1'B;                                           00002130
          U3S.SIVILSTANDNR = 388;                                       00002140
       END;                                                             00002150
    ELSE                                                                00002160
    IF HJ_VIRK_DATO_ÅM < 9401 & (U3S.SIVILSTAND = 'W')  THEN            00002170
       DO;                                                              00002180
          /* ----------------------------------------------------- */   00002190
          /* SIVILSTAND LIK W UGYLDIG FØR 01.01.94                 */   00002200
          /* ----------------------------------------------------- */   00002210
          FEIL_FUNNET = '1'B;                                           00002220
          U3S.SIVILSTANDNR = 389;                                       00002230
       END;                                                             00002240
                                                                        00002250
    W01_PRIM         = U3S.PRIMDIAG;                                    00002260
    W01_SEKU         = U3S.SEKUDIAG;                                    00002270
                                                                        00002280
    IF VERIFY(U3S.ATT_UF,'AUX') ^= 0 THEN                               00002290
       DO;                                                              00002300
          FEIL_FUNNET  = '1'B;                                          00002310
          U3S.ATT_UFNR = 268;                                           00002320
       END;                                                             00002330
    IF U3S.ATT_UF = 'X'       THEN          /*HL 0895*/                 00002340
       U3S.SIVILSTAND = 'U';                                            00002350
     /* ---------------------------------------------------------- */   00002360
     /* 1.1 FØDSELSNUMMER SØKER                                    */   00002370
     /* ---------------------------------------------------------- */   00002380
    IF ^F_NUMERISK(F_FELT_PIC_CHAR11(U3S.FNR)) THEN                     00002390
       DO;                                                              00002400
          FEIL_FUNNET = '1'B;                                           00002410
          U3S.FNRNR   = 200;                                            00002420
       END;                                                             00002430
    ELSE                                                                00002440
       IF ^F_GYLDIG_FNR(U3S.FNR) THEN                                   00002450
          DO;                                                           00002460
             FEIL_FUNNET = '1'B;                                        00002470
             U3S.FNRNR   = 1;                                           00002480
          END;                                                          00002490
       ELSE                                                             00002500
          DO;                                                           00002510
             FNR_REG.FNR1 = U3S.FNR;                                    00002520
             W_FNR        = U3S.FNR;                                    00002530
             EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);      00002540
             IF FNR_REG.FNR2 > 0 THEN                                   00002550
                DO;                                                     00002560
                   U3S.FNRNR   = 203;                                   00002570
                   U3S.FNR_GML = U3S.FNR;                               00002580
                   U3S.FNR     = FNR_REG.FNR2;                          00002590
                END;                                                    00002600
          END;                                                          00002610
    IF U3S.NAVN = (25)' ' THEN                                          00002620
       DO;                                                              00002630
          FEIL_FUNNET = '1'B;                                           00002640
          U3S.NAVNNR  = 2;                                              00002650
       END;                                                             00002660
    IF VERIFY(U3S.SPRÅK,'NBE ') ^= 0 THEN                               00002670
       DO;                                                              00002680
          FEIL_FUNNET = '1'B;                                           00002690
          U3S.SPRÅKNR = 6;                                              00002700
       END;                                                             00002710
  /* ------------------------------------------------------------- */   00002720
  /* 1.2 TRYGDEKONTORNUMMER                                        */   00002730
  /* ------------------------------------------------------------- */   00002740
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(U3S.TKNR)) THEN                    00002750
       DO;                                                              00002760
          FEIL_FUNNET = '1'B;                                           00002770
          U3S.TKNRNR  = 200;                                            00002780
       END;                                                             00002790
    ELSE                                                                00002800
       DO;                                                              00002810
            EXEC CICS HANDLE CONDITION NOTFND(NOTFND);                  00002820
            EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)          00002830
                                               INTO(TK_RECL);           00002840
            GOTO TKNR_UT;                                               00002850
        NOTFND:                                                         00002860
            FEIL_FUNNET = '1'B;                                         00002870
            U3S.TKNRNR  = 3;                                            00002880
            LEAVE;                                                      00002890
        TKNR_UT:                                                        00002900
                DIV_PARAM_OMR.DIV_TKNR = SUBSTR(TK_RECL,1,4);           00002910
       END;                                                             00002920
     /* ------------------------------------------------------------- */00002930
     /* 1.5 SIVILSTAND                                                */00002940
     /* ------------------------------------------------------------- */00002950
    IF VERIFY(U3S.SIVILSTAND,'GASUEPWV') ^= 0 THEN                      00002960
       DO;                                                              00002970
          FEIL_FUNNET      = '1'B;                                      00002980
          U3S.SIVILSTANDNR = 5;                                         00002990
       END;                                                             00003000
     /* ------------------------------------------------------------- */00003010
     /* 1.7 TILLEGG FOR EKTEFELLE/SAMBOER/PARTNER                     */00003020
     /* ------------------------------------------------------------- */00003030
    IF   VERIFY(U3S.TILL_EK,'J ') ^= 0 THEN                             00003040
       DO;                                                              00003050
          FEIL_FUNNET   ='1'B;                                          00003060
          U3S.TILL_EKNR = 4;                                            00003070
       END;                                                             00003080
     /* ------------------------------------------------------------- */00003090
     /* ATTFØRINGSPENGER I VENTETID - IKKE UNDER 50%                  */00003100
     /* ------------------------------------------------------------- */00003110
     IF   U3S.ATT_UF = 'A' &                                            00003120
          U3S.UFG < 50                   THEN                           00003130
       DO;                                                              00003140
          /* -------------------------------------------------------- */00003150
          /* NY TEST IFBM TILLATELSE TIL UFØREGRAD UNDER 50%, HL9705  */00003160
          /* -------------------------------------------------------- */00003170
          FEIL_FUNNET = '1'B;                                           00003180
          U3S.UFGNR     = 427;                                          00003190
       END;                                                             00003200
     /* ------------------------------------------------------------- */00003210
     IF   HJ_VIRK_DATO_ÅM < 9705               THEN                     00003220
        IF   U3S.UFG < 50 &                                             00003230
             U3S.TILL_EK = 'J'              THEN                        00003240
           DO;                                                          00003250
              FEIL_FUNNET = '1'B;                                       00003260
              U3S.TILL_EKNR = 303;                                      00003270
              U3S.UFGNR     = 999;                                      00003280
           END; /* 9705 HL HIT */                                       00003290
     /* ------------------------------------------------------------- */00003300
     /* ------------------------------------------------------------- */00003310
     /* 1.6 NORSK BOSATT                                              */00003320
     /* ------------------------------------------------------------- */00003330
    IF VERIFY(U3S.NORSK_BOSATT,'JN') ^= 0 THEN                          00003340
       DO;                                                              00003350
          FEIL_FUNNET        = '1'B;                                    00003360
          U3S.NORSK_BOSATTNR = 8;                                       00003370
       END;                                                             00003380
    ELSE                                                                00003390
    IF U3S.NORSK_BOSATT = 'J'    THEN                                   00003400
     DO;                                                                00003410
     IF HJ_VIRK_DATO_ÅM  > 9100    THEN     /* TS 0695 */               00003420
       DO;                                                              00003430
                    /* ---------------------------------------------- */00003440
                    /* REVIDERT BEREGNINGEN NEDENFOR : 050494 HL      */00003450
                    /* ---------------------------------------------- */00003460
                    /*   TT_FRA37_ÅM = HJ_UFT_ÅM -((FNR.AAR + 16)     */00003470
                    /*                               * 100 + FNR.MND) */00003480
                    /* ---------------------------------------------- */00003490
          TT_FRA37_M  = (UFT_Å -(FNR.AAR + 16)) * 12                    00003500
                        + UFT_M - FNR.MND;                              00003510
          TT_FRA37_Å  = TT_FRA37_M / 12;                                00003520
          TT_HJELP_M  = TT_FRA37_Å * 12;                                00003530
          U3SP.TT_FRA1937_ÅR  = TT_FRA37_Å;                             00003540
          U3SP.TT_FRA1937_MND = TT_FRA37_M - TT_HJELP_M;                00003550
       END;                                                             00003560
      ELSE                                                              00003570
        DO;                                                             00003580
                    /* ---------------------------------------------- */00003590
                    /* VIRKNINGSTIDSPUNKTET ER FØR 1991               */00003600
                    /* ---------------------------------------------- */00003610
                    /* TRYGDETID FØR 91 , FØR OG ETTER 1966.TS 0695   */00003620
                    /* ---------------------------------------------- */00003630
            IF FNR.ÅRHUNDRE < 5       THEN                              00003640
               DO;                                                      00003650
                         /* ----------------------------------------- */00003660
                         /* SØKEREN ER FØDD I 19XX                    */00003670
                         /* ----------------------------------------- */00003680
                  U3SP.TT_F67 = 67 - (FNR.AAR + 16);                    00003690
                  IF (FNR.AAR + 16) > 67 THEN                           00003700
                     DO;                                                00003710
                              /* ------------------------------------ */00003720
                              /* SØKEREN ER FØDT 1951 ELLER SENERE    */00003730
                              /* ------------------------------------ */00003740
                        U3SP.TT_F67 = 0;                                00003750
                        IF UFT_Å > 66  &                                00003760
                           UFT_Å >= (FNR.AAR + 16)   THEN               00003770
                           DO;                                          00003780
                              IF UFT_M < FNR.MND          THEN          00003790
                                 DO;                                    00003800
                                    U3SP.TT_E66_Å = UFT_Å -             00003810
                                         (FNR.AAR + 17);                00003820
                                    U3SP.TT_E66_M = UFT_M -             00003830
                                          FNR.MND + 12;                 00003840
                                 END;                                   00003850
                              ELSE                                      00003860
                                 DO;                                    00003870
                                    U3SP.TT_E66_Å = UFT_Å -             00003880
                                         (FNR.AAR + 16);                00003890
                                    U3SP.TT_E66_M = UFT_M -             00003900
                                          FNR.MND;                      00003910
                                 END;                                   00003920
                           END;                                         00003930
                        ELSE                                            00003940
                           DO;                                          00003950
                              U3SP.TT_E66_Å = 0;                        00003960
                              U3SP.TT_E66_M = 0;                        00003970
                           END;                                         00003980
                     END;                                               00003990
                  ELSE                                                  00004000
                     /* ------------------------------------ */         00004010
                     /* SØKEREN ER FØDT 1900 - 1950          */         00004020
                     /* ------------------------------------ */         00004030
                     IF UFT_Å > 66    THEN                              00004040
                        DO;                                             00004050
                           /* ------------------------------- */        00004060
                           /* UFØRETIDSPUNKTET ER ETTER 1966  */        00004070
                           /* ------------------------------- */        00004080
                           U3SP.TT_E66_Å = UFT_Å - 67;                  00004090
                           U3SP.TT_E66_M = UFT_M;                       00004100
                        END;                                            00004110
                     ELSE                                               00004120
                        DO;                                             00004130
                           /* ------------------------------- */        00004140
                           /* UFØRETIDSPUNKTET ER FØR 1967    */        00004150
                           /* ------------------------------- */        00004160
                           U3SP.TT_E66_Å = 0;                           00004170
                           U3SP.TT_E66_M = 0;                           00004180
                        END;                                            00004190
               END;                                                     00004200
            ELSE                                                        00004210
               DO;                                                      00004220
                  /* ----------------------------------------- */       00004230
                  /* SØKEREN ER FØDT I 18XX                    */       00004240
                  /* ----------------------------------------- */       00004250
                  U3SP.TT_F67 = 67 - (FNR.AAR + 16 - 100);              00004260
                  IF UFT_Å > 66    THEN                                 00004270
                     DO;                                                00004280
                        U3SP.TT_E66_Å = UFT_Å - 67;                     00004290
                        U3SP.TT_E66_M = UFT_M;                          00004300
                     END;                                               00004310
                  ELSE                                                  00004320
                     DO;                                                00004330
                        U3SP.TT_E66_Å = 0;                              00004340
                        U3SP.TT_E66_M = 0;                              00004350
                     END;                                               00004360
               END; /* SØKER FØDT FØR ÅR 1900 */                        00004370
        END;    /*VIRK DATO < 9101 */                                   00004380
     END;    /* NORSK BOSTATT */                                        00004390
     /* ------------------------------------------------------------- */00004400
     /* 1.7 TILLEGG FOR BARN                                          */00004410
     /* ------------------------------------------------------------- */00004420
    IF VERIFY(U3S.TILL_BARN,'J ') ^= 0 THEN                             00004430
       DO;                                                              00004440
          FEIL_FUNNET = '1'B;                                           00004450
          U3S.TILL_BARNNR = 207; /*HL*/                                 00004460
       END;                                                             00004470
     /* ------------------------------------------------------------- */00004480
     /* 1.12 SÆRREGLER FOR YRKESSKADE (KAP 13, JFR. PRG. 12-18)       */00004490
     /* ------------------------------------------------------------- */00004500
    IF VERIFY(U3S.YSKADE_TILLEGG,'J ') ^= 0 THEN                        00004510
       DO;                                                              00004520
          FEIL_FUNNET   ='1'B;                                          00004530
          U3S.YSKADE_TILLEGGNR = 300;                                   00004540
       END;                                                             00004550
                                                                        00004560
  /* DERSOM VP_ÅR1 ER NULL NOEN AV DE ANDRE UTFYLT, NULLES DISSE  */    00004570
                                                                        00004580
    DO J = 1 TO 4 UNTIL(F_FELT_PIC_CHAR2(U3S.VP_ÅR(J) = '00'));         00004590
       IF F_FELT_PIC_CHAR2(U3S.VP_ÅR(J)) = '00' THEN                    00004600
          DO TELL            = J TO 4;                                  00004610
             U3S.VP_ÅR(TELL) = 0;                                       00004620
          END;                                                          00004630
    END;                                                                00004640
    /* ------------------------------------------------------------- */ 00004650
    DO IÅR = 1 TO 4 WHILE (F_FELT_PIC_CHAR2(U3S.VP_ÅR(IÅR)) ^= '00');   00004660
       IF ^F_NUMERISK(F_FELT_PIC_CHAR2(U3S.VP_ÅR(IÅR))) THEN            00004670
          DO;                                                           00004680
             FEIL_FUNNET      = '1'B;                                   00004690
             U3S.VP_ÅRNR(IÅR) = 200;                                    00004700
          END;                                                          00004710
       ELSE                                                             00004720
          IF ^(U3S.VP_ÅR(IÅR)> 66 & U3S.VP_ÅR(IÅR)<= DAGENS_DATO.ÅR) !  00004730
             U3S.VP_ÅR(IÅR) < (FNR.AAR + 17)                       THEN 00004740
             DO;                                                        00004750
                FEIL_FUNNET      = '1'B;                                00004760
                U3S.VP_ÅRNR(IÅR) = 47;                                  00004770
             END;                                                       00004780
    END;                                                                00004790
    /* -------------------------------------------------------------- */00004800
    /* KONTROLL FELT 1.11 - YNGSTE BARNS FØDSELSÅR, MH 0497           */00004810
    /* -------------------------------------------------------------- */00004820
    IF   (U3S.YNGSTE_BARN_FÅR > 0)   THEN                               00004830
       DO;                                                              00004840
          IF   (UFT_Å < 93)              THEN                           00004850
             DO;                                                        00004860
                U3S.YNGSTE_BARN_FÅRNR = 473;                            00004870
                FEIL_FUNNET           = '1'B;                           00004880
             END;                                                       00004890
          ELSE                                                          00004900
          IF   (UFT_Å > (U3S.YNGSTE_BARN_FÅR + 6))       THEN           00004910
             DO;                                                        00004920
                U3S.YNGSTE_BARN_FÅRNR = 425;                            00004930
                FEIL_FUNNET = '1'B;                                     00004940
             END;                                                       00004950
          ELSE                                                          00004960
          IF   (UFT_Å < U3S.YNGSTE_BARN_FÅR)           THEN             00004970
             DO;                                                        00004980
                U3S.YNGSTE_BARN_FÅRNR = 426;                            00004990
                FEIL_FUNNET = '1'B;                                     00005000
             END;                                                       00005010
       END;                                                             00005020
    /* -------------------------------------------------------------- */00005030
  /*IF U3S.YNGSTE_BARN_FÅR > DAGENS_DATO.ÅR THEN                        00005040
       DO;                                                              00005050
          U3S.YNGSTE_BARN_FÅRNR = 473;     TS 0694                      00005060
          FEIL_FUNNET = '1'B;                                           00005070
       END;              */                                             00005080
                                                                        00005090
     /* ------------------------------------------------------------- */00005100
     /* 1.14 UTDANNING                                                */00005110
     /* ------------------------------------------------------------- */00005120
    IF U3S.ATT_UF ^= 'X'    THEN          /*HL 0895*/                   00005130
       DO;                                                              00005140
          /* -------------------------------------------------------- */00005150
          /* DA VI IKKJE LAGRER DAGPENGER, BRYR VI OSS IKKJE OM AT    */00005160
          /* FELTET I DISSE TILFELLENE KAN INNEHOLDE FEIL             */00005170
          /* -------------------------------------------------------- */00005180
          IF ^F_NUMERISK(F_FELT_PIC_CHAR1(U3S.UTDANNING)) THEN          00005190
             DO;                                                        00005200
                U3S.UTDANNINGNR    = 352;                               00005210
                FEIL_FUNNET = '1'B;                                     00005220
             END;                                                       00005230
          IF VERIFY(U3S.UTDANNING,'123') ^= 0 THEN                      00005240
             DO;                                                        00005250
                U3S.UTDANNINGNR    = 352;                               00005260
                FEIL_FUNNET        = '1'B;                              00005270
             END;                                                       00005280
       END; /* KONTROLL FELT 1.14 */                                    00005290
                                                                        00005300
    /* -------------------------------------------------------------- */00005310
    /* 1.9 ARBEIDSINNTEKT MINST 1G PÅ UFT (PGR. 3-17 BOKSTAV A)       */00005320
    /* -------------------------------------------------------------- */00005330
  /*IF ^(U3S.VILKÅR_8_4_3A = 'J' ! U3S.VILKÅR_8_4_3A = 'N') THEN*/      00005340
    IF VERIFY(U3S.VILKÅR_8_4_3A,'JN') ^= 0 THEN                         00005350
       DO;                                                              00005360
          FEIL_FUNNET      = '1'B;                                      00005370
          U3S.VILKÅR_8_4_3ANR = 45;                                     00005380
       END;                                                             00005390
    /* -------------------------------------------------------------- */00005400
    IF ^F_NUMERISK(F_FELT_PIC_CHAR3(U3S.UFG)) THEN                      00005410
       DO;                                                              00005420
          FEIL_FUNNET = '1'B;                                           00005430
          U3S.UFGNR   = 200;                                            00005440
       END;                                                             00005450
    ELSE                                                                00005460
                                                                        00005470
 /*9705 HL : */                                                         00005480
  IF (U3S.YSKADE_TILLEGG = 'J')           THEN                          00005490
    DO;                                                                 00005500
       IF ^(                                                            00005510
      U3S.UFG = 15 ! U3S.UFG = 20 ! U3S.UFG = 25 ! U3S.UFG = 30 !       00005520
      U3S.UFG = 35 ! U3S.UFG = 40 ! U3S.UFG = 45 !                      00005530
      U3S.UFG = 50 ! U3S.UFG = 55 ! U3S.UFG = 60 ! U3S.UFG = 65 !       00005540
      U3S.UFG = 70 ! U3S.UFG = 75 ! U3S.UFG = 80 ! U3S.UFG = 85 !       00005550
      U3S.UFG = 90 ! U3S.UFG = 95 ! U3S.UFG = 100 !                     00005560
                                    U3S.UFG = 0   )  THEN               00005570
      DO;                                                               00005580
         FEIL_FUNNET = '1'B;                                            00005590
         U3S.UFGNR   = 350;                                             00005600
      END;                                                              00005610
    END;                                                                00005620
  ELSE   /*IKKE YRKESSKADE*/                                            00005630
    DO;                                                                 00005640
       IF ( HJ_VIRK_DATO_ÅM < 9705   &                                  00005650
            U3S.UFG < 50             )   THEN                           00005660
            DO;                                                         00005670
               FEIL_FUNNET = '1'B;                                      00005680
               U3S.UFGNR   = 38;                                        00005690
            END;                                                        00005700
       ELSE                                                             00005710
       IF ^(U3S.UFG = 20 ! U3S.UFG = 25 ! U3S.UFG = 30 ! U3S.UFG = 35 ! 00005720
            U3S.UFG = 40 ! U3S.UFG = 45 !    /*9705 HL*/                00005730
            U3S.UFG = 50 ! U3S.UFG = 55 ! U3S.UFG = 60 ! U3S.UFG = 65 ! 00005740
            U3S.UFG = 70 ! U3S.UFG = 75 ! U3S.UFG = 80 ! U3S.UFG = 85 ! 00005750
            U3S.UFG = 90 ! U3S.UFG = 95 ! U3S.UFG = 100) THEN           00005760
            DO;                                                         00005770
               FEIL_FUNNET = '1'B;                                      00005780
               U3S.UFGNR   = 38;                                        00005790
            END;                                                        00005800
    END;                                                                00005810
    IF ^F_NUMERISK(F_FELT_PIC_CHAR4(U3S.UFT_MÅ)) THEN                   00005820
       DO;                                                              00005830
          FEIL_FUNNET  = '1'B;                                          00005840
          U3S.UFT_MÅNR = 200;                                           00005850
       END;                                                             00005860
    ELSE                                                                00005870
 /*    IF ^F_GYLDIG_DATO(U3S.UFT_MÅ) THEN                */             00005880
       IF UFT_M = 0      !                 /*160796 HL*/                00005890
          UFT_M > 12                 THEN                               00005900
          DO;                                                           00005910
             FEIL_FUNNET  = '1'B;                                       00005920
             U3S.UFT_MÅNR = 40;                                         00005930
          END;                                                          00005940
                                                                        00005950
    IF ^F_NUMERISK(F_FELT_PIC_CHAR7(U3S.PI)) THEN                       00005960
       DO;                                                              00005970
          FEIL_FUNNET = '1'B;                                           00005980
          U3S.PINR    = 200;                                            00005990
       END;                                                             00006000
                                                                        00006010
    /* -------------------------------------------------------------- */00006020
    /* 1.13 YRKESMESSIG ATTFØRING FORSØKT ? KRAV VED PENSJON          */00006030
    /* -------------------------------------------------------------- */00006040
    IF VERIFY(U3S.YRKESM_ATTF,'JN') ^= 0 THEN                           00006050
       IF VERIFY(U3S.ATT_UF,'X') ^= 0 THEN                              00006060
          DO;                                                           00006070
             FEIL_FUNNET        = '1'B;                                 00006080
             U3S.YRKESM_ATTFNR  = 353;                                  00006090
          END;                                                          00006100
       ELSE                                                             00006110
          U3S.YRKESM_ATTF = ' ';                                        00006120
                                                                        00006130
    IF U3S.ATT_UF      = 'X'       THEN                   /*DAGPENGER*/ 00006140
       DO;                                                              00006150
          U3S.TILL_EK = ' ' ;                                           00006160
          U3S.TILL_BARN = ' ';                                          00006170
 /*       U3S.PI = 0;                  */                               00006180
          U3S.NAVN_EK  = ' ';                                           00006190
       END;       /*END ATT_UF = X*/                                    00006200
                                                                        00006210
    /* -------------------------------------------------------------- */00006220
    /* 1.15 YRKESKODE                                                 */00006230
    /* -------------------------------------------------------------- */00006240
    IF ^F_NUMERISK(F_FELT_PIC_CHAR2(U3S.YRKE)) THEN                     00006250
       DO;                                                              00006260
          FEIL_FUNNET = '1'B;                                           00006270
          U3S.YRKENR  = 200;                                            00006280
       END;                                                             00006290
    ELSE                                                                00006300
       IF ^ (U3S.YRKE >= 0 & U3S.YRKE <= 19) ! U3S.YRKE = 8 THEN        00006310
          DO;                                                           00006320
             FEIL_FUNNET = '1'B;                                        00006330
             U3S.YRKENR  = 42;                                          00006340
          END;                                                          00006350
    /* -------------------------------------------------------------- */00006360
    /* 1.18 GARANTI SOM UNG UFØR       9802                           */00006370
    /* -------------------------------------------------------------- */00006380
    IF VERIFY(U3S.GARANTERT_TP, 'JN ') ^= 0 THEN                        00006390
       DO;                                                              00006400
          FEIL_FUNNET        = '1'B;                                    00006410
          U3S.GARANTERT_TPNR = 1541;                                    00006420
       END;                                                             00006430
                                                                        00006440
                                                                        00006450
    /* -------------------------------------------------------------- */00006460
    W603_KAP18        = '0'B;                                           00006470
    /* -------------------------------------------------------------- */00006480
    /* 1.19 PRIMÆRDIAGNOSE                                            */00006490
    /* -------------------------------------------------------------- */00006500
    IF U3S.PRIMDIAG  ^= '      '  &                                     00006510
       W01_REST_PRIM ^= 'XX'      THEN                                  00006520
       DO;                                                              00006530
          /*-------------------------------------------------------*/   00006540
          /* SJEKKER OM GYLDIG DIAGNOSE-KODE MOT DIAGNOSE-FILEN    */   00006550
          /* SJEKKER OM PRIMÆRDIAGNOSE ER INNEFOR DE INTERVALLER   */   00006560
          /* SOM KREVER SEK.DIAG FRA KAP.18                        */   00006570
          /*-------------------------------------------------------*/   00006580
          EXEC CICS HANDLE CONDITION         NOTFND (NOTFND1);          00006590
          EXEC CICS READ DATASET ('DIAGNOS') RIDFLD (U3S.PRIMDIAG)      00006600
                                             INTO   (W01_DIA_RECL);     00006610
          IF VERIFY (U3S.PRIMDIAG , '0123456789')  = 0 THEN             00006620
             DO;                                                        00006630
                W603_DIAG         =  U3S.PRIMDIAG;                      00006640
                IF (W603_D_P     >=  905000  &                          00006650
                    W603_D_P     <=  909900   )  !                      00006660
                   (W603_D_P     >=  998000  &                          00006670
                    W603_D_P     <=  998901   )      THEN               00006680
                                                                        00006690
                    W603_KAP18    = '1'B;                               00006700
             END;                                                       00006710
       END;                                                             00006720
                                                                        00006730
    GOTO DIAG_UT1;                                                      00006740
                                                                        00006750
 NOTFND1:                                                               00006760
    FEIL_FUNNET        = '1'B;                                          00006770
    U3S.PRIMDIAGNR     =  43;                                           00006780
                                                                        00006790
 DIAG_UT1:                                                              00006800
    IF U3S.SEKUDIAG   ^= '      ' &                                     00006810
       W01_REST_SEKU  ^= 'XX'     THEN                                  00006820
       DO;                                                              00006830
          W603_DIAG    =  U3S.SEKUDIAG;                                 00006840
          IF W603_KAP18                       THEN                      00006850
             DO;                                                        00006860
                IF (W603_S12 ^=   'E9'     &                            00006870
                    W603_S12 ^=   'E8'      ) !                         00006880
                   VERIFY (W603_S6,'123456789') > 0 THEN                00006890
                   DO;                                                  00006900
                      FEIL_FUNNET    = '1'B;                            00006910
                      U3S.SEKUDIAGNR =  295;                            00006920
                   END;                                                 00006930
                ELSE DO;                                                00006940
                      /*-----------------------------------------*/     00006950
                      /* OPPSLAG MED SIFFER 1-5 I DIAGNOSE KAP18 */     00006960
                      /*-----------------------------------------*/     00006970
                      EXEC CICS HANDLE  CONDITION   NOTFND (NOTFND2);   00006980
                      EXEC CICS READ    DATASET   ('DIAGNOS' )          00006990
                                        RIDFLD    ( W603_KEY )          00007000
                                        INTO      ( W01_DIA_RECL)       00007010
                                        LENGTH    ( W603_DIAG_LENGTH)   00007020
                                        KEYLENGTH ( W603_KEY_LENGTH )   00007030
                                        GENERIC                         00007040
                                        EQUAL;                          00007050
                      GOTO DIAG_UT2;                                    00007060
                   END;                                                 00007070
             END;                                                       00007080
          ELSE                                                          00007090
             DO;                                                        00007100
                /*-----------------------------------------------*/     00007110
                /* PRIM DIAG ULIK KAP18. SJEKKER OM SEKU DIAG =  */     00007120
                /*-----------------------------------------------*/     00007130
                IF W603_S12  =   'E9'     !                             00007140
                   W603_S12  =   'E8'                THEN               00007150
                   DO;                                                  00007160
                      FEIL_FUNNET    = '1'B;                            00007170
                      U3S.SEKUDIAGNR =  296;                            00007180
                      GOTO DIAG_UT2;                                    00007190
                   END;                                                 00007200
             END;                                                       00007210
          EXEC CICS HANDLE CONDITION NOTFND(NOTFND2);                   00007220
          EXEC CICS READ   DATASET ('DIAGNOS')                          00007230
                           RIDFLD (U3S.SEKUDIAG)                        00007240
                           INTO   (W01_DIA_RECL);                       00007250
       END;                                                             00007260
    ELSE                                                                00007270
       DO;                                                              00007280
          /*---------------------------------------------------- */     00007290
          /* SEKUNDÆRDIAGNOSE ER IKKE REGISTRERT                 */     00007300
          /* SJEKKER OM PRIM DIAG =  KAP18-KODE                  */     00007310
          /*---------------------------------------------------- */     00007320
          IF W603_KAP18                              THEN               00007330
             DO;                                                        00007340
                FEIL_FUNNET          = '1'B;                            00007350
                U3S.SEKUDIAGNR       =  297;                            00007360
             END;                                                       00007370
       END;                                                             00007380
                                                                        00007390
    GOTO DIAG_UT2;                                                      00007400
                                                                        00007410
 NOTFND2:                                                               00007420
    FEIL_FUNNET        = '1'B;                                          00007430
    U3S.SEKUDIAGNR     = 44;                                            00007440
                                                                        00007450
 DIAG_UT2:                                                              00007460
    IF ^F_NUMERISK(F_FELT_PIC_CHAR4(U3S.VIRK_DATO_MÅ)) THEN             00007470
       DO;                                                              00007480
          FEIL_FUNNET        = '1'B;                                    00007490
          U3S.VIRK_DATO_MÅNR = 200;                                     00007500
       END;                                                             00007510
    ELSE                                                                00007520
       DO;                                                              00007530
          IF ^F_GYLDIG_DATO(U3S.VIRK_DATO_MÅ) THEN                      00007540
             DO;                                                        00007550
                FEIL_FUNNET        = '1'B;                              00007560
                U3S.VIRK_DATO_MÅNR = 9;                                 00007570
             END;                                                       00007580
 /*       ELSE                                                          00007590
          IF HJ_VIRK_DATO_ÅM < 9101 THEN                                00007600
             DO;                                                        00007610
                FEIL_FUNNET        = '1'B;                              00007620
                U3S.VIRK_DATO_MÅNR = 364;                               00007630
             END;                                                       00007640
 */                                                                     00007650
       END;                                                             00007660
                                                                        00007670
        /* ---------------------------------------------------------- */00007680
        /* 1.21 INNTEKT FØR UP                                        */00007690
        /* ---------------------------------------------------------- */00007700
    IF ^F_NUMERISK(F_FELT_PIC_CHAR7(U3S.INNTEKT_FØR_UP)) THEN           00007710
       DO;                                                              00007720
          FEIL_FUNNET        = '1'B;                                    00007730
          U3S.INNTEKT_FØR_UPNR = 200;                                   00007740
       END;                                                             00007750
    IF U3S.INNTEKT_FØR_UP > 0 & U3S.ATT_UF = 'A' THEN                   00007760
       DO;                                                              00007770
          FEIL_FUNNET        = '1'B;                                    00007780
          U3S.INNTEKT_FØR_UPNR = 399;   /* JD 02.97 */                  00007790
       END;                                                             00007800
    /* ---------------------------------------------------------- */    00007810
    /* 1.22 TIDSBEGRENSET ATTFØRING                         §     */    00007820
    /* ---------------------------------------------------------- */    00007830
                                                                        00007840
    IF   (VERIFY(U3S.TIDSBEGR_ATTF,'SX ') ^=0)    THEN                  00007850
       DO;                                                              00007860
          FEIL_FUNNET = '1'B;                                           00007870
          U3S.TIDSBEGR_ATTFNR = 429;                                    00007880
       END;                                                             00007890
    /* ---------------------------------------------------------- */    00007900
    /* 1.23 VARIG SKJERMET ATTFØRING                        §     */    00007910
    /* ---------------------------------------------------------- */    00007920
                                                                        00007930
    IF   (VERIFY(U3S.SKJERM_ATTF,'SX ') ^=0)    THEN                    00007940
       DO;                                                              00007950
          FEIL_FUNNET = '1'B;                                           00007960
          U3S.SKJERM_ATTFNR = 429;                                      00007970
       END;                                                             00007980
                                                                        00007990
    IF   U3S.TIDSBEGR_ATTF  = 'S'             &                         00008000
         U3S.SKJERM_ATTF  = 'S'                        THEN             00008010
       DO;                                                              00008020
          FEIL_FUNNET = '1'B;                                           00008030
          U3S.TIDSBEGR_ATTFNR = 442;                                    00008040
       END;                                                             00008050
                                                                        00008060
    IF   U3S.TIDSBEGR_ATTF  = 'X'             &                         00008070
         U3S.SKJERM_ATTF  = 'X'                        THEN             00008080
       DO;                                                              00008090
          FEIL_FUNNET = '1'B;                                           00008100
          U3S.TIDSBEGR_ATTFNR = 442;                                    00008110
       END;                                                             00008120
    /* ---------------------------------------------------------- */    00008130
    /* 1.24 TRE ÅRS FRYSPERIODE           9802              §     */    00008140
    /* ---------------------------------------------------------- */    00008150
                                                                        00008160
    IF   (VERIFY(U3S.FRYSP_3ÅR_ARB,'SX ') ^=0)    THEN                  00008170
       DO;                                                              00008180
          FEIL_FUNNET = '1'B;                                           00008190
          U3S.FRYSP_3ÅR_ARBNR = 429;                                    00008200
       END;                                                             00008210
    /* ---------------------------------------------------------- */    00008220
    /* 1.25 TIDSBEGRENSET FRYSPERIODE     9802              §     */    00008230
    /* ---------------------------------------------------------- */    00008240
                                                                        00008250
    IF   (VERIFY(U3S.FRYSP_TIDSB,'SX ') ^=0)    THEN                    00008260
       DO;                                                              00008270
          FEIL_FUNNET = '1'B;                                           00008280
          U3S.SKJERM_ATTFNR = 429;                                      00008290
       END;                                                             00008300
                                                                        00008310
    IF   U3S.FRYSP_3ÅR_ARB  = 'S'             &                         00008320
         U3S.FRYSP_TIDSB  = 'S'                        THEN             00008330
       DO;                                                              00008340
          FEIL_FUNNET = '1'B;                                           00008350
          U3S.FRYSP_TIDSBNR = 437;                                      00008360
       END;                                                             00008370
                                                                        00008380
    IF   U3S.FRYSP_3ÅR_ARB  = 'X'             &                         00008390
         U3S.FRYSP_TIDSB  = 'X'                        THEN             00008400
       DO;                                                              00008410
          FEIL_FUNNET = '1'B;                                           00008420
          U3S.FRYSP_TIDSBNR = 437;                                      00008430
       END;                                                             00008440
                                                                        00008450
    /* ---------------------------------------------------------- */    00008460
    /* 2.1 FØDSELSNUMMER EKTEFELLE/PARTNER/SAMBOER                */    00008470
    /* ---------------------------------------------------------- */    00008480
    IF F_FELT_PIC_CHAR11(U3S.FNR_EK) ^= (11)'0' THEN                    00008490
       DO;                                                              00008500
          IF ^F_NUMERISK(F_FELT_PIC_CHAR11(U3S.FNR_EK)) THEN            00008510
             DO;                                                        00008520
                FEIL_FUNNET  = '1'B;                                    00008530
                U3S.FNR_EKNR = 200;                                     00008540
             END;                                                       00008550
          ELSE                                                          00008560
          IF U3S.ATT_UF = 'X'          THEN/*DAGPENGER*/                00008570
             DO;                                                        00008580
                FEIL_FUNNET  = '1'B;                                    00008590
                U3S.FNR_EKNR = 491;                                     00008600
             END;                                                       00008610
          ELSE                                                          00008620
          IF ^F_GYLDIG_FNR(U3S.FNR_EK) THEN                             00008630
             DO;                                                        00008640
                FEIL_FUNNET  = '1'B;                                    00008650
                U3S.FNR_EKNR = 1;                                       00008660
             END;                                                       00008670
          ELSE                                                          00008680
             DO;                                                        00008690
                FNR_REG.FNR1 = U3S.FNR_EK;                              00008700
                EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);   00008710
                IF FNR_REG.FNR2 > 0 THEN                                00008720
                   DO;                                                  00008730
                      U3S.FNR_EKNR   = 203;                             00008740
                      U3S.FNR_GML_EK = U3S.FNR_EK;                      00008750
                      U3S.FNR_EK     = FNR_REG.FNR2;                    00008760
                   END;                                                 00008770
             END;                                                       00008780
       END; /* KONTROLL FELT 2.1 FNR EKTEFELLE */                       00008790
                                                                        00008800
    FØDSNUMMER    = U3S.FNR;                                            00008810
                                                                        00008820
    VIRKNINGSDATO = U3S.VIRK_DATO_MÅ;                                   00008830
                                                                        00008840
      IF HJ_VIRK_DATO_ÅM > 9801            THEN                         00008850
         DO;                                                            00008860
            IF VERIFY(U3S.EK_INNT_OVER_2G, 'JN ') ^= 0 THEN             00008870
               DO;                                                      00008880
                  FEIL_FUNNET        = '1'B;                            00008890
                  U3S.EK_INNT_OVER_2GNR = 1541;                         00008900
               END;                                                     00008910
            IF U3S.EK_INNT_OVER_2G  = ' ' THEN                          00008920
               DO;                                                      00008930
                  IF (U3S.SIVILSTAND = 'G' !                            00008940
                      U3S.SIVILSTAND = 'P' !                            00008950
                      U3S.SIVILSTAND = 'V' !                            00008960
                      U3S.SIVILSTAND = 'W'  )       THEN                00008970
                      DO;                                               00008980
                         FEIL_FUNNET        = '1'B;                     00008990
                         U3S.EK_INNT_OVER_2GNR = 272;                   00009000
                     END;                                               00009010
               END;                                                     00009020
            ELSE                                                        00009030
            IF ^(U3S.SIVILSTAND = 'G' !                                 00009040
                U3S.SIVILSTAND = 'P' !                                  00009050
                U3S.SIVILSTAND = 'V' !                                  00009060
                U3S.SIVILSTAND = 'W'  )       THEN                      00009070
                DO;                                                     00009080
                   FEIL_FUNNET        = '1'B;                           00009090
                   U3S.EK_INNT_OVER_2GNR = 1542;                        00009100
                END;                                                    00009110
         END;                                                           00009120
                                                                        00009130
    IF ^FEIL_FUNNET THEN                                                00009140
       DO;                                                              00009150
          HJ_UFT_MÅ       = U3S.UFT_MÅ;                                 00009160
          UFT_Å           = HJ_UFT_Å;                                   00009170
          UFT_M           = HJ_UFT_M;                                   00009180
          ALDER           = F_ALDER(U3S.FNR,U3S.UFT_MÅ);                00009190
                                                                        00009200
          IF  HJ_VIRK_DATO_ÅM > 9200 &                                  00009210
              HJ_UFT_ÅM       < 9200     THEN                           00009220
               DIV_PARAM_OMR.REGN_1291 = 'J';                           00009230
                                                                        00009240
          W_FNR_EK       = U3S.FNR_EK;                                  00009250
                                                                        00009260
          IF ALDER < 1600 THEN                                          00009270
             DO;                                                        00009280
                FEIL_FUNNET = '1'B;                                     00009290
                U3S.UFT_MÅNR = 196;                                     00009300
             END;                                                       00009310
          IF HJ_UFT_ÅM > DAGENS_DATO_ÅM     THEN                        00009320
             DO;                                                        00009330
                FEIL_FUNNET = '1'B;                                     00009340
                U3S.UFT_MÅNR = 206;                                     00009350
             END;                                                       00009360
          ELSE;                                                         00009370
          ALDER           = F_ALDER(U3S.FNR,U3S.VIRK_DATO_MÅ);          00009380
          IF F_KJØNN(U3S.FNR) = 'K' THEN                                00009390
             DO IÅR = 1 TO 2;                                           00009400
                IF U3S.VP_ÅR(IÅR) > 0 THEN                              00009410
                   DO;                                                  00009420
                      FEIL_FUNNET      = '1'B;                          00009430
                      U3S.VP_ÅRNR(IÅR) = 47;                            00009440
                      U3S.FNRNR        = 999;                           00009450
                   END;                                                 00009460
             END; /* DO IÅR = 1 TO 2 */                                 00009470
                                                                        00009480
          IF ^FEIL_FUNNET &                                             00009490
              U3S.VP_ÅR(1) > 0 &                                        00009500
              U3S.VP_ÅR(2) > 0 &                                        00009510
              U3S.VP_ÅR(1) = U3S.VP_ÅR(2) THEN                          00009520
             DO;                                                        00009530
                FEIL_FUNNET    = '1'B;                                  00009540
                U3S.VP_ÅRNR(1) = 124;                                   00009550
                U3S.VP_ÅRNR(2) = 999;                                   00009560
             END;                                                       00009570
                                                                        00009580
             /* ?? HVORFOR MH 9706 */                                   00009590
         IF U3S.YNGSTE_BARN_FÅR > 0   &                                 00009600
            UFT_Å               <  93 THEN                              00009610
           DO;                                                          00009620
               U3S.YNGSTE_BARN_FÅRNR = 473;  /* TS 0694*/               00009630
               FEIL_FUNNET = '1'B;           /*STM FLYTTET */           00009640
           END;                                                         00009650
                                                                        00009660
                                                                        00009670
         IF U3S.YNGSTE_BARN_FÅR > 0   &                                 00009680
            U3S.YNGSTE_BARN_FÅR < 86        THEN                        00009690
           DO;                                                          00009700
               U3S.YNGSTE_BARN_FÅRNR = 473;  /* HL 0796*/               00009710
               FEIL_FUNNET = '1'B;                                      00009720
           END;                                                         00009730
             /* ?? HVORFOR TIL HER MH9706 */                            00009740
                                                                        00009750
          IF HJ_UFT_ÅM > HJ_VIRK_DATO_ÅM THEN                           00009760
             DO;                                                        00009770
                FEIL_FUNNET        = '1'B;                              00009780
                U3S.UFT_MÅNR       = 41;                                00009790
                U3S.VIRK_DATO_MÅNR = 999;                               00009800
             END;                                                       00009810
          ELSE                                                          00009820
          IF ^ F_6MDR(HJ_VIRK_DATO_ÅM)          THEN                    00009830
             DO;                                                        00009840
                FEIL_FUNNET        = '1'B;                              00009850
                U3S.VIRK_DATO_MÅNR = 205;                               00009860
             END;                                                       00009870
                                                                        00009880
                                                                        00009890
          ELSE                                                          00009900
          IF ALDER < 1600 THEN                                          00009910
             DO;                                                        00009920
                FEIL_FUNNET        = '1'B;                              00009930
                U3S.FNRNR          = 50;                                00009940
                U3S.VIRK_DATO_MÅNR = 999;                               00009950
             END;                                                       00009960
          ELSE                                                          00009970
           IF ALDER > 6701 THEN                                         00009980
              DO;                                                       00009990
                 FEIL_FUNNET        = '1'B;                             00010000
                 U3S.FNRNR          = 52;                               00010010
                 U3S.VIRK_DATO_MÅNR = 999;                              00010020
              END;                                                      00010030
           ELSE                                                         00010040
           IF U3S.SIVILSTAND = 'P'   &                                  00010050
             (U3S.FNR_EK > 0 & F_KJØNN(U3S.FNR)                         00010060
                                 ^= F_KJØNN(U3S.FNR_EK)) THEN           00010070
              DO;                                                       00010080
                 FEIL_FUNNET  = '1'B;                                   00010090
                 U3S.FNRNR    = 392;                                    00010100
                 U3S.FNR_EKNR = 999;                                    00010110
              END;                                                      00010120
           ELSE                                                         00010130
           IF U3S.SIVILSTAND ^=  'P'   &                                00010140
             (U3S.FNR_EK > 0 & F_KJØNN(U3S.FNR)                         00010150
                                  = F_KJØNN(U3S.FNR_EK)) THEN           00010160
              DO;                                                       00010170
                 FEIL_FUNNET  = '1'B;                                   00010180
                 U3S.FNRNR    = 16;                                     00010190
                 U3S.FNR_EKNR = 999;                                    00010200
              END;                                                      00010210
            ELSE                                                        00010220
            IF ^(U3S.SIVILSTAND = 'G' ! U3S.SIVILSTAND = 'A' !          00010230
                 U3S.SIVILSTAND = 'V' !                                 00010240
                 U3S.SIVILSTAND = 'W' ! U3S.SIVILSTAND = 'P') &         00010250
            (U3S.FNR_EK > 0 ! U3S.NAVN_EK ^= (25)' ') THEN              00010260
               DO;                                                      00010270
                  FEIL_FUNNET = '1'B;                                   00010280
                  U3S.SIVILSTANDNR = 123;                               00010290
                  U3S.FNR_EKNR = 999;                                   00010300
                  U3S.NAVN_EKNR = 999;                                  00010310
               END;                                                     00010320
            ELSE                                                        00010330
            IF U3S.FNR_EK > 0 & U3S.NAVN_EK = (25)' ' THEN              00010340
               DO;                                                      00010350
                  FEIL_FUNNET = '1'B;                                   00010360
                  U3S.NAVN_EKNR = 118;                                  00010370
               END;                                                     00010380
            ELSE                                                        00010390
            IF U3S.TILL_EK = 'J' THEN                                   00010400
               DO;                                                      00010410
                  IF U3S.NAVN_EK = (25)' ' THEN                         00010420
                     DO;                                                00010430
                        FEIL_FUNNET = '1'B;                             00010440
                        U3S.NAVN_EKNR = 19;                             00010450
                        U3S.TILL_EKNR = 999;                            00010460
                     END;                                               00010470
                  ELSE                                                  00010480
                  IF U3S.FNR_EK = 0 THEN                                00010490
                     DO;                                                00010500
                        FEIL_FUNNET = '1'B;                             00010510
                        U3S.FNR_EKNR = 15;                              00010520
                        U3S.TILL_EKNR = 999;                            00010530
                     END;                                               00010540
                                                                        00010550
                                                                        00010560
                  ELSE                                                  00010570
                  IF   (VERIFY(U3S.SIVILSTAND,'AGPWV') ^= 0) THEN       00010580
     /*           IF ^(U3S.SIVILSTAND = 'G' ! U3S.SIVILSTAND = 'A' !    00010590
                       U3S.SIVILSTAND = 'W' ! U3S.SIVILSTAND = 'P') THEN00010600
                       */                                               00010610
                     DO;                                                00010620
                        FEIL_FUNNET = '1'B;                             00010630
                        U3S.SIVILSTANDNR = 54;                          00010640
                        U3S.TILL_EKNR = 999;                            00010650
                     END;                                               00010660
               END;                                                     00010670
            ELSE                                                        00010680
               IF (U3S.FNR_EK = 0 ! U3S.NAVN_EK = (25)' ') &            00010690
               (U3S.SIVILSTAND = 'G' ! U3S.SIVILSTAND = 'A' !           00010700
                U3S.SIVILSTAND = 'P' !                                  00010710
                U3S.SIVILSTAND = 'W' ! U3S.SIVILSTAND = 'V') THEN       00010720
                  DO;                                                   00010730
                     FEIL_FUNNET = '1'B;                                00010740
                     U3S.FNR_EKNR = 18;                                 00010750
                     U3S.NAVN_EKNR = 999;                               00010760
                     U3S.SIVILSTANDNR = 999;                            00010770
                  END;                                                  00010780
         END;                                                           00010790
   END KONTROLL_U3_SØKER;                                               00010800
 /* ================================================================= */00010810
   KONTROLL_U3_YP:                                                      00010820
   PROC(FEIL_FUNNET);                                                   00010830
      /* ------------------------------------------------------------ */00010840
      /* KONTROLL AV YRKESP  INFO                                     */00010850
      /* ------------------------------------------------------------ */00010860
     DCL FEIL_FUNNET   BIT(1);                                          00010870
     DCL VERIFY        BUILTIN;                                         00010880
                                                                        00010890
     IF (VERIFY(U3Y.VILKÅR_1_2_2A, 'J ') ^= 0 ) THEN                    00010900
        DO;                                                             00010910
           FEIL_FUNNET   ='1'B;                                         00010920
           U3Y.VILKÅR_1_2_2ANR = 301;                                   00010930
        END;                                                            00010940
                                                                        00010950
                                                                        00010960
     IF (VERIFY(U3Y.VILKÅR_1_2_2B, 'J ') ^= 0 ) THEN                    00010970
         DO;                                                            00010980
            FEIL_FUNNET   ='1'B;                                        00010990
            U3Y.VILKÅR_1_2_2BNR = 302;                                  00011000
         END;                                                           00011010
                                                                        00011020
     IF ^F_NUMERISK(F_FELT_PIC_CHAR4(U3Y.YST_MÅ)) THEN                  00011030
        DO;                                                             00011040
           FEIL_FUNNET    = '1'B;                                       00011050
           U3Y.YST_MÅNR = 200;                                          00011060
        END;                                                            00011070
     ELSE                                                               00011080
        DO;                                                             00011090
           IF ^F_GYLDIG_DATO(U3Y.YST_MÅ) THEN                           00011100
              DO;                                                       00011110
                 FEIL_FUNNET    = '1'B;                                 00011120
                 U3Y.YST_MÅNR = 304;                                    00011130
              END;                                                      00011140
           ELSE                                                         00011150
           IF F_SNU_DATO(U3Y.YST_MÅ) < 7101 THEN                        00011160
              DO;                                                       00011170
                 FEIL_FUNNET    = '1'B;                                 00011180
                 U3Y.YST_MÅNR = 305;                                    00011190
              END;                                                      00011200
       END;                                                             00011210
                                                                        00011220
       IF (VERIFY(U3Y.YSYKDOM, 'JN') ^= 0 ) THEN                        00011230
           DO;                                                          00011240
              FEIL_FUNNET   ='1'B;                                      00011250
              U3Y.YSYKDOMNR = 306;                                      00011260
           END;                                                         00011270
                                                                        00011280
                                                                        00011290
       IF ^F_NUMERISK(F_FELT_PIC_CHAR3(U3Y.YUG)) THEN                   00011300
          DO;                                                           00011310
             FEIL_FUNNET = '1'B;                                        00011320
             U3Y.YUGNR = 200;                                           00011330
          END;                                                          00011340
       ELSE                                                             00011350
                                                                        00011360
                                                                        00011370
       IF U3Y.YUG < 15 ! U3Y.YUG > 100 THEN                             00011380
          DO;                                                           00011390
             FEIL_FUNNET = '1'B;                                        00011400
             U3Y.YUGNR = 307;                                           00011410
          END;                                                          00011420
                                                                        00011430
                                                                        00011440
                                                                        00011450
    IF  U3Y.KAP_11_7_UTLØST = 'J'          THEN                         00011460
               DIV_PARAM_OMR.REGN_1291 = ' ';                           00011470
    ELSE                                                                00011480
    IF ^(U3Y.KAP_11_7_UTLØST = ' ') THEN                                00011490
        DO;                                                             00011500
           FEIL_FUNNET   ='1'B;                                         00011510
           U3Y.KAP_11_7_UTLØSTNR = 308;                                 00011520
        END;                                                            00011530
                                                                        00011540
    IF VERIFY(U3Y.YRKE11,'FMUEVSA') ^= 0 THEN                           00011550
       DO;                                                              00011560
          FEIL_FUNNET = '1'B;                                           00011570
          U3Y.YRKE11NR =  309 ;                                         00011580
       END;                                                             00011590
                                                                        00011600
    IF ^F_NUMERISK(F_FELT_PIC_CHAR7(U3Y.AÅI)) THEN                      00011610
       DO;                                                              00011620
          FEIL_FUNNET = '1'B;                                           00011630
          U3Y.AÅINR = 200 ;                                             00011640
       END;                                                             00011650
                                                                        00011660
    IF F_FELT_PIC_CHAR11(U3Y.FNR_EK) ^= (11) '0' THEN                   00011670
       DO;                                                              00011680
          FEIL_FUNNET         = '1'B;                                   00011690
          U3Y.FNR_EKNR        = 315 ;                                   00011700
       END;                                                             00011710
                                                                        00011720
    IF F_FELT_PIC_CHAR11(U3Y.FNR_SAMBOER) ^= (11) '0' THEN              00011730
       DO;                                                              00011740
          FEIL_FUNNET         = '1'B;                                   00011750
          U3Y.FNR_SAMBOERNR   = 315 ;                                   00011760
       END;                                                             00011770
                                                                        00011780
    IF F_FELT_PIC_CHAR11(U3Y.FNR_Y_BARN) ^= (11) '0' THEN               00011790
       DO;                                                              00011800
          FEIL_FUNNET         = '1'B;                                   00011810
          U3Y.FNR_Y_BARNNR    =  315 ;                                  00011820
       END;                                                             00011830
                                                                        00011840
    IF U3Y.PLEIEBARN ^= ' '  THEN                                       00011850
       DO;                                                              00011860
          FEIL_FUNNET         = '1'B;                                   00011870
          U3Y.PLEIEBARNNR     = 315 ;                                   00011880
       END;                                                             00011890
                                                                        00011900
    IF ^FEIL_FUNNET THEN                                                00011910
       DO;                                                              00011920
                                                                        00011930
          IF   F_SNU_DATO(U3Y.YST_MÅ) > F_SNU_DATO(U3S.VIRK_DATO_MÅ) !  00011940
               F_SNU_DATO(U3Y.YST_MÅ) > F_SNU_DATO(U3S.UFT_MÅ) THEN     00011950
             DO;                                                        00011960
                                                                        00011970
                                                                        00011980
                  FEIL_FUNNET    = '1'B;                                00011990
                  U3Y.YST_MÅNR   =  312 ;                               00012000
              END;                                                      00012010
                                                                        00012020
                                                                        00012030
          IF U3Y.KAP_11_7_UTLØST = 'J' &                                00012040
             U3Y.YUG > 29              THEN                             00012050
             DO;                                                        00012060
                                                                        00012070
                                                                        00012080
                 FEIL_FUNNET            = '1'B;                         00012090
                 U3Y.KAP_11_7_UTLØSTNR  =  313 ;                        00012100
                 U3Y.YUGNR              =  999 ;                        00012110
              END;                                                      00012120
                                                                        00012130
          IF U3Y.KAP_11_7_UTLØST = 'J' &                                00012140
             U3S.ATT_UF          = 'X' THEN                             00012150
             DO;                                                        00012160
                                                                        00012170
                 FEIL_FUNNET            = '1'B;                         00012180
                 U3Y.KAP_11_7_UTLØSTNR  =  398 ;                        00012190
                 U3S.ATT_UFNR           =  999 ;                        00012200
              END;                                                      00012210
                                                                        00012220
           IF U3Y.KAP_11_7_UTLØST = 'J' &                               00012230
              U3S.UFG > 29              THEN                            00012240
              DO;                                                       00012250
                                                                        00012260
                                                                        00012270
                 FEIL_FUNNET            = '1'B;                         00012280
                 U3Y.KAP_11_7_UTLØSTNR  =  313 ;                        00012290
                 U3Y.YUGNR              =  999 ;                        00012300
              END;                                                      00012310
                                                                        00012320
                                                                        00012330
                                                                        00012340
         /*IF U3Y.KAP_11_7_UTLØST = 'J'  THEN                           00012350
              DO;                                                       00012360
                                                                        00012370
                                                                        00012380
                 FEIL_FUNNET            = '1'B;                         00012390
                 U3Y.KAP_11_7_UTLØSTNR  =  329 ;                        00012400
                 U3Y.YUGNR              =  999 ;                        00012410
              END;  *****12.08.94 HL **************    */               00012420
                                                                        00012430
           IF U3Y.YRKE11    = 'F' &                                     00012440
              U3Y.AÅI      ^= 9999999 THEN                              00012450
              DO;                                                       00012460
                                                                        00012470
                                                                        00012480
                  FEIL_FUNNET     = '1'B;                               00012490
                  U3Y.AÅINR       =  314;                               00012500
                  U3Y.YRKE11NR    =  999;                               00012510
               END;                                                     00012520
            ELSE                                                        00012530
            IF U3Y.YRKE11    = 'A' &                                    00012540
               U3Y.AÅI       = 9999999 THEN                             00012550
               DO;                                                      00012560
                                                                        00012570
                                                                        00012580
                  FEIL_FUNNET     = '1'B;                               00012590
                  U3Y.AÅINR       =  316;                               00012600
                  U3Y.YRKE11NR    =  999;                               00012610
               END;                                                     00012620
                                                                        00012630
           IF   VERIFY(U3Y.YRKE11,'EMSUV') = 0 &                        00012640
        /*  IF (U3Y.YRKE11    = 'E' !                                   00012650
                U3Y.YRKE11    = 'U' !                                   00012660
                U3Y.YRKE11    = 'V' !                                   00012670
                U3Y.YRKE11    = 'M' !                                   00012680
                U3Y.YRKE11    = 'S'   ) & */                            00012690
                U3Y.AÅI       = 9999999 THEN                            00012700
                                                                        00012710
                                                                        00012720
                U3Y.AÅI       = 0;                                      00012730
                                                                        00012740
            IF U3S.YSKADE_TILLEGG = 'J' THEN                            00012750
               DO;                                                      00012760
                  IF U3S.UFG      = 0 THEN                              00012770
                     U3S.UFG      = U3Y.YUG;                            00012780
               END;                                                     00012790
                                                                        00012800
             IF  U3S.UFG           <  U3Y.YUG   THEN                    00012810
                DO;                                                     00012820
                /* -------------------------------------------------- */00012830
                /* BLANKETTEN SKAL AVVISES DERSOM UFG < YUG.          */00012840
                /*                                          TS 290894 */00012850
                /* -------------------------------------------------- */00012860
                   FEIL_FUNNET        = '1'B;                           00012870
                   U3Y.YUGNR          = 317 ;                           00012880
                 END;                                                   00012890
                                                                        00012900
            IF ^(U3Y.VILKÅR_1_2_2A   = ' '  !                           00012910
                 U3Y.VILKÅR_1_2_2B   = ' '  )  &                        00012920
                 U3S.NORSK_BOSATT = 'J'  THEN                           00012930
               DO;                                                      00012940
                                                                        00012950
                                                                        00012960
                  FEIL_FUNNET        = '1'B;                            00012970
                  U3Y.VILKÅR_1_2_2ANR  = 318 ;                          00012980
                  U3Y.VILKÅR_1_2_2BNR  = 999 ;                          00012990
               END;                                                     00013000
                                                                        00013010
                                                                        00013020
            ELSE                                                        00013030
            IF ^(U3Y.VILKÅR_1_2_2A  = ' '  !                            00013040
                U3Y.VILKÅR_1_2_2B  = ' ' ) &                            00013050
                (U3Y.YUG    ^= U3S.UFG)   THEN                          00013060
                DO;                                                     00013070
                                                                        00013080
                                                                        00013090
                     FEIL_FUNNET          = '1'B;                       00013100
                     U3Y.YUGNR            = 324 ;                       00013110
                     U3Y.VILKÅR_1_2_2ANR  = 999 ;                       00013120
                     U3Y.VILKÅR_1_2_2BNR  = 999 ;                       00013130
                  END;                                                  00013140
         END;                                                           00013150
                                                                        00013160
    END KONTROLL_U3_YP;                                                 00013170
