 /*       SIST ENDRET 24/04-97 08.57.07 AV   JDA7339                  */00000000
 /*       SIST ENDRET 25/02-94 12.51.19 AV   HERMAN                   */00000010
 /*       SIST ENDRET 13/11-91 13.46.35 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 26/04-91 13.11.38 AV   DYBVIK                   */00000030
 R00104:                                                                00000040
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000050
 %SKIP;                                /*  */                           00000060
 /****************PROGRAM ER DEL AV R0010401************************* */00000070
 /*IDENTIFIKASJON:                                                    */00000080
 /************************                                            */00000090
 /*  PROGRAM-IDENT : R001B401-REGISTRERING NYE BLANKETTER-HOVEDPROGR. */00000100
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000110
 /*  PROGRAMMERER  : ?                                                */00000120
 /*  PROGRAMMET BLE DELET AV  : PATHAK                                */00000130
 /*  ENDRINGERSDATO :                                                 */00000140
 /*  ENDRINGEN GJELDER:                                               */00000150
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000160
 /*                                                                   */00000170
 /******************************************************************* */00000180
 /*HENSIKT:*/                                                           00000190
 /************                                                        */00000200
 /*  PROGRAMMET ER DEL AV R0010401                                    */00000210
 /*  PROGRAMMET LESER INN STYRINGSKODEN, KONTROLLERER DEN             */00000220
 /*  OG SENDER UT DET FØRSTE BILDET AV DEN BLANKETTEN SOM SKAL        */00000230
 /*  REGISTRERES:                                                     */00000240
 /*    A1 ---> MAP S001N51 MAPSET S001N53 - GRBL. ALDERSPENSJON       */00000250
 /*    U2 ---> MAP S001N61 MAPSET S001N63 - GRBL. UFØREPENSJON        */00000260
 /*    E3 ---> MAP S001N81 MAPSET S001N83 - GRBL. ETTERL. EF.   NY    */00000270
 /*    E4 ---> MAP S001N91 MAPSET S001N93 - GRBL. ETTERL.FAM.PLEIER NY*/00000280
 /*    F5 ---> MAP S001NA1 MAPSET S001NA3 - GRBL. FORELDREL. BARN-NY  */00000290
 /*    B6 ---> MAP S001NB1 MAPSET S001NB3 - GRBL. ETTERLATTE BARN-NY  */00000300
 /*                                                                   */00000310
 /******************************************************************* */00000320
 /*PROGRAMTILKNYTTING:*/                                                00000330
 /**********************                                              */00000340
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSID = R040 OG R041.  */00000350
 /*  R040: KONTROLLEN KOMMER FRA R0010301                             */00000360
 /*  R041: KONTROLLEN KOMMER FRA                                      */00000370
 /*  PROGRAMMET GÅR VIA CICS TIL FORSKJELLIGE PROGRAMMER AVHENGIG     */00000380
 /*  HVILKEN STYRINGSKODE SOM BLIR SATT AV OPERATØREN ELLER           */00000390
 /*  ETTER BLANKETTKONTROLLEN TRANSKODE SATT AV PROGRAMMENE:          */00000400
 /*  A1 - ALDERSPENSJON    - RN50 - R001N501                          */00000410
 /*  U2 - UFØREPENSJON     - RN60 - R001N601                          */00000420
 /*  E3 - ETTERLATT EK     - RN80 - R001N801                          */00000430
 /*  E4 - ETTERLATT FP     - RN90 - R001N901                          */00000440
 /*  F5 - FORELDRELØSE BARN- RNA0 - R001NA01                          */00000450
 /*  B6 - ETTERLATTE  BARN - RNB0 - R001NB01                          */00000460
 /*                                                                   */00000470
 /******************************************************************* */00000480
 /*DATASETTOPPLYSNINGER:                                              */00000490
 /*************************                                           */00000500
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000510
 /*                                                                   */00000520
 /******************************************************************* */00000530
 /*FEILMELDINGER:*/                                                     00000540
 /*********************                                               */00000550
 /* 'UGYLDIG STYREKODE' BLIR SKREVET PÅ SKJERMBILDET NÅR STYRINGSKODE */00000560
 /*  IKKE HAR GYLDIG VERDI                                            */00000570
 /*                                                                   */00000580
 /* ***************************************************************** */00000590
      %INCLUDE S00101;     /*  MENY            */                       00000600
 %PAGE;                                                                 00000610
      %INCLUDE S001N5;     /*  ALDER MAPSETTET */                       00000620
 %PAGE;                                                                 00000630
      %INCLUDE S001N6;     /*  UFØRE MAPSETTET */                       00000640
 %PAGE;                                                                 00000650
      %INCLUDE S001N8;     /*  ETTERLATT EKTEFELLE MAPSETTET  */        00000660
 %PAGE;                                                                 00000670
      %INCLUDE S001N9;     /*  ETTERLATT FAMILIEPLEIER MAPSETTET   */   00000680
 %PAGE;                                                                 00000690
   /* %INCLUDE S001NA;         FORELDRELØSE BARN MAPSETTET    */        00000700
 %PAGE;                                                                 00000710
      %INCLUDE S001NB;     /*  ETTERLATTE BARN MAPSETTET      */        00000720
      %INCLUDE S001NC;     /*                                 */        00000730
 %PAGE;                                                                 00000740
 %PAGE;                                                                 00000750
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */            00000760
 %PAGE;                                                                 00000770
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                    00000780
 %PAGE;                                                                 00000790
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */               00000800
 %PAGE;                                                                 00000810
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */              00000820
 %PAGE;                                                                 00000830
      %INCLUDE P0019959;   /*  OMRAADE FOR FUNKTAB      */              00000840
 %PAGE;                                                                 00000850
      %INCLUDE DFHBMSCA;   /*  MAP HJELPEFELT           */              00000860
 %PAGE;                                                                 00000870
   DCL                                                                  00000880
      (COMMAREA_PEKER,IDENT_PEKER,                                      00000890
      BMSMAPBR)      PTR;                                               00000900
   DCL                                                                  00000910
      IDENT_BIT BIT(32) BASED (IDENT_PEKER);                            00000920
   DCL   W_TERMINAL   CHAR (4);                                         00000930
   DCL                                                                  00000940
      (DATE,NULL,CSTG,ADDR,SUBSTR,STG) BUILTIN;                         00000950
   DCL DATO     PIC '(6)9' INIT (0);                                    00000960
   DCL                                                                  00000970
      HJ2_DATO_ÅMD   PIC '(6)9',                                        00000980
                                                                        00000990
      HJ2_ÅR DEF HJ2_DATO_ÅMD  POS (1) PIC '(2)9',                      00001000
                                                                        00001010
      HJ1_DATO_MÅ    PIC '(6)9',                                        00001020
                                                                        00001030
      HJ1_ÅR DEF HJ1_DATO_MÅ   POS (3) PIC '(2)9';                      00001040
      DATO = DATE;                                                      00001050
      W_TERMINAL =  EIBTRMID;                                           00001060
      SELECT(STYREKODE);                                                00001070
         WHEN('A1')                                                     00001080
            DO;                                                         00001090
               TRANSKODE = 'RN50';                                      00001100
               ALLOCATE S001N51O ;                                      00001110
               S001N51O.REGDATOO   = DATO;                              00001120
               S001N51O.TERMIDO    = W_TERMINAL;                        00001130
               S001N51O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00001140
                                                                        00001150
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00001160
               /* ALDERSPENSJON                                */       00001170
               EXEC CICS SEND MAP('S001N51') MAPSET('S001N53')          00001180
                                             ERASE;                     00001190
            END;                                                        00001200
         WHEN('U2')                                                     00001210
            DO;                                                         00001220
               TRANSKODE = 'RN60';                                      00001230
               ALLOCATE S001N61O ;                                      00001240
               S001N61O.REGDATOO   = DATO;                              00001250
               S001N61O.TERMIDO    = W_TERMINAL;                        00001260
               S001N61O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00001270
                                                                        00001280
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00001290
               /* UFØREPENSJON                                 */       00001300
               EXEC CICS SEND MAP('S001N61') MAPSET('S001N63')          00001310
                                             ERASE;                     00001320
            END;                                                        00001330
         WHEN('E3')                                                     00001340
            DO;                                                         00001350
               TRANSKODE = 'RN80';                                      00001360
               ALLOCATE S001N81O ;                                      00001370
               S001N81O.REGDATOO   = DATO;                              00001380
               S001N81O.TERMIDO    = W_TERMINAL;                        00001390
               S001N81O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00001400
                                                                        00001410
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00001420
               /* ETTERLATT EKTEFELLE                                */ 00001430
               EXEC CICS SEND MAP('S001N81') MAPSET('S001N83')          00001440
                                             ERASE ;                    00001450
            END;                                                        00001460
         WHEN('E4')                                                     00001470
            DO;                                                         00001480
               TRANSKODE = 'RN90';                                      00001490
               ALLOCATE S001N91O ;                                      00001500
               S001N91O.REGDATOO   = DATO;                              00001510
               S001N91O.TERMIDO    = W_TERMINAL;                        00001520
               S001N91O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00001530
                                                                        00001540
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00001550
               /* ETTERLATT FAMILIEPLEIER                            */ 00001560
               EXEC CICS SEND MAP('S001N91') MAPSET('S001N93')          00001570
                                             ERASE ;                    00001580
            END;                                                        00001590
   /*    WHEN('F5')                                                     00001600
            DO;                                                         00001610
               TRANSKODE = 'RNA0';                                      00001620
               ALLOCATE S001NA1O ;                                      00001630
               S001NA1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00001640
                                                                        00001650
                                                                        00001660
                                                                        00001670
               EXEC CICS SEND MAP('S001NA1') MAPSET('S001NA3')          00001680
                                             ERASE ;                    00001690
            END;                                         */             00001700
         WHEN('B6')                                                     00001710
            DO;                                                         00001720
               TRANSKODE = 'RNB0';                                      00001730
               ALLOCATE S001NB1O ;                                      00001740
               S001NB1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00001750
               S001NB1O.REGDATOO   = DATO;                              00001760
               S001NB1O.TERMIDO    = W_TERMINAL;                        00001770
                                                                        00001780
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00001790
               /* ETTERLATTE BARN, EN AV FORELDRENE ER DØDE          */ 00001800
               EXEC CICS SEND MAP('S001NB1') MAPSET('S001NB3')          00001810
                                             ERASE ;                    00001820
            END;                                                        00001830
         WHEN('F7')                                                     00001840
            DO;                                                         00001850
               TRANSKODE = 'RNC0';                                      00001860
               ALLOCATE S001NC1O ;                                      00001870
               S001NC1O.REGDATOO   = DATO;                              00001880
               S001NC1O.TERMIDO    = W_TERMINAL;                        00001890
               S001NC1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00001900
                                                                        00001910
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00001920
               /* ETTERLATTE BARN, EN AV FORELDRENE ER DØDE          */ 00001930
               EXEC CICS SEND MAP('S001NC1') MAPSET('S001NC3')          00001940
                                             ERASE ;                    00001950
            END;                                                        00001960
         OTHERWISE                                                      00001970
            DO;                                                         00001980
               TRANSKODE = 'R040';                                      00001990
               RETURN                  ;                                00002000
            END;                                                        00002010
      END;                                                              00002020
                                                                        00002030
      EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);            00002040
                                                                        00002050
                                                                        00002060
 END R00104;                                                            00002070
