 /*       SIST ENDRET 06/01-93 12.30.16 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 10/10-91 13.57.58 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 16/05-88 12.28.51 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 04/11-83 09.16.14 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 19/08-82 14.37.42 AV   FARVIK                   */00000040
 /*       SIST ENDRET 19/08-82 08.22.54 AV   FARVIK                   */00000050
 /* ***************************************************************** */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /*    R0011503 - PROSEDYRE I PLI                                     */00000080
 /*    PROGRAMMERER: JAN, SEPTEMBER 1981.                             */00000090
 /*HENSIKT:                                                           */00000100
 /*    PROSEDYREN FORETAR KONTROLL AV DATA FOR E2_SØKER               */00000110
 /*       FRA ENDRINGSBLANKETT TRYGDEKONTORNUMMER.                    */00000120
 /*PROGRAMTILKNYTNING:                                                */00000130
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLING AV ENDRING I TKNR.  */00000140
 /*    INCLUDES I  R0011501.                                          */00000150
 /*BRUK:                                                              */00000160
 /* CALL KONRTOLL_E2_SØKER(FEIL_I_E2_SØKER);                          */00000170
 /*                                                                   */00000180
 /* ***************************************************************** */00000190
 /*                                                                   */00000200
 /*ENDRET: 14.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000210
 /* ******                                                            */00000220
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000230
 /*    OM FNR ER ENDRET (R0019906).                                   */00000240
 /* ***************************************************************** */00000250
 /*                                                                   */00000260
 /*   MODULEN KONTROLLERER E2_SØKER, OG RETURNERER                    */00000270
 /*   MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG              */00000280
 /*                                                                   */00000290
 /* ***************************************************************** */00000300
 %SKIP(2);                                                              00000310
 KONTROLL_E2_SØKER:                                                     00000320
   PROC (FEIL_FUNNET) ;                                                 00000330
   DCL                                                                  00000340
      FEIL_FUNNET BIT (1);                                              00000350
   DCL                                                                  00000360
      KEY_BIT1                   BIT(32) BASED (KEY_PEKER1),            00000370
      KEY_PEKER1                 POINTER,                               00000380
      KEY_BIT2                   BIT(32) BASED (KEY_PEKER2),            00000390
      KEY_PEKER2                 POINTER,                               00000400
      TK_RECL                    CHAR (101);                            00000410
 %PAGE;                                /*   */                          00000420
 %SKIP;                                                                 00000430
   DCL                                                                  00000440
      1 FNR_REG,                                                        00000450
        2 FNR1         FIXED DEC(11),                                   00000460
        2 FNR2         FIXED DEC(11),                                   00000470
        2 BRUKERID     CHAR     ( 4);                                   00000480
                                                                        00000490
                                                                        00000500
                                                                        00000510
      FNR_REG.BRUKERID =  DIV_PARAM_OMR.CICS_IND;                       00000520
      KEY_PEKER1       =  ADDR(E2S.TKNR_FRA);                           00000530
      KEY_PEKER2       =  ADDR(E2S.TKNR_TIL);                           00000540
      FEIL_FUNNET      = '0'B;                                          00000550
      ANT_FEIL_SKREVET =  0;                                            00000560
                                                                        00000570
      IF ^F_NUMERISK(F_FELT_PIC_CHAR11(E2S.FNR)) THEN                   00000580
         DO;                                                            00000590
            FEIL_FUNNET = '1'B;                                         00000600
            E2S.FNRNR = 200;                                            00000610
         END;                                                           00000620
      ELSE                                                              00000630
      IF ^F_GYLDIG_FNR(E2S.FNR) THEN                                    00000640
         DO;                                                            00000650
            FEIL_FUNNET = '1'B;                                         00000660
            E2S.FNRNR = 1;                                              00000670
         END;                                                           00000680
      ELSE                                                              00000690
      DO;                                                               00000700
         FNR_REG.FNR1 = E2S.FNR;                                        00000710
         EXEC CICS LINK PROGRAM ('R0019906') COMMAREA (FNR_REG);        00000720
         IF FNR_REG.FNR2 > 0 THEN                                       00000730
            DO;                                                         00000740
              E2S.FNRNR = 203;                                          00000750
              E2S.FNR_GML = E2S.FNR;                                    00000760
              E2S.FNR = FNR_REG.FNR2;                                   00000770
            END;                                                        00000780
      END;                                                              00000790
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(E2S.TKNR_FRA)) THEN              00000800
         DO;                                                            00000810
            FEIL_FUNNET = '1'B;                                         00000820
            E2S.TKNR_FRANR = 200;                                       00000830
         END;                                                           00000840
      ELSE                                                              00000850
         DO;                                                            00000860
                EXEC CICS HANDLE CONDITION NOTFND(NOTFND1);             00000870
                EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT1)     00000880
                                                   INTO(TK_RECL);       00000890
                GOTO TKNR_FRAUT;                                        00000900
            NOTFND1:                                                    00000910
                FEIL_FUNNET    = '1'B;                                  00000920
                E2S.TKNR_FRANR  = 3;                                    00000930
                LEAVE;                                                  00000940
            TKNR_FRAUT:                                                 00000950
               DIV_PARAM_OMR.DIV_TKNR = SUBSTR(TK_RECL,1,4);            00000960
         END;                                                           00000970
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(E2S.TKNR_TIL)) THEN              00000980
         DO;                                                            00000990
            FEIL_FUNNET = '1'B;                                         00001000
            E2S.TKNR_TILNR = 200;                                       00001010
         END;                                                           00001020
      ELSE                                                              00001030
         DO;                                                            00001040
                EXEC CICS HANDLE CONDITION NOTFND(NOTFND2);             00001050
                EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT2)     00001060
                                                   INTO(TK_RECL);       00001070
                GOTO TKNR_TILUT;                                        00001080
            NOTFND2:                                                    00001090
                FEIL_FUNNET    = '1'B;                                  00001100
                E2S.TKNR_TILNR  = 3;                                    00001110
                LEAVE;                                                  00001120
            TKNR_TILUT:                                                 00001130
         END;                                                           00001140
 %SKIP(3);                             /*  */                           00001150
      FØDSNUMMER    = E2S.FNR;                                          00001160
      VIRKNINGSDATO = E2S.VIRK_DATO_MÅ;                                 00001170
 /*   KRYSS KONTROLLER       */                                         00001180
 %SKIP;                                                                 00001190
      IF ^FEIL_FUNNET THEN                                              00001200
         DO;                                                            00001210
            IF E2S.TKNR_TIL = E2S.TKNR_FRA THEN                         00001220
               DO;                                                      00001230
                  FEIL_FUNNET = '1'B;                                   00001240
                  E2S.TKNR_TILNR = 159;                                 00001250
                  E2S.TKNR_FRANR = 999;                                 00001260
               END;                                                     00001270
         END;                                                           00001280
   END KONTROLL_E2_SØKER;                                               00001290
