 /*       SIST ENDRET 12/05-87 09.12.56 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 05/10-84 14.16.17 AV   FARVIK                   */00000010
 /*       SIST ENDRET 17/09-84 08.56.36 AV   FARVIK                   */00000020
 /*       SIST ENDRET 11/09-84 14.55.15 AV   FARVIK                   */00000030
 /*       SIST ENDRET 30/08-84 11.52.57 AV   FARVIK                   */00000040
 R00109:                                                                00000050
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000060
 %PAGE;                                                                 00000070
 %INCLUDE S00109;    /*  ETTERLATT FAMILIEPLEIER-MAPSETTET   */         00000080
 %PAGE;                                                                 00000090
 %INCLUDE P0010901;  /*  TRANS_OMR FOR ETTERLATT FAMILIEPLEIER  */      00000100
 %PAGE;                                                                 00000110
 %INCLUDE P0019906;  /*  TRANS-OPPL-OMRÅDET (BASED)   */                00000120
 %PAGE;                                                                 00000130
 %INCLUDE P0019908;  /*  KOM-OMRÅDET (BASED)          */                00000140
 %PAGE;                                                                 00000150
 %INCLUDE P0019910;  /*  STYRINGS-OMRÅDET (BASED)     */                00000160
 %PAGE;                                                                 00000170
 %INCLUDE P0019912;  /*  DIV_PARAM_OMRÅDET (BASED)          */          00000180
 %PAGE;                                                                 00000190
 %INCLUDE DFHBMSCA;                                                     00000200
 %PAGE;                                                                 00000210
   DCL                                                                  00000220
      (BMSMAPBR,COMMAREA_PEKER)        PTR;                             00000230
   DCL                                                                  00000240
      (ADDR,UNSPEC,CSTG,ONCODE,VERIFY,SUBSTR) BUILTIN;                  00000250
   DCL                                                                  00000260
      FEIL_FUNNET                      BIT (1),                         00000270
      ONKODE                           PIC'9999',                       00000280
      CURSOR_POS                       FIXED BIN(15) INIT(-1),          00000290
      ONK DEF ONKODE                   CHAR(4),                         00000300
      FEILKODE                         CHAR(4),                         00000310
      DSNAVN                           CHAR(8),                         00000320
      ANT_FEIL_SKREVET                 FIXED DEC (3);                   00000330
 %SKIP(1);                                                              00000340
 %PAGE;                                                                 00000350
      ON ERROR SNAP BEGIN       ;                                       00000360
         ON ERROR SYSTEM        ;                                       00000370
         ONKODE=ONCODE          ;                                       00000380
         FEILKODE = ONK         ;                                       00000390
         DSNAVN     = EIBDS     ;                                       00000400
         GO TO FEILBEH          ;                                       00000410
      END;                                                              00000420
                                                                        00000430
 FEILKODE   = 'FEIL';                                                   00000440
 DSNAVN     = '      ';                                                 00000450
                                                                        00000460
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00000470
                                                                        00000480
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00000490
                                                                        00000500
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000510
                                                                        00000520
 IF FRA_CICS THEN                                                       00000530
  DO;                                                                   00000540
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);00000550
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);     00000560
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);  00000570
  END;                                                                  00000580
                                                                        00000590
 IF HENT_FRAM_MAP  THEN                                                 00000600
   DO;                                                                  00000610
      EXEC CICS SEND MAP('S001091') MAPSET('S001093') MAPONLY           00000620
      SET (BMSMAPBR);                                                   00000630
      ALLOCATE S001091O;                                                00000640
   END;                                                                 00000650
                                                                        00000660
 RECEIVE_MAP:                                                           00000670
                                                                        00000680
 IF ^HENT_FRAM_MAP THEN                                                 00000690
    DO;                                                                 00000700
       EXEC CICS RECEIVE MAP('S001091')                                 00000710
                                    MAPSET('S001093') SET(BMSMAPBR);    00000720
       CALL BLANK_EF_MELDNR;                                            00000730
       FEIL_MELD_NR = 0;                                                00000740
    END;                                                                00000750
                                                                        00000760
 IF FUNKSJONSKODEL > 0 THEN                                             00000770
    DO;                                                                 00000780
       FUNKSJONSKODE = FUNKSJONSKODEI;                                  00000790
       EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);            00000800
    END;                                                                00000810
                                                                        00000820
 IF STYRE_KODEL > 0 THEN                                                00000830
    DO;                                                                 00000840
       STYREKODE = STYRE_KODEI;                                         00000850
       TRANSKODE = 'R041';                                              00000860
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00000870
    END;                                                                00000880
                                                                        00000890
                                                                        00000900
 IF STYREKODE ^= 'EF'  &  FRA_CICS THEN                                 00000910
    TRANSKODE  = 'R041';                                                00000920
 ELSE                                                                   00000930
    DO;                                                                 00000940
       TRANS_RETURKODE = TRANSKODE;                                     00000950
                                                                        00000960
       SELECT (TRANSKODE);                                              00000970
          WHEN('R090')                                                  00000980
             DO;                                                        00000990
                CALL BLANK_EF_SØKER;                                    00001000
                CALL BLANK_EF_SPES;                                     00001010
                CALL BLANK_EF_MELDNR;                                   00001020
                CALL OVERFØR_EF_SØKER;                                  00001030
                CALL KONTROLL_EF_SØKER(FEIL_FUNNET);                    00001040
             END;                                                       00001050
          WHEN('R091')                                                  00001060
             DO;                                                        00001070
                CALL BLANK_EF_MELDNR;                                   00001080
                IF FUNKSJONSKODE ^= 'V' THEN                            00001090
                   CALL BLANK_EF_SPES;                                  00001100
                CALL OVERFØR_EF_SØKER;                                  00001110
                CALL KONTROLL_EF_SØKER(FEIL_FUNNET);                    00001120
             END;                                                       00001130
          WHEN('R092')                                                  00001140
             DO;                                                        00001150
                CALL BLANK_EF_MELDNR;                                   00001160
                CALL OVERFØR_EF_SØKER;                                  00001170
                CALL OVERFØR_EF_SPES;                                   00001180
                CALL KONTROLL_EF_SØKER(FEIL_FUNNET);                    00001190
                IF EFS.NORSK_BOSATT = 'J' THEN                          00001200
                   CALL BLANK_EF_SPES;                                  00001210
                ELSE                                                    00001220
                   CALL KONTROLL_EF_SPES(FEIL_FUNNET);                  00001230
             END;                                                       00001240
         OTHERWISE;                                                     00001250
                                                                        00001260
       /* INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER */00001270
                                                                        00001280
   END;  /* SELECT  */                                                  00001290
                                                                        00001300
    IF EFS.NORSK_BOSATT = 'N' & ^FEIL_FUNNET THEN                       00001310
       TRANSKODE        = 'R092';                                       00001320
                                                                        00001330
    IF TRANSKODE = 'R092' & EFS.NORSK_BOSATT = 'J' THEN                 00001340
       TRANSKODE = 'R091';                                              00001350
                                                                        00001360
                                                                        00001370
 IF FEIL_FUNNET ! HENT_FRAM_MAP ! FRA_UTEN_DIALOG !                     00001380
    TRANS_RETURKODE ^= TRANSKODE THEN                                   00001390
    DO;                                                                 00001400
       IF TRANSKODE = 'R090' THEN                                       00001410
          TRANSKODE = 'R091';                                           00001420
       CALL BLANK_EF_MAP;                                               00001430
       CALL OVERFØR_EFSØKER_MAP;                                        00001440
       SELECT (TRANSKODE);                                              00001450
          WHEN ('R091')                                                 00001460
             DO;                                                        00001470
                CALL FJERN_TEKST_SPES;                                  00001480
                CALL BLOKKERE_SPES;                                     00001490
             END;                                                       00001500
          WHEN ('R092')                                                 00001510
             DO;                                                        00001520
                CALL TEKST_SPES;                                        00001530
                CALL OVERFØR_EFSPES_MAP;                                00001540
             END;                                                       00001550
          OTHERWISE;                                                    00001560
       END;                                                             00001570
                                                                        00001580
      IF HENT_FRAM_MAP THEN                                             00001590
         EXEC CICS SEND MAP('S001091') MAPSET('S001093') ERASE CURSOR;  00001600
      ELSE                                                              00001610
         EXEC CICS SEND MAP('S001091') MAPSET('S001093') ERASEAUP       00001620
                                                      DATAONLY CURSOR;  00001630
                                                                        00001640
      FEIL_MELD_NR  = 666;/* => FEIL_FUNNET ER SATT. */                 00001650
      HENT_FRAM_MAP = '0'B;                                             00001660
                                                                        00001670
      IF  FRA_CICS THEN                                                 00001680
         EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);         00001690
      ELSE                                                              00001700
         GOTO RECEIVE_MAP;                                              00001710
    END;                                                                00001720
   ELSE                                                                 00001730
      DO;                                                               00001740
         IF TRANSKODE = 'R090' THEN                                     00001750
            TRANS_RETURKODE = 'R091';                                   00001760
         ELSE                                                           00001770
            TRANS_RETURKODE = TRANSKODE;                                00001780
         IF  FRA_CICS  THEN                                             00001790
            DO;                                                         00001800
               BLANKETTYPE = STYREKODE;                                 00001810
               TRANSKODE   = 'R042';                                    00001820
            END;                                                        00001830
      END;                                                              00001840
  END;                                                                  00001850
                                                                        00001860
  CALL UTGANG;                                                          00001870
                                                                        00001880
  UTGANG: PROC;                                                         00001890
    IF FRA_CICS THEN                                                    00001900
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00001910
    ELSE                                                                00001920
       EXEC CICS RETURN;                                                00001930
  END UTGANG;                                                           00001940
                                                                        00001950
                                                                        00001960
  FEILBEH:                                                              00001970
                                                                        00001980
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00001990
                                                                        00002000
     PROGRAM_ID = 'R0010901';                                           00002010
                                                                        00002020
     S001091O.MELDING2O =                                               00002030
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00002040
                                                                        00002050
     S001091O.MELDING3O =                                               00002060
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00002070
                                                                        00002080
     S001091O.MELDING4O =                                               00002090
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00002100
                                         !! '. DATASETT : ' !! DSNAVN;  00002110
                                                                        00002120
     S001091O.MELDING5O =                                               00002130
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00002140
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00002150
                                                                        00002160
     S001091O.MELDING6O =                                               00002170
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00002180
                                                                        00002190
                                                                        00002200
     EXEC CICS SEND MAP('S001091')                                      00002210
                                                 MAPSET('S001093');     00002220
                                                                        00002230
     EXEC CICS RECEIVE MAP('S001091')                                   00002240
                                    MAPSET('S001093') SET(BMSMAPBR);    00002250
                                                                        00002260
                                                                        00002270
     EXEC CICS SYNCPOINT ROLLBACK;                                      00002280
                                                                        00002290
                                                                        00002300
     TERMINERINGS_IND = 'F';                                            00002310
                                                                        00002320
     TRANSKODE  = 'R041';                                               00002330
                                                                        00002340
     CALL UTGANG;                                                       00002350
                                                                        00002360
  ABEND:                                                                00002370
     EXEC CICS ABEND ABCODE(FEIL);                                      00002380
                                                                        00002390
  PF1:                                                                  00002400
                                                                        00002410
 /* LEGGER UNDERKJENT TRANS UT PÅ VENTEDATABASE HVIS GYLDIG     */      00002420
 /* FNR OG VIRKNINGSDATO,ELLERS FORKASTES TRANSAKSJONEN.        */      00002430
                                                                        00002440
     IF ^(EFS.FNRNR = 1          !                                      00002450
          EFS.FNRNR = 200        !                                      00002460
          EFS.VIRK_DATO_MÅNR = 9 !                                      00002470
          EFS.VIRK_DATO_MÅNR = 200) THEN                                00002480
        DO;                                                             00002490
                                                                        00002500
           IF FØDSNUMMER    = 0   THEN                                  00002510
                                                                        00002520
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER FORKASTET.           */      00002530
                                                                        00002540
              DO;                                                       00002550
                 FEIL_MELD_NR  = 0;                                     00002560
                 S001091O.MELDING6O =                                   00002570
                         'REGISTERINGEN ER IKKE AVSLUTTET MED "ENTER"'!!00002580
                         '.TRANSAKSJONEN ER FORKASTET.';                00002590
                                                                        00002600
              END;                                                      00002610
           ELSE                                                         00002620
              DO;                                                       00002630
                                                                        00002640
                 SEARCH_FNR  = TRANS_OPPL_OMR.FØDSNUMMER;               00002650
                 IF FRA_CICS THEN                                       00002660
                    BLANKETTYPE = STYREKODE;                            00002670
                                                                        00002680
                                                                        00002690
                 IF FEIL_MELD_NR = 666 &      /*BLANKETTKONTROLLFEIL*/  00002700
                    ^FRA_MED_DIALOG     THEN  /*IKKE BASEKONTROLLFEIL*/ 00002710
                    FUNKSJONSKODE = 'B';                                00002720
                                                                        00002730
                IF EFS.NORSK_BOSATT = 'N' THEN                          00002740
                   DO;                                                  00002750
                      CALL BLANK_EF_MELDNR;                             00002760
                      CALL OVERFØR_EF_SPES;                             00002770
                   END;                                                 00002780
                                                                        00002790
                 EXEC CICS LINK PROGRAM('R0010490') COMMAREA(KOM_OMR);  00002800
                                                                        00002810
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER LAGT UT PÅ VENTEBASE.*/      00002820
                                                                        00002830
                 S001091O.MELDING6O =                                   00002840
                         'TRANSAKSJONEN ER LAGT UT PÅ VENTEREGISTER.';  00002850
              END;                                                      00002860
                                                                        00002870
           EXEC CICS SEND MAP('S001091') MAPSET('S001093')              00002880
                                                           DATAONLY;    00002890
     /* DUMMY SEND-KALL.                              */                00002900
                                                                        00002910
           EXEC CICS SEND MAP('S001091')                                00002920
                                                  MAPSET('S001093');    00002930
           EXEC CICS DELAY INTERVAL(005);                               00002940
                                                                        00002950
           TERMINERINGS_IND = 'F';                                      00002960
                                                                        00002970
           TRANSKODE  = 'R041';                                         00002980
                                                                        00002990
           CALL UTGANG;                                                 00003000
                                                                        00003010
        END;                                                            00003020
     ELSE                                                               00003030
        DO;                                                             00003040
           TERMINERINGS_IND = 'F';                                      00003050
                                                                        00003060
           TRANSKODE = 'R041';                                          00003070
                                                                        00003080
           S001091O.MELDING6O =                                         00003090
                                                                        00003100
   'NB** TRANSAKSJONEN ER FORKASTET P.G.A. UGYLDIG FNR EL. VDATO **NB'; 00003110
                                                                        00003120
           EXEC CICS SEND MAP('S001091') MAPSET('S001093')              00003130
                                                           DATAONLY;    00003140
     /* DUMMY SEND-KALL.                            */                  00003150
                                                                        00003160
           EXEC CICS SEND MAP('S001091')                                00003170
                                    MAPSET('S001093');                  00003180
                                                                        00003190
           EXEC CICS DELAY INTERVAL(005);                               00003200
                                                                        00003210
           CALL UTGANG;                                                 00003220
        END;                                                            00003230
                                                                        00003240
                                                                        00003250
  PF2:                                                                  00003260
     TERMINERINGS_IND   = 'F';                                          00003270
                                                                        00003280
     S001091O.MELDING6O =                                               00003290
      'NBNBNBNBNB***    TRANSAKSJONEN ER FORKASTET.    ***NBNBNBNBNB';  00003300
                                                                        00003310
     EXEC CICS SEND MAP('S001091') MAPSET('S001093')                    00003320
                                                      DATAONLY ;        00003330
     /* DUMMY SEND-KALL.                                     */         00003340
                                                                        00003350
     EXEC CICS SEND MAP('S001091')                                      00003360
                                    MAPSET('S001093');                  00003370
     EXEC CICS DELAY INTERVAL(005);                                     00003380
                                                                        00003390
                                                                        00003400
     TRANSKODE = 'R041';                                                00003410
                                                                        00003420
     CALL UTGANG;                                                       00003430
                                                                        00003440
 %PAGE;                                                                 00003450
      %INCLUDE R0010902;               /* BLANK  ARBEIDSOMRÅDE        */00003460
 %PAGE;                                                                 00003470
      %INCLUDE R0010903;               /* KONTROLL AV SØKERDELEN      */00003480
 %PAGE;                                                                 00003490
      %INCLUDE R0010905;               /* KONTROLL AV SPESIELLE         00003500
                                          OPPLYSNINGER SØKER          */00003510
 %PAGE;                                                                 00003520
      %INCLUDE R0010906;               /* ARBEIDSOMRÅDE -> MAP        */00003530
 %PAGE;                                                                 00003540
      %INCLUDE R0010907;               /* FORTEKTSTER OG ATTRIBUTTER    00003550
                                          SPES.DEL                    */00003560
 %PAGE;                                                                 00003570
      %INCLUDE R0010909;               /* MAP -> ARBEIDSOMRÅDE        */00003580
 %PAGE;                                                                 00003590
      %INCLUDE R0010508;               /* BEREGN TT AF                */00003600
 %PAGE;                                                                 00003610
      %INCLUDE R0010608;               /* BEREGN TT UF                */00003620
 %PAGE;                                                                 00003630
      %INCLUDE R0019901;               /*  TESTER OM DATO ER GYLDIG   */00003640
 %PAGE;                                                                 00003650
      %INCLUDE R0019902;               /*  FINNE KJØNN                */00003660
 %PAGE;                                                                 00003670
      %INCLUDE R0019904;               /* FØDSELSNUMMERKONTROLL       */00003680
 %PAGE;                                                                 00003690
      %INCLUDE R0019905;               /* BEREGNER ALDER              */00003700
 %PAGE;                                                                 00003710
      %INCLUDE R0019908;               /* DAGENS DATO PLUSS 1         */00003720
 %PAGE;                                                                 00003730
      %INCLUDE R0019909;               /* KONTROLL TRYGDETID          */00003740
 %PAGE;                                                                 00003750
      %INCLUDE R0019910;               /* NUMERISK KONTROLL           */00003760
 %PAGE;                                                                 00003770
      %INCLUDE R0019911;               /*  DATO KONTROLL              */00003780
 %PAGE;                                                                 00003790
      %INCLUDE R0019912;  /* KONVERTERING CHAR ==> PIC / PIC ==> CHAR */00003800
 %PAGE;                                                                 00003810
      %INCLUDE R0019913;               /*  F_SNU_DATO                 */00003820
 %PAGE;                                                                 00003830
      %INCLUDE R0019944;               /* SKRIV_FEIL                  */00003840
   END R00109;                                                          00003850
