 /*       SIST ENDRET 24/10-97 11.56.59 AV   JDA7339                  */00000000
 /*       SIST ENDRET 10/09-97 15.12.46 AV   TSB7339                  */00000010
 /*       SIST ENDRET 20/08-97 08.51.53 AV   HLA7339                  */00000020
 /*       SIST ENDRET 19/08-97 14.35.54 AV   TSB7339                  */00000030
 /*       SIST ENDRET 04/08-97 14.10.09 AV   JDA7339                  */00000040
 /*       SIST ENDRET 18/10-94 15.13.01 AV   JDA0310                  */00000050
 /*       SIST ENDRET 28/09-94 12.26.39 AV   JDA0310                  */00000060
 /*       SIST ENDRET 05/01-94 12.54.52 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 24/03-93 09.21.36 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 30/01-92 09.52.10 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 18/12-91 16.20.52 AV   HERMAN                   */00000100
 /*       SIST ENDRET 13/12-91 12.35.26 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 10/10-91 13.56.23 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 11/07-91 14.22.57 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 26/04-91 11.47.32 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 08/04-91 12.06.41 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 12/11-90 13.15.13 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 04/09-90 12.53.45 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 13/12-89 08.00.50 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 01/12-89 08.42.19 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 14/04-89 13.40.41 AV   HERMAN                   */00000200
 /*       SIST ENDRET 06/10-87 10.02.59 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 11/07-85 14.03.22 AV   LUNDEBY                  */00000220
 /*       SIST ENDRET 05/07-84 08.20.45 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 07/06-84 13.41.16 AV   DYBVIK                   */00000240
 /*       SIST ENDRET 31/10-83 10.11.19 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 23/10-83 17.48.54 AV   OLAV                     */00000260
 /*       SIST ENDRET 23/10-83 13.00.51 AV   OLAV                     */00000270
 /*       SIST ENDRET 20/10-83 12.29.18 AV   OLAV                     */00000280
 /*       SIST ENDRET 16/10-83 22.04.13 AV   OLAV                     */00000290
  /* *************************************************************** */ 00000300
  /* IDENTIFIKASJON:   R0017036                                      */ 00000310
  /* PROGRAMMERER:  HELEN    JULI, 1982                              */ 00000320
  /* HENSIKT:                                                        */ 00000330
  /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT    */ 00000340
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */ 00000350
  /*        HVER AJOURFØRT TRANSAKSJON.                              */ 00000360
  /* PROGRAMTILKNYTNING:                                             */ 00000370
  /*        PROGRAMMET INKLUDERES I  R0017001                        */ 00000380
  /* *************************************************************** */ 00000390
  LAG_ETTERL_UFØRPENS_HEND:                                             00000400
      PROC(IND);                                                        00000410
                                                                        00000420
                                                                        00000430
    DCL   IND             FIXED BIN (15);                               00000440
    DCL EKIND             FIXED BIN (15);                               00000450
                                                                        00000460
  /* *************************************************************** */ 00000470
  /* PROGRAMMET BEGYNNER HER.VI BLANKER W_HENDELSE.                  */ 00000480
  /* ADDRESSERER EIB                                                 */ 00000490
  /* *************************************************************** */ 00000500
                                                                        00000510
    EXEC CICS ADDRESS EIB(DFHEIPTR);                                    00000520
                                                                        00000530
    IF IND = 1 THEN                                                     00000540
       EKIND = 2;                                                       00000550
    ELSE                                                                00000560
       EKIND = 1;                                                       00000570
                                                                        00000580
    W_HENDELSE              =   '';                                     00000590
    OMR_DATO                = F_SNU_DATO(TRANS_OPPL_OMR.VIRKNINGSDATO); 00000600
                                                                        00000610
    IF TRANS_OPPL_OMR.TRANSTYPE = 27 THEN                               00000620
                                                                        00000630
       DO;                                                              00000640
          HENDDATO  =  OMR_DATO;                                        00000650
       END;                                                             00000660
                                                                        00000670
    ELSE                                                                00000680
                                                                        00000690
       DO;                                                              00000700
          IF DIV_PERIODE.INTENDR_ÅM > 0    THEN                         00000710
             HENDDATO     = DIV_PERIODE.INTENDR_ÅM;                     00000720
          ELSE                                                          00000730
             DO;                                                        00000740
                R_HENDDATO_D =  B02.PERSON.STATUS.VIRK_DATO_ÅM(IND);    00000750
                HENDDATO     =  R_HENDDATO.AAR !!R_HENDDATO.MND;        00000760
             END;                                                       00000770
       END;                                                             00000780
                                                                        00000790
    W_HENDELSE.FNR_EKTEF     = B02.PERSON.RF0PERSN.FNR(EKIND);          00000800
    W_HENDELSE.NAVN_EKTEF    = B02.PERSON.RF0PERSN.NAVN(EKIND);         00000810
    W_HENDELSE.VERSJON       =   W_ROT.NESTE_SB_VERSJON_NR;             00000820
    W_HENDELSE.TERMINAL      =   EIBTRMID;                              00000830
    W_HENDELSE.PENSJONSTYPE1 = B02.STATUS.PENSJONSTYPE1(IND);           00000840
    W_HENDELSE.PENSJONSTYPE2 = B02.STATUS.PENSJONSTYPE2(IND);           00000850
    W_HENDELSE.PENSJONSTYPE3 = B02.STATUS.PENSJONSTYPE3(IND);           00000860
    W_HENDELSE.SIVILSTAND_EK = B02.SIVILSTAND(EKIND);                   00000870
    W_HENDELSE.PENSJONSTYPE1_EK = B02.PENSJONSTYPE1(EKIND);             00000880
  /*W_HENDELSE.PENSJONSTYPE2_EK = B02.PENSJONSTYPE2(EKIND); */          00000890
                                                                        00000900
  /* *************************************************************** */ 00000910
  /* DERSOM ETTERLATTE PENSJONEN ER STØRSTE                          */ 00000920
  /* *************************************************************** */ 00000930
                                                                        00000940
    IF B02.PERSON.ETTEPENS.GP_BRUTTO(IND) > 0   THEN                    00000950
                                                                        00000960
       DO;                                                              00000970
          W_HENDELSE.GP_BRUTTO = B02.ETTEPENS.GP_BRUTTO(IND);           00000980
          W_HENDELSE.GP_NETTO  = B02.ETTEPENS.GP_NETTO(IND);            00000990
          W_HENDELSE.TP_BRUTTO = B02.ETTEPENS.TP_BRUTTO(IND) +          00001000
                                        B02.UFØRPENS.TP(IND);           00001010
          W_HENDELSE.TP_NETTO  = B02.ETTEPENS.TP_NETTO(IND) +           00001020
                                        B02.UFØRPENS.TP(IND);           00001030
          W_HENDELSE.ST        = B02.ETTEPENS.ST(IND);                  00001040
          W_HENDELSE.FULLT_SÆRTILLEGG =                                 00001050
                   DIV_PARAM_OMR.FULLT_SÆRTILLEGG(IND);                 00001060
 /*YS*/   IF B02.STATUS.SIVILSTAND(IND) ^= 'S' THEN                     00001070
             W_HENDELSE.TP_PROSENT     = 55;                            00001080
          ELSE                                                          00001090
             W_HENDELSE.TP_PROSENT     = B02.ETTEPENS.TP_PROSENT(IND);  00001100
                                                                        00001110
                                                                        00001120
       END;                                                             00001130
                                                                        00001140
    ELSE                                                                00001150
                                                                        00001160
       DO;                                                              00001170
          W_HENDELSE.GP_BRUTTO  =  B02.UFØRPENS.GP(IND);                00001180
          W_HENDELSE.GP_NETTO   =  B02.UFØRPENS.GP(IND);                00001190
          W_HENDELSE.TP_BRUTTO  =  B02.UFØRPENS.TP(IND);                00001200
          W_HENDELSE.TP_NETTO   =  B02.UFØRPENS.TP(IND);                00001210
          W_HENDELSE.ST         =  B02.UFØRPENS.ST(IND);                00001220
       END;                                                             00001230
                                                                        00001240
 /*2.4.91 HL : */                                                       00001250
                                                                        00001260
      IF IND < 3        THEN                                            00001270
         W_HENDELSE.GARANTITILLEGG_TP = DIV_PARAM_OMR.                  00001280
                                GARANTITILLEGG_TP(IND);                 00001290
                                                                        00001300
                                                                        00001310
                                 /* TRUDE FT0591 FRA HIT */             00001320
     /* HER ER DET BRUKT FEIL INDEX  SKAL VÆRE EKIND IKKE EKTEF_IND */  00001330
     /* TRUDE 290192                                                */  00001340
                                                                        00001350
    IF B02.PENSJONSTYPE1(EKIND)  =  'F' THEN                            00001360
         DO I = 1 TO 13;                                                00001370
            IF B02.FNR_TILKN(IND,I) =   B02.FNR(EKIND) THEN             00001380
                DO;                                                     00001390
                   W_HENDELSE.ET_FØR_0591 = B02.FT_FØR_91(IND,I);       00001400
                   I = 13;                                              00001410
                END;                                                    00001420
         END;                                                           00001430
                                                                        00001440
    W_HENDELSE.GARANTITILLEGG_EK = B02.FORSI.GARANTITILLEGG_EK(IND);    00001450
    W_HENDELSE.GARANTITILLEGG_BARN =                                    00001460
                            B02.FORSI.GARANTITILLEGG_BARN(IND);         00001470
    W_HENDELSE.GARANTITILLEGG_SÆRBARN =                                 00001480
                        B02.FORSI.GARANTITILLEGG_SÆRBARN(IND);          00001490
                                /* FT 0591 TIL HIT */                   00001500
                                                                        00001510
    W_HENDELSE.KT            =  B02.UFØRPENS.KT(IND);                   00001520
    W_HENDELSE.BT            =  B02.UFØRPENS.BT(IND);                   00001530
                                                                        00001540
                                 /*NY0591 FRA HIT TRUDE */              00001550
    W_HENDELSE.BT_SÆRBARN    =  B02.FORSI.BT_SÆRBARN(IND);              00001560
    W_HENDELSE.FT_SKAL_BEREGNES = B02.FORSI.FT_SKAL_BEREGNES(IND);      00001570
    W_HENDELSE.ARBEIDSINNTEKT   = B02.FORSI.ARBEIDSINNTEKT(IND);        00001580
    W_HENDELSE.PENSJONSINNTEKT   = B02.FORSI.PENSJONSINNTEKT(IND);      00001590
    W_HENDELSE.ARBEIDSINNTEKT_EK = B02.FORSI.ARBEIDSINNTEKT_EK(IND);    00001600
    W_HENDELSE.PENSJONSINNTEKT_EK= B02.FORSI.PENSJONSINNTEKT_EK(IND);   00001610
    W_HENDELSE.FRIBELØP_MINSTE = DIV_PARAM_OMR.FRIBELØP_MINSTE(IND);    00001620
    W_HENDELSE.FRIBELØP_FELLESBARN =                                    00001630
                                DIV_PARAM_OMR.FRIBELØP_FELLESBARN(IND); 00001640
    W_HENDELSE.FRIBELØP_SÆRBARN = DIV_PARAM_OMR.FRIBELØP_SÆRBARN(IND);  00001650
    W_HENDELSE.FOLKETRYGD        = DIV_PARAM_OMR.FOLKETRYGD(IND);       00001660
    W_HENDELSE.FOLKETRYGD_EK  = DIV_PARAM_OMR.FOLKETRYGD(EKIND);        00001670
                                    /* HIT TRUDE */                     00001680
                                                                        00001690
      /* NYE FELT FRYS OG TIDSB ATTF 07.97   JD         */              00001700
    W_HENDELSE.FRYSDATO_ÅM       = B02.FRYSDATO_ÅM         (IND);       00001710
    W_HENDELSE.FRYSKODE          = B02.FRYSKODE            (IND);       00001720
    W_HENDELSE.GARANTIGRAD       = B02.GARANTIGRAD         (IND);       00001730
    IF B02.TIDSBEGR_ATTF(IND) = 'J' THEN                                00001740
       W_HENDELSE.ATTF_KODE ='1' ;                                      00001750
    ELSE                                                                00001760
       W_HENDELSE.ATTF_KODE ='2' ;                                      00001770
    IF B01.UFØRPENS.UFG(IND) >                                          00001780
       B02.UFØRPENS.UFG(IND)  &                                         00001790
      (B02.FRYSKODE (IND) ^='1' &                                       00001800
       B02.FRYSKODE (IND) ^='2') THEN                                   00001810
       W_HENDELSE.FRYSKODE ='3' ;                                       00001820
      /* TEST FRYSKODE JD 7.97                 */                       00001830
    W_HENDELSE.YRKE_BT       =  B02.YRKEPENS.BT(IND);   /*YS*/          00001840
    W_HENDELSE.YRKE_TP       =  B02.YRKEPENS.TP(IND);   /*YS*/          00001850
    W_HENDELSE.YRKE_GP       =  B02.YRKEPENS.GP(IND);   /*YS*/          00001860
    W_HENDELSE.FORVENTET_INNTEKT = B02.ETTEPENS.FORVENTET(IND);         00001870
    W_HENDELSE.ANTALL_BARN   =  B02.STATUS.ANTALL_BARN(IND);            00001880
    W_HENDELSE.ANTALL_BARN_TIDL                                         00001890
                             =  B01.STATUS.ANTALL_BARN(IND);            00001900
    W_HENDELSE.ÅFT           =  B02.UFØRPENS.ÅFT(IND);                  00001910
    W_HENDELSE.DØD_AV_YSKADE =  B02.DØD_AV_YRKESSKADE(IND);   /*YS*/    00001920
    W_HENDELSE.TP_GAR_KODE   =  B02.TP_GAR_KODE(IND); /*UNG UFØR F67*/  00001930
                                                                        00001940
  /* *************************************************************** */ 00001950
  /* FØLGENDE  3 FELT SKAL EVT. REDIGERES INN I TEKSTTYPE B1.        */ 00001960
  /* *************************************************************** */ 00001970
                                                                        00001980
    W_HENDELSE.UF_GRAD      =  B02.UFØRPENS.UFG(IND);                   00001990
    W_HENDELSE.YRKE_UFG     =  B02.YRKEPENS.YUG(IND);   /*YS*/          00002000
    W_HENDELSE.YRKE_KODE        = B02.YRKEPENS.YPT_KODE(IND); /*YS*/    00002010
                                                                        00002020
    IF B02.YRKEPENS.YPT  (IND) < B02.YRKE_POENG_1291(IND)  THEN         00002030
       W_HENDELSE.YRKE_YPT     = B02.YRKE_POENG_1291(IND);              00002040
    ELSE                                                                00002050
       W_HENDELSE.YRKE_YPT     = B02.YRKEPENS.YPT  (IND);               00002060
                                                                        00002070
    W_HENDELSE.YRKE_SPT         = B02.YRKEPENS.SPT  (IND);    /*YS*/    00002080
    IF B02.YRKEPENS.YPT(EKIND) > 0  THEN                                00002090
       DO;                                                              00002100
                                                                        00002110
    IF B02.YRKEPENS.YPT (EKIND) < B02.YRKE_POENG_1291(EKIND)  THEN      00002120
       W_HENDELSE.YRKE_YPT_AVD = B02.YRKE_POENG_1291(EKIND);            00002130
    ELSE                                                                00002140
       W_HENDELSE.YRKE_YPT_AVD = B02.YRKEPENS.YPT  (EKIND);             00002150
                                                                        00002160
 /*      W_HENDELSE.YRKE_YPT_AVD  = B02.YRKEPENS.YPT(EKIND)      */     00002170
         W_HENDELSE.YRKE_KODE_AVD = B02.YRKEPENS.YPT_KODE(EKIND);/*YS*/ 00002180
         W_HENDELSE.YRKE_SPT_AVD  = B02.YRKEPENS.SPT(EKIND); /*YS*/     00002190
         W_HENDELSE.YRKE_UFG_AVD = B02.YRKEPENS.YUG(EKIND); /*YS*/      00002200
       END;                                                             00002210
                                                                        00002220
  /* *************************************************************** */ 00002230
  /* FØLGENDE FELT HENTES FRA YRKESSKADEHISTORIKKK                   */ 00002240
  /* *************************************************************** */ 00002250
                                                                        00002260
                                                                        00002270
  DCL K                 FIXED BIN(15) INIT (0);                 /*YS*/  00002280
  DCL M                 FIXED BIN(15) INIT (0);                 /*YS*/  00002290
  DCL Y                 FIXED BIN(15) INIT (0);                         00002300
                                                                /*YS*/  00002310
  DCL TRUDE1            PIC '9999';                             /*YS*/  00002320
  DCL TRUDE2            PIC '9999';                             /*YS*/  00002330
  /* FINNE SISTE YUFT  */                                       /*YS*/  00002340
  TRUDE1 = B01.YRKEHIST.YUFT_ÅM(EKIND,1);                       /*YS*/  00002350
  TRUDE2 = B01.YRKEHIST.YUFT_ÅM(EKIND,2);                       /*YS*/  00002360
  DO M = 5 TO 1 BY -1  UNTIL (B02.YRKEHIST.YUFT_ÅM              /*YS*/  00002370
                                       (EKIND,M) > 0);          /*YS*/  00002380
  END;                                                          /*YS*/  00002390
 IF M > 0 THEN                                                  /*YS*/  00002400
 DO;                                                            /*YS*/  00002410
  W_HENDELSE.YRKE_YUFT_ÅM_AVD = B02.YRKEHIST.YUFT_ÅM(EKIND,M);  /*YS*/  00002420
  W_HENDELSE.YRKE_YST_ÅM_AVD  = B02.YRKEHIST.YST_ÅM (EKIND,M);  /*YS*/  00002430
  IF B02.YRKEHIST.AÅI (EKIND,M) = 9999999 THEN                 /*YS*/   00002440
     W_HENDELSE.YRKE_AÅI_AVD         = 0;                       /*YS*/  00002450
  ELSE                                                          /*YS*/  00002460
     W_HENDELSE.YRKE_AÅI_AVD  = B02.YRKEHIST.AÅI (EKIND,M);     /*YS*/  00002470
  W_HENDELSE.YRKE_YRKE11_AVD  = B02.YRKEHIST.YRKE11 (EKIND,M);  /*YS*/  00002480
  W_HENDELSE.YRKE_PAÅ_AVD     = B02.YRKEHIST.PAÅ   (EKIND,M);   /*YS*/  00002490
 END;                                                           /*YS*/  00002500
                                                               /*YS*/   00002510
  DO Y = 5 TO 1 BY -1  UNTIL (B02.YRKEHIST.YUFT_ÅM             /*YS*/   00002520
                                       (IND,Y) > 0);           /*YS*/   00002530
  END;                                                         /*YS*/   00002540
 IF Y > 0 THEN                                                  /*YS*/  00002550
 DO;                                                            /*YS*/  00002560
 /* IF B02.PERSON.STATUS.ENGANGSBELØP_11_7(IND) > 0 THEN       YS*/     00002570
    IF   DIV_PARAM_OMR.ENGANGSBELØP_11_7(IND) > 0 THEN  /*HL*/          00002580
     DO;                                                       /*YS*/   00002590
        W_HENDELSE.YRKE_UFG     = B02.YRKEHIST.YUG(IND,Y);     /*YS*/   00002600
     END;                                                      /*YS*/   00002610
                                                               /*YS*/   00002620
  W_HENDELSE.YRKE_YUFT_ÅM = B02.YRKEHIST.YUFT_ÅM(IND,Y);       /*YS*/   00002630
  W_HENDELSE.YRKE_YST_ÅM  = B02.YRKEHIST.YST_ÅM (IND,Y);       /*YS*/   00002640
  IF B02.YRKEHIST.AÅI (IND,Y) = 9999999 THEN                /*YS*/      00002650
     W_HENDELSE.YRKE_AÅI         = 0;                          /*YS*/   00002660
  ELSE                                                         /*YS*/   00002670
     W_HENDELSE.YRKE_AÅI         = B02.YRKEHIST.AÅI   (IND,Y); /*YS*/   00002680
  W_HENDELSE.YRKE_YRKE11  = B02.YRKEHIST.YRKE11 (IND,Y);       /*YS*/   00002690
  W_HENDELSE.YRKE_PAÅ     = B02.YRKEHIST.PAÅ   (IND,Y);        /*YS*/   00002700
 END;                                                                   00002710
    W_HENDELSE.TT           =  B02.STATUS.TT_ANV(IND);                  00002720
    W_HENDELSE.TT_EK        =  B02.STATUS.TT_ANV(EKIND);                00002730
    W_HENDELSE.PÅ            = B02.UFØRPENS.PÅ   (IND);                 00002740
    W_HENDELSE.OPT           = B02.UFØRPENS.OPT  (IND);                 00002750
    W_HENDELSE.SPT           = B02.UFØRPENS.SPT  (IND);                 00002760
    W_HENDELSE.BOSATT        = B02.BOSATT        (IND); /* JD 08.90 */  00002770
    W_HENDELSE.BUP_GARANTI   = B02.BUP_GARANTI(IND,1);/*UNG UFØR F67*/  00002780
                                                                        00002790
    W_HENDELSE.PÅ_EK         = B02.ETTEPENS.PÅ_AVD  (IND);              00002800
    W_HENDELSE.OPT_EK        = B02.ETTEPENS.OPT_AVD (IND);              00002810
    W_HENDELSE.SPT_EK        = B02.ETTEPENS.SPT_AVD (IND);              00002820
                                                                        00002830
  /* *************************************************************** */ 00002840
  /* NY LOV 0192     JD 11.91                                        */ 00002850
  /* *************************************************************** */ 00002860
                                                                        00002870
    W_HENDELSE.GT_LOV92    =  B02.STATUS.GT_LOV92(IND);                 00002880
    W_HENDELSE.GT_TILLEGG_LOV92 = B02.STATUS.GT_TILLEGG_LOV92(IND);     00002890
    W_HENDELSE.GARANTI_DATO_ÅM  = B02.STATUS.GARANTI_DATO_ÅM(IND);      00002900
    W_HENDELSE.SPT_1291         = B02.UFØRPENS.SPT_1291      (IND);     00002910
    W_HENDELSE.OPT_1291         = B02.UFØRPENS.OPT_1291      (IND);     00002920
    W_HENDELSE.PÅ_1291         = B02.UFØRPENS.PÅ_1291      (IND);       00002930
    W_HENDELSE.PÅ_ETTER91      = B02.UFØRPENS.PÅ_ETTER91   (IND);       00002940
    W_HENDELSE.SPT_1291_EK      = B02.ETTEPENS.SPT_1291     (IND);      00002950
    W_HENDELSE.OPT_1291_EK      = B02.ETTEPENS.OPT_1291      (IND);     00002960
    W_HENDELSE.PÅ_1291_EK      = B02.ETTEPENS.PÅ_1291      (IND);       00002970
    W_HENDELSE.PÅ_ETTER91_EK   = B02.ETTEPENS.PÅ_ETTER91   (IND);       00002980
    W_HENDELSE.YRKE_PÅ_ETTER91 = B02.YRKEPENS.PÅ_ETTER91  (IND);        00002990
    W_HENDELSE.YRKE_POENG_1291 = B02.YRKEPENS.YRKE_POENG_1291(IND);     00003000
             /* HIT JD 1191 */                                          00003010
    W_HENDELSE.YRKE_PÅ_ETTER91_AVD =                                    00003020
                               B02.YRKEPENS.PÅ_ETTER91(EKIND);          00003030
    W_HENDELSE.YRKE_POENG_1291_AVD =                                    00003040
                               B02.YRKEPENS.YRKE_POENG_1291(EKIND);     00003050
         /*AVD.OPPL LAGT INN MARS 93 JD*/                               00003060
       DO J = 3 TO 14 WHILE(B02.FNR(J) > 0);                            00003070
                                                                        00003080
          DO K = 1 TO 13 WHILE (B02.FNR_TILKN(IND,K) > 0);              00003090
                                                                        00003100
             IF B02.FNR(J) = B02.FNR_TILKN(IND,K) THEN                  00003110
                                                                        00003120
                DO;                                                     00003130
                   W_HENDELSE.BARN.FNR_B(J-2)           = B02.FNR(J);   00003140
                   W_HENDELSE.BARN.PENSJONSTYPE2_B(J-2) =               00003150
                                                  B02.PENSJONSTYPE2(J); 00003160
                   W_HENDELSE.BARN.BT_FØR_0591(J-2)  =                  00003170
                                          B02.FT_FØR_91(IND,K);         00003180
                   K = 13;                                              00003190
                END;                                                    00003200
          END;                                                          00003210
       END;                                                             00003220
                                                                        00003230
  /* *************************************************************** */ 00003240
  /* FØLGENDE FELT HENTES FRA P0014009                               */ 00003250
  /* *************************************************************** */ 00003260
                                                                        00003270
    W_HENDELSE.ÅR_BUP_FPP_EK = POREKKE.BUP_FPP_ÅR(EKIND);               00003280
    W_HENDELSE.ÅR_BUP_FPP    = POREKKE.BUP_FPP_ÅR(IND);                 00003290
                                                                        00003300
    CALL PLASSER_TEKST(IND,EKIND);                                      00003310
                                                                        00003320
    CALL INSERT_HENDELSE;                                               00003330
                                                                        00003340
    IF W_HENDELSE.SPT > 0 ! W_HENDELSE.OPT > 0 THEN                     00003350
       DO;                                                              00003360
          CALL BYGG_OPP_BERGRUNL_SEGMENT(IND);                          00003370
       END;                                                             00003380
                                                                        00003390
  /* *************************************************************** */ 00003400
  /*   DERSOM AVDØDE ER EKTEFELLE                                    */ 00003410
  /* *************************************************************** */ 00003420
                                                                        00003430
    IF (B02.PENSJONSTYPE1(IND) = 'E' &                                  00003440
        B02.PENSJONSTYPE1(EKIND) = 'D' ) !                              00003450
       (W_HENDELSE.SPT_EK       >  0 !                                  00003460
        W_HENDELSE.OPT_EK       >  0 ) THEN                             00003470
        DO;                                                             00003480
           CALL BYGG_OPP_BERGRUNL_SEGMENT_DØD(EKIND);                   00003490
        END;                                                            00003500
                                                                        00003510
  END  LAG_ETTERL_UFØRPENS_HEND;                                        00003520
