 /*       SIST ENDRET 07/03-97 12.29.38 AV   JDA7339                  */00000000
 /*       SIST ENDRET 05/02-96 12.30.37 AV   JDA0310                  */00000010
 /*       SIST ENDRET 09/01-96 14.39.27 AV   JDA0310                  */00000020
 /*       SIST ENDRET 11/07-94 12.40.38 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 25/02-94 12.49.53 AV   HERMAN                   */00000040
 /*       SIST ENDRET 26/04-91 12.34.10 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 01/12-89 08.52.28 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 21/08-85 08.23.39 AV   FARVIK                   */00000070
 /*       SIST ENDRET 08/08-85 14.34.30 AV   FARVIK                   */00000080
 /*       SIST ENDRET 30/07-85 14.50.33 AV   FARVIK                   */00000090
 /*       SIST ENDRET 21/09-84 13.04.06 AV   FARVIK                   */00000100
 /*       SIST ENDRET 12/06-84 14.23.19 AV   FARVIK                   */00000110
 /* ***************************************************************** */00000120
 /*                                                                   */00000130
 /* ***************************************************************** */00000140
 /*IDENTIFIKASJON:                                                    */00000150
 /* **********************                                            */00000160
 /*  PROGRAM-IDENT : R001A470 - UTSKRIFT VED SPLITTING - HOVEDPROGRAM */00000170
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000180
 /*  PROGRAMMERER  : PATHAK                                           */00000190
 /*  PROGRAMMET BLE LAGET :      1994                                 */00000200
 /* ***************************************************************** */00000210
 /*HENSIKT:                                                           */00000220
 /* **********                                                        */00000230
 /*  PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETT-MAPENE    */00000240
 /*  DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT PÅ        */00000250
 /*  FORHÅND.                                                         */00000260
 /*                                                                   */00000270
 /* ***************************************************************** */00000280
 /*PROGRAMTILKNYTTING:                                                */00000290
 /* ********************                                              */00000300
 /*  PROGRAMMET LINKES FRA 0470 - SOM ER DELT, FORDI DET BLE STORT    */00000310
 /*    EXEC CICS XCTL PROGRAM ('R001A470') COMMAREA(KOM_OMR);         */00000320
 /*  PROGRAMMET INKLUDERER:                                           */00000330
 /*    R0010506   -   FLYTTER GRBL-AP FRA ARB.OMR TIL MAP             */00000340
 /*    R0010507   -   FLYTTER GRBL-AP FORTEKSTER OG ATTRIBUTTER       */00000350
 /*    R0010606   -   FLYTTER GRBL-UP FRA ARB.OMR TIL MAP             */00000360
 /*    R0010607   -   FLYTTER GRBL-UP FORTEKSTER OG ATTRIBUTTER       */00000370
 /*    R0010706   -   FLYTTER GRBL-US FRA ARB.OMR TIL MAP             */00000380
 /*    R0010806   -   FLYTTER GRBL-EP FRA ARB.OMR TIL MAP             */00000390
 /*    R0010807   -   FLYTTER GRBL-EP FORTEKSTER OG ATTRIBUTTER       */00000400
 /*    R0010906   -   FLYTTER GRBL-EF FRA ARB.OMR TIL MAP             */00000410
 /*    R0010907   -   FLYTTER GRBL-EF FORTEKSTER OG ATTRIBUTTER       */00000420
 /*    R0011006   -   FLYTTER GRBL-FB FRA ARB.OMR TIL MAP             */00000430
 /*    R0011106   -   FLYTTER GRBL-BP FRA ARB.OMR TIL MAP             */00000440
 /*    R0011206   -   FLYTTER GRBL-FT FRA ARB.OMR TIL MAP             */00000450
 /*    R0011207   -   FLYTTER GRBL-FT FORTEKSTER OG ATTRIBUTTER       */00000460
 /*    R0011836   -   FLYTTER GRBL-UF FRA ARB.OMR TIL MAP    UF !!!   */00000470
 /*    R0011906   -   FLYTTER GRBL-AF FRA ARB.OMR TIL MAP    AFP!!!   */00000480
 /*    R0019912   -   PIC TIL CHAR OG MOTSATT                         */00000490
 /*  INTERNE PROCEDURER:                                              */00000500
 /*    LOW_VALUES_TIL_MAP - HEXA '00' INN I ET OMRÅDE                 */00000510
 /*    SELECT_BLANKETTYPE -                                           */00000520
 /*    AP_PROC            - SKRIVER AP-TRANS SOM BLANKETTRANS         */00000530
 /*    AF_PROC            - SKRIVER AF-TRANS SOM BLANKETTRANS         */00000540
 /*    UP_PROC            - SKRIVER UP-TRANS SOM BLANKETTRANS         */00000550
 /*    UF_PROC            - SKRIVER UF-TRANS SOM BLANKETTRANS         */00000560
 /*    US_PROC            - SKRIVER US-TRANS SOM BLANKETTRANS         */00000570
 /*    EP_PROC            - SKRIVER EP-TRANS SOM BLANKETTRANS         */00000580
 /*    EF_PROC            - SKRIVER EF-TRANS SOM BLANKETTRANS         */00000590
 /*    FB_PROC            - SKRIVER FB-TRANS SOM BLANKETTRANS         */00000600
 /*    BP_PROC            - SKRIVER BP-TRANS SOM BLANKETTRANS         */00000610
 /*    FT_PROC            - SKRIVER FT-TRANS SOM BLANKETTRANS         */00000620
 /*  PROGRAMMET BRUKER FØLGENDE MAPSET:                               */00000630
 /*    S001F13:                                                       */00000640
 /*      MAP - S001051 - SKJERMBILDE GRUNNBLANKETT-AP                 */00000650
 /*      MAP - S001061 - SKJERMBILDE GRUNNBLANKETT-UP                 */00000660
 /*      MAP - S001071 - SKJERMBILDE GRUNNBLANKETT-US                 */00000670
 /*      MAP - S001081 - SKJERMBILDE GRUNNBLANKETT-EP                 */00000680
 /*      MAP - S001091 - SKJERMBILDE GRUNNBLANKETT-EF                 */00000690
 /*      MAP - S001101 - SKJERMBILDE GRUNNBLANKETT-FB                 */00000700
 /*      MAP - S001111 - SKJERMBILDE GRUNNBLANKETT-BP                 */00000710
 /*      MAP - S001121 - SKJERMBILDE GRUNNBLANKETT-FT                 */00000720
 /*      MAP - S001831 - SKJERMBILDE GUNNNBLANKETT-UF    UF!!!        */00000730
 /*      MAP - S001191 - SKJERMBILDE GRUNNBLANKETT-AF    AFP!!!       */00000740
 /*  RETUR TIL PROGRAMMET SOM AKTIVISERTE DETTE SLIK:                 */00000750
 /*    EXEC CICS RETURN;                                              */00000760
 /*                                                                   */00000770
 /* ***************************************************************** */00000780
 /*DATASETTOPPLYSNINGER:                                              */00000790
 /* ***********************                                           */00000800
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000810
 /*                                                                   */00000820
 /* ***************************************************************** */00000830
 /*FEILMELDINGER:                                                     */00000840
 /* *******************                                               */00000850
 /* DET BLIR IKKE SKREVET UT NOEN FEILMELDINGER I PROGRAMMET          */00000860
 /*                                                                   */00000870
 /* ***************************************************************** */00000880
                                                                        00000890
 R001047: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                          00000900
 %PAGE;                                                                 00000910
 %INCLUDE S001F1;    /* MAPPER FOR BLANKETTENE    */                    00000920
 %PAGE;                                                                 00000930
 %INCLUDE P0019906;  /* TRANS-OPPL-OMRÅDE (BASED) */                    00000940
 %PAGE;                                                                 00000950
 %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)        */                    00000960
 %PAGE;                                                                 00000970
 %INCLUDE P0019910;  /* STYRINGS - OMRÅDE (BASED) */                    00000980
 %PAGE;                                                                 00000990
 %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE(BASED)   */                    00001000
 %PAGE;                                                                 00001010
                                                                        00001020
                                                                        00001030
 DCL                                                                    00001040
    QUENAME                CHAR(8),                                     00001050
       QTERMID             CHAR(4) DEF QUENAME POS(1),                  00001060
       REST                CHAR(4) DEF QUENAME POS(5);                  00001070
                                                                        00001080
 DCL                                                                    00001090
    1 ROUTELIST,                                                        00001100
      2 PRINTER,                                                        00001110
        3 TERMID           CHAR(4),                                     00001120
        3 REST             CHAR(12),                                    00001130
      2 SISTE,                                                          00001140
        3 SLUTT            FIXED BIN(15),                               00001150
        3 REST             CHAR(14);                                    00001160
                                                                        00001170
 DCL                                                                    00001180
    CSTG                   BUILTIN,                                     00001190
    LOW                    BUILTIN,                                     00001200
    COMMAREA_PEKER         PTR,                                         00001210
    BMSMAPBR               PTR,                                         00001220
    MAPSET_PTR             PTR,                                         00001230
    I                      FIXED BIN(15),                               00001240
    START                  FIXED BIN(15) INIT(1),                       00001250
    LENGTH                 FIXED BIN(15),                               00001260
    LABEL_Y                LABEL,                                       00001270
    MELDING                CHAR(10) INIT('NOE ER GALT'),                00001280
    LOW_CHAR_BASED         CHAR(1000) BASED(BMSMAPBR),                  00001290
    ADDR                   BUILTIN;                                     00001300
                                                                        00001310
 /*----------------------------------------------------------------*/   00001320
 /* DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE                    */   00001330
 /*----------------------------------------------------------------*/   00001340
                                                                        00001350
 DCL                                                                    00001360
    CURSOR_POS     FIXED BIN  (15)   INIT (-1),                         00001370
    DFHBMUNP             CHAR (1)    INIT (' '),                        00001380
    DFHBMBRY             CHAR (1)    INIT ('H'),                        00001390
    DFHBMASK             CHAR (1)    INIT ('8'),/* H.INT + ASKIP  */    00001400
    FEIL_FUNNET          BIT  (1)    INIT ('1'B),                       00001410
    FORKASTES            BIT  (1)    INIT ('0'B),                       00001420
       W01_FAR_BEHANDLES BIT  (1)    INIT ('0'B),                       00001430
       W01_MOR_BEHANDLES BIT  (1)    INIT ('0'B),                       00001440
    MELDING6O            CHAR (78),                                     00001450
    YMELDING6O           CHAR (78);                                     00001460
                                                                        00001470
                                                                        00001480
         DCL  W01_YSKADE      BIT(1)         INIT  ('0'B);              00001490
         DCL  W01_NORSK_BOSATT     BIT(1)         INIT  ('0'B);         00001500
         DCL  W01_SIDE_ANTALL FIXED BIN(15)  INIT  ( 1  );              00001510
    QTERMID        = EIBTRMID;                                          00001520
    REST           = 'COMA';                                            00001530
    ROUTELIST      = '';                                                00001540
    PRINTER.TERMID = 'R41J';                                            00001550
    SISTE.SLUTT    = -1;                                                00001560
                                                                        00001570
                                                                        00001580
    EXEC CICS LOAD PROGRAM('S001F13') SET(MAPSET_PTR); /* TRANSMAPSET */00001590
    ALLOCATE  LOW_CHAR_BASED;                                           00001600
                                                                        00001610
    EXEC CICS HANDLE CONDITION OVERFLOW(OVERFLOW);                      00001620
                                                                        00001630
                                                                        00001640
    /*---------------------------------------------*/                   00001650
    /*  STYRING FOR OVERFØRINGSMODULENE            */                   00001660
    /*---------------------------------------------*/                   00001670
                                                                        00001680
    DIV_PARAM_OMR.FRA_CICS        = '0'B;                               00001690
    DIV_PARAM_OMR.HENT_FRAM_MAP   = '0'B;                               00001700
    DIV_PARAM_OMR.FRA_UTEN_DIALOG = '1'B;                               00001710
    DIV_PARAM_OMR.FRA_MED_DIALOG  = '0'B;                               00001720
                                                                        00001730
                                                                        00001740
    DO I = 1 TO 2;                                                      00001750
                                                                        00001760
       /*---------------------------------------------*/                00001770
       /* SETTER X'00' I HELE LOW_CHAR_BASED          */                00001780
       /*---------------------------------------------*/                00001790
       /* SKRIVER BLANKETT-TRANSEN PÅ SKJERMEN        */                00001800
       /* ELLER GJØR DEN KLAR TIL UTSKRIVING          */                00001810
       /*---------------------------------------------*/                00001820
                                                                        00001830
       LOW_CHAR_BASED = LOW(1000);                                      00001840
       CALL SELECT_BLANKETTYPE;                                         00001850
                                                                        00001860
       IF ^W01_YSKADE      THEN  DO;   I  =  3;                         00001870
          END;                                                          00001880
       EXEC CICS SEND PAGE RETAIN NOAUTOPAGE;                           00001890
    END;                                                                00001900
                                                                        00001910
    /*-------------------------------------------------------------*/   00001920
    /* AVSLUTTER MED RETURN TIL CICS.                              */   00001930
    /*-------------------------------------------------------------*/   00001940
                                                                        00001950
    EXEC CICS RETURN;                                                   00001960
                                                                        00001970
 OVERFLOW:                                                              00001980
    EXEC CICS SEND  TEXT  FROM (MELDING)ACCUM;                          00001990
    EXEC CICS SEND  PAGE;                                               00002000
    EXEC CICS PURGE MESSAGE;                                            00002010
                                                                        00002020
                                                                        00002030
                                                                        00002040
    /*---------------------------------------------*/                   00002050
    /* BEHANLER AKTUELL BLANKETT                   */                   00002060
    /*---------------------------------------------*/                   00002070
                                                                        00002080
    SELECT_BLANKETTYPE:                                                 00002090
      PROC;                                                             00002100
                                                                        00002110
                                                                        00002120
        SELECT(TRANS_OPPL_OMR.BLANKETTYPE);                             00002130
           WHEN('AP')                                                   00002140
              /* SKRIVER AP-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002150
              CALL AP_PROC;                                             00002160
                                                                        00002170
           WHEN('UP')                                                   00002180
              /* SKRIVER UP-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002190
              CALL UP_PROC;                                             00002200
                                                                        00002210
           WHEN('US')                                                   00002220
              /* SKRIVER US-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002230
              CALL US_PROC;                                             00002240
                                                                        00002250
           WHEN('EP')                                                   00002260
              /* SKRIVER EP-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002270
              CALL EP_PROC;                                             00002280
                                                                        00002290
           WHEN('EF')                                                   00002300
              /* SKRIVER EF-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002310
              CALL EF_PROC;                                             00002320
                                                                        00002330
           WHEN('FB')                                                   00002340
              /* SKRIVER EF-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002350
              CALL FB_PROC;                                             00002360
                                                                        00002370
           WHEN('BP')                                                   00002380
              /* SKRIVER BP-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002390
              CALL BP_PROC;                                             00002400
                                                                        00002410
           WHEN('FT')                                                   00002420
              /* SKRIVER FT-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002430
              CALL FT_PROC;                                             00002440
                                                                        00002450
           WHEN('AF')                                                   00002460
                                                                        00002470
              /* SKRIVER AF-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002480
              CALL AF_PROC;                                             00002490
                                                                        00002500
           WHEN('UF')                                                   00002510
              /* SKRIVER UF-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002520
              CALL UF_PROC;                                             00002530
           WHEN('E1')                                                   00002540
              /* SKRIVER E1-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002550
              CALL E1_PROC;                                             00002560
                                                                        00002570
           WHEN('E2')                                                   00002580
              /* SKRIVER E2-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002590
              CALL E2_PROC;                                             00002600
                                                                        00002610
           WHEN('O1')                                                   00002620
                                                                        00002630
              /* SKRIVER O1-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002640
              CALL O1_PROC;                                             00002650
           WHEN('O2')                                                   00002660
                                                                        00002670
              /* SKRIVER O2-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002680
              CALL O2_PROC;                                             00002690
                                                                        00002700
                                                                        00002710
           OTHERWISE;                                                   00002720
        END;       /*   SELECT     */                                   00002730
                                                                        00002740
                                                                        00002750
        AP_PROC:                                                        00002760
          PROC;                                                         00002770
          %INCLUDE P0010501;   /* TRANS_OMRÅDE AP  */                   00002780
          %INCLUDE R0010506;   /* AP_TRANS_TIL_MAP */                   00002790
          %INCLUDE R0010507;   /* OVERF. FORTEKSTER OG ATTRIBUTTER */   00002800
                                                                        00002810
                                                                        00002820
           /* INTERN PROC I R0010506: OVERFØRING AP-DELEN          */   00002830
                                                                        00002840
           CALL OVERFØR_APSØKER_MAP;                                    00002850
           IF APS.NORSK_BOSATT = 'N' THEN                               00002860
              DO;                                                       00002870
                                                                        00002880
                 /* INTERN PROC I R0010507: FORTEKSTER OG          */   00002890
                 /*                         ATTRIBUTTER I SPES-DEL */   00002900
                                                                        00002910
                 CALL TEKST_SPES;                                       00002920
                                                                        00002930
                 /* INTERN PROC I R0010506: OVERFØRING SPES_DEL    */   00002940
                                                                        00002950
                 CALL OVERFØR_APSPES_MAP;                               00002960
              END;                                                      00002970
           IF APS.BT_ANT > 0 THEN                                       00002980
              DO;                                                       00002990
                                                                        00003000
                 /* INTERN PROC I R0010507: FORTEKSTER OG          */   00003010
                 /*               ATTRIBUTTER I BARNE_DELEN        */   00003020
                                                                        00003030
                 CALL TEKST_BARN;                                       00003040
                                                                        00003050
                 /* INTERN PROC I R0010506: OVERFØRING BARNE-DELEN */   00003060
                                                                        00003070
                 CALL OVERFØR_APBARN_MAP;                               00003080
              END;                                                      00003090
           S001051O.DUMMYA = 'Ø';     /* PROT,DARK  */                  00003100
       /*  FREE TRANS_OMR,TRANS_OPPL_OMR;  ENDRET SATISH 6.6.94 */      00003110
                                                                        00003120
           /* SKRIVER SKJERMBILDE GRUNNBLANKETT-APTRANS */              00003130
                                                                        00003140
           EXEC CICS SEND MAP('S001051') MAPSET('S001F13') ACCUM        00003150
                                                  PAGING   ERASE;       00003160
                                                                        00003170
        END AP_PROC;                                                    00003180
                                                                        00003190
                                                                        00003200
                                                                        00003210
        UP_PROC:                                                        00003220
          PROC;                                                         00003230
          %INCLUDE P0010601;                                            00003240
          %INCLUDE R0010606;                                            00003250
          %INCLUDE R0010607;                                            00003260
                                                                        00003270
           IF ^W01_YSKADE THEN                                          00003280
              DO;                                                       00003290
                 CALL OVERFØR_UPSØKER_MAP;          /* R0010606 */      00003300
                 IF UPS.NORSK_BOSATT = 'N' ! UPS.VILKÅR_8_1 ='N' THEN   00003310
                    DO;                                                 00003320
                       CALL TEKST_SPES;             /* R0010607 */      00003330
                       CALL OVERFØR_UPSPES_MAP;     /* R0010606 */      00003340
                    END;                                                00003350
                 IF UPS.BT_ANT > 0 THEN                                 00003360
                    DO;                                                 00003370
                       CALL TEKST_BARN;             /* R0010607 */      00003380
                       CALL OVERFØR_UPBARN_MAP;     /* R0010606 */      00003390
                    END;                                                00003400
                                                                        00003410
                 IF UPS.YSKADE_TILLEGG = 'J' THEN                       00003420
                    DO;                                                 00003430
                       W01_YSKADE = '1'B;                               00003440
                       W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1;           00003450
                    END;                                                00003460
            /*   ELSE                                                   00003470
         FREE TRANS_OMR,TRANS_OPPL_OMR;  ENDRET SATISH 6.6.94 */        00003480
                                                                        00003490
                 S001061O.DUMMYA = 'Ø';             /* PROT,DARK  */    00003500
                 EXEC CICS SEND MAP('S001061') MAPSET('S001F13') ACCUM  00003510
                                                        PAGING ERASE;   00003520
              END;                                                      00003530
           ELSE                                                         00003540
              DO;                                                       00003550
                                                                        00003560
                 CALL OVERFØR_YP_MAP;               /* R0010606 */      00003570
                                                                        00003580
                 W01_YSKADE = '0'B;                                     00003590
                                                                        00003600
                 S001201O.DUMMYA = 'Ø';             /* PROT,DARK  */    00003610
         /*  FREE TRANS_OMR,TRANS_OPPL_OMR;  ENDRET SATISH 6.6.94 */    00003620
                 EXEC CICS SEND MAP('S001201') MAPSET('S001F13') ACCUM  00003630
                                                  PAGING   ERASE;       00003640
                                                                        00003650
              END;                                                      00003660
                                                                        00003670
        END UP_PROC;                                                    00003680
                                                                        00003690
                                                                        00003700
        US_PROC:                                                        00003710
          PROC;                                                         00003720
          %INCLUDE P0010701;   /* TRANS_OMRÅDE US           */          00003730
                                                                        00003740
                               /* US_TRANS TIL MAP, OVERF.  */          00003750
          %INCLUDE R0010706;   /* FORTEKSTER OG ATTRIBUTTER */          00003760
                                                                        00003770
           CALL OVERFØR_USSØKER_MAP;   /* R0010706 */                   00003780
           S001071O.DUMMYA = 'Ø';     /* PROT,DARK  */                  00003790
      /*   FREE TRANS_OMR,TRANS_OPPL_OMR;  ENDRET SATISH 6.6.94 */      00003800
                                                                        00003810
           /* SKRIVER SKJERMBILDE GRUNNBLANKETT-USTRANS */              00003820
                                                                        00003830
           EXEC CICS SEND MAP('S001071') MAPSET('S001F13') ACCUM        00003840
                                                    PAGING   ERASE;     00003850
                                                                        00003860
        END US_PROC;                                                    00003870
                                                                        00003880
        EP_PROC:                                                        00003890
          PROC;                                                         00003900
          %INCLUDE P0010801;   /* TRANS_OMRÅDE EP  */                   00003910
          %INCLUDE R0010806;   /* EP_TRANS TIL MAP */                   00003920
          %INCLUDE R0010807;   /* OVERF. FORTEKSTER OG ATTRIBUTTER */   00003930
                                                                        00003940
           IF ^W01_YSKADE THEN                                          00003950
              DO;                                                       00003960
                                                                        00003970
                 /* INTERN PROC I R0010806: OVERFØRING EP-DELEN */      00003980
                                                                        00003990
                 CALL OVERFØR_EPSØKER_MAP;                              00004000
                 IF EPS.NORSK_BOSATT = 'N' THEN                         00004010
                    DO;                                                 00004020
                                                                        00004030
                       /* INTERN PROC I R0010807: FORTEKSTER OG    */   00004040
                       /*                   ATTRIBUTTER I SPES-DEL */   00004050
                                                                        00004060
                       CALL TEKST_SPES_SØKER;                           00004070
                                                                        00004080
                       /* INTERN PROC I R0010806: OVERFØRING SPES_DEL */00004090
                                                                        00004100
                       CALL OVERFØR_EPSPES_SØKER_MAP;                   00004110
                    END;                                                00004120
                 IF EPS.NORSK_BOSATT_EK = 'N' THEN                      00004130
                    DO;                                                 00004140
                                                                        00004150
                       /* INTERN PROC I R0010807: FORTEKSTER OG    */   00004160
                       /*  ATTRIBUTTER I SPESIELL DEL AVDØDE       */   00004170
                                                                        00004180
                       CALL TEKST_SPES_AVDØDE;                          00004190
                                                                        00004200
                       /* INTERN PROC I R0010806:                  */   00004210
                       /* OVERFØRING SPES-DEL AVD                  */   00004220
                                                                        00004230
                       CALL OVERFØR_EPSPES_AVDØDE_MAP;                  00004240
                    END;                                                00004250
                 IF EPS.YSKADE_TILLEGG = 'J' THEN                       00004260
                    DO;                                                 00004270
                                                                        00004280
                       W01_YSKADE = '1'B;                               00004290
                       W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1;           00004300
                    END;                                                00004310
            /*   ELSE                                                   00004320
                    FREE TRANS_OMR,TRANS_OPPL_OMR;                      00004330
              ENDRET SATISH 6.6.94 */                                   00004340
                                                                        00004350
                 S001081O.DUMMYA = 'Ø'; /* PROT,DARK */                 00004360
                                                                        00004370
                 /* SKRIVER SKJERMBILDE GRUNNBLANKETT-EPTRANS */        00004380
                                                                        00004390
                 EXEC CICS SEND MAP('S001081') MAPSET('S001F13') ACCUM  00004400
                                                  PAGING   ERASE;       00004410
              END;                                                      00004420
           ELSE                                                         00004430
              DO;                                                       00004440
                 CALL OVERFØR_EPY_MAP;             /* R0010806 */       00004450
                                                                        00004460
                 W01_YSKADE     = '0'B;                                 00004470
                                                                        00004480
                 S001201O.DUMMYA = 'Ø';              /* PROT,DARK */    00004490
       /*   FREE TRANS_OMR,TRANS_OPPL_OMR;  ENDRET SATISH 6.6.94 */     00004500
                 EXEC CICS SEND MAP('S001201') MAPSET('S001F13') ACCUM  00004510
                                               PAGING ERASE;            00004520
              END;                                                      00004530
                                                                        00004540
        END EP_PROC;                                                    00004550
                                                                        00004560
                                                                        00004570
        EF_PROC:                                                        00004580
          PROC;                                                         00004590
          %INCLUDE P0010901;   /* TRANS_OMRÅDE EF  */                   00004600
          %INCLUDE R0010906;   /* EF_TRANS TIL MAP */                   00004610
          %INCLUDE R0010907;   /* OVERF. FORTEKSTER OG ATTRIBUTTER */   00004620
                                                                        00004630
                                                                        00004640
           /* INTERN PROC I R0010906: OVERFØRING EF-DELEN          */   00004650
                                                                        00004660
           CALL OVERFØR_EFSØKER_MAP;                                    00004670
           IF EFS.NORSK_BOSATT = 'N' THEN                               00004680
              DO;                                                       00004690
                                                                        00004700
                 /* INTERN PROC I R0010907: FORTEKSTER OG          */   00004710
                 /*                         ATTRIBUTTER I SPES-DEL */   00004720
                                                                        00004730
                 CALL TEKST_SPES;                                       00004740
                                                                        00004750
                 /* INTERN PROC I R0010906: OVERFØRING SPES_DEL    */   00004760
                                                                        00004770
                 CALL OVERFØR_EFSPES_MAP;                               00004780
              END;                                                      00004790
           S001091O.DUMMYA = 'Ø';     /* PROT,DARK  */                  00004800
     /*    FREE TRANS_OMR,TRANS_OPPL_OMR;  ENDRET SATISH 6.6.94 */      00004810
                                                                        00004820
           /* SKRIVER SKJERMBILDE GRUNNBLANKETT-EFTRANS */              00004830
                                                                        00004840
           EXEC CICS SEND MAP('S001091') MAPSET('S001F13') ACCUM        00004850
                                                  PAGING   ERASE;       00004860
                                                                        00004870
        END EF_PROC;                                                    00004880
                                                                        00004890
                                                                        00004900
        FB_PROC:                                                        00004910
          PROC;                                                         00004920
          %INCLUDE P0011001;   /* TRANS_OMRÅDE FB           */          00004930
                                                                        00004940
                               /* FB_TRANS TIL MAP, OVERF.  */          00004950
          %INCLUDE R0011006;   /* FORTEKSTER OG ATTRIBUTTER */          00004960
                                                                        00004970
          DCL                                                           00004980
             SISTE_GANG       BIT(1) INIT('1'B);                        00004990
                                                                        00005000
           IF ^W01_YSKADE THEN                                          00005010
              DO;                                                       00005020
                                                                        00005030
                 /* INTERN PROC I R0011006: OVERFØRING FB_BARNE_DEL */  00005040
                                                                        00005050
                 CALL OVERFØR_FB_BARN_MAP;                              00005060
                                                                        00005070
                 /* INTERN PROC I R0011006: OVERFØRING FB_MOR_DEL  */   00005080
                                                                        00005090
                 CALL OVERFØR_FB_MOR_MAP;                               00005100
                                                                        00005110
                 /* INTERN PROC I R0011006: OVERFØRING FB_FAR_DEL  */   00005120
                                                                        00005130
                 CALL OVERFØR_FB_FAR_MAP;                               00005140
                                                                        00005150
                 IF BARNE_TAB_POS = '1' & BARN.FNR_B(5) > 0 THEN        00005160
                    DO;                                                 00005170
                       SISTE_GANG = '0'B;                               00005180
                       BARNE_TAB_POS = '2';                             00005190
                       START   = START - 1;                             00005200
                       I       = I - 1;                                 00005210
                    END;                                                00005220
                 ELSE                                                   00005230
                    IF BARNE_TAB_POS = '2' & BARN.FNR_B(9) > 0 THEN     00005240
                       DO;                                              00005250
                          SISTE_GANG = '0'B;                            00005260
                          BARNE_TAB_POS = '3';                          00005270
                          START   = START - 1;                          00005280
                          I       = I - 1;                              00005290
                       END;                                             00005300
                                                                        00005310
                 IF SISTE_GANG THEN                                     00005320
                    DO;                                                 00005330
                       IF MOR.YSKADE_TILLEGG_M  ^= 'J' &                00005340
                          FAR.YSKADE_TILLEGG_F  ^= 'J' THEN             00005350
           /*   FREE TRANS_OMR,TRANS_OPPL_OMR;  ENDRET SATISH 6.6.94 */ 00005360
                                                                        00005370
                       IF MOR.YSKADE_TILLEGG_M  = 'J' THEN              00005380
                          DO;                                           00005390
                             W01_YSKADE = '1'B;                         00005400
                             W01_MOR_BEHANDLES = '1'B;                  00005410
                             I                 =  I - 1;                00005420
                          END;                                          00005430
                                                                        00005440
                       IF FAR.YSKADE_TILLEGG_F  = 'J' THEN              00005450
                          DO;                                           00005460
                             W01_YSKADE = '1'B;                         00005470
                             IF ^W01_MOR_BEHANDLES THEN                 00005480
                                DO;                                     00005490
                                   W01_MOR_BEHANDLES = '1'B;            00005500
                                   I                 =  I - 1;          00005510
                                END;                                    00005520
                          END;                                          00005530
                    END;                                                00005540
                                                                        00005550
                                                                        00005560
                 /* SKRIVER SKJERMBILDE GRUNNBLANKETT-FBTRANS */        00005570
                                                                        00005580
                 S001101O.DUMMYA = 'Ø'; /* PROT,DARK */                 00005590
                 EXEC CICS SEND MAP('S001101') MAPSET('S001F13') ACCUM  00005600
                                                        PAGING ERASE;   00005610
              END;                                                      00005620
           ELSE                                                         00005630
              DO;                                                       00005640
                                                                        00005650
                 IF W01_MOR_BEHANDLES   THEN                            00005660
                    DO;                                                 00005670
                       CALL OVERFØR_FBY_MOR_MAP;                        00005680
                       IF FAR.YSKADE_TILLEGG_F ^= 'J' THEN              00005690
                          DO;                                           00005700
                             W01_YSKADE = '0'B;                         00005710
           /* FREE TRANS_OMR,TRANS_OPPL_OMR;  ENDRET SATISH 6.6.94 */   00005720
                          END;                                          00005730
                                                                        00005740
                       S001201O.DUMMYA = 'Ø';  /* PROT,DARK */          00005750
                       EXEC CICS SEND          MAP('S001201')           00005760
                                                     MAPSET('S001F13')  00005770
                                                     ACCUM PAGING ERASE;00005780
                       W01_MOR_BEHANDLES = '0'B;                        00005790
                    END;                                                00005800
                                                                        00005810
                 IF W01_FAR_BEHANDLES   THEN                            00005820
                    DO;                                                 00005830
                       W01_FAR_BEHANDLES = '0'B;                        00005840
                       CALL OVERFØR_FBY_FAR_MAP;                        00005850
                       W01_YSKADE = '0'B;                               00005860
         /*  FREE TRANS_OMR,TRANS_OPPL_OMR;  ENDRET SATISH 6.6.94 */    00005870
                       S001201O.DUMMYA = 'Ø';         /* PROT,DARK */   00005880
                       EXEC CICS SEND MAP('S001201') MAPSET('S001F13')  00005890
                                                     ACCUM PAGING ERASE;00005900
                    END;                                                00005910
                 ELSE                                                   00005920
                    IF FAR.YSKADE_TILLEGG_F = 'J' THEN                  00005930
                       DO;                                              00005940
                          W01_FAR_BEHANDLES = '1'B;                     00005950
                          I = I - 1;                                    00005960
                       END;                                             00005970
              END;                                                      00005980
                                                                        00005990
        END FB_PROC;                                                    00006000
                                                                        00006010
        BP_PROC:                                                        00006020
          PROC;                                                         00006030
          %INCLUDE P0011101;   /* TRANS_OMRÅDE BP-TRANS     */          00006040
                                                                        00006050
                               /* BP_TRANS TIL MAP, OVERF.  */          00006060
          %INCLUDE R0011106;   /* FORTEKSTER OG ATTRIBUTTER */          00006070
                                                                        00006080
                                                                        00006090
           /* INTERN PROC I R0011106: OVERFØRING BP_BARNE_DEL      */   00006100
                                                                        00006110
           CALL OVERFØR_BP_MAP;                                         00006120
           S001111O.DUMMYA = 'Ø';     /* PROT,DARK  */                  00006130
     /*    FREE TRANS_OMR,TRANS_OPPL_OMR;  ENDRET SATISH 6.6.94 */      00006140
                                                                        00006150
           /* SKRIVER SKJERMBILDE GRUNNBLANKETT-BPTRANS */              00006160
                                                                        00006170
           EXEC CICS SEND MAP('S001111') MAPSET('S001F13') ACCUM        00006180
                                                  PAGING   ERASE;       00006190
                                                                        00006200
        END BP_PROC;                                                    00006210
                                                                        00006220
        FT_PROC:                                                        00006230
          PROC;                                                         00006240
          %INCLUDE P0011201;/* TRANS_OMRÅDE TIL FT_TRANS */             00006250
          %INCLUDE R0011206;/* FT_TRANS TIL MAP          */             00006260
          %INCLUDE R0011207;/* OVERF.FORTEKSTER OG ATTR.B*/             00006270
                                                                        00006280
                                                                        00006290
           /* INTERN PROC I R0011206: OVERFØRING FT_SØKER_DEL      */   00006300
                                                                        00006310
           CALL OVERFØR_FT_SØKER_MAP;                                   00006320
           S001121O.DUMMYA = 'Ø';     /* PROT,DARK  */                  00006330
           IF TRANS_OMR.FTS.BT_ANT > 0 THEN                             00006340
              DO;                                                       00006350
                                                                        00006360
                 /* INTERN PROC I R0011207: FORTEKSTER OG          */   00006370
                 /*                         ATTRIBUTTER I BARNEDEL */   00006380
                                                                        00006390
                 CALL TEKST_BARN;                                       00006400
                                                                        00006410
                 /* INTERN PROC I R0011206: OVERFØRING FT_BARNE_DEL*/   00006420
                                                                        00006430
                 CALL OVERFØR_FT_BARN_MAP;                              00006440
              END;                                                      00006450
                                                                        00006460
        /* FREE TRANS_OMR,TRANS_OPPL_OMR;  ENDRET SATISH 6.6.94 */      00006470
                                                                        00006480
           /* SKRIVER SKJERMBILDE GRUNNBLANKETT-FTTRANS */              00006490
                                                                        00006500
           EXEC CICS SEND MAP('S001121') MAPSET('S001F13') ACCUM        00006510
                                                   PAGING  ERASE;       00006520
                                                                        00006530
        END FT_PROC;                                                    00006540
                                                                        00006550
                                                                        00006560
         AF_PROC:                                                       00006570
           PROC;                                                        00006580
           %INCLUDE P0011901;   /* TRANS_OMRÅDE AF  */                  00006590
           %INCLUDE R0011906;   /* AF_TRANS_TIL_MAP */                  00006600
                                                                        00006610
                                                                        00006620
            /* INTERN PROC I R0011906: OVERFØRING AF-DELEN          */  00006630
                                                                        00006640
            CALL OVERFØR_AFPSØKER_MAP;                                  00006650
            IF AFP.NORSK_BOSATT = 'N' THEN                              00006660
               DO;                                                      00006670
                                                                        00006680
                  /* INTERN PROC I R0011906: OVERFØRING SPES_DEL    */  00006690
                                                                        00006700
                  CALL OVERFØR_AFPSPES_MAP;                             00006710
                                                                        00006720
               END;                                                     00006730
            S001051O.DUMMYA = 'Ø';     /* PROT,DARK  */                 00006740
        /*  FREE TRANS_OMR,TRANS_OPPL_OMR;  ENDRET SATISH 6.6.94 */     00006750
                                                                        00006760
            /* SKRIVER SKJERMBILDE GRUNNBLANKETT-AFPTRANS */            00006770
                                                                        00006780
            EXEC CICS SEND MAP('S001191') MAPSET('S001F13') ACCUM       00006790
                                                   PAGING   ERASE;      00006800
                                                                        00006810
         END AF_PROC;                                                   00006820
                                                                        00006830
                                                                        00006840
        UF_PROC:                                                        00006850
           PROC;                                                        00006860
           %INCLUDE P0011831;   /* TRANS_OMRÅDE UF  */                  00006870
           %INCLUDE R0011836;   /* UF_TRANS_TIL_MAP */                  00006880
                                                                        00006890
            CALL OVERFØR_SØKER_TIL_MAP;                                 00006900
            S001831O.DUMMYA = 'Ø';     /* PROT,DARK  */                 00006910
      /*    FREE TRANS_OMR,TRANS_OPPL_OMR;  ENDRET SATISH 6.6.94 */     00006920
                                                                        00006930
            /* SKRIVER SKJERMBILDE GRUNNBLANKETT-UFTRANS */             00006940
                                                                        00006950
            EXEC CICS SEND MAP('S001831') MAPSET('S001F13') ACCUM       00006960
                                                   PAGING   ERASE;      00006970
                                                                        00006980
        END UF_PROC;                                                    00006990
                                                                        00007000
                                                                        00007010
        E1_PROC:                                                        00007020
          PROC;                                                         00007030
          %INCLUDE P0011401;   /* TRANS_OMRåDE ENDRINGSBL-1 */          00007040
                               /* E1_TRANS TIL MAP OG            */     00007050
          %INCLUDE R0011406;   /*OVERF. FORTEKSTER OG ATTRIBUTTER*/     00007060
                                                                        00007070
           CALL OVERFØR_E1SØKER_MAP; /* R0011406    */                  00007080
           CALL OVERFØR_E1KAP7_MAP;  /* R0011406    */                  00007090
           CALL OVERFØR_E1KAP8_MAP;  /* R0011406    */                  00007100
           CALL OVERFØR_E1KAP10_MAP;/* R0011406    */                   00007110
           CALL OVERFØR_E1KAP11_MAP;/* R0011406    */                   00007120
           S001141O.DUMMYA = 'Ø';     /* PROT,DARK  */                  00007130
                                                                        00007140
           /*  FREE TRANS_OMR,TRANS_OPPL_OMR    */                      00007150
                                                                        00007160
           /* SKRIVER SKJERMBILDE ENDRINGSBLANKETT-1    */              00007170
                                                                        00007180
           EXEC CICS SEND MAP('S001141') MAPSET('S001F13') ACCUM        00007190
                                                   PAGING  ERASE;       00007200
                                                                        00007210
        END E1_PROC;                                                    00007220
                                                                        00007230
        E2_PROC:                                                        00007240
          PROC;                                                         00007250
          %INCLUDE P0011501;   /* TRANS_OMRåDE ENDRINGSBL-2 */          00007260
                               /* E2_TRANS TIL MAP OG            */     00007270
          %INCLUDE R0011506;   /*OVERF. FORTEKSTER OG ATTRIBUTTER*/     00007280
                                                                        00007290
           CALL OVERFØR_E2SØKER_MAP;   /* R0011506  */                  00007300
           S001151O.DUMMYA = 'Ø';     /* PROT,DARK  */                  00007310
                                                                        00007320
           /*  FREE TRANS_OMR,TRANS_OPPL_OMR    */                      00007330
                                                                        00007340
           /* SKRIVER SKJERMBILDE ENDRINGSBLANKETT-2    */              00007350
                                                                        00007360
           EXEC CICS SEND MAP('S001151') MAPSET('S001F13') ACCUM        00007370
                                                       PAGING  ERASE;   00007380
                                                                        00007390
        END E2_PROC;                                                    00007400
                                                                        00007410
        O1_PROC:                                                        00007420
          PROC;                                                         00007430
          %INCLUDE P0011601;   /* TRANS_OMRåDE OPPHØRSBL-1       */     00007440
                               /* O1_TRANS TIL MAP OG            */     00007450
          %INCLUDE R0011606;   /*OVERF. FORTEKSTER OG ATTRIBUTTER*/     00007460
                                                                        00007470
           CALL OVERFØR_O1_MAP;   /* R0011606      */                   00007480
           S001161O.DUMMYA = 'Ø';     /* PROT,DARK  */                  00007490
           /*  FREE TRANS_OMR,TRANS_OPPL_OMR    */                      00007500
                                                                        00007510
           /* SKRIVER SKJERMBILDE OPPHØRSBLANKETT-1    */               00007520
                                                                        00007530
           EXEC CICS SEND MAP('S001161') MAPSET('S001F13') ACCUM        00007540
                                                   PAGING ERASE;        00007550
                                                                        00007560
        END O1_PROC;                                                    00007570
                                                                        00007580
        O2_PROC:                                                        00007590
          PROC;                                                         00007600
          %INCLUDE P0011701;   /* TRANS_OMRåDE OPPHØRSBL-2       */     00007610
                               /* O2_TRANS TIL MAP OG            */     00007620
          %INCLUDE R0011706;   /*OVERF. FORTEKSTER OG ATTRIBUTTER*/     00007630
                                                                        00007640
           CALL OVERFØR_O2_MAP;   /* R0011706  */                       00007650
           S001171O.DUMMYA = 'Ø';     /* PROT,DARK  */                  00007660
           /*  FREE TRANS_OMR,TRANS_OPPL_OMR    */                      00007670
           EXEC CICS SEND MAP('S001171') MAPSET('S001F13') ACCUM        00007680
                                                   PAGING  ERASE;       00007690
                                                                        00007700
        END O2_PROC;                                                    00007710
                                                                        00007720
    END SELECT_BLANKETTYPE;                                             00007730
                                                                        00007740
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00007750
      PROC(FIXED_DEC_5);                                                00007760
                                                                        00007770
      DCL                                                               00007780
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00007790
                                                                        00007800
   END SKRIV_FEIL;                                                      00007810
                                                                        00007820
   SKRIV_FEIL_YP:                    /**   DUMMY PROC  **/              00007830
      PROC(FIXED_DEC_5);                                                00007840
                                                                        00007850
      DCL                                                               00007860
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00007870
                                                                        00007880
   END SKRIV_FEIL_YP;                                                   00007890
                                                                        00007900
                                                                        00007910
                                                                        00007920
   %INCLUDE R0019912;  /* PIC TIL CHAR OG MOTSATT */                    00007930
                                                                        00007940
                                                                        00007950
                                                                        00007960
                                                                        00007970
 END R001047;                                                           00007980
