 /*       SIST ENDRET 17/04-96 11.27.16 AV   JDA0310                  */00000000
 /*       SIST ENDRET 12/10-95 14.10.20 AV   JDA0310                  */00000010
 /*       SIST ENDRET 10/03-94 14.47.10 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 04/05-92 11.13.54 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 06/03-91 14.32.02 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 18/12-89 12.36.16 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 08/11-89 13.26.30 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 06/09-89 12.01.39 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 27/04-89 14.50.13 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 18/04-89 09.39.04 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 03/05-88 10.29.47 AV   DYBVIK                   */00000100
 R00120:                                                                00000110
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000120
                                                                        00000130
                                                                        00000140
 /* ***************************************************************** */00000150
 /*                                                                   */00000160
 /*IDENTIFIKASJON:                                                    */00000170
 /*     R0012001 - PROSEDYRE I PLI                                    */00000180
 /*     PROGRAMMERER: P. BERGESTAD, MARS 1982                         */00000190
 /*                                                                   */00000200
 /*HENSIKT:                                                           */00000210
 /*     RUTINEN TAR UTGANGSPUNKT I STYRINGSKODEN (BLANKETT REGISTRERT)*/00000220
 /*     OG OVERLATER KONTROLL TIL RUTINEN SOM BESTEMMER OM OG         */00000230
 /*     EVENTUELT HVORDAN "BEHANDLE-TRANS" SKAL ANVENDES.             */00000240
 /*                                                                   */00000250
 /*     DEN FORETAR OGSÅ INITIERINGS-KALLET HVOR PCB-ADDRESSENE       */00000260
 /*     OPPRETTES. FÅR EN FEIL I INITIERINGS-KALLET AVSLUTTES         */00000270
 /*     BEHANDLINGEN OG KONTROLLEN RETURNERES TIL    C I C S .        */00000280
 /*                                                                   */00000290
 /*     TRANSKODEN ER R200.                                           */00000300
 /*                                                                   */00000310
 /*                                                                   */00000320
 /*PROGRAMTILKNYTNING:                                                */00000330
 /*     PROGRAMMET KALLES OPP FRA R0010401 OG R0010480.               */00000340
 /*                                                                   */00000350
 /*BRUK:                                                              */00000360
 /*     EXEC CICS XCTL PROGRAM('R0012001') COMMAREA (KOM_OMR)         */00000370
 /*                                                                   */00000380
 /* ***************************************************************** */00000390
 %PAGE;                                                                 00000400
                                                                        00000410
   DCL                                                                  00000420
      COMMAREA_PEKER PTR;                                               00000430
   DCL                                                                  00000440
      (CSTG , ADDR , UNSPEC , NULL , DATE )       BUILTIN;              00000450
                                                                        00000460
 %SKIP(2);                                                              00000470
      %INCLUDE P0019908;               /*  KOM_OMR         (BASED)  */  00000480
 %SKIP;                                                                 00000490
      %INCLUDE P0019906;               /*  TRANS_OPPL_OMR  (BASED)  */  00000500
 %PAGE;                                                                 00000510
      %INCLUDE P0019910;               /*  STYRINGS_OMR    (BASED)  */  00000520
 %PAGE;                                                                 00000530
      %INCLUDE P0019912;               /*  DIV_PARAM_OMR   (BASED)  */  00000540
 %PAGE;                                                                 00000550
      %INCLUDE P0019924;               /* G_V_TAB                   */  00000560
 %PAGE;                                                                 00000570
      %INCLUDE P0019925;               /* G_TAB                     */  00000580
    /*                                                                  00000590
    */                                                                  00000600
    /* ************************************************************** */00000610
    /*                                                                */00000620
    /*   DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTNINGS-    */00000630
    /*   KALL                                                         */00000640
    /*                                                                */00000650
    /**************************************************************** */00000660
       DCL                                                              00000670
         PLITDLI                     ENTRY;                             00000680
                                                                        00000690
       DCL                                                              00000700
         1 W001_DLI                  UNALIGNED,                         00000710
                                                                        00000720
           2  W01_PSB_R001           CHAR (8)       INIT('B001R001'),   00000730
           2  W01_PSB_NAVN           CHAR (8)       INIT('        '),   00000740
           2  W01_PCB_FUNCTION       CHAR (4)       INIT('PCB '),       00000750
           2  W01_TERM_FUNCTION      CHAR (4)       INIT('TERM'),       00000760
           2  S_MELDNR               PIC '9'        INIT( 0 ),          00000770
           2  W01_PARM_CT_1          FIXED BIN(31)  INIT(1),            00000780
           2  W01_PARM_CT_3          FIXED BIN(31)  INIT(3);            00000790
                                                                        00000800
    /* ************************************************************** */00000810
    /*                                                                */00000820
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000830
    /*                                                                */00000840
    /* ************************************************************** */00000850
                                                                        00000860
    %INCLUDE DLIUIB;                                                    00000870
                                                                        00000880
       DCL                                                              00000890
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00000900
                                                                        00000910
                                                                        00000920
    /* ************************************************************** */00000930
    /*                                                                */00000940
    /*   PCB- OG UIB-OMR.                                             */00000950
    /*                                                                */00000960
    /* ************************************************************** */00000970
                                                                        00000980
    %INCLUDE  P0012002;                  /* PCB-UIB-PEKER OMR  BASED  */00000990
    %INCLUDE  P0014009;                  /* POTALL_OPPL   BASED  */     00001000
                                                                        00001010
                                                                        00001020
    /* ************************************************************** */00001030
    /*   FEILMELDINGS-LINJE .                                         */00001040
    /* ************************************************************** */00001050
                                                                        00001060
    DCL   W01_UTLINJE           CHAR (78)     INIT ( (78)' ' );         00001070
                                                                        00001080
                                                                        00001090
    DCL GRUNN_OMR1         CHAR      (1202);                            00001100
    DCL GRUNN_OMR2         CHAR      (1202);                            00001110
    DCL GRUNN_IDENT        CHAR      ( 8);                              00001120
                                                                        00001130
                                                                        00001140
    /* ************************************************************** */00001150
    /*                                                                */00001160
    /*   SLUTT PÅ DEKLARASJONENE .   EKSEKVERINGEN STARTER            */00001170
    /*                                                                */00001180
    /* ************************************************************** */00001190
                                                                        00001200
    ALLOCATE                    POTALL_OPPL  ;                          00001210
    ALLOCATE                    GV_TAB_RE    ;                          00001220
    ALLOCATE                    G_TAB_RE     ;                          00001230
    KOM_OMR.GV_PEKER         = ADDR (GRUNN_OMR1 ) ;                     00001240
    KOM_OMR.G_PEKER          = ADDR (GRUNN_OMR2 ) ;                     00001250
    POTALL_OPPL              =  ''           ;                          00001260
    GV_TAB_RE                =  ''           ;                          00001270
    G_TAB_RE                 =  ''           ;                          00001280
 /* W01_PSB_NAVN             =  W01_PSB_R001 ; */                       00001290
       W01_PSB_NAVN     =  DIV_PARAM_OMR.PSB_NAVN;                      00001300
                                                                        00001310
                                                                        00001320
                                                                        00001330
                                                                        00001340
    GRUNN_IDENT                     = 'P0019924';                       00001350
                                                                        00001360
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                      00001370
                                                                        00001380
    GRUNN_IDENT                     = 'P0019925';                       00001390
                                                                        00001400
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                      00001410
                                                                        00001420
                                                                        00001430
                                                                        00001440
    IF KOM_OMR.PCB_UIB_PEKER =  NULL THEN                               00001450
       CALL ÅPNE_DATABASE;                                              00001460
    ELSE                                                                00001470
       UIBPTR =  PCB_UIB_PEKER_OMR.UIB_PEKER;                           00001480
                                                                        00001490
                                                                        00001500
    SELECT(STYREKODE);                                                  00001510
                                                                        00001520
                                                                        00001530
         WHEN ( 'E2' , 'TG' )                                           00001540
            DO;                                                         00001550
               EXEC CICS LINK PROGRAM('R0011520') COMMAREA(KOM_OMR);    00001560
               TRANSKODE = 'R041';                                      00001570
            END;                                                        00001580
                                                                        00001590
         WHEN ( 'EP' , 'FB' , 'BP', 'B6', 'E3','EE' )                   00001600
            DO;                                                         00001610
                                                                        00001620
               KJØRINGS_TYPE = 'O';                                     00001630
               EXEC CICS LINK PROGRAM('R0012201') COMMAREA(KOM_OMR);    00001640
               TRANSKODE = 'R041';                                      00001650
            END;                                                        00001660
         WHEN ('US')                                                    00001670
            DO;                                                         00001680
               EXEC CICS LINK PROGRAM('R0016101') COMMAREA(KOM_OMR);    00001690
               TRANSKODE = 'R041';                                      00001700
            END;                                                        00001710
         WHEN ('AU')                                                    00001720
            DO;                                                         00001730
                                                                        00001740
               KJØRINGS_TYPE = 'O';                                     00001750
               EXEC CICS LINK PROGRAM('R0011820') COMMAREA(KOM_OMR);    00001760
               TRANSKODE = TRANS_RETURKODE;                             00001770
            END;                                                        00001780
                                                                        00001790
         WHEN ('NI')                                                    00001800
            DO;                                                         00001810
               EXEC CICS LINK PROGRAM('R001I501') COMMAREA(KOM_OMR);    00001820
               TRANSKODE = TRANS_RETURKODE;                             00001830
            END;                                                        00001840
                                                                        00001850
         OTHERWISE                                                      00001860
            DO;                                                         00001870
                                                                        00001880
               IF STYREKODE = 'O2'             &                        00001890
                                                                        00001900
                  TRANSTYPE = 68               THEN                     00001910
                                                                        00001920
                  DO;                                                   00001930
                                                                        00001940
                    EXEC CICS LINK PROGRAM('R0016501')COMMAREA(KOM_OMR);00001950
                     TRANSKODE = 'R041';                                00001960
                                                                        00001970
                  END;                                                  00001980
                                                                        00001990
               ELSE                                                     00002000
                                                                        00002010
                  DO;                                                   00002020
                                                                        00002030
                                                                        00002040
                    KJØRINGS_TYPE = 'O';                                00002050
                    EXEC CICS LINK PROGRAM('R0013001')COMMAREA(KOM_OMR);00002060
                                                                        00002070
                     IF TRANS_RETURKODE = 'R040' THEN                   00002080
                        TRANSKODE = 'R040';                             00002090
                     ELSE                                               00002100
                        TRANSKODE = 'R041';                             00002110
                                                                        00002120
                  END;                                                  00002130
                                                                        00002140
            END;   /* SLUTT PÅ 'OTHERWISE' */                           00002150
                                                                        00002160
      END;     /* SLUTT PÅ 'SELECT (STYREKODE)' */                      00002170
                                                                        00002180
                                                                        00002190
            /* ****************************************************** */00002200
            /* SKRIV STATISTIKK REPORT FOR REGISTERING                */00002210
            /* ****************************************************** */00002220
          CALL UPDATE_STATISTIKK_REG (STYREKODE);                       00002230
                                                                        00002240
    /* ************************************************************** */00002250
    /*                                                                */00002260
    /*   TERMINERINGSKALLET FOR PCB'ENE                               */00002270
    /*                                                                */00002280
    /* ************************************************************** */00002290
                                                                        00002300
                                                                        00002310
    IF FUNKSJONSKODE = 'V' !                                            00002320
       FUNKSJONSKODE = 'B' THEN                                         00002330
       DO;                                                              00002340
          TRANSKODE = 'R48B';                                           00002350
                                                                        00002360
                                                                        00002370
          CALL      PLITDLI               (W01_PARM_CT_1,               00002380
                                           W01_TERM_FUNCTION);          00002390
          KOM_OMR.PCB_UIB_PEKER = NULL;                                 00002400
                                                                        00002410
                                                                        00002420
          EXEC CICS  XCTL  PROGRAM('R0010480')  COMMAREA(KOM_OMR);      00002430
       END;                                                             00002440
    ELSE                                                                00002450
       DO;                                                              00002460
                                                                        00002470
          CALL   PLITDLI                        (W01_PARM_CT_1,         00002480
                                                 W01_TERM_FUNCTION);    00002490
                                                                        00002500
          EXEC CICS  XCTL  PROGRAM('R0010401')  COMMAREA(KOM_OMR);      00002510
                                                                        00002520
       END;                                                             00002530
                                                                        00002540
                                                                        00002550
 ÅPNE_DATABASE:                                                         00002560
   PROC;                                                                00002570
    CALL   PLITDLI                              (W01_PARM_CT_3,         00002580
                                                 W01_PCB_FUNCTION,      00002590
                                                 W01_PSB_NAVN,          00002600
                                                 UIBPTR);               00002610
                                                                        00002620
                                                                        00002630
    IF DLIUIB.UIBFCTR                      ^=    UIB_RC_OK       THEN   00002640
      DO;                                                               00002650
        /* ********************************************************** */00002660
        /*                                                            */00002670
        /*     FEIL I INITIERINGKALL                                  */00002680
        /*                                                            */00002690
        /* ********************************************************** */00002700
                                                                        00002710
        W01_UTLINJE    =    'FEIL VED INITIERINGS-KALLET :'         !!  00002720
                            '     UIBFCTR = ' !!  UNSPEC (UIBFCTR)  !!  00002730
                            '     UIBDLTR = ' !!  UNSPEC (UIBDLTR)  ;   00002740
                                                                        00002750
        EXEC CICS SEND TEXT FROM ( W01_UTLINJE )  ACCUM  PAGING ERASE   00002760
                       JUSTIFY   ( 14          )  ;                     00002770
        EXEC CICS SEND PAGE;                                            00002780
        EXEC CICS      RETURN;                                          00002790
                                                                        00002800
      END;                                                              00002810
                                                                        00002820
    ALLOCATE  PCB_UIB_PEKER_OMR;                                        00002830
                                                                        00002840
    /* ********************************************************** */    00002850
    /*                                                            */    00002860
    /*  SETTER  PCB_PEKER  =  UIBPCBAL  FRA INITIERINGS-KALLET    */    00002870
    /*                                                            */    00002880
    /* ********************************************************** */    00002890
                                                                        00002900
    PCB_UIB_PEKER_OMR.UIB_PEKER          =    UIBPTR  ;                 00002910
    PCB_UIB_PEKER_OMR.PCB_PEKER          =    UIBPCBAL;                 00002920
                                                                        00002930
 END ÅPNE_DATABASE;                                                     00002940
                                                                        00002950
    /* ************************************************************** */00002960
    /*                                                                */00002970
    /*   PROC FOR OPPTATERING AV STATISTIKK REG.                      */00002980
    /*                                                                */00002990
    /*   ENDERET AV SATISH 050489                                     */00003000
    /*                                                                */00003010
    /* ************************************************************** */00003020
                                                                        00003030
 %PAGE;                                                                 00003040
 %INCLUDE R0019956;          /*     P9956_BER_G_CICS    */              00003050
                                                                        00003060
 %INCLUDE R0012004;          /*     STATISKK-REG        */              00003070
                                                                        00003080
                                                                        00003090
   END R00120;                                                          00003100
