 /*       SIST ENDRET 05/12-97 12.38.03 AV   JDA7339                  */00000000
 /*       SIST ENDRET 27/11-97 11.46.02 AV   JDA7339                  */00000010
 /*       SIST ENDRET 25/02-97 11.48.07 AV   JDA7339                  */00000020
 /*       SIST ENDRET 05/02-96 12.31.39 AV   JDA0310                  */00000030
 /*       SIST ENDRET 09/01-96 14.28.02 AV   JDA0310                  */00000040
 /* ***************************************************************** */00000050
 /*IDENTIFIKASJON:                                                    */00000060
 /* **********************                                            */00000070
 /*  PROGRAM-IDENT : R0010412  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000080
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000090
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000100
 /*  PROGRAMMET BLE LAGET : DESEMBER 1982                             */00000110
 /*  ENDRINGSDATO : 31.08.89                                          */00000120
 /*  ENDRINGEN GJELDER: AFP - UNGE UFØRE FØR 1967                     */00000130
 /*  ENDRINGEN BLE UTFØRT AV : TRUDE                                  */00000140
 /*                                                                   */00000150
 /* ***************************************************************** */00000160
 /*HENSIKT:                                                           */00000170
 /* **********                                                        */00000180
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000190
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000200
 /*    FORHÅND.                                                       */00000210
 /*    ALLE MAPS HØRER INN UNDER MAPSET 'S001F2'.                     */00000220
 /*                                                                   */00000230
 /* ***************************************************************** */00000240
 /*PROGRAMTILKNYTTING:                                                */00000250
 /* ********************                                              */00000260
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010410 - FORESPØRSEL ELLER */00000270
 /*                                  FRA R0010450 - ENDRINGER.        */00000280
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000290
 /*    BRUK :                                                         */00000300
 /*    EXEC CICS XCTL PROGRAM ('R0010412') COMMAREA(KOM_OMR);         */00000310
 /*    PROGRAMMET INCLUDER :                                          */00000320
 /*               R0010506   FLYTT FRA ARB.OMRÅDE TIL MAP    AP       */00000330
 /*               R0010507   FORTEKSTER OG ATTRIBUTTER       AP       */00000340
 /*               R0010606   FLYTT FRA ARB.OMRÅDE TIL MAP    UP       */00000350
 /*               R0010607   FORTEKSTER OG ATTRIBUTTER       UP       */00000360
 /*               R0010706   FLYTT FRA ARB.OMRÅDE TIL MAP    ST       */00000370
 /*               R0010806   FLYTT FRA ARB.OMRÅDE TIL MAP    EP       */00000380
 /*               R0010807   FORTEKSTER OG ATTRIBUTTER       EP       */00000390
 /*               R0010906   FLYTT FRA ARB.OMRÅDE TIL MAP    EF       */00000400
 /*               R0010907   FORTEKSTER OG ATTRIBUTTER       EF       */00000410
 /*               R0011006   FLYTT FRA ARB.OMRÅDE TIL MAP    FB       */00000420
 /*               R0011106   FLYTT FRA ARB.OMRÅDE TIL MAP    BP       */00000430
 /*               R001NB06   FLYTT FRA ARB.OMRÅDE TIL MAP    B6       */00000440
 /*               R0011206   FLYTT FRA ARB.OMRÅDE TIL MAP    FT       */00000450
 /*               R0011207   FORTEKSTER OG ATTRIBUTTER       FT       */00000460
 /*               R0011406   FLYTT FRA ARB.OMRÅDE TIL MAP    E1       */00000470
 /*               R001UE06   FLYTT FRA ARB.OMRÅDE TIL MAP    EN       */00000480
 /*               R0011506   FLYTT FRA ARB.OMRÅDE TIL MAP    E2       */00000490
 /*               R0011606   FLYTT FRA ARB.OMRÅDE TIL MAP    O1       */00000500
 /*               R0011706   FLYTT FRA ARB.OMRÅDE TIL MAP    O2       */00000510
 /*               R0011836   FLYTT FRA ARB.OMRÅDE TIL MAP    UF       */00000520
 /*               R0019912   PIC TIL CHAR OG MOTSATT                  */00000530
 /*                                                                   */00000540
 /* ***************************************************************** */00000550
 /*DATASETTOPPLYSNINGER:                                              */00000560
 /* ***********************                                           */00000570
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000580
 /*                                                                   */00000590
 /* ***************************************************************** */00000600
 /*FEILMELDINGER:                                                     */00000610
 /* *******************                                               */00000620
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000630
 /*                                                                   */00000640
 /* ***************************************************************** */00000650
                                                                        00000660
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000670
                                                                        00000680
 %PAGE;                                                                 00000690
 %INCLUDE S001F2;    /* MAPPER FOR BLANKETTENE    */                    00000700
 %PAGE;                                                                 00000710
                                                                        00000720
 %INCLUDE P0019906;  /* TRANS-OPPL-OMRÅDE (BASED) */                    00000730
 %PAGE;                                                                 00000740
 %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)        */                    00000750
 %PAGE;                                                                 00000760
 %INCLUDE P0019910;  /* STYRINGS - OMRÅDE (BASED) */                    00000770
 %PAGE;                                                                 00000780
 %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE(BASED)   */                    00000790
 %PAGE;                                                                 00000800
 %INCLUDE P0019913;  /* LOKAL - KOM_OMR (BASED)   */                    00000810
 %PAGE;                                                                 00000820
 DCL  FORKASTES      BIT (1)  INIT ('0'B);                              00000830
                                                                        00000840
 DCL                                                                    00000850
    QUENAME                CHAR(8),                                     00000860
       QTERMID             CHAR(4) DEF QUENAME POS(1),                  00000870
       REST                CHAR(4) DEF QUENAME POS(5);                  00000880
                                                                        00000890
 DCL                                                                    00000900
    1 ROUTELIST,                                                        00000910
      2 PRINTER,                                                        00000920
        3 TERMID           CHAR(4),                                     00000930
        3 REST             CHAR(12),                                    00000940
      2 SISTE,                                                          00000950
        3 SLUTT            FIXED BIN(15),                               00000960
        3 REST             CHAR(14);                                    00000970
                                                                        00000980
 DCL      (CSTG,ADDR )                   BUILTIN;                       00000990
                                                                        00001000
 DCL  COMMAREA_PEKER         PTR,                                       00001010
      LOKAL_KOM_PTR          PTR,                                       00001020
      SIDE_TELL              FIXED BIN(15) INIT (1),                    00001030
      LOW_CHAR_BASED        CHAR(1200)  BASED(BMSMAPBR),                00001040
      I                      FIXED BIN(15) INIT (0),                    00001050
      LENGTH                 FIXED BIN(15);                             00001060
                                                                        00001070
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00001080
 DCL                                                                    00001090
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00001100
    DFHBMUNP             CHAR(1) INIT(' '),                             00001110
    DFHBMBRY             CHAR(1) INIT('H'),                             00001120
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00001130
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00001140
    MELDING6O            CHAR(10),                                      00001150
    YMELDING6O           CHAR(10);                                      00001160
                                                                        00001170
                                                                        00001180
 QTERMID        = EIBTRMID;                                             00001190
 REST           = 'COMA';                                               00001200
 ROUTELIST      = '';                                                   00001210
 PRINTER.TERMID = 'R41J';                                               00001220
 SISTE.SLUTT    = -1;                                                   00001230
                                                                        00001240
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00001250
                                                                        00001260
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00001270
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00001280
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00001290
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00001300
                                                                        00001310
                                                                        00001320
 EXEC CICS LOAD PROGRAM('S001F23') SET(MAPSET_PTR); /* TRANS - MAPSET */00001330
 ALLOCATE  LOW_CHAR_BASED;                                              00001340
                                                                        00001350
 EXEC CICS HANDLE CONDITION OVERFLOW(OVERFLOW);                         00001360
                                                                        00001370
                                                                        00001380
                                                                        00001390
    IF FUNKSJONSKODE = 'E' & EIBAID = '8' THEN       /* PF8  */         00001400
       EXEC CICS ROUTE LIST(ROUTELIST);                                 00001410
                                                                        00001420
    /* **    NY LOGIC DEL **************************** */               00001430
      KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =                            00001440
                                 TRANS_OPPL_PTR(W01_TRANS_IND);         00001450
      KOM_OMR.PEKER_LISTE.TRANS_PEKER = TRANS_PTR(W01_TRANS_IND);       00001460
       CALL LOW_VALUES_TIL_MAP;                                         00001470
       CALL SELECT_BLANKETTYPE;                                         00001480
                                                                        00001490
       IF W01_LOOP  = W01_SIDE_ANTALL THEN                              00001500
          SISTE_SIDE  = '1'B;                                           00001510
                                                                        00001520
                                                                        00001530
       /* DETTE BARE FOR Å FÅ SATT OVERFLOW-CONDITION */                00001540
       EXEC CICS SEND MAP('ÅTTELI') MAPSET('S001F23') ACCUM PAGING      00001550
                                                        MAPONLY;        00001560
    /* **    NY LOGIC DEL *HIT TIL******************** */               00001570
                                                                        00001580
                                                                        00001590
    SELECT_BLANKETTYPE:                                                 00001600
      PROC;                                                             00001610
                                                                        00001620
        HOVED_KOM_OMR_PTR  =    COMMAREA_PEKER;                         00001630
        SELECT(TRANS_OPPL_OMR.BLANKETTYPE);                             00001640
                                                                        00001650
                                                                        00001660
           WHEN('A1')                                                   00001670
               DO;                                                      00001680
                EXEC CICS LINK PROGRAM('R00104A1')                      00001690
                                         COMMAREA (LOKAL_KOM_OMR);      00001700
                EXEC CICS SEND MAP('S001N51') MAPSET('S001F23') ACCUM   00001710
                                                  PAGING   ERASE;       00001720
               END;                                                     00001730
           WHEN('U2')                                                   00001740
               DO;                                                      00001750
                EXEC CICS LINK PROGRAM('R00104U2')                      00001760
                                         COMMAREA (LOKAL_KOM_OMR);      00001770
                IF W01_MAP = 'S001N61' THEN                             00001780
                      EXEC CICS SEND MAP('S001N61') MAPSET('S001F23')   00001790
                                                 ACCUM  PAGING   ERASE; 00001800
                ELSE                                                    00001810
                IF W01_MAP = 'S001201' THEN                             00001820
                      EXEC CICS SEND MAP('S001201') MAPSET('S001F23')   00001830
                                                 ACCUM  PAGING   ERASE; 00001840
               END;                                                     00001850
                                                                        00001860
                                                                        00001870
           WHEN('E3')                                                   00001880
               DO;                                                      00001890
                EXEC CICS LINK PROGRAM('R00104E3')                      00001900
                                         COMMAREA (LOKAL_KOM_OMR);      00001910
                IF W01_MAP = 'S001N81' THEN                             00001920
                      EXEC CICS SEND MAP('S001N81') MAPSET('S001F23')   00001930
                                                 ACCUM  PAGING   ERASE; 00001940
                ELSE                                                    00001950
                IF W01_MAP = 'S001201' THEN                             00001960
                      EXEC CICS SEND MAP('S001201') MAPSET('S001F23')   00001970
                                                 ACCUM  PAGING   ERASE; 00001980
               END;                                                     00001990
                                                                        00002000
           WHEN('E4')                                                   00002010
               DO;                                                      00002020
                EXEC CICS LINK PROGRAM('R00104E4')                      00002030
                                         COMMAREA (LOKAL_KOM_OMR);      00002040
                EXEC CICS SEND MAP('S001N91') MAPSET('S001F23')         00002050
                                                 ACCUM  PAGING   ERASE; 00002060
              END;                                                      00002070
                                                                        00002080
           WHEN('B6')                                                   00002090
               DO;                                                      00002100
                EXEC CICS LINK PROGRAM('R00104B6')                      00002110
                                         COMMAREA (LOKAL_KOM_OMR);      00002120
                EXEC CICS SEND MAP('S001NB1') MAPSET('S001F23')         00002130
                                                 ACCUM  PAGING   ERASE; 00002140
              END;                                                      00002150
           WHEN('F7')                                                   00002160
               DO;                                                      00002170
                EXEC CICS LINK PROGRAM('R00104F7')                      00002180
                                         COMMAREA (LOKAL_KOM_OMR);      00002190
                      EXEC CICS SEND MAP('S001NC1') MAPSET('S001F23')   00002200
                                                 ACCUM  PAGING   ERASE; 00002210
               END;                                                     00002220
                                                                        00002230
                                                                        00002240
           OTHERWISE;                                                   00002250
        END;                         /*   SELECT     */                 00002260
                                                                        00002270
                                                                        00002280
                                                                        00002290
                                                                        00002300
    END SELECT_BLANKETTYPE;                                             00002310
                                                                        00002320
                                                                        00002330
 OVERFLOW:                                                              00002340
   CALL LOW_VALUES_TIL_MAP;                                             00002350
   TRAILERO.SIDEO            = TRANS_ANT;                               00002360
   TRAILERO.CICS_INFOO       = CICS_NAVN;                               00002370
   TRAILERO.BLADN_TEKSTO     = 'BLADNINGSKOMMANDO';                     00002380
   IF FUNKSJONSKODE = 'E' THEN                                          00002390
      TRAILERO.MELDINGO = 'DETTE ER FJERNET  !! '                       00002400
                        !!'VENNLIGST IKKE LA BILDET STå LENGE.';        00002410
   IF ^ SISTE_SIDE THEN                                                 00002420
     TRAILERO.BLADN_KOMMANDOO = 'P/N';                                  00002430
   ELSE                                                                 00002440
     DO;                                                                00002450
       TRAILERO.BLADN_KOMMANDOO = 'P/1';                                00002460
       /*                                                               00002470
       IF SIDE_TELL = 1 THEN                                            00002480
         DO;                                                            00002490
           TRAILERO.BLADN_TEKSTO    = (10)' ';                          00002500
           TRAILERO.BLADN_KOMMANDOO = '    ';                           00002510
           TRAILERO.BLADN_KOMMANDOA = '0';  **    ASKIP  **             00002520
         END;                                                           00002530
        */                                                              00002540
     END;                                                               00002550
                                                                        00002560
   EXEC CICS SEND MAP('TRAILER') MAPSET('S001F23') ACCUM PAGING;        00002570
                                                                        00002580
   /***** HIT KOMMER EN BARE DERSOM DET ER MER INFO IGJEN  *****/       00002590
                                                                        00002600
                                                                        00002610
   EXEC CICS RETURN;                                                    00002620
                                                                        00002630
                                                                        00002640
   /********      SLUTT PÅ OVERFLOW - RUTINE     ***********/           00002650
                                                                        00002660
                                                                        00002670
 LOW_VALUES_TIL_MAP:                                                    00002680
   PROC;                                                                00002690
      LOW_CHAR_BASED = (1200)' ';   /* X'00'    */                      00002700
 END LOW_VALUES_TIL_MAP;                                                00002710
                                                                        00002720
                                                                        00002730
 END R001041;                                                           00002740
