 /*       SIST ENDRET 18/05-98 12.59.56 AV   JDA7339                  */00000000
 /*       SIST ENDRET 18/05-98 12.51.33 AV   JDA7339                  */00000010
 /*       SIST ENDRET 14/05-86 09.34.23 AV   DYBVIK                   */00000020
 /* ***************************************************************** */00000030
 /* IDENTIFIKASJON:                                                   */00000040
 /*     R0019955 - P9955_GRUNNBELØP - PROSEDYRE I PLI.                */00000050
 /*     PROGRAMMERER: JAN Y. DYBVIK, DESEMBER 85                      */00000060
 /* HENSIKT:                                                          */00000070
 /*     BEREGNE GRUNNBELØP OG GRUNNBELØP VEIET I BATCHPROGRAM         */00000080
 /* PROGRAMTILKNYTNING:                                               */00000090
 /*     PROSEDYREN BLIR INKLUDERT I PROGRAM SOM BRUKER GRUNNBELØPS-   */00000100
 /*     TABELLEN OG TABELLEN FOR GRUNNBELØP VEIET (KUN BATCH)         */00000110
 /* BRUK:                                                             */00000120
 /*                                                                   */00000130
 /* ***************************************************************** */00000140
 P9955_BER_G_BATC:                                                      00000150
     PROC(W9955_PIDENT,W9955_OMR);                                      00000160
                                                                        00000170
 /* ***************************************************************** */00000180
 /* DIVERSE DEKLARASJONER                                             */00000190
 /* ***************************************************************** */00000200
                                                                        00000210
                                                                        00000220
    DCL INNFIL FILE RECORD INPUT                 KEYED ENV (VSAM);      00000230
                                                                        00000240
    DCL W9955_OMR                                CHAR (1202);           00000250
                                                                        00000260
    DCL W9955_PIDENT                             CHAR    (8);           00000270
                                                                        00000280
    DCL W9955_OMR1                               CHAR (1210);           00000290
    DCL W9955_OMR2  DEF W9955_OMR1  CHAR (1202)  POS (9);               00000300
                                                                        00000310
    DCL W9955_NR                                 PIC '999';             00000320
                                                                        00000330
    DCL W9955_MELDING                            CHAR (80);             00000340
                                                                        00000350
 /* ***************************************************************** */00000360
 /* HER STARTER PROGRAMMET.                                           */00000370
 /* ***************************************************************** */00000380
                                                                        00000390
    ON ERROR SNAP BEGIN;                                                00000400
          W9955_NR           = 500;                                     00000410
          W9955_MELDING      = 'FEIL VED LES';                          00000420
          GOTO L9955;                                                   00000430
    END;                                                                00000440
    OPEN  FILE (INNFIL);                                                00000450
                                                                        00000460
                                                                        00000470
    READ FILE (INNFIL)       INTO (W9955_OMR1)  KEY (W9955_PIDENT);     00000480
                                                                        00000490
    W9955_OMR                                   = W9955_OMR2;           00000500
                                                                        00000510
    CLOSE FILE (INNFIL);                                                00000520
                                                                        00000530
 L9955:                                                                 00000540
                                                                        00000550
 END P9955_BER_G_BATC;                                                  00000560
