 /*       SIST ENDRET 05/12-97 12.29.23 AV   JDA7339                  */00000000
 /*       SIST ENDRET 27/11-97 10.59.21 AV   JDA7339                  */00000010
 /*       SIST ENDRET 09/04-96 09.51.59 AV   HLB0310                  */00000020
 /*       SIST ENDRET 12/07-91 15.01.39 AV   HERMAN                   */00000030
 /*       SIST ENDRET 26/04-91 11.45.59 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 04/01-91 08.43.12 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 25/03-85 09.51.52 AV   OLAV                   */  00000060
 /*       SIST ENDRET 13/06-84 14.04.12 AV   OLAV                   */  00000070
 /*     SIST ENDRET 04/06-84 13.41.46 AV   OLAV                     */  00000080
 /* *************************************************************** */  00000090
 /*IDENTIFIKASJON:                                                  */  00000100
 /*    R0014233 - FUNKSJON  I PLI                                   */  00000110
 /*    PROGRAMMERER: OLAV ØYSTEIN HANSEN 28 MAI 1984                */  00000120
 /*HENSIKT:                                                         */  00000130
 /*    BEREGNE BARNETILLEGG                                         */  00000140
 /*PROGRAMTILKNYTNING:                                              */  00000150
 /*    MODULEN INNGÅR I PROGRAMMENE R0014101, 4201, 4401 OG 4501    */  00000160
 /*                                                                 */  00000170
 /*                                                                 */  00000180
 /*BRUK:                                                            */  00000190
 /*    CALL BEREGN_BT(BT,GRAD)                                      */  00000200
 /*                                                                 */  00000210
 /* *************************************************************** */  00000220
                                                                        00000230
    BEREGN_BT:                                                          00000240
                PROC(BT,GRAD);                                          00000250
                                                                        00000260
       DCL BT        FIXED DEC(5),                                      00000270
           GRAD      FIXED DEC(3);                                      00000280
                                                                        00000290
       DCL ANT_REDU  FIXED DEC(5)            INIT (0);                  00000300
       DCL ANT_FULL  FIXED DEC(5)            INIT (0);                  00000310
       DCL ANT_TT_RED  FIXED DEC(5)          INIT (0);                  00000320
       DCL TT_FAKTOR   FIXED DEC(3)          INIT (0);                  00000330
       DCL W_BT      FIXED DEC(9,1);                                    00000340
                                                                        00000350
       DCL I         FIXED BIN(15);                                     00000360
                                                                        00000370
  /*LOVENDRING OM BEHOVSPRØVET FORSØRGINGSTILLEGG FRA 1.5.91 :*/        00000380
  /* SÅ SNART DET SKAL BEREGNES MED HØYERE GRUNNBELØP ENN     */        00000390
  /* PR 30.4.91, SÅ SKAL ALL BEREGNING SKJE I R0014011        */        00000400
                                                                        00000410
    IF G > 34100 THEN                                                   00000420
       DO;                                                              00000430
          BT = 0;                                                       00000440
          IF B02.FT_SKAL_BEREGNES(BER_SØ_IND) ^= 'J'     THEN           00000450
             B02.FT_SKAL_BEREGNES(BER_SØ_IND) = 'N';                    00000460
          GO TO SLUTT;                                                  00000470
       END;                                                             00000480
                                                                        00000490
    IF B02.PENSJONSTYPE1(BER_EK_IND) = 'G' &                            00000500
       (B02.SIVILSTAND   (BER_EK_IND) = 'G' !                           00000510
        B02.SIVILSTAND   (BER_EK_IND) = 'W'  ) & /*9710 HL*/            00000520
       B02.PENSJONSTYPE2(BER_EK_IND) = 'M'     THEN                     00000530
                                                                        00000540
          /* EKTEFELLEN HAR IKKE PENSJON OG SØKEREN MOTTAR    */        00000550
          /* IKKE EKTEFELLETILLEGG FOR EKTEFELLEN OG          */        00000560
          /* EKTEFELLEN HAR EN INNTEKT SOM ER MINST 4G        */        00000570
                                                                        00000580
  /* ***************                                                    00000590
       DO I = 3 TO 14;                                                  00000600
                                                                        00000610
          IF B02.FNR(I)               >  0  &                           00000620
             B02.STATUS_KODE_HIST(I) ^= 'O' &                           00000630
             B02.PENSJONSTYPE2(I)     = 'R' & ANT_REDU < 3  THEN        00000640
                                                                        00000650
             ANT_REDU = ANT_REDU + 1;                                   00000660
                                                                        00000670
       END;                                                             00000680
                                                                        00000690
  *************************************** */                            00000700
                                                                        00000710
 /*TESTEN OVENFOR ER UTVIDET NEDENFOR.  090496 HL */                    00000720
                                                                        00000730
       DO I = 3 TO 14;                                                  00000740
                                                                        00000750
          IF B02.FNR(I)               >  0  &                           00000760
             B02.STATUS_KODE_HIST(I) ^= 'O'      THEN                   00000770
             IF B02.PENSJONSTYPE2(I)     = 'R'   THEN                   00000780
                ANT_REDU = ANT_REDU + 1;                                00000790
             ELSE                                                       00000800
             DO J = 1 TO 13 WHILE (B02.FNR_TILKN(BER_SØ_IND,J) > 0);    00000810
                IF B02.FNR_TILKN(BER_SØ_IND,J) = B02.FNR(I)   THEN      00000820
                DO;                                                     00000830
                   IF B02.FT_FØR_91(BER_SØ_IND,J) = 'R'    THEN         00000840
                      ANT_REDU = ANT_REDU + 1;                          00000850
                   J = 13;                                              00000860
                END;                                                    00000870
             END;                                                       00000880
       END;                                                             00000890
       IF ANT_REDU > 3 THEN                                             00000900
          ANT_REDU = 3;                                                 00000910
                                                                        00000920
  /* HIT HL*/                                                           00000930
                                                                        00000940
 /*BARNETILLEGG SOM TILSTÅS MED VIRKNING ETTER 1.1.91 SKAL */           00000950
 /*REDUSERES DERSOM TT ER REDUSERT - HL */                              00000960
                                                                        00000970
    TT_FAKTOR = B02.TT_ANV(BER_SØ_IND);                                 00000980
    IF TT_FAKTOR     < 40                    THEN                       00000990
                                                                        00001000
       DO I = 3 TO 14;                                                  00001010
                                                                        00001020
          IF B02.FNR(I)               >  0  &                           00001030
             B02.STATUS_KODE_HIST(I) ^= 'O' &                           00001040
             B02.PENSJONSRETT_FØR_91(I) ^= 'J'        THEN              00001050
                                                                        00001060
             ANT_TT_RED = ANT_TT_RED + 1;                               00001070
                                                                        00001080
       END;                                                             00001090
                                                                        00001100
    IF ANT_TT_RED > 0                            THEN                   00001110
       IF ANT_REDU > 0                         THEN                     00001120
          IF ANT_TT_RED > ANT_REDU               THEN                   00001130
                                                                        00001140
             W_BT = ((ANT_REDU * G * 0.125 * TT_FAKTOR/40)   +          00001150
                     ((ANT_TT_RED - ANT_REDU) * G * 0.25 *              00001160
                          TT_FAKTOR/40)                      +          00001170
                     ((B02.ANTALL_BARN(BER_SØ_IND) - ANT_TT_RED)        00001180
                          * G * 0.25)) * GRAD / 100;                    00001190
                                                                        00001200
          ELSE                                                          00001210
                                                                        00001220
             W_BT = ((ANT_TT_RED * G * 0.125 * TT_FAKTOR/40)   +        00001230
                     ((ANT_REDU - ANT_TT_RED) * G * 0.125)      +       00001240
                     ((B02.ANTALL_BARN(BER_SØ_IND) - ANT_REDU)          00001250
                          * G * 0.25)) * GRAD / 100;                    00001260
                                                                        00001270
       ELSE                                                             00001280
                                                                        00001290
          W_BT = ((ANT_TT_RED * G * 0.25 * TT_FAKTOR/40)   +            00001300
                  ((B02.ANTALL_BARN(BER_SØ_IND) - ANT_TT_RED)           00001310
                             * G * 0.25)) * GRAD / 100;                 00001320
    ELSE                                                                00001330
       W_BT = ((ANT_REDU * G * 0.125)              +                    00001340
               ((B02.ANTALL_BARN(BER_SØ_IND) - ANT_REDU)                00001350
                       * G * 0.25)) * GRAD / 100;                       00001360
                                                                        00001370
    BT   = W_BT / 12 + 0.5;                                             00001380
                                                                        00001390
 SLUTT :                                                                00001400
                                                                        00001410
 END BEREGN_BT;                                                         00001420
