 /*       SIST ENDRET 12/06-98 13.36.17 AV   SPA7339                  */00000000
 /*       SIST ENDRET 29/05-98 12.45.05 AV   JDA7339                  */00000010
 /*       SIST ENDRET 25/05-98 12.38.24 AV   SPA7339                  */00000020
 /*       SIST ENDRET 25/03-98 08.03.09 AV   MHA7339                  */00000030
 /*       SIST ENDRET 20/03-98 10.29.59 AV   MHA7339                  */00000040
 /*       SIST ENDRET 19/03-98 08.25.37 AV   JDA7339                  */00000050
 /*       SIST ENDRET 18/03-98 13.31.16 AV   JDA7339                  */00000060
 /*       SIST ENDRET 14/03-96 15.47.07 AV   HLB0310                  */00000070
 /*       SIST ENDRET 12/10-95 14.14.58 AV   JDA0310                  */00000080
 /*       SIST ENDRET 14/08-95 09.13.14 AV   HLB0310                  */00000090
 /*       SIST ENDRET 03/11-94 09.50.06 AV   HLB0310                  */00000100
 /*       SIST ENDRET 08/09-94 13.17.07 AV   HERMAN                   */00000110
 /*       SIST ENDRET 02/09-94 11.34.39 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 16/08-94 11.36.16 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 25/02-94 17.59.51 AV   HERMAN                   */00000140
 /*       SIST ENDRET 25/02-94 17.59.51 AV   HERMAN                   */00000150
 /* ***************************************************************** */00000160
 /* IDENTIFIKASJON                                                    */00000170
 /*     R0014470 - UP - EØS-REGLER      - HOVEDPROG                   */00000180
 /*     PROGRAMMERER: HERMAN LARSSEN MARS 93.                         */00000190
 /* HENSIKT                                                           */00000200
 /*     BEREGNE UFØREPENSJON ETTER PRO-RATA-REGLER                    */00000210
 /*     OPPDATERER UFØRPENS MED :                                     */00000220
 /*     OPPDATERER STATUS   MED :                                     */00000230
 /*     OPPDATERER EØS      MED :                                     */00000240
 /* PROGRAMTILKNYTNING.                                               */00000250
 /*     PROSEDYREN BLIR LINKET FRA  R0014001                          */00000260
 /* ***************************************************************** */00000270
 UP_EØS :                                                               00000280
    PROC (COMMAREA_PEKER) OPTIONS(MAIN);                                00000290
 DCL   COMMAREA_PEKER PTR;                                              00000300
 /* ----------------------------------------------------------------- */00000310
 /* HENTER INN FORHÅNDSDEKLARERTE "BASER"                             */00000320
 /* -----------------------                                           */00000330
 %INCLUDE P0019906;      /* DEKLARERER TRANS_OPPL_OMR                 */00000340
 %INCLUDE P0019908;      /* DEKLARERER KOM_OMR                        */00000350
 %INCLUDE P0019910;      /* DEKLARERER STYRINGS_OMR                   */00000360
 %INCLUDE P0019912;      /* DEKLARERER DIV_PARA_OMR                   */00000370
 %INCLUDE P0014002;      /* W_POREKKE                                 */00000380
 %INCLUDE P0014003;      /* TAB                                       */00000390
 %INCLUDE P0014009;      /* POREKKE                                   */00000400
 %INCLUDE P0019985;      /* VARIABLER VED EØS BEREGNING               */00000410
 /* ----------------------------------------------------------------- */00000420
 /* BRUKER TIDL. DEKLARASJONER FOR Å OPPRETTE EGNE BASER              */00000430
 /* ----------------------------------------------------------------- */00000440
 DCL 1 B02 BASED (B02_PEKER),                                           00000450
     %INCLUDE P0019921;                                                 00000460
 DCL 1 WSPESOPPL,                                                       00000470
     %INCLUDE P0019939;                                                 00000480
 DCL 1 WEØSINFO,                                                        00000490
     %INCLUDE P0019966;                                                 00000500
 /* ----------------------------------------------------------------- */00000510
 /* DEKLARERER EGNE VARIABLER FOR DENNE PROSEDYREN                    */00000520
 /* ----------------------------------------------------------------- */00000530
 DCL MINSTEVILKÅR                   FIXED DEC (5,2) INIT (0),           00000540
     OPPTJENINGSPERIODEN            FIXED DEC (3)   INIT (0),           00000550
     ST_PROSENT                     FIXED DEC (5,2) INIT (0),           00000560
     TIL_ÅR                         FIXED DEC (5)   INIT (0),           00000570
     SM_BUP_ÅR                      FIXED DEC (5)   INIT (0),           00000580
     TT_FRAMT_MAX                   FIXED DEC (3)   INIT (0),           00000590
     W_TT_FRAM_TIL_DATO             PIC '(5)9',                         00000600
     W_TT_FRAM_TIL_ÅR  DEF W_TT_FRAM_TIL_DATO POS(1) PIC '999',         00000610
     W_TT_FRAM_TIL_MND DEF W_TT_FRAM_TIL_DATO POS(4) PIC '99',          00000620
     W_UFG_5_2                      FIXED DEC (5,2),                    00000630
     K                              FIXED BIN (15)  INIT (0),           00000640
     ALDER_EK                       FIXED DEC (5)   INIT (0),           00000650
                    /* BRUKES FOR Å REGNE UT SÆRTILLEGGET PT2 = 'F'   */00000660
                                                                        00000670
     W_FOLKETRYGD                   FIXED DEC (7),/* -> 4012 */         00000680
     W_STI_MND                      PIC '(2)9' DEF W_STI_ÅM POS(3),     00000690
     W_STI_ÅM                       PIC '(4)9',                         00000700
     W_STI_ÅR                       PIC '(2)9' DEF W_STI_ÅM POS(1),     00000710
                                                                        00000720
     W_UFT_ÅM                       PIC '(4)9',                         00000730
     W_UFT_MÅ                       PIC '(4)9',                         00000740
     W_UFT_MND                      DEF W_UFT_ÅM POS (3) PIC '99',      00000750
     W_UFT_ÅR                       DEF W_UFT_ÅM POS (1) PIC '99',      00000760
     W_DATO_ÅM                      PIC'(4)9',                          00000770
     W_DATO_MÅ                      PIC'(4)9';                          00000780
 /* ================================================================ */ 00000790
 /*  HER STARTER HOVEDPROGRAMMET                                     */ 00000800
 /* ================================================================ */ 00000810
   COMMAREA_PEKER           = ADDR(KOM_OMR);                            00000820
   KOM_OMR.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);              00000830
   PROGRAM_ID='R0014470';                                               00000840
   CALL INITIER;                                                        00000850
   CALL FINN_TT_FAKTISK(BER_SØ_IND); /* 4471 */                         00000860
   CALL TELL_FAKTISKE_POENGÅR;                                          00000870
   CALL REGN_TRYGDETID;                                                 00000880
   CALL KONTROLL_OPPGITT_TRYGDETID;                                     00000890
   IF FEIL_MELD_NR = 0 THEN                                             00000900
      DO;                                                               00000910
         CALL REGN_POENGÅR;                                             00000920
         CALL REGN_BUP_SPT;                                             00000930
         CALL FINN_BELØP;                                               00000940
         IF B02.BEREGN_FOLKETRYGD(BER_SØ_IND) = 'N' THEN                00000950
            W_SKAL_BEREGNES(1) = '0'B;                                  00000960
         CALL FINN_HØGSTE_YTELSE;                                       00000970
         IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN                    00000980
            CALL OPPDATER_ATTFØRING;                                    00000990
         ELSE                                                           00001000
            CALL OPPDATER_UFØRE;                                        00001010
         CALL OPPDATER_I_BEGGE_TILFELLER;                               00001020
         CALL OPPDATER_DIV_PARAM_OMR;                                   00001030
      END;                                                              00001040
 /* ================================================================= */00001050
 INITIER : PROC;                                                        00001060
    DO I = 1 TO 4;                                                      00001070
       W_BT(I)                     = 0;                                 00001080
       W_ET(I)                     = 0;                                 00001090
       W_GP(I)                     = 0;                                 00001100
       W_GP_TEORETISK(I)           = 0;                                 00001110
       W_OPT(I)                    = 0;                                 00001120
       W_PÅ.FAKTISKE(I)            = 0;                                 00001130
       W_PÅ.FRAMTIDIGE(I)          = 0;                                 00001140
       W_PÅ.RETT_TIL_FRAMTIDIGE(I) = '0'B;                              00001150
       W_PÅ.ETTER_91(I)            = 0;                                 00001160
       W_PÅ.ANV(I)                 = 0;                                 00001170
       W_REDUSERT_ANT_BUP_ÅR(I)    = 0;                                 00001180
       W_SKAL_BEREGNES(I)          = '0'B;                              00001190
       W_SPT(I)                    = 0;                                 00001200
       W_ST(I)                     = 0;                                 00001210
       W_ST_TEORETISK(I)           = 0;                                 00001220
       W_SUM_PENSJON(I)            = 0;                                 00001230
       W_TP(I)                     = 0;                                 00001240
       W_TP_TEORETISK(I)           = 0;                                 00001250
       W_TT.ANV_MND(I)             = 0;                                 00001260
       W_TT.ANV_ÅR(I)              = 0;                                 00001270
       W_TT.FAKTISK_MND(I)         = 0;                                 00001280
       W_TT.FRAMTIDIG_MND(I)       = 0;                                 00001290
       W_TT.TEORETISK_MND(I)       = 0;                                 00001300
       W_TT.REDUSERT(I)            = ' ';                               00001310
       W_TT.RETT_TIL_FRAMTIDIGE(I) = '0'B;                              00001320
    END; /* DO I = 1 TO 4 */                                            00001330
    POTALL_OPPL.IND = BER_SØ_IND;  /*?*/                                00001340
    B01_B02_IND     = 2;                                                00001350
    IND             = BER_SØ_IND;                                       00001360
                                                                        00001370
     DO J = 2 TO 7;         /*0697 HL*/                                 00001380
        IF (B02.UFT_ÅM(BER_SØ_IND,J)   = 0 &                            00001390
            B02.UFT_ÅM(BER_SØ_IND,J-1) > 0 ) THEN                       00001400
           DO;  /* FINN GUNSTIGSTE */                                   00001410
              UF_IND = J - 1;                                           00001420
              DO K= 2 TO 7;                                             00001430
                 IF B02.UFG_DATO_ÅM(BER_SØ_IND,J,K) >                   00001440
                    B02.UFG_DATO_ÅM(BER_SØ_IND,J,K-1) THEN              00001450
                    DO;                                                 00001460
                       UF_IND2 = B02.UFG_DATO_ÅM(BER_SØ_IND,J,K);       00001470
                    END;                                                00001480
              END; /* DO K */                                           00001490
           END; /* FINN GUNSTIGSTE */                                   00001500
     END; /* DO J */                                                    00001510
     W_UFG_5_2             = B02.UFØRPENS.UFG(BER_SØ_IND);              00001520
     W_FNR                 = B02.FNR(BER_SØ_IND);                       00001530
     W_FNR_EK              = B02.FNR(BER_EK_IND);                       00001540
     W_DATO_ÅM             = B02.VIRK_DATO_ÅM(BER_SØ_IND);              00001550
     W_DATO_MÅ             = F_SNU_DATO(W_DATO_ÅM);                     00001560
     W_POREKKE             = POREKKE (BER_SØ_IND);                      00001570
     W_UFT_ÅM              = B02.UFT_ÅM(BER_SØ_IND,UF_IND);             00001580
     W_UFT_MÅ              = F_SNU_DATO(W_UFT_ÅM);                      00001590
  /* POREKKE(BER_SØ_IND)   = ''  */                                     00001600
     SM_PÅ                 = W_UFT_ÅR - 1;                              00001610
     FM_PÅ =                                                            00001620
        MAX( W_FNR_R.ÅR+17                                              00001630
           , 67);                                                       00001640
     IF B02.UFØRPENS.STI(BER_SØ_IND) > 0 THEN                           00001650
        W_STI_ÅM = B02.UFØRPENS.STI(BER_SØ_IND);                        00001660
     ELSE                                                               00001670
        W_STI_ÅM = B02.UFT_ÅM(BER_SØ_IND,UF_IND);                       00001680
     /* ------------------------------------------------------------- */00001690
     /* PENSJON REGNES ALLTID OGSÅ ETTER "NORMALE" REGLER             */00001700
     /* ------------------------------------------------------------- */00001710
     W_SKAL_BEREGNES(1) = '1'B;                                         00001720
     /* ------------------------------------------------------------- */00001730
     /* KONTROLL OM PENSJON SKAL REGNES ETTER EØS ART 46 NR 2         */00001740
     /* ------------------------------------------------------------- */00001750
     IF ^(B02.TT_PRO_RATA_MND(BER_SØ_IND) = 0      &                    00001760
          B02.TT_TEORETISK_EØS_MND(BER_SØ_IND) = 0 ) THEN               00001770
        DO;  /* BEREGNES ETTER ART 46 NR 2 */                           00001780
           W_SKAL_BEREGNES(2) = '1'B;                                   00001790
           B02.PRO_RATA_BEREGNING(BER_SØ_IND) = 'J';                    00001800
        END; /* BEREGNES ETTER ART 46 NR 2 */                           00001810
     ELSE                                                               00001820
        W_SKAL_BEREGNES(2) = '0'B;                                      00001830
     /* ------------------------------------------------------------- */00001840
     /* KONTROLL OM PENSJON SKAL REGNES ETTER EØS ART 49 NR 1 B       */00001850
     /* ------------------------------------------------------------- */00001860
  /* IF B02.PRO_RATA_BEREGNING = 'J' THEN                               00001870
        W_SKAL_BEREGNES(3) = 'J'+ SEMIKOLON                             00001880
     ELSE */                                                            00001890
        W_SKAL_BEREGNES(3) = '0'B;                                      00001900
     /* ------------------------------------------------------------- */00001910
     /* KONTROLL OM PENSJON SKAL REGNES ETTER NORDISK KONVENSJON      */00001920
     /* ------------------------------------------------------------- */00001930
     IF ^(B02.TT_NORDISK_FAKT_MND(BER_SØ_IND)= 0 !                      00001940
          B02.PÅ_NORDISK_FAKT(BER_SØ_IND)= 0 ) THEN                     00001950
        W_SKAL_BEREGNES(4) = '1'B;                                      00001960
     ELSE                                                               00001970
        W_SKAL_BEREGNES(4) = '0'B;                                      00001980
     /* ------------------------------------------------------------- */00001990
     /* KONTROLL OM VILKÅR PARAGRAF 3-17A ER OPPFYLLT                 */00002000
     /* ------------------------------------------------------------- */00002010
     IF (B02.UFØRPENS.VILKÅR_8_4_3A(BER_SØ_IND) = 'J') THEN             00002020
        DO;                                                             00002030
           DO I = 1 TO 4;                                               00002040
              W_PÅ.RETT_TIL_FRAMTIDIGE(I) = '1'B;                       00002050
           END;                                                         00002060
        END;                                                            00002070
     ELSE                                                               00002080
        IF (B02.EØS_8_4_3A(BER_SØ_IND) = 'J') THEN                      00002090
           W_PÅ.RETT_TIL_FRAMTIDIGE(2) = '1'B;                          00002100
     IF (W_PÅ.RETT_TIL_FRAMTIDIGE(2) = '0'B &                           00002110
         W_SKAL_BEREGNES(2)          = '1'B &                           00002120
         B02.PENSJONSTYPE2(BER_SØ_IND) = 'A') THEN                      00002130
        CALL FYLLER_VILKÅR_3_17_EØS;                                    00002140
  END INITIER;                                                          00002150
  /* ************************************************************ */    00002160
  TELL_FAKTISKE_POENGÅR: PROC;                                          00002170
     /* ------------------------------------------------------------ */ 00002180
     /* FØRST KONTROLLERER OG TELLER VI OPP FAKTISKE POENGÅR         */ 00002190
     /* ------------------------------------------------------------ */ 00002200
     DO I = FM_PÅ TO SM_PÅ;                                             00002210
        IF POREKKE.POENG(BER_SØ_IND,I) > 0 THEN                         00002220
           DO; /* NORSKE POENGÅR, TELL OPP */                           00002230
              IF I>91 THEN                                              00002240
                 W_PÅ.ETTER_91(1) =                                     00002250
                    + W_PÅ.ETTER_91(1) + 1;                             00002260
              W_PÅ.FAKTISKE(1) = W_PÅ.FAKTISKE(1) + 1;                  00002270
           END;/* NORSKE POENGÅR, TELL OPP */                           00002280
        ELSE                                                            00002290
           DO; /* IKKJE GODSKREVET PENSJONSPOENG I NORGE, EØS-ÅR? */    00002300
              IF B02.INNTEKTSÅR_EØS(BER_SØ_IND,I) THEN                  00002310
                 DO;                                                    00002320
                    IF I>91 THEN                                        00002330
                       W_PÅ.ETTER_91(2)= + W_PÅ.ETTER_91(2) + 1;        00002340
                    W_PÅ.FAKTISKE(2) = W_PÅ.FAKTISKE(2) + 1;            00002350
                 END;                                                   00002360
     /*       IF B02.INNTEKTSÅR_EØS2(BER_SØ_IND,I) THEN                 00002370
                 DO                                                     00002380
                    IF I>91 THEN                                        00002390
                       W_PÅ.ETTER_91(3)= + W_PÅ.ETTER_91(3) + 1 SEMI    00002400
                    W_PÅ.FAKTISKE(3) = W_PÅ.FAKTISKE(3) + 1 SEMI        00002410
                 END                                                    00002420
     */    END;/* IKKJE GODSKREVET PENSJONSPOENG I NORGE, EØS-ÅR? */    00002430
     END; /* TELL OPP FAKTISKE POENGÅR I NORGE/EØS OMRÅDET */           00002440
     IF W_SKAL_BEREGNES(4) THEN                                         00002450
        W_PÅ.FAKTISKE(4) = B02.PÅ_NORDISK_FAKT(BER_SØ_IND);             00002460
  END TELL_FAKTISKE_POENGÅR;                                            00002470
  /* ************************************************************ */    00002480
  FYLLER_VILKÅR_3_17_EØS : PROC;                                        00002490
     DCL                                                                00002500
         (BOM,                                                          00002510
          TREFF                                                         00002520
         )            FIXED BIN(15) INIT (0);                           00002530
     /* ------------------------------------------------------------- */00002540
     /* KONTROL OM VILKÅRA I PARAGRAF 3-17 B-D ER OPPFYLT (ATTFØRING) */00002550
     /* ------------------------------------------------------------- */00002560
     DO I = SM_PÅ TO FM_PÅ                                              00002570
                  BY -1                                                 00002580
                  UNTIL (BOM = 1 !                                      00002590
                         W_PÅ.RETT_TIL_FRAMTIDIGE(2));                  00002600
        IF (POREKKE.POENG(BER_SØ_IND,I) > 0  !                          00002610
            B02.INNTEKTSÅR_EØS(BER_SØ_IND,I) ) THEN                     00002620
           W_PÅ.RETT_TIL_FRAMTIDIGE(2) = '1'B;                          00002630
        ELSE                                                            00002640
        IF POREKKE.KODE(BER_SØ_IND,I) ^= 'U50' THEN                     00002650
           BOM = 1; /* IKKE REG MED OMSORGSPOENG FOR DETTE ÅR */        00002660
     END; /* KONTROLL MED VILKÅR 3_17_B */                              00002670
                                                                        00002680
     IF ^(W_PÅ.RETT_TIL_FRAMTIDIGE(2)) THEN                             00002690
        DO;  /* VILKÅR 3_17_B IKKE OPPFYLT - VI FORTSETTER */           00002700
           BOM = 0;                                                     00002710
           DO I = SM_PÅ TO FM_PÅ                                        00002720
                        BY -1                                           00002730
                        UNTIL (BOM = 2 !                                00002740
                               TREFF = 3);                              00002750
              IF (POREKKE.POENG(BER_SØ_IND,I) > 0  !                    00002760
                  B02.INNTEKTSÅR_EØS(BER_SØ_IND,I) ) THEN               00002770
                 TREFF = TREFF + 1;                                     00002780
              ELSE                                                      00002790
              IF POREKKE.KODE(BER_SØ_IND,I) ^= 'U50' THEN               00002800
                 BOM = BOM + 1;                                         00002810
           END; /* DO I */                                              00002820
           IF TREFF = 3 THEN                                            00002830
              W_PÅ.RETT_TIL_FRAMTIDIGE(2) = '1'B;                       00002840
           ELSE                                                         00002850
              TREFF,                                                    00002860
              BOM    =  0;                                              00002870
           IF ^(W_PÅ.RETT_TIL_FRAMTIDIGE(2)) THEN                       00002880
              DO;  /* KONTROLL VILKÅR 3_17_D - SISTE SJANSE */          00002890
                 DO I = SM_PÅ TO FM_PÅ                                  00002900
                              BY -1                                     00002910
                              UNTIL (BOM = 1 !                          00002920
                                     W_PÅ.RETT_TIL_FRAMTIDIGE(2));      00002930
              IF (POREKKE.KODE(BER_SØ_IND,I) ^= 'U55' !                 00002940
                  POREKKE.KODE(BER_SØ_IND,I) ^= 'U56' ) THEN            00002950
                       W_PÅ.RETT_TIL_FRAMTIDIGE(2) = '1'B;              00002960
                    ELSE                                                00002970
                    IF POREKKE.KODE(BER_SØ_IND,I) ^= 'U50' THEN         00002980
                       BOM = 1;                                         00002990
                 END; /* DO I */                                        00003000
              END; /* KONTROLL VILKÅR 3_17_D1*/                         00003010
        END; /* VILKÅR 3_17_B IKKE OPPFYLT - KONTROLL FORTSETTER */     00003020
  END FYLLER_VILKÅR_3_17_EØS;                                           00003030
  /* ************************************************************ */    00003040
  FINN_BELØP : PROC;                                                    00003050
     IF (B02.PENSJONSTYPE2(BER_SØ_IND) = 'A') THEN                      00003060
        DO;  /* ATTFØRINGSPENGER*/                                      00003070
           W_GP(1) = DIV_PERIODE.ATTFØRING_GP_ÅRSBELØP;                 00003080
           W_TP(1) = DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP;                 00003090
        END; /* ATTFØRINGSPENGER*/                                      00003100
     ELSE                                                               00003110
        DO;  /* UFØREPENSJON */                                         00003120
           W_GP(1) = B02.UFØRPENS.GP(BER_SØ_IND);                       00003130
           W_TP(1) = B02.UFØRPENS.TP(BER_SØ_IND);                       00003140
           W_ST(1) = B02.UFØRPENS.ST(BER_SØ_IND);                       00003150
        END; /* UFØREPENSJON */                                         00003160
     W_SPT(1) = B02.UFØRPENS.SPT(BER_SØ_IND);                           00003170
     W_OPT(1) = B02.UFØRPENS.OPT(BER_SØ_IND);                           00003180
     /* ------------------------------------------------------------- */00003190
     DO I = 2 TO 4;                                                     00003200
        IF W_SKAL_BEREGNES(I) THEN                                      00003210
           DO;  /* SKAL BEREGNES */                                     00003220
              IF B02.SPESOPPL.IKKE_GP(BER_SØ_IND) ^= 'J' THEN           00003230
                 DO;  /* BEREGN GRUNNPENSJON */                         00003240
                    W_ST(I),                                            00003250
                    W_ST_TEORETISK(I),                                  00003260
                    TEORETISK_GP           =G;                          00003270
                    /* ---------------------------------------------- */00003280
                    /* REDUKSJON PGA UFØREGRAD UNDER 100%?            */00003290
                    /* ---------------------------------------------- */00003300
                    IF (B02.UFØRPENS.UFG(BER_SØ_IND) ^= 100) THEN       00003310
                       W_ST(I),                                         00003320
                       W_ST_TEORETISK(I),                               00003330
                       TEORETISK_GP =                                   00003340
                         (   TEORETISK_GP                               00003350
                           * B02.UFØRPENS.UFG(BER_SØ_IND)               00003360
                         ) / 100 + 0.5;                                 00003370
                    /* --------------------------------------------- */ 00003380
                    /* REDUKSJON PGA REDUSERT TRYGDETID              */ 00003390
                    /* --------------------------------------------- */ 00003400
                    IF (I = 4                              ) !          00003410
                       (B02.PENSJONSTYPE2(BER_SØ_IND) = 'A') THEN       00003420
                       /* ------------------------------------------ */ 00003430
                       /* ATTFØRINGSPENGER EØS REGNES I ÅR           */ 00003440
                       /* UFØREPENSJON NORDISK KONVENSJON I ÅR       */ 00003450
                       /* ------------------------------------------ */ 00003460
                       W_ST(I),                                         00003470
                       W_ST_TEORETISK(I),                               00003480
                       W_GP_TEORETISK(I) =                              00003490
                            TEORETISK_GP                                00003500
                          * W_TT.ANV_ÅR(I)                              00003510
                          / 40 + 0.5;                                   00003520
                    ELSE                                                00003530
                       /* ------------------------------------------ */ 00003540
                       /* UFØREPENSJON EØS REGNES I MND              */ 00003550
                       /* ------------------------------------------ */ 00003560
                       W_ST(I),                                         00003570
                       W_ST_TEORETISK(I),                               00003580
                       W_GP_TEORETISK(I) =                              00003590
                            TEORETISK_GP                                00003600
                          * W_TT.ANV_MND(I)                             00003610
                          / 480 + 0.5;                                  00003620
                    /* -------------------------------------------- */  00003630
                    W_GP(I) = W_GP_TEORETISK(I);                        00003640
                    /* -------------------------------------------- */  00003650
                    /* RED. PRORATA PGA ULIK NORSK OG FAKTISK TT?   */  00003660
                    /* -------------------------------------------- */  00003670
                    IF (I = 2                                     ) &   00003680
                       (W_TT.FAKTISK_MND(I) ^= W_TT.FAKTISK_MND(1)) &   00003690
                       (B02.PENSJONSTYPE2(BER_SØ_IND)     ^= 'A') THEN  00003700
                       DO;                                              00003710
                          /* ---------------------------------------- */00003720
                          /* SJÅ RUNDSKRIV EØS-AVTALENS TRYGDEDEL,    */00003730
                          /* PUNKT 14.2.2, EKSEMPEL VII.              */00003740
                          /* ------------> IKKE VED ATTFØRINGSPENGER  */00003750
                          /* ---------------------------------------- */00003760
                          W_ST(I),                                      00003770
                          W_GP(I) =                                     00003780
                             + W_GP(I)                                  00003790
                             * W_TT.FAKTISK_MND(1)                      00003800
                             / MIN(W_TT.FAKTISK_MND(I),480)             00003810
                             + 0.5;                                     00003820
                       END;                                             00003830
                    IF (B02.PENSJONSTYPE2(BER_SØ_IND)  ='S'!            00003840
                        B02.EK_INNT_OVER_2G(BER_SØ_IND)='J') THEN       00003850
                       W_GP(I) = W_GP(I) * 0.75;                        00003860
                 END; /* BEREGN GRUNNPENSJON */                         00003870
                                                                        00003880
              /* ---------------------------------------------------- */00003890
                                                                        00003900
              IF W_PÅ.FAKTISKE(1) > 0 THEN                              00003910
                 DO; /* BEREGN TILLEGGSPENSJON */                       00003920
                    IF W_PÅ.ANV(I) > 2 THEN                             00003930
                       /* ------------------------------------------- */00003940
                       /* DET ER ET MINSTEVILKÅR AT ANTALL POENGÅR,   */00003950
                       /* FAKTISKE & FRAMTIDIGE MINST ER 3 ÅR!!!!!!!! */00003960
                       /* ------------------------------------------- */00003970
                       W_TP_TEORETISK(I) = F_TP92_DES                   00003980
                          (W_FNR_R.ÅR,                                  00003990
                           G,                                           00004000
                           W_SPT(I),                                    00004010
                           W_OPT(I),                                    00004020
                           W_PÅ.ANV(I),                                 00004030
                           W_PÅ.ETTER_91(I),                            00004040
                           W_UFG_5_2,                                   00004050
                           100);       /* 4186 */                       00004060
                       IF (B02.PENSJONSTYPE2(BER_SØ_IND) = 'A') THEN    00004070
                          /* ------------------------------------- */   00004080
                          /* ATTFØRINGSPENGER REGNES I ÅRSBELØP OG */   00004090
                          /* DELES DERETTER I 90'                  */   00004100
                          /* ------------------------------------- */   00004110
                          W_TP_TEORETISK(I),                            00004120
                          W_TP(I)                                       00004130
                             = W_TP_TEORETISK(I) * 12 + 0.5;            00004140
                       ELSE                                             00004150
                       IF I = 4 THEN                                    00004160
                          W_TP(I),                                      00004170
                          W_TP_TEORETISK(I) =                           00004180
                             W_TP_TEORETISK(I) + 0.5;                   00004190
                       ELSE                                             00004200
                          DO;                                           00004210
                             W_TP(I) =                                  00004220
                                + W_TP_TEORETISK(I)                     00004230
                                * W_PÅ.FAKTISKE(1)                      00004240
                                / W_PÅ.FAKTISKE(I)                      00004250
                                + 0.5;                                  00004260
                              W_TP_TEORETISK(I) =                       00004270
                                 W_TP_TEORETISK(I) + 0.5;               00004280
                          END;                                          00004290
                 END; /* BEREGN TILLEGGSPENSJON */                      00004300
                                                                        00004310
              /* ---------------------------------------------------- */00004320
                                                                        00004330
              IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN               00004340
                 DO;                                                    00004350
                    W_ST(I),                                            00004360
                    W_ST_TEORETISK(I) = 0;                              00004370
                 END;                                                   00004380
              ELSE                                                      00004390
                 DO;  /* KAN FYLLE VILKÅRA FOR SÆRTILLEGG */            00004400
                    SELECT (B02.PENSJONSTYPE2(BER_SØ_IND));             00004410
                       WHEN ('F')                                       00004420
                          DO;                                           00004430
                             ALDER_EK =  F_ALDER(W_FNR_EK,W_DATO_MÅ);   00004440
                             IF ((ALDER_EK       >= 6000 &              00004450
                                  W_DATO_ÅM      >  8903 &              00004460
                                  W_DATO_ÅM      <  9100 ) !            00004470
                                 (ALDER_EK       >= 6001 &              00004480
                                  W_DATO_ÅM      >  9100 ) ) THEN       00004490
                                ST_PROSENT = ST_PROSENT_SAMST * 2;      00004500
                             ELSE                                       00004510
                                ST_PROSENT = ST_PROSENT_ENSLIG;         00004520
                          END;                                          00004530
                       WHEN ('S')                                       00004540
                          DO;                                           00004550
                             TEORETISK_GP=TEORETISK_GP*.75;             00004560
                             ST_PROSENT = ST_PROSENT_SAMST;             00004570
                          END;                                          00004580
                       OTHERWISE                                        00004590
                          DO;      /*9710 HL : */                       00004600
                             ST_PROSENT = ST_PROSENT_ENSLIG;            00004610
 /*TILLEGG 9801 HL : */   END;                                          00004620
                    END; /* SELECT PENSJONSTYPE2(BER_SØ_IND) */         00004630
                    /* ---------------------------------------------- */00004640
                    IF B02.PENSJONSTYPE3(BER_EK_IND) = 'K'  &           00004650
                       B02.UTTAKSDATO_ÅM(BER_EK_IND) > 9709 &           00004660
                       B02.SIVILSTAND (BER_SØ_IND) ^= 'A' &             00004670
                       ALDER_EK < 6501          THEN                    00004680
                       DO;                                              00004690
                          TEORETISK_GP=TEORETISK_GP*.75;                00004700
                          DIV_PARAM_OMR                                 00004710
                             .REDUSERT_GP_2G(BER_SØ_IND) = 'K';         00004720
                       END;                                             00004730
                    ELSE                                                00004740
 /* HIT 9801 HL */                                                      00004750
                    IF B02.PENSJON_FØR_9802(BER_SØ_IND) ^= 'J' THEN     00004760
                       DO;  /* FYLLER VILKÅRA FOR PENSJON ETTER 9801 */ 00004770
                          IF B02.EK_INNT_OVER_2G (BER_SØ_IND)  = 'J'  & 00004780
                             (B02.SIVILSTAND(BER_SØ_IND) = 'G' !        00004790
                              B02.SIVILSTAND(BER_SØ_IND) = 'P' !        00004800
                              B02.SIVILSTAND(BER_SØ_IND) = 'V' !        00004810
                              B02.SIVILSTAND(BER_SØ_IND) = 'W' )   THEN 00004820
                             DO;                                        00004830
                                DIV_PARAM_OMR                           00004840
                                   .REDUSERT_GP_2G(BER_SØ_IND) = 'J';   00004850
                                TEORETISK_GP=TEORETISK_GP*.75;          00004860
                             END;                                       00004870
                          ELSE                                          00004880
                          IF B02.SIVILSTAND(BER_SØ_IND) = 'V'  &        00004890
                            (B02.PENSJONSTYPE2(BER_EK_IND) = 'P' !      00004900
                             B02.PENSJONSTYPE2(BER_EK_IND) = 'S') THEN  00004910
                             DO;                                        00004920
                                DIV_PARAM_OMR                           00004930
                                   .REDUSERT_GP_2G(BER_SØ_IND) = 'V';   00004940
                                TEORETISK_GP=TEORETISK_GP*.75;          00004950
                             END;                                       00004960
                       END; /* FYLLER VILKÅRA FOR PENSJON ETTER 9801 */ 00004970
                                                                        00004980
                    /* GP OMREGNES TIL MND. BELØP */                    00004990
                    W_GP(I) = W_GP(I)/12+0.5;                           00005000
                    W_GP_TEORETISK(I) =                                 00005010
                       W_GP_TEORETISK(I) / 12 + 0.5;                    00005020
                                                                        00005030
                    /* ST OMREGNES TIL MND. BELØP */                    00005040
                    W_ST(I) =                                           00005050
                       W_ST(I) * ST_PROSENT / 100 + 0.5;                00005060
                    W_ST_TEORETISK(I) =                                 00005070
                       W_ST_TEORETISK(I) * ST_PROSENT / 100 + 0.5;      00005080
                    W_ST(I)                                             00005090
                       = W_ST(I) / 12 + 0.5;                            00005100
                    W_ST_TEORETISK(I)                                   00005110
                       = W_ST_TEORETISK(I)/12 + 0.5;                    00005120
                    /* PRO RATA ST REDUSERES FOR TP */                  00005130
                    IF W_ST(I) > W_TP(I) THEN                           00005140
                       W_ST(I) = W_ST(I) - W_TP(I);                     00005150
                    ELSE                                                00005160
                       W_ST(I) = 0;                                     00005170
                                                                        00005180
                    /* TEORETISK ST REDUSERES FOR TP */                 00005190
                    IF W_ST_TEORETISK(I) > W_TP_TEORETISK(I) THEN       00005200
                       W_ST_TEORETISK(I) =                              00005210
                          W_ST_TEORETISK(I) - W_TP_TEORETISK(I);        00005220
                    ELSE                                                00005230
                       W_ST_TEORETISK(I) = 0;                           00005240
                 END; /* KAN FYLLE VILKÅRA FOR SÆRTILLEGG */            00005250
           END; /* SKAL BEREGNES */                                     00005260
     END; /* DO I = 1 TO 4  */                                          00005270
                                                                        00005280
     DO I = 1 TO 4;                                                     00005290
        IF (W_SKAL_BEREGNES(I)) THEN                                    00005300
           W_SUM_PENSJON(I) =                                           00005310
             W_GP(I) +                                                  00005320
             W_TP(I) +                                                  00005330
             W_ST(I) +                                                  00005340
             W_BT(I) +                                                  00005350
             W_ET(I);                                                   00005360
     END; /* DO I = 1 TO 4  */                                          00005370
                                                                        00005380
  IF (B02.BEREGN_FOLKETRYGD(BER_SØ_IND) = 'J') &                        00005390
     (B02.PENSJONSTYPE2(BER_SØ_IND) ^= 'A')    THEN                     00005400
     DO; /* REGN UT EVT. FORSØRGINGSTILLEGG */                          00005410
        /* ---------------------------------------------------------- */00005420
        /* FORSØRGINGSTILLEGG VERT KUN BEREGNA AV UFØREPENSJON EVT.   */00005430
        /* FORSØRGINGSTILLEGG I ATTFØRINGSPENGER VERT UTREKNA I INFO. */00005440
        /* VI REKNER FORELØBIG IKKJE UT FORSØRGINGSTILLEGG UANSETT... */00005450
        /* ---------------------------------------------------------- */00005460
        W_FOLKETRYGD =                                                  00005470
           + W_GP(1)                                                    00005480
           + W_ST(1)                                                    00005490
           + W_TP(1);                                                   00005500
        /* CALL FORSØRG_PRO_RATA(BER_SØ_IND)SEMIK/* 4012 */             00005510
     END; /* REGN UT EVT. FORSØRGINGSTILLEGG */                         00005520
                                                                        00005530
  END FINN_BELØP;                                                       00005540
 /* ***************************************************************** */00005550
  FINN_HØGSTE_YTELSE : PROC;                                            00005560
     IF W_SKAL_BEREGNES(4) THEN                                         00005570
        W_SKAL_BEREGNES(1) = '0'B;                                      00005580
     IF B02.BEREGN_FOLKETRYGD(BER_SØ_IND) = 'N' THEN                    00005590
        W_SKAL_BEREGNES(1) = '0'B;                                      00005600
     DO I = 1 TO 4;                                                     00005610
        IF W_SKAL_BEREGNES(I) THEN                                      00005620
           IF ^(HØGSTE = 0) THEN                                        00005630
              IF W_SUM_PENSJON(I) > W_SUM_PENSJON(HØGSTE) THEN          00005640
                 DO                                                     00005650
                    NEST_HØGSTE = HØGSTE;                               00005660
                    HØGSTE      = I;                                    00005670
                 END;                                                   00005680
              ELSE                                                      00005690
                 IF ^(NEST_HØGSTE = 0) THEN                             00005700
                    IF W_SUM_PENSJON(I) > W_SUM_PENSJON(NEST_HØGSTE)    00005710
                       THEN NEST_HØGSTE = I;                            00005720
                    ELSE;                                               00005730
                 ELSE                                                   00005740
                    NEST_HØGSTE=I;                                      00005750
           ELSE                                                         00005760
              HØGSTE=I;                                                 00005770
     END;                                                               00005780
     IF (W_SKAL_BEREGNES(1) &                                           00005790
         HØGSTE ^= 1        ) THEN                                      00005800
        NEST_HØGSTE = 1;                                                00005810
                                                                        00005820
  END FINN_HØGSTE_YTELSE;                                               00005830
 /* ***************************************************************** */00005840
  OPPDATER_ATTFØRING : PROC;                                            00005850
                                                                        00005860
     /* ------------------------------------------------------------- */00005870
     /* HØGSTE ALTERNATIV LEGGES INN I EØS OMRÅDET NB!                */00005880
     /*        HØGSTE GP LIGG I DIV_PERIODE.ATTFØRING_GP_ÅRSBELØP     */00005890
     /*        HØGSTE TP LIGG I DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP     */00005900
     /* ------------------------------------------------------------- */00005910
     DIV_PERIODE.ATTFØRING_GP_ÅRSBELØP = W_GP(HØGSTE);                  00005920
     DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = W_TP(HØGSTE);                  00005930
     /* ------------------------------------------------------------- */00005940
     /* NEST HØYESTE ALTERNATIV LEGGES INN I EØS-SEGMENTET ...        */00005950
     /* ------------------------------------------------------------- */00005960
     IF (NEST_HØGSTE>0) THEN                                            00005970
        DO;  /* HAR ALTERNATIV BEREGNING */                             00005980
           B02.ALTERNATIV_GP(BER_SØ_IND) = W_GP(NEST_HØGSTE);           00005990
           B02.ALTERNATIV_TP(BER_SØ_IND) = W_TP(NEST_HØGSTE);           00006000
           B02.ALTERNATIV_SUM_PENSJON(BER_SØ_IND)                       00006010
              = W_SUM_PENSJON(NEST_HØGSTE);                             00006020
        END; /* HAR ALTERNATIV BEREGNING */                             00006030
     ELSE                                                               00006040
        DO;  /* HAR IKKE ALTERNATIV BEREGNING */                        00006050
           B02.ALTERNATIV_GP(BER_SØ_IND),                               00006060
           B02.ALTERNATIV_TP(BER_SØ_IND),                               00006070
           B02.ALTERNATIV_SUM_PENSJON(BER_SØ_IND) = 0;                  00006080
        END; /* HAR IKKE ALTERNATIV BEREGNING */                        00006090
                                                                        00006100
     B02.UFØRPENS.PÅ(BER_SØ_IND)   = W_PÅ.ANV(HØGSTE);                  00006110
     B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND) = W_PÅ.ETTER_91(HØGSTE);       00006120
  END OPPDATER_ATTFØRING;                                               00006130
 /* ***************************************************************** */00006140
  OPPDATER_UFØRE : PROC;                                                00006150
     IF HØGSTE = 4 THEN                                                 00006160
        DO;                                                             00006170
           TAB.POENG_KODE(SM_PÅ+1) = 'U54';                             00006180
           TAB.POENG_ANVENDT(SM_PÅ+1)                                   00006190
              = B02.UFØRHIST.BUP(BER_SØ_IND,UF_IND);                    00006200
        END;                                                            00006210
                                                                        00006220
     /* ------------------------------------------------------------ */ 00006230
     /* OPPDATERER I UFØRPENS SEGMENT                                */ 00006240
     /* ------------------------------------------------------------ */ 00006250
                                                                        00006260
     IF W_SKAL_BEREGNES(4) THEN                                         00006270
        DO;  /* OPPDATER NORDISK KONVENSJON */                          00006280
           B02.TT_NORDISK_FRAMT_BRUTTO(BER_SØ_IND)                      00006290
              = W_TT.FRAMTIDIG_MND(1);                                  00006300
           B02.TT_NORDISK_FRAMT_NETTO(BER_SØ_IND)                       00006310
              = W_TT.FRAMTIDIG_MND(4);                                  00006320
           B02.PÅ_NORDISK_FRAMT_BRUTTO(BER_SØ_IND)                      00006330
              = W_PÅ.FRAMTIDIGE(1);                                     00006340
           B02.PÅ_NORDISK_FRAMT_NETTO(BER_SØ_IND)                       00006350
              = W_PÅ.FRAMTIDIGE(4);                                     00006360
        END; /* OPPDATER NORDISK KONVENSJON */                          00006370
                                                                        00006380
     B02.UFØRPENS.ST(BER_SØ_IND)          = W_ST(HØGSTE);               00006390
     B02.ANTALL_NORSKE_PÅ(BER_SØ_IND) =                                 00006400
        W_PÅ.FAKTISKE(1)+W_PÅ.FRAMTIDIGE(1);                            00006410
     B02.ANTALL_NORSKE_PÅ_ETTER91(BER_SØ_IND) =                         00006420
        W_PÅ.ETTER_91(1);                                               00006430
     /* ------------------------------------------------------------ */ 00006440
     /* OPPDATERER I STATUS SEGMENT                                  */ 00006450
     /* ------------------------------------------------------------ */ 00006460
     B02.TT_FRAMT(BER_SØ_IND)             = W_TT.FRAMTIDIG_MND(HØGSTE); 00006470
     B02.TT_ANV(BER_SØ_IND)               = W_TT.ANV_ÅR(HØGSTE);        00006480
     B02.SUM_YTELSE(BER_SØ_IND)           = W_SUM_PENSJON(HØGSTE);      00006490
     IF HØGSTE = 2 ! HØGSTE = 3 THEN                                    00006500
        B02.POENGTILLEGG_KODE             = ' ';                        00006510
     B02.GARANTI_TP(BER_SØ_IND),                                        00006520
     B02.GARANTI_DATO_ÅM(BER_SØ_IND),                                   00006530
     B02.GT_LOV92(BER_SØ_IND),                                          00006540
     B02.GT_TILLEGG_LOV92(BER_SØ_IND)     = 0;                          00006550
     /* ------------------------------------------------------------- */00006560
     /* OPPDATERER I UFØRHIST SEGMENTET                               */00006570
     /* ------------------------------------------------------------- */00006580
     B02.UFØRHIST.REDUSERT_ANT_BUP_ÅR(BER_SØ_IND,UF_IND) =              00006590
        W_REDUSERT_ANT_BUP_ÅR(HØGSTE); /*OBS*/                          00006600
  END OPPDATER_UFØRE;                                                   00006610
 /* ***************************************************************** */00006620
 OPPDATER_I_BEGGE_TILFELLER : PROC;                                     00006630
     /* ------------------------------------------------------------ */ 00006640
     /* OPPDATERER I EØS SEGMENTET - SKAL OPPDATERES UANSETT         */ 00006650
     /* ------------------------------------------------------------ */ 00006660
     SELECT (HØGSTE);                                                   00006670
        WHEN(1)                                                         00006680
           B02.EØSINFO.GUNSTIGSTE_ALTERNATIV(BER_SØ_IND) = '1';         00006690
        WHEN(2)                                                         00006700
           DO;  /* ART 46 NR 2 */                                       00006710
              B02.EØSINFO.GUNSTIGSTE_ALTERNATIV(BER_SØ_IND) = '2';      00006720
              TAB.POENG_KODE(SM_PÅ+1)     = '   ';                      00006730
              TAB.POENG_ANVENDT(SM_PÅ+1) = 0;                           00006740
              POREKKE.POENG(BER_SØ_IND,SM_PÅ+1) = 0;                    00006750
           END; /* ART 46 NR 2 */                                       00006760
        WHEN(3)                                                         00006770
           B02.EØSINFO.GUNSTIGSTE_ALTERNATIV(BER_SØ_IND) = '3';         00006780
        WHEN(4)                                                         00006790
           B02.EØSINFO.GUNSTIGSTE_ALTERNATIV(BER_SØ_IND) = '4';         00006800
        OTHER;                                                          00006810
     END; /* SELECT HØGSTE */                                           00006820
     IF (W_SKAL_BEREGNES(1) ! W_SKAL_BEREGNES(4) ) THEN                 00006830
        IF ^(NEST_HØGSTE = 0) THEN                                      00006840
           DO;  /* HAR ALTERNATIV BEREGNING */                          00006850
              B02.ALTERNATIV_GP(BER_SØ_IND) = W_GP(NEST_HØGSTE);        00006860
              B02.ALTERNATIV_TP(BER_SØ_IND) = W_TP(NEST_HØGSTE);        00006870
              B02.ALTERNATIV_ST(BER_SØ_IND) = W_ST(NEST_HØGSTE);        00006880
              B02.ALTERNATIV_BT(BER_SØ_IND) = 0;                        00006890
                 /* + B02.UFØRPENS.BT(BER_SØ_IND)                       00006900
                    + B02.GARANTITILLEGG_BARN(BER_SØ_IND)               00006910
                    + B02.GARANTITILLEGG_SÆRBARN(BER_SØ_IND)            00006920
                    + B02.BT_SÆRBARN(BER_SØ_IND)SEMIKOLON */            00006930
              B02.ALTERNATIV_ET(BER_SØ_IND) = 0;                        00006940
                 /* + B02.UFØRPENS.ET(BER_SØ_IND)                       00006950
                    + B02.GARANTITILLEGG_EK(BER_SØ_IND)SEMIKOLON */     00006960
              B02.ALTERNATIV_SUM_PENSJON(BER_SØ_IND) =                  00006970
                 W_SUM_PENSJON(NEST_HØGSTE);                            00006980
              B02.SPT_EØS(BER_SØ_IND) = W_SPT(NEST_HØGSTE);             00006990
              B02.OPT_EØS(BER_SØ_IND) = W_OPT(NEST_HØGSTE);             00007000
              B02.PÅ_EØS(BER_SØ_IND) = W_PÅ.ANV(NEST_HØGSTE);           00007010
              B02.PÅ_EØS_ETTER91(BER_SØ_IND)                            00007020
                 = W_PÅ.ETTER_91(NEST_HØGSTE);                          00007030
           END; /* HAR ALTERNATIV BEREGNING */                          00007040
        ELSE                                                            00007050
           CALL NULLSTILL_FOLKETRYGD;                                   00007060
     ELSE                                                               00007070
        CALL NULLSTILL_FOLKETRYGD;                                      00007080
     /* ------------------------------------------------------------ */ 00007090
     /* OPPDATERER I UFØREPENS SEGMENTET - SKAL OPPDATERES UANSETT   */ 00007100
     /* ------------------------------------------------------------ */ 00007110
     B02.UFØRPENS.GP(BER_SØ_IND)          = W_GP(HØGSTE);               00007120
     B02.UFØRPENS.TP(BER_SØ_IND)          = W_TP(HØGSTE);               00007130
                                                                        00007140
     IF W_SPT(HØGSTE) > 0 THEN                                          00007150
        DO;  /* HAR RETT TIL TP */                                      00007160
           B02.UFØRPENS.SPT(BER_SØ_IND)       = W_SPT(HØGSTE);          00007170
           B02.UFØRPENS.OPT(BER_SØ_IND)       = W_OPT(HØGSTE);          00007180
           B02.UFØRPENS.PÅ(BER_SØ_IND)        = W_PÅ.ANV(HØGSTE);       00007190
           B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND) = W_PÅ.ETTER_91(HØGSTE); 00007200
           IF B02.UFT_ÅM(BER_SØ_IND,1) < 9200 THEN                      00007210
              DO;  /* SKAL KUN FYLLES UT VED UFT FØR 1992 */            00007220
                 B02.UFØRPENS.SPT_1291(BER_SØ_IND)                      00007230
                    = W_SPT(HØGSTE);                                    00007240
                 B02.UFØRPENS.OPT_1291(BER_SØ_IND)                      00007250
                    = W_OPT(HØGSTE);                                    00007260
                 B02.UFØRPENS.PÅ_1291 (BER_SØ_IND)                      00007270
                    = W_PÅ.ANV(HØGSTE)                                  00007280
                    - W_PÅ.ETTER_91(HØGSTE);                            00007290
              END; /* SKAL KUN FYLLES UT VED UFT FØR 1992 */            00007300
        END; /* HAR RETT TIL TP */                                      00007310
     ELSE                                                               00007320
        DO;  /* IKKE RETT TIL TP */                                     00007330
           B02.UFØRPENS.SPT(BER_SØ_IND),                                00007340
           B02.UFØRPENS.OPT(BER_SØ_IND),                                00007350
           B02.UFØRPENS.PÅ(BER_SØ_IND),                                 00007360
           B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND),                         00007370
           B02.UFØRPENS.PÅ_1291(BER_SØ_IND),                            00007380
           B02.UFØRPENS.SPT_1291(BER_SØ_IND),                           00007390
           B02.UFØRPENS.OPT_1291(BER_SØ_IND)    = 0;                    00007400
        END; /* IKKE RETT TIL TP */                                     00007410
     IF W_SKAL_BEREGNES(1) THEN                                         00007420
        B02.STATUS.TT_ANV(BER_SØ_IND) = W_TT.ANV_ÅR(1);                 00007430
     ELSE                                                               00007440
     IF W_SKAL_BEREGNES(4) THEN                                         00007450
        B02.STATUS.TT_ANV(BER_SØ_IND) = W_TT.ANV_ÅR(4);                 00007460
     ELSE                                                               00007470
        B02.STATUS.TT_ANV(BER_SØ_IND) = W_TT.ANV_ÅR(HØGSTE);            00007480
 END OPPDATER_I_BEGGE_TILFELLER;                                        00007490
 /* ----------------------------------------------------------------- */00007500
  NULLSTILL_FOLKETRYGD:PROC;                                            00007510
     /* ------------------------------------------------------------- */00007520
     /* BENYTTES NÅR BO2.BEREGN_FOLKETRYGD(BER_SØ_IND) ^= 'J'         */00007530
     /* NULLSTILLER ALLE FOLKETRYGDVARIABLER I BO2                    */00007540
     /* ------------------------------------------------------------- */00007550
     B02.ALTERNATIV_BT(BER_SØ_IND),                                     00007560
     B02.ALTERNATIV_GP(BER_SØ_IND),                                     00007570
     B02.ALTERNATIV_SUM_PENSJON(BER_SØ_IND),                            00007580
     B02.ALTERNATIV_ST(BER_SØ_IND),                                     00007590
     B02.ALTERNATIV_TP(BER_SØ_IND),                                     00007600
     B02.SPT_EØS(BER_SØ_IND),                                           00007610
     B02.OPT_EØS(BER_SØ_IND),                                           00007620
     B02.BT_SÆRBARN(BER_SØ_IND),                                        00007630
     B02.GARANTITILLEGG_BARN(BER_SØ_IND),                               00007640
     B02.GARANTITILLEGG_SÆRBARN(BER_SØ_IND),                            00007650
     B02.ALTERNATIV_ET(BER_SØ_IND),                                     00007660
     B02.GARANTITILLEGG_EK(BER_SØ_IND)             = 0;                 00007670
  END NULLSTILL_FOLKETRYGD;                                             00007680
 /* ***************************************************************** */00007690
  REGN_TRYGDETID : PROC;                                                00007700
     /* ------------------------------------------------------------- */00007710
     /* BEREGNER MULIG TRYGDETID VED FULL BOTID TIL UFØRETIDSPUNKT    */00007720
     /* ------------------------------------------------------------- */00007730
     OPPTJENINGSPERIODEN=                                               00007740
        + ( W_STI_ÅR - W_FNR_R.ÅR - 16 ) * 12                           00007750
        + ( W_STI_MND - W_FNR_R.MND - 1 );                              00007760
     /* ------------------------------------------------------------- */00007770
     /* BEREGNER MINSTEVILKÅR FOR FULL GODSKRIVING AV FRAMTIDIG TT  */  00007780
     /* ------------------------------------------------------------- */00007790
     MINSTEVILKÅR  = OPPTJENINGSPERIODEN * .80;      /*AVRUNDES IKKE*/  00007800
     /* ------------------------------------------------------------- */00007810
     /* BEREGNER HVOR LANGT FRAM TRYGDETID SKAL BEREGNES             */ 00007820
     /* ------------------------------------------------------------- */00007830
     SELECT;                     /* W_STI_ÅM)                         */00007840
        WHEN (W_STI_ÅM < 7301)                                          00007850
           DO;                      /* NÅR STØNADSTILFELLET INNTRER   */00007860
              W_TT_FRAM_TIL_DATO =  /* FØR 1973 SKAL EIN REKNE UT     */00007870
                 ( + W_FNR_R.ÅR     /* FRAMTIDIG TRYGDETID TIL OG MED */00007880
                   + 70             /* DEN MÅNADEN DEN TRYGDA FYLLER  */00007890
                 ) * 100            /* 70 ÅR. FRAMTIDIGE BUP ÅR MAKS  */00007900
                + W_FNR_R.MND;      /* TIL VEDK. FYLLER 69 ÅR         */00007910
              SM_BUP_ÅR = W_FNR_R.ÅR + 69;                              00007920
           END;                                                         00007930
        OTHERWISE                                                       00007940
           DO;                      /* NÅR STØNADSTILFELLET INNTRER   */00007950
              W_TT_FRAM_TIL_DATO =  /* ETTER 1972 SKAL FRAMTIDIG      */00007960
                 ( + W_FNR_R.ÅR     /* TRYGDETID REKNAST FRAM TIL OG  */00007970
                   + 66             /* MED DESEMBER DET ÅRET MEDLEMET */00007980
                 ) * 100            /* TRYGDA FYLLER 66 ÅR. FRAMTIDIGE*/00007990
                   + 12;           /* BUP ÅR MAKS TIL VEDK. FYLLER   */ 00008000
              SM_BUP_ÅR = W_FNR_R.ÅR + 66; /* 66 ÅR */                  00008010
           END;                                                         00008020
     END;                                                               00008030
     TT_FRAMT_MAX =              /* I DENNE VARIABELEN LEGGES I HVOR  */00008040
        (   W_TT_FRAM_TIL_ÅR     /* MANGE MÅNEDER VI MAKSIMALT KAN    */00008050
          - W_STI_ÅR             /* BENYTTE FOR BEREGNING AV FRAM-    */00008060
        ) * 12                   /* TIDIG TRYGDETID                   */00008070
          + W_TT_FRAM_TIL_MND                                           00008080
          - W_STI_MND                                                   00008090
          + 1;                                                          00008100
     /* ------------------------------------------------------------- */00008110
     /* BEREGNER FRAMTIDIG TRYGDETID I ANTALL MÅNEDER                */ 00008120
     /* ------------------------------------------------------------- */00008130
     DO I = 1 TO 4;                                                     00008140
        IF (W_TT.FAKTISK_MND(I) > 0 &                                   00008150
            W_SKAL_BEREGNES(I)      ) !                                 00008160
            I=1                      THEN                               00008170
           DO; /* BEREGN FRAMTIDIG TRYGDETID */                         00008180
              IF I = 4 THEN                                             00008190
                 J = 1;                                                 00008200
              ELSE                                                      00008210
                 J = I;                                                 00008220
              IF (MINSTEVILKÅR > W_TT.FAKTISK_MND(J) &                  00008230
                  B02.UFT_ÅM(BER_SØ_IND,UF_IND) > 9100    ) THEN        00008240
                 DO;                                                    00008250
                     /* --------------------------------------------- */00008260
                     /* BEREGN REDUSERT FRAMTIDIG TRYGDETID           */00008270
                     /* ***********************************           */00008280
                     /* FOR DEM SOM HAR BODD I UTLANDET, VIL FRAM-    */00008290
                     /* TIDIG TRYGDETID KUNNE BLI BEGRENSET MED       */00008300
                     /* VIRKNING FRA 1.1.91. JFR. R001N824            */00008310
                     /* --------------------------------------------- */00008320
                     /* DETTE GJELDER OGSÅ DERSOM:                    */00008330
                     /*   - NY UFT > 91, GAMMEL UFT < 91              */00008340
                     /*   - GAMMEL UFT < 91 AVSLUTTET OG NY UFT > 91? */00008350
                     /*   KARI SANNES MÅ SE PÅ DETTE                  */00008360
                     /* --------------------------------------------- */00008370
                    IF I ^= 4 THEN                                      00008380
                       W_TT.FRAMTIDIG_MND(I)=                           00008390
                          ( 480 - MINSTEVILKÅR)                         00008400
                          + 0.5;                                        00008410
                    ELSE                                                00008420
                       W_TT.FRAMTIDIG_MND(I) =                          00008430
                          ( 480 - MINSTEVILKÅR)                         00008440
                          * W_TT.FAKTISK_MND(1)                         00008450
                          / W_TT.FAKTISK_MND(I)                         00008460
                          + 0.5;                                        00008470
                    W_REDUSERT_ANT_BUP_ÅR(I) =                          00008480
                       W_TT.FRAMTIDIG_MND(I)/12+0.5;                    00008490
                    TIL_ÅR =                                            00008500
                       + SM_PÅ                                          00008510
                       + W_REDUSERT_ANT_BUP_ÅR(I);                      00008520
                    IF SM_BUP_ÅR = TIL_ÅR THEN                          00008530
                       W_REDUSERT_ANT_BUP_ÅR(I) = 0;                    00008540
                 END;                                                   00008550
              ELSE /* BEREGN FULL FRAMTIDIG TRYGDETID */                00008560
                 DO;                                                    00008570
                    W_TT.FRAMTIDIG_MND(I) = TT_FRAMT_MAX;               00008580
                 END;                                                   00008590
              /* BEREGN ANV_MND & ANV_ÅR TRYGDETID */                   00008600
              IF I = 2 THEN                                             00008610
                 W_TT.ANV_MND(I)=                                       00008620
                    MIN( + W_TT.TEORETISK_MND(J)                        00008630
                         + W_TT.FRAMTIDIG_MND(I)                        00008640
                       , 480);                                          00008650
              ELSE                                                      00008660
                 W_TT.ANV_MND(I) =                                      00008670
                    MIN( + W_TT.FAKTISK_MND(J)                          00008680
                         + W_TT.FRAMTIDIG_MND(I)                        00008690
                       , 480);                                          00008700
              W_TT.ANV_ÅR(I)=                                           00008710
                 W_TT.ANV_MND(I)/12+0.5;                                00008720
           END; /* BEREGN FRAMTIDIG TRYGDETID */                        00008730
     END; /* I = 1 TO 4 */                                              00008740
  END REGN_TRYGDETID;                                                   00008750
  /* *************************************************************** */ 00008760
  KONTROLL_OPPGITT_TRYGDETID : PROC;                                    00008770
      /* ----------------------------------------------------------- */ 00008780
      /* KONTROLL GJENNOMFØRES, OG VED EVENTUELLE FEIL VIL DET       */ 00008790
      /* BLI LAGT INN FEILMELDIGSNUMMER I DIV_PARAM_OMR              */ 00008800
      /* ----------------------------------------------------------- */ 00008810
      DCL MIN_TT_IFLG_PÅ               FIXED DEC (3) INIT (0);          00008820
      /* ----------------------------------------------------------- */ 00008830
      /* VI KONTROLLERER FØRST OM OPPGITT TRYGDETID ER MINDRE ENN    */ 00008840
      /* ANTALL POENGÅR SOM ER GODSKREVET, JAMFØR 7-2 NR. 1          */ 00008850
      /* ----------------------------------------------------------- */ 00008860
      MIN_TT_IFLG_PÅ = W_PÅ.FAKTISKE(1) * 12;                           00008870
   /* IF (B02.PINNTEKT.PI(BER_SØ_IND,(SM_PÅ+1))> 0 &                    00008880
          POREKKE.POENG(BER_SØ_IND,(SM_PÅ+1))> 1   )THEN                00008890
         MIN_TT_IFLG_PÅ = MIN_TT_IFLG_PÅ + W_UFT_MND -1;                00008900
         UTGÅR IFLG RANDI, TLF. 20.05.98 */                             00008910
      IF W_TT.FAKTISK_MND(1) < MIN_TT_IFLG_PÅ THEN                      00008920
         DO;                                                            00008930
             FEIL_VED_LABEL = '422';                                    00008940
             FEIL_MELD_NR = 422;                                        00008950
         END;                                                           00008960
         /* -------------------------------------------------------- */ 00008970
         /* KONTROLLERER OM SUM NORSK OG EØS TRYGDETID ER STØRRE     */ 00008980
         /* ENN OPPTJEINGSPERIODEN +1 -> BLANKETTEN AVVISES          */ 00008990
         /* -------------------------------------------------------- */ 00009000
      /* 25.03.98 KOMMENTERT UT - BRUKER FØRSTE UFØRETIDSPUNKT...    */ 00009010
      IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' &                          00009020
         W_TT.FAKTISK_MND(2) > OPPTJENINGSPERIODEN + 2 THEN             00009030
         DO;                                                            00009040
            FEIL_VED_LABEL = '423';                                     00009050
            FEIL_MELD_NR = 423;                                         00009060
         END;                                                           00009070
      /* ----------------------------------------------------------- */ 00009080
      /* KONTROLLERER OM SUM NORSK OG NORDISK TRYGDETID ER STØRRE    */ 00009090
      /* ENN OPPTJEINGSPERIODEN +2-> BLANKETTEN AVVISES              */ 00009100
      /* ----------------------------------------------------------- */ 00009110
      /* 25.03.98 KOMMENTERT UT - BRUKER FØRSTE UFØRETIDSPUNKT...    */ 00009120
  /*  IF W_TT.FAKTISK_MND(4) > OPPTJENINGSPERIODEN+2 THEN               00009130
         DO;                                                            00009140
             FEIL_VED_LABEL = '424';                                    00009150
             FEIL_MELD_NR = 424;                                        00009160
         END; */                                                        00009170
  END KONTROLL_OPPGITT_TRYGDETID;                                       00009180
  /* *************************************************************** */ 00009190
  REGN_POENGÅR : PROC;                                                  00009200
     DO I=1 TO 4;                                                       00009210
        IF W_SKAL_BEREGNES(I) THEN                                      00009220
           DO;                                                          00009230
              SELECT (I);                                               00009240
                 WHEN (1) /* BEREGN NORSK PENSJON */                    00009250
                    DO;                                                 00009260
                       IF W_PÅ.RETT_TIL_FRAMTIDIGE(I) THEN              00009270
                          IF (W_TT.FRAMTIDIG_MND(1) =                   00009280
                              TT_FRAMT_MAX           ) THEN             00009290
                             W_PÅ.FRAMTIDIGE(1) =                       00009300
                                SM_BUP_ÅR - SM_PÅ;                      00009310
                          ELSE                                          00009320
                             W_PÅ.FRAMTIDIGE(1) =                       00009330
                                W_TT.FRAMTIDIG_MND(1)/12+0.5;           00009340
                       IF W_PÅ.FAKTISKE(1)+W_PÅ.FRAMTIDIGE(1) > 40 THEN 00009350
                          DO;                                           00009360
                             W_PÅ.ANV(1) = 40;                          00009370
                             W_PÅ.ETTER_91(1)=                          00009380
                                + 40                                    00009390
                                - W_PÅ.FAKTISKE(1)                      00009400
                                + W_PÅ.ETTER_91(1);                     00009410
                          END;                                          00009420
                       ELSE                                             00009430
                          DO;                                           00009440
                             W_PÅ.ANV(1) =                              00009450
                                + W_PÅ.FAKTISKE(1)                      00009460
                                + W_PÅ.FRAMTIDIGE(1);                   00009470
                             W_PÅ.ETTER_91(1) =                         00009480
                                + W_PÅ.ETTER_91(1)                      00009490
                                + W_PÅ.FRAMTIDIGE(1);                   00009500
                          END;                                          00009510
                    END;                                                00009520
                 WHEN (2) /* PRO RATA 1 */                              00009530
                    DO;                                                 00009540
                       W_PÅ.FAKTISKE(2) =                               00009550
                          W_PÅ.FAKTISKE(2) + W_PÅ.FAKTISKE(1);          00009560
                       IF W_PÅ.RETT_TIL_FRAMTIDIGE(I) THEN              00009570
                          IF (W_TT.FRAMTIDIG_MND(2) =                   00009580
                              TT_FRAMT_MAX           ) THEN             00009590
                             W_PÅ.FRAMTIDIGE(2) =                       00009600
                                SM_BUP_ÅR - SM_PÅ;                      00009610
                          ELSE                                          00009620
                             W_PÅ.FRAMTIDIGE(2) =                       00009630
                                W_TT.FRAMTIDIG_MND(2)/12+0.5;           00009640
                       IF W_PÅ.FAKTISKE(2)+W_PÅ.FRAMTIDIGE(2) > 40 THEN 00009650
                          DO;  /* OVER 40 POENGÅR EØS */                00009660
                             W_PÅ.ANV(2) = 40;                          00009670
                             W_PÅ.ETTER_91(2) =                         00009680
                                + 40                                    00009690
                                - W_PÅ.FAKTISKE(2)                      00009700
                                + W_PÅ.ETTER_91(2)                      00009710
                                + W_PÅ.ETTER_91(1)                      00009720
                                - W_PÅ.FRAMTIDIGE(1);                   00009730
                             IF (W_PÅ.FAKTISKE(1)                       00009740
                                 + W_PÅ.FRAMTIDIGE(1) > 40) THEN        00009750
                             /* RED GRUNNA DÅRLIG STRUKTUR */           00009760
                             W_PÅ.ETTER_91(2) =                         00009770
                                + W_PÅ.ETTER_91(2)                      00009780
                                - 40                                    00009790
                                + W_PÅ.FAKTISKE(1)                      00009800
                                + W_PÅ.FRAMTIDIGE(1);                   00009810
                          END; /* OVER 40 POENGÅR EØS */                00009820
                       ELSE                                             00009830
                          DO;  /* UNDER 40 POENGÅR EØS */               00009840
                             W_PÅ.ANV(2) =                              00009850
                                + W_PÅ.FAKTISKE(2)                      00009860
                                + W_PÅ.FRAMTIDIGE(2);                   00009870
                             W_PÅ.ETTER_91(2) =                         00009880
                                + W_PÅ.ETTER_91(2)                      00009890
                                + W_PÅ.FRAMTIDIGE(2)                    00009900
                                + W_PÅ.ETTER_91(1)                      00009910
                                - W_PÅ.FRAMTIDIGE(1);                   00009920
                          END; /* UNDER 40 POENGÅR  EØS */              00009930
                    END;                                                00009940
                 WHEN (3) /* PRO RATA 2 */                              00009950
                    DO;                                                 00009960
                    END;                                                00009970
                 WHEN (4) /* NORDISK */                                 00009980
                    DO;                                                 00009990
                       W_PÅ.FAKTISKE(4) =                               00010000
                          B02.PÅ_NORDISK_FAKT(BER_SØ_IND);              00010010
                       IF W_PÅ.RETT_TIL_FRAMTIDIGE(I) THEN              00010020
                          IF MINSTEVILKÅR > W_TT.FAKTISK_MND(1) &       00010030
                             B02.UFT_ÅM(BER_SØ_IND,UF_IND) > 9100 THEN  00010040
                             DO;                                        00010050
                                W_PÅ.FRAMTIDIGE(4) =                    00010060
                                   (+ 480                               00010070
                                    - (.80*OPPTJENINGSPERIODEN))        00010080
                                   / 12                                 00010090
                                   + 0.5;                               00010100
                             END;                                       00010110
                          ELSE                                          00010120
                             DO;                                        00010130
                                W_PÅ.FRAMTIDIGE(4) =                    00010140
                                   TT_FRAMT_MAX/12+0.5;                 00010150
                             END;                                       00010160
                       W_REDUSERT_ANT_BUP_ÅR(4) =                       00010170
                          W_PÅ.FRAMTIDIGE(4);                           00010180
                       W_PÅ.FRAMTIDIGE(4) =                             00010190
                          + W_PÅ.FRAMTIDIGE(4)                          00010200
                          * W_PÅ.FAKTISKE(1)                            00010210
                          / (W_PÅ.FAKTISKE(4) + W_PÅ.FAKTISKE(1))       00010220
                          + 0.5;                                        00010230
                       W_PÅ.ANV(4) =                                    00010240
                          + W_PÅ.FAKTISKE(1)                            00010250
                          + W_PÅ.FRAMTIDIGE(4);                         00010260
                       W_PÅ.ETTER_91(4) =                               00010270
                          + W_PÅ.ETTER_91(1)                            00010280
                          + W_PÅ.FRAMTIDIGE(4)                          00010290
                          - W_PÅ.FRAMTIDIGE(1);                         00010300
                    END;                                                00010310
                 OTHERWISE;                                             00010320
              END; /* SELECT I */                                       00010330
              IF W_PÅ.ANV(I) > 40 THEN                                  00010340
                 DO;                                                    00010350
                    W_PÅ.ETTER_91(I) =                                  00010360
                       + W_PÅ.ETTER_91(I)                               00010370
                       - W_PÅ.ANV(I)                                    00010380
                       + 40;                                            00010390
                    W_PÅ.ANV(I) = 40;                                   00010400
                 END;                                                   00010410
              IF W_STI_ÅM < 9200 THEN                                   00010420
                 W_PÅ.ETTER_91(I) = 0;                                  00010430
           END; /* W_SKAL_BEREGNES(I) */                                00010440
     END; /* DO I = 1 TO 4 */                                           00010450
  END REGN_POENGÅR;                                                     00010460
  /* *************************************************************** */ 00010470
  REGN_BUP_SPT : PROC;                                                  00010480
     /* ------------------------------------------------------------ */ 00010490
     /*  DEKLARERER VARIABLER SOM KUN BENYTTES I DENNE PROCEDURE     */ 00010500
     /* ------------------------------------------------------------ */ 00010510
     DCL BEREGNET_BUP          FIXED DEC (03,2) INIT(0    ) ,           00010520
         I                     FIXED BIN (15  ) INIT(0    ) ,           00010530
         J                     FIXED DEC ( 5  ) INIT(0    ) ,           00010540
         K                     FIXED BIN (15  ) INIT(0    ) ,           00010550
         L                     FIXED BIN (15  ) INIT(0    ) ,           00010560
         M                     FIXED BIN (15  ) INIT(0    ) ,           00010570
         HALVPARTEN            PIC       '(3)9' INIT(1    ) ,           00010580
         POENG_SISTE_3ÅR       FIXED DEC (05,3) INIT(0    ) ,           00010590
         RUNDING               FIXED DEC (05,3) INIT(0.005) ,           00010600
         SORTERTE_POENG(50)    FIXED DEC (05,3)             ,           00010610
         SORTERTE_POENG_92(50) FIXED DEC (05,3)             ,           00010620
         SUM_BUP               FIXED DEC (07,3) INIT (0   ) ,           00010630
         SUM_OPT               FIXED DEC (07,3) INIT (0   ) ,           00010640
         SUM_POENGTALL         FIXED DEC (07,3) INIT (0   ) ,           00010650
         SUM_POENGÅR           FIXED DEC (03  ) INIT (0   ) ;           00010660
     /* ------------------------------------------------------------ */ 00010670
     /* VI LEGGER POENGREKKA INN I ARBEIDSVARIABLENE                 */ 00010680
     /* ------------------------------------------------------------ */ 00010690
     SORTERTE_POENG(*) = 0;                                             00010700
     SORTERTE_POENG_92(*) = 0;                                          00010710
     /* ------------------------------------------------------------ */ 00010720
     /*  BEREGNER SNITTET AV DE TRE SISTE POENGÅRENE, HER ER ENNO    */ 00010730
     /*  IKKJE LAGT INN EVT. KORREKSJON FOR OMSORGSPOENG             */ 00010740
     /* ------------------------------------------------------------ */ 00010750
     POENG_SISTE_3ÅR =                                                  00010760
        + (W_POREKKE.POENG(SM_PÅ - 2)                                   00010770
        +  W_POREKKE.POENG(SM_PÅ - 1)                                   00010780
        +  W_POREKKE.POENG(SM_PÅ    )   ) / 3 + RUNDING;                00010790
     HALVPARTEN =                                                       00010800
        MIN((SM_PÅ - FM_PÅ + 1)/2 + 0.5                                 00010810
           ,20);                                                        00010820
     /* ------------------------------------------------------------ */ 00010830
     /*  SORTERER ALLE POENGÅR SLIK AT ELEMENT 1 INNEHOLDER HØYESTE  */ 00010840
     /* ------------------------------------------------------------ */ 00010850
     DO I = 1 TO 50;                                                    00010860
        DO J = FM_PÅ TO SM_PÅ;                                          00010870
           IF W_POREKKE.POENG(J) > SORTERTE_POENG(I) THEN               00010880
              DO;                                                       00010890
                 SORTERTE_POENG(I) = W_POREKKE.POENG(J);                00010900
                 K = J;                                                 00010910
              END;                                                      00010920
        END;                                                            00010930
        IF K < 92 THEN                                                  00010940
           IF SORTERTE_POENG(I) > 5.00 THEN                             00010950
              IF SORTERTE_POENG(I) > 7.00 THEN                          00010960
                 SORTERTE_POENG_92(I) =                                 00010970
                    + SORTERTE_POENG(I) - 7 + 5 +2/3 + RUNDING;         00010980
              ELSE                                                      00010990
                 SORTERTE_POENG_92(I) =                                 00011000
                    + 5                                                 00011010
                    + (SORTERTE_POENG(I)-5) * 1/3 + RUNDING;            00011020
           ELSE                                                         00011030
              SORTERTE_POENG_92(I) = SORTERTE_POENG(I);                 00011040
        ELSE                                                            00011050
           SORTERTE_POENG_92(I) = SORTERTE_POENG(I);                    00011060
        W_POREKKE.POENG(K) = 0;                                         00011070
     END; /*DO I=1 ANTALL MULIGE POENGÅR */                             00011080
     /* ------------------------------------------------------------- */00011090
     BEREGNET_BUP = B02.UFØRHIST.BUP(BER_SØ_IND,UF_IND);                00011100
     /* ------------------------------------------------------------- */00011110
     IF W_SKAL_BEREGNES(2) THEN                                         00011120
        DO;                                                             00011130
           /* SLUTTPOENGTALL - EØS REGNES AV FAKTISKE POENG */          00011140
           J = MIN(W_PÅ.FAKTISKE(1),20);                                00011150
           IF J > 0 THEN                                                00011160
              DO;                                                       00011170
                 SUM_BUP = 0;                                           00011180
                 DO I = 1 TO J;                                         00011190
                    SUM_BUP = SUM_BUP + SORTERTE_POENG(I);              00011200
                    IF SORTERTE_POENG(I) > 4 THEN                       00011210
                       SUM_OPT = SUM_OPT + 4;                           00011220
                    ELSE                                                00011230
                       SUM_OPT = SUM_OPT + SORTERTE_POENG(I);           00011240
                 END;                                                   00011250
                 IF B02.SPESOPPL.OVERKOMP_UTL(BER_SØ_IND) = 'J' THEN    00011260
                    W_OPT(2) = SUM_OPT/J + 0.005;                       00011270
                 ELSE                                                   00011280
                    W_OPT(2) = 0;                                       00011290
                 W_SPT(2) = SUM_BUP/J + 0.005;                          00011300
              END;                                                      00011310
        END;                                                            00011320
     /* ------------------------------------------------------------- */00011330
     IF W_SKAL_BEREGNES(4) THEN                                         00011340
        DO;                                                             00011350
           /* SLUTTPOENTALL NORDISK -  FAKTISKE & FRAMTIDIGE POENG */   00011360
           SUM_BUP = 0;                                                 00011370
           SUM_OPT = 0;                                                 00011380
           SUM_POENGÅR =                                                00011390
              + W_PÅ.FAKTISKE(1)                                        00011400
              + W_REDUSERT_ANT_BUP_ÅR(4);                               00011410
            /*  + W_PÅ.FRAMTIDIGE(4)  */                                00011420
           IF SUM_POENGÅR < 21 THEN                                     00011430
              DO;                                                       00011440
                 SUM_POENGTALL = 0;                                     00011450
                 DO I = 1 TO W_PÅ.FAKTISKE(1);                          00011460
                    SUM_POENGTALL =                                     00011470
                       + SUM_POENGTALL                                  00011480
                       + SORTERTE_POENG(I);                             00011490
                    IF SORTERTE_POENG(I) > 4 THEN                       00011500
                       SUM_OPT = SUM_OPT + 4;                           00011510
                    ELSE                                                00011520
                       SUM_OPT = SUM_OPT + SORTERTE_POENG(I);           00011530
                 END;                                                   00011540
                 IF B02.SPESOPPL.OVERKOMP_UTL(BER_SØ_IND) = 'J' THEN    00011550
                    W_OPT(4) = SUM_OPT/J + 0.005;                       00011560
                 SUM_POENGTALL =                                        00011570
                    + SUM_POENGTALL                                     00011580
                    + W_REDUSERT_ANT_BUP_ÅR(4) * BEREGNET_BUP;          00011590
                 W_SPT(4) =                                             00011600
                    + SUM_POENGTALL / SUM_POENGÅR + RUNDING;            00011610
              END;                                                      00011620
           ELSE                                                         00011630
              DO;                                                       00011640
                 SUM_POENGTALL = 0;                                     00011650
                 DO I = 1 TO 20;                                        00011660
                    IF SORTERTE_POENG(I) < BEREGNET_BUP &               00011670
                       I + W_REDUSERT_ANT_BUP_ÅR(4)>19 THEN             00011680
                          SORTERTE_POENG(I) = BEREGNET_BUP;             00011690
                    SUM_POENGTALL =                                     00011700
                       + SUM_POENGTALL                                  00011710
                       + SORTERTE_POENG(I);                             00011720
                 END;                                                   00011730
                 W_SPT(4) =                                             00011740
                    + SUM_POENGTALL / 20 + RUNDING;                     00011750
              END;                                                      00011760
        END;                                                            00011770
     IF W_SKAL_BEREGNES(1) THEN                                         00011780
        DO;  /* FOLKETRYGD SKAL BEREGNES */                             00011790
           W_OPT(1)= B02.UFØRPENS.OPT(BER_SØ_IND);                      00011800
           W_SPT(1)= B02.UFØRPENS.SPT(BER_SØ_IND);                      00011810
        END; /* FOLKETRYGD SKAL BEREGNES */                             00011820
     /* --------------------------------------------------------- */    00011830
     /* OPPDATERER TAB MED U54 DERSOM FRAMTIDIGE POENGÅR          */    00011840
     /* --------------------------------------------------------- */    00011850
     DO I = 1 TO W_REDUSERT_ANT_BUP_ÅR(1);                              00011860
        TAB.POENG_KODE(I+SM_PÅ) = 'U54';                                00011870
     END;                                                               00011880
  END REGN_BUP_SPT;                                                     00011890
  /* ************************************************************ */    00011900
  OPPDATER_DIV_PARAM_OMR : PROC;                                        00011910
     /* ------------------------------------------------------------- */00011920
     /* POENGÅR VERT OPPDATERT                                        */00011930
     /* ------------------------------------------------------------- */00011940
     DIV_PARAM_OMR.PÅ_NORSK_FAKTISK(BER_SØ_IND)                         00011950
        = W_PÅ.FAKTISKE(1);                                             00011960
     DIV_PARAM_OMR.PÅ_EØS_FAKTISK(BER_SØ_IND)                           00011970
        = W_PÅ.FAKTISKE(2)-W_PÅ.FAKTISKE(1);                            00011980
     DIV_PARAM_OMR.PÅ_TEORETISK_FRAMT                                   00011990
        = W_PÅ.FRAMTIDIGE(1);                                           00012000
     /* ------------------------------------------------------------- */00012010
     /* TRYGDETID VERT OPPDATERT                                      */00012020
     /* ------------------------------------------------------------- */00012030
     IF (B02.PENSJONSTYPE2(BER_SØ_IND) = 'A') THEN                      00012040
        DIV_PARAM_OMR.TT_TEORETISK = W_TT.ANV_ÅR(2);                    00012050
     ELSE                                                               00012060
        DIV_PARAM_OMR.TT_TEORETISK = W_TT.ANV_MND(2);                   00012070
     DIV_PARAM_OMR.TT_NORSK_FAKTISK = W_TT.FAKTISK_MND(1);              00012080
     DIV_PARAM_OMR.TT_SUM_FAKTISK = W_TT.TEORETISK_MND(2);/* MAX 480 */ 00012090
     /* ------------------------------------------------------------- */00012100
     /* TEORETISKE BELØP VERT OPPDATERT                               */00012110
     /* ------------------------------------------------------------- */00012120
     DIV_PARAM_OMR.TEORETISK_BELØP_GP = W_GP_TEORETISK(HØGSTE);         00012130
     DIV_PARAM_OMR.TEORETISK_BELØP_TP = W_TP_TEORETISK(HØGSTE);         00012140
  END OPPDATER_DIV_PARAM_OMR;                                           00012150
  /* =============================================================== */ 00012160
   % INCLUDE R0014012;   /* FORSØRG_PRO_RATA(TYPE)                */    00012170
   % INCLUDE R0014186;   /* F_TP92_DES                            */    00012180
   % INCLUDE R0014165;   /* PLUKK_UT_BESTE_POENG                  */    00012190
   % INCLUDE R0014471;   /* FINN_TT_FAKTISK (->W_TT.FAKTISK(*))   */    00012200
   % INCLUDE R0019905;   /* F_ALDER                               */    00012210
   % INCLUDE R0019913;   /* F_SNU_DATO                            */    00012220
  /* =============================================================== */ 00012230
  END UP_EØS;                                                           00012240
