 /*       SIST ENDRET 10/08-98 12.26.42 AV   JDA7339                  */00000000
 /*       SIST ENDRET 10/08-98 12.21.55 AV   JDA7339                  */00000010
 /*       SIST ENDRET 15/07-98 11.17.35 AV   JDA7339                  */00000020
 /*       SIST ENDRET 15/07-98 11.14.26 AV   JDA7339                  */00000030
 /*       SIST ENDRET 17/12-97 08.55.08 AV   HLA7339                  */00000040
 /*       SIST ENDRET 17/12-97 08.52.06 AV   HLA7339                  */00000050
 /*       SIST ENDRET 24/10-97 11.58.39 AV   JDA7339                  */00000060
 /*       SIST ENDRET 19/09-97 10.27.24 AV   JDA7339                  */00000070
 /*       SIST ENDRET 28/08-97 08.54.43 AV   SPA7339                  */00000080
 /*       SIST ENDRET 03/05-96 15.40.08 AV   HLB0310                  */00000090
 /*       SIST ENDRET 12/09-95 14.42.15 AV   TSB0310                  */00000100
 /*       SIST ENDRET 31/08-95 09.11.41 AV   HLB0310                  */00000110
 /*       SIST ENDRET 18/08-95 10.32.13 AV   TSB0310                  */00000120
 /*       SIST ENDRET 23/11-94 14.21.18 AV   JDA0310                  */00000130
 /*       SIST ENDRET 06/04-94 14.56.20 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 31/03-92 13.29.32 AV   HERMAN                   */00000150
 /*       SIST ENDRET 03/03-92 09.52.46 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 17/02-92 13.47.15 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 29/01-92 15.10.12 AV   HERMAN                   */00000180
 /*       SIST ENDRET 13/12-91 12.58.26 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 24/06-91 14.34.13 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 10/05-91 12.59.34 AV   HERMAN                   */00000210
 /*       SIST ENDRET 23/04-91 12.13.43 AV   DYBVIK                   */00000220
 /*       SIST ENDRET 21/01-91 14.34.03 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 11/07-90 14.53.38 AV   HERMAN                   */00000240
 /*       SIST ENDRET 31/03-87 09.10.03 AV   DYBVIK                   */00000250
 /*  NB:  MÅ ENDERS R001B003 OGSÅ                                    */ 00000260
 /*  NB:  MÅ ENDERS R001B003 OGSÅ                                    */ 00000270
 /* ***************************************************************** */00000280
 /*IDENTIFIKASJON:                                                    */00000290
 /*    R0014141 - HOVEDPROG I PLI                                     */00000300
 /*    PROGRAMMERER: PER F. BERGESTAD, JUNI 1982                      */00000310
 /*HENSIKT:                                                           */00000320
 /*    RUTINEN PLUKKER UT POENGREKKEN SOM SPT, OPT OG PÅ ER REGNET UT */00000330
 /*    ETTER. I TILFELLER HVOR PENSJONISTEN HADDE UFØREPENSJON FRA FØR*/00000340
 /*    1973 OG NÅ DØR ELLER BLIR ALDERSPENSJONIST, UNDERSØKER RUTINEN */00000350
 /*    OM TILLEGGSPENSJONEN SOM UFØR VAR STØRRE ENN VI NÅ HAR KOMMET  */00000360
 /*    FRAM TIL. I DISSE TILFELLENE FÅR PENSJONISTEN POENGREKKE, SPT, */00000370
 /*    OPT OG PÅ ETTER UFØREALTERNATIVET.                             */00000380
 /*ENDRING:                                                           */00000390
 /*    DET MÅ TAS HENSYN TIL DEN SISTE UFØREGRADEN VED                */00000400
 /*    SAMMENLIGNINGEN AV ALTERNATIVENE UNDER GARANTIBESTEMMELSEN OG  */00000410
 /*    AT GARANTIEN IKKE GJELDER PERSONER FØDT FØR 1904.              */00000420
 /*                                                                   */00000430
 /*    17.10.84                                                       */00000440
 /*       DET SKAL IKKE TAS HENSYN TIL SISTE UFØREGRAD SOM            */00000450
 /*       NEVNT OVENFOR    REF. SLETNER P1.                           */00000460
 /*                                                                   */00000470
 /*ENDRING PGA NY LOV FRA 1992 - HL.                                  */00000480
 /*                                                                   */00000490
 /*                                                                   */00000500
 /* ***************************************************************** */00000510
  BESPT:                                                                00000520
    PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                 00000530
 %PAGE;                                                                 00000540
      %INCLUDE P0019906; /* TRANS_OPPL_OMR                            */00000550
      %INCLUDE P0019908; /* KOM_OMR                                   */00000560
      %INCLUDE P0019910; /* STYRINGS_OMR                              */00000570
      %INCLUDE P0019912; /* DIV_PARAM_OMR                             */00000580
      %INCLUDE P0019924; /* GV_TAB_RE                                 */00000590
                                                                        00000600
      %INCLUDE P0012002; /* PCB_UIB_PEKER_OMR & PCB_PEKER_OMR         */00000610
   DCL 1 RF1 BASED(RF1_PCB_PEKER),                                      00000620
      %INCLUDE P0012003;                                                00000630
      %INCLUDE DLIUIB;                                                  00000640
                                                                        00000650
      %INCLUDE P0014002; /* W_POREKKE                                 */00000660
      %INCLUDE P0014003; /* TAB                                       */00000670
      %INCLUDE P0014009; /* POREKKE (14)                              */00000680
 %PAGE;                                                                 00000690
   DCL 1 B02 BASED(B01_B02_PEKER), %INCLUDE P0019921;                   00000700
 %PAGE;                                                                 00000710
   DCL 1 B01 BASED(B01_PEKER),     %INCLUDE P0019921;  /* TRUDE*/       00000720
 %PAGE;                                                                 00000730
    DCL                                                                 00000740
       COMMAREA_PEKER   PTR,                                            00000750
       B01_B02_PEKER    PTR,                                            00000760
       W_PEKER          PTR,                                            00000770
       ADDR             BUILTIN,                                        00000780
       DATE             BUILTIN,                                        00000790
       SUBSTR           BUILTIN,                                        00000800
       PLITDLI          ENTRY,                                          00000810
       W_FNR            PIC'(11)9',                                     00000820
       I                FIXED BIN (15),                                 00000830
       K                FIXED BIN (15),                                 00000840
       SIST_REG         FIXED BIN (15),                                 00000850
       DØDSTPKT         PIC'(6)9',                                      00000860
       DATO             CHAR(6),                                        00000870
       ÅRMND               PIC'9999',                                   00000880
       ÅR_FØR_AP           PIC'999',                                    00000890
       SEKSTINIÅR          PIC'999',                                    00000900
       SEKSTISEKSÅR        PIC'999';                                    00000910
    DCL                                                                 00000920
       FAST_G           FIXED DEC(5);                                   00000930
    DCL                                                                 00000940
       1 W_FNR_R        DEF W_FNR,                                      00000950
         2 DAG          PIC'(2)9',                                      00000960
         2 MND          PIC'(2)9',                                      00000970
         2 ÅR           PIC'(2)9',                                      00000980
         2 ÅRHUNDRE     PIC'9',                                         00000990
         2 FILLER       PIC'(4)9';                                      00001000
    DCL                                                                 00001010
       1 DØDSDATO       DEF DØDSTPKT,                                   00001020
         2 ÅR           PIC'(2)9',                                      00001030
         2 MND          PIC'(2)9',                                      00001040
         2 DAG          PIC'(2)9';                                      00001050
    DCL                                                                 00001060
       1 ÅRMND_DEF      DEF ÅRMND,                                      00001070
         2 ÅR           PIC'(2)9',                                      00001080
         2 MND          PIC'(2)9';                                      00001090
    DCL                                                                 00001100
       1 DAGENS_DATO    DEF DATO,                                       00001110
         2 ÅR           PIC'(2)9',                                      00001120
         2 MND          PIC'(2)9',                                      00001130
         2 DAG          PIC'(2)9';                                      00001140
    DCL                                                                 00001150
       W_TP_VT          FIXED DEC(5)   INIT(0),                         00001160
       W_TP             FIXED DEC(5)   INIT(0),                         00001170
       W_TP_ALT         FIXED DEC(5)   INIT(0);                         00001180
    DCL                                                                 00001190
       SISTE_UFØR_START FIXED DEC(2)   INIT(0);                         00001200
    DCL TELLER          FIXED DEC(3)   INIT(0);                         00001210
 /* DCL BUP_FPP92       FIXED DEC(3,2) INIT(0);                  */     00001220
    DCL BUP_FPP92(63:150)      FIXED DEC(3,2) ;   /*9807*/              00001230
    DCL BUP92_UFØR      FIXED DEC(3,2) INIT(0);              /*HL*/     00001240
    DCL FLYTTE_POENG    FIXED DEC(3,2) INIT(0);              /*HL*/     00001250
    DCL FRA_ÅR          FIXED BIN(15);                       /*HL*/     00001260
    DCL POENG_E91       CHAR (1)       INIT (' ');           /*TS*/     00001270
    DCL HL_PÅR          FIXED DEC(3)   INIT(0);                         00001280
    DCL TS_POANV        FIXED DEC(3,2)   INIT(0);                       00001290
                                                                        00001300
        DCL PÅE    PIC '99';                                            00001310
        DCL PÅE1   PIC '99';                                            00001320
    DCL VIRK_LOV92_ÅM   PIC   '(4)9'   INIT(0);              /*HL*/     00001330
    DCL UNG_UFØR_START_ÅR  PIC'999' INIT(0);             /*9807*/       00001340
 %PAGE;                                                                 00001350
                                                                        00001360
 /*   HER STARTER PROGRAMBEHANDLINGEN       *********************/      00001370
                                                                        00001380
    UIBPTR                  = UIB_PEKER;                                00001390
    W_PEKER                 = WORK_TRANS_LISTE_PEKER;                   00001400
    WORK_TRANS_LISTE_PEKER  = ADDR(TAB);                                00001410
    VIRK_LOV92_ÅM           = F_SNU_DATO(VIRKNINGSDATO);     /*HL*/     00001420
    BUP_FPP92(*)            = 0;                   /*9807*/             00001430
                                                                        00001440
    IF B01_B02_IND          = 1 THEN                                    00001450
       B01_B02_PEKER        = B01_PEKER;                                00001460
    ELSE                                                                00001470
       B01_B02_PEKER        = B02_PEKER;                                00001480
                                                                        00001490
    DATO                    = DATE;                                     00001500
    DØDSTPKT                = B02.DØDSDATO_ÅMD(IND);                    00001510
    W_FNR                   = B02.FNR(IND);                             00001520
                                                                        00001530
    IF W_FNR_R.ÅRHUNDRE > 4 & W_FNR_R.ÅR < 98 THEN                      00001540
       GO TO L999;                                                      00001550
                                                                        00001560
    FAST_G                  = 2000;                                     00001570
                                                                        00001580
    ÅR_FØR_AP               = W_FNR_R.ÅR + 66;                          00001590
    IF W_FNR_R.ÅRHUNDRE > 4      THEN                                   00001600
       ÅR_FØR_AP            = ÅR_FØR_AP - 100 + 3;                      00001610
    ELSE                                                                00001620
       IF W_FNR_R.ÅR < 4         THEN                                   00001630
          ÅR_FØR_AP         = ÅR_FØR_AP + 3;                            00001640
       ELSE                                                             00001650
          IF W_FNR_R.ÅR > 3 & W_FNR_R.ÅR < 6   THEN                     00001660
          ÅR_FØR_AP         = 72;                                       00001670
                                                                        00001680
    SEKSTINIÅR              = W_FNR_R.ÅR + 69;                          00001690
    IF W_FNR_R.ÅRHUNDRE > 4      THEN                                   00001700
       SEKSTINIÅR           = SEKSTINIÅR - 100;                         00001710
    SEKSTISEKSÅR            = SEKSTINIÅR - 3;                           00001720
                                                                        00001730
 %PAGE;                                                                 00001740
                                                                        00001750
    /*  CALL KLARGJØR_TAB(TAB)         4151*/                           00001760
    CALL KLARGJØR_TAB;             /*4151    ENDERET SATISH 21.4.91 */  00001770
                                                                        00001780
    CALL BEREGN_POENGREKKE(IND,W_FNR);  /*4152*/                        00001790
                                                                        00001800
                                                                        00001810
    /* VI FJERNER IKKE DENNE - 9711 HL : ****************************** 00001820
    B02.ALDERSP.AFP_BUP(IND)  = 0;                                      00001830
     ************************************************* */               00001840
                                                                        00001850
    IF FEIL_MELD_NR > 0  THEN                                           00001860
       GO TO L999;                                                      00001870
    ELSE                                                                00001880
       PROGRAM_ID = 'R0014141';                                         00001890
                                                                        00001900
    POREKKE.TYPE(IND) = 'O';                                            00001910
 /*                                                                   */00001920
 /*    'O' STÅR FOR ORDINÆR POENGREKKE                                */00001930
 /*                                                                   */00001940
                                                                        00001950
    DO I = 63 TO SEKSTINIÅR;                                            00001960
       IF TAB.POENG_ANVENDT(I)  = TAB.VERNEPL_POENG(I) &                00001970
          TAB.VERNEPL_POENG(I) > 0                     THEN             00001980
 /*                                                                   */00001990
 /*       VERNEPLIKTSPOENG SKAL IKKE VÆRE MED VED                     */00002000
 /*       BEREGNING AV SLUTTPOENGTALL..                               */00002010
 /*                                                                   */00002020
          POREKKE.POENG(IND,I)   = TAB.INNT_POENG(I) + 0.005;           00002030
       ELSE                                                             00002040
          POREKKE.POENG(IND,I)   = TAB.POENG_ANVENDT(I);                00002050
          TS_POANV               = TAB.POENG_ANVENDT(I);                00002060
       POREKKE.KODE(IND,I)       = TAB.POENG_KODE(I);                   00002070
       POREKKE.UFG(IND,I)        = TAB.UFØR_GRAD(I);                    00002080
       POREKKE.BUP_FPP(IND,I)    = TAB.BUP_FPP(I);                      00002090
       IF TAB.POENG_KODE(I)      = 'U54'      !                         00002100
          TAB.POENG_KODE(I)      = 'U60'              THEN              00002110
          DO;                                                           00002120
            IF B02.PENSJONSTYPE1(IND)  = 'K'  THEN                      00002130
             B02.ALDERSP.AFP_BUP(IND)  = POREKKE.BUP_FPP(IND,I);/*0897*/00002140
    /* VI FJERNER IKKE DENNE - 9711 HL : ****************************** 00002150
            ELSE                                                        00002160
             B02.ALDERSP.AFP_BUP(IND)  = 0;                             00002170
     ************************************************** */              00002180
                                                                        00002190
 /*ENDRET 10.5.91 HL : BEGRENSET ANTALL FREMTIDIGE POENGÅR*/            00002200
                                                                        00002210
  /*         IF I < 73                                THEN              00002220
                POREKKE.BUP_FPP_ÅR(IND)  = W_FNR_R.ÅR + 70 - I;         00002230
             ELSE                                                       00002240
                POREKKE.BUP_FPP_ÅR(IND)  = W_FNR_R.ÅR + 67 - I;         00002250
             IF W_FNR_R.ÅRHUNDRE > 4                  THEN              00002260
                POREKKE.BUP_FPP_ÅR(IND)  =                              00002270
                                          POREKKE.BUP_FPP_ÅR(IND) - 100;00002280
  */                                                                    00002290
                                                                        00002300
             IF I < 73                                THEN              00002310
                TELLER  = W_FNR_R.ÅR + 70 - I;                          00002320
             ELSE                                                       00002330
                TELLER  = W_FNR_R.ÅR + 67 - I;                          00002340
             IF W_FNR_R.ÅRHUNDRE > 4                  THEN              00002350
                TELLER  = POREKKE.BUP_FPP_ÅR(IND) - 100;                00002360
             TELLER = TELLER - 1;                                       00002370
             DO K = 0 TO TELLER WHILE                                   00002380
                   (TAB.SISTE_BUP_ÅR(I + K) ^= 'J');                    00002390
             END;                                                       00002400
             IF K > TELLER THEN                                         00002410
                POREKKE.BUP_FPP_ÅR(IND)  = K;                           00002420
             ELSE                                                       00002430
                POREKKE.BUP_FPP_ÅR(IND)  = K + 1;                       00002440
          END;                                                          00002450
      /*  KOMMENTERT BORT. PGA. KOMPILERING MED INTERTEST IDAG          00002460
         TRUDE 030297                                                   00002470
       IF B02.NORDISK_KONVENSJON(IND) = 'J' THEN                        00002480
          POREKKE.BUP_FPP_ÅR(IND) = B02.PÅ_FAKTISK_NORDEN(IND);         00002490
      ************* */                                                  00002500
       /* ^DENNE VIL BLI RETTA TILBAKE TIL NORSK REDUSERT ANTALL BUP    00002510
          ÅR I DELPROCEDYRA R0014470, MEN ER NØDVENDIG FOR Å FÅ FRAM    00002520
          KORREKT ANTALL BUP ÅR HER, MHA7339: 211196 */                 00002530
   HL_PÅR = POREKKE.BUP_FPP_ÅR(IND);                                    00002540
 /*HIT 10.5.91 HL */                                                    00002550
    END;                                                                00002560
                                                                        00002570
    CALL BEREGN_SPT_OPT_PÅ(IND,POREKKE(IND),W_FNR);    /*4153*/         00002580
                                                                        00002590
    POREKKE_P67(IND) = POREKKE(IND);                                    00002600
    POREKKE_PT (IND) = POREKKE(IND);                                    00002610
                                                                        00002620
    CALL SETT_TP_VT_GRUNNLAG;                           /*4144*/        00002630
    CALL BEREGN_SPT_OPT_PÅ(IND,POREKKE_P67(IND),W_FNR); /*4153*/        00002640
                                                                        00002650
    SIST_REG = 1;                                                       00002660
    DO I = 1 TO 7 WHILE(B02.UFT_ÅM(IND,I) > 0);  /*0697 HL*/            00002670
       SIST_REG = I;                                                    00002680
    END;                                                                00002690
                                                                        00002700
    IF (B02.UFT_ÅM     (IND,SIST_REG) > 0     &                         00002710
        B02.UFT_ÅM     (IND,SIST_REG) < 7301) &                         00002720
        B02.OPPHØRSKODE(IND,SIST_REG) ^= 'J'    THEN                    00002730
       DO;                                                              00002740
 /*                                                                   */00002750
 /*    UFØR FØR 1973, UNDERSØKER OM DET FINNES BEDRE ALT. TIL TP..... */00002760
 /*                                                                   */00002770
                                                                        00002780
          SISTE_UFØR_START = 0;                                         00002790
          DO I = SEKSTINIÅR TO 67 BY -1;                                00002800
             IF TAB.UFØR_PERIODE(I) = 'S' THEN                          00002810
                DO;                                                     00002820
                   SISTE_UFØR_START = I;                                00002830
                   I = 67;                                              00002840
                END;                                                    00002850
          END;                                                          00002860
 %PAGE;                                                                 00002870
          IF SISTE_UFØR_START > 66 & SISTE_UFØR_START < 73 THEN         00002880
             DO;                                                        00002890
                                                                        00002900
                IF  (B02.PENSJONSTYPE1(IND) = 'D'          !            00002910
                     B02.PENSJONSTYPE1(IND) = 'A'  )       &            00002920
                     W_FNR_R.ÅRHUNDRE       <  5           &            00002930
                     W_FNR_R.ÅR             >  02         THEN          00002940
                                                                        00002950
                   DO;                                                  00002960
 /*4142*/             W_TP    = F_TILLEGGSPENSJON(W_FNR_R.ÅR,G,         00002970
                                               POREKKE.SPT(IND),        00002980
                                               POREKKE.OPT(IND),        00002990
                                               POREKKE.PÅ (IND),        00003000
                                               100,100,'J');            00003010
                                                                        00003020
 /*4142*/             W_TP_VT = F_TILLEGGSPENSJON(W_FNR_R.ÅR,G,         00003030
                                               POREKKE_P67.SPT(IND),    00003040
                                               POREKKE_P67.OPT(IND),    00003050
                                               POREKKE_P67.PÅ (IND),    00003060
                                               100,100,'J');            00003070
                                                                        00003080
                      IF B02.PENSJONSTYPE1(IND) = 'A' THEN              00003090
                         W_POREKKE.TYPE = 'U';                          00003100
                      ELSE                                              00003110
                         W_POREKKE.TYPE = 'D';                          00003120
                                                                        00003130
  /* ************************************************************** */  00003140
  /* ERIK, MAI 1990                                                 */  00003150
  /* ************************************************************** */  00003160
                                                                        00003170
                                                                        00003180
 /*UTLAND*/                                                             00003190
                                                                        00003200
 /*FJERNET 11.7.90  IF B02.SPESOPPL.BOSATT(IND) = 0    &    */          00003210
                    IF B02.SPESOPPL.BOSATT(IND) = 0    !                00003220
                       B02.STATUS.VILKÅR_8_4_3A(IND) = 'J' THEN         00003230
                                                                        00003240
 /*UTLAND HIT*/                                                         00003250
                                                                        00003260
 /*4154*/             CALL BEREGN_BUP_FPP_ALTERNATIV(IND,W_FNR);        00003270
                                                                        00003280
                      DO I = 63 TO 150;                                 00003290
                         IF TAB.POENG_ANVENDT(I) =                      00003300
                                          TAB.VERNEPL_POENG(I) &        00003310
                             TAB.VERNEPL_POENG(I) > 0          THEN     00003320
                             W_POREKKE.POENG(I) = TAB.INNT_POENG(I) +   00003330
                                                               0.005;   00003340
                                                                        00003350
 /*                                                                   */00003360
 /*                      VERNEPLIKTSPOENG SKAL IKKE VÆRE MED VED      */00003370
 /*                      BEREGNING AV SLUTTPOENGTALL..                */00003380
 /*                                                                   */00003390
                                                                        00003400
                         ELSE                                           00003410
                            W_POREKKE.POENG(I)  =                       00003420
                                          TAB.POENG_ALTERNATIV(I);      00003430
                         W_POREKKE.KODE(I)      =                       00003440
                                          TAB.POENG_ALTERNATIV_KODE(I); 00003450
                         W_POREKKE.UFG(I)       = TAB.UFØR_GRAD(I);     00003460
                         W_POREKKE.BUP_FPP(I)   = TAB.BUP_FPP(I);       00003470
                                                                        00003480
                         IF I > (SEKSTINIÅR - 3) & I > 72         THEN  00003490
                            W_POREKKE.UFG(I)    =                       00003500
                                                TAB.UFØR_GRAD(I - 1);   00003510
                                                                        00003520
                         IF TAB.POENG_ALTERNATIV_KODE  (I)              00003530
                                                  = 'U54'    &          00003540
                                                                        00003550
 /* ENDRET 1.4.86  HL  - DET SKAL OGSÅ TESTES PÅ 'D'           */       00003560
                                                                        00003570
                            (TAB.UFØR_PERIODE(I)   = 'S'   !            00003580
                             TAB.UFØR_PERIODE(I)   = 'D'     )  THEN    00003590
                                                                        00003600
 /* HIT 1.4.86 HL                                              */       00003610
                                                                        00003620
 /*ENDRET 10.5.91 HL : BEGRENSET ANTALL FREMTIDIGE POENGÅR*/            00003630
                                                                        00003640
                         DO;                                            00003650
 /*                         W_POREKKE.BUP_FPP_ÅR        =               00003660
                                                W_FNR_R.ÅR + 70 - I;    00003670
                            IF W_FNR_R.ÅRHUNDRE > 4         THEN        00003680
                               W_POREKKE.BUP_FPP_ÅR     =               00003690
                                    W_POREKKE.BUP_FPP_ÅR - 100;         00003700
 */                                                                     00003710
                                                                        00003720
                             TELLER  = W_FNR_R.ÅR + 70 - I;             00003730
                             IF W_FNR_R.ÅRHUNDRE > 4               THEN 00003740
                                TELLER  = POREKKE.BUP_FPP_ÅR(IND) - 100;00003750
                             TELLER = TELLER - 1;                       00003760
                             DO K = 0 TO TELLER WHILE                   00003770
                                   (TAB.SISTE_BUP_ÅR(I + K) ^= 'J');    00003780
                             END;                                       00003790
                             IF K ^> TELLER THEN                        00003800
                                K  = K + 1;                             00003810
  /*3.5.96 HL                POREKKE.BUP_FPP_ÅR(IND)  = K;    */        00003820
                             W_POREKKE.BUP_FPP_ÅR     = K;              00003830
                                                                        00003840
 /*HIT 10.5.91 HL */                                                    00003850
                         END;                                           00003860
                      END;                                              00003870
                                                                        00003880
                      CALL BEREGN_SPT_OPT_PÅ_ALT(IND,W_POREKKE,         00003890
                                             W_FNR);   /*R0014156*/     00003900
                                                                        00003910
                      IF B02.PENSJONSTYPE1(IND) = 'A' THEN              00003920
                                                                        00003930
 /*4142*/                W_TP_ALT = F_TILLEGGSPENSJON(W_FNR_R.ÅR,G,     00003940
                                                   W_POREKKE.SPT,       00003950
                                                   W_POREKKE.OPT,       00003960
                                                   W_POREKKE.PÅ,        00003970
                                                   100,100,'J');        00003980
                                                                        00003990
                      ELSE                                              00004000
                                                                        00004010
 /*4142*/                W_TP_ALT = F_TILLEGGSPENSJON(W_FNR_R.ÅR,G,     00004020
                                                   W_POREKKE.SPT,       00004030
                                                   W_POREKKE.OPT,       00004040
                                                   W_POREKKE.PÅ,        00004050
                                                   100,100,'J');        00004060
                                                                        00004070
                      IF POREKKE_PT.PÅ (IND) < W_POREKKE.PÅ  THEN       00004080
                                                                        00004090
                         POREKKE_PT (IND) = W_POREKKE;                  00004100
                                                                        00004110
                      IF W_TP_ALT >= W_TP    THEN                       00004120
                                                                        00004130
                         DO;                                            00004140
                            POREKKE    (IND) = W_POREKKE;               00004150
                            POREKKE.BUP_FPP_ÅR(IND)  = K;               00004160
                         END;                                           00004170
                                                                        00004180
                      IF W_TP_ALT >= W_TP_VT THEN                       00004190
                                                                        00004200
                            POREKKE_P67(IND) = W_POREKKE;               00004210
                                                                        00004220
 /*28.11.86 HL - FRAPP 270 - VI SAVER I OMRÅDE 12 ELLER 13 */           00004230
                                                                        00004240
                      POREKKE(IND + 11)     = W_POREKKE;                00004250
                                                                        00004260
                      POREKKE_P67(IND + 11) = W_POREKKE;                00004270
 /* HIT 28.11.86 HL ************************************   */           00004280
                                                                        00004290
                   END;                                                 00004300
             END;                                                       00004310
       END;                                                             00004320
    ELSE                                                                00004330
                                                                        00004340
       IF B02.UFT_ÅM     (IND,SIST_REG) >= 7301 &                       00004350
         ( B02.OPPHØRSKODE(IND,SIST_REG)  ^= 'J'  &                     00004360
           B02.PENSJONSTYPE1(IND)          = 'D' )   THEN               00004370
                                                                        00004380
                                                                        00004390
          /* GIR 100 PROSEN UP-TP MER ENN EP-TP               */        00004400
                                                                        00004410
          DO;                                                           00004420
                                                                        00004430
            PÅE   =    POREKKE.PÅ_ETTER91(IND);                         00004440
             IF ^ (DØDSDATO.ÅR > 91    &                                00004450
                   W_FNR_R.ÅR  > 25    &                                00004460
                   W_FNR_R.ÅRHUNDRE < 5  )     THEN                     00004470
                DO;                                                     00004480
                  IF POREKKE.PÅ_ETTER91(IND)   >  0 &                   00004490
                     SEKSTINIÅR                > 91 &                   00004500
                    (POREKKE.POENG(IND,(SEKSTISEKSÅR + 1)) +            00004510
                     POREKKE.POENG(IND,(SEKSTISEKSÅR + 2)) +            00004520
                     POREKKE.POENG(IND,(SEKSTISEKSÅR + 3)) > 0)  THEN   00004530
                      POENG_E91   = 'J' ;                               00004540
                  ELSE                                                  00004550
                     POREKKE.PÅ_ETTER91(IND) = 0;                       00004560
                END;                                                    00004570
                                                                        00004580
            PÅE1  =    POREKKE.PÅ_ETTER91(IND);                         00004590
 /*4142*/    W_TP    = F_TP92  (W_FNR_R.ÅR,G,                           00004600
                                         POREKKE.SPT(IND),              00004610
                                         POREKKE.OPT(IND),              00004620
                                         POREKKE.PÅ (IND),              00004630
                                    POREKKE.PÅ_ETTER91 (IND),           00004640
                                         100,100,'J');                  00004650
                                                                        00004660
             W_POREKKE = POREKKE(IND);                                  00004670
     /*9712 HL : */                                                     00004680
             W_POREKKE.POENG(SEKSTISEKSÅR + 1) = 0;                     00004690
             W_POREKKE.POENG(SEKSTISEKSÅR + 2) = 0;                     00004700
             W_POREKKE.POENG(SEKSTISEKSÅR + 3) = 0;                     00004710
     /*HIT*/                                                            00004720
             ÅRMND     = B02.UFT_ÅM     (IND,SIST_REG);                 00004730
             FRA_ÅR    = ÅRMND_DEF.ÅR;                                  00004740
                                                                        00004750
             FLYTTE_POENG = W_POREKKE.BUP_FPP(ÅRMND_DEF.ÅR);            00004760
                                                                        00004770
         /*  DO I = ÅRMND_DEF.ÅR TO SEKSTISEKSÅR  ** ENDRET: SE WHILE*/ 00004780
         /*  ENDRET PGA REDUSERT FREMTIDIG BUP ÅR. TRUDE 120995      */ 00004790
                                                                        00004800
             DO I = ÅRMND_DEF.ÅR TO SEKSTISEKSÅR WHILE                  00004810
                               (TAB.SISTE_BUP_ÅR(I) ^= 'J');            00004820
                IF VIRK_LOV92_ÅM    > 9200        &                     00004830
                   I                = 92         THEN                   00004840
                   DO;                                                  00004850
                      FLYTTE_POENG     = BUP92_UFØR;                    00004860
                      FRA_ÅR           = 92;                            00004870
                   END;                                                 00004880
 /*             W_POREKKE.POENG(I)  = W_POREKKE.BUP_FPP(ÅRMND_DEF.ÅR)*/ 00004890
                IF B02.OPPHØRSKODE(IND,SIST_REG)  = 'D'    THEN         00004900
                   W_POREKKE.POENG(I)  = FLYTTE_POENG;                  00004910
 /*             W_POREKKE.KODE (I)  = '   ';                 */         00004920
                                                                        00004930
             END;                                                       00004940
                                                                        00004950
             W_POREKKE.KODE(FRA_ÅR) = 'U54';                            00004960
                                                                        00004970
 /*ENDRET 10.5.91 HL : BEGRENSET ANTALL FREMTIDIGE POENGÅR*/            00004980
                                                                        00004990
  /*    W_POREKKE.BUP_FPP_ÅR  = SEKSTISEKSÅR - ÅRMND_DEF.ÅR + 1; */     00005000
                                                                        00005010
             TELLER = SEKSTISEKSÅR - ÅRMND_DEF.ÅR;                      00005020
             IF SEKSTISEKSÅR > 91       THEN                            00005030
                IF ÅRMND_DEF.ÅR > 91    THEN                            00005040
                   I = ÅRMND_DEF.ÅR;                                    00005050
                ELSE                                                    00005060
                   DO;                                                  00005070
                      I = 92;                                           00005080
                      TELLER = SEKSTISEKSÅR - 92;                       00005090
                   END;                                                 00005100
             ELSE                                                       00005110
                I = ÅRMND_DEF.ÅR;                                       00005120
             DO K = 0 TO TELLER WHILE                                   00005130
                         (TAB.SISTE_BUP_ÅR(I + K) ^= 'J');              00005140
             END;                                                       00005150
             W_POREKKE.BUP_FPP_ÅR  = K;                                 00005160
                                                                        00005170
 /*HIT 10.5.91 HL */                                                    00005180
                                                                        00005190
             CALL BEREGN_SPT_OPT_PÅ(IND,W_POREKKE,W_FNR);               00005200
                                                     /*R0014153*/       00005210
      /*     IF ^ (DØDSDATO.ÅR > 91    &                                00005220
                   W_FNR_R.ÅR  > 25    &                                00005230
                   W_FNR_R.ÅRHUNDRE < 5  )     THEN                     00005240
                 W_POREKKE.PÅ_ETTER91   = 0;           */               00005250
                                                                        00005260
             IF  POENG_E91   = ' '  &          /*TS0895*/               00005270
                 ÅRMND       < 9200    THEN                             00005280
                   W_POREKKE.PÅ_ETTER91  = 0;                           00005290
                                                                        00005300
                                                                        00005310
 /*4148*/    W_TP_ALT = F_TP92(W_FNR_R.ÅR,G,                            00005320
                                          W_POREKKE.SPT,                00005330
                                          W_POREKKE.OPT,                00005340
                                          W_POREKKE.PÅ,                 00005350
                                    W_POREKKE.PÅ_ETTER91,               00005360
                                          100,100,'J');                 00005370
                                                                        00005380
 /*ENDRET    IF W_TP_ALT >= W_TP    THEN   20.7.89   HL  */             00005390
             IF W_TP_ALT >  W_TP    THEN                                00005400
                                                                        00005410
                POREKKE    (IND) = W_POREKKE;                           00005420
                                                                        00005430
          END;                                                          00005440
                                                                        00005450
                                                                        00005460
 %INCLUDE R0014142; /* F_TILLEGGSPENSJON                      */        00005470
 %INCLUDE R0014144; /* SET_TP_VT_GRUNNLAG                     */        00005480
 %INCLUDE R0014148; /* F_TP92                                 */        00005490
 %INCLUDE R0014151; /* KLARGJØR_TABELLEN                      */        00005500
 %INCLUDE R0014152; /* BEREGN_POENGREKKE                      */        00005510
 %INCLUDE R0014153; /* BEREGN_SPT_OPT_PÅ                      */        00005520
 %INCLUDE R0014154; /* BEREGN_BUP_FPP_ALT.                    */        00005530
 %INCLUDE R0014156; /* BEREGN_SPT_OPT_PÅ_ALT.                 */        00005540
 %INCLUDE R0014159; /* UNGE_DØDE_B_E                          */        00005550
 %INCLUDE R0014161; /* LEGG_UFØREHIST_I_TAB                   */        00005560
 %INCLUDE R0014162; /* LEGG_INNT_FØR_67_I_TAB                 */        00005570
 %INCLUDE R0014163; /* F_INNTEKT_POENG                        */        00005580
 %INCLUDE R0014164; /* BEREGN_BUP_FPP                         */        00005590
  /*  %INCLUDE R0014165;    PLUKK_UT_BESTE_POENG             */         00005600
 %INCLUDE R0014166; /* LEGG_YRKEHIST_I_TAB                    */        00005610
 %INCLUDE R0014168; /* LEGG_AFPHIST_I_TAB                     */        00005620
 %INCLUDE R0014171; /* REGN_BUP_FPP                           */        00005630
 %INCLUDE R0014172; /* F_INNTEKT_POENG_LOV92                  */        00005640
 %INCLUDE R0019905; /* F_ALDER                                */        00005650
 %INCLUDE R0019913; /* F_SNU_DATO                             */        00005660
                                                                        00005670
 L999:                                                                  00005680
   HL_PÅR = POREKKE.BUP_FPP_ÅR(IND);                                    00005690
  DCL TEST77_KODE   CHAR (5);                                           00005700
  DCL TEST78_KODE   CHAR (5);                                           00005710
      TEST77_KODE = TAB.POENG_KODE(77);                                 00005720
      TEST78_KODE = TAB.POENG_KODE(78);                                 00005730
    WORK_TRANS_LISTE_PEKER = W_PEKER;                                   00005740
    EXEC CICS RETURN;                                                   00005750
                                                                        00005760
                                                                        00005770
 END BESPT;                                                             00005780
                                                                        00005790
