 /*       SIST ENDRET 16/09-97 10.24.53 AV   JDA7339                  */00000000
 /*       SIST ENDRET 15/09-97 13.31.39 AV   JDA7339                  */00000010
 /*       SIST ENDRET 29/08-97 12.30.20 AV   JDA7339                  */00000020
 /*       SIST ENDRET 28/08-97 08.54.08 AV   SPA7339                  */00000030
 /*       SIST ENDRET 31/01-97 14.01.37 AV   JDA0310                  */00000040
 /*       SIST ENDRET 02/11-95 14.49.19 AV   TSB0310                  */00000050
 /*       SIST ENDRET 12/10-95 14.26.06 AV   JDA0310                  */00000060
 /*       SIST ENDRET 06/01-95 10.45.43 AV   TSB0310                  */00000070
 /*       SIST ENDRET 28/09-94 12.26.50 AV   JDA0310                  */00000080
 /*       SIST ENDRET 15/04-93 10.08.09 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 25/03-93 13.03.20 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 22/03-93 09.18.46 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 24/08-92 12.27.47 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 23/03-92 14.59.36 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 17/02-92 13.48.05 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 13/12-91 12.57.30 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 06/03-91 14.34.01 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 21/01-91 14.17.56 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 11/12-90 13.23.53 AV   DYBVIK                   */00000180
 /* ***************************************************************** */00000190
 /*IDENTIFIKASJON:                                                    */00000200
 /*    R0014101 - BEREGN_ETTERLATT_AP - HOVEDPROGRAM I PLI            */00000210
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982                           */00000220
 /*    SIST ENDRET AV KARIN I JULI 82                                 */00000230
 /*HENSIKT:                                                           */00000240
 /*    PROGRAMMET FORETAR BEREGNING FOR ETTERLATT_AP OG INKLUDERER    */00000250
 /*    DE NØDVENDIGE UNDERMODULER.                                    */00000260
 /*PROGRAMTILKNYTNING:                                                */00000270
 /*    PROGRAMMET BLIR LINKET FRA R0014001 - (BEREGNING).             */00000280
 /*BRUK:                                                              */00000290
 /*    EXEC CICS LINK PROGRAM('R0014101') COMMAREA(KOM_OMR);          */00000300
 /* ***************************************************************** */00000310
 R001410: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                          00000320
                                                                        00000330
 %PAGE;                                                                 00000340
 %INCLUDE P0014009;  /*                           */                    00000350
 %PAGE;                                                                 00000360
 %INCLUDE P0014003;  /* TAB                       */                    00000370
 %PAGE;                                                                 00000380
 %INCLUDE P0014002;  /* W_POENG_REKKE             */                    00000390
 %PAGE;                                                                 00000400
 %INCLUDE P0019906;  /* TRANS-OPPL-OMRÅDE (BASED) */                    00000410
 %PAGE;                                                                 00000420
 %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)        */                    00000430
 %PAGE;                                                                 00000440
 %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE(BASED)   */                    00000450
 %PAGE;                                                                 00000460
 %INCLUDE P0019924;  /* GRUNNBELØP VEIET-GJENNOMSNITT */                00000470
 %PAGE;                                                                 00000480
 /*YS*/%INCLUDE P0019925;  /* GRUNNBELØP              */                00000490
 %PAGE;                                                                 00000500
 %INCLUDE P0019910;  /*                               */                00000510
 %PAGE;                                                                 00000520
 DCL                                                                    00000530
 1 B01 BASED(B01_PEKER),                                                00000540
 %INCLUDE P0019921;  /* B01-OMRÅDE (BASED)        */                    00000550
 %PAGE;                                                                 00000560
 DCL                                                                    00000570
 1 B02 BASED(B02_PEKER),                                                00000580
 %INCLUDE P0019921;  /* B02-OMRÅDE (BASED)        */                    00000590
 %PAGE;                                                                 00000600
                                                                        00000610
                                                                        00000620
 DCL                                                                    00000630
    COMMAREA_PEKER         PTR;                                         00000640
 DCL                                                                    00000650
   (ADDR,                                                               00000660
    CSTG,                                                               00000670
    ROUND)                             BUILTIN;                         00000680
                                                                        00000690
 DCL                                                                    00000700
    I,                                                                  00000710
    J                BINARY FIXED(15),                                  00000720
   APD_ØNSKET                   FIXED DEC(3),                           00000730
 /*YS*/  TILLEGGSBLANKETT_YRKESSKADE  CHAR (1) INIT (' ');              00000740
                                                                        00000750
 DCL TP_EGEN         FIXED DEC (7) INIT (0);                            00000760
 DCL TP_PT_EGEN_55   FIXED DEC (7) INIT (0);                            00000770
 DCL TP_EK_PT        FIXED DEC (7) INIT (0);                            00000780
                                                                        00000790
 DCL AP_TEI        FIXED DEC (7) INIT (0);      /* NYE  0192 */         00000800
                                                                        00000810
 DCL AP_GP           FIXED DEC (7) INIT (0),      /* NYE  0192 */       00000820
     AP_TP           FIXED DEC (7) INIT (0),                            00000830
     EP_TP           FIXED DEC (7) INIT (0),                            00000840
     AP_GT           FIXED DEC (7) INIT (0),                            00000850
     AP_ST           FIXED DEC (7) INIT (0),                            00000860
     AP_KT           FIXED DEC (7) INIT (0);                            00000870
 DCL GAR92_EGEN      FIXED DEC (5) INIT (0);                            00000880
 DCL GAR92_EGEN_55   FIXED DEC (5) INIT (0);                            00000890
 DCL GAR92_AVD       FIXED DEC (5) INIT (0);                            00000900
 DCL UFØR_FØR_73     CHAR      (1) INIT (' ');    /*TS 300392*/         00000910
                                                                        00000920
 DCL W_SUM_YTELSE    FIXED DEC (7) INIT (0);                            00000930
 DCL SØTTI           FIXED DEC (5) INIT (0);                            00000940
 DCL MÅNED_ÅR        PIC '9999';                                        00000950
 DCL VIRKNINGSÅR DEF MÅNED_ÅR POS (3) PIC '99';                         00000960
 DCL W_TT_KONVENSJON FIXED DEC (5) INIT (0);                            00000970
                                                                        00000980
 DCL                                                                    00000990
   1 W_FNR                   PIC'(11)9';                                00001000
 DCL                                                                    00001010
   1 FNR_R DEF W_FNR,                                                   00001020
     2 DAG                     PIC '99',                                00001030
     2 MND                     PIC '99',                                00001040
     2 ÅR                      PIC '99',                                00001050
     2 ÅRHUNDRE                PIC '9',                                 00001060
     2 FILLER                  PIC '(4)9';                              00001070
                                                                        00001080
 DCL W_FNR_R    LIKE    FNR_R;                                          00001090
 DCL W_FNR_ÅM                  PIC '(4)9';                              00001100
                                                                        00001110
    DCL                                                                 00001120
       W_FNR_EK    PIC '(11)9';                                         00001130
    DCL                                                                 00001140
       ALDER_EK    PIC '(4)9';                                          00001150
    DCL                                                                 00001160
       1 FNR_EK_R       DEF W_FNR_EK,                                   00001170
         2 DAG_EK       PIC'99',                                        00001180
         2 MND_EK       PIC'99',                                        00001190
         2 ÅR_EK        PIC'99',                                        00001200
         2 ÅRHUNDRE_EK  PIC'9',                                         00001210
         2 FILLER_EK    PIC'(4)9';                                      00001220
                                                                        00001230
   DCL ST_BEREGNET(2) CHAR (1) INIT (' ');                              00001240
                                                                        00001250
 %SKIP(3);                                                              00001260
 W_FNR_EK       = B02.FNR(BER_EK_IND);                                  00001270
                                                                        00001280
 W_FNR          = B02.FNR(BER_SØ_IND);                                  00001290
                                                                        00001300
 W_FNR_ÅM       = FNR_R.ÅR!!FNR_R.MND;                  /*NY0192*/      00001310
 ST_BEREGNET(1)   = ' ';                                                00001320
 ST_BEREGNET(2)   = ' ';                                                00001330
                                                                        00001340
 DIV_PARAM_OMR.TAI(1)      = 0;                                         00001350
 DIV_PARAM_OMR.TAI(2)      = 0;                                         00001360
 DIV_PARAM_OMR.AP_KODE_AEY (1) = ' ';                                   00001370
 DIV_PARAM_OMR.AP_KODE_AEY (2) = ' ';                                   00001380
                                                                        00001390
                                                                        00001400
 /*HL : BLANKETT E3 GA IKKE YRKESSKADEFORDEL FØR ENDRING 23.11.94 */    00001410
                                                                        00001420
 IF TRANS_OPPL_OMR.TRANSTYPE = 3          THEN                          00001430
    IF TRANS_OPPL_OMR.BLANKETTYPE   = 'E3' THEN     /*231194*/          00001440
       CALL HENT_FRA_E3;                            /*231194*/          00001450
    ELSE                                                                00001460
    IF TRANS_OPPL_OMR.BLANKETTYPE   = 'EP' THEN     /*231194*/          00001470
       CALL HENT_FRA_EP;                                                00001480
    ELSE                                                                00001490
    IF TRANS_OPPL_OMR.BLANKETTYPE   = 'EE' THEN     /*0195  */          00001500
       CALL HENT_FRA_EE;                                                00001510
 IF TILLEGGSBLANKETT_YRKESSKADE = 'J'     THEN                          00001520
    CALL BEREGN_POENG_AÅI_AVDØD;              /*4128*/                  00001530
                                                                        00001540
 MÅNED_ÅR = TRANS_OPPL_OMR.VIRKNINGSDATO;      /*STM FLYTTET */         00001550
 ALDER_EK  = F_ALDER(W_FNR_EK,MÅNED_ÅR);                                00001560
                                                                        00001570
 CALL BEREGN_ETTERLATT_AP_DEL1;                      /*R0014121*/       00001580
                                                                        00001590
 IF FEIL_MELD_NR > 0  THEN                                              00001600
    GO TO L999;                                                         00001610
 ELSE                                                                   00001620
    PROGRAM_ID = 'R0014101';                                            00001630
 DIV_PARAM_OMR.FULLT_SÆRTILLEGG(BER_SØ_IND) =                           00001640
                            B02.ALDERSP.ST(BER_SØ_IND);/*NY92*/         00001650
                                                                        00001660
 /*IF F_ALDER(TRANS_OPPL_OMR.FØDSNUMMER,TRANS_OPPL_OMR.VIRKNINGSDATO)*/ 00001670
                                                                        00001680
 /*LOVENDRING 1.1.91 HL : */                                            00001690
                                                                        00001700
                                                                        00001710
 IF VIRKNINGSÅR < 91 THEN                                               00001720
    SØTTI = 7000;                                                       00001730
 ELSE                                                                   00001740
    SØTTI = 7001;                                                       00001750
                                                                        00001760
 IF (W_FNR_ÅM  < 2501  &                           /*NY92*/             00001770
     FNR_R.ÅRHUNDRE < 5 ) !                        /*TS230392*/         00001780
    (B02.KONV_P_KODE(BER_SØ_IND)  = 'K' &          /*TS0393*/           00001790
     B02.UTTAKSDATO_ÅM(BER_SØ_IND) < 9200)  THEN   /*TS0393*/           00001800
   DO;                                                                  00001810
    IF F_ALDER((B02.FNR(BER_SØ_IND)),MÅNED_ÅR)                          00001820
       < SØTTI & FNR_R.ÅR > 02 & FNR_R.ÅRHUNDRE < 5 THEN                00001830
                                                                        00001840
     SELECT(TRANS_OPPL_OMR.TRANSTYPE);                                  00001850
       WHEN(1)  /* GRUNNBLANKETT ALDER  */                              00001860
         DO;                                                            00001870
                                                                        00001880
           IF TRANS_OPPL_OMR.BLANKETTYPE = 'AP' THEN                    00001890
              CALL HENT_FRA_AP;                                         00001900
                                                                        00001910
           IF TRANS_OPPL_OMR.BLANKETTYPE = 'A1' THEN                    00001920
              CALL HENT_FRA_A1;                                         00001930
           CALL BEREGN_APD(APD_ØNSKET);                /*R0014122*/     00001940
         END;                                                           00001950
       WHEN(3)  /* GRUNNBLANKETT ETTERLATT EKTEFELLE  */                00001960
         DO;                                                            00001970
            /*CALL TIL E3 PGA TT_KOVENSJON. TRUDE 230393*/              00001980
           IF TRANS_OPPL_OMR.BLANKETTYPE   = 'E3' THEN                  00001990
              CALL HENT_FRA_E3;                                         00002000
           ELSE                                                         00002010
           IF TRANS_OPPL_OMR.BLANKETTYPE   = 'EE' THEN   /*0195*/       00002020
              CALL HENT_FRA_EE;                                         00002030
                                                                        00002040
           APD_ØNSKET = 100;                                            00002050
           CALL BEREGN_APD(APD_ØNSKET);                /*R0014122*/     00002060
         END;                                                           00002070
       WHEN(8)  /* ENDRINGSBLANKETT - ENDRING I GRAD ELLER FAI */       00002080
         DO;                                                            00002090
           IF TRANS_OPPL_OMR.BLANKETTYPE   = 'EN' THEN                  00002100
              CALL BEREGN_APD(100) ;                 /*R0014122*/       00002110
           ELSE                                                         00002120
             DO;                                                        00002130
                CALL HENT_FRA_E1;                                       00002140
                CALL BEREGN_APD(APD_ØNSKET) ;         /*R0014122*/      00002150
             END;                                                       00002160
                                                                        00002170
         END;                                                           00002180
       WHEN(24)                                                         00002190
         DO;                                                            00002200
           CALL BEREGN_APD_OVERGANG_FRA_UP;            /*R0014123*/     00002210
         END;                                                           00002220
       WHEN(25)                                                         00002230
         DO;                                                            00002240
                                                                        00002250
 /* LOVENDRING PR 1.4.84          *       *         *      */           00002260
                                                                        00002270
           IF B02.STATUS.VIRK_DATO_ÅM(BER_SØ_IND) > 8403      THEN      00002280
              DO;                                                       00002290
                APD_ØNSKET       = 100;                                 00002300
                CALL BEREGN_APD (APD_ØNSKET);          /*R0014122*/     00002310
              END;                                                      00002320
                                                                        00002330
 /* HIT                     *               *         *       */        00002340
                                                                        00002350
           CALL BEREGN_APD_OVERGANG_FRA_KAP10;         /*R0014124*/     00002360
         END;                                                           00002370
       WHEN(41)                                                         00002380
         DO;                                                            00002390
                                                                        00002400
 /* LOVENDRING PR 1.4.84          *       *         *      */           00002410
                                                                        00002420
           IF B02.STATUS.VIRK_DATO_ÅM(BER_SØ_IND) > 8403      THEN      00002430
              DO;                                                       00002440
                APD_ØNSKET       = 100;                                 00002450
                CALL BEREGN_APD (APD_ØNSKET);          /*R0014122*/     00002460
              END;                                                      00002470
                                                                        00002480
 /* HIT                     *               *         *       */        00002490
                                                                        00002500
           CALL BEREGN_APD_OVERGANG_FRA_KAP10;         /*R0014124*/     00002510
                                                                        00002520
           CALL BEREGN_APD_OVERGANG_FRA_UP;            /*R0014123*/     00002530
         END;                                                           00002540
       OTHERWISE                                                        00002550
         DO;                                                            00002560
                                                                        00002570
           APD_ØNSKET = 100;                                            00002580
           CALL BEREGN_APD(APD_ØNSKET);                /*R0014122*/     00002590
         END;                                                           00002600
                                                                        00002610
     END; /* SELECT  */                                                 00002620
                                                                        00002630
     ELSE                                                               00002640
     /* PERSONEN ER MINST 70 ÅR ELLER FØDT FØR 1903 */                  00002650
                                                                        00002660
     CALL APD_70ÅR;                                    /*R0014125*/     00002670
   END;                                                                 00002680
   CALL BEREGN_ETTERLATT_AP_DEL3;                      /*R0014126*/     00002690
                                                                        00002700
 L999:                                                                  00002710
    EXEC CICS RETURN;                                                   00002720
                                                                        00002730
                                                                        00002740
 HENT_FRA_AP: PROC;                                                     00002750
 %INCLUDE P0010501;  /* AP-OMRÅDE                */                     00002760
   APD_ØNSKET = APS.APD;                                                00002770
 END HENT_FRA_AP;                                                       00002780
                                                                        00002790
 HENT_FRA_A1: PROC;                                                     00002800
 %INCLUDE P001N501;  /* A1-OMRÅDE                */                     00002810
   APD_ØNSKET = A1S.APD;                                                00002820
 END HENT_FRA_A1;                                                       00002830
                                                                        00002840
           /*TRUDE 23.03.93 */                                          00002850
 HENT_FRA_E3: PROC;                                                     00002860
 %INCLUDE P001N801;  /* E3-OMRÅDE                */                     00002870
   TILLEGGSBLANKETT_YRKESSKADE = E3S.YSKADE_TILLEGG;                    00002880
   IF E3SP.TT_KONVENSJON_ÅR > 0 THEN                                    00002890
      W_TT_KONVENSJON    = E3SP.TT_KONVENSJON_ÅR;                       00002900
 END HENT_FRA_E3;                                                       00002910
                                                                        00002920
 HENT_FRA_EE: PROC;                                                     00002930
 %INCLUDE P001U801;  /* EE-OMRÅDE                */                     00002940
   TILLEGGSBLANKETT_YRKESSKADE = EES.YSKADE_TILLEGG;                    00002950
   IF EESP.TT_KONVENSJON_ÅR > 0 THEN                                    00002960
      W_TT_KONVENSJON    = EESP.TT_KONVENSJON_ÅR;                       00002970
 END HENT_FRA_EE;                                                       00002980
                                                                        00002990
 HENT_FRA_EP: PROC;                                                     00003000
 %INCLUDE P0010801;  /* EP-OMRÅDE                */                     00003010
   TILLEGGSBLANKETT_YRKESSKADE = EPS.YSKADE_TILLEGG;                    00003020
 END HENT_FRA_EP;                                                       00003030
                                                                        00003040
 HENT_FRA_E1: PROC;                                                     00003050
 %INCLUDE P0011401;  /* E1-OMRÅDE                */                     00003060
     APD_ØNSKET = E1K7.APD;                                             00003070
 END HENT_FRA_E1;                                                       00003080
                                                                        00003090
 %PAGE;                                                                 00003100
                                                                        00003110
 % INCLUDE R0014111;   /*  BEREGN_GTLOV92_AE          NY92 */           00003120
 % INCLUDE R0014121;       /* BEREGN_ETTERLATT_AP_DEL1      */          00003130
 % INCLUDE R0014122;       /* BEREGN_APD                    */          00003140
 % INCLUDE R0014123;       /* BEREGN_APD_OVERGANG_FRA_UP    */          00003150
 % INCLUDE R0014124;       /* BEREGN_APD_OVERGANG_FRA_KAP10 */          00003160
 % INCLUDE R0014125;       /* APD_70ÅR                      */          00003170
 % INCLUDE R0014126;       /* BEREGN_ETTERLATT_AP_DEL3      */          00003180
 % INCLUDE R0014128;       /* BEREGN_POENG_AÅI_AVDØD        */          00003190
 % INCLUDE R0014129;       /* BEREGN_ETTERLATT_AP_YP        */          00003200
 % INCLUDE R0014131;       /* BEREGN_TP_ETTERLATT_AP        */          00003210
 % INCLUDE R0014132;       /* BEREGN_GP_ETTERLATT_AP        */          00003220
 % INCLUDE R0014133;       /* F_BEREGN_SÆRTILLEGG           */          00003230
 % INCLUDE R0014134;       /* F_BEREGN_KOMPENSASJONSTILLEGG */          00003240
 % INCLUDE R0014135;       /* TIDLIGERE ARBEIDSINNTEKT      */          00003250
 % INCLUDE R0014136;       /* ÅTTI_PROSENT_REGELEN          */          00003260
 % INCLUDE R0014137;       /* JUSTER_MED_APD                */          00003270
 % INCLUDE R0014138;       /* BEREGN_VT                     */          00003280
 % INCLUDE R0014139;   /*  JUSTER_MED_FORVENTET_INNTEKT_AP */           00003290
 % INCLUDE R0014140;   /*  F_OVERGANG_FRA_YP          NY92 */           00003300
 % INCLUDE R0014142;       /* F_TILLEGGSPENSJON             */          00003310
 % INCLUDE R0014143;       /* POENGTILLEGG                  */          00003320
 % INCLUDE R0014145;       /* REGN_TT_67_TIL_70             */          00003330
 % INCLUDE R0014146;       /* FAI_GRENSER                   */          00003340
 % INCLUDE R0014147;       /* FRAVIK_80_PROSENT             */          00003350
 % INCLUDE R0014148;       /* F_TP92                        */          00003360
 % INCLUDE R0014151;   /*  KLARGJØR_TAB               NY92 */           00003370
 % INCLUDE R0014153;        /* BEREGN_SPT_OPT_PÅ            */          00003380
 % INCLUDE R0014155;       /* FAI_GRENSER_FRAVIK            */          00003390
 % INCLUDE R0014156;        /* BEREGN_SPT_OPT_PÅ_ALT        */          00003400
 % INCLUDE R0014161;   /*  LEGG_UFØREHIST_I_TAB       NY92 */           00003410
 % INCLUDE R0014180;       /* SÆRTILLEGG_UTLAND --TRUDE     */          00003420
 % INCLUDE R0014182;       /* BEREGN_GP_ETTERLATT_AP_UTLAND */          00003430
 % INCLUDE R0014199;   /*  SPT_GARANTI_E                   */           00003440
 % INCLUDE R0014233;       /* BEREGN_BT                     */          00003450
 % INCLUDE R0014241;   /*  BEREGN_AP_OVERGANG_FRA_YP  NY92 */           00003460
 % INCLUDE R0014243;   /*  JUSTER_AE_MED_F                 */           00003470
 % INCLUDE R0014244;   /*  JUSTER_AP_40PROS                */           00003480
 % INCLUDE R0014327;   /*  UNGE_DØDE_E                     */           00003490
 % INCLUDE R0019905;       /* BEREGN ALDER                  */          00003500
 % INCLUDE R0019913;       /* SNUR DATO                     */          00003510
 END R001410;                                                           00003520
