 /*       SIST ENDRET 19/05-98 13.01.20 AV   JDA7339                  */00000000
 /*       SIST ENDRET 19/05-98 12.48.28 AV   JDA7339                  */00000010
 /*       SIST ENDRET 02/04-93 10.00.26 AV   DYBVIK                   */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R001NC05 - PROGRAM I PLI                                       */00000040
 /*    PROGRAMMERT AV                                                 */00000050
 /*HENSIKT:                                                           */00000060
 /*    PROGRAMMET BEHANDLER BARNEDELEN.                               */00000070
 /*ENDRING:                                                           */00000080
 /*    PROGRAMMET KOTROLL AV EKTEFLES INNTEKT                         */00000090
 /*                                                                   */00000100
 /*BRUK:                                                              */00000110
 /*    KONTROLL_F7_BARN                                               */00000120
 /*       (FEIL_FUNNET)                                               */00000130
 /*                                                                   */00000140
 /* ***************************************************************** */00000150
 %SKIP(2);                                                              00000160
                                                                        00000170
 KONTROLL_ARBEIDSINNTEKT: PROC(W_VIRK_DATO_MÅ);                         00000180
                                                                        00000190
                                                                        00000200
   /* ************************************************  */              00000210
    DCL GRUNN_OMR2         CHAR      (1202);                            00000220
    DCL GRUNN_IDENT        CHAR      ( 8);                              00000230
                                                                        00000240
      %INCLUDE P0019925;               /* G_TAB                     */  00000250
                                                                        00000260
    ALLOCATE                    G_TAB_RE     ;                          00000270
    KOM_OMR.G_PEKER          = ADDR (GRUNN_OMR2 ) ;                     00000280
    G_TAB_RE                 =  ''           ;                          00000290
                                                                        00000300
                                                                        00000310
                                                                        00000320
    GRUNN_IDENT                     = 'P0019925';                       00000330
                                                                        00000340
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                      00000350
                                                                        00000360
  /* **************************************************** */            00000370
                                                                        00000380
                                                                        00000390
                                                                        00000400
    DCL W_VIRK_DATO_MÅ    PIC '9999',                                   00000410
        W_VIRK_DATO_M DEF W_VIRK_DATO_MÅ POS (1) PIC '99',              00000420
        W_VIRK_DATO_Å DEF W_VIRK_DATO_MÅ POS (3) PIC '99';              00000430
                                                                        00000440
    DCL W_VIRK_DATO_ÅMD       PIC '999999';                             00000450
    DCL H_DATO_START          PIC '999999';                             00000460
    DCL H_DATO_SLUTT          PIC '999999';                             00000470
    DCL H_BELOP               PIC '999999';                             00000480
                                                                        00000490
    DCL GRUNN_B       FIXED DEC (5);                                    00000500
                                                                        00000510
    W_VIRK_DATO_ÅMD = (W_VIRK_DATO_Å * 10000 ) + (W_VIRK_DATO_M * 100)  00000520
                                               + 1;                     00000530
                                                                        00000540
    DO J = 1 TO 60;                                                     00000550
                                                                        00000560
          H_DATO_START     = PERIODE_START_ÅMD(J) ;                     00000570
          H_DATO_SLUTT     = PERIODE_SLUTT_ÅMD(J) ;                     00000580
          H_BELOP          = G_TAB_PERIODE.GRUNNBELØP(J);               00000590
                                                                        00000600
       IF W_VIRK_DATO_ÅMD >= PERIODE_START_ÅMD(J) &                     00000610
          W_VIRK_DATO_ÅMD <= PERIODE_SLUTT_ÅMD(J) THEN                  00000620
          DO;                                                           00000630
             GRUNN_B           = G_TAB_PERIODE.GRUNNBELØP(J);           00000640
             J                 = 99;                                    00000650
          END;                                                          00000660
    END;                                                                00000670
                                                                        00000680
    IF ^FEIL_FUNNET &                                                   00000690
       GRUNN_B > 0  THEN                                                00000700
       DO;                                                              00000710
          IF (F7S.ARBEIDSINNTEKT_EK +                                   00000720
              F7S.PENSJONSINNTEKT_EK )  > GRUNN_B  THEN                 00000730
             DO;                                                        00000740
                FEIL_FUNNET = '1'B;                                     00000750
                F7S.PENSJONSINNTEKT_EKNR =  '385';                      00000760
                F7S.ARBEIDSINNTEKT_EKNR =   '387';                      00000770
            END;                                                        00000780
       END;                                                             00000790
 END KONTROLL_ARBEIDSINNTEKT;                                           00000800
