 /*       SIST ENDRET 12/05-87 09.18.47 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 24/03-87 12.05.43 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 22/12-86 08.41.51 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 10/10-85 14.21.39 AV   FARVIK                   */00000030
 /*       SIST ENDRET 05/10-84 14.09.47 AV   FARVIK                   */00000040
 /*       SIST ENDRET 17/09-84 10.40.20 AV   FARVIK                   */00000050
 /*       SIST ENDRET 12/09-84 08.01.42 AV   FARVIK                   */00000060
 R00115:                                                                00000070
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000080
 %PAGE;                                                                 00000090
 %INCLUDE S00115;    /*  ENDRINGSBLANKETT-2 MAPSETTET   */              00000100
 %PAGE;                                                                 00000110
 %INCLUDE P0011501;  /*  TRANS_OMR FOR ENDRINGSBLANKETT-2        */     00000120
 %PAGE;                                                                 00000130
 %INCLUDE P0019906;  /*  TRANS-OPPL-OMRÅDE (BASED)         */           00000140
 %PAGE;                                                                 00000150
 %INCLUDE P0019908;  /*  KOM-OMRÅDE (BASED)                */           00000160
 %PAGE;                                                                 00000170
 %INCLUDE P0019910;  /*  STYRINGS-OMRÅDE (BASED)           */           00000180
 %PAGE;                                                                 00000190
 %INCLUDE P0019912;  /*  DIV_OMRÅDE (BASED)      */                     00000200
 %PAGE;                                                                 00000210
 %INCLUDE DFHBMSCA;                                                     00000220
 %PAGE;                                                                 00000230
   DCL                                                                  00000240
      (BMSMAPBR,COMMAREA_PEKER) PTR;                                    00000250
   DCL                                                                  00000260
      (ADDR,UNSPEC,CSTG,ONCODE,VERIFY,SUBSTR) BUILTIN;                  00000270
   DCL                                                                  00000280
      FEIL_FUNNET  BIT (1),                                             00000290
      FORKASTES    BIT (1)     INIT('0'B),                              00000300
      ONKODE PIC'9999',                                                 00000310
      CURSOR_POS FIXED BIN(15) INIT(-1),                                00000320
      ONK DEF ONKODE CHAR(4),                                           00000330
      FEILKODE       CHAR(4),                                           00000340
      DSNAVN         CHAR(8),                                           00000350
      ANT_FEIL_SKREVET FIXED DEC (3);                                   00000360
 %SKIP(1);                                                              00000370
 %PAGE;                                                                 00000380
 /*   ON ERROR SNAP BEGIN       ;                                       00000390
         ON ERROR SYSTEM        ;                                       00000400
         ONKODE=ONCODE          ;                                       00000410
         FEILKODE = ONK         ;                                       00000420
         DSNAVN     = EIBDS     ;                                       00000430
         GO TO FEILBEH          ;                                       00000440
      END;*/                                                            00000450
                                                                        00000460
 DSNAVN     = '        ';                                               00000470
 FEILKODE   = 'FEIL'    ;                                               00000480
                                                                        00000490
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00000500
                                                                        00000510
 EXEC CICS HANDLE AID PF1(PF2) PF2(PF2);                                00000520
                                                                        00000530
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000540
                                                                        00000550
 IF FRA_CICS THEN                                                       00000560
  DO;                                                                   00000570
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);00000580
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);     00000590
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);  00000600
  END;                                                                  00000610
                                                                        00000620
 IF HENT_FRAM_MAP  THEN                                                 00000630
   DO;                                                                  00000640
     EXEC CICS SEND MAP('S001151') MAPSET('S001153') MAPONLY            00000650
     SET (BMSMAPBR);                                                    00000660
     ALLOCATE S001151O;                                                 00000670
   END;                                                                 00000680
                                                                        00000690
 RECEIVE_MAP:                                                           00000700
                                                                        00000710
 IF ^ HENT_FRAM_MAP THEN                                                00000720
    DO;                                                                 00000730
       EXEC CICS RECEIVE MAP('S001151') MAPSET('S001153') SET(BMSMAPBR);00000740
       FEIL_MELD_NR = 0;                                                00000750
    END;                                                                00000760
                                                                        00000770
 /* ENDRET 101286 BF: DERSOM DET HAR OPPSTÅTT FEIL I PR. R0011520, */   00000780
 /*                   SKAL TRANSAKSJONEN FORKASTES, DEN KAN IKKE   */   00000790
 /*                   LEGGES PÅ VENTEREG.  I UNDERPR. R0011506 ER  */   00000800
 /*                   FEILMELDINGEN ENDRET.                        */   00000810
                                                                        00000820
 IF FORKASTES = '1'B THEN                                               00000830
    GOTO PF2;                                                           00000840
                                                                        00000850
 /* HIT    101286 BF                                               */   00000860
                                                                        00000870
 IF FUNKSJONSKODEL > 0 THEN                                             00000880
    DO;                                                                 00000890
       FUNKSJONSKODE = FUNKSJONSKODEI;                                  00000900
       EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);            00000910
    END;                                                                00000920
                                                                        00000930
 IF STYRE_KODEL > 0 THEN                                                00000940
    DO;                                                                 00000950
       STYREKODE = STYRE_KODEI;                                         00000960
       TRANSKODE = 'R041';                                              00000970
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00000980
    END;                                                                00000990
                                                                        00001000
                                                                        00001010
 IF STYREKODE ^= 'E2'  &  FRA_CICS THEN                                 00001020
    TRANSKODE = 'R041';                                                 00001030
                                                                        00001040
 ELSE                                                                   00001050
  DO;                                                                   00001060
   TRANS_RETURKODE = TRANSKODE;                                         00001070
                                                                        00001080
   SELECT (TRANSKODE);                                                  00001090
    WHEN('R150')                                                        00001100
       DO;                                                              00001110
         CALL BLANK_E2_SØKER;                                           00001120
         CALL BLANK_E2_MELDNR;                                          00001130
         CALL OVERFØR_E2_SØKER;                                         00001140
         CALL KONTROLL_E2_SØKER(FEIL_FUNNET);                           00001150
       END;                                                             00001160
    WHEN('R151')                                                        00001170
       DO;                                                              00001180
         CALL BLANK_E2_MELDNR;                                          00001190
         CALL OVERFØR_E2_SØKER;                                         00001200
         CALL KONTROLL_E2_SØKER(FEIL_FUNNET);                           00001210
       END;                                                             00001220
    OTHERWISE;                                                          00001230
       /* INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER */00001240
                                                                        00001250
   END;   /* SELECT    */                                               00001260
                                                                        00001270
 IF FEIL_FUNNET ! HENT_FRAM_MAP ! FRA_UTEN_DIALOG !                     00001280
    TRANS_RETURKODE ^= TRANSKODE THEN                                   00001290
                                                                        00001300
    DO;                                                                 00001310
       IF TRANSKODE = 'R150' THEN                                       00001320
          TRANSKODE = 'R151';                                           00001330
       CALL BLANK_E2_MAP;                                               00001340
       CALL OVERFØR_E2SØKER_MAP;                                        00001350
                                                                        00001360
      IF HENT_FRAM_MAP THEN                                             00001370
        EXEC CICS SEND MAP('S001151') MAPSET('S001153') ERASE CURSOR;   00001380
      ELSE                                                              00001390
        EXEC CICS SEND MAP('S001151') MAPSET('S001153') ERASEAUP        00001400
        DATAONLY CURSOR;                                                00001410
      HENT_FRAM_MAP = '0'B;                                             00001420
                                                                        00001430
      IF  FRA_CICS THEN                                                 00001440
        EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);          00001450
      ELSE                                                              00001460
        GOTO RECEIVE_MAP;                                               00001470
                                                                        00001480
    END;                                                                00001490
                                                                        00001500
   ELSE                                                                 00001510
                                                                        00001520
    DO;                                                                 00001530
                                                                        00001540
      IF TRANSKODE = 'R150' THEN                                        00001550
        TRANS_RETURKODE = 'R151';                                       00001560
      ELSE                                                              00001570
        TRANS_RETURKODE = TRANSKODE;                                    00001580
      IF  FRA_CICS  THEN                                                00001590
        DO;                                                             00001600
          BLANKETTYPE = STYREKODE;                                      00001610
          TRANSKODE = 'R042';                                           00001620
        END;                                                            00001630
    END;                                                                00001640
  END;                                                                  00001650
                                                                        00001660
  CALL UTGANG;                                                          00001670
                                                                        00001680
  UTGANG: PROC;                                                         00001690
    IF  FRA_CICS THEN                                                   00001700
      EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);             00001710
    ELSE                                                                00001720
      EXEC CICS RETURN;                                                 00001730
  END UTGANG;                                                           00001740
                                                                        00001750
                                                                        00001760
  FEILBEH:                                                              00001770
                                                                        00001780
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00001790
                                                                        00001800
     PROGRAM_ID = 'R0011501';                                           00001810
                                                                        00001820
     S001151O.MELDING2O =                                               00001830
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00001840
                                                                        00001850
     S001151O.MELDING3O =                                               00001860
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00001870
                                                                        00001880
     S001151O.MELDING4O =                                               00001890
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00001900
                                         !! '. DATASETT : ' !! DSNAVN;  00001910
                                                                        00001920
     S001151O.MELDING5O =                                               00001930
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00001940
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00001950
                                                                        00001960
     S001151O.MELDING6O =                                               00001970
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00001980
                                                                        00001990
                                                                        00002000
     EXEC CICS SEND MAP('S001151')                                      00002010
                                                 MAPSET('S001153');     00002020
                                                                        00002030
     EXEC CICS RECEIVE MAP('S001151')                                   00002040
                                    MAPSET('S001153') SET(BMSMAPBR);    00002050
                                                                        00002060
                                                                        00002070
     EXEC CICS SYNCPOINT ROLLBACK;                                      00002080
                                                                        00002090
                                                                        00002100
     TERMINERINGS_IND = 'F';                                            00002110
                                                                        00002120
     TRANSKODE  = 'R041';                                               00002130
                                                                        00002140
     CALL UTGANG;                                                       00002150
                                                                        00002160
  ABEND:                                                                00002170
     EXEC CICS ABEND ABCODE(FEIL);                                      00002180
                                                                        00002190
  PF1:                                                                  00002200
                                                                        00002210
 /* LEGGER UNDERKJENT TRANS UT PÅ VENTEDATABASE HVIS GYLDIG     */      00002220
 /* FNR OG VIRKNINGSDATO,ELLERS FORKASTES TRANSAKSJONEN.        */      00002230
                                                                        00002240
     IF ^(E2S.FNRNR = 1          !                                      00002250
          E2S.FNRNR = 200        !                                      00002260
          E2S.VIRK_DATO_MÅNR = 9 !                                      00002270
          E2S.VIRK_DATO_MÅNR = 200) THEN                                00002280
        DO;                                                             00002290
           SEARCH_FNR = TRANS_OPPL_OMR.FØDSNUMMER;                      00002300
                                                                        00002310
           EXEC CICS LINK PROGRAM('R0010490') COMMAREA(KOM_OMR);        00002320
                                                                        00002330
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER LAGT UT PÅ VENTEBASE.*/      00002340
                                                                        00002350
           S001151O.MELDING6O =                                         00002360
                         'TRANSAKSJONEN ER LAGT UT PÅ VENTEREGISTER.';  00002370
                                                                        00002380
           EXEC CICS SEND MAP('S001151') MAPSET('S001153')              00002390
                                                           DATAONLY;    00002400
     /* DUMMY SEND-KALL.                              */                00002410
                                                                        00002420
           EXEC CICS SEND MAP('S001151')                                00002430
                                                  MAPSET('S001153');    00002440
           EXEC CICS DELAY INTERVAL(005);                               00002450
                                                                        00002460
           TERMINERINGS_IND = 'F';                                      00002470
                                                                        00002480
           TRANSKODE  = 'R041';                                         00002490
                                                                        00002500
           CALL UTGANG;                                                 00002510
                                                                        00002520
        END;                                                            00002530
     ELSE                                                               00002540
        DO;                                                             00002550
           TERMINERINGS_IND = 'F';                                      00002560
                                                                        00002570
           TRANSKODE = 'R041';                                          00002580
                                                                        00002590
           S001151O.MELDING6O =                                         00002600
                                                                        00002610
   'NB** TRANSAKSJONEN ER FORKASTET P.G.A. UGYLDIG FNR EL. VDATO **NB'; 00002620
                                                                        00002630
           EXEC CICS SEND MAP('S001151') MAPSET('S001153')              00002640
                                                           DATAONLY;    00002650
     /* DUMMY SEND-KALL.                            */                  00002660
                                                                        00002670
           EXEC CICS SEND MAP('S001151')                                00002680
                                    MAPSET('S001153');                  00002690
                                                                        00002700
           EXEC CICS DELAY INTERVAL(005);                               00002710
           CALL UTGANG;                                                 00002720
        END;                                                            00002730
                                                                        00002740
                                                                        00002750
  PF2:                                                                  00002760
     TERMINERINGS_IND   = 'F';                                          00002770
                                                                        00002780
     S001151O.MELDING6O =                                               00002790
      'NBNBNBNBNB***    TRANSAKSJONEN ER FORKASTET.    ***NBNBNBNBNB';  00002800
                                                                        00002810
     EXEC CICS SEND MAP('S001151') MAPSET('S001153')                    00002820
                                                      DATAONLY ;        00002830
     /* DUMMY SEND-KALL.                                     */         00002840
                                                                        00002850
     EXEC CICS SEND MAP('S001151')                                      00002860
                                    MAPSET('S001153');                  00002870
     EXEC CICS DELAY INTERVAL(005);                                     00002880
                                                                        00002890
                                                                        00002900
     TRANSKODE = 'R041';                                                00002910
     CALL UTGANG;                                                       00002920
                                                                        00002930
 %PAGE;                                                                 00002940
      %INCLUDE R0011502;               /* BLANK ARBEIDSOMRÅDE */        00002950
 %PAGE;                                                                 00002960
      %INCLUDE R0011503;               /* KONTROLL AV SØKERDELEN */     00002970
 %PAGE;                                                                 00002980
      %INCLUDE R0011506;               /* ARBEIDSOMRÅDE -> MAP */       00002990
 %PAGE;                                                                 00003000
      %INCLUDE R0011509;               /* MAP -> ARBEIDSOMRÅDE */       00003010
 %PAGE;                                                                 00003020
      %INCLUDE R0019901;               /*  TESTER OM DATO ER GYLDIG */  00003030
 %PAGE;                                                                 00003040
      %INCLUDE R0019904;               /* FØDSELSNUMMERKONTROLL */      00003050
 %PAGE;                                                                 00003060
      %INCLUDE R0019907;               /* TABELLSØKING */               00003070
 %PAGE;                                                                 00003080
      %INCLUDE R0019908;               /* DAGENS DATO PLUSS 1 */        00003090
 %PAGE;                                                                 00003100
      %INCLUDE R0019910;               /* NUMERISK KONTROLL */          00003110
 %PAGE;                                                                 00003120
      %INCLUDE R0019912;  /* KONVERTERING CHAR ==> PIC / PIC ==> CHAR */00003130
 %PAGE;                                                                 00003140
      %INCLUDE R0019944;               /* SKRIV_FEIL      */            00003150
                                                                        00003160
   END R00115;                                                          00003170
