 /*       SIST ENDRET 09/02-88 13.22.48 AV   DYBVIK                   */00000000
 %SKIP(3);                                                              00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /* **********************                                            */00000040
 /*  PROGRAM-IDENT : R001NO18  UNDERPROGRAM SOM BRUKES AV R001NO10    */00000050
 /*                            KONTROLL O2-BLANKETT.                  */00000060
 /*  PROGRAM-SPRÅK : PLI                                              */00000070
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */00000080
 /*  PROGRAMMET BLE LAGET : OKTOBER 1986                              */00000090
 /*  ENDRINGERSDATO :                                                 */00000100
 /*  ENDRINGEN GJELDER:                                               */00000110
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000120
 /*                                                                   */00000130
 /* ***************************************************************** */00000140
 /*BRUK:                                                              */00000150
 /* ********                                                          */00000160
 /*                                                                   */00000170
 /*  %INCLUDE R001NO18                                                */00000180
 /*                                                                   */00000190
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */00000200
 /*                                                                   */00000210
 /*    R0011702   BLANK O2 TRANSOMR                                   */00000220
 /*    R0011703   KONTR O2 SØKER                                      */00000230
 /*    FUNKSJONER SOM BLIR BRUKT ER INKLUDERT I HOVEDPROGRAMMET       */00000240
 /*                                                                   */00000250
 /* ***************************************************************** */00000260
 /*                                                                   */00000270
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR O2 OG FLYTTER DERETTER        */00000280
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */00000290
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */00000300
 /*  NUMRE TATT VARE PÅ.                                              */00000310
 /*                                                                   */00000320
 /* ***************************************************************** */00000330
                                                                        00000340
 P117_BEHANDLE_O2: PROC;                                                00000350
                                                                        00000360
                                                                        00000370
 %INCLUDE P0011701;                               /* TRANSOMR O2 */     00000380
                                                                        00000390
                                                                        00000400
          FEIL_I_BOSATT = '0'B;                                         00000410
          FEIL_BLANKETT = '0'B;                                         00000420
          FEIL_FUNNET   = '0'B;                                         00000430
          CALL BLANK_O2_OPPHØR;                  /* R0011702 */         00000440
          CALL BLANK_O2_MELDNR;                  /* R0011702 */         00000450
          CALL OVERFØR_O2_BLANKETT;                                     00000460
          CALL KONTROLL_O2(FEIL_FUNNET);         /* R0011703 */         00000470
                                                                        00000480
          IF FEIL_FUNNET     THEN                                       00000490
             DO;                                                        00000500
                CALL FINN_FEIL_O2;                                      00000510
             END;                                                       00000520
                                                                        00000530
                                                                        00000540
                                                                        00000550
 /* ***************************************************************** */00000560
 /*   PROSEDYRE FOR Å OVERFØRE FELT FRA OVERFØRINGSRECORDEN           */00000570
 /*   TIL O2.TRANS_OMR I KOM_OMR FOR OPPHØRSBLANKETT 2.               */00000580
 /* ***************************************************************** */00000590
 OVERFØR_O2_BLANKETT: PROC;                                             00000600
                                                                        00000610
                                                                        00000620
          O2.REGDATO         = BLANKETT_RECORD.TRANS_DATO_ÅMD;          00000630
          O2.TERMID          = 'NORT';                                  00000640
          O2.FNR             = BLANKETT_RECORD.FNR;                     00000650
          O2.TKNR            = BLANKETT_RECORD.TKNR;                    00000660
          O2.VIRK_DATO_MÅ    = O2_BLANKETT.VIRK_DATO_MÅ;                00000670
          O2.EK_TILL         = O2_BLANKETT.E_TILL_STOPP;                00000680
                                                                        00000690
          DO J = 1 TO 5;                                                00000700
             IF F_FELT_PIC_CHAR11(O2_BLANKETT.FNR_BARN(J))              00000710
                                                  ^= (11)' '   THEN     00000720
                O2.FNR_BARN(J) = O2_BLANKETT.FNR_BARN(J);               00000730
          END;                                                          00000740
                                                                        00000750
          O2.OPPHØR_KODE     = O2_BLANKETT.OPPHØR_KODE;                 00000760
                                                                        00000770
                                                                        00000780
    END OVERFØR_O2_BLANKETT;                                            00000790
                                                                        00000800
                                                                        00000810
 /* ***************************************************************** */00000820
 /*   PROSEDYRE SOM FINNER OG TAR VARE PÅ FEILMELDINGSNUMRE DERSOM    */00000830
 /*   DET ER FEIL I DEN OVERFØRTE RECORDEN.                           */00000840
 /* ***************************************************************** */00000850
 FINN_FEIL_O2:PROC;                                                     00000860
                                                                        00000870
                                                                        00000880
          FEIL_IND = 1;                                                 00000890
                                                                        00000900
          IF O2.FNRNR ^= 0   &                                          00000910
             O2.FNRNR ^= 999 THEN                                       00000920
             DO;                                                        00000930
                W01_FEIL_NR(FEIL_IND) = O2.FNRNR;                       00000940
                FEIL_IND = FEIL_IND + 1;                                00000950
             END;                                                       00000960
                                                                        00000970
          IF O2.TKNRNR ^= 0   &                                         00000980
             O2.TKNRNR ^= 999 THEN                                      00000990
             DO;                                                        00001000
                W01_FEIL_NR(FEIL_IND) = O2.TKNRNR;                      00001010
                FEIL_IND = FEIL_IND + 1;                                00001020
             END;                                                       00001030
                                                                        00001040
          IF O2.VIRK_DATO_MÅNR ^= 0   &                                 00001050
             O2.VIRK_DATO_MÅNR ^= 999 THEN                              00001060
             DO;                                                        00001070
                W01_FEIL_NR(FEIL_IND) = O2.VIRK_DATO_MÅNR;              00001080
                IF FEIL_IND ^= 3  THEN                                  00001090
                   FEIL_IND  = FEIL_IND + 1;                            00001100
             END;                                                       00001110
                                                                        00001120
          IF O2.EK_TILLNR ^= 0   &                                      00001130
             O2.EK_TILLNR ^= 999 THEN                                   00001140
             DO;                                                        00001150
                W01_FEIL_NR(FEIL_IND) = O2.EK_TILLNR;                   00001160
                IF FEIL_IND ^= 3  THEN                                  00001170
                   FEIL_IND  = FEIL_IND + 1;                            00001180
             END;                                                       00001190
                                                                        00001200
          DO J = 1 TO 5;                                                00001210
             IF O2.FNR_BARNNR(J) ^= 0 &                                 00001220
                O2.FNR_BARNNR(J) ^= 999 THEN                            00001230
                DO;                                                     00001240
                   W01_FEIL_NR(FEIL_IND) = O2.FNR_BARNNR(J);            00001250
                   IF FEIL_IND ^= 3 THEN                                00001260
                      FEIL_IND = FEIL_IND + 1;                          00001270
                END;                                                    00001280
          END;                                                          00001290
                                                                        00001300
          IF O2.OPPHØR_KODENR ^= 0   &                                  00001310
             O2.OPPHØR_KODENR ^= 999 THEN                               00001320
             DO;                                                        00001330
                W01_FEIL_NR(FEIL_IND) = O2.OPPHØR_KODENR;               00001340
                IF FEIL_IND ^= 3  THEN                                  00001350
                   FEIL_IND  = FEIL_IND + 1;                            00001360
             END;                                                       00001370
                                                                        00001380
                                                                        00001390
    END FINN_FEIL_O2;                                                   00001400
                                                                        00001410
                                                                        00001420
 %PAGE;                                                                 00001430
 /* ***************************************************************** */00001440
 /*          E K S T E R N E    P R O C E D U R E R                   */00001450
 /* ***************************************************************** */00001460
                                                                        00001470
                                                                        00001480
 %PAGE;                                                                 00001490
 %INCLUDE R0011702;          /*     BLANK O2 TRANSOMR   */              00001500
                                                                        00001510
 %PAGE;                                                                 00001520
 %INCLUDE R0011703;          /*     KONTR O2 OPPHØR     */              00001530
                                                                        00001540
                                                                        00001550
 END P117_BEHANDLE_O2;                                                  00001560
                                                                        00001570
                                                                        00001580
