 /*       SIST ENDRET 25/03-98 14.17.51 AV   JDA7339                  */00000000
 /*       SIST ENDRET 16/03-98 14.40.23 AV   JDA7339                  */00000010
 /*       SIST ENDRET 20/09-94 09.42.37 AV   HERMAN                   */00000020
 /* ***************************************************************** */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /*    R0014186 - F_TP92_DES        - INTERN FUNKSJON I PLI           */00000050
 /*    PROGRAMMERER: MARTIN - JAN 98                                  */00000060
 /*    OMSKREVET FOR EØS BEREGNING 1097 (MED DESIMALER) MH            */00000070
 /*HENSIKT:                                                           */00000080
 /*    REGNER TP MED POENGÅR FØR 1992 OG ETTER 1991  (45 OG 42 %)     */00000090
 /*PROGRAMTILKNYTNING:                                                */00000100
 /*                                                                   */00000110
 /*BRUK:                                                              */00000120
 /*    TP=F_TP92_DES(FÅ,SPT,OPT,PÅ,PÅ_ETTER91,UFG,TP_PROSENT)         */00000130
 /* ***************************************************************** */00000140
 F_TP92_DES :                                                           00000150
    PROC(FÅ,G,SPT,OPT,PÅ,PÅ_ETTER91,UFG,TP_PROSENT)                     00000160
         RETURNS(DEC FIXED(7,2));                                       00000170
    DCL                                                                 00000180
       FÅ                 PIC '99',                                     00000190
       G                  FIXED DEC(5),                                 00000200
       SPT                FIXED DEC(3,2),                               00000210
       OPT                FIXED DEC(3,2),                               00000220
       PÅ                 FIXED DEC(3),                                 00000230
       PÅ_FØR92           FIXED DEC(3),                                 00000240
       PÅ_ETTER91         FIXED DEC(3),                                 00000250
       UFG                FIXED DEC(5,2),                               00000260
       TP_PROSENT         FIXED DEC(3),                                 00000270
       OÅ                 FIXED DEC(3) INIT (0),                        00000280
       TP_WORK            FIXED DEC(11,4) INIT (0),                     00000290
       TP_WORK_2          FIXED DEC(11,4) INIT (0),                     00000300
       TP2_WORK           FIXED DEC(11,4) INIT (0),                     00000310
       TP_WORK_92         FIXED DEC(11,4) INIT (0),                     00000320
       GAMMEL             FIXED DEC(11,4) INIT (0),                     00000330
       NY                 FIXED DEC(11,4) INIT (0),                     00000340
       TP_UT              FIXED DEC(7,2) INIT(0),                       00000350
       PGNAVN             CHAR (8) INIT ('R0014186');                   00000360
   /* =============================================================== */00000370
   IF PÅ_ETTER91 = 0 THEN                                               00000380
      CALL GAMLE_REGLER;                                                00000390
   ELSE                                                                 00000400
      DO;   /* NYE REGLER FRA 1992 */                                   00000410
         PÅ_FØR92 = PÅ - PÅ_ETTER91;                                    00000420
         GAMMEL = G * 45 /100;                                          00000430
         NY     = G * 42 /100;                                          00000440
         IF B02.FRAVIK_BOSATT_KONVENSJON(BER_SØ_IND) = 'J'      !       00000450
            B02.KONVENSJON(BER_SØ_IND)  = 'J' !   /* PENSJON UTLAND  */ 00000460
            PÅ > 2               !                                      00000470
            (FÅ = 99 & PÅ = 2)   !                                      00000480
            (FÅ = 98 & PÅ = 1)         THEN                             00000490
            DO;  /* FYLLER VILKÅRA */                                   00000500
               IF FÅ > 36 & FÅ < 98        THEN                         00000510
                  DO; /* KAN IKKE FÅ OVERKOMPENSASJON */                00000520
                     TP_WORK = GAMMEL * PÅ_FØR92 / 40;                  00000530
                     TP_WORK_92 = NY * PÅ_ETTER91 / 40;                 00000540
                     TP_WORK = (TP_WORK + TP_WORK_92) * SPT;            00000550
                     TP_WORK = TP_WORK * UFG /100;                      00000560
                     TP_WORK = TP_WORK * TP_PROSENT / 100;              00000570
                     IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN        00000580
                        B02.ALTERNATIV_TP(BER_SØ_IND) = TP_WORK + 0.5;  00000590
                     TP_WORK = TP_WORK / 12;                            00000600
                  END; /* KAN IKKE FÅ OVERKOMPENSASJON */               00000610
               ELSE                                                     00000620
                  DO;  /* KAN FÅ OVERKOMP */                            00000630
                     IF FÅ > 17 & FÅ < 98     THEN                      00000640
                        OÅ = 20 + FÅ - 17;                              00000650
                     ELSE                                               00000660
                        OÅ = 20;                                        00000670
                     IF SPT > OPT THEN                                  00000680
                        DO;  /* SPT > OPT */                            00000690
                           TP_WORK = GAMMEL * PÅ_FØR92 / OÅ;            00000700
                           TP_WORK_92 = NY * PÅ_ETTER91 / OÅ;           00000710
                           TP_WORK = (TP_WORK + TP_WORK_92) * OPT;      00000720
                           TP2_WORK = GAMMEL * PÅ_FØR92 / 40;           00000730
                           TP_WORK_92 = NY * PÅ_ETTER91 / 40;           00000740
                           TP2_WORK                                     00000750
                              = (TP2_WORK + TP_WORK_92) * (SPT - OPT);  00000760
                           TP_WORK = (TP_WORK + TP2_WORK) * UFG /100;   00000770
                           TP_WORK = TP_WORK * TP_PROSENT / 100;        00000780
                           IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN  00000790
                              B02.ALTERNATIV_TP(BER_SØ_IND)             00000800
                                 = TP_WORK + 0.5;                       00000810
                           TP_WORK = TP_WORK / 12;                      00000820
                        END; /* SPT > OPT */                            00000830
                     ELSE                                               00000840
                        DO;  /* SPT = OPT */                            00000850
                           TP_WORK = GAMMEL * PÅ_FØR92 / OÅ;            00000860
                           TP_WORK_92 = NY * PÅ_ETTER91 / OÅ;           00000870
                           TP_WORK = (TP_WORK + TP_WORK_92) * SPT;      00000880
                           TP_WORK = TP_WORK * UFG /100;                00000890
                           TP_WORK = TP_WORK * TP_PROSENT / 100;        00000900
                           IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN  00000910
                           B02.ALTERNATIV_TP(BER_SØ_IND)                00000920
                              = TP_WORK + 0.5;                          00000930
                           TP_WORK = TP_WORK / 12;                      00000940
                        END; /* SPT = OPT */                            00000950
                  END; /* KAN FÅ OVERKOMP */                            00000960
            END; /* FYLLER VILKÅRA */                                   00000970
         ELSE  /* FYLLER IKKJE VILKÅRA */                               00000980
            TP_WORK = 0;                                                00000990
         TP_UT = TP_WORK + 0.005;                                       00001000
     END; /* NYE REGLER FRA 1992 */                                     00001010
 /* ----------------------------------------------------------------- */00001020
 GAMLE_REGLER: PROC;                                                    00001030
    IF B02.FRAVIK_BOSATT_KONVENSJON(BER_SØ_IND) = 'J'      !            00001040
       B02.KONVENSJON(BER_SØ_IND)  = 'J'  !     /* PENSJON UTLAND  */   00001050
       PÅ > 2               !                                           00001060
       (FÅ = 99 & PÅ = 2)   !                                           00001070
       (FÅ = 98 & PÅ = 1)         THEN                                  00001080
       DO;  /* FYLLER VILKÅRA */                                        00001090
          IF FÅ > 36 & FÅ < 98        THEN                              00001100
             DO;  /* KAN IKKE FÅ OVERKOMPENSASJON */                    00001110
                TP_WORK = G * 45 /100;                                  00001120
                TP_WORK = TP_WORK * SPT;                                00001130
                TP_WORK = TP_WORK * PÅ / 40;                            00001140
                TP_WORK = TP_WORK * UFG /100;                           00001150
                TP_WORK = TP_WORK * TP_PROSENT / 100;                   00001160
                IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN             00001170
                   B02.ALTERNATIV_TP(BER_SØ_IND) = TP_WORK + 0.5;       00001180
                TP_WORK = TP_WORK / 12;                                 00001190
             END; /* KAN IKKE FÅ OVERKOMPENSASJON */                    00001200
          ELSE                                                          00001210
             DO;  /* KAN FÅ OVERKOMPENSASJON */                         00001220
                IF FÅ > 17 & FÅ < 98     THEN                           00001230
                   OÅ = 20 + FÅ - 17;                                   00001240
                ELSE                                                    00001250
                   OÅ = 20;                                             00001260
                IF SPT > OPT THEN                                       00001270
                   DO;  /* SPT > OPT */                                 00001280
                      TP_WORK = G * 45 /100;                            00001290
                      TP_WORK = TP_WORK * OPT;                          00001300
                      TP_WORK = TP_WORK * PÅ / OÅ;                      00001310
                      TP_WORK_2 = G * 45 / 100;                         00001320
                      TP_WORK_2 = TP_WORK_2 * (SPT - OPT);              00001330
                      TP_WORK_2 = TP_WORK_2 * PÅ / 40;                  00001340
                      TP_WORK = (TP_WORK + TP_WORK_2) * UFG /100;       00001350
                      TP_WORK = TP_WORK * TP_PROSENT / 100;             00001360
                      IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN       00001370
                         B02.ALTERNATIV_TP(BER_SØ_IND) = TP_WORK + 0.5; 00001380
                      TP_WORK = TP_WORK / 12;                           00001390
                   END; /* SPT > OPT */                                 00001400
                ELSE                                                    00001410
                   DO;  /* SPT = OPT */                                 00001420
                      TP_WORK = G * 45 / 100;                           00001430
                      TP_WORK = TP_WORK * SPT;                          00001440
                      TP_WORK = TP_WORK * PÅ / OÅ;                      00001450
                      TP_WORK = TP_WORK * UFG /100;                     00001460
                      TP_WORK = TP_WORK * TP_PROSENT / 100;             00001470
                      IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN       00001480
                         B02.ALTERNATIV_TP(BER_SØ_IND) = TP_WORK + 0.5; 00001490
                      TP_WORK = TP_WORK / 12;                           00001500
                   END; /* SPT = OPT */                                 00001510
             END; /* KAN FÅ OVERKOMPENSASJON */                         00001520
          TP_UT = TP_WORK + 0.005;                                      00001530
       END; /* FYLLER VILKÅRA */                                        00001540
    ELSE /* FYLLER IKKE VILKÅRA */                                      00001550
       TP_WORK = 0;                                                     00001560
 END GAMLE_REGLER;                                                      00001570
 /* ----------------------------------------------------------------- */00001580
 SLUTT :                                                                00001590
    /* IKKE GI KONV 'F' TILLEGGSPENSJON, TRUDE 060192  */               00001600
    IF B02.BOSATT(BER_SØ_IND)  = 000  &                                 00001610
       B02.TT_16_66(BER_SØ_IND) = 0     &                               00001620
       B02.TT_ETTER_1966(BER_SØ_IND) = 0 &                              00001630
       B02.TT_FØR_1967(BER_SØ_IND)   = 0 &                              00001640
       B02.ALDERSP.KONV_P_KODE(BER_SØ_IND)  = 'F'     &                 00001650
       B02.ALDERSP.KONV_GRAD(BER_SØ_IND)  = 0     THEN                  00001660
       TP_UT  = 0 ;                                                     00001670
       /* TRUDE 060192 HIT */                                           00001680
    RETURN(TP_UT);                                                      00001690
 END F_TP92_DES;                                                        00001700
