 /*       SIST ENDRET 24/09-98 13.42.43 AV   JDA7339                  */00000000
 /*       SIST ENDRET 24/09-98 13.42.09 AV   JDA7339                  */00000010
 /*       SIST ENDRET 28/07-98 12.52.17 AV   JDA7339                  */00000020
 /*       SIST ENDRET 28/07-98 12.29.01 AV   JDA7339                  */00000030
 /*       SIST ENDRET 29/06-98 08.46.11 AV   JDA7339                  */00000040
 /*       SIST ENDRET 29/06-98 08.40.09 AV   JDA7339                  */00000050
 /*       SIST ENDRET 19/05-98 13.03.09 AV   JDA7339                  */00000060
 /*       SIST ENDRET 19/05-98 12.50.12 AV   JDA7339                  */00000070
 /*       SIST ENDRET 29/04-98 10.19.42 AV   JDA7339                  */00000080
 /*       SIST ENDRET 29/04-98 10.13.01 AV   JDA7339                  */00000090
 /*       SIST ENDRET 16/03-98 12.18.44 AV   JDA7339                  */00000100
 /*       SIST ENDRET 16/03-98 12.17.00 AV   JDA7339                  */00000110
 /*       SIST ENDRET 13/03-98 14.21.35 AV   JDA7339                  */00000120
 /*       SIST ENDRET 13/03-98 13.22.36 AV   JDA7339                  */00000130
 /*       SIST ENDRET 10/02-98 12.05.13 AV   JDA7339                  */00000140
 /*       SIST ENDRET 10/02-98 11.58.48 AV   JDA7339                  */00000150
 /*       SIST ENDRET 04/02-98 13.14.44 AV   JDA7339                  */00000160
 /*       SIST ENDRET 04/02-98 13.11.51 AV   JDA7339                  */00000170
 /*       SIST ENDRET 05/12-97 12.47.57 AV   JDA7339                  */00000180
 /*       SIST ENDRET 27/11-97 11.53.04 AV   JDA7339                  */00000190
 /*       SIST ENDRET 22/09-97 09.06.02 AV   JDA7339                  */00000200
 /*       SIST ENDRET 22/09-97 09.04.19 AV   JDA7339                  */00000210
 /*       SIST ENDRET 16/09-97 10.26.34 AV   JDA7339                  */00000220
 /*       SIST ENDRET 15/09-97 13.33.13 AV   JDA7339                  */00000230
 /*       SIST ENDRET 01/09-97 13.50.03 AV   HLA7339                  */00000240
 /*       SIST ENDRET 01/09-97 13.48.52 AV   HLA7339                  */00000250
 /*       SIST ENDRET 29/08-97 12.33.12 AV   JDA7339                  */00000260
 /*       SIST ENDRET 29/08-97 08.03.04 AV   HLA7339                  */00000270
 /*       SIST ENDRET 28/08-97 08.57.27 AV   SPA7339                  */00000280
 /*       SIST ENDRET 30/07-97 12.11.23 AV   HLA7339                  */00000290
 /*       SIST ENDRET 28/07-97 12.34.38 AV   HLA7339                  */00000300
 /*       SIST ENDRET 12/06-97 09.33.05 AV   HLA7339                  */00000310
 /*       SIST ENDRET 19/03-97 10.54.15 AV   JDA7339                  */00000320
 /*       SIST ENDRET 31/01-97 14.05.42 AV   JDA0310                  */00000330
 /*       SIST ENDRET 19/07-96 13.58.40 AV   HLB0310                  */00000340
 /*       SIST ENDRET 20/03-96 16.28.54 AV   HLB0310                  */00000350
 /*       SIST ENDRET 13/03-96 14.44.03 AV   HLB0310                  */00000360
 /*       SIST ENDRET 14/02-96 16.15.46 AV   HLB0310                  */00000370
 /*       SIST ENDRET 18/01-96 15.41.21 AV   HLB0310                  */00000380
 /*       SIST ENDRET 21/09-95 10.17.25 AV   JDA0310                  */00000390
 /*       SIST ENDRET 07/09-95 08.55.11 AV   TSB0310                  */00000400
 /*       SIST ENDRET 03/08-95 10.45.59 AV   TSB0310                  */00000410
 /*       SIST ENDRET 27/07-95 14.22.21 AV   JDA0310                  */00000420
 /*       SIST ENDRET 08/03-95 14.01.36 AV   HLB0310                  */00000430
 /*       SIST ENDRET 23/11-94 15.31.39 AV   TSB0310                  */00000440
 /*       SIST ENDRET 07/11-94 09.45.08 AV   HLB0310                  */00000450
 /*       SIST ENDRET 18/10-94 15.14.22 AV   JDA0310                  */00000460
 /*       SIST ENDRET 10/10-94 12.26.09 AV   HLB0310                  */00000470
 /*       SIST ENDRET 07/10-94 08.53.19 AV   HLB0310                  */00000480
 /*       SIST ENDRET 25/08-94 10.59.27 AV   HERMAN                   */00000490
 /*       SIST ENDRET 20/07-94 12.46.22 AV   DYBVIK                   */00000500
 /*       SIST ENDRET 08/06-94 14.04.47 AV   DYBVIK                   */00000510
 /*       SIST ENDRET 24/05-94 14.06.00 AV   DYBVIK                   */00000520
 /*       SIST ENDRET 08/02-94 11.06.20 AV   DYBVIK                   */00000530
 /*       SIST ENDRET 04/02-94 12.55.40 AV   TRUDE                    */00000540
 /*       SIST ENDRET 03/02-94 15.20.35 AV   TRUDE                    */00000550
 /*       SIST ENDRET 16/12-93 14.35.49 AV   TRUDE                    */00000560
 /*       SIST ENDRET 02/11-93 09.37.27 AV   DYBVIK                   */00000570
 /*       SIST ENDRET 23/09-93 13.08.49 AV   DYBVIK                   */00000580
 /*       SIST ENDRET 12/05-93 09.54.40 AV   DYBVIK                   */00000590
 /*       SIST ENDRET 17/02-93 11.00.06 AV   DYBVIK                   */00000600
 /*       SIST ENDRET 04/01-93 14.58.51 AV   DYBVIK                   */00000610
 /*       SIST ENDRET 08/10-92 15.40.05 AV   TRUDE                    */00000620
 /*       SIST ENDRET 01/10-92 15.03.57 AV   DYBVIK                   */00000630
 /*       SIST ENDRET 25/09-92 12.19.35 AV   DYBVIK                   */00000640
 /*       SIST ENDRET 24/08-92 12.29.00 AV   DYBVIK                   */00000650
 /*       SIST ENDRET 14/07-92 08.23.05 AV   HERMAN                   */00000660
 /*       SIST ENDRET 10/07-92 11.22.38 AV   HERMAN                   */00000670
 /*       SIST ENDRET 10/07-92 08.25.54 AV   HERMAN                   */00000680
 /*       SIST ENDRET 08/07-92 10.23.02 AV   HERMAN                   */00000690
 /*       SIST ENDRET 22/06-92 12.41.30 AV   HERMAN                   */00000700
 /*       SIST ENDRET 12/06-92 13.53.29 AV   TRUDE                    */00000710
 /*       SIST ENDRET 09/06-92 12.28.00 AV   DYBVIK                   */00000720
 /*       SIST ENDRET 05/06-92 12.14.38 AV   DYBVIK                   */00000730
 /*       SIST ENDRET 23/04-92 15.18.03 AV   HERMAN                   */00000740
 /*       SIST ENDRET 23/04-92 13.24.44 AV   DYBVIK                   */00000750
 /*       SIST ENDRET 20/02-92 12.13.50 AV   HERMAN                   */00000760
 /*       SIST ENDRET 17/02-92 13.49.58 AV   DYBVIK                   */00000770
 /*       SIST ENDRET 12/02-92 15.37.30 AV   HERMAN                   */00000780
 /*       SIST ENDRET 28/01-92 12.28.37 AV   DYBVIK                   */00000790
 /*       SIST ENDRET 13/01-92 14.18.03 AV   DYBVIK                   */00000800
 /*       SIST ENDRET 13/12-91 13.04.14 AV   DYBVIK                   */00000810
 /*       SIST ENDRET 24/06-91 13.25.20 AV   DYBVIK                   */00000820
 /*       SIST ENDRET 21/06-91 14.37.22 AV   HERMAN                   */00000830
 /*       SIST ENDRET 14/06-91 13.27.24 AV   DYBVIK                   */00000840
 /*       SIST ENDRET 26/04-91 12.24.12 AV   DYBVIK                   */00000850
 /*       SIST ENDRET 04/04-91 13.58.11 AV   HERMAN                   */00000860
 /*       SIST ENDRET 13/03-91 13.21.17 AV   DYBVIK                   */00000870
 /*       SIST ENDRET 15/01-91 15.27.14 AV   HERMAN                   */00000880
 /*       SIST ENDRET 10/01-91 14.59.23 AV   HERMAN                   */00000890
 /*       SIST ENDRET 08/01-91 12.47.29 AV   DYBVIK                   */00000900
 /*       SIST ENDRET 11/12-90 13.35.41 AV   DYBVIK                   */00000910
 /*       SIST ENDRET 21/09-90 08.17.31 AV   DYBVIK                   */00000920
 /*       SIST ENDRET 18/09-90 13.12.14 AV   DYBVIK                   */00000930
 /*       SIST ENDRET 05/07-90 09.41.25 AV   DYBVIK                   */00000940
 /*       SIST ENDRET 14/03-90 09.50.42 AV   DYBVIK                   */00000950
 /*       SIST ENDRET 08/02-90 14.09.30 AV   DYBVIK                   */00000960
 /*       SIST ENDRET 23/01-90 15.34.20 AV   HERMAN                   */00000970
 /*       SIST ENDRET 09/01-90 12.25.04 AV   DYBVIK                   */00000980
 /*       SIST ENDRET 15/12-89 13.14.52 AV   HERMAN                   */00000990
 /*       SIST ENDRET 24/10-89 14.17.14 AV   DYBVIK                   */00001000
 /*       SIST ENDRET 16/10-89 13.24.15 AV   DYBVIK                   */00001010
 /*       SIST ENDRET 14/08-89 13.55.32 AV   DYBVIK                   */00001020
 /*       SIST ENDRET 14/04-89 14.53.27 AV   DYBVIK                   */00001030
 /* ***************************************************************** */00001040
 /*IDENTIFIKASJON:                                                    */00001050
 /*    R0014901 - AUTOHENDELSE_BEREGNING - HOVEDPROGRAM I CICS/PLI    */00001060
 /*    PROGRAMMERER: KRISTENSEN, SEPTEMBER 1982                       */00001070
 /*HENSIKT:                                                           */00001080
 /*    PROGRAMMET FINNER UT OM NOEN I FAMILIEN PASSERER BESTEMTE      */00001090
 /*    ALDERSGRENSER. DERSOM DETTE ER TILFELLE BLIR BEREGNINGER KALT, */00001100
 /*    EVENTUELLE STØNADSBREV SKREVET UT, SAMT KALT  PÅ RUTINER SOM   */00001110
 /*    DANNER STATISTIKK - TRANSER.                                   */00001120
 /*PROGRAMTILKNYTNING:                                                */00001130
 /*    PROGRAMMET BLIR LINKET FRA R0013001. D.V.S. ON-LINE KJØRING    */00001140
 /*    PROGRAMMET BLIR LINKET FRA ALDERSKONVERTER D.V.S. BATCH-KJØRING*/00001150
 /*      DET FORETAS LINK TIL 4001 - BEREGNING                        */00001160
 /*      DET FORETAS LINK TIL 6001 - STATISTIKK                       */00001170
 /*      DET FORETAS LINK TIL 7001 - STØNADSBREV                      */00001180
 /*                                                                   */00001190
 /*      FØLGENDE EKSTERNE RUTINER ER DET INCLUDE PÅ :                */00001200
 /*                                                                   */00001210
 /*         R0019902         FINNE KJØNN                              */00001220
 /*         R0019905         FINNE ALDER                              */00001230
 /*         R0019913         SNUR  DATO (PIC(4))                      */00001240
 /*         R0019934         OPPHØR_KOBLING_TO_PERSONER               */00001250
 /*         R0019938         ETTERLATTEPENSJON_OPPHØRER               */00001260
 /*         R0019966         AFP_NULL_OPPHØRER                        */00001270
 /*                                                                   */00001280
 /*      INTERNE RUTINER :                                            */00001290
 /*                                                                   */00001300
 /*         R001490                    HOVEDPROGRAMMET                */00001310
 /*           REGN_ALDER_FOR_FAMILIE                                  */00001320
 /*           ADDER_EN_MÅNED_TIL_ALDER_FAMILIE                        */00001330
 /*           AUTO_ONLINE              TESTER KONVERTERINGSGRENSER    */00001340
 /*             FINNES_SØKER                                          */00001350
 /*               SETT_VIRKDATO_BARN                                  */00001360
 /*             P67_TIL_P70                                           */00001370
 /*             OVERGANG_TIL_P67                                      */00001380
 /*             ER_EKTEFELLE_67_70                                    */00001390
 /*             FJERN_EKTEFELLE_TILLEGG                               */00001400
 /*             UNG_UFØR                                              */00001410
 /*             FØDT_UFØR                                             */00001420
 /*             FØDT_UFØR_BARN                                        */00001430
 /*             FJERN_BARNEPENSJON                                    */00001440
 /*             UFØR_BARN                                             */00001450
 /*             FJERN_BARNETILLEGG                                    */00001460
 /*             BARN_18ÅR                                             */00001470
 /*             BARNS_TILKNYTNINGSKODE_ENDRES                         */00001480
 /*             YRKESSKADE_ELEV                                       */00001490
 /*             SATSENDRING                                           */00001500
 /*             FINNE_SISTE_UFT_ÅM                                    */00001510
 /*                                                                   */00001520
 /*                                                                   */00001530
 /*                                                                   */00001540
 /*BRUK:                                                              */00001550
 /*    EXEC CICS LINK PROGRAM('R0014901') COMMAREA(KOM_OMR)           */00001560
 /*ENDRET : 15.2.84 - HERMAN.                                         */00001570
 /*         LOVENDRING PR 1.4.84 GÅR UT PÅ AT 'FORVENTET' I EP        */00001580
 /*         SKAL NYTTES SOM 'FAI' VED OVERGANG TIL AP - DERSOM        */00001590
 /*         SLIK BEREGNING ER GUNSTIGST.                              */00001600
 /*ENDRET : 26.6.84 OG 2.7.84 - HERMAN                                */00001610
 /*         EKTEFELLER SOM BLE KONVERTERT FRA UP TIL AP I SAMME MåNED:*/00001620
 /*         MANNEN FIKK 758 % VENTETILLEGG.                           */00001630
 /*ENDRET : 4/10.84 - KARIN.                                          */00001640
 /*         ETTERLATT EKTEFELLE MED OVERGANGSSTØNAD OG FRAMLEGGSDATO  */00001650
 /*         OG OPPHØRSDATO BLIR REGNET FRAM TIL DAGENS DATO.          */00001660
 /*         ENDRET TIL Å AUTOBEREGNES FRAM TIL FRAMLEGGSDATO.         */00001670
 /*ENDRET : 29.7.85 - HERMAN                                          */00001680
 /*         ENDRINGEN SOM ER BESKREVET OVENFOR VEDR. ETTERLATT ER     */00001690
 /*         FLYTTET OG BRUKER NÅ CALL TIL 9938.                       */00001700
 /*ENDRET : 21.10.85 - HERMAN                                         */00001710
 /*         FORELDRELØSE BARN SKAL HA STOPP I PENSJON FRA MÅNEDEN     */00001720
 /*         ETTER AT DE FYLLER 20 ÅR - FEILRAPPORT 259.               */00001730
 /*ENDRET : 8.10.86 - ERIK                                            */00001740
 /*         LAGT INN CALL TIL 4901 I 9951, SLIK AT INNTEKTSSTØNADS-   */00001750
 /*         BREVER FÅR VIRK.DATO TILBAKE TIL DET TIDSPUNKT ENDRINGEN  */00001760
 /*         GJELDER FRA, OG SLIK AT ETTER.BET. PERIODENE VISES PÅ     */00001770
 /*         STØNADSBREVET.                                            */00001780
 /*ENDRET : 13.2.87 - HERMAN                                          */00001790
 /*         UNGE UFøRE FåR ENDRET BUP_GARANTI TIL 2.50 POENG          */00001800
 /*         FRA 1.5.87.                                               */00001810
 /*ENDRET : 16.2.88 - HERMAN                                          */00001820
 /*         UNGE UFØRE FÅR ENDRET BUP_GARANTI TIL 3.00 POENG          */00001830
 /*         FRA 1.5.88                                                */00001840
 /*ENDRET : 23.12.88 - HERMAN                                         */00001850
 /*         UNGE UFØRE FÅR ENDRET ALDERSGRENSEN TIL 22 ÅR FRA 01895   */00001860
 /*ENDRET : 24.10.90 - TRUDE                                          */00001870
 /*         UNGE UFØRE FØR 1967 ENDRET GARANTI FRA 1.6 TIL 2.00       */00001880
 /*ENDRET : 13.5.91 - TRUDE                                           */00001890
 /*         UNGE UFØRE FÅR ENDRET BUP_GARANTI TIL 3.30 POENG          */00001900
 /*         FRA 1.5.91                                                */00001910
 /*ENDRET : 24.4.92 - TRUDE                                           */00001920
 /*         RULLERING AV ALDERSP.FAI OG FORSI-INNTEKTER               */00001930
 /*         REGELENDRINGER FRA 0591 OG 0192                           */00001940
 /*ENDRET : 06.08.92- TRUDE                                           */00001950
 /*         RETTIGHETER ETTER UFØR FØR 22 ÅR FØDT FØR 1944            */00001960
 /*                                                                   */00001970
 /* ***************************************************************** */00001980
 R001490: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                          00001990
 DCL                                                                    00002000
 1 B01 BASED(B01_PEKER),                                                00002010
 %INCLUDE P0019921;  /* B01-OMRÅDE (BASED)        */                    00002020
 DCL                                                                    00002030
 1 B02 BASED(B02_PEKER),                                                00002040
 %INCLUDE P0019921;  /* B02-OMRÅDE (BASED)        */                    00002050
 %INCLUDE P0019906;  /* TRANS-OPPL-OMRÅDE (BASED) */                    00002060
 %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)        */                    00002070
 %INCLUDE P0019910;  /* STYRINGS-OMRÅDE (BASED)   */                    00002080
 DCL                                                                    00002090
   1 TRANS_LISTE_OMR UNAL BASED (TRANS_LISTE_PEKER),                    00002100
     3 TRANS_LISTE_LINJE (5),                                           00002110
 %INCLUDE P0019911;  /* TRANS-LISTE-OMRÅDE UNDERNIVÅ)*/                 00002120
 DCL                                                                    00002130
   1 WORK_TRANS_LISTE UNAL BASED (WORK_TRANS_LISTE_PEKER),              00002140
 %INCLUDE P0019911;  /* TRANS-LISTE-OMRÅDE UNDERNIVÅ)*/                 00002150
 %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE (BASED)  */                    00002160
 %INCLUDE P0019925;  /* GRUNNBELØP OG SÆRTILLEGG-TABELL  */             00002170
                                                                        00002180
 DCL 1 B01_HJELP,                                                       00002190
 %INCLUDE P0019921;                                                     00002200
 DCL 1 B02_HJELP,                                                       00002210
 %INCLUDE P0019921;                                                     00002220
 DCL                                                                    00002230
   1 ALDERSOMRÅDE UNAL,                                                 00002240
     2 ALDER_PERSON (14),                                               00002250
       3 ÅR PIC 'S999',                                                 00002260
       3 MN PIC '99';                                                   00002270
                                                                        00002280
 DCL                                                                    00002290
   1 ALDERSOMRÅDE_DEF DEF ALDERSOMRÅDE UNAL,                            00002300
     2 ALDER_PERSON_ÅM (14)  PIC 'S99999';                              00002310
                                                                        00002320
                                                                        00002330
                                                                        00002340
 DCL                                                                    00002350
   (VERIFY,ADDR,CSTG,LOW,STG,SUBSTR) BUILTIN;                           00002360
 DCL                                                                    00002370
   COMMAREA_PEKER PTR;                                                  00002380
 DCL                                                                    00002390
   START_TRANS_OPPL_PEKER       POINTER;                                00002400
 DCL                                                                    00002410
   (I,J,K) FIXED BIN(15);                                               00002420
 DCL                                                                    00002430
   ALDER_VED_DØD                PIC 'S99999',                           00002440
   AUTODATO_ÅM                  PIC'9999',                              00002450
   AUTODATO_Å                   PIC'99' DEF AUTODATO_ÅM POS(1),         00002460
   AUTODATO_M                   PIC'99' DEF AUTODATO_ÅM POS(3),         00002470
   AVDØD_IND                    FIXED BIN(15),                          00002480
   BUP_IND                      FIXED BIN(15),                          00002490
   BUP_SISTE                    FIXED BIN(15),                          00002500
   DØDSDATO_ÅM                  PIC'9999',                              00002510
   FIXED_DEC4                   FIXED DEC(4)  INIT (0),                 00002520
   FIXED_DEC5                   FIXED DEC(5),                           00002530
   GARANTI_BUP                  FIXED DEC (3,2) INIT (0),               00002540
   G_FRA                        FIXED DEC(5) INIT(0),                   00002550
   G_FØR                        FIXED DEC(5) INIT(0),                   00002560
   G_NÅ                         FIXED DEC(5) INIT(0),                   00002570
   G_TIL                        FIXED DEC(5) INIT(0),                   00002580
   HENDELSE_IND                 BIT (1),                                00002590
   HJ_VIRK_DATO_ÅM              PIC '9999',                             00002600
   JA                           BIT (1) INIT('1'B),                     00002610
   MAX_BARN                     FIXED BIN(15),                          00002620
   NEI                          BIT (1) INIT('0'B),                     00002630
   PIC4                         PIC'9999',                              00002640
   PIC11                        PIC'(11)9',                             00002650
   SATSENDRING_DENNE_MÅNED      BIT (1) INIT('0'B),                     00002660
   START_SØKER_IND              FIXED BIN(15),                          00002670
   STILLEGG_2                   FIXED DEC(7),                           00002680
   ST_PROSENT                   FIXED DEC(4,2),                         00002690
   TRANSTYPE2                   PIC'99' INIT (0),                       00002700
   UF_IND                       FIXED BIN(15),                          00002710
   UFØR_BARN_IND                FIXED BIN(15),                          00002720
   W01_FØRSTE_GANG              BIT (1) INIT('1'B),                     00002730
   WS_B01_VIRK_DATO_MÅ          PIC'9999',                              00002740
   WS_TRANS_OPPL_VIRK_DATO      PIC'9999',                              00002750
   ÅR                           PIC'99' DEF PIC11 POS (5),              00002760
   ÅRHUNDRE                     PIC'9'  DEF PIC11 POS (7),              00002770
 /*YS*/ ETT_POENG               FIXED DEC (3,2) INIT (1.0),             00002780
 /*YS*/ ETT_KOMMA_FEM_POENG     FIXED DEC (3,2) INIT (1.5),             00002790
 /*YS*/ TO_POENG                FIXED DEC (3,2) INIT (2.0);             00002800
   DCL I_EK                     FIXED BIN(15);                          00002810
                                                                        00002820
 DCL W_FNR                      PIC '(11)9';                            00002830
 DCL 1 FNR_R DEF W_FNR,                                                 00002840
     2 DAG       PIC '99',                                              00002850
     2 MND       PIC '99',                                              00002860
     2 ÅR        PIC '99',                                              00002870
     2 ÅRHUNDRE  PIC '9',                                               00002880
     2 FILLER    PIC '(4)9';                                            00002890
                                                                        00002900
 DCL W_FNR_ÅM    PIC '(4)9';                                            00002910
 DCL FELLES_BARN CHAR (1) INIT(' ');                                    00002920
 DCL   ALDER_UF_DØD                PIC 'S99999';                        00002930
 DCL OPPH_ÅM                       PIC '(4)9';   /*9807*/               00002940
 DCL OPPH_ÅR  DEF OPPH_ÅM POS(1)   PIC '(2)9';                          00002950
 DCL OPPH_MN  DEF OPPH_ÅM POS(3)   PIC '(2)9';                          00002960
                                                                        00002970
 HENDELSE_IND = NEI;                                                    00002980
 START_SØKER_IND          = SØKER_IND;                                  00002990
                                                                        00003000
    START_TRANS_OPPL_PEKER   = KOM_OMR.TRANS_OPPL_PEKER;                00003010
    KOM_OMR.TRANS_OPPL_PEKER = KOM_OMR.WORK_TRANS_LISTE_PEKER;          00003020
                                                                        00003030
                                                                        00003040
 TRANS_OPPL_OMR.TRANSKODE        = 'AUTO';                              00003050
 TRANS_OPPL_OMR.FØDSNUMMER       = 0;                                   00003060
 TRANS_OPPL_OMR.NY_GML_TRANS_IND = ' ';                                 00003070
 TRANS_OPPL_OMR.BLANKETTYPE      = '  ';                                00003080
 TRANS_OPPL_OMR.TRANS_RETURKODE  = (4)' ';                              00003090
                                                                        00003100
 ALDERSOMRÅDE_DEF = '';                                                 00003110
                                                                        00003120
                                                                        00003130
       SELECT (KJØRINGS_TYPE);                                          00003140
        WHEN ('S')                                                      00003150
             DO;                                                        00003160
                AUTODATO_ÅM = NESTE_HENDELSE_DATO_ÅM;                   00003170
             END;                                                       00003180
        WHEN ('Q')                                                      00003190
             DO;                                                        00003200
                AUTODATO_ÅM = B02.VIRK_DATO_ÅM(SØKER_IND);              00003210
                AUTODATO_ÅM = AUTODATO_ÅM + 1;                          00003220
                                                                        00003230
                IF AUTODATO_M = 13 THEN                                 00003240
                   DO;                                                  00003250
                     AUTODATO_M = 1;                                    00003260
                     AUTODATO_Å = AUTODATO_Å + 1;                       00003270
                   END;                                                 00003280
                                                                        00003290
                                                                        00003300
             END;                                                       00003310
        OTHERWISE                                                       00003320
             DO;                                                        00003330
               DO I=1 TO 14 UNTIL(B01.STATUS.VIRK_DATO_ÅM (I) > 0 &     00003340
                               B01.STATUS.PENSJONSTYPE1(I) ^='D' );     00003350
               AUTODATO_ÅM = B01.STATUS.VIRK_DATO_ÅM(I) + 1;            00003360
               END;                                                     00003370
                                                                        00003380
               IF AUTODATO_M = 13 THEN                                  00003390
                  DO;                                                   00003400
                    AUTODATO_M = 1;                                     00003410
                    AUTODATO_Å = AUTODATO_Å + 1;                        00003420
                  END;                                                  00003430
                                                                        00003440
             END;                                                       00003450
                                                                        00003460
        END;                                                            00003470
  /* **********                                                         00003480
 IF B01.PENSJONSTYPE2(1) = 'A'    THEN                                  00003490
    B01.PERSON(2) = '';                                                 00003500
 IF B01.PENSJONSTYPE2(2) = 'A'    THEN                                  00003510
    B01.PERSON(1) = '';                                                 00003520
                                                                        00003530
    ********** */                                                       00003540
                                                                        00003550
 UFØR_BARN_IND = 0;                                                     00003560
                                                                        00003570
 IF KJØRINGS_TYPE = 'A'    THEN       /*KOMMER FRA 1820-AU*/            00003580
    DO;                                                                 00003590
       FIXED_DEC4 = AUTODATO_ÅM - 1;                                    00003600
       IF B01.G_DATO_ÅM(SØKER_IND) > FIXED_DEC4       THEN              00003610
          CALL SKAL_INNTEKTER_RULLERES(FIXED_DEC4);                     00003620
       KJØRINGS_TYPE = 'O';    /* 'O' = ORDINÆR */                      00003630
    END;                                                                00003640
 ELSE                                                                   00003650
 IF B01.G_DATO_ÅM(SØKER_IND) > AUTODATO_ÅM       THEN                   00003660
    CALL SKAL_INNTEKTER_RULLERES(AUTODATO_ÅM);                          00003670
                                                                        00003680
                                                                        00003690
 CALL REGN_ALDER_FOR_FAMILIE;                                           00003700
                                                                        00003710
 DO WHILE (AUTODATO_ÅM <= NESTE_HENDELSE_DATO_ÅM);                      00003720
                                                                        00003730
 /*ETTER 1998 SKAL UP IKKE HA OPPHØR I JANUAR - ENDRES TIL DESEMBER*/   00003740
   OPPH_ÅM = AUTODATO_ÅM;                                               00003750
   IF AUTODATO_Å > 98  &                                                00003760
      AUTODATO_M =  1   THEN                                            00003770
      DO;                                                               00003780
         OPPH_ÅR = OPPH_ÅR - 1;                                         00003790
         OPPH_MN = 12;                                                  00003800
      END;                                                              00003810
   TRANS_OPPL_OMR.TRANSTYPE  = 0;                                       00003820
                                                                        00003830
   /** FINNER UT OM DET ER SATSENDRINGER DENNE MÅNED  **/               00003840
                                                                        00003850
   DO J = 1 TO 60 UNTIL(PERIODE_START_ÅMD(J)/100 >=AUTODATO_ÅM);        00003860
   END;                                                                 00003870
                                                                        00003880
                                                                        00003890
   PIC4 = PERIODE_START_ÅMD(J)/100;                                     00003900
   G    = G_TAB_PERIODE.GRUNNBELØP(J);                                  00003910
                                                                        00003920
   IF PIC4 = AUTODATO_ÅM THEN                                           00003930
     DO;                                                                00003940
       SATSENDRING_DENNE_MÅNED = JA;                                    00003950
       G_FØR = G_TAB_PERIODE.GRUNNBELØP(J - 1);                         00003960
       G_NÅ  = G_TAB_PERIODE.GRUNNBELØP(J    );                         00003970
       ST_PROSENT  = G_TAB_PERIODE.ST_PROSENT_E(J);                     00003980
       STILLEGG_2 = ST_PROSENT * 2 * G /1200;                           00003990
                                                                        00004000
                     /* TRUDE 090692 ????????????*/                     00004010
       CALL SATSENDRING; /*TIL HIT TRUDE */                             00004020
                                                                        00004030
                                                                        00004040
     END;                                                               00004050
   ELSE                                                                 00004060
     DO;                                                                00004070
       SATSENDRING_DENNE_MÅNED = NEI;                                   00004080
       G    = G_TAB_PERIODE.GRUNNBELØP(J-1);                            00004090
       ST_PROSENT  = G_TAB_PERIODE.ST_PROSENT_E(J-1);                   00004100
       STILLEGG_2 = ST_PROSENT * 2 * G /1200;                           00004110
       G_FØR = 0;                                                       00004120
       G_NÅ  = 0;                                                       00004130
     END;                                                               00004140
                                                                        00004150
   CALL AUTO_ONLINE;                                                    00004160
                                                                        00004170
   DO WHILE (HENDELSE_IND = JA);                                        00004180
                                                                        00004190
     /** DET ER LAGET TRANS DENNE MÅNED  **/                            00004200
                                                                        00004210
                                                                        00004220
     IF TRANS_OPPL_OMR.TRANSTYPE = 0 THEN /** DET ER BARE ENDRING **/   00004230
       DO;                                /** PÅ UFØRT BARN       **/   00004240
         TRANS_OPPL_OMR.TRANSTYPE = TRANSTYPE2;                         00004250
         TRANSTYPE2               = 0;                                  00004260
         TRANS_OPPL_OMR.FØDSNUMMER= B02.RF0PERSN.FNR(UFØR_BARN_IND);    00004270
         TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);        00004280
         SØKER_IND                = UFØR_BARN_IND;                      00004290
         HENDELSE_IND             = NEI;                                00004300
                                                                        00004310
       END;                                                             00004320
                                                                        00004330
     IF (TRANS_OPPL_OMR.TRANSTYPE > 0  &                                00004340
        TRANS_OPPL_OMR.TRANSTYPE < 50   )   !                           00004350
        TRANS_OPPL_OMR.TRANSTYPE = 98       !            /*HL 0994*/    00004360
        TRANS_OPPL_OMR.TRANSTYPE = 99   THEN                            00004370
       DO;                                                              00004380
                                                                        00004390
         IF SØKER_IND    = 1         THEN                               00004400
            EKTEF_IND    = 2;                                           00004410
         ELSE                                                           00004420
            IF SØKER_IND = 2         THEN                               00004430
               EKTEF_IND = 1;                                           00004440
                                                                        00004450
         IF TRANS_OPPL_OMR.TRANSTYPE ^= 27 THEN                         00004460
            DO;                                                         00004470
               DO I = 1 TO 14;                                          00004480
                  B02.GAMMEL_FT_KODE(I) = ' ';                          00004490
               END;                                                     00004500
            END;                                                        00004510
                                                                        00004520
         EXEC CICS LINK PROGRAM('R0014001') COMMAREA(KOM_OMR);          00004530
                          /** BEREGNING **/                             00004540
         IF FEIL_MELD_NR > 0 THEN                                       00004550
           GOTO AVSLUTNING;                                             00004560
                                                                        00004570
         B01_HJELP            = B01           ;                         00004580
         B02_HJELP            = B02           ;                         00004590
                                                                        00004600
         IF TRANS_OPPL_OMR.TRANSTYPE = 99   &                           00004610
              B02.BT_SÆRBARN(SØKER_IND)    ^>                           00004620
              B01.BT_SÆRBARN(SØKER_IND)     THEN                        00004630
              TRANS_OPPL_OMR.TRANSTYPE = 27;                            00004640
                                                                        00004650
             /* TILLEGG TEST ANTALL_BARN TRUDE 210995*/                 00004660
         IF (TRANS_OPPL_OMR.TRANSTYPE = 98)                &            00004670
            (                                                           00004680
                (B01.ANTALL_BARN(1)   = B02.ANTALL_BARN(1)          ) & 00004690
                (B01.ANTALL_BARN(2)   = B02.ANTALL_BARN(2)          ) & 00004700
                (B01.SUM_YTELSE(1) = B02.SUM_YTELSE(1)              ) & 00004710
                (B01.GARANTITILLEGG_EK(1) = B02.GARANTITILLEGG_EK(1)) & 00004720
                (B01.GARANTITILLEGG_EK(2) = B02.GARANTITILLEGG_EK(2)) & 00004730
                (B01.GARANTITILLEGG_BARN(1) =                           00004740
                                     B02.GARANTITILLEGG_BARN(1)     ) & 00004750
                (B01.GARANTITILLEGG_BARN(2) =                           00004760
                                     B02.GARANTITILLEGG_BARN(2)     ) & 00004770
                (B01.SUM_YTELSE(2) = B02.SUM_YTELSE(2)              )   00004780
                                                                      ! 00004790
           (B01.G_DATO_ÅM(SØKER_IND) > B02.G_DATO_ÅM(SØKER_IND))  ) THEN00004800
               B02 = B01;                                               00004810
         ELSE                                                           00004820
                                                                        00004830
         IF STØNADSBREV_ØNSKET_IND = JA THEN                            00004840
              DO;                                                       00004850
                 IF TRANS_OPPL_OMR.TRANSTYPE = 98   THEN                00004860
                    TRANS_OPPL_OMR.TRANSTYPE = 10;                      00004870
                                                                        00004880
  /*             IF DIV_PARAM_OMR.DAGPENGER_DATO_ÅM > 0   &             00004890
                    DIV_PARAM_OMR.DAGPENGER_DATO_ÅM ^=                  00004900
                       AUTODATO_ÅM THEN;                                00004910
                 ELSE                                                   00004920
  */                                                                    00004930
                 EXEC CICS LINK PROGRAM('R0017001') COMMAREA(KOM_OMR);  00004940
                                       /*LAG_STØNADSBREV_TRANSER*/      00004950
                 IF FEIL_MELD_NR > 0 THEN                               00004960
                    GOTO AVSLUTNING;                                    00004970
                 IF TRANS_OPPL_OMR.TRANSTYPE = 99   THEN                00004980
                    TRANS_OPPL_OMR.TRANSTYPE = 27;                      00004990
                                                                        00005000
              END;                                                      00005010
                                                                        00005020
       END;                                                             00005030
                                                                        00005040
 /* VED OPPHØR MÅ STØNADSBREV-RUTINA KALLES FOR Å UNDERSØKE      */     00005050
 /* OM DET FINNES TRANSAKSJONER PÅ PERSONEN FRA FØR :            */     00005060
                                                                        00005070
     ELSE    /* TRANSTYPE ER DA > 49 */                                 00005080
                                                                        00005090
        IF TRANS_OPPL_OMR.TRANSTYPE = 54  !                             00005100
                                                                        00005110
             /*54 = PENSJONIST ER DØD, EKTEFELLEN HAR IKKE PENSJON*/    00005120
                                                                        00005130
           TRANS_OPPL_OMR.TRANSTYPE = 55          THEN                  00005140
                                                                        00005150
             /*55 = PENSJON OPPHØRER, EKTEFELLEN HAR IKKE PENSJON*/     00005160
                                                                        00005170
           IF STØNADSBREV_ØNSKET_IND = JA THEN                          00005180
                                                                        00005190
              DO;                                                       00005200
                                                                        00005210
                 EXEC CICS LINK PROGRAM('R0017001') COMMAREA(KOM_OMR);  00005220
                                     /*LAG_STØNADSBREV_TRANSER*/        00005230
                 STØNADSBREV_ØNSKET_IND = NEI;/*HL 1194*/               00005240
                 IF FEIL_MELD_NR > 0 THEN                               00005250
                    GOTO AVSLUTNING;                                    00005260
              END;                                                      00005270
                                                                        00005280
        IF FUNKSJONSKODE = 'E' THEN                                     00005290
           IF W01_FØRSTE_GANG  THEN                                     00005300
              DO;                                                       00005310
                 WS_TRANS_OPPL_VIRK_DATO =                              00005320
                                       TRANS_OPPL_OMR.VIRKNINGSDATO;    00005330
                 TRANS_OPPL_OMR.VIRKNINGSDATO =                         00005340
                             TRANS_LISTE_OMR.VIRKNINGSDATO(1);          00005350
                                                                        00005360
                 DO I = 1 TO 14;                                        00005370
                    B01.PERSON(I)   = ''  ;                             00005380
                 END;                                                   00005390
                                                                        00005400
                 W01_FØRSTE_GANG = '0'B;                                00005410
                                                                        00005420
                /*LAG_DYNAMISK_STAT_TRANS*/                             00005430
                                                                        00005440
                 EXEC CICS LINK PROGRAM('R0016001') COMMAREA(KOM_OMR);  00005450
                                                                        00005460
                 TRANS_OPPL_OMR.VIRKNINGSDATO = WS_TRANS_OPPL_VIRK_DATO;00005470
                                                                        00005480
                 B01 = B02;                                             00005490
              END;                                                      00005500
                                                                        00005510
     IF B02.PENSJONSTYPE2(SØKER_IND) ^= 'A'        THEN    /*0594 HL*/  00005520
        EXEC CICS LINK PROGRAM('R0016001') COMMAREA(KOM_OMR);           00005530
                                                                        00005540
     IF FEIL_MELD_NR > 0 THEN                                           00005550
        GOTO AVSLUTNING;                                                00005560
                                                                        00005570
     IF TRANSTYPE2 > 0 THEN    /** BARNEKULLET ER OPPDATERT, NÅ   **/   00005580
       DO;                     /** SKAL DET UFØRE BARN OPPDATERES **/   00005590
         SØKER_IND = UFØR_BARN_IND;                                     00005600
         TRANS_OPPL_OMR.TRANSTYPE  = TRANSTYPE2;                        00005610
         TRANSTYPE2                = 0;                                 00005620
         TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR(SØKER_IND);       00005630
       END;                                                             00005640
     ELSE                                                               00005650
       HENDELSE_IND = NEI;                                              00005660
                                                                        00005670
     B01 = B02;                                                         00005680
                                                                        00005690
   END;   /** DO WHILE (HENDELSE_IND = JA)  **/                         00005700
                                                                        00005710
   AUTODATO_ÅM = AUTODATO_ÅM + 1;                                       00005720
   IF AUTODATO_M = 13 THEN                                              00005730
     DO;                                                                00005740
       AUTODATO_M = 1;                                                  00005750
       AUTODATO_Å = AUTODATO_Å + 1;                                     00005760
     END;                                                               00005770
                                                                        00005780
   CALL  ADDER_EN_MND_TIL_ALDER_FAMILIE;                                00005790
                                                                        00005800
 END;  /** DO WHILE (AUTODATO_ÅM <= NESTE_HENDELSE_DATO_ÅM) **/         00005810
                                                                        00005820
 IF UFØR_BARN_IND > 0 THEN                                              00005830
   FAMILIE_SPLITTET_IND = JA;                                           00005840
                                                                        00005850
 AVSLUTNING:                                                            00005860
                                                                        00005870
 SØKER_IND                = START_SØKER_IND;                            00005880
                                                                        00005890
                                                                        00005900
    KOM_OMR.TRANS_OPPL_PEKER = START_TRANS_OPPL_PEKER;                  00005910
                                                                        00005920
 EXEC CICS RETURN;                                                      00005930
                                                                        00005940
 /*****  HER SLUTTER HOVEDSTYRINGEN  *****/                             00005950
                                                                        00005960
                                                                        00005970
 AUTO_ONLINE:                                                           00005980
   PROC;                                                                00005990
                                                                        00006000
                                                                        00006010
     DCL        FINNES_SØKER_TIL_DØD BIT(1) INIT('0'B);                 00006020
 /*****  FOR Å FÅ SATT STYRING FOR TILLEGGSPENSJON FRA DØDE *****/      00006030
                                                                        00006040
   DO I = 1 TO 2;                                                       00006050
     IF B01.STATUS.DØDSDATO_ÅMD    (I) > 0 &                            00006060
        ALDER_PERSON_ÅM(I) > 1912          &                            00006070
        B01.STATUS.STATUS_KODE_HIST(I) = 'X' THEN                       00006080
       DO;                                                              00006090
          AVDØD_IND = I;                                                00006100
          W_FNR  = B01.RF0PERSN.FNR(I);                                 00006110
          DØDSDATO_ÅM = B01.DØDSDATO_ÅMD(I) / 100;                      00006120
          PIC11 = B01.RF0PERSN.FNR(I);                                  00006130
          ALDER_VED_DØD = F_ALDER (PIC11,F_SNU_DATO(DØDSDATO_ÅM));      00006140
                                                                        00006150
         /** FINNE SISTE UTFYLLTE BUP_GAR_KODE FOR HIST PERSON**/       00006160
                                                                        00006170
       /*0697 HL*/                                                      00006180
          DO J = 7 TO 1 BY -1 UNTIL(B01.UFØRHIST.BUP_GAR_KODE           00006190
                                      (I,J) ^= ' ');                    00006200
             BUP_SISTE = J;                                             00006210
          END;                                                          00006220
                                                                        00006230
          IF (B01.UFØRHIST.BUP_GAR_KODE(I,BUP_SISTE) = 'A' &            00006240
                            /* UNG UFØR SOM VENTER*/                    00006250
              AUTODATO_ÅM > 8104 )         THEN                         00006260
             DO;                                                        00006270
                TRANS_OPPL_OMR.TRANSTYPE     = 31;                      00006280
 /*31 = FØDT UFØR FYLLER 20, ELLER ER 20 OG DATOEN ER 8105*/            00006290
                FINNES_SØKER_TIL_DØD = '1'B;                            00006300
                B02.BUP_GAR_KODE(I,BUP_SISTE) = 'B';                    00006310
             END;                                                       00006320
           ELSE                                                         00006330
           IF  (B01.UFØRHIST.BUP_GAR_KODE(I,BUP_SISTE)='C' &            00006340
                AUTODATO_ÅM = 8401)       THEN                          00006350
                                                                        00006360
             DO;                                                        00006370
                TRANS_OPPL_OMR.TRANSTYPE     = 46;                      00006380
  /*46 = FØDT UFØR FYLLER 21 ÅR, ELLER ER 21 OG DATOEN ER 8401*/        00006390
                FINNES_SØKER_TIL_DØD = '1'B;                            00006400
                B02.BUP_GAR_KODE(I,BUP_SISTE) = 'B';                    00006410
             END;                                                       00006420
                                                                        00006430
           ELSE                                                         00006440
           IF  B01.UFØRHIST.BUP_GAR_KODE(I,BUP_SISTE)= 'E'  THEN        00006450
              DO;                                                       00006460
                 IF AUTODATO_ÅM = 8907           !                      00006470
                    AUTODATO_ÅM = 9101           !                      00006480
                    AUTODATO_ÅM = 9201           !                      00006490
                    AUTODATO_ÅM = 9205           !                      00006500
                    AUTODATO_ÅM = 9707           THEN                   00006510
                    DO;                                                 00006520
                       TRANS_OPPL_OMR.TRANSTYPE    = 46;                00006530
                       FINNES_SØKER_TIL_DØD = '1'B;                     00006540
                    END;                                                00006550
              END;                                                      00006560
                                                                        00006570
           ELSE /*9707 HL : */                                          00006580
           IF  (B01.UFØRHIST.BUP_GAR_KODE(I,BUP_SISTE)= 'D') THEN       00006590
              DO;                             /* UNG UFØR SOM VENTER*/  00006600
                                              /* PÅ LOVENDRING*/        00006610
                 ALDER_UF_DØD = F_ALDER                                 00006620
                  (PIC11,F_SNU_DATO((B01.UFØRHIST.UFT_ÅM(I,1))));       00006630
                 CALL UNG_DØD_D(I,BUP_SISTE,ALDER_UF_DØD);              00006640
                 IF  (B02.BUP_GAR_KODE(I,BUP_SISTE) ^= 'D') THEN        00006650
                   DO;                                                  00006660
                      DO K = 1 TO BUP_SISTE;                            00006670
                         B02.UFØRHIST.BUP_GAR_KODE(I,K) =               00006680
                         B02.UFØRHIST.BUP_GAR_KODE(I,BUP_SISTE);        00006690
                         B02.UFØRHIST.BUP_GARANTI(I,K) =                00006700
                         B02.UFØRHIST.BUP_GARANTI(I,BUP_SISTE);         00006710
                      END;                                              00006720
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00006730
                      FINNES_SØKER_TIL_DØD = '1'B;                      00006740
                   END;                                                 00006750
              END;                                                      00006760
                                                                        00006770
                                                                        00006780
           ELSE                                                         00006790
           IF  (B01.UFØRHIST.BUP_GAR_KODE(I,BUP_SISTE)= 'B' &           00006800
                AUTODATO_ÅM = 9105)  THEN                               00006810
             DO;                                                        00006820
                TRANS_OPPL_OMR.TRANSTYPE     = 46;                      00006830
                FINNES_SØKER_TIL_DØD = '1'B;                            00006840
             END;                                                       00006850
                                                                        00006860
                                                                        00006870
 /* ****************************                                        00006880
                                                                        00006890
           ELSE                                                         00006900
           IF ALDER_VED_DØD < 2001         THEN                         00006910
                                                                        00006920
             DO;                                                        00006930
                IF AUTODATO_ÅM = 9105        THEN                       00006940
                   DO;                                                  00006950
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00006960
                      FINNES_SØKER_TIL_DØD = '1'B;                      00006970
                   END;                                                 00006980
                ELSE                                                    00006990
                IF AUTODATO_ÅM = 8805        THEN                       00007000
                   DO;                                                  00007010
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00007020
                      FINNES_SØKER_TIL_DØD = '1'B;                      00007030
                   END;                                                 00007040
                ELSE                                                    00007050
                IF AUTODATO_ÅM = 8705        THEN                       00007060
                   DO;                                                  00007070
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00007080
                      FINNES_SØKER_TIL_DØD = '1'B;                      00007090
                   END;                                                 00007100
                ELSE                                                    00007110
                IF AUTODATO_ÅM = 8105        THEN                       00007120
                   DO;                                                  00007130
                      TRANS_OPPL_OMR.TRANSTYPE     = 31;                00007140
                      FINNES_SØKER_TIL_DØD = '1'B;                      00007150
                   END;                                                 00007160
             END;                                                       00007170
          ELSE                                                          00007180
          IF ALDER_VED_DØD < 2101         THEN                          00007190
                                                                        00007200
             DO;                                                        00007210
                IF AUTODATO_ÅM = 9105        THEN                       00007220
                   DO;                                                  00007230
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00007240
                      FINNES_SØKER_TIL_DØD = '1'B;                      00007250
                   END;                                                 00007260
                ELSE                                                    00007270
                IF AUTODATO_ÅM = 8805        THEN                       00007280
                   DO;                                                  00007290
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00007300
                      FINNES_SØKER_TIL_DØD = '1'B;                      00007310
                   END;                                                 00007320
                ELSE                                                    00007330
                IF AUTODATO_ÅM = 8705        THEN                       00007340
                   DO;                                                  00007350
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00007360
                      FINNES_SØKER_TIL_DØD = '1'B;                      00007370
                   END;                                                 00007380
                ELSE                                                    00007390
                IF AUTODATO_ÅM = 8405        THEN                       00007400
                   DO;                                                  00007410
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00007420
                      FINNES_SØKER_TIL_DØD = '1'B;                      00007430
                   END;                                                 00007440
             END;                                                       00007450
          ELSE                                                          00007460
          IF ALDER_VED_DØD < 2201         THEN                          00007470
            DO;                                                         00007480
             IF AUTODATO_ÅM = 8901        THEN                          00007490
                DO;                                                     00007500
                   TRANS_OPPL_OMR.TRANSTYPE     = 46;                   00007510
                   FINNES_SØKER_TIL_DØD = '1'B;                         00007520
                END;                                                    00007530
             IF AUTODATO_ÅM = 9105        THEN                          00007540
                DO;                                                     00007550
                   TRANS_OPPL_OMR.TRANSTYPE     = 46;                   00007560
                   FINNES_SØKER_TIL_DØD = '1'B;                         00007570
                END;                                                    00007580
            END;                                                        00007590
          ELSE                                                          00007600
          IF ALDER_VED_DØD < 2401         THEN                          00007610
            DO;                                                         00007620
             IF AUTODATO_ÅM = 9205     !                                00007630
                AUTODATO_ÅM = 9705        THEN                          00007640
                DO;                                                     00007650
                   TRANS_OPPL_OMR.TRANSTYPE     = 46;                   00007660
                   FINNES_SØKER_TIL_DØD = '1'B;                         00007670
                END;                                                    00007680
            END;                                                        00007690
          ELSE                                                          00007700
          IF ALDER_VED_DØD < 2601         THEN                          00007710
            DO;                                                         00007720
             IF AUTODATO_ÅM = 9707        THEN                          00007730
                DO;                                                     00007740
                   TRANS_OPPL_OMR.TRANSTYPE     = 46;                   00007750
                   FINNES_SØKER_TIL_DØD = '1'B;                         00007760
                END;                                                    00007770
            END;                                                        00007780
                                                                        00007790
   ****************************************************** */            00007800
          ELSE                                                          00007810
          IF ALDER_VED_DØD < 2601         THEN                          00007820
             IF AUTODATO_ÅM = 9707        THEN                          00007830
                DO;                                                     00007840
                   IF (FNR_R.ÅR > 30     &                              00007850
                       ALDER_VED_DØD > 2400)       !                    00007860
                       FNR_R.ÅR = 41               !                    00007870
                       FNR_R.ÅR = 42                   THEN             00007880
                      DO;                                               00007890
                         TRANS_OPPL_OMR.TRANSTYPE     = 46;             00007900
                         FINNES_SØKER_TIL_DØD = '1'B;                   00007910
                      END;                                              00007920
                END;                                                    00007930
             ELSE                                                       00007940
             IF ALDER_VED_DØD < 2401         THEN                       00007950
                IF AUTODATO_ÅM = 9705  THEN                             00007960
                   DO;                                                  00007970
                      IF FNR_R.ÅR > 30     &                            00007980
                         FNR_R.ÅR < 43                  THEN            00007990
                         DO;                                            00008000
                            TRANS_OPPL_OMR.TRANSTYPE     = 46;          00008010
                            FINNES_SØKER_TIL_DØD = '1'B;                00008020
                         END;                                           00008030
                   END;                                                 00008040
                ELSE                                                    00008050
                IF AUTODATO_ÅM = 9205        THEN                       00008060
                   DO;                                                  00008070
                      IF FNR_R.ÅR > 25             THEN                 00008080
                         DO;                                            00008090
                            TRANS_OPPL_OMR.TRANSTYPE     = 46;          00008100
                            FINNES_SØKER_TIL_DØD = '1'B;                00008110
                         END;                                           00008120
                   END;                                                 00008130
                ELSE                                                    00008140
                IF ALDER_VED_DØD < 2201                 THEN            00008150
                   IF AUTODATO_ÅM = 9201        THEN                    00008160
                      DO;                                               00008170
                          IF FNR_R.ÅR > 25   &                          00008180
                             FNR_R.ÅR < 45             THEN             00008190
                             DO;                                        00008200
                                TRANS_OPPL_OMR.TRANSTYPE     = 46;      00008210
                                FINNES_SØKER_TIL_DØD = '1'B;            00008220
                             END;                                       00008230
                      END;                                              00008240
                   ELSE                                                 00008250
                   IF AUTODATO_ÅM = 9105        THEN                    00008260
                      DO;                                               00008270
                         IF FNR_R.ÅR > 44           THEN                00008280
                            DO;                                         00008290
                               TRANS_OPPL_OMR.TRANSTYPE     = 46;       00008300
                               FINNES_SØKER_TIL_DØD = '1'B;             00008310
                            END;                                        00008320
                      END;                                              00008330
                   ELSE                                                 00008340
                   IF AUTODATO_ÅM = 9101        THEN                    00008350
                      DO;                                               00008360
                          IF FNR_R.ÅR > 24   &                          00008370
                             FNR_R.ÅR < 45            THEN              00008380
                             DO;                                        00008390
                                TRANS_OPPL_OMR.TRANSTYPE     = 46;      00008400
                                FINNES_SØKER_TIL_DØD = '1'B;            00008410
                             END;                                       00008420
                      END;                                              00008430
                   ELSE                                                 00008440
                   IF AUTODATO_ÅM = 8907        THEN                    00008450
                      DO;                                               00008460
                         IF FNR_R.ÅR > 22   &                           00008470
                            FNR_R.ÅR < 45            THEN               00008480
                            DO;                                         00008490
                               TRANS_OPPL_OMR.TRANSTYPE     = 46;       00008500
                               FINNES_SØKER_TIL_DØD = '1'B;             00008510
                            END;                                        00008520
                      END;                                              00008530
                   ELSE                                                 00008540
                   IF AUTODATO_ÅM = 8901        THEN                    00008550
                      DO;                                               00008560
                         IF FNR_R.ÅR > 44            THEN               00008570
                            DO;                                         00008580
                               TRANS_OPPL_OMR.TRANSTYPE     = 46;       00008590
                               FINNES_SØKER_TIL_DØD = '1'B;             00008600
                            END;                                        00008610
                      END;                                              00008620
                   ELSE                                                 00008630
                   IF ALDER_VED_DØD < 2101              THEN            00008640
                      IF AUTODATO_ÅM = 8805        THEN                 00008650
                         DO;                                            00008660
                            IF FNR_R.ÅR > 45           THEN             00008670
                               DO;                                      00008680
                                  TRANS_OPPL_OMR.TRANSTYPE     = 46;    00008690
                                  FINNES_SØKER_TIL_DØD = '1'B;          00008700
                               END;                                     00008710
                         END;                                           00008720
                      ELSE                                              00008730
                      IF AUTODATO_ÅM = 8705     !                       00008740
                         AUTODATO_ÅM = 8401        THEN                 00008750
                         DO;                                            00008760
                            IF FNR_R.ÅR > 45           THEN             00008770
                               DO;                                      00008780
                                  TRANS_OPPL_OMR.TRANSTYPE     = 46;    00008790
                                  FINNES_SØKER_TIL_DØD = '1'B;          00008800
                               END;                                     00008810
                         END;                                           00008820
                      ELSE                                              00008830
                      IF ALDER_VED_DØD < 2001   &                       00008840
                         AUTODATO_ÅM = 8401        THEN                 00008850
                         DO;                                            00008860
                            IF FNR_R.ÅR > 46           THEN             00008870
                               DO;                                      00008880
                                  TRANS_OPPL_OMR.TRANSTYPE     = 46;    00008890
                                  FINNES_SØKER_TIL_DØD = '1'B;          00008900
                               END;                                     00008910
                         END;                                           00008920
                                                                        00008930
       END;                                                             00008940
                                                                        00008950
   END;                                                                 00008960
                                                                        00008970
 IF AUTODATO_ÅM = 9201       THEN                                       00008980
 DO I = 1 TO 3;                                                         00008990
     IF B01.STATUS.VIRK_DATO_ÅM    (I) > 0   &                          00009000
        B01.GT_LOV92               (I) = 0   &                          00009010
        B01.STATUS.STATUS_KODE_HIST(I) = ' ' THEN                       00009020
     DO;                                                                00009030
     SELECT (B01.PENSJONSTYPE1(I));                                     00009040
                                                                        00009050
        WHEN('A')                                                       00009060
           DO;                                                          00009070
              IF B01.TP_BRUTTO(I)     > 0          &                    00009080
                 ALDER_PERSON_ÅM(3-I) < 6600     THEN                   00009090
                 DO;                                                    00009100
                                                                        00009110
              B02.GT_LOV92(I) = B01.ETTEPENS.TP_BRUTTO(I)               00009120
                              + B01.ALDERSP.TP(I);                      00009130
              B02.ALDERSP.SPT_1291(I) = B01.ALDERSP.SPT(I);             00009140
              B02.ALDERSP.OPT_1291(I) = B01.ALDERSP.OPT(I);             00009150
              B02.ALDERSP.PÅ_1291 (I) = B01.ALDERSP.PÅ (I);             00009160
              B02.ETTEPENS.SPT_1291(I) = B01.ETTEPENS.SPT_AVD(I);       00009170
              B02.ETTEPENS.OPT_1291(I) = B01.ETTEPENS.OPT_AVD(I);       00009180
              B02.ETTEPENS.PÅ_1291(I)  = B01.ETTEPENS.PÅ_AVD(I);        00009190
              HENDELSE_IND = JA;                                        00009200
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */         00009210
              TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);   00009220
              SØKER_IND = I;                                            00009230
              EKTEF_IND = 3 - I;                                        00009240
                 END;                                                   00009250
           END;                                                         00009260
                                                                        00009270
        WHEN('K')                                                       00009280
           DO;                                                          00009290
              B02.GT_LOV92(I) = B01.ALDERSP.TP(I);                      00009300
              B02.ALDERSP.SPT_1291(I) = B01.ALDERSP.SPT(I);             00009310
              B02.ALDERSP.OPT_1291(I) = B01.ALDERSP.OPT(I);             00009320
              B02.ALDERSP.PÅ_1291 (I) = B01.ALDERSP.PÅ (I);             00009330
              HENDELSE_IND = JA;                                        00009340
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */         00009350
              TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);   00009360
              SØKER_IND = I;                                            00009370
              EKTEF_IND = 3 - I;                                        00009380
           END;                                                         00009390
        WHEN('U', 'Y')                                                  00009400
           DO;                                                          00009410
            IF ALDER_PERSON_ÅM(I) < 6600     THEN                       00009420
              DO;                                                       00009430
                 B02.GT_LOV92(I) = B01.UFØRPENS.TP(I) +                 00009440
                                   B01.YRKEPENS.TP(I) +                 00009450
                                   B01.ETTEPENS.TP_BRUTTO(I);           00009460
                 DCL W_SISTE_UFT   FIXED BIN(15);                       00009470
                 W_SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                   00009480
                 IF B02.UFØRHIST.BUP(I,W_SISTE_UFT) > 5 THEN            00009490
                 DO;                                                    00009500
                    B02.UFØRPENS.SPT_1291(I) = B01.UFØRPENS.SPT(I);     00009510
                    B02.UFØRPENS.OPT_1291(I) = B01.UFØRPENS.OPT(I);     00009520
                    B02.UFØRPENS.PÅ_1291 (I) = B01.UFØRPENS.PÅ (I);     00009530
                    B02.YRKE_POENG_1291(I)   = B01.YRKEPENS.YPT(I);     00009540
                 END;                                                   00009550
                 HENDELSE_IND = JA;                                     00009560
                 TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */      00009570
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00009580
                 SØKER_IND = I;                                         00009590
                 EKTEF_IND = 3 - I;                                     00009600
              END;                                                      00009610
              IF B01.TP_BRUTTO(I)     > 0          &                    00009620
                 ALDER_PERSON_ÅM(3-I) < 6600     THEN                   00009630
                 DO;                                                    00009640
              B02.ETTEPENS.SPT_1291(I) = B01.ETTEPENS.SPT_AVD(I);       00009650
              B02.ETTEPENS.OPT_1291(I) = B01.ETTEPENS.OPT_AVD(I);       00009660
              B02.ETTEPENS.PÅ_1291(I)  = B01.ETTEPENS.PÅ_AVD(I);        00009670
              HENDELSE_IND = JA;                                        00009680
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */         00009690
              TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);   00009700
              SØKER_IND = I;                                            00009710
              EKTEF_IND = 3 - I;                                        00009720
                 END;                                                   00009730
           END;                                                         00009740
                                                                        00009750
        WHEN('E')                                                       00009760
           DO;                                                          00009770
              IF ALDER_PERSON_ÅM(3-I) < 6600     THEN                   00009780
                 DO;                                                    00009790
              B02.GT_LOV92(I) = B01.ETTEPENS.TP_BRUTTO(I);              00009800
              B02.ETTEPENS.SPT_1291(I) = B01.ETTEPENS.SPT_AVD(I);       00009810
              B02.ETTEPENS.OPT_1291(I) = B01.ETTEPENS.OPT_AVD(I);       00009820
              B02.ETTEPENS.PÅ_1291(I)  = B01.ETTEPENS.PÅ_AVD(I);        00009830
              HENDELSE_IND = JA;                                        00009840
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */         00009850
              TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);   00009860
              SØKER_IND = I;                                            00009870
              EKTEF_IND = 3 - I;                                        00009880
                 END;                                                   00009890
           END;                                                         00009900
                                                                        00009910
        WHEN('B')                                                       00009920
           DO;                                                          00009930
              B02.GT_LOV92(I) = B01.ETTEBARN.TP(I);                     00009940
              B02.SPT_1291_MOR(I) = B01.SPT_MOR(I);                     00009950
              B02.OPT_1291_MOR(I) = B01.OPT_MOR(I);                     00009960
              B02.PÅ_1291_MOR(I) = B01.PÅ_MOR(I);                       00009970
              B02.SPT_1291_FAR(I) = B01.SPT_FAR(I);                     00009980
              B02.OPT_1291_FAR(I) = B01.OPT_FAR(I);                     00009990
              B02.PÅ_1291_FAR(I) = B01.PÅ_FAR(I);                       00010000
              HENDELSE_IND = JA;                                        00010010
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */         00010020
              TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);   00010030
              SØKER_IND = I;                                            00010040
           END;                                                         00010050
                                                                        00010060
        OTHERWISE;                                                      00010070
     END;  /*OF SELECT*/                                                00010080
     END;                                                               00010090
 END;  /*DO I = 1 TO 3 */                                               00010100
                                                                        00010110
   I = 1;                                                               00010120
   TRANSTYPE2 = 0;                                                      00010130
                                                                        00010140
   DO WHILE (I < 3);                                                    00010150
     IF B01.STATUS.VIRK_DATO_ÅM    (I) > 0 &                            00010160
        B01.STATUS.STATUS_KODE_HIST(I) = ' ' THEN                       00010170
       DO;                                                              00010180
          PIC11 = B01.RF0PERSN.FNR(I);                                  00010190
                                                                        00010200
         /** FINNE SISTE UTFYLTE BUP_GAR_KODE FOR SØKER   **/           00010210
                                                                        00010220
     /*0697 HL:*/                                                       00010230
         DO J = 7 TO 1 BY -1 UNTIL(B01.UFØRHIST.BUP_GAR_KODE            00010240
                                      (I,J) ^= ' ');                    00010250
           BUP_SISTE = J;                                               00010260
         END;                                                           00010270
                                                                        00010280
         IF (ALDER_PERSON_ÅM(I) = 7000            &                     00010290
             AUTODATO_ÅM        < 9100            &                     00010300
             B01.STATUS.PENSJONSTYPE1(I) = 'A' )  !                     00010310
            (ALDER_PERSON_ÅM(I) = 7001            &                     00010320
             AUTODATO_ÅM        > 9101            &                     00010330
             B01.TKNR(I)        ^= 0              &   /*0796 HL*/       00010340
             B01.STATUS.PENSJONSTYPE1(I) = 'A') THEN                    00010350
                                                                        00010360
            DO;                                                         00010370
               CALL P67_TIL_P70(FAMILIE_IND);                           00010380
               HENDELSE_IND = JA;                                       00010390
               SØKER_IND = I;                                           00010400
               I = I + 1;                                               00010410
            END;                                                        00010420
                                                                        00010430
         ELSE IF (ALDER_PERSON_ÅM(I)  = 6700    &                       00010440
                  AUTODATO_ÅM         < 9100    &                       00010450
                  ÅR > 5 & ÅRHUNDRE < 5      )           !              00010460
                  (ALDER_PERSON_ÅM(I)  = 6701   &                       00010470
                   AUTODATO_ÅM         > 9101   &                       00010480
                  ÅR > 5 & ÅRHUNDRE < 5      )           !              00010490
                 (ALDER_PERSON_ÅM(I) >= 6700    &                       00010500
                  ALDER_PERSON_ÅM(I) <  7000    &                       00010510
                  AUTODATO_ÅM         = 7301)            !              00010520
                 (ALDER_PERSON_ÅM(I)  = 7000    &                       00010530
                   AUTODATO_ÅM         < 9100   &                       00010540
                   B01.STATUS.PENSJONSTYPE1(I) ^= 'A')   !              00010550
                  (ALDER_PERSON_ÅM(I)  = 7001   &                       00010560
                   AUTODATO_ÅM         > 9101   &                       00010570
                   B01.STATUS.PENSJONSTYPE1(I) ^= 'F' &                 00010580
                   B01.STATUS.PENSJONSTYPE1(I) ^= 'A')            THEN  00010590
                                                                        00010600
                 DO;                                                    00010610
                                                                        00010620
 /* ENDRET FOR OVERGANGSSTØNAD 250894 HL */                             00010630
                                                                        00010640
                   IF (B01.STATUS.PENSJONSTYPE1(I) = 'E' &              00010650
                       B01.STATUS.PENSJONSTYPE2(I) ^= 'O' )  !          00010660
                      B01.STATUS.PENSJONSTYPE1(I) = 'J' !               00010670
                      B01.STATUS.PENSJONSTYPE1(I) = 'K' !               00010680
                      B01.STATUS.PENSJONSTYPE1(I) = 'Y' !               00010690
                      B01.STATUS.PENSJONSTYPE1(I) = 'U' THEN            00010700
                                                                        00010710
                      DO;                                               00010720
                         CALL OVERGANG_TIL_P67(FAMILIE_IND);            00010730
                         HENDELSE_IND = JA;                             00010740
                         SØKER_IND = I;                                 00010750
                         I = I + 1;                                     00010760
                      END;                                              00010770
                                                                        00010780
                   ELSE IF B01.STATUS.PENSJONSTYPE1(I) = 'F' THEN       00010790
                                                                        00010800
                      DO;                                               00010810
                         CALL FJERN_EKTEFELLE_TILLEGG(I);               00010820
                         HENDELSE_IND = JA;                             00010830
                         FAMILIE_IND = I;                               00010840
                         I = I + 1;                                     00010850
                      END;                                              00010860
                                                                        00010870
                   ELSE IF (B01.STATUS.PENSJONSTYPE1(I) = 'E' &         00010880
                            B01.STATUS.PENSJONSTYPE2(I) = 'O')  THEN    00010890
              DO;                                                       00010900
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00010910
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00010920
                 B02.STATUS.VIRK_DATO_ÅM   (I)    = AUTODATO_ÅM;        00010930
   /* BRUKES */    HJ_VIRK_DATO_ÅM  = AUTODATO_ÅM;                      00010940
   /* I 9938 */    SØKER_IND = I;                                       00010950
                 CALL ETTERLATTEPENSJON_OPPHØRER;  /* R0019938 */       00010960
                 HENDELSE_IND = JA;                                     00010970
                 I = I + 1;                                             00010980
              END;                                                      00010990
                                                                        00011000
                 END;    /** IF ALDER_PERSON_ÅM(I) = 6700 **/           00011010
                                                                        00011020
                 /* AFP-FRA STAT OVER TIL AFP-NULLPENSJON . TRUDE */    00011030
         ELSE IF  ALDER_PERSON_ÅM(I) = 6501      THEN                   00011040
            DO;                                                         00011050
               IF B01.PENSJONSTYPE1(I) = 'K'    &                       00011060
                  B01.PENSJONSTYPE3(I) = 'S'    &                       00011070
                  AUTODATO_ÅM        > 9310           THEN              00011080
                  DO;                                                   00011090
                     CALL AFP_STAT_TIL_NULL(FAMILIE_IND);               00011100
                     HENDELSE_IND = JA;                                 00011110
                     SØKER_IND = I;                                     00011120
                     I = I + 1;                                         00011130
                  END;                                                  00011140
               ELSE                                                     00011150
               IF B01.PENSJONSTYPE3(I) = 'K'    &                       00011160
                 (B01.PENSJONSTYPE2(3-I) = 'P'   !                      00011170
                  B01.PENSJONSTYPE2(3-I) = 'N')  &      /*9802 HL*/     00011180
                  AUTODATO_ÅM        > 9801           THEN              00011190
                  DO;                                                   00011200
                     CALL AFP_KOM_6501(FAMILIE_IND);                    00011210
                     HENDELSE_IND = JA;                                 00011220
                     SØKER_IND = I;                                     00011230
                     I = I + 1;                                         00011240
                                                                        00011250
                  END;                                                  00011260
            END;                                                        00011270
                                                                        00011280
         ELSE IF (ALDER_PERSON_ÅM(I) = 1800    &                        00011290
                  AUTODATO_ÅM        < 9100    &                        00011300
                 B01.PENSJONSTYPE1(I) = 'Y'    )        !               00011310
                 (ALDER_PERSON_ÅM(I) = 1801    &                        00011320
                  AUTODATO_ÅM        > 9101    &                        00011330
                 B01.PENSJONSTYPE1(I) = 'Y'    ) THEN                   00011340
                 CALL YRKESSKADE_ELEV(ETT_POENG);                       00011350
                                                                        00011360
         ELSE IF (ALDER_PERSON_ÅM(I) = 1900    &                        00011370
                  AUTODATO_ÅM        < 9100    &                        00011380
                 B01.PENSJONSTYPE1(I) = 'Y'    )     !                  00011390
                 (ALDER_PERSON_ÅM(I) = 1901    &                        00011400
                  AUTODATO_ÅM        > 9101    &                        00011410
                 B01.PENSJONSTYPE1(I) = 'Y'    ) THEN                   00011420
                 CALL YRKESSKADE_ELEV(ETT_KOMMA_FEM_POENG);             00011430
                                                                        00011440
         ELSE IF (ALDER_PERSON_ÅM(I) = 2000    &                        00011450
                  AUTODATO_ÅM        < 9100    &                        00011460
                 B01.PENSJONSTYPE1(I) = 'Y'    )   !                    00011470
                 (ALDER_PERSON_ÅM(I) = 2001    &                        00011480
                  AUTODATO_ÅM        > 9101    &                        00011490
                 B01.PENSJONSTYPE1(I) = 'Y'    ) THEN                   00011500
                 CALL YRKESSKADE_ELEV(TO_POENG);                        00011510
                                                                        00011520
 /*TILLEGG 2.3.89 HL */                                                 00011530
                                                                        00011540
         ELSE IF AUTODATO_ÅM          = 8904        &                   00011550
                 ALDER_PERSON_ÅM(I)  >= 6000        &                   00011560
                 B01.PENSJONSTYPE1(I) = 'F'        THEN                 00011570
                 DO;                                                    00011580
                    CALL FORSØRGET_EK_BLIR_60ÅR(I);                     00011590
                    HENDELSE_IND = JA;                                  00011600
                    FAMILIE_IND = I;                                    00011610
                    I = I + 1;                                          00011620
                 END;                                                   00011630
                                                                        00011640
         ELSE IF (AUTODATO_ÅM          > 8904       &                   00011650
                  ALDER_PERSON_ÅM(I)   = 6000   &                       00011660
                  AUTODATO_ÅM          < 9100   &                       00011670
                  B01.PENSJONSTYPE1(I) = 'F'     )    !                 00011680
                 (AUTODATO_ÅM          > 9101       &                   00011690
                  ALDER_PERSON_ÅM(I)   = 6001   &                       00011700
                  B01.PENSJONSTYPE1(I) = 'F'     )  &                   00011710
 /*180396 HL : */                                                       00011720
                 (B01.UFØRPENS.TP(3-I) +                                00011730
                  B01.ALDERSP.TP (3-I)   )  <                           00011740
                  STILLEGG_2                       THEN                 00011750
                       DO;                                              00011760
                          CALL FORSØRGET_EK_BLIR_60ÅR(I);               00011770
                          HENDELSE_IND = JA;                            00011780
                          FAMILIE_IND = I;                              00011790
                          I = I + 1;                                    00011800
                       END;                                             00011810
         ELSE                                                           00011820
 /*      IF AUTODATO_ÅM = 8705       THEN                               00011830
                                                                        00011840
               IF B02.BUP_GAR_KODE(I,BUP_SISTE)         */              00011850
 /*9802 HL */                                                           00011860
         IF AUTODATO_ÅM = 8705       &                                  00011870
                                                                        00011880
                  B02.BUP_GAR_KODE(I,BUP_SISTE)  = 'B'  THEN            00011890
                                                                        00011900
                  DO;                                                   00011910
                     DO BUP_IND = 1 TO BUP_SISTE;                       00011920
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';              00011930
                        B02.BUP_GARANTI(I,BUP_IND) = 2.50;              00011940
                     END;                                               00011950
                     CALL FØDT_UFØR(FAMILIE_IND);                       00011960
                                                                        00011970
                     TRANS_OPPL_OMR.TRANSTYPE     = 30;                 00011980
  /*30 = FØDT UFØR FÅR OMREGNET PENSJON PR. 1.5.87 (2.50 POENG)     */  00011990
                     HENDELSE_IND = JA;                                 00012000
                     SØKER_IND = I;                                     00012010
                     I = I + 1;                                         00012020
                                                                        00012030
                  END;                                                  00012040
                                                                        00012050
   /*          ELSE;     B02.BUP_GAR_KODE(I,1) = 'B' */                 00012060
         ELSE                                                           00012070
  /*     IF AUTODATO_ÅM = 8805       THEN                               00012080
               IF B02.BUP_GAR_KODE(I,BUP_SISTE)   */                    00012090
  /*9802 HL */                                                          00012100
         IF AUTODATO_ÅM = 8805       &                                  00012110
               B02.BUP_GAR_KODE(I,BUP_SISTE) = 'B'  THEN                00012120
                                                                        00012130
                  DO;                                                   00012140
                     DO BUP_IND = 1 TO BUP_SISTE;                       00012150
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';              00012160
                        B02.BUP_GARANTI(I,BUP_IND) = 3.00;              00012170
                     END;                                               00012180
                     CALL FØDT_UFØR(FAMILIE_IND);                       00012190
                                                                        00012200
                     TRANS_OPPL_OMR.TRANSTYPE     = 39;                 00012210
  /*39 = FØDT UFØR FÅR OMREGNET PENSJON PR. 1.5.88 (3.00 POENG)     */  00012220
                     HENDELSE_IND = JA;                                 00012230
                     SØKER_IND = I;                                     00012240
                     I = I + 1;                                         00012250
                                                                        00012260
                  END;                                                  00012270
  /*           ELSE;     B02.BUP_GAR_KODE(I,1) = 'B' */                 00012280
         ELSE                                                           00012290
 /*      IF AUTODATO_ÅM = 9105       THEN                               00012300
                                                                        00012310
               IF B02.BUP_GAR_KODE(I,BUP_SISTE)   ************** */     00012320
   /*9802 HL */                                                         00012330
         IF AUTODATO_ÅM = 9105       &                                  00012340
                                                                        00012350
               B02.BUP_GAR_KODE(I,BUP_SISTE) = 'B'   THEN               00012360
                  DO;                                                   00012370
                     DO BUP_IND = 1 TO BUP_SISTE;                       00012380
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';              00012390
                        B02.BUP_GARANTI(I,BUP_IND) = 3.30;              00012400
                     END;                                               00012410
                     CALL FØDT_UFØR(FAMILIE_IND);                       00012420
                                                                        00012430
                     TRANS_OPPL_OMR.TRANSTYPE     = 39;                 00012440
  /*39 = FØDT UFØR FÅR OMREGNET PENSJON PR. 1.5.88 (3.00 POENG)   ??*/  00012450
                     HENDELSE_IND = JA;                                 00012460
                     SØKER_IND = I;                                     00012470
                     I = I + 1;                                         00012480
                  END;                                                  00012490
                                                                        00012500
      /*       ELSE;     B02.BUP_GAR_KODE(I,1) = 'B' */                 00012510
         ELSE                                                           00012520
         IF AUTODATO_ÅM          = 9101        &                        00012530
            B02.BUP_GAR_KODE(I,1) = 'E'         &                       00012540
            ÅR                    >  24         THEN                    00012550
              DO;                                                       00012560
                 IF I  = 1 THEN                                         00012570
                    I_EK = 2;                                           00012580
                 ELSE                                                   00012590
                    I_EK = 1;                                           00012600
                                                                        00012610
                 IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                00012620
                    B01.VIRK_DATO_ÅM     (I_EK) > 0    THEN             00012630
                    DO;                                                 00012640
                       B02.VIRK_DATO_ÅM     (I_EK) = AUTODATO_ÅM;       00012650
                       IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN         00012660
                          CALL BARN_18ÅR(I_EK);                         00012670
                    END;                                                00012680
                 B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;           00012690
 /*0897 HL       DO UF_IND = 1 TO BUP_SISTE;                            00012700
                    B02.BUP_GARANTI(I,UF_IND)    = 2;                   00012710
                 END;                                     */            00012720
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00012730
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00012740
                 TRANS_OPPL_OMR.TRANSTYPE     = 7;                      00012750
                 HENDELSE_IND = JA;                                     00012760
                 FAMILIE_IND = I;                                       00012770
                 IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                  00012780
                    CALL BARN_18ÅR(I);                                  00012790
                                                                        00012800
              END;                                                      00012810
                                                                        00012820
  /*TILLEGG, 20.01.92  TRUDE  KAN VI BRUKE SAMME TRANSTYPE ??  */       00012830
         ELSE IF AUTODATO_ÅM          = 9201        &                   00012840
                B02.BUP_GAR_KODE(I,1) = 'E'         &                   00012850
                ÅR                    >  25         THEN                00012860
                DO;                                                     00012870
                                                                        00012880
                   IF I  = 1 THEN                                       00012890
                      I_EK = 2;                                         00012900
                   ELSE                                                 00012910
                      I_EK = 1;                                         00012920
                                                                        00012930
                 IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                00012940
                    B01.VIRK_DATO_ÅM     (I_EK) > 0    THEN             00012950
                    DO;                                                 00012960
                       B02.VIRK_DATO_ÅM     (I_EK) = AUTODATO_ÅM;       00012970
                       IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN         00012980
                          CALL BARN_18ÅR(I_EK);                         00012990
                    END;                                                00013000
                 B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;           00013010
 /*0897 HL       DO UF_IND = 1 TO BUP_SISTE;                            00013020
                    B02.BUP_GARANTI(I,UF_IND)    = 2.5;                 00013030
                 END;                                   */              00013040
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00013050
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00013060
 /*HL0297*/      B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;           00013070
                 IF TRANS_OPPL_OMR.TRANSTYPE     = 27      THEN         00013080
                    DO;                                                 00013090
                       SØKER_IND = I;                                   00013100
                       EKTEF_IND = 3 - I;                               00013110
                    END;                                                00013120
                 ELSE                                                   00013130
                    FAMILIE_IND = I;                                    00013140
                 HENDELSE_IND = JA;                                     00013150
                 TRANS_OPPL_OMR.TRANSTYPE     = 7;                      00013160
                 IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                  00013170
                    CALL BARN_18ÅR(I);                                  00013180
                                                                        00013190
                END;                                                    00013200
   /*TIL HIT, TRUDE  */                                                 00013210
   /*ØKER TIL 3 , 0592 TRUDE  */                                        00013220
   /* NB!!! MÅ TAS BORT FØR PGM SKAL BRUKES VED G-END*/                 00013230
  /*TILLEGG, 20.01.92  TRUDE  KAN VI BRUKE SAMME TRANSTYPE ??  */       00013240
  /*     ELSE IF AUTODATO_ÅM          = 9205        &      */           00013250
                                                                        00013260
   ELSE IF AUTODATO_ÅM          = 9205        THEN                      00013270
      DO;                                                               00013280
        IF B02.BUP_GAR_KODE(I,1) = 'E'         &                        00013290
           ÅR                    >  25         THEN                     00013300
          DO;                                                           00013310
             IF I  = 1 THEN                                             00013320
                I_EK = 2;                                               00013330
             ELSE                                                       00013340
                I_EK = 1;                                               00013350
                            /* DISSE ÅRSKULL KOMMER NÅ INN UNDER*/      00013360
                            /* VANLIGE UNGE UFØRE. TP_GAR_KODEN  */     00013370
                            /* BLANKES */                               00013380
             IF ÅR   = 44 !                                             00013390
                ÅR   = 43  THEN                                         00013400
                  DO;                                                   00013410
                     B02.BUP_GAR_KODE(I,1)  = 'D';                      00013420
                     B02.TP_GAR_KODE(I)  = ' ';                         00013430
                     CALL UNG_UFØR;                                     00013440
                  END;                                                  00013450
                                                                        00013460
             IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                    00013470
                B01.VIRK_DATO_ÅM     (I_EK) > 0    THEN                 00013480
                DO;                                                     00013490
                   B02.VIRK_DATO_ÅM     (I_EK) = AUTODATO_ÅM;           00013500
                   IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN             00013510
                      CALL BARN_18ÅR(I_EK);                             00013520
                END;                                                    00013530
             B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;               00013540
  /*0897 HL  DO UF_IND = 1 TO BUP_SISTE;                                00013550
                B02.BUP_GARANTI(I,UF_IND)    = 3;                       00013560
             END;                                        */             00013570
             TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);        00013580
             TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);    00013590
             B02.VIRK_DATO_ÅM(I)          = AUTODATO_ÅM;                00013600
             IF TRANS_OPPL_OMR.TRANSTYPE     = 27      THEN             00013610
                DO;                                                     00013620
                   SØKER_IND = I;                                       00013630
                   EKTEF_IND = 3 - I;                                   00013640
                END;                                                    00013650
             ELSE                                                       00013660
                FAMILIE_IND = I;                                        00013670
             HENDELSE_IND = JA;                                         00013680
             TRANS_OPPL_OMR.TRANSTYPE     = 7;                          00013690
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                      00013700
                CALL BARN_18ÅR(I);                                      00013710
                                                                        00013720
          END;                                                          00013730
                                                                        00013740
       ELSE /*BUP_GAR_KODE ER IKKE 'E' : */                             00013750
          DO;                                                           00013760
             DO J = 1 TO 13 WHILE (B01.TILKN.FNR_TILKN(I,J) > 0);       00013770
                 IF B01.TILKN.TILKNYTNINGSKODE(I,J) = 'V'     THEN      00013780
                    DO;                                                 00013790
                       HENDELSE_IND= JA;                                00013800
                       TRANS_OPPL_OMR.TRANSTYPE     = 99;               00013810
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00013820
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00013830
                       CALL BARN_18ÅR(I);                               00013840
                       SØKER_IND = I;                                   00013850
                                                                        00013860
                       /*VIRK_DATO_ÅM BLE IKKE OPPDATERT PÅ EKTEFELLE*/ 00013870
                       /*TRUDE, 170293.                              */ 00013880
                       IF I     = 1 THEN                                00013890
                          I_EK  = 2;                                    00013900
                       ELSE                                             00013910
                          I_EK  = 1;                                    00013920
                       B02.VIRK_DATO_ÅM(I_EK)    = AUTODATO_ÅM;   /*TS*/00013930
                       B02.VIRK_DATO_ÅM(I)       = AUTODATO_ÅM;         00013940
                    END;                                                00013950
             END;                                                       00013960
          END;                                                          00013970
    END;                                                                00013980
        /*-----------------------------------------------------*/       00013990
        /* HER KOMMER DET ET TILLEGG . NY POSEDURE FOR Å     --*/       00014000
        /* OPPDATERE UF DØDE.  TRUDE  050892                 --*/       00014010
        /* DETTE ER EN TEST    TRUDE  050892                 --*/       00014020
    /*-------------------------------------------------*/               00014030
    ELSE;  /*TRUDE 0892*/                                               00014040
                                                                        00014050
         IF AUTODATO_ÅM          = 8907        THEN                     00014060
               DO;                                                      00014070
                  IF  I   = 1 THEN                                      00014080
                      I_EK = 2 ;                                        00014090
                  ELSE                                                  00014100
                      I_EK  = 1;                                        00014110
                 IF B01.PENSJONSTYPE1(I_EK)  = 'D' &                    00014120
                   (B01.UFØRHIST.BUP_GAR_KODE(I_EK,1)  = 'E' !          00014130
                    B01.UFØRHIST.BUP_GAR_KODE(I_EK,1)  = 'D')  THEN     00014140
                        CALL UF_DØD(I_EK);                              00014150
               END;                                                     00014160
          IF AUTODATO_ÅM          = 9101        THEN                    00014170
               DO;                                                      00014180
                  IF  I   = 1 THEN                                      00014190
                      I_EK = 2 ;                                        00014200
                  ELSE                                                  00014210
                      I_EK  = 1;                                        00014220
                 IF B01.PENSJONSTYPE1(I_EK)  = 'D' &                    00014230
                    B01.UFØRHIST.BUP_GAR_KODE(I_EK,1)  = 'E' THEN       00014240
                        CALL UF_DØD(I_EK);                              00014250
               END;                                                     00014260
                                                                        00014270
          IF AUTODATO_ÅM          = 9201        THEN                    00014280
               DO;                                                      00014290
                  IF  I   = 1 THEN                                      00014300
                      I_EK = 2 ;                                        00014310
                  ELSE                                                  00014320
                      I_EK  = 1;                                        00014330
                 IF B01.PENSJONSTYPE1(I_EK)  = 'D' &                    00014340
                    B01.UFØRHIST.BUP_GAR_KODE(I_EK,1)  = 'E' THEN       00014350
                        CALL UF_DØD(I_EK);                              00014360
               END;                                                     00014370
          IF AUTODATO_ÅM          = 9205        THEN                    00014380
               DO;                                                      00014390
                  IF  I   = 1 THEN                                      00014400
                     I_EK = 2 ;                                         00014410
                  ELSE                                                  00014420
                    I_EK  = 1;                                          00014430
                 IF B02.PENSJONSTYPE1(I_EK)  = 'D' &  /*ELLER B01*/     00014440
 /*9708 HL */       B01.UFØRHIST.BUP_GAR_KODE(I_EK,1)  = 'E' THEN       00014450
 /*                 B02.TP_GAR_KODE(I_EK)    = 'E' THEN    */           00014460
                        CALL UF_DØD(I_EK);                              00014470
               END;                                                     00014480
                                                                        00014490
     /*0397 HL:*/                                                       00014500
          IF AUTODATO_ÅM          = 9705        THEN                    00014510
               DO;                                                      00014520
                  IF  I   = 1 THEN                                      00014530
                     I_EK = 2 ;                                         00014540
                  ELSE                                                  00014550
                    I_EK  = 1;                                          00014560
                 IF B02.PENSJONSTYPE1(I_EK)  = 'D' &  /*ELLER B01*/     00014570
 /*9708 HL */       B01.UFØRHIST.BUP_GAR_KODE(I_EK,1)  = 'E' THEN       00014580
 /*                 B02.TP_GAR_KODE(I_EK)    = 'E' THEN   */            00014590
                        CALL UF_DØD(I_EK);                              00014600
               END;                                                     00014610
                                                                        00014620
                                                                        00014630
     /*0897 HL: */                                                      00014640
          IF AUTODATO_ÅM          = 9707        THEN                    00014650
               DO;                                                      00014660
                  IF  I   = 1 THEN                                      00014670
                     I_EK = 2 ;                                         00014680
                  ELSE                                                  00014690
                    I_EK  = 1;                                          00014700
                 IF B02.PENSJONSTYPE1(I_EK)  = 'D' &                    00014710
                    B02.BUP_GAR_KODE(I_EK,1)    = 'E' THEN              00014720
                        CALL UF_DØD(I_EK);                              00014730
               END;                                                     00014740
                                                                        00014750
      /*-----------AFP TILLEGG FRA 0192   TRUDE--------  */             00014760
  /*HLELSE*/ IF AUTODATO_ÅM         =  9210   &                         00014770
               B02.STATUS.VIRK_DATO_ÅM (I) < 9210 &  /*TS011092*/       00014780
               B02.PENSJONSTYPE1(I) = 'K'    THEN                       00014790
                DO;                                                     00014800
                   /*PROBLEMER MED Å SETTE VIRK-DATO */                 00014810
                  IF I = 1 THEN                                         00014820
                    I_EK = 2;                                           00014830
                  ELSE                                                  00014840
                    I_EK = 1;                                           00014850
                 B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;           00014860
                 B02.STATUS.VIRK_DATO_ÅM   (I_EK) = AUTODATO_ÅM;        00014870
                                                                        00014880
       /*  NY LOVE ENDERING SP 05.10.93          */                     00014890
                                                                        00014900
                 IF B02.PENSJONSTYPE3 (I)   =  'N' THEN                 00014910
                     B02.AFP_TILLEGG(I)     =    0;                     00014920
                 ELSE                                                   00014930
                     B02.AFP_TILLEGG(I)     =  950;                     00014940
       /*      *************************************           */       00014950
                                                                        00014960
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00014970
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00014980
                 TRANS_OPPL_OMR.TRANSTYPE     = 10;  /*40??*/           00014990
                 HENDELSE_IND = JA;                                     00015000
                 FAMILIE_IND = I;                                       00015010
        /*       I = I + 1;  */                                         00015020
                END;                                                    00015030
                      /* TIL HIT AFP-TILLEGG*/                          00015040
      /*-----------AFP TILLEGG FRA 1093   TRUDE--------  */             00015050
      /*-----------ØKER OGSÅ FOR DE MED PT2 = N -------  */             00015060
      /*-----------TRUDE, 081293                -------  */             00015070
         ELSE IF AUTODATO_ÅM         =  9310   &                        00015080
               B02.STATUS.VIRK_DATO_ÅM (I) < 9310 &  /*TS011092*/       00015090
               B02.PENSJONSTYPE1(I) = 'K'    &                          00015100
               B02.PENSJONSTYPE2(I) = 'N'    THEN                       00015110
                DO;                                                     00015120
                   /*PROBLEMER MED Å SETTE VIRK-DATO */                 00015130
                  IF I = 1 THEN                                         00015140
                    I_EK = 2;                                           00015150
                  ELSE                                                  00015160
                    I_EK = 1;                                           00015170
                 B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;           00015180
                 B02.STATUS.VIRK_DATO_ÅM   (I_EK) = AUTODATO_ÅM;        00015190
                                                                        00015200
       /*  NY LOVE ENDERING SP 05.10.93          */                     00015210
                                                                        00015220
                 IF B02.PENSJONSTYPE3 (I)   =  'N' THEN                 00015230
                     B02.AFP_TILLEGG(I)     =    0;                     00015240
                 ELSE                                                   00015250
                     B02.AFP_TILLEGG(I)     =  950;                     00015260
                                                                        00015270
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00015280
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00015290
                 TRANS_OPPL_OMR.TRANSTYPE     = 10;  /*40??*/           00015300
                 HENDELSE_IND = JA;                                     00015310
                 FAMILIE_IND = I;                                       00015320
        /*       I = I + 1;  */                                         00015330
                END;                                                    00015340
    /* TIL HIT AFP-TILLEGG FRA 10.93 TRUDE 7.12.93*/                    00015350
                                                                        00015360
   /* GARANTERT SÆTILEGG FRA 0194. TRUDE 01.1294 */                     00015370
                                                                        00015380
 /*      ELSE IF AUTODATO_ÅM         =  9401   THEN                     00015390
           DO;                                                          00015400
            IF (B02.PENSJONSTYPE3(I)  = 'A'  &                          00015410
                B02.PENSJONSTYPE2(I)  = 'P'  &                          00015420
                B02.ANTALL_BARN(I)    =  0   ) THEN                     00015430
            ELSE                                      ******** */       00015440
 /*ENDRET 9802 HL */                                                    00015450
         ELSE IF AUTODATO_ÅM         =  9401  &                         00015460
             ^ (B02.PENSJONSTYPE3(I)  = 'A'  !                          00015470
                B02.PENSJONSTYPE2(I)  = 'P')  THEN                      00015480
             /* B02.ANTALL_BARN(I)    = 0 */                            00015490
            DO;                                                         00015500
             DO J = 1 TO 13 WHILE (B01.TILKN.FNR_TILKN(I,J) > 0);       00015510
                  IF B01.TILKN.TILKNYTNINGSKODE(I,J) = 'W' THEN         00015520
                     FELLES_BARN = 'J';                                 00015530
             END;                                                       00015540
                                                                        00015550
             IF I = 1 THEN                                              00015560
                I_EK = 2;                                               00015570
             ELSE                                                       00015580
                I_EK = 1;                                               00015590
                                                                        00015600
              IF  B02.STATUS.VIRK_DATO_ÅM (I) < 9401 &  /*TS011092*/    00015610
                  (B02.PENSJONSTYPE2(I) = 'S'  !                        00015620
                   B02.PENSJONSTYPE2(I) = 'F'  !                        00015630
                   FELLES_BARN          = 'J') THEN                     00015640
                /*NB!! FELLES BARN  */                                  00015650
                DO;                                                     00015660
                   /*PROBLEMER MED Å SETTE VIRK-DATO */                 00015670
                 B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;           00015680
                 B02.STATUS.VIRK_DATO_ÅM   (I_EK) = AUTODATO_ÅM;        00015690
                                                                        00015700
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00015710
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00015720
      /*         IF   TRANS_OPPL_OMR.TRANSTYPE  ^= 10 THEN              00015730
                      TRANS_OPPL_OMR.TRANSTYPE     = 10;    */          00015740
  /*TRANSTYPEN ENDRES TIL 10 SENERE - 0994 HL */                        00015750
                                                                        00015760
                      TRANS_OPPL_OMR.TRANSTYPE     = 98;                00015770
                 HENDELSE_IND = JA;                                     00015780
                 FAMILIE_IND = I;                                       00015790
                                                                        00015800
               /* TESTEN BARN 18ÅR GLEMT. TRUDE 3.2.94 */               00015810
                IF B01.STATUS_KODE_HIST (I_EK)     = ' '  &             00015820
                   B01.VIRK_DATO_ÅM         (I_EK) > 0    THEN          00015830
                   DO;                                                  00015840
                     IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN           00015850
                       DO;                                              00015860
                        CALL BARN_18ÅR(I_EK);                           00015870
                        B02.STATUS.VIRK_DATO_ÅM   (I_EK) = AUTODATO_ÅM; 00015880
                       END;                                             00015890
                   END;                                                 00015900
                 IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                  00015910
                    CALL BARN_18ÅR(I);                                  00015920
                                                                        00015930
        /*       I = I + 1;  */                                         00015940
                END;                                                    00015950
            END;                                                        00015960
   /* GARANTERT SÆTILEGG TIL HIT . TRUDE 01.1294 */                     00015970
                                                                        00015980
                                                                        00015990
   /* ENDRING I REDUKSJONSREGLER FOR AP - HL JAN 97 : */                00016000
                                                                        00016010
  /*     ELSE IF AUTODATO_ÅM         =  9701   THEN                     00016020
           DO;                                                          00016030
              IF (B02.PENSJONSTYPE1(I) = 'A') &    ************ */      00016040
  /*9802 HL */                                                          00016050
         ELSE IF AUTODATO_ÅM         =  9701    &                       00016060
                 (B02.PENSJONSTYPE1(I) = 'A') &                         00016070
                 (B02.KONV_P_KODE  (I) ^= 'K') &                        00016080
                 (B02.AP_GP_NETTO(I) < B02.ALDERSP.GP(I))  THEN         00016090
                DO;                                                     00016100
       /*        B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;  */       00016110
                  /* TILLEGG 12.02.1997 TRUDE*/                         00016120
                  IF I  = 1  THEN                                       00016130
                     I_EK  = 2;                                         00016140
                  ELSE                                                  00016150
                     I_EK  =1;                                          00016160
                                                                        00016170
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00016180
                 IF B02.VIRK_DATO_ÅM(I) > AUTODATO_ÅM THEN              00016190
                                                                        00016200
                    TRANS_OPPL_OMR.VIRKNINGSDATO =                      00016210
                                 F_SNU_DATO((B02.VIRK_DATO_ÅM(I)));     00016220
                 ELSE                                                   00016230
                    DO;                                                 00016240
                        TRANS_OPPL_OMR.VIRKNINGSDATO =                  00016250
                                                F_SNU_DATO(AUTODATO_ÅM);00016260
                       B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;     00016270
                         /* EKTEFELLE MÅ FÅ LIK VIRK DATO.TRUDE 120297*/00016280
    /*9809 HL :*/      IF B01.STATUS_KODE_HIST(I_EK) = ' '  &           00016290
    /*9809 HL :*/         B01.VIRK_DATO_ÅM (I_EK)  > 0   THEN           00016300
                       B02.STATUS.VIRK_DATO_ÅM (I_EK) = AUTODATO_ÅM;    00016310
                    END;                                                00016320
                                                                        00016330
                 TRANS_OPPL_OMR.TRANSTYPE     = 10;                     00016340
                 HENDELSE_IND = JA;                                     00016350
                 FAMILIE_IND = I;                                       00016360
                 I = I + 1;                                             00016370
                END;                                                    00016380
  /*       END;             */                                          00016390
                                                                        00016400
   /*HL 0297 : GARANTIEN ØKES TIL 3.3 */                                00016410
                                                                        00016420
   ELSE IF AUTODATO_ÅM          = 9705        &                         00016430
           B02.BUP_GAR_KODE(I,1) = 'E'         &                        00016440
 /*0897 HL B02.BUP_GARANTI(I,1)       ^= 3.3   &              */        00016450
           ÅR                    >  30         THEN                     00016460
          DO;                                                           00016470
             IF I  = 1 THEN                                             00016480
                I_EK = 2;                                               00016490
             ELSE                                                       00016500
                I_EK = 1;                                               00016510
                                                                        00016520
             IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                    00016530
                B01.VIRK_DATO_ÅM     (I_EK) > 0    THEN                 00016540
                DO;                                                     00016550
                   B02.VIRK_DATO_ÅM     (I_EK) = AUTODATO_ÅM;           00016560
                   IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN             00016570
                      CALL BARN_18ÅR(I_EK);                             00016580
                END;                                                    00016590
            ELSE                                                        00016600
                DO;                                                     00016610
                   SØKER_IND = I;                                       00016620
                END;                                                    00016630
                                                                        00016640
             B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;               00016650
  /*0897 HL  DO UF_IND = 1 TO BUP_SISTE;                                00016660
                B02.BUP_GARANTI(I,UF_IND)    = 3.3;                     00016670
             END;                                          */           00016680
             TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);        00016690
             TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);    00016700
             B02.VIRK_DATO_ÅM(I)          = AUTODATO_ÅM;                00016710
             IF TRANS_OPPL_OMR.TRANSTYPE     = 27      THEN             00016720
                DO;                                                     00016730
                   SØKER_IND = I;                                       00016740
                   EKTEF_IND = 3 - I;                                   00016750
                END;                                                    00016760
             ELSE                                                       00016770
                FAMILIE_IND = I;                                        00016780
             HENDELSE_IND = JA;                                         00016790
             TRANS_OPPL_OMR.TRANSTYPE     = 7;                          00016800
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                      00016810
                CALL BARN_18ÅR(I);                                      00016820
                                                                        00016830
          END;                                                          00016840
                                                                        00016850
                                                                        00016860
   ELSE IF AUTODATO_ÅM          = 9707        &                         00016870
           B02.BUP_GAR_KODE(I,1) = 'E'         &                        00016880
                                                     /*0897 HL*/        00016890
           (ÅR                   =  41      !                           00016900
            ÅR                   =  42       ) THEN                     00016910
          DO;                                                           00016920
             IF I  = 1 THEN                                             00016930
                I_EK = 2;                                               00016940
             ELSE                                                       00016950
                I_EK = 1;                                               00016960
                                                                        00016970
             IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                    00016980
                B01.VIRK_DATO_ÅM     (I_EK) > 0    THEN                 00016990
                DO;                                                     00017000
                   B02.VIRK_DATO_ÅM     (I_EK) = AUTODATO_ÅM;           00017010
                   IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN             00017020
                      CALL BARN_18ÅR(I_EK);                             00017030
                END;                                                    00017040
            ELSE                                                        00017050
                DO;                                                     00017060
                   SØKER_IND = I;                                       00017070
                END;                                                    00017080
                                                                        00017090
             B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;               00017100
             B02.TP_GAR_KODE(I)               = ' ';                    00017110
             DO UF_IND = 1 TO BUP_SISTE;                                00017120
                B02.BUP_GAR_KODE(I,UF_IND)    = 'B';                    00017130
                B02.BUP_GARANTI(I,UF_IND)    = 3.3;                     00017140
             END;                                                       00017150
             TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);        00017160
             TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);    00017170
             B02.VIRK_DATO_ÅM(I)          = AUTODATO_ÅM;                00017180
             FAMILIE_IND = I;                                           00017190
             HENDELSE_IND = JA;                                         00017200
             TRANS_OPPL_OMR.TRANSTYPE     = 7;                          00017210
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                      00017220
                CALL BARN_18ÅR(I);                                      00017230
                                                                        00017240
          END;                                                          00017250
                                                                        00017260
  /*TILLEGG 4.12.89  OG 9.1.90  HL*/                                    00017270
         ELSE IF AUTODATO_ÅM          = 9001        &                   00017280
               (B02.PENSJONSTYPE1(I)  = 'E'    !                        00017290
 /**/           B02.PENSJONSTYPE1(I)  = 'J'    !                        00017300
                B02.PENSJONSTYPE2(I)  = 'E'     )   &                   00017310
 /**/           B02.FORVENTET    (I)  > 160       &                     00017320
 /**/           B02.FORVENTET    (I)  < 1443      &                     00017330
 /* 1 */           ((B02.TP_BRUTTO(I) + B02.UFØRPENS.TP(I)              00017340
                     + B02.YRKEPENS.TP(I) < 1553)     !                 00017350
 /* 2 */            (B02.ETTEPENS.ST(I) + B02.UFØRPENS.ST(I) > 0 ))     00017360
                           THEN                                         00017370
                                                                        00017380
 /*8.2.HL : I TIDEN 4.12.89 - 9.1.90 STO BARE TEST NR 1 I PROGRAMMET */ 00017390
 /*         I TIDEN 9.1.90  - 8.2.90 STO BARE TEST NR 2 I PROGRAMMET */ 00017400
                                                                        00017410
                DO;                                                     00017420
                 B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;           00017430
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00017440
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00017450
                 TRANS_OPPL_OMR.TRANSTYPE     = 11;                     00017460
                 HENDELSE_IND = JA;                                     00017470
                 FAMILIE_IND = I;                                       00017480
                 I = I + 1;                                             00017490
                END;                                                    00017500
  /*HIT 4.12.89 HL */                                                   00017510
                                                                        00017520
  /*     ELSE IF (B02.BUP_GAR_KODE(I,1) = 'A'  !   */                   00017530
  /*9802 HL */                                                          00017540
         IF (B02.BUP_GAR_KODE(I,1) = 'A'  !                             00017550
                  B02.BUP_GAR_KODE(I,1) = 'D'  )  &                     00017560
 /*24.10.89*/     (B02.PENSJONSTYPE1(I) = 'U' !                         00017570
 /* HL */          B02.PENSJONSTYPE1(I) = 'Y')      THEN                00017580
              CALL UNG_UFØR;                                            00017590
                                                                        00017600
 /*  OPPHØR  AV OVERGANGSSTØNAD     */                                  00017610
                                                                        00017620
         ELSE                                                           00017630
           IF B02.FRAMLEGGSDATO_ÅM (I) = AUTODATO_ÅM &                  00017640
              B02.FRAMLEGGSKODE    (I) = 'O' THEN                       00017650
                                                                        00017660
              DO;                                                       00017670
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00017680
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00017690
                 B02.STATUS.VIRK_DATO_ÅM   (I)    = AUTODATO_ÅM;        00017700
   /* BRUKES */    HJ_VIRK_DATO_ÅM  = B02.FRAMLEGGSDATO_ÅM (I);         00017710
   /* I 9938 */    SØKER_IND = I;                                       00017720
                 CALL ETTERLATTEPENSJON_OPPHØRER;  /* R0019938 */       00017730
                 HENDELSE_IND = JA;                                     00017740
                 I = I + 1;                                             00017750
              END;                                                      00017760
                                                                        00017770
       END;                                                             00017780
     I = I + 1;                                                         00017790
   END;      /**  DO WHILE (I < 3)   **/                                00017800
                                                                        00017810
 /*FLYTTET HIT 9709 HL:        */                                       00017820
                                                                        00017830
       IF FINNES_SØKER_TIL_DØD                  THEN                    00017840
          IF FINNES_SØKER                       THEN                    00017850
             HENDELSE_IND = JA;                                         00017860
                                                                        00017870
   IF HENDELSE_IND = NEI !                                              00017880
      TRANS_OPPL_OMR.TRANSTYPE = 27     THEN  /*TS*/                    00017890
                                                                        00017900
     DO;   /** DERSOM DER ER HENDELSER PÅ FORELDRE, SÅ BLIR BARNA **/   00017910
           /** GJENNOMGÅTT I DEN FORBINDELSE                      **/   00017920
       I = 3;                                                           00017930
           /** VI UNDERSØKER NÅ OM PERSONEN PÅ BARNEPLASS FYLLER ÅR  **/00017940
                                                                        00017950
                                                                        00017960
       DO WHILE (I < MAX_BARN);                                         00017970
                                                                        00017980
         IF B01.STATUS.VIRK_DATO_ÅM    (I) > 0 &                        00017990
            B01.STATUS.STATUS_KODE_HIST(I) = ' ' THEN                   00018000
           DO;                                                          00018010
                                                                        00018020
             /** FINNE SISTE UTFYLLTE BUP_GAR_KODE  **/                 00018030
                                                                        00018040
        /*0697 HL:*/                                                    00018050
             DO J = 7 TO 1 BY -1 UNTIL(B01.UFØRHIST.BUP_GAR_KODE        00018060
                                          (I,J) ^= ' ');                00018070
               BUP_SISTE = J;                                           00018080
             END;                                                       00018090
                                                                        00018100
 /* ENDRET 21.10.85 HL - DET HAR STÅTT '2000' NEDENFOR, FEILRAPP 259*/  00018110
                                                                        00018120
             IF ALDER_PERSON_ÅM(I) = 2001 THEN  /** 20 ÅR FORRIGE MD*/  00018130
               DO;                                                      00018140
                 IF B01.STATUS.PENSJONSTYPE1(I) = 'B'   &               00018150
                    B01.STATUS.DØD_AV_YRKESSKADE (I) ^= 'E'  THEN       00018160
                                                                        00018170
                   DO;                                                  00018180
                     CALL FJERN_BARNEPENSJON(I,FAMILIE_IND);            00018190
                     HENDELSE_IND = JA;                                 00018200
                                                                        00018210
                     IF B01.UFØRHIST.BUP_GAR_KODE(I,                    00018220
                        BUP_SISTE)= 'A' THEN                            00018230
                                                                        00018240
                        B02.UFØRHIST.BUP_GAR_KODE(I,                    00018250
                        BUP_SISTE)= 'B';                                00018260
                                                                        00018270
 /* ENDRET 16.2.88 HL- BUP_GARANTI ØKER TIL 3.00 FRA 1.5.88 */          00018280
 /* ENDRET 13.5.91 TS- BUP_GARANTI ØKER TIL 3.30 FRA 1.5.91 */          00018290
                                                                        00018300
                                                                        00018310
                     IF B01.UFØRHIST.BUP_GARANTI(I,                     00018320
                        BUP_SISTE) > 0                      THEN        00018330
                                                                        00018340
                        IF AUTODATO_ÅM > 8804               THEN        00018350
  /*TRUDE*/                IF AUTODATO_ÅM < 9105     THEN               00018360
                                                                        00018370
                             B02.UFØRHIST.BUP_GARANTI(I,                00018380
                             BUP_SISTE)= 3.00;                          00018390
                           ELSE                                         00018400
  /*TRUDE*/                                                             00018410
                             B02.UFØRHIST.BUP_GARANTI(I,                00018420
                               BUP_SISTE)= 3.30;                        00018430
                        ELSE                                            00018440
                                                                        00018450
                           IF AUTODATO_ÅM > 8704            THEN        00018460
                                                                        00018470
                              B02.UFØRHIST.BUP_GARANTI(I,               00018480
                              BUP_SISTE)= 2.50;                         00018490
                                                                        00018500
                   END;                                                 00018510
                                                                        00018520
               END;                                                     00018530
                                                                        00018540
             ELSE IF ALDER_PERSON_ÅM(I) = 1801 THEN/**18 ÅR FORR. MND**/00018550
               DO;                                                      00018560
                 IF B01.STATUS.PENSJONSTYPE1(I) = 'N'   &               00018570
                    B01.STATUS.DØD_AV_YRKESSKADE (I) ^= 'E'  THEN       00018580
                                                                        00018590
                   DO;                                                  00018600
                     CALL FJERN_BARNEPENSJON(I,FAMILIE_IND);            00018610
                     HENDELSE_IND = JA;                                 00018620
                   END;                                                 00018630
                                                                        00018640
                 ELSE IF B01.STATUS.PENSJONSTYPE1(I) = 'L' THEN         00018650
                   DO;                                                  00018660
                     CALL FJERN_BARNETILLEGG(I,SØKER_IND,               00018670
                                                   FAMILIE_IND);        00018680
                     HENDELSE_IND = JA;                                 00018690
                     I = MAX_BARN;  /** VI FINNER ALLE BARNA I   **/    00018700
                                        /** BARN_18_ÅR               **/00018710
                   END;                                                 00018720
                                                                        00018730
               END;   /** ELSE IF ALDER_PERSON_ÅM(I) = 1801  **/        00018740
                                                                        00018750
                                                                        00018760
             ELSE IF ALDER_PERSON_ÅM(I) = 2101  &  /**21 ÅR FORR. MND**/00018770
                    (B01.PENSJONSTYPE1(I) = 'N' !                       00018780
                     B01.PENSJONSTYPE1(I) = 'B') THEN                   00018790
                                                                        00018800
         /*VI FORUTSETTER DA AT DETTE ER EN YRKESSKADESAK */            00018810
                                                                        00018820
                DO;                                                     00018830
                   CALL FJERN_BARNEPENSJON(I,FAMILIE_IND);              00018840
                   HENDELSE_IND = JA;                                   00018850
                END;                                                    00018860
                                                                        00018870
           END;        /** IF VIRK_DATO_ÅM > 0 &    **/                 00018880
                                                                        00018890
         I = I + 1;                                                     00018900
                                                                        00018910
       END;  /** DO WHILE (I < MAX_BARN)  **/                           00018920
                                                                        00018930
       IF TRANS_OPPL_OMR.TRANSTYPE = 0 &  /*DET ER IKKE LAGET TRANS*/   00018940
          SATSENDRING_DENNE_MÅNED    THEN                               00018950
           DO;                                                          00018960
             CALL SATSENDRING;                                          00018970
                                                                        00018980
             IF TRANS_OPPL_OMR.TRANSTYPE ^= 0 THEN                      00018990
                HENDELSE_IND = JA;                                      00019000
           END;                                                         00019010
                                                                        00019020
     END;    /** DO FOR IF HENDELSE_IND = NEI  **/                      00019030
                                                                        00019040
                                                                        00019050
 FINNES_SØKER: PROC RETURNS (BIT(1));                                   00019060
                                                                        00019070
       DCL RETUR BIT (1) INIT('0'B);                                    00019080
                                                                        00019090
 /*ENDRET 6.3.90 HL : AVDØD_IND ISTEDET FOR 'I' */                      00019100
                                                                        00019110
     TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM); /*9708HL*/ 00019120
       IF AVDØD_IND = 1                         &                       00019130
          B01.STATUS.VIRK_DATO_ÅM     (2) >  0  &                       00019140
          B01.STATUS.STATUS_KODE_HIST (2) = ' ' THEN                    00019150
          DO;                                                           00019160
             SØKER_IND = 2;                                             00019170
             RETUR     = '1'B;                                          00019180
             B02.STATUS.VIRK_DATO_ÅM     (2) = AUTODATO_ÅM;             00019190
             CALL SETT_VIRKDATO_BARN;                                   00019200
          END;                                                          00019210
       ELSE IF                                                          00019220
          B01.STATUS.VIRK_DATO_ÅM     (1) >  0  &                       00019230
          B01.STATUS.STATUS_KODE_HIST (1) = ' ' THEN                    00019240
          DO;                                                           00019250
             SØKER_IND = 1;                                             00019260
             RETUR     = '1'B;                                          00019270
             B02.STATUS.VIRK_DATO_ÅM     (1) = AUTODATO_ÅM;             00019280
             CALL SETT_VIRKDATO_BARN;                                   00019290
          END;                                                          00019300
                                                                        00019310
       IF                                                               00019320
          B01.STATUS.VIRK_DATO_ÅM     (3) >  0  &                       00019330
          B01.STATUS.STATUS_KODE_HIST (3) = ' ' &                       00019340
          B01.STATUS.PENSJONSTYPE1    (3) = 'B' THEN                    00019350
          DO;                                                           00019360
             SØKER_IND = 3;                                             00019370
             RETUR     = '1'B;                                          00019380
             CALL SETT_VIRKDATO_BARN;                                   00019390
          END;                                                          00019400
                                                                        00019410
       RETURN (RETUR);                                                  00019420
                                                                        00019430
       SETT_VIRKDATO_BARN: PROC;                                        00019440
                                                                        00019450
          DO J = 3 TO 14 ;                                              00019460
            IF                                                          00019470
              B01.STATUS.VIRK_DATO_ÅM     (J) >  0  &                   00019480
              B01.STATUS.STATUS_KODE_HIST (J) = ' ' THEN                00019490
                                                                        00019500
                 B02.STATUS.VIRK_DATO_ÅM     (J) = AUTODATO_ÅM;         00019510
          END;                                                          00019520
                                                                        00019530
       END SETT_VIRKDATO_BARN;                                          00019540
                                                                        00019550
     END FINNES_SØKER;                                                  00019560
                                                                        00019570
                                                                        00019580
 END AUTO_ONLINE;                                                       00019590
                                                                        00019600
                                                                        00019610
 REGN_ALDER_FOR_FAMILIE:                                                00019620
   PROC;                                                                00019630
                                                                        00019640
   DO J = 1 TO 14;                                                      00019650
     IF B01.STATUS.VIRK_DATO_ÅM(J) > 0 &                                00019660
        B01.RF0PERSN.FNR       (J) > 0 THEN                             00019670
       DO;                                                              00019680
         PIC11 = B01.RF0PERSN.FNR(J);                                   00019690
         FIXED_DEC5         = F_ALDER(PIC11,F_SNU_DATO(AUTODATO_ÅM));   00019700
         ALDER_PERSON_ÅM(J) = FIXED_DEC5;                               00019710
         MAX_BARN = J + 1;                                              00019720
       END;                                                             00019730
    END;      /**   DO J = 1 TO 14   **/                                00019740
                                                                        00019750
    IF MAX_BARN < 3 THEN                                                00019760
      MAX_BARN = 3;                /**   D.V.S INGEN BARN   **/         00019770
                                                                        00019780
 END REGN_ALDER_FOR_FAMILIE;                                            00019790
                                                                        00019800
                                                                        00019810
 ADDER_EN_MND_TIL_ALDER_FAMILIE:                                        00019820
   PROC;                                                                00019830
                                                                        00019840
   DO J = 1 TO 14;                                                      00019850
     IF B01.STATUS.VIRK_DATO_ÅM(J) > 0 &                                00019860
        B01.RF0PERSN.FNR       (J) > 0 THEN                             00019870
       DO;                                                              00019880
         ALDER_PERSON_ÅM(J) = ALDER_PERSON_ÅM(J) + 1;                   00019890
         IF ALDER_PERSON_ÅM(J) < 0 & ALDER_PERSON.MN(J) = 99 THEN       00019900
           ALDER_PERSON.MN(J) = 11;                                     00019910
         ELSE IF ALDER_PERSON.MN(J) = 12 THEN                           00019920
           DO;                                                          00019930
             ALDER_PERSON.MN(J) = 0;                                    00019940
             ALDER_PERSON.ÅR(J) = ALDER_PERSON.ÅR(J) + 1;               00019950
           END;                                                         00019960
       END;                                                             00019970
    END;      /**   DO J = 1 TO 14   **/                                00019980
                                                                        00019990
                                                                        00020000
 END ADDER_EN_MND_TIL_ALDER_FAMILIE;                                    00020010
                                                                        00020020
                                                                        00020030
 P67_TIL_P70:                                                           00020040
   PROC(I_EK);                                                          00020050
                                                                        00020060
   DCL                                                                  00020070
     I_EK       FIXED BIN(15),                                          00020080
     SISTE_UFT  FIXED BIN(15),                                          00020090
            SISTE_YUFT FIXED BIN(15);                                   00020100
                                                                        00020110
     IF I  = 1 THEN                                                     00020120
       I_EK = 2;                                                        00020130
     ELSE                                                               00020140
       I_EK = 1;                                                        00020150
                                                                        00020160
     B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;                       00020170
     B02.FAI                   (I) = 0;                                 00020180
     B02.FAI_DATO_ÅM           (I) = 0;                                 00020190
     B02.P67_KODE              (I) = ' ';                               00020200
                                                                        00020210
 /*OGSÅ 'K' 180196 HL : */                                              00020220
                                                                        00020230
     IF B01.ALDERSP.KONV_P_KODE(I) = 'F'   THEN                         00020240
 /*     B01.ALDERSP.KONV_P_KODE(I) = 'K' THEN  */ /*FJERNET 1302*/      00020250
        B02.ALDERSP.KONV_P_KODE(I) = ' ';                               00020260
                                                                        00020270
        IF B01.STATUS.STATUS_KODE_HIST(I_EK) = ' ' THEN                 00020280
           CALL ER_EKTEFELLE_67_70 (I_EK);                              00020290
                                                                        00020300
                                                                        00020310
     /**  EGNE FORSØRGEDE BARN  **/                                     00020320
                                                                        00020330
     IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                              00020340
        CALL BARN_18ÅR(I);                                              00020350
                                                                        00020360
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                00020370
     TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);            00020380
     TRANS_OPPL_OMR.TRANSTYPE     = 26;                                 00020390
                                                                        00020400
 END P67_TIL_P70;                                                       00020410
                                                                        00020420
                                                                        00020430
 OVERGANG_TIL_P67:                                                      00020440
   PROC(I_EK);                                                          00020450
                                                                        00020460
   DCL                                                                  00020470
     I_EK        FIXED BIN(15),                                         00020480
     SISTE_UFT   FIXED BIN(15),                                         00020490
     SISTE_YUFT  FIXED BIN(15);                                         00020500
                                                                        00020510
     IF I  = 1 THEN                                                     00020520
       I_EK = 2;                                                        00020530
     ELSE                                                               00020540
       I_EK = 1;                                                        00020550
                                                                        00020560
     TRANS_OPPL_OMR.FØDSNUMMER     = B02.RF0PERSN.FNR(I);               00020570
     TRANS_OPPL_OMR.VIRKNINGSDATO  = F_SNU_DATO(AUTODATO_ÅM);           00020580
     B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;                       00020590
     IF B02.UFØRPENS.VILKÅR_8_4_3A(I) = 'J'           THEN              00020600
        B02.STATUS.VILKÅR_8_4_3A(I)   = 'J';                            00020610
                                                                        00020620
     B02.AFP_TILLEGG(I) = 0;    /* TRUDE 1092*/                         00020630
                                                                        00020640
 /*NY LOV 1.1.91 : HL : */                                              00020650
                                                                        00020660
     IF B02.TT_16_66(I) > 0             THEN                            00020670
        B02.TT_16_66(I) = B02.TT_16_66(I) + B02.TT_FRAMT(I);            00020680
     ELSE                                                               00020690
        B02.TT_ETTER_1966(I) = B02.TT_ETTER_1966(I) + B02.TT_FRAMT(I);  00020700
     IF B02.TT_16_66(I) > 480           THEN                            00020710
        B02.TT_16_66(I) = 480;     /*HL 080694*/                        00020720
                                                                        00020730
     B02.TT_FRAMT     (I) = 0;                                          00020740
                                                                        00020750
     IF SATSENDRING_DENNE_MÅNED = JA          &                         00020760
        B01.GT_TILLEGG_LOV92(I) = 0          THEN                       00020770
        FIXED_DEC5 = B01.FORVENTET (I) * G_NÅ/G_FØR;                    00020780
     ELSE                                                               00020790
        FIXED_DEC5 = B01.FORVENTET (I);                                 00020800
                                                                        00020810
     IF B01.STATUS.PENSJONSTYPE1(I) = 'E' THEN                          00020820
       DO;                                                              00020830
         B02.STATUS.PENSJONSTYPE1(I)  = 'A';                            00020840
         B02.ALDERSP.KONV_P_KODE (I)  = 'E';                            00020850
         B02.ETTEPENS.GP_BRUTTO  (I) = 0;                               00020860
         B02.ETTEPENS.GP_NETTO   (I) = 0;                               00020870
         B02.ETTEPENS.ST         (I) = 0;                               00020880
         B02.ETTEPENS.KT         (I) = 0;                               00020890
         B02.ETTEPENS.TP_BRUTTO  (I) = 0;                               00020900
         B02.ETTEPENS.TP_NETTO   (I) = 0;                               00020910
         B02.ETTEPENS.FORVENTET  (I) = 0;                               00020920
         B02.TILKN.TILKNYTNINGSKODE(I_EK,1) = 'A';                      00020930
                                                                        00020940
         IF B01.STATUS.PENSJONSTYPE2(I) = 'O' THEN                      00020950
           DO;                              /**  OVERGANGSTØNAD     **/ 00020960
             TRANS_OPPL_OMR.TRANSTYPE = 69; /**  IKKE KONVERTERING  **/ 00020970
             B02.STATUS.PENSJONSTYPE2(I)  = 'P';                        00020980
             B02.STATUS.SUM_YTELSE   (I)  = 0;                          00020990
           END;                                                         00021000
         ELSE                                                           00021010
           DO;                                                          00021020
             TRANS_OPPL_OMR.TRANSTYPE = 25; /* FRA EP TIL P67 */        00021030
             B02.STATUS.PENSJONSTYPE2(I)  = 'E';                        00021040
                                                                        00021050
             IF AUTODATO_ÅM > 8403                         THEN         00021060
                /* LOVENDRING: FORVENTET I EP KAN NYTTES SOM FAI */     00021070
                DO;                                                     00021080
                   B02.FAI  (I)                 = FIXED_DEC5;           00021090
                   B02.FAI_DATO_ÅM (I)          = AUTODATO_ÅM;          00021100
                END;                                                    00021110
                                                                        00021120
           END;                                                         00021130
                                                                        00021140
                                                                        00021150
       END;   /**  IF B01.STATUS.PENSJONSTYPE1(I) = 'E' **/             00021160
                                                                        00021170
     ELSE IF B01.STATUS.PENSJONSTYPE1(I) = 'J' THEN                     00021180
       DO;                                                              00021190
                                                                        00021200
  /*FJERNET 13.3.96 HL : */                                             00021210
  /*     IF B01.STATUS.PENSJONSTYPE2(I) = 'P' THEN    */                00021220
                                                                        00021230
             IF AUTODATO_ÅM > 8403                         THEN         00021240
                                                                        00021250
                DO;                                                     00021260
                   B02.FAI  (I)                 = FIXED_DEC5;           00021270
                   B02.FAI_DATO_ÅM (I)          = AUTODATO_ÅM;          00021280
                END;                                                    00021290
                                                                        00021300
         TRANS_OPPL_OMR.TRANSTYPE = 33;  /* FRA 'J' TIL P67 */          00021310
         B02.STATUS.PENSJONSTYPE1(I)  = 'A';                            00021320
         B02.STATUS.PENSJONSTYPE2(I)  = 'P';                            00021330
         B02.ALDERSP.KONV_P_KODE (I)  = 'J';                            00021340
         B02.ETTEPENS.GP_BRUTTO  (I) = 0;                               00021350
         B02.ETTEPENS.GP_NETTO   (I) = 0;                               00021360
         B02.ETTEPENS.ST         (I) = 0;                               00021370
         B02.ETTEPENS.KT         (I) = 0;                               00021380
         B02.ETTEPENS.TP_BRUTTO  (I) = 0;                               00021390
         B02.ETTEPENS.TP_NETTO   (I) = 0;                               00021400
         B02.ETTEPENS.FORVENTET  (I) = 0;                               00021410
                                                                        00021420
       END;                                                             00021430
                                                                        00021440
     ELSE          /**  TIDLIGERE UP     ELLER AFP        **/           00021450
     IF B01.PENSJONSTYPE2(I) = 'N' THEN                                 00021460
        DO;                                                             00021470
           CALL AFP_NULL_OPPHØRER (I,I_EK);                             00021480
           TRANS_OPPL_OMR.TRANSTYPE = 73;                               00021490
           IF B01.PENSJONSTYPE1 (I_EK) = 'A'       !                    00021500
              B01.PENSJONSTYPE1 (I_EK) = 'K'       !                    00021510
              B01.PENSJONSTYPE1 (I_EK) = 'U'      THEN                  00021520
                 CALL ER_EKTEFELLE_67_70 (I_EK);                        00021530
        END;                                                            00021540
     ELSE                                                               00021550
     IF B01.PENSJONSTYPE2(I) = 'A' THEN           /*DAGPENGER*/         00021560
        DO;                                                             00021570
           B02.STATUS_KODE_HIST(I) = 'O';                               00021580
           B02.UFØRPENS(I)         = '';                                00021590
           B02.PENSJONSTYPE2(I)    = 'A';                               00021600
           TRANS_OPPL_OMR.TRANSTYPE = 75;                               00021610
        END;                                                            00021620
     ELSE                                                               00021630
       DO;                                                              00021640
         IF B01.PENSJONSTYPE1(I) = 'U'    !                             00021650
            B01.PENSJONSTYPE1(I) = 'Y'           THEN                   00021660
           DO;                                                          00021670
                                                                        00021680
             IF AUTODATO_ÅM > 9201           &                          00021690
                B02.PENSJONSTYPE2(I) ^= 'E'  &                          00021700
                B02.UFØRPENS.UFG (I)  < 100     THEN                    00021710
                                                                        00021720
                DO;                                                     00021730
                   B02.P67_KODE(I)    = '5';                            00021740
                   B02.SUM_YTELSE(I)  = 0;                              00021750
                   TRANS_OPPL_OMR.TRANSTYPE = 74;  /* NULLPENSJON */    00021760
                END;                                                    00021770
             ELSE                                                       00021780
          DO;                                                           00021790
             TRANS_OPPL_OMR.TRANSTYPE = 24;  /* FRA UP TIL P67 */       00021800
                                                                        00021810
             IF B01.UFØRPENS.SPT_1291(I) > 0       &                    00021820
                AUTODATO_ÅM > 9300                THEN                  00021830
                DO;                                                     00021840
                   B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I);  00021850
                   B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I);  00021860
                   B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I);  00021870
                END;                                                    00021880
                                                                        00021890
      /**/   ELSE                                                       00021900
             IF AUTODATO_ÅM > 9200                THEN                  00021910
                DO;                                                     00021920
                                                                        00021930
    B02.ALDERSP.PÅ_ETTER91(I) = B01.UFØRPENS.PÅ_ETTER91(I);             00021940
      /*          B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT(I);        00021950
                  B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT(I);        00021960
                  B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ (I); */     00021970
                END;                                                    00021980
                                                                        00021990
    /**/                                                                00022000
                                                                        00022010
         END;                                                           00022020
         B02.STATUS.VILKÅR_8_4_3A(I) = B02.UFØRPENS.VILKÅR_8_4_3A(I);   00022030
         B02.UFØRPENS            (I) = '';                              00022040
         SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                             00022050
 /*      B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = AUTODATO_ÅM;  */             00022060
         B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = OPPH_ÅM;   /*9807*/          00022070
         B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                         00022080
                                                                        00022090
         IF B01.STATUS.PENSJONSTYPE2 (I) = 'E' THEN                     00022100
            DO;                                                         00022110
                                                                        00022120
               IF AUTODATO_ÅM > 8403                    THEN            00022130
                                                                        00022140
                 DO;                                                    00022150
                    B02.FAI  (I)                 = FIXED_DEC5;          00022160
                    B02.FAI_DATO_ÅM (I)          = AUTODATO_ÅM;         00022170
                 END;                                                   00022180
                                                                        00022190
 /*LINJEN NEDENFOR ER LAGT INN 21.2.89 - HL        */                   00022200
                                                                        00022210
                   B02.TILKN.TILKNYTNINGSKODE(I_EK,1) = 'A';            00022220
                                                                        00022230
               B02.ETTEPENS.FORVENTET  (I) = 0;                         00022240
               TRANS_OPPL_OMR.TRANSTYPE = 41; /* FRA UE TIL AE */       00022250
            END;                                                        00022260
        IF B01.STATUS.PENSJONSTYPE1(I) = 'Y'   THEN                     00022270
                                                                        00022280
           DO;                                                          00022290
                                                                        00022300
 /*YS  VI SKAL BEHOLDE YRKEPENS.YUG OG YPT              */              00022310
              B02.YRKEPENS.GP         (I) = 0;                          00022320
              B02.YRKEPENS.BT         (I) = 0;                          00022330
              B02.YRKEPENS.TP         (I) = 0;                          00022340
  /*HL        B02.YRKEPENS.SPT        (I) = 0         */                00022350
              B02.YRKEPENS.YPT_KODE   (I) = '';                         00022360
              SISTE_YUFT = FINNE_SISTE_YUFT_ÅM(I);                      00022370
  /*          B02.OPPH_DATO_ÅM(I,SISTE_YUFT) = AUTODATO_ÅM;  */         00022380
              B02.OPPH_DATO_ÅM(I,SISTE_YUFT) = OPPH_ÅM;  /*9807*/       00022390
              B02.OPPH_KODE   (I,SISTE_YUFT) = 'A';                     00022400
                                                                        00022410
           END;                                                         00022420
                                                                        00022430
       END;  /*PT1 = U/Y */                                             00022440
     ELSE    /*PT1 = K */                                               00022450
       DO;                                                              00022460
          B02.ALDERSP.VT_SPT(I) = B02.ALDERSP.SPT(I);                   00022470
          B02.ALDERSP.VT_OPT(I) = B02.ALDERSP.OPT(I);                   00022480
          B02.ALDERSP.VT_PÅ (I) = B02.ALDERSP.PÅ (I);                   00022490
          TRANS_OPPL_OMR.TRANSTYPE  = 49;/*FRA AFP TIL P67*/            00022500
       END;                                                             00022510
                                                                        00022520
 /*DET FØLGENDE GJELDER BÅDE TIDLIGERE PT1 = U/Y OG PT1 = K :  */       00022530
                                                                        00022540
         B02.STATUS.PENSJONSTYPE1(I)  = 'A';                            00022550
 /**/    B02.KONV_P_KODE(I) = B01.PENSJONSTYPE1(I);                     00022560
                                                                        00022570
 /* TILLEGG 20.8.84 HL                                      */          00022580
                                                                        00022590
         B02.STATUS.PENSJONSTYPE3(I)  = '';                             00022600
                                                                        00022610
 /* HIT    20.8.84  HL                                      */          00022620
                                                                        00022630
         IF B01.VIRK_DATO_ÅM (I_EK) > 0           THEN                  00022640
            DO;                                                         00022650
               DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);         00022660
                 IF B01.TILKN.FNR_TILKN(I_EK,J) =                       00022670
                    B01.RF0PERSN.FNR   (I         ) THEN                00022680
                      DO;                                               00022690
                        B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';       00022700
                        B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';       00022710
                        J = 13;                                         00022720
                      END;                                              00022730
               END;                                                     00022740
                                                                        00022750
 /*LINJENE NEDENFOR ER FJERNET 21.2.89 - HL- FORDI PROGRAMMENE FOR*/    00022760
 /*BEREGNING FORUTSETTER AT OPPRINNELIG VIRKDATO BEHOLDES         */    00022770
                                                                        00022780
 /*            IF B01.STATUS.PENSJONSTYPE2 (I) = 'E' THEN         */    00022790
 /*               B02.VIRK_DATO_ÅM (I_EK) = AUTODATO_ÅM           */    00022800
 /*            ELSE                                               */    00022810
                                                                        00022820
 /*8.2.89*/    IF B01.STATUS_KODE_HIST (I_EK) = ' '   THEN              00022830
 /*AFP*/          CALL ER_EKTEFELLE_67_70(I_EK);                        00022840
            END;                                                        00022850
                                                                        00022860
         IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                          00022870
           CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                       00022880
                                                                        00022890
 /**/ END;  /**   DO FOR ELSE VED TIDLIGERE UP/ATV/AFP     **/          00022900
                                                                        00022910
 END OVERGANG_TIL_P67;                                                  00022920
                                                                        00022930
  /*AFP1093 FRA HIT------------------------------------------------*/   00022940
  /*AFP STATSP OVERGANG TIL AFP-NULLPENSJONIST    */                    00022950
                                                                        00022960
 AFP_STAT_TIL_NULL:                                                     00022970
   PROC(I_EK);                                                          00022980
                                                                        00022990
   DCL                                                                  00023000
     I_EK        FIXED BIN(15);                                         00023010
                                                                        00023020
     IF I  = 1 THEN                                                     00023030
       I_EK = 2;                                                        00023040
     ELSE                                                               00023050
       I_EK = 1;                                                        00023060
                                                                        00023070
     TRANS_OPPL_OMR.FØDSNUMMER     = B02.RF0PERSN.FNR(I);               00023080
     TRANS_OPPL_OMR.VIRKNINGSDATO  = F_SNU_DATO(AUTODATO_ÅM);           00023090
     B02.STATUS.VIRK_DATO_ÅM   (I)    = AUTODATO_ÅM;                    00023100
                                                                        00023110
         TRANS_OPPL_OMR.TRANSTYPE = 40;  /*AFP */                       00023120
         B02.STATUS.PENSJONSTYPE1(I)  = 'K';                            00023130
         B02.STATUS.PENSJONSTYPE2(I)  = 'N';                            00023140
         B02.STATUS.PENSJONSTYPE3(I)  = 'S';                            00023150
     B02.EK_INNT_OVER_2G(I_EK) = 'J';        /*9711 HL*/                00023160
                                                                        00023170
         /* HVA MED SATSENDEING PÅ FAI + EVNT ANDRE INNT ??*/           00023180
                                                                        00023190
   /*TO NEDENF. STM GJORDE AT SAMMENSTØTSBEREGNING BLE FEIL. TS 060995*/00023200
                                                                        00023210
   /*IF B01.STATUS.VIRK_DATO_ÅM   (I_EK) > 0   THEN         TS 030895*/ 00023220
   /*   B02.STATUS.VIRK_DATO_ÅM   (I_EK) = AUTODATO_ÅM;     TS 030895*/ 00023230
                                                                        00023240
       IF B01.PENSJONSTYPE1 (I_EK) = 'A'       !                        00023250
          B01.PENSJONSTYPE1 (I_EK) = 'K'       !                        00023260
          B01.PENSJONSTYPE1 (I_EK) = 'U'      THEN                      00023270
                 CALL ER_EKTEFELLE_67_70 (I_EK);                        00023280
                                                                        00023290
 END AFP_STAT_TIL_NULL;                                                 00023300
                                                                        00023310
 AFP_KOM_6501:                                                          00023320
   PROC(I_EK);                                                          00023330
                                                                        00023340
   DCL                                                                  00023350
     I_EK        FIXED BIN(15);                                         00023360
                                                                        00023370
     IF I  = 1 THEN                                                     00023380
       I_EK = 2;                                                        00023390
     ELSE                                                               00023400
       I_EK = 1;                                                        00023410
                                                                        00023420
     TRANS_OPPL_OMR.FØDSNUMMER     = B02.RF0PERSN.FNR(I);               00023430
     TRANS_OPPL_OMR.VIRKNINGSDATO  = F_SNU_DATO(AUTODATO_ÅM);           00023440
     B02.STATUS.VIRK_DATO_ÅM   (I)    = AUTODATO_ÅM;                    00023450
                                                                        00023460
 /*  TRANS_OPPL_OMR.TRANSTYPE = 76;     9802 HL */                      00023470
     TRANS_OPPL_OMR.TRANSTYPE = 40;                                     00023480
     B02.EK_INNT_OVER_2G(I_EK) = 'J';                                   00023490
                                                                        00023500
        CALL ER_EKTEFELLE_67_70 (I_EK);                                 00023510
                                                                        00023520
 END AFP_KOM_6501;                                                      00023530
                                                                        00023540
 ER_EKTEFELLE_67_70 :                                                   00023550
   PROC(I_EK);                                                          00023560
                                                                        00023570
   DCL                                                                  00023580
     I_EK        FIXED BIN(15),                                         00023590
     SISTE_UFT   FIXED BIN(15),                                         00023600
     SISTE_YUFT FIXED BIN(15);                                          00023610
                                                                        00023620
       B02.STATUS.VIRK_DATO_ÅM   (I_EK) = AUTODATO_ÅM;                  00023630
                                                                        00023640
       PIC11 = B01.RF0PERSN.FNR(I_EK);                                  00023650
       IF  (ALDER_PERSON_ÅM(I_EK)  = 6700 &                             00023660
              AUTODATO_ÅM         < 9100  &                             00023670
            ÅR > 5 & ÅRHUNDRE < 5         )    !                        00023680
           (ALDER_PERSON_ÅM(I_EK)  = 6701 &                             00023690
            AUTODATO_ÅM            > 9101 &                             00023700
            ÅR > 5 & ÅRHUNDRE < 5         )    !                        00023710
           (ALDER_PERSON_ÅM(I_EK) >= 6700 &                             00023720
            ALDER_PERSON_ÅM(I_EK) <  7000 &                             00023730
            AUTODATO_ÅM         = 7301)         !                       00023740
           (ALDER_PERSON_ÅM(I_EK)  = 7000 &                             00023750
            AUTODATO_ÅM         < 9100    &                             00023760
            B01.STATUS.PENSJONSTYPE1(I_EK) ^= 'A')     !                00023770
           (ALDER_PERSON_ÅM(I_EK)  = 7001 &                             00023780
            AUTODATO_ÅM         > 9101    &                             00023790
 /*HL*/     B01.STATUS.PENSJONSTYPE1(I_EK) ^= 'F' &                     00023800
            B01.STATUS.PENSJONSTYPE1(I_EK) ^= 'A')             THEN     00023810
           IF B01.PENSJONSTYPE2(I_EK) = 'N'       THEN                  00023820
              CALL AFP_NULL_OPPHØRER (I_EK,I);                          00023830
           ELSE                                                         00023840
           DO;                                                          00023850
                                                                        00023860
               IF B02.UFØRPENS.VILKÅR_8_4_3A(I_EK) = 'J'        THEN    00023870
                  B02.STATUS.VILKÅR_8_4_3A(I_EK)   = 'J';               00023880
                                                                        00023890
               B02.ALDERSP.APD          (I_EK) = 100;                   00023900
                                                                        00023910
               IF B02.TT_16_66(I_EK) > 0        THEN                    00023920
                  B02.TT_16_66(I_EK) = B02.TT_16_66(I_EK)               00023930
                             + B02.STATUS.TT_FRAMT     (I_EK);          00023940
               ELSE                                                     00023950
                  B02.TT_ETTER_1966(I_EK)                               00023960
                             = B02.TT_ETTER_1966(I_EK)                  00023970
                             + B02.TT_FRAMT     (I_EK);                 00023980
               B02.TT_FRAMT     (I_EK) = 0;                             00023990
                                                                        00024000
                                                                        00024010
               DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I, J) > 0);           00024020
                  IF B01.TILKN.FNR_TILKN(I,J) =                         00024030
                     B01.RF0PERSN.FNR   (I_EK       ) THEN              00024040
                        DO;                                             00024050
                          B02.TILKN.TILKNYTNINGSKODE(I,J)='A';          00024060
                          B02.TILKN.FT_FØR_91       (I,J)=' ';          00024070
                          J = 13;                                       00024080
                        END;                                            00024090
               END;                                                     00024100
                                                                        00024110
               IF B01.STATUS.PENSJONSTYPE1(I_EK) = 'F' THEN             00024120
                  DO;                       /* FORSØRGET EKTEFELLE */   00024130
                    B02.STATUS.PENSJONSTYPE1(I_EK)  = 'A';              00024140
                    B02.STATUS.PENSJONSTYPE2(I_EK)  = 'S';              00024150
                    B02.RF0PERSN.TKNR       (I_EK)  =                   00024160
                                             B01.RF0PERSN.TKNR (I);     00024170
                    B02.STATUS.PENSJONSTYPE2(I) = 'S';                  00024180
                    B02.ALDERSP.KONV_P_KODE (I_EK)  = 'F';              00024190
                    B02.P67_KODE            (I_EK)  = '5';              00024200
                  END;                                                  00024210
                                                                        00024220
                ELSE IF B01.STATUS.PENSJONSTYPE1(I_EK) = 'K' THEN       00024230
                   DO;                                                  00024240
                     B02.ALDERSP.KONV_P_KODE (I_EK)  = 'K';             00024250
                     B02.STATUS.PENSJONSTYPE1(I_EK)  = 'A';             00024260
                     B02.ALDERSP.VT_SPT(I_EK) = B02.ALDERSP.SPT(I_EK);  00024270
                     B02.ALDERSP.VT_OPT(I_EK) = B02.ALDERSP.OPT(I_EK);  00024280
                     B02.ALDERSP.VT_PÅ (I_EK) = B02.ALDERSP.PÅ (I_EK);  00024290
                                                                        00024300
                 TRANS_OPPL_OMR.BLANKETTYPE  = '49';/*FRA AFP TIL P67*/ 00024310
                                                                        00024320
                                                                        00024330
                   END;                                                 00024340
                                                                        00024350
                 ELSE IF B01.STATUS.PENSJONSTYPE1(I_EK) = 'U' THEN      00024360
                   DO;                                                  00024370
 /*      B02.ALDERSP.SPT_1291(I_EK) = B01.UFØRPENS.SPT_1291(I_EK); */   00024380
 /*      B02.ALDERSP.OPT_1291(I_EK) = B01.UFØRPENS.OPT_1291(I_EK); */   00024390
 /*      B02.ALDERSP.PÅ_1291 (I_EK) = B01.UFØRPENS.PÅ_1291 (I_EK); */   00024400
                     B02.STATUS.PENSJONSTYPE1(I_EK)  = 'A';             00024410
                     B02.ALDERSP.KONV_P_KODE (I_EK)  = 'U';             00024420
                     IF B02.UFØRPENS.UFG(I_EK)      < 100     THEN      00024430
                        B02.P67_KODE (I_EK)  = '5';                     00024440
                     B02.SUM_YTELSE(I_EK)  = 0;                         00024450
                     B02.ALDERSP.UTTAKSDATO_ÅM (I_EK)= AUTODATO_ÅM;     00024460
                     B02.UFØRPENS            (I_EK)  = '';              00024470
                     TRANS_OPPL_OMR.BLANKETTYPE      = '24';/*UP=>P67*/ 00024480
                     SISTE_UFT = FINNE_SISTE_UFT_ÅM(I_EK);              00024490
  /*          B02.OPPHØRSDATO_ÅM(I_EK,SISTE_UFT) =AUTODATO_ÅM;*/        00024500
              B02.OPPHØRSDATO_ÅM(I_EK,SISTE_UFT) =OPPH_ÅM;/*9807*/      00024510
                     B02.OPPHØRSKODE   (I_EK,SISTE_UFT) = 'A';          00024520
                                                                        00024530
                     IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN           00024540
                       CALL BARNS_TILKNYTNINGSKODE_ENDRES(I_EK);        00024550
                                                                        00024560
                   END;                                                 00024570
                                                                        00024580
             ELSE IF B01.STATUS.PENSJONSTYPE1(I_EK) = 'Y' THEN          00024590
               DO;                                                      00024600
 /*      B02.ALDERSP.SPT_1291(I_EK) = B01.UFØRPENS.SPT_1291(I_EK); */   00024610
 /*      B02.ALDERSP.OPT_1291(I_EK) = B01.UFØRPENS.OPT_1291(I_EK); */   00024620
 /*      B02.ALDERSP.PÅ_1291 (I_EK) = B01.UFØRPENS.PÅ_1291 (I_EK); */   00024630
                 B02.ALDERSP.KONV_P_KODE (I_EK)  = 'Y';                 00024640
                     IF B02.UFØRPENS.UFG(I_EK)      < 100     THEN      00024650
                        B02.P67_KODE (I_EK)  = '5';                     00024660
                     B02.SUM_YTELSE(I_EK)  = 0;                         00024670
                 B02.STATUS.PENSJONSTYPE1(I_EK)  = 'A';                 00024680
                  B02.ALDERSP.UTTAKSDATO_ÅM (I_EK)= AUTODATO_ÅM;        00024690
                 SISTE_UFT = FINNE_SISTE_UFT_ÅM(I_EK);                  00024700
    /*           B02.OPPHØRSDATO_ÅM(I_EK,SISTE_UFT) = AUTODATO_ÅM;*/    00024710
                 B02.OPPHØRSDATO_ÅM(I_EK,SISTE_UFT) = OPPH_ÅM; /*9807*/ 00024720
                 B02.OPPHØRSKODE   (I_EK,SISTE_UFT) = 'A';              00024730
                 SISTE_YUFT = FINNE_SISTE_YUFT_ÅM(I_EK);                00024740
    /*           B02.OPPH_DATO_ÅM(I_EK,SISTE_YUFT) = AUTODATO_ÅM;*/     00024750
                 B02.OPPH_DATO_ÅM(I_EK,SISTE_YUFT) = OPPH_ÅM; /*9807*/  00024760
                 B02.OPPH_KODE   (I_EK,SISTE_YUFT) = 'A';               00024770
                 B02.UFØRPENS            (I_EK) = '';                   00024780
 /*YS  VI SKAL BEHOLDE YRKEPENS.YUG OG YPT              */              00024790
                 B02.YRKEPENS.GP         (I_EK) = 0;                    00024800
                 B02.YRKEPENS.BT         (I_EK) = 0;                    00024810
                 B02.YRKEPENS.TP         (I_EK) = 0;                    00024820
 /* HL           B02.YRKEPENS.SPT        (I_EK) = 0       */            00024830
                 B02.YRKEPENS.YPT_KODE   (I_EK) = '';                   00024840
                 TRANS_OPPL_OMR.BLANKETTYPE    = '24';/*FRA UP TIL P67*/00024850
                 IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN               00024860
                   CALL BARNS_TILKNYTNINGSKODE_ENDRES(I_EK);            00024870
                                                                        00024880
               END;                                                     00024890
                                                                        00024900
               END;  /** IF ALDER_PERSON_ÅM(I_EK) = 6700   **/          00024910
                                                                        00024920
             ELSE  /** EKTEFELLEN FYLLER IKKE 67 ÅR DENNE MÅNED  **/    00024930
                                                                        00024940
               DO;                                                      00024950
                  IF (ALDER_PERSON_ÅM(I_EK) = 7000  &                   00024960
                      AUTODATO_ÅM           < 9100 )  !                 00024970
                     (ALDER_PERSON_ÅM(I_EK) = 7001  &                   00024980
 /*HL*/              B01.STATUS.PENSJONSTYPE1(I_EK) ^= 'F' &            00024990
                      AUTODATO_ÅM           > 9101 )     THEN           00025000
                     DO;                                                00025010
                        TRANS_OPPL_OMR.BLANKETTYPE  = '26';/*P67=>P70*/ 00025020
                        IF B01.ALDERSP.KONV_P_KODE(I_EK) = 'F' THEN     00025030
                           B02.ALDERSP.KONV_P_KODE(I_EK) = ' ';         00025040
                     END;                                               00025050
                  IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN              00025060
                     CALL BARN_18ÅR(I_EK);                              00025070
                                                                        00025080
               END;                                                     00025090
                                                                        00025100
 END ER_EKTEFELLE_67_70;                                                00025110
                                                                        00025120
                                                                        00025130
 FJERN_EKTEFELLE_TILLEGG:                                               00025140
   PROC(I_EK);                                                          00025150
                                                                        00025160
   DCL                                                                  00025170
     SISTE_UFT  FIXED BIN(15),                                          00025180
     SISTE_YUFT FIXED BIN(15),                                          00025190
     I_EK       FIXED BIN(15),                                          00025200
     I          FIXED BIN(15);                                          00025210
                                                                        00025220
     IF I_EK = 1 THEN                                                   00025230
       DO;                                                              00025240
         SØKER_IND = 2;                                                 00025250
         I         = 2;                                                 00025260
       END;                                                             00025270
     ELSE                                                               00025280
       DO;                                                              00025290
         SØKER_IND = 1;                                                 00025300
         I         = 1;                                                 00025310
       END;                                                             00025320
                                                                        00025330
     B02.STATUS.VIRK_DATO_ÅM   (I)    = AUTODATO_ÅM;                    00025340
                                                                        00025350
     /* 240895 NÅR FORSØRGET EKTEFELLE OG AFP-NULLPENSJONIST */         00025360
     /* FYLLER 67 ÅR SAMME MND, MÅ DETTE GJØRES:             */         00025370
                                                                        00025380
     IF (ALDER_PERSON_ÅM(I)  = 6701 &                                   00025390
         AUTODATO_ÅM         > 9101 &                                   00025400
         ÅR > 5 & ÅRHUNDRE   < 5      )      &                          00025410
         B01.STATUS.PENSJONSTYPE1(I)  ^= 'A' &                          00025420
         B01.STATUS.PENSJONSTYPE2(I)   = 'N' THEN                       00025430
        DO;                                                             00025440
           CALL AFP_NULL_OPPHØRER (I,I_EK);                             00025450
           GOTO L100;                                                   00025460
        END;                                                            00025470
     /*TRUDE 240895  */                                                 00025480
                                                                        00025490
                                                                        00025500
                                                                        00025510
     B02.STATUS.PENSJONSTYPE2(I   )   = 'S';                            00025520
                                                                        00025530
     B02.STATUS.PENSJONSTYPE2(I_EK)   = 'S';                            00025540
     B02.RF0PERSN.TKNR       (I_EK)  =                                  00025550
                              B01.RF0PERSN.TKNR (I);                    00025560
     B02.STATUS.PENSJONSTYPE1(I_EK)   = 'A';                            00025570
     B02.STATUS.VIRK_DATO_ÅM (I_EK)   =  AUTODATO_ÅM;                   00025580
     B02.ALDERSP.KONV_P_KODE (I_EK)   = 'F';                            00025590
     B02.P67_KODE            (I_EK)   = '5';                            00025600
                                                                        00025610
                                                                        00025620
     DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I,J) > 0);                      00025630
       IF B01.TILKN.FNR_TILKN(I,J) =                                    00025640
          B01.RF0PERSN.FNR   (I_EK      ) THEN                          00025650
            DO;                                                         00025660
              B02.TILKN.TILKNYTNINGSKODE(I, J) = 'A';                   00025670
              B02.TILKN.FT_FØR_91       (I,J)=' ';                      00025680
              J = 13;                                                   00025690
            END;                                                        00025700
     END;                                                               00025710
                                                                        00025720
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                00025730
     TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);            00025740
     TRANS_OPPL_OMR.TRANSTYPE     = 28; /* FT UTGÅR */                  00025750
                                                                        00025760
     PIC11 = B01.RF0PERSN.FNR(I);                                       00025770
                                                                        00025780
       IF  (ALDER_PERSON_ÅM(I)  = 6700 &                                00025790
               AUTODATO_ÅM      < 9100 &                                00025800
            ÅR > 5 & ÅRHUNDRE < 5      )      !                         00025810
           (ALDER_PERSON_ÅM(I)  = 6701 &                                00025820
            AUTODATO_ÅM         > 9101 &                                00025830
            ÅR > 5 & ÅRHUNDRE < 5      )      !                         00025840
           (ALDER_PERSON_ÅM(I) >= 6700 &                                00025850
            ALDER_PERSON_ÅM(I) <  7000 &                                00025860
            AUTODATO_ÅM         = 7301)       !                         00025870
           (ALDER_PERSON_ÅM(I)  = 7000 &                                00025880
            AUTODATO_ÅM         < 9100 &                                00025890
            B01.STATUS.PENSJONSTYPE1(I) ^= 'A')     !                   00025900
           (ALDER_PERSON_ÅM(I)  = 7001 &                                00025910
            AUTODATO_ÅM         > 9101 &                                00025920
 /*HL*/     B01.STATUS.PENSJONSTYPE1(I) ^= 'F'  &                       00025930
            B01.STATUS.PENSJONSTYPE1(I) ^= 'A')             THEN        00025940
       DO;                                                              00025950
          IF B02.UFØRPENS.VILKÅR_8_4_3A(I) = 'J'        THEN            00025960
             B02.STATUS.VILKÅR_8_4_3A(I)   = 'J';                       00025970
                                                                        00025980
  /*     B02.ALDERSP.APD          (I) = 100     23.1.90 HL */           00025990
            IF B02.TT_16_66(I) > 0           THEN                       00026000
               B02.TT_16_66(I) = B02.TT_16_66(I)                        00026010
                           + B02.TT_FRAMT     (I);                      00026020
            ELSE                                                        00026030
               B02.TT_ETTER_1966(I)                                     00026040
                           = B02.TT_ETTER_1966(I)                       00026050
                           + B02.TT_FRAMT     (I);                      00026060
            B02.TT_FRAMT     (I) = 0;                                   00026070
                                                                        00026080
         IF B01.STATUS.PENSJONSTYPE1(I) = 'U' THEN                      00026090
           DO;                                                          00026100
  /*          B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I); */    00026110
  /*          B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I); */    00026120
  /*          B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I); */    00026130
             IF AUTODATO_ÅM > 9201           &                          00026140
                B02.PENSJONSTYPE2(I) ^= 'E'  &                          00026150
                B02.UFØRPENS.UFG (I)  < 100     THEN                    00026160
                                                                        00026170
                DO;                                                     00026180
                   TRANS_OPPL_OMR.TRANSTYPE = 74;  /* NULLPENSJON */    00026190
                   B02.P67_KODE(I)       = '5';                         00026200
                   B02.SUM_YTELSE(I)     = 0;                           00026210
                END;                                                    00026220
             ELSE                                                       00026230
                TRANS_OPPL_OMR.TRANSTYPE     = 24; /* FRA UP TIL P67 */ 00026240
             B02.ALDERSP.KONV_P_KODE (I)  = 'U';                        00026250
             B02.ALDERSP.UTTAKSDATO_ÅM(I) = AUTODATO_ÅM;                00026260
             B02.STATUS.PENSJONSTYPE1(I)  = 'A';                        00026270
             SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                         00026280
   /*        B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = AUTODATO_ÅM;  */         00026290
             B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = OPPH_ÅM; /*9807*/        00026300
             B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                     00026310
             B02.UFØRPENS            (I) = '';                          00026320
                                                                        00026330
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);           00026340
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                         00026350
                  B01.RF0PERSN.FNR   (I         ) THEN                  00026360
                    DO;                                                 00026370
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';         00026380
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';         00026390
                      J = 13;                                           00026400
                    END;                                                00026410
             END;                                                       00026420
                                                                        00026430
             /**  FORSØRGEDE BARN   **/                                 00026440
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                      00026450
               CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                   00026460
                                                                        00026470
           END;                                                         00026480
                                                                        00026490
         ELSE                                                           00026500
         IF B01.STATUS.PENSJONSTYPE1(I) = 'K' THEN                      00026510
           DO;                                                          00026520
             TRANS_OPPL_OMR.TRANSTYPE     = 49; /*FRA AFP TIL P67 */    00026530
             B02.ALDERSP.KONV_P_KODE (I)  = 'K';                        00026540
 /*HL        B02.ALDERSP.UTTAKSDATO_ÅM(I) = AUTODATO_ÅM   */            00026550
             B02.STATUS.PENSJONSTYPE1(I)  = 'A';                        00026560
              B02.ALDERSP.VT_SPT(I) = B02.ALDERSP.SPT(I);               00026570
              B02.ALDERSP.VT_OPT(I) = B02.ALDERSP.OPT(I);               00026580
              B02.ALDERSP.VT_PÅ (I) = B02.ALDERSP.PÅ (I);               00026590
                                                                        00026600
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);           00026610
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                         00026620
                  B01.RF0PERSN.FNR   (I         ) THEN                  00026630
                    DO;                                                 00026640
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';         00026650
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';         00026660
                      J = 13;                                           00026670
                    END;                                                00026680
             END;                                                       00026690
           END;                                                         00026700
                                                                        00026710
         ELSE IF B01.PENSJONSTYPE1(I) = 'Y' THEN                        00026720
          DO;                                                           00026730
             IF AUTODATO_ÅM > 9201           &                          00026740
                B02.PENSJONSTYPE2(I) ^= 'E'  &                          00026750
                B02.UFØRPENS.UFG (I)  < 100     THEN                    00026760
                                                                        00026770
                DO;                                                     00026780
                   TRANS_OPPL_OMR.TRANSTYPE = 74;  /* NULLPENSJON */    00026790
                   B02.P67_KODE(I)       = '5';                         00026800
                   B02.SUM_YTELSE(I)     = 0;                           00026810
                END;                                                    00026820
             ELSE                                                       00026830
                TRANS_OPPL_OMR.BLANKETTYPE= '24';/*FRA UP TIL P67*/     00026840
 /*         B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I); */      00026850
 /*         B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I); */      00026860
 /*         B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I); */      00026870
            B02.ALDERSP.KONV_P_KODE (I)  = 'Y';                         00026880
            B02.STATUS.PENSJONSTYPE1(I)  = 'A';                         00026890
            B02.ALDERSP.UTTAKSDATO_ÅM (I)= AUTODATO_ÅM;                 00026900
            SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                          00026910
    /*      B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = AUTODATO_ÅM;  */          00026920
            B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = OPPH_ÅM; /*9807*/         00026930
            B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                      00026940
            SISTE_YUFT = FINNE_SISTE_YUFT_ÅM(I);                        00026950
    /*      B02.OPPH_DATO_ÅM(I,SISTE_YUFT) = AUTODATO_ÅM;   */          00026960
            B02.OPPH_DATO_ÅM(I,SISTE_YUFT) = OPPH_ÅM;  /*9807*/         00026970
            B02.OPPH_KODE   (I,SISTE_YUFT) = 'A';                       00026980
            B02.UFØRPENS            (I) = '';                           00026990
 /*YS  VI SKAL BEHOLDE YRKEPENS.YUG OG YPT              */              00027000
            B02.YRKEPENS.GP         (I) = 0;                            00027010
            B02.YRKEPENS.BT         (I) = 0;                            00027020
            B02.YRKEPENS.TP         (I) = 0;                            00027030
 /*  HL     B02.YRKEPENS.SPT        (I) = 0          */                 00027040
            B02.YRKEPENS.YPT_KODE   (I) = '';                           00027050
                                                                        00027060
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);           00027070
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                         00027080
                  B01.RF0PERSN.FNR   (I         ) THEN                  00027090
                    DO;                                                 00027100
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';         00027110
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';         00027120
                      J = 13;                                           00027130
                    END;                                                00027140
             END;                                                       00027150
                                                                        00027160
             /**  FORSØRGEDE BARN   **/                                 00027170
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                      00027180
               CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                   00027190
                                                                        00027200
           END;                                                         00027210
                                                                        00027220
       END;  /** IF ALDER_PERSON_ÅM(I) = 6700   **/                     00027230
                                                                        00027240
     ELSE  /** EKTEFELLEN FYLLER IKKE 67 ÅR DENNE MÅNED  **/            00027250
       IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                            00027260
          CALL BARN_18ÅR(I);                                            00027270
  L100:                                                                 00027280
                                                                        00027290
 END FJERN_EKTEFELLE_TILLEGG;                                           00027300
                                                                        00027310
                                                                        00027320
 FORSØRGET_EK_BLIR_60ÅR :                                               00027330
   PROC(I_EK);                                                          00027340
                                                                        00027350
   DCL                                                                  00027360
     SISTE_UFT  FIXED BIN(15),                                          00027370
     SISTE_YUFT  FIXED BIN(15),                                         00027380
     I_EK       FIXED BIN(15),                                          00027390
     I          FIXED BIN(15);                                          00027400
                                                                        00027410
     IF I_EK = 1 THEN                                                   00027420
       DO;                                                              00027430
         SØKER_IND = 2;                                                 00027440
         I         = 2;                                                 00027450
       END;                                                             00027460
     ELSE                                                               00027470
       DO;                                                              00027480
         SØKER_IND = 1;                                                 00027490
         I         = 1;                                                 00027500
       END;                                                             00027510
                                                                        00027520
     B02.STATUS.VIRK_DATO_ÅM   (I)    = AUTODATO_ÅM;                    00027530
     B02.STATUS.VIRK_DATO_ÅM (I_EK)   =  AUTODATO_ÅM;                   00027540
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                00027550
     TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);            00027560
     TRANS_OPPL_OMR.TRANSTYPE     = 6;                                  00027570
                                                                        00027580
     PIC11 = B01.RF0PERSN.FNR(I);                                       00027590
                                                                        00027600
       IF  (ALDER_PERSON_ÅM(I)  = 6700 &                                00027610
               AUTODATO_ÅM      < 9100 &                                00027620
            ÅR > 5 & ÅRHUNDRE < 5      )     !                          00027630
           (ALDER_PERSON_ÅM(I)  = 6701 &                                00027640
            AUTODATO_ÅM         > 9101 &                                00027650
            ÅR > 5 & ÅRHUNDRE < 5      )     !                          00027660
           (ALDER_PERSON_ÅM(I) >= 6700 &                                00027670
            ALDER_PERSON_ÅM(I) <  7000 &                                00027680
            AUTODATO_ÅM         = 7301 )     !                          00027690
           (ALDER_PERSON_ÅM(I)  = 7000 &                                00027700
            AUTODATO_ÅM         < 9100 &                                00027710
            B01.STATUS.PENSJONSTYPE1(I) ^= 'A')      !                  00027720
           (ALDER_PERSON_ÅM(I)  = 7001 &                                00027730
            AUTODATO_ÅM         > 9101 &                                00027740
            B01.STATUS.PENSJONSTYPE1(I) ^= 'F' &                        00027750
            B01.STATUS.PENSJONSTYPE1(I) ^= 'A')             THEN        00027760
       DO;                                                              00027770
          IF B02.UFØRPENS.VILKÅR_8_4_3A(I) = 'J'        THEN            00027780
             B02.STATUS.VILKÅR_8_4_3A(I)   = 'J';                       00027790
                                                                        00027800
 /*      B02.ALDERSP.APD          (I) = 100     - 23.1.90 HL */         00027810
                                                                        00027820
 /*LOVENDRING 1.1.91 HL : */                                            00027830
                                                                        00027840
         IF B02.TT_16_66(I) > 0                 THEN                    00027850
            B02.TT_16_66(I) = B02.TT_16_66(I)                           00027860
                           + B02.TT_FRAMT     (I);                      00027870
         ELSE                                                           00027880
            B02.TT_ETTER_1966(I) = B02.TT_ETTER_1966(I)                 00027890
                           + B02.TT_FRAMT     (I);                      00027900
         B02.TT_FRAMT     (I) = 0;                                      00027910
                                                                        00027920
         IF B01.STATUS.PENSJONSTYPE1(I) = 'U' THEN                      00027930
           DO;                                                          00027940
             IF AUTODATO_ÅM > 9201           &                          00027950
                B02.PENSJONSTYPE2(I) ^= 'E'  &                          00027960
                B02.UFØRPENS.UFG (I)  < 100     THEN                    00027970
                                                                        00027980
                DO;                                                     00027990
                   B02.P67_KODE(I)      = '5';                          00028000
                   B02.SUM_YTELSE(I)     = 0;                           00028010
                   TRANS_OPPL_OMR.TRANSTYPE = 74;  /* NULLPENSJON */    00028020
                END;                                                    00028030
             ELSE                                                       00028040
                TRANS_OPPL_OMR.TRANSTYPE     = 24; /* FRA UP TIL P67 */ 00028050
 /*          B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I); */     00028060
 /*          B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I); */     00028070
 /*          B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I); */     00028080
             B02.ALDERSP.KONV_P_KODE (I)  = 'U';                        00028090
             B02.ALDERSP.UTTAKSDATO_ÅM(I) = AUTODATO_ÅM;                00028100
             B02.STATUS.PENSJONSTYPE1(I)  = 'A';                        00028110
             SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                         00028120
   /*        B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = AUTODATO_ÅM;  */         00028130
             B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = OPPH_ÅM;  /*9807*/       00028140
             B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                     00028150
             B02.UFØRPENS            (I) = '';                          00028160
                                                                        00028170
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);           00028180
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                         00028190
                  B01.RF0PERSN.FNR   (I         ) THEN                  00028200
                    DO;                                                 00028210
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';         00028220
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';         00028230
                      J = 13;                                           00028240
                    END;                                                00028250
             END;                                                       00028260
                                                                        00028270
             /**  FORSØRGEDE BARN   **/                                 00028280
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                      00028290
               CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                   00028300
                                                                        00028310
           END;                                                         00028320
                                                                        00028330
   ELSE                                                                 00028340
         IF B01.STATUS.PENSJONSTYPE1(I) = 'K' THEN                      00028350
           DO;                                                          00028360
             TRANS_OPPL_OMR.TRANSTYPE     = 49; /*FRA AFP TIL P67 */    00028370
             B02.ALDERSP.KONV_P_KODE (I)  = 'K';                        00028380
 /*HL        B02.ALDERSP.UTTAKSDATO_ÅM(I) = AUTODATO_ÅM  */             00028390
             B02.STATUS.PENSJONSTYPE1(I)  = 'A';                        00028400
              B02.ALDERSP.VT_SPT(I) = B02.ALDERSP.SPT(I);               00028410
              B02.ALDERSP.VT_OPT(I) = B02.ALDERSP.OPT(I);               00028420
              B02.ALDERSP.VT_PÅ (I) = B02.ALDERSP.PÅ (I);               00028430
                                                                        00028440
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);           00028450
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                         00028460
                  B01.RF0PERSN.FNR   (I         ) THEN                  00028470
                    DO;                                                 00028480
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';         00028490
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';         00028500
                      J = 13;                                           00028510
                    END;                                                00028520
             END;                                                       00028530
           END;                                                         00028540
                                                                        00028550
         ELSE IF B01.PENSJONSTYPE1(I) = 'Y' THEN                        00028560
          DO;                                                           00028570
 /*         B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I); */      00028580
 /*         B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I); */      00028590
 /*         B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I); */      00028600
            IF B02.UFØRPENS.UFG(I)      < 100          THEN             00028610
               B02.P67_KODE(I)         = '5';                           00028620
            B02.SUM_YTELSE(I)     = 0;                                  00028630
            B02.ALDERSP.KONV_P_KODE (I)  = 'Y';                         00028640
            B02.STATUS.PENSJONSTYPE1(I)  = 'A';                         00028650
            B02.ALDERSP.UTTAKSDATO_ÅM (I)= AUTODATO_ÅM;                 00028660
            SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                          00028670
   /*       B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = AUTODATO_ÅM;  */          00028680
            B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = OPPH_ÅM;  /*9807*/        00028690
            B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                      00028700
            SISTE_YUFT = FINNE_SISTE_YUFT_ÅM(I);                        00028710
   /*       B02.OPPH_DATO_ÅM(I,SISTE_YUFT) = AUTODATO_ÅM; */            00028720
            B02.OPPH_DATO_ÅM(I,SISTE_YUFT) = OPPH_ÅM;  /*9807*/         00028730
            B02.OPPH_KODE   (I,SISTE_YUFT) = 'A';                       00028740
            B02.UFØRPENS            (I) = '';                           00028750
 /*YS  VI SKAL BEHOLDE YRKEPENS.YUG OG YPT              */              00028760
            B02.YRKEPENS.GP         (I) = 0;                            00028770
            B02.YRKEPENS.BT         (I) = 0;                            00028780
            B02.YRKEPENS.TP         (I) = 0;                            00028790
 /* HL      B02.YRKEPENS.SPT        (I) = 0                */           00028800
            B02.YRKEPENS.YPT_KODE   (I) = '';                           00028810
            TRANS_OPPL_OMR.BLANKETTYPE= '24';/*FRA UP TIL P67*/         00028820
                                                                        00028830
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);           00028840
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                         00028850
                  B01.RF0PERSN.FNR   (I         ) THEN                  00028860
                    DO;                                                 00028870
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';         00028880
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';         00028890
                      J = 13;                                           00028900
                    END;                                                00028910
             END;                                                       00028920
                                                                        00028930
             /**  FORSØRGEDE BARN   **/                                 00028940
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                      00028950
               CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                   00028960
                                                                        00028970
           END;                                                         00028980
                                                                        00028990
                                                                        00029000
       END;  /** IF ALDER_PERSON_ÅM(I) = 6700   **/                     00029010
                                                                        00029020
     ELSE  /** EKTEFELLEN FYLLER IKKE 67 ÅR DENNE MÅNED  **/            00029030
       IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                            00029040
          CALL BARN_18ÅR(I);                                            00029050
                                                                        00029060
                                                                        00029070
 END FORSØRGET_EK_BLIR_60ÅR;                                            00029080
                                                                        00029090
                                                                        00029100
 UNG_UFØR :                                                             00029110
    PROC;                                                               00029120
                                                                        00029130
 /* MAN KOMMER HIT MED BUP_GAR_KODE = 'A' ELLER 'D';   */               00029140
 /* 'A' ER EN SOM FÅR TP VED FYLTE 20 ÅR               */               00029150
 /* 'D' ER EN SOM VENTER PÅ Å FÅ EN ELLER ANNEN GARANTI*/               00029160
                                                                        00029170
 DCL   ALDER_UF                    PIC 'S99999';                        00029180
                                                                        00029190
        W_FNR          = B02.RF0PERSN.FNR(I);                           00029200
        W_FNR_ÅM       = FNR_R.ÅR!!FNR_R.MND;                           00029210
        ALDER_UF       = B02.UFT_ÅM(I,1) - W_FNR_ÅM;                    00029220
                                                                        00029230
         IF (ALDER_PERSON_ÅM(I) = 2000  &                               00029240
             AUTODATO_ÅM        < 9100  &                               00029250
             B01.PENSJONSTYPE1(I) = 'Y' )     !                         00029260
            (ALDER_PERSON_ÅM(I) = 2001  &                               00029270
             AUTODATO_ÅM        > 9101  &                               00029280
             B01.PENSJONSTYPE1(I) = 'Y' )    THEN                       00029290
                                                                        00029300
                DO;                                                     00029310
                                                                        00029320
     /** FINNE SISTE UTFYLTE YRKEHIST-SEGMENT **/                       00029330
                                                                        00029340
                   DO J = 1 TO 5  UNTIL                                 00029350
                          (B01.YRKEHIST.OPPH_DATO_ÅM(I,J) = 0);         00029360
                   END;                                                 00029370
                                                                        00029380
                   IF B02.YRKE11(I,J)        = 'V'        THEN          00029390
                      B02.PAÅ(I,J)           = 2;                       00029400
                                                                        00029410
                END;                                                    00029420
                                                                        00029430
         ELSE;                                                          00029440
                                                                        00029450
                                                                        00029460
         IF B02.BUP_GAR_KODE(I,1) = 'A'        THEN                     00029470
            IF (ALDER_PERSON_ÅM(I) = 2000   &                           00029480
                 AUTODATO_ÅM > 8104         )    !                      00029490
               (ALDER_PERSON_ÅM(I) > 2000   &           /*9709 HL*/     00029500
                 AUTODATO_ÅM = 8105         )       THEN                00029510
                                                                        00029520
                DO;                                                     00029530
                   IF AUTODATO_ÅM > 8804    THEN                        00029540
                     IF AUTODATO_ÅM < 9105    THEN                      00029550
                        GARANTI_BUP = 3.00;                             00029560
                     ELSE                                               00029570
                        GARANTI_BUP = 3.30;                             00029580
                   ELSE                                                 00029590
                   IF AUTODATO_ÅM > 8704    THEN                        00029600
                        GARANTI_BUP = 2.50;                             00029610
                   ELSE                                                 00029620
                        GARANTI_BUP = 2.00;                             00029630
                   K = 1;                                               00029640
                   DO WHILE(B02.UFØRHIST.UFT_ÅM(I,K) > 0);              00029650
                      B02.BUP_GAR_KODE(I,K) = 'B';                      00029660
                      B02.BUP_GARANTI(I,K) = GARANTI_BUP;               00029670
                      K = K + 1;                                        00029680
                   END;                                                 00029690
                                                                        00029700
                   CALL FØDT_UFØR(FAMILIE_IND);                         00029710
                                                                        00029720
                   TRANS_OPPL_OMR.TRANSTYPE     = 31;                   00029730
  /*31 = FØDT UFØR FYLLER 20 ÅR, ELLER ER 20 OG PASSERER DATOEN 8105*/  00029740
                   HENDELSE_IND = JA;                                   00029750
                   SØKER_IND = I;                                       00029760
                   I = I + 1;                                           00029770
                                                                        00029780
                END;                                                    00029790
                                                                        00029800
              ELSE; /* ALDER = 20       */                              00029810
                                                                        00029820
         ELSE                                                           00029830
         IF AUTODATO_ÅM = 8105       THEN                               00029840
            DO;                                                         00029850
               IF FNR_R.ÅR > 46  &                                      00029860
                  ALDER_UF < 2001             THEN                      00029870
                  DO;                                                   00029880
                     K = 1;                                             00029890
                     DO WHILE(B02.UFØRHIST.UFT_ÅM(I,K) > 0);            00029900
                        B02.BUP_GAR_KODE(I,K) = 'B';                    00029910
                        B02.BUP_GARANTI(I,K) = 2.00;                    00029920
                        K = K + 1;                                      00029930
                     END;                                               00029940
                     CALL FØDT_UFØR(FAMILIE_IND);                       00029950
                                                                        00029960
                     TRANS_OPPL_OMR.TRANSTYPE     = 31;                 00029970
                     HENDELSE_IND = JA;                                 00029980
                     SØKER_IND = I;                                     00029990
                     I = I + 1;                                         00030000
                                                                        00030010
                  END;                                                  00030020
                                                                        00030030
            END;                                                        00030040
         ELSE                                                           00030050
         IF AUTODATO_ÅM = 8401       THEN                               00030060
            DO;                                                         00030070
               IF FNR_R.ÅR > 45  &                                      00030080
                  ALDER_UF < 2101             THEN                      00030090
                  DO;                                                   00030100
                     K = 1;                                             00030110
                     DO WHILE(B02.UFØRHIST.UFT_ÅM(I,K) > 0);            00030120
                        B02.BUP_GAR_KODE(I,K) = 'B';                    00030130
                        B02.BUP_GARANTI(I,K) = 2.00;                    00030140
                        K = K + 1;                                      00030150
                     END;                                               00030160
                     CALL FØDT_UFØR(FAMILIE_IND);                       00030170
                                                                        00030180
                     TRANS_OPPL_OMR.TRANSTYPE     = 46;                 00030190
                     HENDELSE_IND = JA;                                 00030200
                     SØKER_IND = I;                                     00030210
                     I = I + 1;                                         00030220
                                                                        00030230
                  END;                                                  00030240
                                                                        00030250
            END;                                                        00030260
         ELSE                                                           00030270
         IF AUTODATO_ÅM = 8901       THEN                               00030280
            DO;                                                         00030290
               IF FNR_R.ÅR > 44  &                                      00030300
                  ALDER_UF < 2201             THEN                      00030310
                  DO;                                                   00030320
                     K = 1;                                             00030330
                     DO WHILE(B02.UFØRHIST.UFT_ÅM(I,K) > 0);            00030340
                        B02.BUP_GAR_KODE(I,K) = 'B';                    00030350
                        B02.BUP_GARANTI(I,K) = 3.00;                    00030360
                        K = K + 1;                                      00030370
                     END;                                               00030380
                     CALL FØDT_UFØR(FAMILIE_IND);                       00030390
                                                                        00030400
                     TRANS_OPPL_OMR.TRANSTYPE     = 46;                 00030410
                     HENDELSE_IND = JA;                                 00030420
                     SØKER_IND = I;                                     00030430
                     I = I + 1;                                         00030440
                                                                        00030450
                  END;                                                  00030460
                                                                        00030470
            END;                                                        00030480
         ELSE                                                           00030490
         IF AUTODATO_ÅM = 8907       THEN                               00030500
            DO;                                                         00030510
               IF FNR_R.ÅR > 22  &                                      00030520
                  FNR_R.ÅR < 45  &                                      00030530
                  ALDER_UF < 2201             THEN                      00030540
                  DO;                                                   00030550
                     K = 1;                                             00030560
                     DO WHILE(B02.UFØRHIST.UFT_ÅM(I,K) > 0);            00030570
                        B02.BUP_GAR_KODE(I,K) = 'E';                    00030580
                        K = K + 1;                                      00030590
                     END;                                               00030600
                     CALL FØDT_UFØR(FAMILIE_IND);                       00030610
                                                                        00030620
                     TRANS_OPPL_OMR.TRANSTYPE     = 46;                 00030630
                     HENDELSE_IND = JA;                                 00030640
                     SØKER_IND = I;                                     00030650
                     I = I + 1;                                         00030660
                                                                        00030670
                  END;                                                  00030680
                                                                        00030690
            END;                                                        00030700
         ELSE                                                           00030710
         IF AUTODATO_ÅM = 9205       THEN                               00030720
            DO;                                                         00030730
               IF FNR_R.ÅR > 25     &                                   00030740
                  FNR_R.ÅR < 43     &                                   00030750
                  ALDER_UF < 2401                THEN                   00030760
                                                                        00030770
                  DO;                                                   00030780
                     K = 1;                                             00030790
                     DO WHILE(B02.UFØRHIST.UFT_ÅM(I,K) > 0);            00030800
                        B02.BUP_GAR_KODE(I,K) = 'E';                    00030810
                        K = K + 1;                                      00030820
                     END;                                               00030830
                     CALL FØDT_UFØR(FAMILIE_IND);                       00030840
                     TRANS_OPPL_OMR.TRANSTYPE     = 46;                 00030850
                     HENDELSE_IND = JA;                                 00030860
                     SØKER_IND = I;                                     00030870
                     I = I + 1;                                         00030880
                                                                        00030890
                  END;                                                  00030900
               ELSE          /*9708 HL*/                                00030910
               IF FNR_R.ÅR > 42     &                                   00030920
                  ALDER_UF < 2401                THEN                   00030930
                  DO;                                                   00030940
                     K = 1;                                             00030950
                     DO WHILE(B02.UFØRHIST.UFT_ÅM(I,K) > 0);            00030960
                        B02.BUP_GAR_KODE(I,K) = 'B';                    00030970
                        B02.BUP_GARANTI(I,K) = 3.30;                    00030980
                        K = K + 1;                                      00030990
                     END;                                               00031000
                     CALL FØDT_UFØR(FAMILIE_IND);                       00031010
                     TRANS_OPPL_OMR.TRANSTYPE     = 7;                  00031020
                     HENDELSE_IND = JA;                                 00031030
                     SØKER_IND = I;                                     00031040
                     IF B02.BUP_GAR_KODE((3-I),1) ^= 'D'  THEN          00031050
                        I = I + 1;                                      00031060
                  END;                                                  00031070
            END;                                                        00031080
         ELSE                                                           00031090
 /*9708 HL*/                                                            00031100
         IF AUTODATO_ÅM = 9707       THEN                               00031110
            DO;                                                         00031120
               IF ALDER_UF < 2601         THEN                          00031130
                                                                        00031140
                  DO;                                                   00031150
                     IF ÅR > 40             THEN                        00031160
                        DO;                                             00031170
                           K = 1;                                       00031180
                           DO WHILE(B02.UFØRHIST.UFT_ÅM(I,K) > 0);      00031190
                              B02.BUP_GAR_KODE(I,K) = 'B';              00031200
                              B02.BUP_GARANTI(I,K) = 3.30;              00031210
                              K = K + 1;                                00031220
                           END;                                         00031230
                           B02.STATUS.TP_GAR_KODE(I) = ' ';             00031240
                        END;                                            00031250
                     ELSE                                               00031260
                        DO;                                             00031270
                           K = 1;                                       00031280
                           DO WHILE(B02.UFØRHIST.UFT_ÅM(I,K) > 0);      00031290
                              B02.BUP_GAR_KODE(I,K) = 'E';              00031300
                              K = K + 1;                                00031310
                           END;                                         00031320
                        END;                                            00031330
                     CALL FØDT_UFØR(FAMILIE_IND);                       00031340
                     TRANS_OPPL_OMR.TRANSTYPE     = 46;                 00031350
                     HENDELSE_IND = JA;                                 00031360
                     SØKER_IND = I;                                     00031370
                     IF B02.BUP_GAR_KODE((3-I),1) ^= 'D'  THEN          00031380
                        I = I + 1;                                      00031390
                  END;                                                  00031400
            END;                                                        00031410
                                                                        00031420
 END UNG_UFØR;                                                          00031430
                                                                        00031440
                                                                        00031450
 FØDT_UFØR:                                                             00031460
   PROC(I_EK);                                                          00031470
                                                                        00031480
   DCL                                                                  00031490
     I_EK           FIXED BIN(15),                                      00031500
     SISTE_BUP_EK   FIXED BIN(15);                                      00031510
                                                                        00031520
     IF I = 1 THEN                                                      00031530
       I_EK = 2;                                                        00031540
     ELSE                                                               00031550
       I_EK = 1;                                                        00031560
                                                                        00031570
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                00031580
     TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);            00031590
     B02.STATUS.VIRK_DATO_ÅM   (I)    = AUTODATO_ÅM;                    00031600
                                                                        00031610
     IF B01.RF0PERSN.FNR(I_EK) > 0 THEN                                 00031620
       DO;                                                              00031630
         B02.STATUS.VIRK_DATO_ÅM   (I_EK) = AUTODATO_ÅM;                00031640
                                                                        00031650
         /** FINNE SISTE UTFYLLTE BUP_GAR_KODE FOR EK   **/             00031660
                                                                        00031670
    /*0697 HL:*/                                                        00031680
         DO J = 7 TO 1 BY -1 UNTIL(B01.UFØRHIST.BUP_GAR_KODE            00031690
                                      (I_EK,J) ^= ' ');                 00031700
           SISTE_BUP_EK = J;                                            00031710
         END;                                                           00031720
                                                                        00031730
         IF B01.STATUS.PENSJONSTYPE1(I_EK)  = 'U'    !                  00031740
            B01.STATUS.PENSJONSTYPE1(I_EK)  = 'Y' THEN                  00031750
           DO;                                                          00031760
                                                                        00031770
             IF AUTODATO_ÅM > 8804   &                                  00031780
                                                                        00031790
                B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) > 0 THEN    00031800
                                                                        00031810
  /*TRUDE*/    IF AUTODATO_ÅM < 9105   THEN                             00031820
                 B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 3.00;    00031830
               ELSE                                                     00031840
                 B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 3.30;    00031850
                                                                        00031860
             ELSE IF AUTODATO_ÅM > 8704   &                             00031870
                                                                        00031880
                B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) > 0 THEN    00031890
                                                                        00031900
                B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 2.50;     00031910
                                                                        00031920
 /*HIT 16.2.88 HL  */                                                   00031930
                                                                        00031940
                                                                        00031950
             IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN                   00031960
               CALL BARN_18ÅR(I_EK);                                    00031970
                                                                        00031980
                                                                        00031990
           END;                                                         00032000
                                                                        00032010
       END;                                                             00032020
                                                                        00032030
     IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                              00032040
        CALL BARN_18ÅR(I);                                              00032050
                                                                        00032060
 END FØDT_UFØR;                                                         00032070
                                                                        00032080
                                                                        00032090
 FØDT_UFØR_BARN:                                                        00032100
   PROC;                                                                00032110
                                                                        00032120
     TRANSTYPE2 = 31;                                                   00032130
     B02.STATUS.VIRK_DATO_ÅM   (I)    = AUTODATO_ÅM;                    00032140
     B02.BUP_GAR_KODE(I,BUP_SISTE) = 'B';                               00032150
     UFØR_BARN_IND = I;                                                 00032160
                                                                        00032170
 END FØDT_UFØR_BARN;                                                    00032180
                                                                        00032190
                                                                        00032200
 FJERN_BARNEPENSJON:                                                    00032210
   PROC(BARN_IND,MF_IND);                                               00032220
                                                                        00032230
     /** RUTINEN SKILLER IKKE PÅ FJERNING VED 20 OG 18 ÅR           **/ 00032240
        /** HELLER IKKE PÅ FJERNING VED 21 ÅR                       **/ 00032250
     /** BARN_IND ER INDEKSEN PÅ DET BARN DET ER OPPHØR FOR.        **/ 00032260
     /** SØKER_IND ER INDEKSEN FOR DEN TRANSEN DET GJELDER.         **/ 00032270
     /** MF_IND ER INDEKSEN FOR AVDØD MOR ELLER FAR.                **/ 00032280
     /** UFØR_BARN_IND SETTES BARE VED SPLITTING AV FAMILIE, SLIK   **/ 00032290
     /** AT BEREGNING KAN KALLES OPP TO GANGER FRA STYRINGSRUTINEN. **/ 00032300
                                                                        00032310
   DCL                                                                  00032320
     BARN_IND     FIXED BIN(15),                                        00032330
     IND          FIXED BIN(15),                                        00032340
     MF_IND       FIXED BIN(15);                                        00032350
                                                                        00032360
     TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);            00032370
                                                                        00032380
     B02.ETTEBARN         (BARN_IND)   = '';                            00032390
     B02.STATUS.SUM_YTELSE(BARN_IND)   = 0;                             00032400
                                                                        00032410
     DO IND = 1 TO 14 UNTIL(B01.FNR(IND) =                              00032420
                            B01.TILKN.FNR_TILKN(BARN_IND,1));           00032430
     END;                                                               00032440
                                                                        00032450
         DO J = 3 TO 14 UNTIL(B01.STATUS.PENSJONSTYPE2(J) = 'P');       00032460
                                                                        00032470
              /*   P ANGIR AT DETTE ER YNGSTE BARN I KULLET */          00032480
                                                                        00032490
         END;                                                           00032500
                                                                        00032510
         SØKER_IND = J;                                                 00032520
                                                                        00032530
     IF B01.STATUS.ANTALL_BARN(SØKER_IND) = 1 THEN /*IKKE FLERE BARN*/  00032540
       DO;                                                              00032550
         TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(BARN_IND);     00032560
                                                                        00032570
         /** TILKN - SEGMENT FOR BARNET FJERNES HOS TILKNYTTEDE     **/ 00032580
         /** FORELDRE                                               **/ 00032590
                                                                        00032600
                                                                        00032610
         IF B01.RF0PERSN.FNR (1) > 0 THEN                               00032620
            CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,1);                00032630
                                                                        00032640
         IF B01.RF0PERSN.FNR (2) > 0 THEN                               00032650
            CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,2);                00032660
                                                                        00032670
         IF B01.STATUS.PENSJONSTYPE3(BARN_IND)  = 'U' THEN              00032680
           DO;                                                          00032690
             CALL UFØR_BARN(BARN_IND);                                  00032700
             TRANSTYPE2 = 0;                                            00032710
             TRANS_OPPL_OMR.TRANSTYPE = 42; /* UFØR BARN FYLLER 18/20*/ 00032720
           END;                                                         00032730
         ELSE                                                           00032740
           DO;                                                          00032750
             B02.STATUS.STATUS_KODE_HIST(BARN_IND)   = 'O';             00032760
             B02.STATUS.VIRK_DATO_ÅM    (BARN_IND)   = AUTODATO_ÅM;     00032770
             TRANS_OPPL_OMR.TRANSTYPE = 58;/*BP UTEN SØSKEN FYLLER ÅR*/ 00032780
           END;                                                         00032790
                                                                        00032800
       END;   /**    IF B01.STATUS.ANTALL_BARN(BARN_IND) = 1  **/       00032810
                                                                        00032820
     ELSE     /** FLERE ENN ETT BARN   **/                              00032830
                                                                        00032840
       DO;                                                              00032850
         IF B01.STATUS.PENSJONSTYPE2(BARN_IND)  = 'P'  THEN             00032860
                                                                        00032870
                     /** YNGSTE BARN OPPHØRER    **/                    00032880
           DO;                                                          00032890
             TRANS_OPPL_OMR.TRANSTYPE = 58;/*BP UTEN SØSKEN OPPHØRER*/  00032900
             TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.                  00032910
                                         FNR(SØKER_IND);                00032920
                                                                        00032930
             /** TILKN - SEGMENT FOR BARNET FJERNES HOS TILKNYTTEDE  **/00032940
             /** FORELDRE                                            **/00032950
                                                                        00032960
             IF B01.RF0PERSN.FNR (1) > 0 THEN                           00032970
                CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,1);            00032980
                                                                        00032990
             IF B01.RF0PERSN.FNR (2) > 0 THEN                           00033000
                CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,2);            00033010
                                                                        00033020
             B02.STATUS.VIRK_DATO_ÅM    (BARN_IND) = AUTODATO_ÅM;       00033030
                                                                        00033040
             IF B01.STATUS.PENSJONSTYPE3(BARN_IND)  = 'U' THEN          00033050
               DO;           /** SPLITTING AV FAMILIE  **/              00033060
                 TRANS_OPPL_OMR.TRANSTYPE = 0;                          00033070
                 UFØR_BARN_IND = BARN_IND;                              00033080
                 CALL UFØR_BARN(BARN_IND);                              00033090
               END;                                                     00033100
             ELSE                                                       00033110
               B02.STATUS.STATUS_KODE_HIST(BARN_IND) = 'O';             00033120
                                                                        00033130
             DO J = BARN_IND  + 1 TO  MAX_BARN - 1;                     00033140
                IF B01.STATUS.PENSJONSTYPE2(J)  = 'Ø' THEN              00033150
                   /* 'Ø' = BARNET ER IKKE YNGSTE BARN */               00033160
                   DO;                                                  00033170
                      CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,J);      00033180
                      B02.ETTEBARN            (J) = '';                 00033190
                      B02.STATUS.SUM_YTELSE   (J) = 0;                  00033200
                      B02.STATUS.VIRK_DATO_ÅM (J) = AUTODATO_ÅM;        00033210
                                                                        00033220
                      IF B01.STATUS.PENSJONSTYPE3(J)  = 'U' THEN        00033230
                         DO;           /** SPLITTING AV FAMILIE  **/    00033240
                            UFØR_BARN_IND = J;                          00033250
                            CALL UFØR_BARN(J);   /**  (J       )   **/  00033260
                         END;                                           00033270
                      ELSE                                              00033280
                         B02.STATUS.STATUS_KODE_HIST(J) = 'O';          00033290
                   END;                                                 00033300
                                                                        00033310
             END;                                                       00033320
                                                                        00033330
             I = MAX_BARN; /*** NB! NB! FOR å IKKE BEHANDLE BARNA **/   00033340
                           /*** PåNYTT FRA HOVEDLOOP              **/   00033350
                                                                        00033360
           END;   /** IF B01.STATUS.PENSJONSTYPE2(BARN_IND)  = P   */   00033370
                                                                        00033380
         ELSE   /** BARN SOM UTGÅR ER IKKE YNGSTE BARN   **/            00033390
                                                                        00033400
           DO;                                                          00033410
             B02.STATUS.ANTALL_BARN(SØKER_IND) =                        00033420
                           B02.STATUS.ANTALL_BARN(SØKER_IND) - 1;       00033430
             B02.STATUS.VIRK_DATO_ÅM(SØKER_IND) = AUTODATO_ÅM;          00033440
             TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR               00033450
                                                   (SØKER_IND);         00033460
             TRANS_OPPL_OMR.TRANSTYPE = 29;                             00033470
               /* 29 = BP OPPHØRER, DET ER SØSKEN TILBAKE */            00033480
                                                                        00033490
           LOOP:                                                        00033500
             DO J = 1 TO 13;                                            00033510
               IF B01.TILKN.FNR_TILKN(SØKER_IND,J) =                    00033520
                               B01.RF0PERSN.FNR(BARN_IND) THEN          00033530
                 DO;                                                    00033540
                   DO K = J TO 12;                                      00033550
                     B02.TILKN (SØKER_IND,K) =                          00033560
                            B02.TILKN (SØKER_IND,K + 1);                00033570
                   END;                                                 00033580
                   B02.TILKN (SØKER_IND,13) = '';                       00033590
                   LEAVE LOOP;                                          00033600
                 END;                                                   00033610
                                                                        00033620
             END;    /**  DO J = 1 TO 13  **/                           00033630
                                                                        00033640
                                                                        00033650
             DO J = 1 TO 13 UNTIL(B02.TILKN.                            00033660
                        TILKNYTNINGSKODE(SØKER_IND,J) = 'D');           00033670
                                                                        00033680
               IF B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,J) = 'D' THEN    00033690
                 DO;                                                    00033700
                   PIC11 = B01.TILKN.FNR_TILKN(SØKER_IND,J);            00033710
                   IF F_KJØNN(PIC11) = 'K' THEN                         00033720
                     MF_IND = 1;                                        00033730
                   ELSE                                                 00033740
                     MF_IND = 2;                                        00033750
                 END;                                                   00033760
                                                                        00033770
             END;    /**  DO J = 1 TO 13 UNTIL(B02.TILKN **/            00033780
                                                                        00033790
             IF B01.STATUS.PENSJONSTYPE3(BARN_IND)  = 'U' THEN          00033800
               DO;           /** SPLITTING AV FAMILIE  **/              00033810
                 UFØR_BARN_IND = BARN_IND;                              00033820
                 TRANS_OPPL_OMR.TRANSTYPE = 0;                          00033830
                 CALL UFØR_BARN(BARN_IND);   /**  (BARN_IND)   **/      00033840
               END;                                                     00033850
             ELSE                                                       00033860
               DO;                                                      00033870
                  DO J = 1 TO 13;                                       00033880
                     B02.TILKN(BARN_IND,J)             = '';            00033890
                  END;                                                  00033900
                  B02.STATUS.STATUS_KODE_HIST(BARN_IND) = 'O';          00033910
                  B02.STATUS.VIRK_DATO_ÅM    (BARN_IND) =               00033920
                                                        AUTODATO_ÅM;    00033930
               END;                                                     00033940
                                                                        00033950
             DO J = 3 TO MAX_BARN - 1;                                  00033960
                B02.STATUS.VIRK_DATO_ÅM   (J) = AUTODATO_ÅM;            00033970
             END;                                                       00033980
                                                                        00033990
           END;  /** DO FOR ELSE  BARN SOM UTGÅR ER IKKE YNGSTE BARN **/00034000
                                                                        00034010
       END;   /**  DO FOR ELSE FLERE ENN ETT BARN   **/                 00034020
                                                                        00034030
                                                                        00034040
 END FJERN_BARNEPENSJON;                                                00034050
                                                                        00034060
                                                                        00034070
 UFØR_BARN:                                                             00034080
   PROC(BARN_IND);                                                      00034090
                                                                        00034100
     /** UFØR BARN ENDRES TIL REN UFØR                      **/         00034110
     /** TRANS DANNES IKKE HER, MEN I OVERLIGGENDE RUTINE   **/         00034120
                                                                        00034130
   DCL                                                                  00034140
     BARN_IND     FIXED BIN(15);                                        00034150
                                                                        00034160
     B02.STATUS.PENSJONSTYPE1  (BARN_IND) = 'U';                        00034170
     B02.STATUS.PENSJONSTYPE2  (BARN_IND) = 'P';                        00034180
     B02.STATUS.PENSJONSTYPE3  (BARN_IND) = ' ';                        00034190
     B02.STATUS.ANTALL_BARN    (BARN_IND) =  0;                         00034200
                                                                        00034210
     DO J = 1 TO 13;                                                    00034220
       B02.TILKN.FNR_TILKN       (BARN_IND,J) = 0;                      00034230
       B02.TILKN.TILKNYTNINGSKODE(BARN_IND,J) = ' ';                    00034240
     END;                                                               00034250
                                                                        00034260
     TRANSTYPE2 = 42; /* UFØR BARN FYLLER 18/20 ÅR */                   00034270
                                                                        00034280
 END UFØR_BARN;                                                         00034290
                                                                        00034300
                                                                        00034310
 FJERN_BARNETILLEGG:                                                    00034320
   PROC(BARN_IND,I,I_EK);                                               00034330
                                                                        00034340
   DCL                                                                  00034350
     BARN_IND       FIXED BIN(15),                                      00034360
     I              FIXED BIN(15),                                      00034370
     I_EK           FIXED BIN(15);                                      00034380
                                                                        00034390
     IF B01.RF0PERSN.FNR(1) = B01.TILKN.FNR_TILKN(BARN_IND,1) THEN      00034400
       DO;                                                              00034410
         I    = 1;                                                      00034420
         I_EK = 2;                                                      00034430
       END;                                                             00034440
     ELSE                                                               00034450
       DO;                                                              00034460
         I    = 2;                                                      00034470
         I_EK = 1;                                                      00034480
       END;                                                             00034490
                                                                        00034500
     B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;                       00034510
     IF B01.STATUS.PENSJONSTYPE1(I_EK)  ^= ' ' THEN                     00034520
       DO;                                                              00034530
         IF B01.STATUS_KODE_HIST(I_EK)  = ' ' THEN                      00034540
                                                                        00034550
         B02.STATUS.VIRK_DATO_ÅM   (I_EK) = AUTODATO_ÅM;                00034560
       END;                                                             00034570
                                                                        00034580
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                00034590
     TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);            00034600
     IF B01.GARANTITILLEGG_BARN   (I)  = 0               &              00034610
        B01.GARANTITILLEGG_SÆRBARN(I)  = 0               &              00034620
        B01.BT_SÆRBARN            (I)  = 0               &              00034630
        B01.ALDERSP.BT            (I)  = 0               &              00034640
        B01.UFØRPENS.BT           (I)  = 0               &              00034650
        B01.YRKEPENS.BT           (I)  = 0            THEN              00034660
                                                                        00034670
        DO;                                                             00034680
             IF  TRANS_OPPL_OMR.TRANSTYPE  = 0 THEN                     00034690
                 TRANS_OPPL_OMR.TRANSTYPE = 70; /* IKKE BREV   */       00034700
        END;                                                            00034710
     ELSE                                                               00034720
        TRANS_OPPL_OMR.TRANSTYPE = 28; /* FT OPPHØRER */                00034730
                                                                        00034740
     IF B01.STATUS.ANTALL_BARN(I)  > 0 THEN                             00034750
        CALL BARN_18ÅR(I);                                              00034760
                                                                        00034770
     IF B01.STATUS.ANTALL_BARN(I_EK)  > 0 THEN                          00034780
        CALL BARN_18ÅR(I_EK);                                           00034790
                                                                        00034800
 END FJERN_BARNETILLEGG;                                                00034810
                                                                        00034820
                                                                        00034830
 BARN_18ÅR:                                                             00034840
   PROC(I);                                                             00034850
   DCL                                                                  00034860
     BARN_IND       FIXED BIN(15),                                      00034870
     I              FIXED BIN(15);                                      00034880
                                                                        00034890
     DO J = 1 TO 13 WHILE (B01.TILKN.FNR_TILKN(I,J) > 0);               00034900
       IF B01.TILKN.TILKNYTNINGSKODE(I,J) = 'L'     !                   00034910
  /*HL*/  B01.TILKN.TILKNYTNINGSKODE(I,J) = 'V'     !                   00034920
          B01.TILKN.TILKNYTNINGSKODE(I,J) = 'W'    THEN                 00034930
         DO;                                                            00034940
           DO BARN_IND = 3 TO 14 UNTIL(B01.RF0PERSN.FNR(BARN_IND) =     00034950
                                    B01.TILKN.FNR_TILKN(I,J));          00034960
           END;                                                         00034970
                                                                        00034980
           IF ALDER_PERSON_ÅM(BARN_IND) = 1801 THEN                     00034990
             DO;                                                        00035000
               B02.STATUS.STATUS_KODE_HIST(BARN_IND)   = 'O';           00035010
               B02.STATUS.VIRK_DATO_ÅM    (BARN_IND)   = AUTODATO_ÅM;   00035020
               CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,I);             00035030
                                                                        00035040
               B02.STATUS.ANTALL_BARN(I) =                              00035050
                            B02.STATUS.ANTALL_BARN(I) - 1;              00035060
                                                                        00035070
             END;                                                       00035080
           ELSE                                                         00035090
             B02.STATUS.VIRK_DATO_ÅM   (BARN_IND) = AUTODATO_ÅM;        00035100
         END;                                                           00035110
     END;        /**    DO J = 1 TO 13      **/                         00035120
                                                                        00035130
 END BARN_18ÅR;                                                         00035140
                                                                        00035150
                                                                        00035160
 BARNS_TILKNYTNINGSKODE_ENDRES:                                         00035170
   PROC(I);                                                             00035180
   DCL                                                                  00035190
     BARN_IND       FIXED BIN(15),                                      00035200
     I              FIXED BIN(15);                                      00035210
                                                                        00035220
     DO J = 1 TO 13 WHILE (B01.TILKN.FNR_TILKN(I,J) > 0);               00035230
       IF B01.TILKN.TILKNYTNINGSKODE(I,J) = 'L'    !                    00035240
 /*HL*/   B01.TILKN.TILKNYTNINGSKODE(I,J) = 'V'    !                    00035250
          B01.TILKN.TILKNYTNINGSKODE(I,J) = 'W'   THEN                  00035260
         DO;                                                            00035270
           DO BARN_IND = 3 TO 14 UNTIL(B01.RF0PERSN.FNR(BARN_IND) =     00035280
                                    B01.TILKN.FNR_TILKN(I,J));          00035290
           END;                                                         00035300
                                                                        00035310
           IF ALDER_PERSON_ÅM(BARN_IND) = 1801 THEN                     00035320
             DO;                                                        00035330
               B02.STATUS.STATUS_KODE_HIST(BARN_IND) = 'O';             00035340
               B02.STATUS.VIRK_DATO_ÅM    (BARN_IND) = AUTODATO_ÅM;     00035350
               B02.STATUS.ANTALL_BARN(I) =                              00035360
                            B02.STATUS.ANTALL_BARN(I) - 1;              00035370
               CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,I);             00035380
             END;                                                       00035390
           ELSE                                                         00035400
             DO;                                                        00035410
               B02.TILKN.TILKNYTNINGSKODE(BARN_IND,1) = 'A';            00035420
               B02.STATUS.VIRK_DATO_ÅM   (BARN_IND) = AUTODATO_ÅM;      00035430
             END;                                                       00035440
         END;                                                           00035450
     END;        /**    DO J = 1 TO 13      **/                         00035460
                                                                        00035470
 END BARNS_TILKNYTNINGSKODE_ENDRES;                                     00035480
                                                                        00035490
                                                                        00035500
        YRKESSKADE_ELEV:                                                00035510
         PROC(W_PAÅ);                                                   00035520
                                                                        00035530
            DCL I_EK     FIXED BIN (15);                                00035540
            DCL W_IND    FIXED BIN (15);                                00035550
            DCL W_PAÅ    FIXED DEC (3,2);                               00035560
                                                                        00035570
     /** FINNE SISTE UTFYLTE YRKEHIST-SEGMENT **/                       00035580
                                                                        00035590
         DO J = 1 TO 5  UNTIL(B01.YRKEHIST.OPPH_DATO_ÅM(I,J) = 0);      00035600
         END;                                                           00035610
                                                                        00035620
         IF B02.YRKE11(I,J)        = 'V'      &                         00035630
            B02.PAÅ   (I,J)        < W_PAÅ          THEN                00035640
                                                                        00035650
           DO;                                                          00035660
             B02.PAÅ(I,J)                 = W_PAÅ;                      00035670
             B02.STATUS.VIRK_DATO_ÅM(I)   = AUTODATO_ÅM;                00035680
             IF W_PAÅ > B02.YRKEPENS.YPT(I) THEN                        00035690
                DO;                                                     00035700
                   TRANS_OPPL_OMR.TRANSTYPE     = 38;                   00035710
                   B02.YRKEPENS.YPT(I) = W_PAÅ;                         00035720
                   B02.YRKEPENS.YPT_KODE(I) = 'Y';                      00035730
                END;                                                    00035740
                                                                        00035750
             ELSE                                                       00035760
                TRANS_OPPL_OMR.TRANSTYPE     = 72;                      00035770
                                                                        00035780
             TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);        00035790
             TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);    00035800
             HENDELSE_IND                 = JA;                         00035810
             SØKER_IND                    = I;                          00035820
             I                            = I + 1;                      00035830
                                                                        00035840
             IF I = 1 THEN                                              00035850
                I_EK = 2;                                               00035860
             ELSE                                                       00035870
                I_EK = 1;                                               00035880
                                                                        00035890
             IF B01.STATUS.VIRK_DATO_ÅM (I_EK) > 0  &                   00035900
                B01.STATUS_KODE_HIST    (I_EK) = ' '   THEN             00035910
                                                                        00035920
                B02.STATUS.VIRK_DATO_ÅM (I_EK) = AUTODATO_ÅM;           00035930
                                                                        00035940
             DO W_IND = 3 TO 13;                                        00035950
                                                                        00035960
                IF B01.STATUS.VIRK_DATO_ÅM (W_IND) > 0  THEN            00035970
                   B02.STATUS.VIRK_DATO_ÅM (W_IND) = AUTODATO_ÅM;       00035980
                ELSE                                                    00035990
                   W_IND = 13;                                          00036000
                                                                        00036010
             END;                                                       00036020
                                                                        00036030
           END;                                                         00036040
                                                                        00036050
                                                                        00036060
        END YRKESSKADE_ELEV;                                            00036070
                                                                        00036080
                                                                        00036090
 SATSENDRING:                                                           00036100
   PROC;                                                                00036110
                                                                        00036120
   /** DERSOM VI TIDLIGERE I AUTOHENDELSE-BEREGNINGEN HAR SPLITTET  **/ 00036130
   /** EN FAMILIE - UFØRT BARN FYLTE  18 ÅR - SÅ MÅ VI HER KUNNE    **/ 00036140
   /** FORBEREDE NY BEREGNING FOR BÅDE BARNEKULLET OG DEN UFØRE.    **/ 00036150
                                                                        00036160
   DCL                                                                  00036170
     I      FIXED BIN(15);                                              00036180
                                                                        00036190
   /* DETTE LÅ TIL SLUTT I DENNE RUTINEN. G-ENDRINGER ER IKKE */        00036200
   /* KOMMET MED PÅ FAI FOR DENNE ALDERSGRUPPEN. TRUDE, 040193 */       00036210
                                                                        00036220
  /* TESTING*/                                                          00036230
  DCL TS_FAI  FIXED DEC (5) INIT (0);                                   00036240
  DCL TS_FAI2 FIXED DEC (5) INIT (0);                                   00036250
  DCL TS_GG  FIXED DEC (5) INIT (0);                                    00036260
  DCL TS_GN  FIXED DEC (5) INIT (0);                                    00036270
  DCL TS_FNR PIC  '(11)9';                                              00036280
  TS_GG   = G_FØR;                                                      00036290
  TS_GN   = G_NÅ;                                                       00036300
   DO I = 1 TO 2; /* HL 0395 - X 2,SAMT AT SØKER_IND ER ENDRET TIL I */ 00036310
   W_FNR                  = B02.RF0PERSN.FNR(I);                        00036320
   TS_FNR  = W_FNR;                                                     00036330
   W_FNR_ÅM               = FNR_R.ÅR!!FNR_R.MND;                        00036340
   IF (W_FNR_ÅM                > 2500   &                               00036350
       FNR_R.ÅRHUNDRE          < 5      &                               00036360
       B01.KONV_P_KODE(I) ^= 'K' ) !                                    00036370
                                                                        00036380
      (B01.KONV_P_KODE(I)            = 'K'  !                           00036390
       B01.PENSJONSTYPE1(I)          = 'K'  &                           00036400
       B01.UTTAKSDATO_ÅM(I) > 9200 )          THEN                      00036410
        DO;                                                             00036420
          IF (B01.ALDERSP.FAI(I) > 0)  /*   &                           00036430
             (B01.G_DATO_ÅM(I) < AUTODATO_ÅM) */     THEN               00036440
             /*FEIL NR 1 HL */                                          00036450
           DO;                                                          00036460
             TS_FAI  = B01.ALDERSP.FAI(I);                              00036470
             TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR(I);           00036480
             TRANS_OPPL_OMR.TRANSTYPE          = 27; /* SATSENDRING */  00036490
             TRANS_OPPL_OMR.VIRKNINGSDATO =                             00036500
                                   F_SNU_DATO(AUTODATO_ÅM);             00036510
             HENDELSE_IND = JA;                                         00036520
             FIXED_DEC5 = (B02.ALDERSP.FAI(I)                           00036530
                                         * G_NÅ/G_FØR);                 00036540
             TS_FAI2  =  FIXED_DEC5;                                    00036550
             B02.ALDERSP.FAI(I) = FIXED_DEC5;                           00036560
           END;                                                         00036570
        END;                                                            00036580
      /* TRUDE TIL HIT 040193 */                                        00036590
     END; /* DO I = 1 TO 2 HL 0395 */                                   00036600
                                                                        00036610
     DO I = 1 TO 2;                                                     00036620
       IF B01.STATUS.PENSJONSTYPE1(I) = 'A' !                           00036630
          B01.STATUS.PENSJONSTYPE1(I) = 'E' !                           00036640
          B01.STATUS.PENSJONSTYPE1(I) = 'J' !                           00036650
          B01.STATUS.PENSJONSTYPE1(I) = 'K' !                           00036660
          B01.STATUS.PENSJONSTYPE1(I) = 'Y' !                           00036670
          B01.STATUS.PENSJONSTYPE1(I) = 'U' THEN                        00036680
         DO;                                                            00036690
           TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR(I);             00036700
           TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */            00036710
           TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);      00036720
           HENDELSE_IND = JA;                                           00036730
                                                                        00036740
           IF I = 1 THEN                                                00036750
             DO;                                                        00036760
               SØKER_IND   = 1;                                         00036770
               FAMILIE_IND = 2;                                         00036780
             END;                                                       00036790
           ELSE                                                         00036800
             DO;                                                        00036810
               SØKER_IND   = 2;                                         00036820
               FAMILIE_IND = 1;                                         00036830
             END;                                                       00036840
                                                                        00036850
           IF B01.ETTEPENS.FORVENTET(I) > 0        &                    00036860
              B01.GT_TILLEGG_LOV92(I) = 0          THEN                 00036870
             DO;                                                        00036880
               FIXED_DEC5 = (B02.ETTEPENS.FORVENTET(I) * G_NÅ/G_FØR);   00036890
                                                                        00036900
               B02.ETTEPENS.FORVENTET(I) = FIXED_DEC5;                  00036910
             END;                                                       00036920
                                                                        00036930
             /*---------------------------------------------------- */  00036940
             /*VI MÅ RULLERE FORSI-INNTEKTER OG ALDERSP.FAI         */  00036950
             /*REGELENDRINGER 0591 OG 0192 . TRUDE 240492           */  00036960
             /*---------------------------------------------------- */  00036970
                                                                        00036980
           IF B01.FORSI.ARBEIDSINNTEKT(I) > 0 THEN                      00036990
             DO;                                                        00037000
               FIXED_DEC5 = (B02.FORSI.ARBEIDSINNTEKT(I) * G_NÅ/G_FØR); 00037010
               B02.FORSI.ARBEIDSINNTEKT(I) = FIXED_DEC5;                00037020
             END;                                                       00037030
                                                                        00037040
           IF B01.FORSI.PENSJONSINNTEKT(I) > 0 THEN                     00037050
             DO;                                                        00037060
               FIXED_DEC5 = (B02.FORSI.PENSJONSINNTEKT(I) * G_NÅ/G_FØR);00037070
               B02.FORSI.PENSJONSINNTEKT(I) = FIXED_DEC5;               00037080
             END;                                                       00037090
                                                                        00037100
           IF B01.FORSI.ARBEIDSINNTEKT_EK(I) > 0 THEN                   00037110
             DO;                                                        00037120
              FIXED_DEC5 = (B02.FORSI.ARBEIDSINNTEKT_EK(I)              00037130
                                   * G_NÅ/G_FØR);                       00037140
              B02.FORSI.ARBEIDSINNTEKT_EK(I) = FIXED_DEC5;              00037150
             END;                                                       00037160
                                                                        00037170
           IF B01.FORSI.PENSJONSINNTEKT_EK(I) > 0 THEN                  00037180
             DO;                                                        00037190
               FIXED_DEC5 = (B02.FORSI.PENSJONSINNTEKT_EK(I)            00037200
                                  * G_NÅ/G_FØR);                        00037210
               B02.FORSI.PENSJONSINNTEKT_EK(I) = FIXED_DEC5;            00037220
             END;                                                       00037230
                                                                        00037240
             /*---------------------------------------------------- */  00037250
             /*VI MÅ RULLERE UFØRPENS.INNTEKT_FØR_UP                */  00037260
             /*NYTT FELT FRA JULI 94. TRUDE 060794                  */  00037270
             /*---------------------------------------------------- */  00037280
      /*   IF B01.INNTEKT_FØR_UP(I) > 0 THEN                            00037290
             DO;                                                        00037300
               FIXED_DEC5 = (B02.INNTEKT_FØR_UP(I) * G_NÅ/G_FØR);       00037310
               B02.INNTEKT_FØR_UP(I) = FIXED_DEC5;                      00037320
             END;                                                       00037330
         *** */                                                         00037340
             /* G_RULLERING VEDR. FAI FLYTTES FØRST I RUTINEN*/         00037350
             /* TRUDE, 040193                                */         00037360
                                                                        00037370
      /*   I = 2;       9803 HL */                                      00037380
         END;                                                           00037390
     END;      /** DO I = 1 TO 2  **/                                   00037400
                                                                        00037410
     IF TRANS_OPPL_OMR.TRANSTYPE = 0 THEN                               00037420
       DO;                                                              00037430
                                                                        00037440
         /*  FINNE YNGSTE BARN      */                                  00037450
         DO J = 3 TO 14 UNTIL(B01.STATUS.PENSJONSTYPE2(J) = 'P');       00037460
                                                                        00037470
         END;                                                           00037480
                                                                        00037490
         IF B01.STATUS.PENSJONSTYPE2(J) = 'P'   THEN                    00037500
                                                                        00037510
           DO;                                                          00037520
             TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR(J);           00037530
             TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */          00037540
             TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);    00037550
             HENDELSE_IND = JA;  /*TRUDE 190692 ????? */                00037560
             SØKER_IND = J;                                             00037570
                                                                        00037580
          LOOP2:                                                        00037590
             DO K = 1 TO 13 WHILE(B01.FNR_TILKN(1,K) > 0);              00037600
               IF B01.TILKN.TILKNYTNINGSKODE(1,K) = 'D' THEN            00037610
                 DO;                                                    00037620
                   PIC11 =  B01.TILKN.FNR_TILKN(1,K);                   00037630
                   IF F_KJØNN(PIC11) = 'K' THEN                         00037640
                     FAMILIE_IND = 1;                                   00037650
                   ELSE                                                 00037660
                     FAMILIE_IND = 2;                                   00037670
                   LEAVE LOOP2;                                         00037680
                 END;                                                   00037690
             END;                                                       00037700
                                                                        00037710
           END;   /** DO IF B01.STATUS.PENSJONSTYPE2(J) = P   **/       00037720
                                                                        00037730
         IF UFØR_BARN_IND > 0 & TRANSTYPE2 = 0 THEN                     00037740
            DO;                                                         00037750
                                                                        00037760
                                                                        00037770
           TRANSTYPE2 = 27;                                             00037780
                                                                        00037790
                                                                        00037800
           END;                                                         00037810
                                                                        00037820
       END;   /** DO IF TRANS_OPPL_OMR.TRANSTYPE = 0  **/               00037830
                                                                        00037840
 END SATSENDRING;                                                       00037850
                                                                        00037860
                                                                        00037870
 FINNE_SISTE_UFT_ÅM:                                                    00037880
   PROC(IND) RETURNS(FIXED BIN(15));                                    00037890
   DCL                                                                  00037900
     IND    FIXED BIN(15),                                              00037910
     SISTE  FIXED BIN(15);                                              00037920
                                                                        00037930
     /** FINNE SISTE UTFYLLTE UFT_ÅM   **/                              00037940
   /*0697 HL:*/                                                         00037950
     DO J = 7 TO 1 BY -1 UNTIL(B01.UFØRHIST.UFT_ÅM                      00037960
                                  (IND,J) > 0);                         00037970
       SISTE = J;                                                       00037980
     END;                                                               00037990
                                                                        00038000
     RETURN(SISTE);                                                     00038010
                                                                        00038020
 END FINNE_SISTE_UFT_ÅM;                                                00038030
                                                                        00038040
                                                                        00038050
        FINNE_SISTE_YUFT_ÅM:                                            00038060
          PROC(IND) RETURNS(FIXED BIN(15));                             00038070
          DCL                                                           00038080
            IND    FIXED BIN(15),                                       00038090
            SISTE  FIXED BIN(15);                                       00038100
                                                                        00038110
            /** FINNE SISTE UTFYLTE YUFT_ÅM   **/                       00038120
            DO J = 5 TO 1 BY -1 UNTIL(B01.YRKEHIST.YUFT_ÅM              00038130
                                         (IND,J) > 0);                  00038140
              SISTE = J;                                                00038150
            END;                                                        00038160
                                                                        00038170
            RETURN(SISTE);                                              00038180
                                                                        00038190
        END FINNE_SISTE_YUFT_ÅM;                                        00038200
                                                                        00038210
        /*NY PROC 0892 TRUDE PGA DØDE UFØRE FØR 24 ÅR FØDT < 43 */      00038220
  UF_DØD:                                                               00038230
    PROC(I_EK);                                                         00038240
                                                                        00038250
   DCL                                                                  00038260
     I_EK           FIXED BIN(15),                                      00038270
     SISTE_BUP_EK   FIXED BIN(15);                                      00038280
                                                                        00038290
   DCL HJ_FNR    PIC  '(11)9';                                          00038300
   DCL  1 R_FNR DEF HJ_FNR,                                             00038310
          2  R_FNR_DAG         PIC '99',                                00038320
          2  R_FNR_MND         PIC '99',                                00038330
          2  R_FNR_ÅR          PIC '99',                                00038340
          2  R_FNR_ÅRHUNDRE    PIC '9',                                 00038350
          2  R_FNR_REST  PIC '(4)9';                                    00038360
                                                                        00038370
     IF I = 1 THEN                                                      00038380
       I_EK = 2;                                                        00038390
     ELSE                                                               00038400
       I_EK = 1;                                                        00038410
                                                                        00038420
     HJ_FNR  = B02.FNR(I_EK);                                           00038430
                                                                        00038440
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                00038450
     B02.STATUS.VIRK_DATO_ÅM   (I)    = AUTODATO_ÅM;                    00038460
                                                                        00038470
     IF B01.RF0PERSN.FNR(I_EK) > 0 THEN                                 00038480
       DO;                                                              00038490
         B02.STATUS.VIRK_DATO_ÅM   (I_EK) = AUTODATO_ÅM;                00038500
         TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);        00038510
                                                                        00038520
         /** FINNE SISTE UTFYLLTE BUP_GAR_KODE FOR EK   **/             00038530
                                                                        00038540
     /*0697 HL:*/                                                       00038550
         DO J = 7 TO 1 BY -1 UNTIL(B01.UFØRHIST.BUP_GAR_KODE            00038560
                                      (I_EK,J) ^= ' ');                 00038570
           SISTE_BUP_EK = J;                                            00038580
         END;                                                           00038590
                                                                        00038600
        IF  B01.UFØRHIST.BUP_GAR_KODE(I_EK,SISTE_BUP_EK) = 'E'  !       00038610
            B01.UFØRHIST.BUP_GAR_KODE(I_EK,SISTE_BUP_EK) = 'D' THEN     00038620
          DO;                                                           00038630
                                                                        00038640
          IF AUTODATO_ÅM = 8907   THEN                                  00038650
            DO;                                                         00038660
  /*9708      B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 1.6;*/      00038670
              DO K = 1 TO SISTE_BUP_EK;                                 00038680
                 B02.UFØRHIST.BUP_GAR_KODE(I_EK,K) = 'E';               00038690
              END;                                                      00038700
              B02.VIRK_DATO_ÅM(I_EK)   = AUTODATO_ÅM;                   00038710
              B02.VIRK_DATO_ÅM(I)   = AUTODATO_ÅM;                      00038720
              HENDELSE_IND     = JA;                                    00038730
              FAMILIE_IND      = I;                                     00038740
              IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                     00038750
                 CALL BARN_18ÅR(I);                                     00038760
              IF TRANS_OPPL_OMR.TRANSTYPE  = 27  THEN                   00038770
                DO;                                                     00038780
                  SØKER_IND  =  I;                                      00038790
                  EKTEF_IND  = 3 - I;                                   00038800
                END;                                                    00038810
              ELSE                                                      00038820
                      DO;                                               00038830
                        FAMILIE_IND   = I;                              00038840
                        TRANS_OPPL_OMR.TRANSTYPE  = 7;                  00038850
                      END;                                              00038860
            END;                                                        00038870
                                                                        00038880
  /*TRUD*/   IF AUTODATO_ÅM = 9101   &                                  00038890
                R_FNR_ÅR    >  24    THEN                               00038900
                 DO;                                                    00038910
 /* 9708          B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 2.00;*/ 00038920
                   DO K = 1 TO SISTE_BUP_EK;                            00038930
                      B02.UFØRHIST.BUP_GAR_KODE(I_EK,K) = 'E';          00038940
                   END;                                                 00038950
                   B02.VIRK_DATO_ÅM(I_EK)   = AUTODATO_ÅM;              00038960
                   B02.VIRK_DATO_ÅM(I)   = AUTODATO_ÅM;                 00038970
                   HENDELSE_IND     = JA;                               00038980
                   FAMILIE_IND      = I;                                00038990
                   TRANS_OPPL_OMR.TRANSTYPE  = 7;                       00039000
                   IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                00039010
                     CALL BARN_18ÅR(I);                                 00039020
                 END;                                                   00039030
                                                                        00039040
  /*TRUD*/  ELSE IF AUTODATO_ÅM = 9201   &                              00039050
              R_FNR_ÅR   >  25    THEN                                  00039060
               DO;                                                      00039070
 /* 9708         B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 2.50;*/  00039080
                   DO K = 1 TO SISTE_BUP_EK;                            00039090
                      B02.UFØRHIST.BUP_GAR_KODE(I_EK,K) = 'E';          00039100
                   END;                                                 00039110
                   B02.VIRK_DATO_ÅM(I_EK)   = AUTODATO_ÅM;              00039120
                   B02.VIRK_DATO_ÅM(I)   = AUTODATO_ÅM;                 00039130
                   HENDELSE_IND     = JA;                               00039140
                   FAMILIE_IND      = I;                                00039150
                   IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                00039160
                     CALL BARN_18ÅR(I);                                 00039170
                   IF TRANS_OPPL_OMR.TRANSTYPE  = 27  THEN              00039180
                     DO;                                                00039190
                       SØKER_IND  =  I;                                 00039200
                       EKTEF_IND  = 3 - I;                              00039210
                     END;                                               00039220
                   ELSE                                                 00039230
                      DO;                                               00039240
                        FAMILIE_IND   = I;                              00039250
                        TRANS_OPPL_OMR.TRANSTYPE  = 7;                  00039260
                      END;                                              00039270
                 END;                                                   00039280
                                                                        00039290
             ELSE IF AUTODATO_ÅM = 9205   &                             00039300
                  R_FNR_ÅR       > 25     THEN                          00039310
               DO;                                                      00039320
 /*9708         B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 3.0;*/    00039330
                   DO K = 1 TO SISTE_BUP_EK;                            00039340
                      B02.UFØRHIST.BUP_GAR_KODE(I_EK,K) = 'E';          00039350
                   END;                                                 00039360
                   B02.VIRK_DATO_ÅM(I_EK)   = AUTODATO_ÅM;              00039370
                   B02.VIRK_DATO_ÅM(I)   = AUTODATO_ÅM;                 00039380
                   HENDELSE_IND     = JA;                               00039390
                   FAMILIE_IND      = I;                                00039400
                   IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                00039410
                     CALL BARN_18ÅR(I);                                 00039420
                   IF TRANS_OPPL_OMR.TRANSTYPE  = 27  THEN              00039430
                     DO;                                                00039440
                       SØKER_IND  =  I;                                 00039450
                       EKTEF_IND  = 3 - I;                              00039460
                     END;                                               00039470
                   ELSE                                                 00039480
                      DO;                                               00039490
                        FAMILIE_IND   = I;                              00039500
                        TRANS_OPPL_OMR.TRANSTYPE  = 7;                  00039510
                      END;                                              00039520
                 END;                                                   00039530
                                                                        00039540
             ELSE IF AUTODATO_ÅM = 9705   &                             00039550
                  R_FNR_ÅR       > 30                     THEN          00039560
 /*9708  B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) ^= 3.3 THEN */     00039570
               DO;                                                      00039580
 /*9708         B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 3.3;*/    00039590
                   DO K = 1 TO SISTE_BUP_EK;                            00039600
                      B02.UFØRHIST.BUP_GAR_KODE(I_EK,K) = 'E';          00039610
                   END;                                                 00039620
                   B02.VIRK_DATO_ÅM(I_EK)   = AUTODATO_ÅM;              00039630
                   B02.VIRK_DATO_ÅM(I)   = AUTODATO_ÅM;                 00039640
                   HENDELSE_IND     = JA;                               00039650
                   FAMILIE_IND      = I;                                00039660
                   IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                00039670
                     CALL BARN_18ÅR(I);                                 00039680
                   IF TRANS_OPPL_OMR.TRANSTYPE  = 27  THEN              00039690
                     DO;                                                00039700
                       SØKER_IND  =  I;                                 00039710
                       EKTEF_IND  = 3 - I;                              00039720
                     END;                                               00039730
                   ELSE                                                 00039740
                      DO;                                               00039750
                        FAMILIE_IND   = I;                              00039760
                        TRANS_OPPL_OMR.TRANSTYPE  = 7;                  00039770
                      END;                                              00039780
                 END;                                                   00039790
                                                                        00039800
             ELSE IF AUTODATO_ÅM = 9707   &                             00039810
                  R_FNR_ÅR       > 30       THEN      /*0897 HL*/       00039820
               DO;                                                      00039830
                 IF R_FNR_ÅR = 41   !                                   00039840
                    R_FNR_ÅR = 42                 THEN                  00039850
                    DO;                                                 00039860
                       B02.TP_GAR_KODE (I_EK) = ' ';                    00039870
                       DO K = 1 TO SISTE_BUP_EK;                        00039880
                          B02.UFØRHIST.BUP_GAR_KODE(I_EK,K) = 'B';      00039890
                          B02.UFØRHIST.BUP_GARANTI (I_EK,K) = 3.30;     00039900
                       END;                                             00039910
                    END;                                                00039920
                 ELSE                                                   00039930
                    DO K = 1 TO SISTE_BUP_EK;                           00039940
                       B02.UFØRHIST.BUP_GAR_KODE(I_EK,K) = 'E';         00039950
                    END;                                                00039960
                   B02.VIRK_DATO_ÅM(I_EK)   = AUTODATO_ÅM;              00039970
                   B02.VIRK_DATO_ÅM(I)   = AUTODATO_ÅM;                 00039980
                   HENDELSE_IND     = JA;                               00039990
                   FAMILIE_IND      = I;                                00040000
                   IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                00040010
                     CALL BARN_18ÅR(I);                                 00040020
                   IF TRANS_OPPL_OMR.TRANSTYPE  = 27  THEN              00040030
                     DO;                                                00040040
                       SØKER_IND  =  I;                                 00040050
                       EKTEF_IND  = 3 - I;                              00040060
                     END;                                               00040070
                   ELSE                                                 00040080
                      DO;                                               00040090
                        FAMILIE_IND   = I;                              00040100
                        TRANS_OPPL_OMR.TRANSTYPE  = 7;                  00040110
                      END;                                              00040120
                 END;                                                   00040130
                                                                        00040140
             IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN                   00040150
               CALL BARN_18ÅR(I_EK);                                    00040160
                                                                        00040170
           END;                                                         00040180
       END;                                                             00040190
                                                                        00040200
     IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                              00040210
        CALL BARN_18ÅR(I);                                              00040220
                                                                        00040230
 END UF_DØD;                                                            00040240
  /*9708 HL : */                                                        00040250
 UNG_DØD_D:                                                             00040260
   PROC(I,SISTE,ALDER_UF_DØD);                                          00040270
    DCL I         FIXED BIN (15);                                       00040280
    DCL SISTE     FIXED BIN (15);                                       00040290
    DCL ALDER_UF_DØD             PIC 'S99999';                          00040300
                                                                        00040310
 /*DØDE MED BUP_GAR_KODE = 'D' - VENTER På RETT */                      00040320
                                                                        00040330
   IF AUTODATO_ÅM = 8105         THEN                                   00040340
      DO;                                                               00040350
         IF ALDER_UF_DØD < 2001             THEN                        00040360
            DO;                                                         00040370
               IF FNR_R.ÅR > 46                   THEN                  00040380
                  DO;                                                   00040390
                     B02.BUP_GAR_KODE(I,SISTE) = 'B';                   00040400
                     B02.BUP_GARANTI (I,SISTE) = 2.00;                  00040410
                  END;                                                  00040420
            END;                                                        00040430
      END;                                                              00040440
   ELSE                                                                 00040450
   IF AUTODATO_ÅM = 8401         THEN                                   00040460
      DO;                                                               00040470
         IF ALDER_UF_DØD < 2101                    THEN                 00040480
            DO;                                                         00040490
               IF FNR_R.ÅR > 45                   THEN                  00040500
                  DO;                                                   00040510
                     B02.BUP_GAR_KODE(I,SISTE) = 'B';                   00040520
                     B02.BUP_GARANTI (I,SISTE) = 2.00;                  00040530
                  END;                                                  00040540
            END;                                                        00040550
      END;                                                              00040560
   ELSE                                                                 00040570
   IF AUTODATO_ÅM = 8901         THEN                                   00040580
      DO;                                                               00040590
         IF ALDER_UF_DØD < 2201                    THEN                 00040600
            DO;                                                         00040610
               IF FNR_R.ÅR > 44                   THEN                  00040620
                  DO;                                                   00040630
                     B02.BUP_GAR_KODE(I,SISTE) = 'B';                   00040640
                     B02.BUP_GARANTI (I,SISTE) = 3.00;                  00040650
                  END;                                                  00040660
            END;                                                        00040670
      END;                                                              00040680
   ELSE                                                                 00040690
   IF AUTODATO_ÅM = 8907         THEN                                   00040700
      DO;                                                               00040710
         IF ALDER_UF_DØD < 2201                     THEN                00040720
            DO;                                                         00040730
               IF FNR_R.ÅR > 22   &                                     00040740
                  FNR_R.ÅR < 45                   THEN                  00040750
                  DO;                                                   00040760
                     B02.BUP_GAR_KODE(I,SISTE) = 'E';                   00040770
                  END;                                                  00040780
            END;                                                        00040790
      END;                                                              00040800
   ELSE                                                                 00040810
   IF AUTODATO_ÅM = 9205         THEN                                   00040820
      DO;                                                               00040830
         IF ALDER_UF_DØD < 2401                  THEN                   00040840
            DO;                                                         00040850
               IF FNR_R.ÅR > 42                   THEN                  00040860
                  DO;                                                   00040870
                     B02.BUP_GAR_KODE(I,SISTE) = 'B';                   00040880
                     B02.BUP_GARANTI (I,SISTE) = 3.30;                  00040890
                  END;                                                  00040900
               ELSE                                                     00040910
               IF FNR_R.ÅR > 25                   THEN                  00040920
                  B02.BUP_GAR_KODE(I,SISTE) = 'E';                      00040930
            END;                                                        00040940
      END;                                                              00040950
   ELSE                                                                 00040960
   IF AUTODATO_ÅM = 9707         THEN                                   00040970
      DO;                                                               00040980
         IF ALDER_UF_DØD < 2601                 THEN                    00040990
            IF FNR_R.ÅR > 40                   THEN                     00041000
               DO;                                                      00041010
                  B02.BUP_GAR_KODE(I,SISTE) = 'B';                      00041020
                  B02.BUP_GARANTI (I,SISTE) = 3.30;                     00041030
                  B02.TP_GAR_KODE (I)       = ' ';                      00041040
               END;                                                     00041050
            ELSE                                                        00041060
            IF FNR_R.ÅR > 30                   THEN                     00041070
               B02.BUP_GAR_KODE(I,SISTE) = 'E';                         00041080
      END;                                                              00041090
 END UNG_DØD_D;                                                         00041100
                                                                        00041110
 /*KONSOLIDERING AV DSF*/                                               00041120
 /*FEIL 5 OG FEIL 1 - FEIL I RULLERING - 9802 HL :  */                  00041130
                                                                        00041140
 SKAL_INNTEKTER_RULLERES:                                               00041150
 PROC(FIXED_DEC4);                                                      00041160
                                                                        00041170
 DCL FIXED_DEC4             FIXED DEC (4);                              00041180
                                                                        00041190
 DO I = 1 TO 2;                                                         00041200
    IF B02.ETTEPENS.FORVENTET(I) > 0   THEN                             00041210
       CALL RULL_FORVENTET(B01.G_DATO_ÅM(SØKER_IND),                    00041220
                             FIXED_DEC4,                                00041230
                             B02.ETTEPENS.FORVENTET(I));                00041240
                                                                        00041250
    IF B02.ALDERSP.FAI(I) > 0   THEN                                    00041260
       CALL RULL_FAI(B01.G_DATO_ÅM(SØKER_IND),                          00041270
                     FIXED_DEC4,                                        00041280
                     B02.ALDERSP.FAI(I));                               00041290
                                                                        00041300
    IF B02.FORSI.PENSJONSINNTEKT(I) > 0  THEN                           00041310
       B02.FORSI.PENSJONSINNTEKT(I) =                                   00041320
           F_RULL_FORSI(B01.G_DATO_ÅM(SØKER_IND),                       00041330
                 FIXED_DEC4,                                            00041340
                 B02.FORSI.PENSJONSINNTEKT(I));                         00041350
                                                                        00041360
    IF B02.FORSI.ARBEIDSINNTEKT(I) > 0  THEN                            00041370
       B02.FORSI.ARBEIDSINNTEKT(I) =                                    00041380
           F_RULL_FORSI(B01.G_DATO_ÅM(SØKER_IND),                       00041390
                 FIXED_DEC4,                                            00041400
                 B02.FORSI.ARBEIDSINNTEKT(I));                          00041410
                                                                        00041420
    IF B02.FORSI.PENSJONSINNTEKT_EK(I) > 0  THEN                        00041430
       B02.FORSI.PENSJONSINNTEKT_EK(I) =                                00041440
           F_RULL_FORSI(B01.G_DATO_ÅM(SØKER_IND),                       00041450
                  FIXED_DEC4,                                           00041460
                  B02.FORSI.PENSJONSINNTEKT_EK(I));                     00041470
                                                                        00041480
    IF B02.FORSI.ARBEIDSINNTEKT_EK(I) > 0  THEN                         00041490
       B02.FORSI.ARBEIDSINNTEKT_EK(I) =                                 00041500
           F_RULL_FORSI(B01.G_DATO_ÅM(SØKER_IND),                       00041510
                 FIXED_DEC4,                                            00041520
                 B02.FORSI.ARBEIDSINNTEKT_EK(I));                       00041530
                                                                        00041540
  END;                                                                  00041550
  END SKAL_INNTEKTER_RULLERES;                                          00041560
                                                                        00041570
 % INCLUDE R0019902;   /*    FINNE KJØNN                  */            00041580
 %PAGE;                                                                 00041590
 % INCLUDE R0019905;   /*    FINNE ALDER                  */            00041600
 %PAGE;                                                                 00041610
 % INCLUDE R0019913;   /*    F_SNU_DATO                   */            00041620
 %PAGE;                                                                 00041630
 % INCLUDE R0019934;   /*    OPPHØR_KOBLING_TO_PERSONER   */            00041640
 %PAGE;                                                                 00041650
 % INCLUDE R0019938;   /*    ETTERLATTEPENSJON_OPPHØRER   */            00041660
 %PAGE;                                                                 00041670
 % INCLUDE R0019966;   /*    AFP_NULL_OPPHØRER            */            00041680
 %PAGE;                                                                 00041690
      %INCLUDE R0019954;   /*RULL_FORVENTET*/                           00041700
      %INCLUDE R0019967;   /*RULL_FAI*/                                 00041710
      %INCLUDE R0019968;   /*F_RULL_FORSI*/                             00041720
                                                                        00041730
 END R001490;                                                           00041740
