 /*       SIST ENDRET 04/09-90 12.52.48 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 29/03-88 13.14.24 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 12/01-87 09.17.57 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 11/07-85 14.00.29 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 08/07-85 09.44.04 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 23/10-83 13.01.48 AV   OLAV                     */00000050
 /*       SIST ENDRET 20/10-83 12.34.29 AV   OLAV                     */00000060
 /*       SIST ENDRET 22/03-83 09.55.26 AV   DYBVIK                   */00000070
 /* **************************************************************** */ 00000080
 /* IDENTIFIKASJON:   R0017022                                       */ 00000090
 /* PROGRAMMERER:  HELEN    JULI, 1982                              */  00000100
 /* HENSIKT:                                                         */ 00000110
 /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT     */ 00000120
 /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER         */ 00000130
 /*        HVER AJOURFØRT TRANSAKSJON.                               */ 00000140
 /* PROGRAMTILKNYTNING:                                              */ 00000150
 /*        PROGRAMMET KALLES OPP AV R0017001                         */ 00000160
 /*                                                                  */ 00000170
 /* **************************************************************** */ 00000180
 LAG_BARNEP_EN_HEND:                                                    00000190
      PROC (B_IND) ;                                                    00000200
  EXEC CICS ADDRESS EIB(DFHEIPTR);                                      00000210
 DCL  B_IND        FIXED BIN(15);                                       00000220
 DCL  IND          FIXED BIN(15);                                       00000230
 DCL  EKIND        FIXED BIN(15);                                       00000240
 DCL  Y_BARN_IND   FIXED BIN(15);                                       00000250
                                                                        00000260
 /* **************************************************************** */ 00000270
 /* PROGRAMMET BEGYNNER HER.                                         */ 00000280
 /* VI BLANKER W_HENDELSE OG  FINNER YNGSTE BARN.                    */ 00000290
 /* **************************************************************** */ 00000300
                                                                        00000310
    W_HENDELSE            = '';                                         00000320
    DO IND = 3 TO 14;                                                   00000330
  /*  ENDRET 09.02.88 SATISH                                   */       00000340
  /*   IF B02.PERSON.STATUS.PENSJONSTYPE2(IND) = 'Y' THEN     */        00000350
  /*  HIT TIL 09.02.88                                        */        00000360
                                                                        00000370
       IF B02.PERSON.STATUS.PENSJONSTYPE2(IND) = 'P' &                  00000380
         (B02.PERSON.STATUS.PENSJONSTYPE1(IND) = 'B' !                  00000390
          B02.PERSON.STATUS.PENSJONSTYPE1(IND) = 'N') THEN              00000400
          DO;                                                           00000410
             Y_BARN_IND = IND;                                          00000420
             IND = 14;                                                  00000430
          END;                                                          00000440
    END;                                                                00000450
                                                                        00000460
    OMR_DATO                = F_SNU_DATO(TRANS_OPPL_OMR.VIRKNINGSDATO); 00000470
    IF TRANS_OPPL_OMR.TRANSTYPE = 27 THEN                               00000480
       DO;                                                              00000490
          HENDDATO  =  OMR_DATO;                                        00000500
       END;                                                             00000510
                                                                        00000520
    ELSE                                                                00000530
                                                                        00000540
       DO;                                                              00000550
          R_HENDDATO_D    =  B02.PERSON.STATUS.VIRK_DATO_ÅM(B_IND);     00000560
          HENDDATO        =  R_HENDDATO.AAR !!R_HENDDATO.MND;           00000570
       END;                                                             00000580
                                                                        00000590
    W_HENDELSE.VERSJON       =    W_ROT.NESTE_SB_VERSJON_NR;            00000600
    W_HENDELSE.TERMINAL      =    EIBTRMID;                             00000610
    W_HENDELSE.PENSJONSTYPE1 = B02.STATUS.PENSJONSTYPE1(B_IND);         00000620
    W_HENDELSE.PENSJONSTYPE2 = B02.STATUS.PENSJONSTYPE2(B_IND);         00000630
    W_HENDELSE.PENSJONSTYPE3 = B02.STATUS.PENSJONSTYPE3(B_IND);         00000640
                                                                        00000650
    IF B02.PERSON.STATUS.PENSJONSTYPE3(B_IND) = 'U'     THEN            00000660
                                                                        00000670
       DO;                                                              00000680
          W_HENDELSE.GP_BRUTTO = B02.PERSON.UFØRPENS.GP(B_IND);         00000690
          W_HENDELSE.GP_NETTO  = B02.PERSON.UFØRPENS.GP(B_IND);         00000700
          W_HENDELSE.TP_BRUTTO = B02.PERSON.UFØRPENS.TP(B_IND);         00000710
          W_HENDELSE.TP_NETTO  = B02.PERSON.UFØRPENS.TP(B_IND);         00000720
          W_HENDELSE.ST        = B02.PERSON.UFØRPENS.ST(B_IND);         00000730
          W_HENDELSE.KT        = B02.PERSON.UFØRPENS.KT(B_IND);         00000740
          W_HENDELSE.UF_GRAD   = B02.PERSON.UFØRPENS.UFG(B_IND);        00000750
       END;                                                             00000760
                                                                        00000770
    ELSE                                                                00000780
                                                                        00000790
       DO;                                                              00000800
          W_HENDELSE.GP_BRUTTO  =    B02.PERSON.ETTEBARN.GP(B_IND);     00000810
          W_HENDELSE.GP_NETTO   =    B02.PERSON.ETTEBARN.GP(B_IND);     00000820
       END;                                                             00000830
                                                                        00000840
    W_HENDELSE.ANTALL_BARN = B02.PERSON.STATUS.ANTALL_BARN(Y_BARN_IND); 00000850
    W_HENDELSE.ANTALL_BARN_TIDL = B01.PERSON.STATUS.ANTALL_BARN(3);     00000860
    W_HENDELSE.TT          = B02.PERSON.STATUS.TT_ANV(B_IND);           00000870
    W_HENDELSE.BOSATT      = B02.BOSATT(B_IND); /*JD 08.90*/            00000880
                                                                        00000890
    /* ENDRET 031286 BF: YNGSTE BARNS FNR LEGGES INN I HENDELSES-  */   00000900
    /*                   SEGMENTET. (DETTE SKAL BRUKES I R001NO20) */   00000910
                                                                        00000920
    W_HENDELSE.FNR_B (1)        = B02.FNR (Y_BARN_IND);                 00000930
                                                                        00000940
    IF B02.FNR(1)          > 0   THEN                                   00000950
                                                                        00000960
       DO;                                                              00000970
          W_HENDELSE.FNR_EKTEF   = B02.FNR(1);                          00000980
          W_HENDELSE.NAVN_EKTEF  = B02.NAVN(1);                         00000990
       END;                                                             00001000
                                                                        00001010
    ELSE                                                                00001020
                                                                        00001030
       DO;                                                              00001040
          W_HENDELSE.FNR_EKTEF   = B02.FNR(2);                          00001050
          W_HENDELSE.NAVN_EKTEF  = B02.NAVN(2);                         00001060
       END;                                                             00001070
                                                                        00001080
    CALL PLASSER_TEKST(B_IND,B_IND);                                    00001090
                                                                        00001100
 /* **************************************************************** */ 00001110
 /* HENDELSE SEGMENT SKRIVES UT.                                     */ 00001120
 /* **************************************************************** */ 00001130
                                                                        00001140
    CALL INSERT_HENDELSE;                                               00001150
                                                                        00001160
 END  LAG_BARNEP_EN_HEND;                                               00001170
