 /*       SIST ENDRET 25/02-97 11.47.30 AV   JDA7339                  */00000000
 /*       SIST ENDRET 11/02-97 14.17.19 AV   JDA7339                  */00000010
 /*       SIST ENDRET 04/03-96 12.51.29 AV   JDA0310                  */00000020
 /*       SIST ENDRET 06/02-96 13.08.00 AV   JDA0310                  */00000030
 /*       SIST ENDRET 10/01-96 10.45.21 AV   TSB0310                  */00000040
 /*       SIST ENDRET 12/10-95 14.19.32 AV   JDA0310                  */00000050
 /*       SIST ENDRET 18/08-94 08.45.24 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 25/07-94 13.51.45 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 11/07-94 13.09.36 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 15/03-94 13.53.42 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 25/02-94 12.58.35 AV   HERMAN                   */00000100
 /*       SIST ENDRET 23/02-94 11.05.11 AV   TRUDE                    */00000110
 /*       SIST ENDRET 22/02-94 09.41.30 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 21/02-94 13.12.07 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 21/02-94 12.00.02 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 18/02-94 10.59.05 AV   TRUDE                    */00000150
 /*       SIST ENDRET 17/02-94 13.17.27 AV   TRUDE                    */00000160
 /* ***************************************************************** */00000170
 /*IDENTIFIKASJON:                                                    */00000180
 /* **********************                                            */00000190
 /*  PROGRAM-IDENT : R0010412  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000200
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000210
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000220
 /*  PROGRAMMET BLE LAGET : DESEMBER 1982                             */00000230
 /*  ENDRINGSDATO : 31.08.89                                          */00000240
 /*  ENDRINGEN GJELDER: AFP - UNGE UFØRE FØR 1967                     */00000250
 /*  ENDRINGEN BLE UTFØRT AV : TRUDE                                  */00000260
 /*                                                                   */00000270
 /* ***************************************************************** */00000280
 /*HENSIKT:                                                           */00000290
 /* **********                                                        */00000300
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000310
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000320
 /*    FORHÅND.                                                       */00000330
 /*    ALLE MAPS HØRER INN UNDER MAPSET 'S0010T'.                     */00000340
 /*                                                                   */00000350
 /* ***************************************************************** */00000360
 /*PROGRAMTILKNYTTING:                                                */00000370
 /* ********************                                              */00000380
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010410 - FORESPØRSEL ELLER */00000390
 /*                                  FRA R0010450 - ENDRINGER.        */00000400
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000410
 /*    BRUK :                                                         */00000420
 /*    EXEC CICS XCTL PROGRAM ('R0010412') COMMAREA(KOM_OMR);         */00000430
 /*    PROGRAMMET INCLUDER :                                          */00000440
 /*               R0010506   FLYTT FRA ARB.OMRÅDE TIL MAP    AP       */00000450
 /*               R0010507   FORTEKSTER OG ATTRIBUTTER       AP       */00000460
 /*               R0010606   FLYTT FRA ARB.OMRÅDE TIL MAP    UP       */00000470
 /*               R0010607   FORTEKSTER OG ATTRIBUTTER       UP       */00000480
 /*               R0010706   FLYTT FRA ARB.OMRÅDE TIL MAP    ST       */00000490
 /*               R0010806   FLYTT FRA ARB.OMRÅDE TIL MAP    EP       */00000500
 /*               R0010807   FORTEKSTER OG ATTRIBUTTER       EP       */00000510
 /*               R0010906   FLYTT FRA ARB.OMRÅDE TIL MAP    EF       */00000520
 /*               R0010907   FORTEKSTER OG ATTRIBUTTER       EF       */00000530
 /*               R0011006   FLYTT FRA ARB.OMRÅDE TIL MAP    FB       */00000540
 /*               R0011106   FLYTT FRA ARB.OMRÅDE TIL MAP    BP       */00000550
 /*               R001NB06   FLYTT FRA ARB.OMRÅDE TIL MAP    B6       */00000560
 /*               R0011206   FLYTT FRA ARB.OMRÅDE TIL MAP    FT       */00000570
 /*               R0011207   FORTEKSTER OG ATTRIBUTTER       FT       */00000580
 /*               R0011406   FLYTT FRA ARB.OMRÅDE TIL MAP    E1       */00000590
 /*               R001UE06   FLYTT FRA ARB.OMRÅDE TIL MAP    EN       */00000600
 /*               R0011506   FLYTT FRA ARB.OMRÅDE TIL MAP    E2       */00000610
 /*               R0011606   FLYTT FRA ARB.OMRÅDE TIL MAP    O1       */00000620
 /*               R0011706   FLYTT FRA ARB.OMRÅDE TIL MAP    O2       */00000630
 /*               R0011836   FLYTT FRA ARB.OMRÅDE TIL MAP    UF       */00000640
 /*               R0019912   PIC TIL CHAR OG MOTSATT                  */00000650
 /*                                                                   */00000660
 /* ***************************************************************** */00000670
 /*DATASETTOPPLYSNINGER:                                              */00000680
 /* ***********************                                           */00000690
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000700
 /*                                                                   */00000710
 /* ***************************************************************** */00000720
 /*FEILMELDINGER:                                                     */00000730
 /* *******************                                               */00000740
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000750
 /*                                                                   */00000760
 /* ***************************************************************** */00000770
                                                                        00000780
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000790
                                                                        00000800
 %PAGE;                                                                 00000810
 %INCLUDE P0019906;  /* TRANS-OPPL-OMRÅDE (BASED) */                    00000820
 %PAGE;                                                                 00000830
 %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)        */                    00000840
 %PAGE;                                                                 00000850
 %INCLUDE P0019910;  /* STYRINGS - OMRÅDE (BASED) */                    00000860
 %PAGE;                                                                 00000870
 %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE(BASED)   */                    00000880
 %PAGE;                                                                 00000890
 %INCLUDE P0019913;  /* LOKAL - KOM_OMR (BASED)   */                    00000900
 %PAGE;                                                                 00000910
 DCL  FORKASTES      BIT (1)  INIT ('0'B);                              00000920
                                                                        00000930
 DCL                                                                    00000940
    QUENAME                CHAR(8),                                     00000950
       QTERMID             CHAR(4) DEF QUENAME POS(1),                  00000960
       REST                CHAR(4) DEF QUENAME POS(5);                  00000970
                                                                        00000980
 DCL                                                                    00000990
    1 ROUTELIST,                                                        00001000
      2 PRINTER,                                                        00001010
        3 TERMID           CHAR(4),                                     00001020
        3 REST             CHAR(12),                                    00001030
      2 SISTE,                                                          00001040
        3 SLUTT            FIXED BIN(15),                               00001050
        3 REST             CHAR(14);                                    00001060
                                                                        00001070
 DCL      (CSTG,ADDR )                   BUILTIN;                       00001080
                                                                        00001090
 DCL  COMMAREA_PEKER         PTR,                                       00001100
      LOKAL_KOM_PTR          PTR,                                       00001110
                                                                        00001120
      LOW_CHAR_BASED        CHAR(1200)  BASED(BMSMAPBR),                00001130
      I                      FIXED BIN(15) INIT (0),                    00001140
      LENGTH                 FIXED BIN(15);                             00001150
                                                                        00001160
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00001170
 DCL                                                                    00001180
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00001190
    DFHBMUNP             CHAR(1) INIT(' '),                             00001200
    DFHBMBRY             CHAR(1) INIT('H'),                             00001210
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00001220
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00001230
    MELDING6O            CHAR(10),                                      00001240
    YMELDING6O           CHAR(10);                                      00001250
                                                                        00001260
                                                                        00001270
 QTERMID        = EIBTRMID;                                             00001280
 REST           = 'COMA';                                               00001290
 ROUTELIST      = '';                                                   00001300
 PRINTER.TERMID = 'R41J';                                               00001310
 SISTE.SLUTT    = -1;                                                   00001320
 W01_START          = 1;                                                00001330
                                                                        00001340
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00001350
                                                                        00001360
 EXEC CICS READQ TS QUEUE(QUENAME) SET (COMMAREA_PEKER)                 00001370
                               LENGTH(LENGTH) NOHANDLE;                 00001380
 EXEC CICS DELETEQ TS QUEUE(QUENAME) NOHANDLE;                          00001390
                                                                        00001400
                                                                        00001410
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00001420
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00001430
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00001440
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00001450
                                                                        00001460
 /*                                                                     00001470
 EXEC CICS LOAD PROGRAM('S0010T3') SET(MAPSET_PTR);                     00001480
 ALLOCATE  LOW_CHAR_BASED;                                              00001490
                                                                        00001500
 EXEC CICS HANDLE CONDITION OVERFLOW(OVERFLOW);                         00001510
 */                                                                     00001520
                                                                        00001530
    /** STYRING FOR OVERFØRINGSMODULENE  **/                            00001540
    DIV_PARAM_OMR.FRA_CICS        = '0'B;                               00001550
    DIV_PARAM_OMR.HENT_FRAM_MAP   = '0'B;                               00001560
    DIV_PARAM_OMR.FRA_MED_DIALOG  = '0'B;                               00001570
    DIV_PARAM_OMR.FRA_UTEN_DIALOG = '0'B;                               00001580
    DIV_PARAM_OMR.FRA_UTEN_DIALOG = '1'B;                               00001590
                                                                        00001600
    W01_TRANS_IND = 0;                                                  00001610
                                                                        00001620
    IF FUNKSJONSKODE = 'E' & EIBAID = '8' THEN       /* PF8  */         00001630
       EXEC CICS ROUTE LIST(ROUTELIST);                                 00001640
                                                                        00001650
    TRANS_ANT = ANTALL_TRANS_I_TRANS_LISTE + 1;                         00001660
                                                                        00001670
       W01_SIDE_ANTALL = ANTALL_TRANS_I_TRANS_LISTE;                    00001680
  /*   W01_SIDE_ANTALL = ANTALL_TRANS_I_TRANS_LISTE + 1; TEST*** */     00001690
 MAPUT:                                                                 00001700
                                                                        00001710
        /* DO I  = W01_START TO ANTALL_TRANS_I_TRANS_LISTE;    */       00001720
                                                                        00001730
    DO I   = W01_START TO W01_SIDE_ANTALL;                              00001740
       W01_LOOP  = I;                                                   00001750
       W01_START = W01_START + 1;                                       00001760
       W01_MAP = '       ';                                             00001770
                                                                        00001780
       IF ^W01_YSKADE      &                                            00001790
          ^W01_NORSK_BOSATT THEN                                        00001800
          DO;                                                           00001810
                                                                        00001820
             W01_TRANS_IND = W01_TRANS_IND + 1;                         00001830
             KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =                     00001840
                                         TRANS_OPPL_PTR(W01_TRANS_IND); 00001850
             KOM_OMR.PEKER_LISTE.TRANS_PEKER = TRANS_PTR(W01_TRANS_IND);00001860
             TRANS_ANT = TRANS_ANT - 1;                                 00001870
          END;                                                          00001880
                                                                        00001890
       CALL SELECT_BLANKETTYPE;                                         00001900
                                                                        00001910
        /* IF I  = ANTALL_TRANS_I_TRANS_LISTE THEN   */                 00001920
                                                                        00001930
       IF I  = W01_SIDE_ANTALL THEN                                     00001940
          DO;                                                           00001950
             KOM_OMR.TRANS_OPPL_PEKER =                                 00001960
                                 ADDR(KOM_OMR.TRANS_OPPL_OMR);          00001970
             SISTE_SIDE = '1'B;                                         00001980
             TRANS_OPPL_OMR.TRANSKODE = 'F41T';                         00001990
          END;                                                          00002000
                                                                        00002010
                                                                        00002020
    END;                                                                00002030
                                                                        00002040
    /** SLUTT PÅ EKSEKVERING I BYGG_TRANS  **/                          00002050
                                                                        00002060
    SELECT_BLANKETTYPE:                                                 00002070
      PROC;                                                             00002080
                                                                        00002090
                                                                        00002100
        HOVED_KOM_OMR_PTR  =    COMMAREA_PEKER;                         00002110
        SELECT(TRANS_OPPL_OMR.BLANKETTYPE);                             00002120
           WHEN('AP','AF','UF','UP','US','EP','EF','FB','BP','FT',      00002130
                'E1','E2','O1','O2')                                    00002140
              DO;                                                       00002150
                EXEC CICS LINK PROGRAM('R001A412')                      00002160
                                         COMMAREA (LOKAL_KOM_OMR);      00002170
              END;                                                      00002180
                                                                        00002190
           WHEN('A1','U2','E3','E4','B6','F7')                          00002200
              DO;                                                       00002210
                EXEC CICS LINK PROGRAM('R001B412')                      00002220
                                         COMMAREA (LOKAL_KOM_OMR);      00002230
              END;                                                      00002240
           WHEN('KF','U3','EE','FO','EN')                               00002250
              DO;                                                       00002260
                EXEC CICS LINK PROGRAM('R001C412')                      00002270
                                         COMMAREA (LOKAL_KOM_OMR);      00002280
              END;                                                      00002290
                                                                        00002300
           OTHERWISE;                                                   00002310
        END;                         /*   SELECT     */                 00002320
                                                                        00002330
                                                                        00002340
    END SELECT_BLANKETTYPE;                                             00002350
                                                                        00002360
                                                                        00002370
                                                                        00002380
 OVERFLOW:                                                              00002390
                                                                        00002400
   IF SISTE_SIDE THEN                                                   00002410
      DO;                                                               00002420
          IF FUNKSJONSKODE = 'E' THEN                                   00002430
             DO;                                                        00002440
               EXEC CICS SEND PAGE RETAIN NOAUTOPAGE;                   00002450
               EXEC CICS RETURN;                                        00002460
             END;                                                       00002470
          ELSE                                                          00002480
             DO;                                                        00002490
                EXEC CICS WRITEQ TS QUEUE(QUENAME) FROM(KOM_OMR);       00002500
                EXEC CICS SEND PAGE TRANSID(TRANSKODE) RELEASE          00002510
                                                    NOAUTOPAGE;         00002520
             END;                                                       00002530
      END;                                                              00002540
                                                                        00002550
     GOTO MAPUT;                                                        00002560
                                                                        00002570
 END R001041;                                                           00002580
