 /*       SIST ENDRET 18/06-98 13.35.30 AV   JDA7339                  */00000000
 /*       SIST ENDRET 18/06-98 13.33.38 AV   JDA7339                  */00000010
 /*       SIST ENDRET 04/04-97 10.57.02 AV   JDA7339                  */00000020
 /*       SIST ENDRET 10/06-96 13.50.27 AV   TSB0310                  */00000030
 /*       SIST ENDRET 27/06-94 14.54.25 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 17/07-92 13.55.53 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 19/02-92 15.01.07 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 17/12-91 08.52.27 AV   TRUDE                    */00000070
 /*       SIST ENDRET 13/12-91 16.14.52 AV   HERMAN                   */00000080
 /*       SIST ENDRET 13/12-91 13.08.24 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 19/03-91 12.23.08 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 03/01-91 09.15.54 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 14/04-89 14.57.16 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 21/12-84 15.33.06 AV   TRY                      */00000130
 /*       SIST ENDRET 11/10-84 08.51.31 AV   FARVIK                   */00000140
 /*       SIST ENDRET 24/09-84 12.33.17 AV   BREIVIK                  */00000150
 /*       SIST ENDRET 28/06-84 10.26.48 AV   BREIVIK                  */00000160
 /*********************************************************************/00000170
 /*                                                                   */00000180
 /* IDENTIFIKASJON:                                                   */00000190
 /*    R0016001 - LAG_DYNAMISK_STATISTIKK_TRANS                       */00000200
 /*                                                                   */00000210
 /*    PROGRAMMERER: P. BREIVIK, JULI 1982.                           */00000220
 /*                                                                   */00000230
 /* HENSIKT:                                                          */00000240
 /*    DANNER TRANSAKSJONER (SEGMENTER) TIL STAT-TRANS-BASEN.         */00000250
 /*                                                                   */00000260
 /* PROGRAMTILKNYTNING:                                               */00000270
 /*    HENTER INN UNDERPROGRAMMENE SOM KILDE-TEKST                    */00000280
 /*    (  R0016021 - DIVERSE HJELPERUTINER.   UTGÅR  BØ9112)          */00000290
 /*       R0016022 - BEHANDLING AV PERSON 1 OG PERSON 2 (MOR & FAR).  */00000300
 /*       R0016023 - BEHANDLING AV PERSONENE 3 TIL 14 (BARN).         */00000310
 /*                - FOM. 9112 MANGE INCLUDE-PGM. - SE NEDERST I PGM. */00000320
 /*                                                                   */00000330
 /* O B S :                                                           */00000340
 /*    VED UTREGNING AV FAKTORER AV G ): SUM-YTELSE * 12 / G , MÅ     */00000350
 /*                                      --------------------         */00000360
 /*    FØLGENDE PASSES PÅ: HVIS SUM-YTELSE ER ET REGNESTYKKE MED MER  */00000370
 /*    ENN 3 FELT, MÅ UTREGNINGEN DELES OPP OG HJELPEFELT BRUKES      */00000380
 /*    FORDI PL1'S ARBEIDSFELTER IKKE BLIR STORE NOK TIL SÅ MANGE     */00000390
 /*    REGNEOPERASJONER MED FELT DEFINERT SOM ANGJELDENDE ER.         */00000400
 /*                                                                   */00000410
 /*    LANDKODE FOR NORGE = 000 . LIGGER FAST I PROGRAMMET.           */00000420
 /*                                                                   */00000430
 /*-------------------------------------------------------------------*/00000440
 /* ENDRET : UKE 25 1998 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S        */00000450
 /*          TAR VARE PÅ PROGRAM_ID SOM KALLER 6001 FORDI TILKN.SEGM  */00000460
 /*          IKKE BEHØVER DANNER VED OMREGNING                        */00000470
 /*********************************************************************/00000480
                                                                        00000490
 R001600: PROC (COMMAREA_PEKER) OPTIONS (MAIN);                         00000500
                                                                        00000510
 DCL (COMMAREA_PEKER)        POINTER;                                   00000520
 DCL (X01_PEKER,X02_PEKER)   POINTER;                                   00000530
 %PAGE;                                                                 00000540
 DCL 1 B01 BASED (B01_PEKER), %INCLUDE P0019921;                        00000550
 %PAGE;                                                                 00000560
 DCL 1 B02 BASED (B02_PEKER), %INCLUDE P0019921;                        00000570
                                                                        00000580
 DCL 1 X01 BASED (X01_PEKER) LIKE B01;                                  00000590
 DCL 1 X02 BASED (X02_PEKER) LIKE B02;                                  00000600
 %PAGE;                                                                 00000610
 %INCLUDE P0019906; /* TRANS_OPPL_OMR */                                00000620
                                                                        00000630
 %INCLUDE P0019908; /* KOM_OMR */                                       00000640
                                                                        00000650
 DCL 1 TRANS_LISTE_OMR UNALIGNED BASED (TRANS_LISTE_PEKER),             00000660
       3 TRANS_LISTE_LINJE(5),                                          00000670
 %INCLUDE P0019911; /* TRANS_LISTE FAST/VARIABEL DEL */                 00000680
                                                                        00000690
 %INCLUDE P0019912; /* DIV_PARAM_OMR */                                 00000700
                                                                        00000710
 %PAGE;                                                                 00000720
 %INCLUDE P0014009; /* POREKKE               */                         00000730
                                                                        00000740
 %PAGE;                                                                 00000750
 %INCLUDE P0016001; /* BOOLSK SEGMENT-TABELL */                         00000760
                                                                        00000770
 %PAGE;                                                                 00000780
 DCL 1 TR0ROT,                                                          00000790
 %INCLUDE P0018201; /* ARBEIDSOMRÅDE TR0ROT               */            00000800
 DCL 1 REGTPKT,                                                         00000810
 %INCLUDE P0018202; /* ARBEIDSOMRÅDE REGTPKT              */            00000820
                                                                        00000830
 %PAGE;                                                                 00000840
 DCL 1 PTYPE,                                                           00000850
 %INCLUDE P0018203; /* ARBEIDSOMRÅDE PTYPE                */            00000860
 DCL 1 SIVILST,                                                         00000870
 %INCLUDE P0018204; /* ARBEIDSOMRÅDE SIVILST              */            00000880
 DCL 1 APOPPL,                                                          00000890
 %INCLUDE P0018205; /* ARBEIDSOMRÅDE APOPPL               */            00000900
                                                                        00000910
 %PAGE;                                                                 00000920
 DCL 1 UPPER,                                                           00000930
 %INCLUDE P0018206; /* ARBEIDSOMRÅDE UPPER                */            00000940
 DCL 1 PENSJON,                                                         00000950
 %INCLUDE P0018207; /* ARBEIDSOMRÅDE PENSJON              */            00000960
 DCL 1 KT,                                                              00000970
 %INCLUDE P0018208; /* ARBEIDSOMRÅDE KT                   */            00000980
                                                                        00000990
 %PAGE;                                                                 00001000
 DCL 1 VT,                                                              00001010
 %INCLUDE P0018209; /* ARBEIDSOMRÅDE VT                   */            00001020
 DCL 1 ET,                                                              00001030
 %INCLUDE P0018210; /* ARBEIDSOMRÅDE ET                   */            00001040
 DCL 1 BT,                                                              00001050
 %INCLUDE P0018211; /* ARBEIDSOMRÅDE BT                   */            00001060
                                                                        00001070
 %PAGE;                                                                 00001080
 DCL 1 TILKN,                                                           00001090
 %INCLUDE P0018214; /* ARBEIDSOMRÅDE TILKN                */            00001100
 DCL 1 ETTERL,                                                          00001110
 %INCLUDE P0018215; /* ARBEIDSOMRÅDE ETTERL               */            00001120
                                                                        00001130
 %PAGE;                                                                 00001140
 DCL 1 DIAGNOSE,                                                        00001150
 %INCLUDE P0018216; /* ARBEIDSOMRÅDE DIAGNOSE             */            00001160
 DCL 1 YSKADE,                                                          00001170
 %INCLUDE P0018219; /* ARBEIDSOMRÅDE YSKADE               */            00001180
 DCL 1 SPESOPPL,                                                        00001190
 %INCLUDE P0018217; /* ARBEIDSOMRÅDE SPESOPPL             */            00001200
 DCL 1 EØSINFO,                                                         00001210
 %INCLUDE P0018220; /* ARBEIDSOMRÅDE EØSINFO              */            00001220
                                                                        00001230
 %PAGE;                                                                 00001240
 /*-------------------------------------------------------------------*/00001250
 /*                                                                   */00001260
 /*   DL/1 PARAMETRE                                                  */00001270
 /*                                                                   */00001280
 /*-------------------------------------------------------------------*/00001290
                                                                        00001300
 %INCLUDE DLIUIB;                                                       00001310
 DCL PLITDLI                 EXTERNAL ENTRY;                            00001320
                                                                        00001330
 DCL UIB_RC_OK               BIT (8) INIT(0);    /* KONSTANT */         00001340
 DCL 1 TR0_PCB_PEKER         BASED (UIBPCBAL),                          00001350
       2 TR0_PCB_PTR         POINTER;                                   00001360
                                                                        00001370
 DCL INSERT                  CHAR (4) INIT('ISRT');                     00001380
 DCL PARAM_COUNT_3           FIXED BIN (31) INIT(3);                    00001390
 DCL PARAM_COUNT_4           FIXED BIN (31) INIT(4);                    00001400
 DCL PARAM_COUNT_5           FIXED BIN (31) INIT(5);                    00001410
 DCL PARAM_COUNT_6           FIXED BIN (31) INIT(6);                    00001420
                                                                        00001430
 /*-------------------------------------------------------------------*/00001440
 /*                                                                   */00001450
 /*   DEKLARASJON AV SSA                                              */00001460
 /*                                                                   */00001470
 /*-------------------------------------------------------------------*/00001480
                                                                        00001490
 DCL SSA_UNQUAL              CHAR (9);                                  00001500
                                                                        00001510
 DCL 1 SSA_TR0ROT UNALIGNED,                                            00001520
       2 HOVEDDEL            CHAR (17) INIT('TR0ROT  (FNR     '),       00001530
       2 REL_OP              CHAR (2)  INIT(' ='),                      00001540
       2 FNR_KEY             FIXED DEC (11),                            00001550
       2 END_MRK             CHAR (1)  INIT(')');                       00001560
                                                                        00001570
 DCL 1 SSA_REGTPKT UNALIGNED,                                           00001580
       2 HOVEDDEL            CHAR (17) INIT('REGTPKT (DATOKL  '),       00001590
       2 REL_OP              CHAR (2)  INIT(' ='),                      00001600
       2 DATOKL_KEY          FIXED DEC (15),                            00001610
       2 END_MRK             CHAR (1)  INIT(')');                       00001620
                                                                        00001630
 /*-------------------------------------------------------------------*/00001640
 /*                                                                   */00001650
 /*   PCB-OMRÅDE                                                      */00001660
 /*                                                                   */00001670
 /*-------------------------------------------------------------------*/00001680
                                                                        00001690
 %INCLUDE P0012002;                                                     00001700
                                                                        00001710
 DCL 1 TR0_PCB               BASED (TR1_PCB_PEKER),                     00001720
 %INCLUDE P0012003; /* PCB-OMRÅDE */                                    00001730
                                                                        00001740
 %PAGE;                                                                 00001750
 /*-------------------------------------------------------------------*/00001760
 /*                                                                   */00001770
 /*   HJELPEVARIABLE                                                  */00001780
 /*                                                                   */00001790
 /*-------------------------------------------------------------------*/00001800
                                                                        00001810
 DCL SAVE_B01_B02            FIXED BIN (15) INIT(0);                    00001820
 DCL PENSJALDER              PIC '99' INIT(67);                         00001830
 DCL LOOPCONST               FIXED BIN (15) INIT(5);                    00001840
 DCL (I,J,K)                 FIXED BIN (15);                            00001850
 DCL (I1,J1,K1)              FIXED BIN (15);                            00001860
 DCL IND                     FIXED BIN (15);                            00001870
 DCL TRUE                    BIT (1) INIT('1'B);                        00001880
 DCL FALSE                   BIT (1) INIT('0'B);                        00001890
 DCL (ENDRET,TP_ENDRET,                                                 00001900
      FUNNET,FEIL)           BIT (1);                                   00001910
 DCL (B01_TT_EGEN,                                                      00001920
      B02_TT_EGEN,                                                      00001930
      TT_HELP,                                                          00001940
      B01_TT_AVD,                                                       00001950
      B02_TT_AVD,                                                       00001960
      B01_PÅ,                                                           00001970
      B02_PÅ,                                                           00001980
      B01_PÅ_E91,                                                       00001990
      B02_PÅ_E91,                                                       00002000
      M_PÅ,F_PÅ,                                                        00002010
      FRA,TIL)               FIXED DEC (3);                             00002020
 DCL NORGE                   FIXED DEC (3) INIT (000); /* LANDSKODE   */00002030
 DCL (B01_SPT,B02_SPT,                                                  00002040
      B01_OPT,B02_OPT,                                                  00002050
      B01_YPT,B02_YPT,                                                  00002060
      B01_SPT_GML,B02_SPT_GML,                                          00002070
      M_SPT,F_SPT,                                                      00002080
      M_OPT,F_OPT)           FIXED DEC (3,2) INIT(0);                   00002090
 DCL W_B02_SUM               FIXED DEC (5);  /* JFR. KOMM. ØVERST */    00002100
                                                                        00002110
 DCL (B01_PENSJON,                                                      00002120
      B02_PENSJON)           FIXED DEC (5);                             00002130
 DCL W_FNR                   DEC FIXED (11);                            00002140
 DCL W_TRANSKODE             CHAR(4);                                   00002150
 DCL W_KALL_FRA_PROGRAM_ID   CHAR(8);                                   00002160
 DCL W_VIRKD                 PIC '(4)9';                                00002170
 DCL W_VIRKD_T               PIC '(4)9';                                00002180
 DCL (B01_STAT_PT1,                                                     00002190
      B02_STAT_PT1)          CHAR (1) ;                                 00002200
 DCL TEST_B02_PT1            CHAR (1) ;                                 00002210
                                                                        00002220
 DCL W_FNR_PIC               PIC '(11)9',                               00002230
     W_FNR_AAMM              PIC '( 4)9',                               00002240
     W_F_MM                  PIC '( 2)9'       DEF W_FNR_PIC POS (3),   00002250
     W_F_AA                  PIC '( 2)9'       DEF W_FNR_PIC POS (5),   00002260
     W_PNR3                  PIC '( 3)9'       DEF W_FNR_PIC POS (7);   00002270
 DCL (B01_TP,B02_TP)         FIXED DEC (5);                             00002280
 DCL (M_FNR,F_FNR)           FIXED DEC (11);                            00002290
 DCL HELP_FNR                PIC '(11)9';                               00002300
 DCL HELP_DATO               PIC '9999';                                00002310
 DCL KODE                    CHAR (8) VARYING;                          00002320
 DCL PBR_TEXT                CHAR (50);                                 00002330
 DCL W_ABSTIME         FIXED DEC  (15)      INIT (0);                   00002340
 DCL W_ABS                   PIC '(15)9'    INIT (0),                   00002350
     W_ABS_MILLI_SEK         PIC '(4)9' DEF W_ABS       POS(12);        00002360
 DCL DATO_KLOKKE             PIC '(15)9',                               00002370
     DATO_ÅM                 PIC '9999' DEF DATO_KLOKKE,                00002380
     DATO                    PIC '(6)9' DEF DATO_KLOKKE,                00002390
     KLOKKE                  PIC '(9)9' DEF DATO_KLOKKE POS( 7),        00002400
     MILLI_SEK               PIC '(4)9' DEF DATO_KLOKKE POS(12);        00002410
 DCL IO_PEK                  POINTER;                                   00002420
 DCL IO_AREA                 CHAR (70);                                 00002430
 DCL IO_HELP_AREA            CHAR (70) BASED (IO_PEK);                  00002440
 DCL (DATE,TIME,INDEX,                                                  00002450
      SUBSTR,CSTG,ADDR,                                                 00002460
      MIN,MAX,LENGTH,                                                   00002470
      CHAR,VERIFY)           BUILTIN;                                   00002480
  DCL HJ_TAI                FIXED DEC (7) INIT (0);                     00002490
      HJ_TAI  = DIV_PARAM_OMR.TAI(1);                                   00002500
      HJ_TAI  = DIV_PARAM_OMR.TAI(2);                                   00002510
                                                                        00002520
 %PAGE;                                                                 00002530
 /*-------------------------------------------------------------------*/00002540
 /*                                                                   */00002550
 /*                        S T A R T                                  */00002560
 /*                                                                   */00002570
 /* PROGRAM LAG_DYNAMISK_STATISTIKK_TRANS                             */00002580
 /*    HVIS NOEN AV FELTENE SOM HAR INTERESSE FOR STATISTIKK,         */00002590
 /*    ER ENDRET, SKAL DET GENERERES ET SEGMENT TIL STAT-TRANS-BASEN. */00002600
 /*    SEGMENTENE LEGGES I ARBEIDSFELTET 'STAT_TRANS' INNTIL ALLE     */00002610
 /*    SEGMENTENE PÅ ET FNR ER KLARE.                                 */00002620
 /*                                                                   */00002630
 /*-------------------------------------------------------------------*/00002640
                                                                        00002650
    PBR_TEXT = 'R0016001';                                              00002660
    EXEC CICS ENTER TRACEID (60) FROM (PBR_TEXT);                       00002670
                                                                        00002680
    W_KALL_FRA_PROGRAM_ID    =  DIV_PARAM_OMR.PROGRAM_ID;/*9806 SL OMR*/00002690
    DIV_PARAM_OMR.PROGRAM_ID = 'R0016001';                              00002700
    UIBPTR = UIB_PEKER;                                                 00002710
    FEIL = TRUE;                                                        00002720
                                                                        00002730
    CALL OPPDAT_MOR_FAR;                                                00002740
                                                                        00002750
    CALL OPPDAT_BARN;                                                   00002760
                                                                        00002770
    FEIL = FALSE;                                                       00002780
                                                                        00002790
 UTGANG:                                                                00002800
 /*-------------------------------------------------------------------*/00002810
 /* PROGRAMKONTROLLEN ENDER HER NÅR ALL OPPDATERING ER FORETATT       */00002820
 /* ELLER NÅR DET ER DETEKTERT EN FEIL I OPPDATERING AV ET SEGMENT.   */00002830
 /* VARIABELEN 'FEIL' AVGJØR FEIL-STATUS.                             */00002840
 /*-------------------------------------------------------------------*/00002850
                                                                        00002860
    IF FEIL THEN                                                        00002870
    DO;                                                                 00002880
 /*    EXEC CICS ENTER  TRACEID (60)  FROM  (PBR_TEXT) ;  */            00002890
       PBR_TEXT = 'DL/I-RET. = ' !!                                     00002900
                  CHAR(DLIUIB.UIBRCODE.UIBFCTR) !!                      00002910
                  CHAR(DLIUIB.UIBRCODE.UIBDLTR) !!                      00002920
                  '  STATUS-KODE = ' !! TR0_PCB.STATUS_KODE;            00002930
 /*    EXEC CICS ENTER  TRACEID (60)  FROM  (PBR_TEXT) ;  */            00002940
       PBR_TEXT = 'SEGMENT-NIVÅ = ' !! TR0_PCB.SEGM_NIVAA ;             00002950
 /*    EXEC CICS ENTER  TRACEID (60)  FROM  (PBR_TEXT) ;  */            00002960
    END;                                                                00002970
 /* ELSE                                                                00002980
       PBR_TEXT = 'NORMAL AVSLUTNING På PROGRAM R0016001';              00002990
 */                                                                     00003000
    EXEC CICS RETURN;                                                   00003010
                                                                        00003020
 %PAGE;                                                                 00003030
 /*-------------------------------------------------------------------*/00003040
 /* INCLUDE-MODULER                                                   */00003050
 /*-------------------------------------------------------------------*/00003060
 /*  %INCLUDE R0016021;    DIVERSE HJELPERUTINER */                     00003070
                                                                        00003080
 %PAGE;                                                                 00003090
 %INCLUDE R0016022;        /* OPPDAT_MOR_FAR       */                   00003100
 %PAGE;                                                                 00003110
 %INCLUDE R0016023;        /* OPPDAT_BARN          */                   00003120
                                                                        00003130
 %PAGE;                                                                 00003140
 %INCLUDE R0016024;        /* SKRIV_STAT_SEGM      */                   00003150
                                                                        00003160
 %PAGE;                                                                 00003170
 %INCLUDE R0016031;        /* F_KONV_SIVILSTAND    */                   00003180
 %PAGE;                                                                 00003190
 %INCLUDE R0016032;        /* UP_OPPDAT            */                   00003200
 %PAGE;                                                                 00003210
 %INCLUDE R0016033;        /* U2_OPPDAT            */                   00003220
 %PAGE;                                                /*SOB9704*/      00003230
 %INCLUDE R0016039;        /* U3_OPPDAT            */  /*SOB9704*/      00003240
 %PAGE;                                                                 00003250
 %INCLUDE R0016034;        /* FINN_UP_YP_OPPHØR    */                   00003260
 %INCLUDE R0016035;        /* DANN_OPPHØR_GIFT     */                   00003270
 %INCLUDE R0016036;        /* DANN_OPPHØR          */                   00003280
 %INCLUDE R0016037;        /* DANN_TILGANG         */                   00003290
 %INCLUDE R0016038;        /* FASTSETT_AP_BEREGN   */                   00003300
 %PAGE;                                                                 00003310
 %INCLUDE R0016051;        /* ALDER                */                   00003320
 %PAGE;                                                                 00003330
 %INCLUDE R0016052;        /* F_MAGIC              */                   00003340
 %INCLUDE R0016053;        /* F_REGN_APD_B01_B02   */                   00003350
                                                                        00003360
 END; /* OF PROGRAM R0016001 */                                         00003370
