 /*       SIST ENDRET 23/03-92 14.59.27 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 21/02-92 14.48.39 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 27/06-91 10.11.42 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 11/12-90 13.22.39 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 04/10-90 15.15.09 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 19/09-90 14.53.21 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 06/09-90 14.30.54 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 05/07-90 09.22.34 AV   DYBVIK                   */00000070
 /* ******************************************************************/ 00000080
 /* IDENTIFIKASJON                                                    */00000090
 /*     R0014180 - F_SÆRTILLEGG_UTLAND    FUNKSJON  I PLI.            */00000100
 /*     PROGRAMMERER: TRUDE SPONBERG JANUAR 1990                      */00000110
 /* HENSIKT                                                           */00000120
 /*     BEREGNE SÆRTILLEGG - BOSATT I UTLANDET                        */00000130
 /* PROGRAMTILKNYTNING                                                */00000140
 /*     PROSEDYREN BLIR INKLUDERT I OVERLIGGENDE PROGRAM.             */00000150
 /* BRUK                                                              */00000160
 /*     ST = F_SÆRTILLEGG(SUM_TP,ÅFT_MAX,FORH_INDIKATOR,              */00000170
 /*                              ST_PROSENT,GRAD,TT_ANV)              */00000180
 /* ENDRET :                                                          */00000190
 /* ***************************************************************** */00000200
                                                                        00000210
 SÆRTILLEGG_UTLAND:                                                     00000220
  PROC(SUM_TP);                                                         00000230
                                                                        00000240
   DCL SUM_TP                   FIXED DEC (5),                          00000250
       ÅFT_MAX                  FIXED DEC (5),                          00000260
       FORH_INDIKATOR           CHAR      (1),                          00000270
       ST_PROSENT               FIXED DEC (5,2),                        00000280
       GRAD                     FIXED DEC (3),                          00000290
       TT_ANV                   FIXED DEC (3);                          00000300
                                                                        00000310
   DCL ST                       FIXED DEC (7,2);                        00000320
                                                                        00000330
   DCL W_FNR_EK                 PIC'(11)9';                             00000340
                                                                        00000350
   DCL W_DATO_ÅM                PIC'(4)9';                              00000360
   DCL W_ÅR DEF W_DATO_ÅM POS(1)   PIC'99';                             00000370
   DCL W_MN DEF W_DATO_ÅM POS(3)   PIC'99';                             00000380
   DCL W_DATO_MÅ                PIC'(4)9';                              00000390
                                                                        00000400
   DCL TT_ETTER_1966_ÅR_EG   PIC'99';                                   00000410
   DCL TT_ETTER_1966_ÅR_EK   PIC'99';                                   00000420
                                                                        00000430
   DCL W_TT_ETTER_1966_ÅR_EG   FIXED DEC (5,3);                         00000440
   DCL W_TT_ETTER_1966_ÅR_EK   FIXED DEC (5,3);                         00000450
                                                                        00000460
   DCL W_ST_DEL1                FIXED DEC (15,2);                       00000470
   DCL W_ST_DEL2                FIXED DEC (15,2);                       00000480
                                                                        00000490
   DCL W_ST                     FIXED DEC (15,4),                       00000500
       W_GRAD                   FIXED DEC (3),                          00000510
       W_ST_FRADRAG             FIXED DEC (5),                          00000520
       W_ST_APD                 FIXED DEC (3);                          00000530
       W_ST_APD    = B02.ALDERSP.APD(BER_SØ_IND);                       00000540
                                                                        00000550
   DCL APD_GRAD                 FIXED DEC (3) INIT(0);   /*TS*/         00000560
                                                                        00000570
   DCL SEKSTI                   FIXED DEC (5);       /*HL*/             00000580
                                                                        00000590
  /*VI MÅ PASSE PÅ AT DET IKKE ER REGNET ST TIDLIGERE */                00000600
  /*TRUDE, 300591                                     */                00000610
  B02.ALDERSP.ST(BER_SØ_IND) = 0;  /* TESTING*/                         00000620
                                                                        00000630
       /*-------------------------------------------------------*/      00000640
       /*NYE REGLER FRA 0192 SETTER APD TIL 0. VI MÅ HER PASSE  */      00000650
       /*PÅ AT APD BLIR 100 . TRUDE 230392                      */      00000660
       /*-------------------------------------------------------*/      00000670
                                                                        00000680
  IF W_FNR_ÅM           > 2412 &                              /*TS0392*/00000690
     FNR_R.ÅRHUNDRE     < 5    THEN                           /*TS0392*/00000700
     APD_GRAD           = 100;                                /*TS0392*/00000710
  ELSE                                                        /*TS0392*/00000720
     APD_GRAD           = B02.ALDERSP.APD(BER_SØ_IND);        /*TS0392*/00000730
                                                                        00000740
  W_FNR_EK   = B02.FNR(BER_EK_IND);                                     00000750
  W_DATO_ÅM  = B02.VIRK_DATO_ÅM(BER_SØ_IND);                            00000760
  W_DATO_MÅ  = W_MN !! W_ÅR;                                            00000770
                                                                        00000780
  W_TT_ETTER_1966_ÅR_EG   = (B02.TT_FRAMT(BER_SØ_IND) +                 00000790
                             B02.TT_ETTER_1966(BER_SØ_IND) + 11) / 12;  00000800
  W_TT_ETTER_1966_ÅR_EK   = (B02.TT_FRAMT(BER_EK_IND) +                 00000810
                             B02.TT_ETTER_1966(BER_EK_IND) + 11) / 12;  00000820
                                                                        00000830
  TT_ETTER_1966_ÅR_EG   = W_TT_ETTER_1966_ÅR_EG;                        00000840
  TT_ETTER_1966_ÅR_EK   = W_TT_ETTER_1966_ÅR_EK;                        00000850
                                                                        00000860
                                                                        00000870
     /*-----------------------------------------------------*/          00000880
     /* ETTER 0191 HAR VI IKKE 19-3 KODER .SPES FOR DEM SOM */          00000890
     /* BLIR KONV. FRA UP TIL AP. ELLER FEIL BLANKETT, AP   */          00000900
     /* ISTEDET FOR A1.                                     */          00000910
     /* UTTAKSDATO KAN VÆRE > 9100  NYE REGLER              */          00000920
     /*-----------------------------------------------------*/          00000930
                                                                        00000940
                                                                        00000950
     /*--------------------------------------*/                         00000960
     /* BEREGNINGSREGLENE PUNKT 3.1.5.2      */                         00000970
     /*--------------------------------------*/                         00000980
                                                                        00000990
    IF B02.PENSJONSTYPE2(BER_SØ_IND)   ^= 'S' THEN  /*ENSLIG PENSJON */ 00001000
      DO;                                                               00001010
       IF B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)   = '2' !                00001020
          B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)   = '5' !                00001030
          B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)   = '8' ! /*KONV FRA UP*/00001040
          B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)   = '7' THEN             00001050
           DO;                                                          00001060
             IF B02.PENSJONSTYPE2(BER_SØ_IND) =  'F' THEN               00001070
               DO;                                                      00001080
                                                                        00001090
 /*LOVENDRING 1.1.91 HL : */                                            00001100
                                                                        00001110
                 IF W_DATO_ÅM > 9100     THEN                           00001120
                    SEKSTI = 6001;                                      00001130
                 ELSE                                                   00001140
                    SEKSTI = 6000;                                      00001150
                                                                        00001160
                 IF F_ALDER(W_FNR_EK,W_DATO_MÅ)   >= SEKSTI &           00001170
                    W_DATO_ÅM                     >  8903  THEN         00001180
                                                                        00001190
                     B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(  00001200
                                           SUM_TP,0,'JA',               00001210
                                           (ST_PROSENT_SAMST * 2 ),     00001220
                                           APD_GRAD,                    00001230
                                               B02.TT_ANV(BER_SØ_IND)); 00001240
                 ELSE                                                   00001250
                     B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(  00001260
                                           SUM_TP,0,'JA',               00001270
                                           ST_PROSENT_ENSLIG,           00001280
                                           APD_GRAD,                    00001290
                                           B02.TT_ANV(BER_SØ_IND));     00001300
               END;                                                     00001310
             ELSE                                                       00001320
                 B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(      00001330
                                           SUM_TP,0,'JA',               00001340
                                           ST_PROSENT_ENSLIG,           00001350
                                           APD_GRAD,                    00001360
                                           B02.TT_ANV(BER_SØ_IND));     00001370
             GO TO RETUR;                  /*TRUDE 230392*/             00001380
           END;                                                         00001390
                                                                        00001400
       IF (B02.TT_ANV(BER_SØ_IND)          < 40   &                     00001410
           TT_ETTER_1966_ÅR_EG         >= 3 ) !                         00001420
          (B02.TT_ANV(BER_SØ_IND)             = 40  &                   00001430
          (B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)  ^= '5' &               00001440
           B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)  ^= '7' &               00001450
           B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)  ^= '8' &               00001460
           B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)  ^= '2')) THEN          00001470
           DO;                                                          00001480
             IF B02.PENSJONSTYPE2(BER_SØ_IND) =  'F' THEN               00001490
               DO;                                                      00001500
                                                                        00001510
 /*LOVENDRING 1.1.91 HL : */                                            00001520
                                                                        00001530
                 IF W_DATO_ÅM > 9100     THEN                           00001540
                    SEKSTI = 6001;                                      00001550
                 ELSE                                                   00001560
                    SEKSTI = 6000;                                      00001570
                                                                        00001580
                IF F_ALDER(W_FNR_EK,W_DATO_MÅ)   >= SEKSTI  &           00001590
                   W_DATO_ÅM                     >  8903  THEN          00001600
                    B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(   00001610
                                        SUM_TP,0,'JA',                  00001620
                                        (ST_PROSENT_SAMST * 2),         00001630
                                        APD_GRAD,                       00001640
                                        TT_ETTER_1966_ÅR_EG);           00001650
                ELSE                                                    00001660
                    B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(   00001670
                                        SUM_TP,0,'JA',                  00001680
                                        ST_PROSENT_ENSLIG,              00001690
                                        APD_GRAD,                       00001700
                                        TT_ETTER_1966_ÅR_EG);           00001710
               END;                                                     00001720
             ELSE                                                       00001730
                    B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(   00001740
                                        SUM_TP,0,'JA',                  00001750
                                        ST_PROSENT_ENSLIG,              00001760
                                        APD_GRAD,                       00001770
                                        TT_ETTER_1966_ÅR_EG);           00001780
           END;                                                         00001790
      END;                                                              00001800
                                                                        00001810
                                   /*--------------------------------*/ 00001820
                                   /* 3.1.5.3 SAMMENSTØTENDE PENSJON */ 00001830
                                   /*--------------------------------*/ 00001840
                                                                        00001850
    IF B02.PENSJONSTYPE2(BER_SØ_IND)   = 'S' &    /* SAMMENSTØTENDE P.*/00001860
       (B02.SPESOPPL.BOSATT     (BER_SØ_IND)  > 0   &                   00001870
        B02.SPESOPPL.BOSATT     (BER_EK_IND)  > 0 )  THEN               00001880
     DO;                                          /* 3.1.5.3          */00001890
       IF (B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)  ^= '2'  !              00001900
           B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)  ^= '7'  !              00001910
           B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)  ^= '8'  !              00001920
           B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)  ^= '5') THEN           00001930
        DO;                                                             00001940
         IF B02.TT_ETTER_1966   (BER_SØ_IND)   =  0 &                   00001950
            B02.TT_ETTER_1966   (BER_EK_IND)   =  0  THEN               00001960
           DO;                            /* IKKE RETT TIL SÆRTILLEGG */00001970
             W_ST = 0;                                                  00001980
             GO TO RETUR;                                               00001990
           END;                                                         00002000
         ELSE                                                           00002010
           IF B02.TT_ANV(BER_SØ_IND)  < 40 THEN                         00002020
             DO;                                                        00002030
               IF TT_ETTER_1966_ÅR_EG   <                               00002040
                  TT_ETTER_1966_ÅR_EK   THEN                            00002050
                  TT_ETTER_1966_ÅR_EG   =                               00002060
                  TT_ETTER_1966_ÅR_EK;                                  00002070
               B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(        00002080
                                             SUM_TP,0,'JA',             00002090
                                             ST_PROSENT_SAMST,          00002100
                                             APD_GRAD,                  00002110
                                             TT_ETTER_1966_ÅR_EG);      00002120
             END;                                                       00002130
                                                                        00002140
       IF (B02.TT_FØR_1967(BER_SØ_IND)     = 0   &                      00002150
           B02.TT_FØR_1967(BER_EK_IND)     = 0 ) &                      00002160
          (B02.TT_ANV(BER_SØ_IND)  <  B02.TT_ANV(BER_EK_IND)) THEN      00002170
            DO;                                                         00002180
        /*   STM NEDENFOR MÅ VÆRE TULL!! TRUDE 130292 ** UT !!!  */     00002190
        /*   MEN SKAL VI BRUKE TT TIL EKTEFELLE PÅ ST ????       */     00002200
        /*   B02.TT_ANV(BER_SØ_IND)  =  B02.TT_ANV(BER_EK_IND);  */     00002210
             B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(          00002220
                                          SUM_TP,0,'JA',                00002230
                                          ST_PROSENT_SAMST,             00002240
                                          APD_GRAD,                     00002250
                                          B02.TT_ANV(BER_SØ_IND));      00002260
            END;                                                        00002270
                                                                        00002280
       IF (B02.TT_FØR_1967(BER_SØ_IND)     > 0   &                      00002290
           B02.TT_ETTER_1966(BER_SØ_IND)   > 0 ) !                      00002300
          (B02.TT_FØR_1967(BER_EK_IND)     > 0   &                      00002310
           B02.TT_ETTER_1966(BER_EK_IND)   > 0 ) THEN                   00002320
            DO;                                                         00002330
              IF (B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)  = '2'  !        00002340
                  B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)  = '5'  !        00002350
                  B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND)  = '7')   THEN   00002360
                IF B02.TT_ANV(BER_SØ_IND) > B02.TT_ANV(BER_EK_IND) THEN 00002370
                   DO;                                                  00002380
                      W_ST_DEL1 = F_BEREGN_SÆRTILLEGG(                  00002390
                                                     SUM_TP,0,'N',      00002400
                                                     ST_PROSENT_ENSLIG, 00002410
                                                     APD_GRAD,          00002420
                      (B02.TT_ANV(BER_SØ_IND)- B02.TT_ANV(BER_EK_IND)));00002430
                                                                        00002440
                      W_ST_DEL2 = F_BEREGN_SÆRTILLEGG(                  00002450
                                               SUM_TP,0,'N',            00002460
                                               ST_PROSENT_SAMST,        00002470
                                               APD_GRAD,                00002480
                                               B02.TT_ANV(BER_EK_IND)); 00002490
           B02.ALDERSP.ST(BER_SØ_IND) = W_ST_DEL1 + W_ST_DEL2 + 0.5;    00002500
                    END;                                                00002510
                ELSE                                                    00002520
                     B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(  00002530
                                               SUM_TP,0,'JA',           00002540
                                               ST_PROSENT_SAMST,        00002550
                                               APD_GRAD,                00002560
                                               B02.TT_ANV(BER_SØ_IND)); 00002570
            END;                                                        00002580
     IF (B02.TT_FØR_1967(BER_SØ_IND) = 0 &                              00002590
         B02.TT_FØR_1967(BER_EK_IND) = 0 ) &                            00002600
         TT_ETTER_1966_ÅR_EG  >= 3    THEN  /* FORUTSETN. AT TTF67=0 */ 00002610
      DO;                                  /* PÅ BEGGE   ????        */ 00002620
       IF TT_ETTER_1966_ÅR_EG     >   TT_ETTER_1966_ÅR_EK               00002630
                                                            THEN        00002640
             B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(          00002650
                                          SUM_TP,0,'JA',                00002660
                                          ST_PROSENT_SAMST,             00002670
                                          APD_GRAD,                     00002680
                                          TT_ETTER_1966_ÅR_EG);         00002690
       ELSE                                                             00002700
             B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(          00002710
                                          SUM_TP,0,'JA',                00002720
                                          ST_PROSENT_SAMST,             00002730
                                          APD_GRAD,                     00002740
                                          TT_ETTER_1966_ÅR_EK);         00002750
      END;                                                              00002760
     END;                                                               00002770
  END; /*??? MANGLER DET IKKE EN END  TRUDE, 140990   */                00002780
               /*---------------------------------------------------*/  00002790
               /* PENSJONISTENE FLYTTER TIL UTLANDET 3.1.5.4        */  00002800
               /*---------------------------------------------------*/  00002810
                                                                        00002820
                                                                        00002830
  IF B01.SPESOPPL.BOSATT(BER_SØ_IND) = 000 &                            00002840
     B01.PENSJONSTYPE1  (BER_SØ_IND) = 'A' &                            00002850
     B02.SPESOPPL.BOSATT(BER_SØ_IND) > 000  THEN                        00002860
     DO;                                                                00002870
       IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'S'  THEN                     00002880
         DO;                                                            00002890
            B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(           00002900
                                           B02.ALDERSP.TP(BER_SØ_IND),  00002910
                                           0,'JA',                      00002920
                                           ST_PROSENT_SAMST,            00002930
                                           APD_GRAD,                    00002940
                                           B02.TT_ANV(BER_SØ_IND));     00002950
         END;    /* HIT 23.01.90 */                                     00002960
     END; /* HAR VÆRT BOSATT I NORGE , FLYTTER TIL UTLANDET */          00002970
                                                                        00002980
          /* DEN ENE AV EKTEFELLENE BLE TILSTÅTT PENSJON MED ST */      00002990
          /* I NORGE .DEN ANDRE TILSTÅS PENSJON UNDER BOSETTING */      00003000
          /* I UTLANDET.   ER DENNE TESTEN GOD NOK ??????       */      00003010
                                                                        00003020
  IF (B01.SPESOPPL.BOSATT(BER_SØ_IND) = 000    &                        00003030
      B01.ALDERSP.ST(BER_SØ_IND)      > 0   )  &                        00003040
      B02.PENSJONSTYPE2(BER_SØ_IND)   = 'S'    &                        00003050
      B02.SPESOPPL.BOSATT(BER_EK_IND) > 000    THEN                     00003060
       DO;                                                              00003070
          IF B02.TT_ANV(BER_SØ_IND)  >  B02.TT_ANV(BER_EK_IND) THEN     00003080
            DO;                                                         00003090
               W_ST_DEL1 = F_BEREGN_SÆRTILLEGG(                         00003100
                                               SUM_TP,0,'N',            00003110
                                               ST_PROSENT_ENSLIG,       00003120
                                               APD_GRAD,                00003130
                      (B02.TT_ANV(BER_SØ_IND)- B02.TT_ANV(BER_EK_IND)));00003140
                                                                        00003150
               W_ST_DEL2 = F_BEREGN_SÆRTILLEGG(                         00003160
                                          SUM_TP,0,'N',                 00003170
                                          ST_PROSENT_SAMST,             00003180
                                          APD_GRAD,                     00003190
                                          B02.TT_ANV(BER_EK_IND));      00003200
               B02.ALDERSP.ST(BER_SØ_IND) = W_ST_DEL1 + W_ST_DEL2 + 0.5;00003210
            END;                                                        00003220
          ELSE                                                          00003230
               B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(        00003240
                                          SUM_TP,0,'JA',                00003250
                                          ST_PROSENT_SAMST,             00003260
                                          APD_GRAD,                     00003270
                                          B02.TT_ANV(BER_SØ_IND));      00003280
       END;                                                             00003290
                                                                        00003300
         /*----------------------------------------------------*/       00003310
         /*DERSOM BARE RETTIGHETER ETTER KAP11 IKKE ST!!!!     */       00003320
         /*----------------------------------------------------*/       00003330
                                                                        00003340
       IF B02.DØD_AV_YRKESSKADE(BER_SØ_IND)   = 'E' &                   00003350
          B02.YRKEPENS.YUG(BER_EK_IND)        = 100  THEN               00003360
          B02.ALDERSP.ST(BER_SØ_IND)          = 0;                      00003370
                                                                        00003380
                                                                        00003390
         /*----------------------------------------------------*/       00003400
         /*KONVENSJON DERSOM TT MINDRE ENN 3 ÅR                */       00003410
         /*----------------------------------------------------*/       00003420
                                                                        00003430
        IF (TT_ETTER_1966_ÅR_EG         < 3 &                           00003440
            TT_ETTER_1966_ÅR_EG         > 0 &                           00003450
            B02.KONVENSJON(BER_SØ_IND)  = 'J') THEN                     00003460
             DO;                                                        00003470
               IF B02.PENSJONSTYPE2(BER_SØ_IND)  ^= 'S' THEN            00003480
                  B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(     00003490
                                        SUM_TP,0,'JA',                  00003500
                                        ST_PROSENT_ENSLIG,              00003510
                                        APD_GRAD,                       00003520
                                        TT_ETTER_1966_ÅR_EG);           00003530
               ELSE                                                     00003540
                IF B02.PENSJONSTYPE2(BER_SØ_IND)  = 'S' THEN            00003550
                   B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(    00003560
                                        SUM_TP,0,'JA',                  00003570
                                        ST_PROSENT_SAMST,               00003580
                                        APD_GRAD,                       00003590
                                        TT_ETTER_1966_ÅR_EG);           00003600
             END;       /*TT_E66 < 3 OG J I KONVENSJON */               00003610
                                                                        00003620
   RETUR:                                                               00003630
                                                                        00003640
  END SÆRTILLEGG_UTLAND;                                                00003650
