 /*       SIST ENDRET 13/03-97 11.51.30 AV   JDA7339                  */00000000
 /*       SIST ENDRET 12/04-94 15.04.20 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 19/02-92 15.00.23 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 13/12-91 13.10.52 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 26/04-91 13.13.00 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 14/04-89 14.59.04 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 14/12-88 14.31.42 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 19/04-88 11.24.57 AV   HERMAN                   */00000070
 /*       SIST ENDRET 17/07-86 11.54.21 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 16/07-86 09.25.09 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 06/05-86 07.57.45 AV   FARVIK                   */00000100
 /*       SIST ENDRET 15/04-86 10.44.02 AV   FARVIK                   */00000110
 /*       SIST ENDRET 24/03-86 14.21.16 AV   FARVIK                   */00000120
 /*       SIST ENDRET 29/11-85 09.31.57 AV   FARVIK                   */00000130
 /*       SIST ENDRET 07/02-84 12.18.06 AV   BREIVIK                  */00000140
 /*********************************************************************/00000150
 /*                                                                   */00000160
 /* IDENTIFIKASJON:                                                   */00000170
 /*    R0016101                                                       */00000180
 /*                                                                   */00000190
 /*    PROGRAMMERER: P. BREIVIK, NOV 1982.                            */00000200
 /*                                                                   */00000210
 /* HENSIKT:                                                          */00000220
 /*    GENERERING AV GS/HSU-SEGMENTER TIL STAT-TRANS-BASEN.           */00000230
 /*                                                                   */00000240
 /* PROGRAMTILKNYTNING:                                               */00000250
 /*                                                                   */00000260
 /* BRUK:                                                             */00000270
 /*                                                                   */00000280
 /* ENDRET UKE 15 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S               */00000290
 /*            NY SIVILSTANDSKODE = 60 (P) OG 00 (W)                  */00000300
 /*********************************************************************/00000310
                                                                        00000320
 R001610: PROC (COMMAREA_PEKER) OPTIONS (MAIN);                         00000330
 DCL (COMMAREA_PEKER)        POINTER;                                   00000340
 %PAGE;                                                                 00000350
 %INCLUDE P0019906; /* TRANS_OPPL_OMR */                                00000360
 %SKIP(4);                                                              00000370
 %INCLUDE P0019910; /* STYRINGS_OMR   */                                00000380
 %SKIP(4);                                                              00000390
 %INCLUDE P0019908; /* KOM_OMR */                                       00000400
 %SKIP(4);                                                              00000410
 %INCLUDE P0019912; /* DIV_PARAM_OMR */                                 00000420
 %PAGE;                                                                 00000430
 DCL                                                                    00000440
   1 TRANS_LISTE_OMR UNAL BASED      (TRANS_LISTE_PEKER),               00000450
     3 TRANS_LISTE_LINJE(5),                                            00000460
 %INCLUDE P0019911;  /*  TRANS-LISTE UNDERNIVÅ   */                     00000470
 %PAGE;                                                                 00000480
 %INCLUDE P0010701; /* TRANS_OMR */                                     00000490
 %PAGE;                                                                 00000500
 %INCLUDE P0016001; /* BOOLSK SEGMENT-TABELL */                         00000510
                                                                        00000520
 %PAGE;                                                                 00000530
 DCL 1 TR0ROT,                                                          00000540
 %INCLUDE P0018201; /* ARBEIDSOMRÅDE TR0ROT               */            00000550
 DCL 1 REGTPKT,                                                         00000560
 %INCLUDE P0018202; /* ARBEIDSOMRÅDE REGTPKT              */            00000570
                                                                        00000580
 %PAGE;                                                                 00000590
 DCL 1 SIVILST,                                                         00000600
 %INCLUDE P0018204; /* ARBEIDSOMRÅDE SIVILST              */            00000610
                                                                        00000620
 %PAGE;                                                                 00000630
 DCL 1 GS,                                                              00000640
 %INCLUDE P0018212; /* ARBEIDSOMRÅDE GS                   */            00000650
 DCL 1 HSU,                                                             00000660
 %INCLUDE P0018213; /* ARBEIDSOMRÅDE HSU                  */            00000670
                                                                        00000680
 %PAGE;                                                                 00000690
 DCL 1 DIAGNOSE,                                                        00000700
 %INCLUDE P0018216; /* ARBEIDSOMRÅDE DIAGNOSE             */            00000710
                                                                        00000720
                                                                        00000730
    /* ************************************************************** */00000740
    /*   ROT_SEGMENT.                                                 */00000750
    /* ************************************************************** */00000760
                                                                        00000770
 DCL 1  RF0PERSN               UNALIGNED,                               00000780
   %INCLUDE P0019927;                                                   00000790
 %PAGE;                                                                 00000800
 /*-------------------------------------------------------------------*/00000810
 /*                                                                   */00000820
 /*   DL/1 PARAMETRE                                                  */00000830
 /*                                                                   */00000840
 /*-------------------------------------------------------------------*/00000850
                                                                        00000860
 %INCLUDE DLIUIB;                                                       00000870
 DCL PLITDLI                 EXTERNAL ENTRY;                            00000880
                                                                        00000890
 DCL UIB_RC_OK               BIT (8) INIT(0);    /* KONSTANT */         00000900
 DCL 1 TR0_PCB_PEKER         BASED (UIBPCBAL),                          00000910
       2 TR0_PCB_PTR         POINTER;                                   00000920
                                                                        00000930
 DCL INSERT                  CHAR (4) INIT('ISRT');                     00000940
 DCL PARAM_COUNT_3           FIXED BIN (31) INIT(3);                    00000950
 DCL PARAM_COUNT_4           FIXED BIN (31) INIT(4);                    00000960
 DCL PARAM_COUNT_5           FIXED BIN (31) INIT(5);                    00000970
 DCL PARAM_COUNT_6           FIXED BIN (31) INIT(6);                    00000980
                                                                        00000990
                                                                        00001000
 /*-------------------------------------------------------------------*/00001010
 /*                                                                   */00001020
 /*   DEKLARASJON AV SSA                                              */00001030
 /*                                                                   */00001040
 /*-------------------------------------------------------------------*/00001050
                                                                        00001060
                                                                        00001070
 DCL    SSA_UQUAL_ROT        STATIC CHAR ( 9) INIT('RF0PERSN ')  ;      00001080
                                                                        00001090
                                                                        00001100
 DCL SSA_UNQUAL              CHAR (9);                                  00001110
                                                                        00001120
 DCL 1 SSA_TR0ROT UNALIGNED,                                            00001130
       2 HOVEDDEL            CHAR (17) INIT('TR0ROT  (FNR     '),       00001140
       2 REL_OP              CHAR (2)  INIT(' ='),                      00001150
       2 FNR_KEY             FIXED DEC (11),                            00001160
       2 END_MRK             CHAR (1)  INIT(')');                       00001170
                                                                        00001180
 DCL 1 SSA_REGTPKT UNALIGNED,                                           00001190
       2 HOVEDDEL            CHAR (17) INIT('REGTPKT (DATOKL  '),       00001200
       2 REL_OP              CHAR (2)  INIT(' ='),                      00001210
       2 DATOKL_KEY          FIXED DEC (15),                            00001220
       2 END_MRK             CHAR (1)  INIT(')');                       00001230
                                                                        00001240
 /*-------------------------------------------------------------------*/00001250
 /*                                                                   */00001260
 /*   PCB-OMRÅDE                                                      */00001270
 /*                                                                   */00001280
 /*-------------------------------------------------------------------*/00001290
                                                                        00001300
 %INCLUDE P0012002;                                                     00001310
                                                                        00001320
 DCL 1 TR0_PCB               BASED (TR1_PCB_PEKER),                     00001330
 %INCLUDE P0012003; /* PCB-OMRÅDE */                                    00001340
 DCL 1 RF1                   BASED (RF1_PCB_PEKER),                     00001350
 %INCLUDE P0012003; /* PCB-OMRÅDE */                                    00001360
                                                                        00001370
 %PAGE;                                                                 00001380
 /*-------------------------------------------------------------------*/00001390
 /*                                                                   */00001400
 /*   HJELPEVARIABLE                                                  */00001410
 /*                                                                   */00001420
 /*-------------------------------------------------------------------*/00001430
                                                                        00001440
 DCL TRUE                    BIT(1) INIT('1'B);                         00001450
 DCL FALSE                   BIT(1) INIT('0'B);                         00001460
 DCL FATAL_FEIL              BIT(1) INIT('0'B);                         00001470
 DCL (ENDRET,TP_ENDRET,                                                 00001480
      FUNNET,FEIL)           BIT(1);                                    00001490
 DCL HELP_FNR                PIC '(11)9';                               00001500
 DCL HJELP_FNR                PIC '(11)9';                              00001510
 DCL HELP_DATO               PIC '9999';                                00001520
 DCL HJELP_DATO               PIC '9999';                               00001530
 DCL PBR_TEXT                CHAR (50);                                 00001540
 DCL DATO_KLOKKE             PIC '(15)9',                               00001550
     DATO_ÅM                 PIC '9999' DEF DATO_KLOKKE,                00001560
     DATO                    PIC '(6)9' DEF DATO_KLOKKE,                00001570
     KLOKKE                  PIC '(9)9' DEF DATO_KLOKKE POS(7);         00001580
 DCL J                       FIXED BIN (15) ;                           00001590
 DCL IO_PEK                  POINTER;                                   00001600
 DCL IO_AREA                 CHAR (70);                                 00001610
 DCL IO_HELP_AREA            CHAR (70) BASED (IO_PEK);                  00001620
 DCL (DATE,                                                             00001630
      TIME,                                                             00001640
      SUBSTR,                                                           00001650
      CSTG,                                                             00001660
      ADDR,                                                             00001670
      MIN,                                                              00001680
      MAX,                                                              00001690
      LENGTH,                                                           00001700
      CHAR,                                                             00001710
      VERIFY,                                                           00001720
      HBOUND)                BUILTIN;                                   00001730
                                                                        00001740
 %PAGE;                                                                 00001750
 /*-------------------------------------------------------------------*/00001760
 /*                                                                   */00001770
 /* START PÅ PROGRAM LAG_STATISTIKK_TRANS_FOR_STØNADER                */00001780
 /*                                                                   */00001790
 /*-------------------------------------------------------------------*/00001800
                                                                        00001810
    UIBPTR = UIB_PEKER;                                                 00001820
    FEIL = TRUE;                                                        00001830
                                                                        00001840
 /*-------------------------------------------------------------------*/00001850
 /*                                                                   */00001860
 /* CLEAR SEGMENT-TABELLEN OG ARBEIDSFELTENE FOR BASE-SEGMENTENE.     */00001870
 /*                                                                   */00001880
 /*-------------------------------------------------------------------*/00001890
                                                                        00001900
    SEGMENT_TABELL = '';                                                00001910
    TR0ROT         = '';                                                00001920
    REGTPKT        = '';                                                00001930
    SIVILST        = '';                                                00001940
    GS             = '';                                                00001950
    HSU            = '';                                                00001960
    DIAGNOSE       = '';                                                00001970
                                                                        00001980
                                                                        00001990
    TR0ROT.FNR = TRANS_OMR.USS.FNR;                                     00002000
                                                                        00002010
    SEGMENT_TABELL.REGTPKT      = TRUE;                                 00002020
    HJELP_FNR  = TRANS_OPPL_OMR.FØDSNUMMER;                             00002030
    HJELP_DATO = TRANS_OPPL_OMR.VIRKNINGSDATO;                          00002040
                                                                        00002050
    IF F_NUMERISK(F_FELT_PIC_CHAR4(USS.VIRK_DATO_MÅ)) &                 00002060
         F_GYLDIG_DATO(USS.VIRK_DATO_MÅ)  THEN                          00002070
       REGTPKT.VIRKDATO =                                               00002080
                           SUBSTR(TRANS_OMR.USS.VIRK_DATO_MÅ,3,2) !!    00002090
                           SUBSTR(TRANS_OMR.USS.VIRK_DATO_MÅ,1,2);      00002100
    ELSE                                                                00002110
       REGTPKT.VIRKDATO =                                               00002120
                           SUBSTR(HJELP_DATO,3,2) !!                    00002130
                           SUBSTR(HJELP_DATO,1,2);                      00002140
    REGTPKT.TKNR                    = TRANS_OMR.USS.TKNR;               00002150
    REGTPKT.STATSBORGER             = TRANS_OMR.USS.STATSBORGER;        00002160
                                                                        00002170
    IF TRANS_OMR.USS.GS_DIAG > ' ' THEN                                 00002180
       DO;                                                              00002190
          DIAGNOSE.PRIMDIAG_GS  =  TRANS_OMR.USS.GS_DIAG;               00002200
          SEGMENT_TABELL.DIAGNOSE  = TRUE;                              00002210
       END;                                                             00002220
    IF TRANS_OMR.USS.HSU_DIAG > ' ' THEN                                00002230
       DO;                                                              00002240
          DIAGNOSE.PRIMDIAG_HSU =  TRANS_OMR.USS.HSU_DIAG;              00002250
          SEGMENT_TABELL.DIAGNOSE  = TRUE;                              00002260
       END;                                                             00002270
                                                                        00002280
    IF TRANS_OMR.USS.SIVILSTAND ^= ' ' THEN                             00002290
    DO;                                                                 00002300
       SEGMENT_TABELL.SIVILST   = TRUE;                                 00002310
       SELECT (TRANS_OMR.USS.SIVILSTAND);                               00002320
          WHEN ('G') SIVILST.SIVILSTAND = 29;                           00002330
          WHEN ('U') SIVILST.SIVILSTAND = 10;                           00002340
          WHEN ('A') SIVILST.SIVILSTAND = 24;                           00002350
          WHEN ('S') SIVILST.SIVILSTAND = 40;                           00002360
          WHEN ('E') SIVILST.SIVILSTAND = 30;                           00002370
          WHEN ('P') SIVILST.SIVILSTAND = 60;                           00002380
          WHEN ('W') SIVILST.SIVILSTAND = 00;                           00002390
          OTHERWISE  SIVILST.SIVILSTAND = 99;                           00002400
       END;                                                             00002410
    END;                                                                00002420
                                                                        00002430
    IF TRANS_OMR.USS.GS_SATS ^= ' ' THEN                                00002440
    DO;                                                                 00002450
       SEGMENT_TABELL.GS    = TRUE;                                     00002460
       IF VERIFY (TRANS_OMR.USS.GS_SATS, '01234567') = 0  THEN          00002470
          GS.GS_SATS        = TRANS_OMR.USS.GS_SATS + 1; /*9702SOB*/    00002480
       ELSE                                                             00002490
          GS.GS_SATS        = 0 ;                                       00002500
                                                                        00002510
       GS.GS_KODE(*)        = TRANS_OMR.USS.GS_KODE(*);                 00002520
       DO J = 1 TO 3;                                                   00002530
          IF VERIFY (GS.GS_KODE(J), '123456789 ') ^= 0 THEN             00002540
             GS.GS_KODE(J) = ' ';                                       00002550
       END;                                                             00002560
    END;                                                                00002570
                                                                        00002580
    IF TRANS_OMR.USS.HSU_SATS ^= ' ' THEN                               00002590
    DO;                                                                 00002600
       SEGMENT_TABELL.HSU   = TRUE;                                     00002610
       IF VERIFY (TRANS_OMR.USS.HSU_SATS, '0123456') = 0  THEN          00002620
          HSU.HSU_SATS      = TRANS_OMR.USS.HSU_SATS + 1;/*9702SOB*/    00002630
       ELSE                                                             00002640
          HSU.HSU_SATS      = 0 ;                                       00002650
                                                                        00002660
       HSU.HSU_KODE(1)      = TRANS_OMR.USS.HSU_KODE;                   00002670
       HSU.HSU_KODE(2)      = ' ' ;                                     00002680
       IF VERIFY (HSU.HSU_KODE(1), '12 ') ^= 0 THEN                     00002690
          HSU.HSU_KODE(1) = ' ';                                        00002700
    END;                                                                00002710
                                                                        00002720
                                                                        00002730
                                                                        00002740
  DIV_PARAM_OMR.FEIL_MELD_NR = 0;                                       00002750
                                                                        00002760
  CALL SKRIV_STAT_SEGM;                                                 00002770
  IF DIV_PARAM_OMR.FEIL_MELD_NR > 0 THEN                                00002780
     DO;                                                                00002790
        FEIL = TRUE;                                                    00002800
        GO TO UTGANG;                                                   00002810
     END;                                                               00002820
  KOM_OMR.PEKER_LISTE.TRANS_LISTE_PEKER = ADDR(KOM_OMR.TRANS_LISTE_OMR);00002830
  KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER   = ADDR(KOM_OMR.DIV_PARAM_OMR);  00002840
  KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER  = ADDR(KOM_OMR.TRANS_OPPL_OMR); 00002850
                                                                        00002860
  FEIL = FALSE;                                                         00002870
                                                                        00002880
  CALL OPPDATER_TRANSLISTE;                                             00002890
                                                                        00002900
  ANTALL_TRANS_I_TRANS_LISTE = 1;                                       00002910
                                                                        00002920
  EXEC CICS LINK PROGRAM('R0015301') COMMAREA (KOM_OMR);                00002930
                                                                        00002940
  IF DB_STATUS_KODE = 'GE' THEN                                         00002950
     DO;                                                                00002960
        DB_STATUS_KODE             = '  ';                              00002970
        DIV_PARAM_OMR.FEIL_MELD_NR = 0   ;                              00002980
        CALL DANN_DUMMY_ROTSEGM;                                        00002990
        EXEC CICS LINK PROGRAM('R0015301') COMMAREA (KOM_OMR);          00003000
     END;                                                               00003010
                                                                        00003020
  IF DIV_PARAM_OMR.FEIL_MELD_NR > 0 THEN                                00003030
     DO;                                                                00003040
        FEIL = TRUE;                                                    00003050
        GO TO UTGANG;                                                   00003060
     END;                                                               00003070
  ELSE                                                                  00003080
     DIV_PARAM_OMR.PROGRAM_ID = 'R0016101';                             00003090
                                                                        00003100
  TRANS_OPPL_OMR.TRANSKODE = 'R041';                                    00003110
                                                                        00003120
  EXEC CICS RETURN;                                                     00003130
                                                                        00003140
 UTGANG:                                                                00003150
 /*-------------------------------------------------------------------*/00003160
 /*                                                                   */00003170
 /* PROGRAMKONTROLLEN ENDER HER NÅR ALL OPPDATERING ER FORETATT       */00003180
 /* ELLER NÅR DET ER DETEKTERT EN FEIL I OPPDATERING AV ET SEGMENT.   */00003190
 /* VARIABELEN 'FEIL' AVGJØR FEIL-STATUS.                             */00003200
 /*                                                                   */00003210
 /*-------------------------------------------------------------------*/00003220
                                                                        00003230
    IF FEIL THEN                                                        00003240
       DO;                                                              00003250
          PBR_TEXT = 'DL/I-RETUR-KODE = ' !!                            00003260
                     CHAR(DLIUIB.UIBRCODE.UIBFCTR) !!                   00003270
                     'DB_STATUS_KODE = ' !! DB_STATUS_KODE;             00003280
          EXEC CICS SEND TEXT FROM (PBR_TEXT)                           00003290
                                      ERASE JUSTIFY (16) ACCUM PAGING;  00003300
                                                                        00003310
          PBR_TEXT =                                                    00003320
                     'TR0_PCB.STATUS_KODE = ' !! TR0_PCB.STATUS_KODE;   00003330
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (17) ACCUM PAGING;00003340
                                                                        00003350
          PBR_TEXT = 'SEGMENT-NIVÅ = ' !! TR0_PCB.SEGM_NIVAA;           00003360
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (18) ACCUM PAGING;00003370
                                                                        00003380
                                                                        00003390
          PBR_TEXT = 'FEIL_MELD_NR : ' !! FEIL_MELD_NR;                 00003400
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (19) ACCUM PAGING;00003410
                                                                        00003420
          PBR_TEXT = 'FEIL_VED_LABEL = ' !! FEIL_VED_LABEL;             00003430
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (20) ACCUM PAGING;00003440
                                                                        00003450
          PBR_TEXT = 'AKTUELT FNR  :  ' !! CHAR(HELP_FNR);              00003460
                                                                        00003470
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (22) ACCUM PAGING;00003480
                                                                        00003490
                                                                        00003500
          PBR_TEXT = 'TRANSAKSJONEN ER KANSELERT.';                     00003510
                                                                        00003520
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (24) ACCUM PAGING;00003530
                                                                        00003540
          PBR_TEXT = 'TA UTSKRIFT OG KONTAKT FARVIK ELLER TRY.';        00003550
                                                                        00003560
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (26) ACCUM PAGING;00003570
          EXEC CICS SEND PAGE;                                          00003580
                                                                        00003590
          EXEC CICS ABEND ABCODE('TRY');                                00003600
       END;                                                             00003610
    ELSE                                                                00003620
       PBR_TEXT = 'NORMAL AVSLUTNING PÅ PROGRAM R0016101';              00003630
                                                                        00003640
  DANN_DUMMY_ROTSEGM:PROC;                                              00003650
                                                                        00003660
    RF0PERSN.FNR                     =                                  00003670
                                           TRANS_OMR.USS.FNR;           00003680
    RF0PERSN.NAVN                    =     ' ';                         00003690
    RF0PERSN.TKNR                    =                                  00003700
                                                   TRANS_OMR.USS.TKNR;  00003710
    RF0PERSN.SPRÅK                   =     ' '      ;                   00003720
    RF0PERSN.AI67                    =     0        ;                   00003730
    RF0PERSN.SPERRE                  =     ' '      ;                   00003740
                                                                        00003750
    CALL PLITDLI                          (PARAM_COUNT_4,               00003760
                                           INSERT,                      00003770
                                           RF1,                         00003780
                                           RF0PERSN,                    00003790
                                           SSA_UQUAL_ROT);              00003800
                                                                        00003810
    IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN            00003820
               DO;                                                      00003830
           /* ******************************************** */           00003840
           /* FEIL VED SKRIV AV :  ROT                     */           00003850
           /* ******************************************** */           00003860
  L100:                                                                 00003870
                  FEIL_MELD_NR                =    500 ;                00003880
                  FEIL_VED_LABEL              =   '100';                00003890
                  FEIL                        =   TRUE ;                00003900
                  DB_STATUS_KODE              =   ' '  ;                00003910
                  GO   TO  RETUR;                                       00003920
               END;                                                     00003930
                                                                        00003940
            IF   RF1.STATUS_KODE            ^=   '  '    THEN           00003950
               DO;                                                      00003960
           /* ******************************************** */           00003970
           /* FEIL VED SKRIV AV :  ROT                     */           00003980
           /* ******************************************** */           00003990
  L103:                                                                 00004000
                 FEIL_MELD_NR                =    500 ;                 00004010
                 FATAL_FEIL                  =   '1'B ;                 00004020
                 DB_STATUS_KODE              =   RF1.STATUS_KODE;       00004030
                 FEIL_VED_LABEL              =   '103';                 00004040
                 GO   TO  RETUR;                                        00004050
               END;                                                     00004060
                                                                        00004070
  RETUR:                                                                00004080
  END DANN_DUMMY_ROTSEGM;                                               00004090
                                                                        00004100
  OPPDATER_TRANSLISTE:                                                  00004110
  PROC;                                                                 00004120
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.TRANSKODE(1) =         00004130
                                            TRANS_OPPL_OMR.TRANSKODE;   00004140
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.FØDSNUMMER(1) =        00004150
                                           TRANS_OPPL_OMR.FØDSNUMMER;   00004160
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.VIRKNINGSDATO(1) =     00004170
                                        TRANS_OPPL_OMR.VIRKNINGSDATO;   00004180
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.BLANKETTYPE(1) =       00004190
                                          TRANS_OPPL_OMR.BLANKETTYPE;   00004200
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.TRANSTYPE(1) =         00004210
                                            TRANS_OPPL_OMR.TRANSTYPE;   00004220
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.TRANS_RETURKODE(1) =   00004230
                                      TRANS_OPPL_OMR.TRANS_RETURKODE;   00004240
      TRANS_LISTE_OMR.NY_GML_TRANS_IND(1) = 'N';                        00004250
                                                                        00004260
      TRANS_LISTE_OMR.VARIABEL_DEL(1) = KOM_OMR.TRANS_OMR;              00004270
  END OPPDATER_TRANSLISTE;                                              00004280
                                                                        00004290
 %PAGE;                                                                 00004300
 SKRIV_STAT_SEGM: PROC;                                                 00004310
                                                                        00004320
 /*-------------------------------------------------------------------*/00004330
 /*                                                                   */00004340
 /* PROSEDYREN LESER SEGMENT-TABELL OG SKRIVER UT DE SEGMENTENE TIL   */00004350
 /* TRANS-STAT-BASEN SOM HAR TILHØRENDE ELEMENTET I SEGMENT-TABELL    */00004360
 /* SATT TIL 'TRUE' (DVS '1'B). PROSEDYREN HENTER INFORMASJONEN       */00004370
 /* FRA ARBEIDS-OMRÅDE TIL TRANS-STAT-BASEN.                          */00004380
 /*                                                                   */00004390
 /*-------------------------------------------------------------------*/00004400
                                                                        00004410
 /* SETTING AV REGDATO'ER */                                            00004420
                                                                        00004430
    DATO   = DATE;                                                      00004440
    KLOKKE = TIME;                                                      00004450
    SIVILST.REGDATO = DATO_ÅM;                                          00004460
    GS.REGDATO      = DATO_ÅM;                                          00004470
    HSU.REGDATO     = DATO_ÅM;                                          00004480
                                                                        00004490
 /* BEHANDLING AV ROT-SEGMENT */                                        00004500
                                                                        00004510
                                                                        00004520
                                                                        00004530
                                                                        00004540
    HELP_FNR  = TR0ROT.FNR;                                             00004550
                                                                        00004560
    IF ^(F_NUMERISK(F_FELT_PIC_CHAR11(HELP_FNR)) &                      00004570
         F_GYLDIG_FNR(HELP_FNR)) THEN                                   00004580
                                                                        00004590
     IF  F_NUMERISK(F_FELT_PIC_CHAR11(HJELP_FNR)) &                     00004600
         F_GYLDIG_FNR(HJELP_FNR) THEN                                   00004610
                                                                        00004620
         TR0ROT.FNR = HJELP_FNR;                                        00004630
     ELSE                                                               00004640
       DO;                                                              00004650
          PBR_TEXT = 'TIDSPUNKT    :  ' !!                              00004660
                                              DATO_KLOKKE;              00004670
                                                                        00004680
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (18) ACCUM PAGING;00004690
                                                                        00004700
          PBR_TEXT = 'AKTUELT FNR  :  ' !! CHAR(HELP_FNR);              00004710
                                                                        00004720
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (20) ACCUM PAGING;00004730
                                                                        00004740
                                                                        00004750
          PBR_TEXT = 'TRANSAKSJONEN ER KANSELERT.';                     00004760
                                                                        00004770
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (24) ACCUM PAGING;00004780
                                                                        00004790
          PBR_TEXT = 'TA UTSKRIFT OG KONTAKT FARVIK ELLER TRY.';        00004800
                                                                        00004810
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (26) ACCUM PAGING;00004820
          EXEC CICS SEND PAGE;                                          00004830
                                                                        00004840
          EXEC CICS ABEND ABCODE('TRY');                                00004850
       END;                                                             00004860
                                                                        00004870
                                                                        00004880
                                                                        00004890
    PBR_TEXT = 'DANN ROTSEGMENT.  ID = ' !! HELP_FNR;                   00004900
                                                                        00004910
    SSA_UNQUAL = 'TR0ROT  ';                                            00004920
    CALL PLITDLI (PARAM_COUNT_4,                                        00004930
                  INSERT,                                               00004940
                  TR0_PCB,                                              00004950
                  TR0ROT,                                               00004960
                  SSA_UNQUAL);                                          00004970
    IF DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK !                           00004980
       ^(TR0_PCB.STATUS_KODE = '  ' ! TR0_PCB.STATUS_KODE = 'II') THEN  00004990
    DO;                                                                 00005000
 L100:                                                                  00005010
     /*--------------------------------------*/                         00005020
     /* FEIL VED INSERT-KALLET TIL TR0-BASEN */                         00005030
     /* SEGMENTET FANTES IKKE FRA FØR OG     */                         00005040
     /* LOT SEG HELLER IKKE LEGGE INN        */                         00005050
     /*--------------------------------------*/                         00005060
                                                                        00005070
        DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                             00005080
        DIV_PARAM_OMR.FEIL_VED_LABEL = 'L100';                          00005090
        GO TO UTGANG;                                                   00005100
    END;                                                                00005110
                                                                        00005120
                                                                        00005130
 /*-------------------------------*/                                    00005140
 /* BEHANDLING AV REGTPKT-SEGMENT */                                    00005150
 /*-------------------------------*/                                    00005160
                                                                        00005170
    SSA_TR0ROT.FNR_KEY = TR0ROT.FNR;                                    00005180
    IF SEGMENT_TABELL.REGTPKT THEN                                      00005190
    DO;                                                                 00005200
       REGTPKT.DATOKL = DATO_KLOKKE;                                    00005210
       PBR_TEXT = 'DANN REGTPKT-SEGMENT.  ID = ' !! DATO_KLOKKE;        00005220
    /* EXEC CICS SEND TEXT FROM (PBR_TEXT) ACCUM; */                    00005230
                                                                        00005240
       IO_PEK = ADDR (REGTPKT);                                         00005250
       IO_AREA = IO_HELP_AREA;                                          00005260
       SSA_UNQUAL = 'REGTPKT ';                                         00005270
       CALL PLITDLI (PARAM_COUNT_5,                                     00005280
                     INSERT,                                            00005290
                     TR0_PCB,                                           00005300
                     IO_AREA,                                           00005310
                     SSA_TR0ROT,                                        00005320
                     SSA_UNQUAL);                                       00005330
       IF DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK !                        00005340
          TR0_PCB.STATUS_KODE ^= '  ' THEN                              00005350
       DO;                                                              00005360
 L110:                                                                  00005370
       /*------------------------------------------------*/             00005380
       /* FEIL VED INSERT-KALLET TIL TR0-BASEN           */             00005390
       /* UNIKT REGTPKT-SEGMENTET LOT SEG IKKE LEGGE INN */             00005400
       /*------------------------------------------------*/             00005410
                                                                        00005420
          DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                           00005430
          DIV_PARAM_OMR.FEIL_VED_LABEL = 'L110';                        00005440
          GO TO UTGANG;                                                 00005450
       END;                                                             00005460
    END;                                                                00005470
                                                                        00005480
    SSA_REGTPKT.DATOKL_KEY = REGTPKT.DATOKL;                            00005490
                                                                        00005500
 /*-------------------------------*/                                    00005510
 /* BEHANDLING AV SIVILST-SEGMENT */                                    00005520
 /*-------------------------------*/                                    00005530
                                                                        00005540
    IF SEGMENT_TABELL.SIVILST THEN                                      00005550
    DO;                                                                 00005560
       PBR_TEXT = 'DANN SIVILST-SEGMENT';                               00005570
    /* EXEC CICS SEND TEXT FROM (PBR_TEXT) ACCUM; */                    00005580
                                                                        00005590
       IO_PEK = ADDR(SIVILST);                                          00005600
       IO_AREA = IO_HELP_AREA;                                          00005610
       SSA_UNQUAL = 'SIVILST ';                                         00005620
       CALL PLITDLI (PARAM_COUNT_6,                                     00005630
                     INSERT,                                            00005640
                     TR0_PCB,                                           00005650
                     IO_AREA,                                           00005660
                     SSA_TR0ROT,                                        00005670
                     SSA_REGTPKT,                                       00005680
                     SSA_UNQUAL);                                       00005690
       IF DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK !                        00005700
          TR0_PCB.STATUS_KODE ^= '  ' THEN                              00005710
       DO;                                                              00005720
 L120:                                                                  00005730
           /*-------------------------------------------*/              00005740
           /* FEIL VED INSERT-KALLET TIL TR0-BASEN      */              00005750
           /* SIVILST-SEGMENTET LOT SEG IKKE LEGGE INN  */              00005760
           /*-------------------------------------------*/              00005770
                                                                        00005780
           DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                          00005790
           DIV_PARAM_OMR.FEIL_VED_LABEL = 'L120';                       00005800
           GO TO UTGANG;                                                00005810
        END;                                                            00005820
     END;                                                               00005830
                                                                        00005840
                                                                        00005850
 /*--------------------------*/                                         00005860
 /* BEHANDLING AV GS-SEGMENT */                                         00005870
 /*--------------------------*/                                         00005880
                                                                        00005890
    IF SEGMENT_TABELL.GS THEN                                           00005900
    DO;                                                                 00005910
       PBR_TEXT = 'DANN GS-SEGMENT';                                    00005920
    /* EXEC CICS SEND TEXT FROM (PBR_TEXT) ACCUM; */                    00005930
                                                                        00005940
       IO_PEK = ADDR(GS);                                               00005950
       IO_AREA = IO_HELP_AREA;                                          00005960
       SSA_UNQUAL = 'GS      ';                                         00005970
       CALL PLITDLI (PARAM_COUNT_6,                                     00005980
                     INSERT,                                            00005990
                     TR0_PCB,                                           00006000
                     IO_AREA,                                           00006010
                     SSA_TR0ROT,                                        00006020
                     SSA_REGTPKT,                                       00006030
                     SSA_UNQUAL);                                       00006040
       IF DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK !                        00006050
          TR0_PCB.STATUS_KODE ^= '  ' THEN                              00006060
       DO;                                                              00006070
 L130:                                                                  00006080
           /*---------------------------------------*/                  00006090
           /* FEIL VED INSERT-KALLET TIL TR0-BASEN  */                  00006100
           /* GS-SEGMENTET LOT SEG IKKE LEGGE INN   */                  00006110
           /*---------------------------------------*/                  00006120
                                                                        00006130
           DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                          00006140
           DIV_PARAM_OMR.FEIL_VED_LABEL = 'L130';                       00006150
           GO TO UTGANG;                                                00006160
        END;                                                            00006170
     END;                                                               00006180
                                                                        00006190
 /*---------------------------*/                                        00006200
 /* BEHANDLING AV HSU-SEGMENT */                                        00006210
 /*---------------------------*/                                        00006220
                                                                        00006230
    IF SEGMENT_TABELL.HSU THEN                                          00006240
    DO;                                                                 00006250
       PBR_TEXT = 'DANN HSU-SEGMENT';                                   00006260
    /* EXEC CICS SEND TEXT FROM (PBR_TEXT) ACCUM; */                    00006270
                                                                        00006280
       IO_PEK = ADDR (HSU);                                             00006290
       IO_AREA = IO_HELP_AREA;                                          00006300
       SSA_UNQUAL = 'HSU     ';                                         00006310
       CALL PLITDLI (PARAM_COUNT_6,                                     00006320
                     INSERT,                                            00006330
                     TR0_PCB,                                           00006340
                     IO_AREA,                                           00006350
                     SSA_TR0ROT,                                        00006360
                     SSA_REGTPKT,                                       00006370
                     SSA_UNQUAL);                                       00006380
       IF DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK !                        00006390
          TR0_PCB.STATUS_KODE ^= '  ' THEN                              00006400
       DO;                                                              00006410
 L140:                                                                  00006420
        /*--------------------------------------------*/                00006430
        /* FEIL VED INSERT-KALLET TIL TR0-BASEN       */                00006440
        /* UNIKT HSU-SEGMENTET LOT SEG IKKE LEGGE INN */                00006450
        /*--------------------------------------------*/                00006460
                                                                        00006470
           DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                          00006480
           DIV_PARAM_OMR.FEIL_VED_LABEL = 'L140';                       00006490
           GO TO UTGANG;                                                00006500
        END;                                                            00006510
     END;                                                               00006520
                                                                        00006530
 /*--------------------------------*/                                   00006540
 /* BEHANDLING AV DIAGNOSE-SEGMENT */                                   00006550
 /*--------------------------------*/                                   00006560
                                                                        00006570
    IF SEGMENT_TABELL.DIAGNOSE THEN                                     00006580
    DO;                                                                 00006590
       PBR_TEXT = 'DANN DIAGNOSE-SEGMENT';                              00006600
    /* EXEC CICS SEND TEXT FROM (PBR_TEXT) ACCUM; */                    00006610
                                                                        00006620
       IO_PEK = ADDR (DIAGNOSE);                                        00006630
       IO_AREA = IO_HELP_AREA;                                          00006640
       SSA_UNQUAL = 'DIAGNOSE';                                         00006650
       CALL PLITDLI (PARAM_COUNT_6,                                     00006660
                     INSERT,                                            00006670
                     TR0_PCB,                                           00006680
                     IO_AREA,                                           00006690
                     SSA_TR0ROT,                                        00006700
                     SSA_REGTPKT,                                       00006710
                     SSA_UNQUAL);                                       00006720
       IF DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK !                        00006730
          TR0_PCB.STATUS_KODE ^= '  ' THEN                              00006740
       DO;                                                              00006750
 L150:                                                                  00006760
        /*-------------------------------------------------*/           00006770
        /* FEIL VED INSERT-KALLET TIL TR0-BASEN            */           00006780
        /* UNIKT DIAGNOSE-SEGMENTET LOT SEG IKKE LEGGE INN */           00006790
        /*-------------------------------------------------*/           00006800
                                                                        00006810
           DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                          00006820
           DIV_PARAM_OMR.FEIL_VED_LABEL = 'L150';                       00006830
           GO TO UTGANG;                                                00006840
        END;                                                            00006850
     END;                                                               00006860
                                                                        00006870
 END SKRIV_STAT_SEGM;                                                   00006880
                                                                        00006890
                                                                        00006900
                                                                        00006910
  %INCLUDE R0019901 ;    /* DATO_KONTROLL */                            00006920
  %INCLUDE R0019904 ;    /* FNR-KONTROLL  */                            00006930
  %INCLUDE R0019910 ;    /* NUM-KONTROLL  */                            00006940
  %INCLUDE R0019912 ;    /* KONV FRA NUM TIL CHAR OG OMVENDT */         00006950
                                                                        00006960
 END; /* OF PROGRAM R0016101 */                                         00006970
