 /*       SIST ENDRET 11/12-90 13.20.46 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 16/05-88 12.26.36 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 12/05-87 08.29.09 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 28/06-84 08.35.26 AV   OLAV                     */00000030
 /*       SIST ENDRET 12/06-84 11.17.19 AV   FARVIK                   */00000040
 /*       SIST ENDRET 04/06-84 11.00.14 AV   FARVIK                   */00000050
 /*       SIST ENDRET 09/11-83 07.58.02 AV   FARVIK                   */00000060
 /*       SIST ENDRET 21/09-83 13.40.56 AV   HERMAN                   */00000070
 /*       SIST ENDRET 08/12-82 12.17.41 AV   FARVIK                   */00000080
 %SKIP;                                /*  */                           00000090
 /* ***************************************************************** */00000100
 /*                                                                   */00000110
 /* ***************************************************************** */00000120
 /*IDENTIFIKASJON:                                                    */00000130
 /* **********************                                            */00000140
 /*  PROGRAM-IDENT : R0010504  AP_BARN                 SUBPROGRAM     */00000150
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000160
 /*  PROGRAMMERER  : INGER SLOTTE                                     */00000170
 /*  PROGRAMMET BLE LAGET : MARS 1981                                 */00000180
 /*  ENDRINGERSDATO :                                                 */00000190
 /*  ENDRINGEN GJELDER:                                               */00000200
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000210
 /*                                                                   */00000220
 /* ***************************************************************** */00000230
 /*  ENDRINGERSDATO :          220487                                 */00000240
 /*  ENDRINGEN GJELDER:        PROSEDYREN OVERFØR_AP_BARN ER FLYTTET  */00000250
 /*                            TIL PROGRAM R0010510                   */00000260
 /*  ENDRINGEN BLE UTFØRT AV : BRITT                                  */00000270
 /*                                                                   */00000280
 /* ***************************************************************** */00000290
 /*HENSIKT:                                                           */00000300
 /* **********                                                        */00000310
 /*  BRUKES VED REGISTRERING AV GRUNNBLANKETT_AP.                     */00000320
 /*  KONTROLLERER OPPLYSNINGER OM FORSØRGET BARN                      */00000330
 /*  PROSEDYREN MÅ CALLES MED PARAMETER                               */00000340
 /*  (FEIL_FUNNET). VED FEIL RETURNERES '1'B, ELLERS '0'B.            */00000350
 /*                                                                   */00000360
 /* ***************************************************************** */00000370
 /*PROGRAMTILKNYTTING:                                                */00000380
 /* ********************                                              */00000390
 /*  PROGRAMMET INCLUDES AV R0010501 - KONTROLL_GRUNNBLANKETT_AP      */00000400
 /*  ARBEIDSOMRÅDET P0010501 ER INCLUDET I HOVEDPROG.                 */00000410
 /*  EXEC CICS LINK TIL R0019906 - ER FNR ENDRET ?                    */00000420
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN ER INCLUDET I HOVEDPROG :    */00000430
 /*    R0019904 - F_GYLDIG_FNR                                        */00000440
 /*    R0019905 - F_ALDER                                             */00000450
 /*    R0019910 - F_NUMERISK                                          */00000460
 /*    R0019912 - F_FELT_PIC_CHARNN  OG F_FELT_CHAR_PICNN             */00000470
 /*                                                                   */00000480
 /*  INTERNE PROSEDYRER :                                             */00000490
 /*    KONTROLL_AP_BARN  - BLANKETTKONTROLL                           */00000500
 /*                                                                   */00000510
 /* ***************************************************************** */00000520
 /*DATASETTOPPLYSNINGER:                                              */00000530
 /* ***********************                                           */00000540
 /*   INGEN                                                           */00000550
 /* ***************************************************************** */00000560
 /*FEILMELDINGER:                                                     */00000570
 /* *******************                                               */00000580
 /*   MELDINGER LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM             */00000590
 /*   FEIL_FUNNET SETTES = '1'B.                                      */00000600
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDINGER PÅ SKJERMBILDET.   */00000610
 /*                                                                   */00000620
 /*ENDRET: 06.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000630
 /* ******                                                            */00000640
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000650
 /*    OM FNR ER ENDRET (R0019906).                                   */00000660
 /*                                                                   */00000670
 /* ***************************************************************** */00000680
 %PAGE;                                /*  */                           00000690
 /* ***************************************************************** */00000700
 /*                                                                   */00000710
 /*    KONTROLL AV AP_BARN.                                           */00000720
 /*                                                                   */00000730
 /* ***************************************************************** */00000740
 %SKIP(2);                                                              00000750
 KONTROLL_AP_BARN:                                                      00000760
   PROC (FEIL_FUNNET);                                                  00000770
 %SKIP;                                                                 00000780
   DCL                                                                  00000790
      FEIL_FUNNET BIT (1);                                              00000800
   DCL                                                                  00000810
      (FEIL19,                                                          00000820
      FEIL20,                                                           00000830
      FEIL21,                                                           00000840
      FEIL22) BIT (1);                                                  00000850
      FEIL19 = '0'B;                                                    00000860
      FEIL20 = '0'B;                                                    00000870
      FEIL21 = '0'B;                                                    00000880
      FEIL22 = '0'B;                                                    00000890
   DCL                                                                  00000900
      ANT_BARN FIXED BIN(15),                                           00000910
      TELL_BARN FIXED BIN(15),                                          00000920
      TELL FIXED BIN(15),                                               00000930
                                                                        00000940
      1 FNR_REG,                                                        00000950
        2 FNR1         FIXED DEC(11),                                   00000960
        2 FNR2         FIXED DEC(11),                                   00000970
        2 BRUKERID     CHAR     ( 4),                                   00000980
                                                                        00000990
        ALDER          FIXED DEC (5);                                   00001000
                                                                        00001010
                                                                        00001020
      FNR_REG.BRUKERID  =   DIV_PARAM_OMR.CICS_IND;                     00001030
      TELL_BARN         =   0;                                          00001040
                                                                        00001050
      DO ANT_BARN = 1 TO 12;                                            00001060
                                                                        00001070
       IF F_FELT_PIC_CHAR11(APB.FNR_BARN(ANT_BARN)) ^= (11)'0' THEN     00001080
                                                                        00001090
        DO;                                                             00001100
         IF ^F_NUMERISK(F_FELT_PIC_CHAR11(APB.FNR_BARN(ANT_BARN)))      00001110
         THEN                                                           00001120
            DO;                                                         00001130
               IF ^FEIL19 THEN                                          00001140
                  DO;                                                   00001150
                     FEIL19 = '1'B;                                     00001160
                     APB.FNR_BARNNR(ANT_BARN) = 200;                    00001170
                  END;                                                  00001180
               ELSE                                                     00001190
                  APB.FNR_BARNNR(ANT_BARN) = 200;                       00001200
            END;                                                        00001210
         ELSE                                                           00001220
         IF ^ F_GYLDIG_FNR(APB.FNR_BARN(ANT_BARN)) THEN                 00001230
            DO;                                                         00001240
               IF ^FEIL20 THEN                                          00001250
                  DO;                                                   00001260
                     FEIL20 = '1'B;                                     00001270
                     APB.FNR_BARNNR(ANT_BARN) = 20;                     00001280
                  END;                                                  00001290
               ELSE                                                     00001300
                  APB.FNR_BARNNR(ANT_BARN) = 999;                       00001310
            END;                                                        00001320
         ELSE                                                           00001330
            DO;                                                         00001340
               FNR_REG.FNR1 = APB.FNR_BARN(ANT_BARN);                   00001350
               EXEC CICS LINK PROGRAM('R0019906')                       00001360
               COMMAREA(FNR_REG);                                       00001370
               IF FNR_REG.FNR2 > 0 THEN                                 00001380
                  DO;                                                   00001390
                    APB.FNR_BARNNR(ANT_BARN) = 203;                     00001400
                    APB.FNR_BARN(ANT_BARN) = FNR_REG.FNR2;              00001410
                    APB.FNR_GML_BARN(ANT_BARN) = FNR_REG.FNR1;          00001420
                  END;                                                  00001430
               ALDER =                                                  00001440
               F_ALDER(APB.FNR_BARN(ANT_BARN),APS.VIRK_DATO_MÅ);        00001450
               IF ALDER > 1800 THEN                                     00001460
                  DO;                                                   00001470
                     IF ^FEIL21 THEN                                    00001480
                        DO;                                             00001490
                           FEIL21 = '1'B;                               00001500
                           APB.FNR_BARNNR(ANT_BARN) = 21;               00001510
                        END;                                            00001520
                     ELSE                                               00001530
                        APB.FNR_BARNNR(ANT_BARN) = 999;                 00001540
                  END;                                                  00001550
               ELSE                                                     00001560
                  IF ALDER < 0 THEN                                     00001570
                     DO;                                                00001580
                        IF ^FEIL22 THEN                                 00001590
                           DO;                                          00001600
                              FEIL22 = '1'B;                            00001610
                              APB.FNR_BARNNR( ANT_BARN) = 22;           00001620
                           END;                                         00001630
                        ELSE                                            00001640
                           APB.FNR_BARNNR( ANT_BARN) = 999;             00001650
                     END;                                               00001660
                                                                        00001670
 /*LOVENDRING MED VIRKNING FRA 1.1.91 HL : */                           00001680
                                                                        00001690
               ELSE                                                     00001700
                  IF F_SNU_DATO(APS.VIRK_DATO_MÅ) > 9012   &            00001710
                     ALDER < 1 THEN                                     00001720
                     DO;                                                00001730
                        IF ^FEIL22 THEN                                 00001740
                           DO;                                          00001750
                              FEIL22 = '1'B;                            00001760
                              APB.FNR_BARNNR( ANT_BARN) = 22;           00001770
                           END;                                         00001780
                        ELSE                                            00001790
                           APB.FNR_BARNNR( ANT_BARN) = 999;             00001800
                     END;                                               00001810
                                                                        00001820
                IF F_FELT_PIC_CHAR11(APB.FNR_BARN(ANT_BARN)) =          00001830
                F_FELT_PIC_CHAR11(APS.FNR_EK) THEN                      00001840
                  DO;                                                   00001850
                    FEIL_FUNNET = '1'B;                                 00001860
                    APB.FNR_BARNNR(ANT_BARN) = 165;                     00001870
                  END;                                                  00001880
                                                                        00001890
                IF APB.RBT_BARN(ANT_BARN) = 'J'   THEN                  00001900
                   DO;                                                  00001910
                      IF F_SNU_DATO(APS.VIRK_DATO_MÅ) < 8407 THEN       00001920
                         DO;                                            00001930
                            FEIL_FUNNET = '1'B;                         00001940
                            APS.VIRK_DATO_MÅNR = 276;                   00001950
                         END;                                           00001960
                   END;                                                 00001970
                ELSE                                                    00001980
                   IF APB.RBT_BARN(ANT_BARN) ^= ' '   THEN              00001990
                      DO;                                               00002000
                         FEIL_FUNNET = '1'B;                            00002010
                         APB.RBT_BARNNR(ANT_BARN) = 271;                00002020
                      END;                                              00002030
              END;                                                      00002040
             TELL_BARN = TELL_BARN + 1;                                 00002050
            END;                                                        00002060
         ELSE                                                           00002070
            LEAVE;                                                      00002080
      END;                                                              00002090
      IF ^FEIL_FUNNET THEN                                              00002100
        IF APS.BT_ANT ^= TELL_BARN THEN                                 00002110
           DO;                                                          00002120
              FEIL_FUNNET = '1'B;                                       00002130
              APS.BT_ANTNR = 23;                                        00002140
           END;                                                         00002150
                                                                        00002160
      FEIL_FUNNET = FEIL_FUNNET ! FEIL21 ! FEIL22 ! FEIL19 ! FEIL20;    00002170
                                                                        00002180
  /*  HER SJEKKES OM ET FØDSELSNUMMER ER SKREVET MER ENN EN GANG    */  00002190
                                                                        00002200
      IF ^FEIL_FUNNET  THEN                                             00002210
        IF APS.BT_ANT > 0 THEN                                          00002220
           DO ANT_BARN = 1 TO APS.BT_ANT;                               00002230
              DO TELL = ANT_BARN TO APS.BT_ANT;                         00002240
                 IF TELL ^= ANT_BARN THEN                               00002250
                    IF APB.FNR_BARN(TELL) = APB.FNR_BARN(ANT_BARN) THEN 00002260
                       DO;                                              00002270
                          FEIL_FUNNET = '1'B;                           00002280
                          APB.FNR_BARNNR(ANT_BARN) = 124;               00002290
                          APB.FNR_BARNNR(TELL) = 999;                   00002300
                       END;                                             00002310
              END;                                                      00002320
           END;                                                         00002330
   END KONTROLL_AP_BARN;                                                00002340
