 /*       SIST ENDRET 12/06-98 13.34.33 AV   SPA7339                  */00000000
 /*       SIST ENDRET 25/05-98 12.52.33 AV   SPA7339                  */00000010
 /*       SIST ENDRET 05/12-97 12.29.39 AV   JDA7339                  */00000020
 /*       SIST ENDRET 27/11-97 10.59.28 AV   JDA7339                  */00000030
 /*       SIST ENDRET 09/01-96 10.36.20 AV   HLB0310                  */00000040
 /*       SIST ENDRET 09/05-95 15.33.10 AV   TSB0310                  */00000050
 /*       SIST ENDRET 04/05-95 09.52.14 AV   JDA0310                  */00000060
 /*       SIST ENDRET 20/09-94 09.42.49 AV   HERMAN                   */00000070
 /*       SIST ENDRET 08/07-94 08.58.02 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 09/06-94 12.52.11 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 25/02-94 12.26.24 AV   HERMAN                   */00000100
 /*       SIST ENDRET 24/09-92 14.15.30 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 10/08-92 11.45.26 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 24/07-92 11.12.03 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 31/03-92 09.13.57 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 18/02-92 15.37.19 AV   TRUDE                    */00000150
 /*       SIST ENDRET 13/02-92 13.04.51 AV   TRUDE                    */00000160
 /*       SIST ENDRET 03/10-91 14.49.03 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 30/08-91 09.32.54 AV   HERMAN                   */00000180
 /*       SIST ENDRET 16/08-91 13.10.58 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 23/04-91 10.57.03 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 22/03-91 13.40.35 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 14/03-91 13.46.08 AV   DYBVIK                   */00000220
 /*       SIST ENDRET 06/03-91 11.53.34 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 19/05-89 10.46.38 AV   HERMAN                   */00000240
 /*       SIST ENDRET 14/04-89 13.37.43 AV   HERMAN                   */00000250
 /*       SIST ENDRET 10/03-87 08.57.43 AV   DYBVIK                   */00000260
 /*       SIST ENDRET 11/01-85 09.20.49 AV   HERMAN                   */00000270
 /*       SIST ENDRET 07/12-84 14.38.28 AV   HERMAN                   */00000280
 /*       SIST ENDRET 18/09-84 13.32.26 AV   KARIN                    */00000290
 /*       SIST ENDRET 04/03-83 12.35.56 AV   OLAV                     */00000300
 /*       SIST ENDRET 01/03-83 09.34.13 AV   OLAV                     */00000310
                                                                        00000320
                                                                        00000330
 /* ***************************************************************** */00000340
 /* IDENTIFIKASJON                                                    */00000350
 /*     R0014421 - BEREGN_GP_UFØR - PROSEDYRE I PLI.                  */00000360
 /*     PROGRAMMERER: TOM JØRGENSEN, JULI 82.                         */00000370
 /* HENSIKT                                                           */00000380
 /*     OPPDATERE B02.UFØRPENS.GP OG B02.TT_ANV.                      */00000390
 /*     EKTEFELLENS TRYGDETIDER REGNES ALLTID PÅ NYTT HER, SELV OM    */00000400
 /*     DET IKKE ER NØDVENDIG.                                        */00000410
 /* PROGRAMTILKNYTNING                                                */00000420
 /*     PROSEDYREN BLIR INKLUDERT I R0014401 - BEREGN_UFØREPENSJON.   */00000430
 /* YRKESSKADE : ENDRET - HL -                                        */00000440
 /* ***************************************************************** */00000450
 BEREGN_GP_UP:                                                          00000460
  PROC;                                                                 00000470
                                                                        00000480
   DCL                                                                  00000490
      TT_EGEN_GML                 DEC FIXED(5)        INIT(0);          00000500
 /*YS*/   DCL  W_GP_FRADRAG       DEC FIXED( 9,3) INIT(0);              00000510
 /*YS*/   DCL  W_HUNDRE           DEC FIXED(5) INIT(100);               00000520
                                                                        00000530
   DCL  UNDER_3_ÅR_TT             DEC FIXED(5)        INIT(0);          00000540
                                                                        00000550
   DCL   1 W_UFT_ÅM    PIC '9999';                                      00000560
                                                                        00000570
   DCL   1 W_FNR_ÅM    PIC'9999';                                       00000580
                                                                        00000590
   DCL    W_FNR                   PIC '(11)9';                          00000600
                                                                        00000610
   DCL   1 FNR_R   DEF W_FNR,                                           00000620
           2 DAG                  PIC '99',                             00000630
           2 MND                  PIC '99',                             00000640
           2 ÅR                   PIC '99',                             00000650
           2 ÅRHUNDRE             PIC '9',                              00000660
           2 FILLER               PIC '(4)9';                           00000670
                                                                        00000680
   W_FNR       = B02.FNR(BER_SØ_IND);                                   00000690
   W_FNR_ÅM    = FNR_R.ÅR!!FNR_R.MND;                                   00000700
   W_UFT_ÅM    = B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,1);                     00000710
                                                                        00000720
   IF B02.SPESOPPL.TT_FAKTISK(BER_SØ_IND) = 'J'    THEN                 00000730
      B02.TT_FRAMT(BER_SØ_IND) = 0; /*HL 090694 */                      00000740
                                                                        00000750
   /* VED BARE TT_FRAMT, IKKE TT FØR OG ETTER, MEN TT_16_66 = 0 */      00000760
   /* FIKK VEDK. GRATIS 11 MND TRYGDETID HER.    TRUDE 030595   */      00000770
                                                                        00000780
   /* BLIR FEIL NÅR VED UFT=16ÅRS DAG            TRUDE 090595   */      00000790
                                                                        00000800
   IF (B02.STATUS.TT_FØR_1967(BER_SØ_IND)  = 0 &                        00000810
       B02.TT_ETTER_1966(BER_SØ_IND)       = 0 ) &                      00000820
      (W_UFT_ÅM  ^= (W_FNR_ÅM + 1600))           THEN                   00000830
      TT_EGEN = 0;                                                      00000840
   ELSE                                                                 00000850
      TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                    00000860
               (B02.TT_ETTER_1966(BER_SØ_IND) +                         00000870
                B02.TT_FRAMT(BER_SØ_IND) + 11) / 12;                    00000880
                                                                        00000890
   IF TT_EGEN > 39 THEN                                                 00000900
      TT_EGEN = 40;                                                     00000910
                                                                        00000920
 /* NYTT 14/9-84 VEDR TT-GARANTI  :                            */       00000930
                                                                        00000940
   ELSE                                                                 00000950
   IF B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9100     THEN  /*HL*/              00000960
      DO;                                                               00000970
        TT_EGEN_GML = B01.STATUS.TT_FØR_1967(BER_SØ_IND) +              00000980
             (B01.TT_ETTER_1966(BER_SØ_IND) +                           00000990
              B01.TT_FRAMT(BER_SØ_IND) + 11) / 12;                      00001000
                                                                        00001010
 /* TILLEGG 18.1.85  HL                                       */        00001020
                                                                        00001030
        IF TT_EGEN_GML > 39 THEN                                        00001040
           TT_EGEN_GML = 40;                                            00001050
                                                                        00001060
 /*ENDRET 18.1.85 HL                                          */        00001070
                                                                        00001080
        IF TT_EGEN < TT_EGEN_GML THEN                                   00001090
           DO;                                                          00001100
              B02.TT_FRAMT(BER_SØ_IND) = B02.TT_FRAMT(BER_SØ_IND) +     00001110
              (TT_EGEN_GML - TT_EGEN)*12;                               00001120
              IF B02.TT_FRAMT(BER_SØ_IND) > 480  THEN                   00001130
                 B02.TT_FRAMT(BER_SØ_IND) = 480;  /*HL 0196*/           00001140
                                                                        00001150
              TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +            00001160
              (B02.TT_ETTER_1966(BER_SØ_IND) +                          00001170
              B02.TT_FRAMT(BER_SØ_IND) + 11) / 12;                      00001180
           END;                                                         00001190
                                                                        00001200
                                                                        00001210
 /* TILLEGG 18.1.85  HL :                                          */   00001220
                                                                        00001230
        IF TT_EGEN > 39 THEN                                            00001240
           TT_EGEN = 40;                                                00001250
                                                                        00001260
 /* HIT  18.1.85  HL                                               */   00001270
                                                                        00001280
      END;                                                              00001290
                                                                        00001300
        /*TRUDE 250692 BLIR DETTE RIKTIG ??? */                         00001310
        /*TRUDE: LEGGES OVER TIL PROD 240792 */                         00001320
   IF B02.TT_GARANTI(BER_SØ_IND) < TT_EGEN    THEN                      00001330
      B02.TT_GARANTI(BER_SØ_IND) = TT_EGEN;                             00001340
        /* TRUDE TIL HIT */                                             00001350
                                                                        00001360
   IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                          00001370
                                                                        00001380
 /* ER EKTEFELLENS TT STØRST ?                                        */00001390
                                                                        00001400
      DO;                                                               00001410
         IF (B02.TT_16_66(BER_SØ_IND) =  0     &                        00001420
             B02.TT_16_66(BER_EK_IND) =  0     )     !                  00001430
            B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9100     THEN  /*HL*/        00001440
            TT_EK = B02.STATUS.TT_FØR_1967(BER_EK_IND) +                00001450
                 (B02.TT_ETTER_1966(BER_EK_IND) +                       00001460
                 B02.TT_FRAMT(BER_EK_IND) + 11) / 12 +                  00001470
                 B02.STATUS.TT_67_TIL_70(BER_EK_IND);                   00001480
         ELSE                                                           00001490
            TT_EK = 0;                                                  00001500
                                                                        00001510
         IF TT_EK > 39 THEN                                             00001520
            TT_EK = 40;                                                 00001530
         IF B02.PENSJONSTYPE1(BER_EK_IND) = 'K'  THEN                   00001540
            B02.TT_ANV(BER_SØ_IND)       = TT_EGEN;                     00001550
         ELSE                                                           00001560
            DO;                                                         00001570
               IF TT_EGEN > TT_EK THEN                                  00001580
                  B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                     00001590
               ELSE                                                     00001600
                DO;                                                     00001610
                  B02.TT_ANV(BER_SØ_IND) = TT_EK;                       00001620
                  B02.TT_GARANTI(BER_SØ_IND) = TT_EK; /*TRUDE,0891*/    00001630
                END;                             /*PGA TT_GAR VAR 0 */  00001640
            END;                                                        00001650
                    /* IKKE OVERFØRING AV TT ETTER 010191,TRUDE 9090*/  00001660
                                                                        00001670
                     /*--------------------------------------------*/   00001680
                     /*-NB. IKKE OVERFØRING AV TT MELLOM EKTEFELLER*/   00001690
                     /*-ETTER 01.91 TRUDE.OKT.90-------------------*/   00001700
                     /*--------------------------------------------*/   00001710
                                                                        00001720
       IF B02.TT_16_66(BER_SØ_IND) >  0 THEN                            00001730
          DO;                                            /*NY0191*/     00001740
             IF B02.UFØRPENS.VILKÅR_8_4_3A(BER_SØ_IND) = 'J' !  /*TS*/  00001750
                B02.BOSATT(BER_SØ_IND)  = 000 THEN      /*080794*/      00001760
                /*W_BOSATT              = 'J' THEN   FULLT TT  */       00001770
              DO;                                                       00001780
                B02.TT_ANV(BER_SØ_IND)       =                          00001790
                      (B02.TT_16_66(BER_SØ_IND) +                       00001800
                       B02.TT_FRAMT(BER_SØ_IND) + 6) / 12;              00001810
              END;                                                      00001820
                                                                        00001830
             ELSE           /* IKKE MEDREGNING AV FREMTIDIGE ÅR */      00001840
                B02.TT_ANV(BER_SØ_IND) =                                00001850
                           (B02.TT_16_66(BER_SØ_IND) + 6) / 12;         00001860
             IF B02.TT_ANV(BER_SØ_IND) > 40    THEN                     00001870
                B02.TT_ANV(BER_SØ_IND) = 40;                            00001880
                                                                        00001890
                                                                        00001900
                        /*VED ENDRING MÅ VI OPPBEVARE TT:,TRUDE 0392 */ 00001910
             IF B02.TT_GARANTI(BER_SØ_IND) < B02.TT_ANV(BER_SØ_IND)     00001920
                                                          THEN          00001930
                B02.TT_GARANTI(BER_SØ_IND) = B02.TT_ANV(BER_SØ_IND);    00001940
          END;  /*TIL HIT  NY0191*/                                     00001950
                                                                        00001960
      END;  /* END PÅ SAMMENSTØTSBEREGNING AV TT */                     00001970
                                                                        00001980
   ELSE     /* IKKE SAMMENSTØTSBEREGNING */                             00001990
                                                                        00002000
       IF B02.TT_16_66(BER_SØ_IND) =  0 THEN                            00002010
          B02.TT_ANV(BER_SØ_IND)      =      TT_EGEN;                   00002020
       ELSE                                                             00002030
          DO;                                                           00002040
             B02.TT_ANV(BER_SØ_IND)       =                             00002050
                             (B02.TT_16_66(BER_SØ_IND) +                00002060
                              B02.TT_FRAMT(BER_SØ_IND) + 6) / 12;       00002070
             IF B02.TT_ANV(BER_SØ_IND) > 40    THEN                     00002080
                B02.TT_ANV(BER_SØ_IND) = 40;                            00002090
          END;                                                          00002100
                                                                        00002110
   IF B02.TT_GARANTI(BER_SØ_IND) >                                      00002120
      B02.TT_ANV    (BER_SØ_IND)      THEN                              00002130
      B02.TT_ANV    (BER_SØ_IND) = B02.TT_GARANTI(BER_SØ_IND);          00002140
                                                                        00002150
   IF TT_KONVENSJON        > 0   THEN                 /*NY0191*/        00002160
    DO;                                                                 00002170
      IF INDEX    = BER_SØ_IND   THEN        /*TRUDE 0892 PGA EK*/      00002180
     DO;                                                                00002190
                                                  /*STM FLYTTET FRA*/   00002200
      IF TT_KONVENSJON >  40 THEN                                       00002210
      TT_KONVENSJON   = 40;                                             00002220
                                                  /*STM FLYTTET TIL:*/  00002230
      B02.TT_16_66(BER_SØ_IND) = TT_KONVENSJON * 12;                    00002240
                                                                        00002250
      B02.TT_ANV(BER_SØ_IND)        = TT_KONVENSJON;                    00002260
     END;                                                               00002270
    END;                                                                00002280
  ELSE                                                                  00002290
  IF B02.KONVENSJON(BER_SØ_IND) = 'J'           THEN                    00002300
    DO;                             /* TRUDE 0991*/                     00002310
      IF B02.TT_16_66(BER_SØ_IND)  = 0 THEN                             00002320
         B02.TT_ANV(BER_SØ_IND)    = TT_EGEN;                           00002330
      ELSE                                                              00002340
         B02.TT_ANV(BER_SØ_IND) =  B02.TT_16_66(BER_SØ_IND) / 12;       00002350
                                                                        00002360
           /* DENNE TESTEN VAR GLEMT   , TRUDE 180292 */                00002370
      IF B02.TT_ANV(BER_SØ_IND) > 40    THEN                            00002380
         B02.TT_ANV(BER_SØ_IND) = 40;                                   00002390
    END;                            /* TRUDE TIL HIT 0991 */            00002400
                                                           /*NY0191*/   00002410
    /*--------------------------------------------------------------*/  00002420
    /*FRAVIK- FLYKTN FULL TT ER GLEMT. TRUDE 240992                 */  00002430
    /*--------------------------------------------------------------*/  00002440
                                                                        00002450
       IF B02.FRAVIK_FLYKTN(BER_SØ_IND)   = 'J'  THEN                   00002460
          B02.TT_ANV(BER_SØ_IND)          = 40;                         00002470
                                                                        00002480
                     /* HIT 240992 TRUDE */                             00002490
 /*******     FJERNET : HL 090694 ******* :                             00002500
                                                                        00002510
       IF (B02.VIRK_DATO_ÅM(BER_SØ_IND) >  9100  &                      00002520
           TRANS_OPPL_OMR.BLANKETTYPE ^= 'U3'    &                      00002530
           B02.TT_ANV(BER_SØ_IND)    < 20 ) THEN                        00002540
         DO;                                                            00002550
           IF  B02.KONVENSJON(BER_SØ_IND)    ^=  'J' &                  00002560
               B02.UFØRPENS.PÅ(BER_SØ_IND)    =   0  &                  00002570
               B02.BOSATT     (BER_SØ_IND)    >   0  &                  00002580
               B02.PENSJONSTYPE1(BER_SØ_IND) ^= 'Y'  THEN               00002590
  L100:        DO;                                                      00002600
                   FEIL_VED_LABEL    = '100';                           00002610
                   FEIL_MELD_NR      = 1805;                            00002620
                   GO TO L999;                                          00002630
                END;                                                    00002640
         END;                                  *************** */       00002650
                       /*--------------------------------------------*/ 00002660
                       /*DERSOM ANTALL POENGÅR > TT_ANV, SKAL DETTE--*/ 00002670
                       /*BRUKES I TT_ANV. TRUDE 0990   --------------*/ 00002680
                       /*--------------------------------------------*/ 00002690
                                                                        00002700
        IF B02.UFØRPENS.PÅ(BER_SØ_IND) > B02.TT_ANV(BER_SØ_IND) THEN    00002710
           B02.TT_ANV(BER_SØ_IND) = B02.UFØRPENS.PÅ(BER_SØ_IND);        00002720
                                            /* TIL HIT TRUDE */         00002730
                                                                        00002740
                                                                        00002750
        /*ENDRET 0994 HL : */                                           00002760
                                                                        00002770
        IF B02.TT_PÅ(BER_SØ_IND) = 'J'     THEN                         00002780
           B02.TT_ANV(BER_SØ_IND) = B02.UFØRPENS.PÅ(BER_SØ_IND);        00002790
                                                                        00002800
        /*FAKTOR ER EKTEFELLENS UFØREGRAD, ELLER 100 DERSOM */          00002810
        /*EKTEFELLEN ER ALDERS- ELLER AFP-PENSJONIST        */          00002820
        /*UFGRAD ER UFØRPENS.UFG - YRKEPENS.YUG             */          00002830
                                                                        00002840
        IF B02.PENSJON_FØR_9802(BER_SØ_IND) ^= 'J'       THEN           00002850
          DO;                                                           00002860
            IF B02.EK_INNT_OVER_2G(BER_SØ_IND)   = 'J'   &              00002870
               B02.PENSJONSTYPE2(BER_SØ_IND)    ^= 'S'   &              00002880
              (B02.SIVILSTAND      (BER_SØ_IND)  = 'G' !                00002890
               B02.SIVILSTAND      (BER_SØ_IND)  = 'P' !                00002900
               B02.SIVILSTAND      (BER_SØ_IND)  = 'V' !                00002910
               B02.SIVILSTAND      (BER_SØ_IND)  = 'W' )    THEN        00002920
               DO;                                                      00002930
                  W_GP = 0.75;                                          00002940
                  DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'J';       00002950
               END;                                                     00002960
            ELSE                                                        00002970
            IF B02.SIVILSTAND(BER_SØ_IND) = 'V'   &                     00002980
              (B02.PENSJONSTYPE2(BER_EK_IND) = 'P'  !                   00002990
               B02.PENSJONSTYPE2(BER_EK_IND) = 'S'  )        THEN       00003000
               DO;                                                      00003010
                  W_GP = 0.75;                                          00003020
                  DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'V';       00003030
               END;                                                     00003040
            ELSE                                                        00003050
               W_GP                = 1 - 0.25 * (FAKTOR/100);           00003060
          END;                                                          00003070
        ELSE                                                            00003080
           W_GP                        = 1 - 0.25 * (FAKTOR/100);       00003090
                                                                        00003100
  /*YRKE_GP ER FLYTTET FRA 4401 OG HIT - 9804 */                        00003110
                                                                        00003120
         Y_GP         = W_GP * G;                                       00003130
         Y_GP         = Y_GP * B02.YRKEPENS.YUG(BER_SØ_IND)/100;        00003140
         IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN                    00003150
 /*9804*/   DIV_PERIODE.ATTFØRING_GP_ÅRSBELØP = Y_GP + 0.5;             00003160
         B02.YRKEPENS.GP(BER_SØ_IND) = Y_GP/12 + 0.5;                   00003170
         YP_GP_DEC                   = Y_GP/12;   /*TRUDE 210292*/      00003180
                                                                        00003190
                                                                        00003200
        W_GP      = W_GP * UFGRAD / W_HUNDRE;                           00003210
                                                                        00003220
        B02.UFØRPENS.GP(BER_SØ_IND) = G * W_GP * B02.TT_ANV(BER_SØ_IND)/00003230
                                      (40 * 12) + 0.5;                  00003240
                                                                        00003250
        UP_GP_DEC    = G * W_GP * B02.TT_ANV(BER_SØ_IND)/               00003260
                       (40 * 12); /*TRUDE 210292*/                      00003270
                   /* 'J' IKKE_GP  TRUDE 0391 */                        00003280
                                                                        00003290
                                                                        00003300
      IF B02.IKKE_GP(BER_SØ_IND)   = 'J' THEN                           00003310
         B02.UFØRPENS.GP(BER_SØ_IND)  = 0;                              00003320
                                         /* TIL HIT TRUDE */            00003330
                                                                        00003340
                                                                        00003350
      IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN                       00003360
 /*VANLIGE ATTFØRINGSPENGER OPPBEVARES I DIV_PERIODE*/                  00003370
 /*9804*/  DIV_PERIODE.ATTFØRING_GP_ÅRSBELØP =                          00003380
           DIV_PERIODE.ATTFØRING_GP_ÅRSBELØP + (G * W_GP *              00003390
                      B02.TT_ANV(BER_SØ_IND) / 40)   + 0.5;             00003400
                                                                        00003410
  L999:                                                                 00003420
 END BEREGN_GP_UP;                                                      00003430
