 /*       SIST ENDRET 13/12-91 12.26.53 AV   DYBVIK                   */00000000
 /*********************************************************************/00000010
 /* IDENTIFIKASJON:                                                   */00000020
 /*    R0016033 - R0016021 (PROC-SAMLING) DEL OPP. BØ9112             */00000030
 /* HENSIKT:                                                          */00000040
 /*    EN PROSEDYRE SOM HENTER FELTER FRA BLANKETT-OMR. V/U2-TRANS.   */00000050
 /* PROGRAMTILKNYTNING:                                               */00000060
 /*    LOKAL PROSEDYRE I R0016001                                     */00000070
 /*********************************************************************/00000080
                                                                        00000090
    /*----------------------------------------------------------------*/00000100
    /*                                                                */00000110
    /* YRKE, PRIMÆR- OG SEKUNDÆR-DIAGNOSE LEGGES IKKE UT I B01/B02.   */00000120
    /* DISSE OPPLYSNINGENE MÅ HENTES DIREKTE PÅ TRANSAKSJONEN.        */00000130
    /* 2 TYPER UP-BL. FRA 1991 MEDFØRER 2 PROC'ER: UP_OPPDAT/U2_OPPDAT*/00000140
    /*----------------------------------------------------------------*/00000150
                                                                        00000160
 U2_OPPDAT: PROC;                                                       00000170
                                                                        00000180
 %INCLUDE P001N601;     /* TRANS_OMR UP-BLANKETT U2 NY */               00000190
                                                                        00000200
    IF VERIFY(TRANS_OMR.U2S.FNR,'0123456789') = 0 THEN                  00000210
      IF TRANS_OMR.U2S.FNR = B02.PERSON(I).RF0PERSN.FNR THEN            00000220
      DO;                                                               00000230
        IF TRANS_OMR.U2S.YRKE > 0 THEN                                  00000240
           REGTPKT.YRKE = TRANS_OMR.U2S.YRKE;                           00000250
                                                                        00000260
        IF TRANS_OMR.U2S.PRIMDIAG > '      ' THEN                       00000270
          DO;                                                           00000280
            IF TRANS_OMR.U2S.YSKADE_TILLEGG = 'J' THEN                  00000290
               DIAGNOSE.PRIMDIAG_YRKE  = TRANS_OMR.U2S.PRIMDIAG;        00000300
            ELSE                                                        00000310
               DIAGNOSE.PRIMDIAG       = TRANS_OMR.U2S.PRIMDIAG;        00000320
            SEGMENT_TABELL.DIAGNOSE = TRUE;                             00000330
          END;                                                          00000340
                                                                        00000350
        IF TRANS_OMR.U2S.SEKUDIAG > '      ' THEN                       00000360
          DO;                                                           00000370
            IF TRANS_OMR.U2S.YSKADE_TILLEGG = 'J' THEN                  00000380
               DIAGNOSE.SEKUDIAG_YRKE  = TRANS_OMR.U2S.SEKUDIAG;        00000390
            ELSE                                                        00000400
               DIAGNOSE.SEKUDIAG       = TRANS_OMR.U2S.SEKUDIAG;        00000410
            SEGMENT_TABELL.DIAGNOSE = TRUE;                             00000420
          END;                                                          00000430
      END;                                                              00000440
                                                                        00000450
 END U2_OPPDAT;                                                         00000460
                                                                        00000470
