 /*       SIST ENDRET 26/04-91 11.44.04 AV   DYBVIK                   */00000000
 /*IDENTIFIKASJON:                                                    */00000010
 /*    R001NC09  -                                                    */00000020
 /*    PROGRAMMERER:      SATISH 1991                                 */00000030
 /*HENSIKT:                                                           */00000040
 /*    R001NC09 INNHOLDER:                                            */00000050
 /*      PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL        */00000060
 /*           F7_TRANS_OMR.                                           */00000070
 /*ENDRING:                                                           */00000080
 /*    PROSEDYRENE ER SKILT UT FRA R001NC02                           */00000090
 /*PROGRAMTILKNYTNING:                                                */00000100
 /*    PROSEDYRENE INCLUDES I BEHANDLINGA AV FORSØRGINGSTILLEGG FOR   */00000110
 /*    EKTEFELLE OG /ELLER BARN TIL DET MASKINELLE                    */00000120
 /*    FOLKETRYGDSYSTEMET.                                            */00000130
 /*    ARBEIDSOMRÅDE: P001NC01                                        */00000140
 /*BRUK:                                                              */00000150
 /*    %INCLUDE R001NC09;                                             */00000160
 /*    OVERFØR_F7_SØKER:  OVERFØRER SØKERDELEN MAP->ARBEIDSOMRÅDE     */00000170
 /* ***************************************************************** */00000180
 /*                                                                   */00000190
 /*   PROSEDYRE FOR Å BLANKE MAPEN                                    */00000200
 /*                                                                   */00000210
 /* ***************************************************************** */00000220
 %SKIP;                                                                 00000230
   BLANK_F7_MAP:                                                        00000240
      PROC;                                                             00000250
   DCL                                                                  00000260
     LOW BUILTIN;                                                       00000270
     BT_ANTO      = LOW(2);                                             00000280
     FNR_EKO      = LOW(11);                                            00000290
     TILL_EKO     = ' ';                                                00000300
     PIO          = LOW(7 );                                            00000310
     AIO          = LOW(7 );                                            00000320
     PI_EKO       = LOW(7 );                                            00000330
     AI_EKO       = LOW(7 );                                            00000340
                                                                        00000350
     DO A = 1 TO 8;                                                     00000360
       FNR_BARNO(A)   = LOW(11);                                        00000370
       RBTNO(A)        = LOW(1);                                        00000380
     END;                                                               00000390
                                                                        00000400
     MELDING1O    = (78)' ';                                            00000410
     MELDING2O    = (78)' ';                                            00000420
     MELDING3O    = (78)' ';                                            00000430
     MELDING4O    = (78)' ';                                            00000440
     MELDING5O    = (78)' ';                                            00000450
     MELDING6O    = (78)' ';                                            00000460
   END BLANK_F7_MAP;                                                    00000470
 %PAGE;                                /*   */                          00000480
 /* ***************************************************************** */00000490
 /*                                                                   */00000500
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,                    */00000510
 /*   EVENTUELT ENDRA PÅ SKJERMBILDET TIL F7_TRANS_OMR I              */00000520
 /*   KOM_OMR FOR F7_SØKER.                                           */00000530
 /*           MAPSET:  S001123   MAP S001121                          */00000540
 /*                                                                   */00000550
 /* ***************************************************************** */00000560
 %SKIP;                                                                 00000570
                                                                        00000580
 OVERFØR_F7_SØKER:                                                      00000590
   PROC;                                                                00000600
      IF REGDATOL > 0 THEN                                              00000610
           F7S.REGDATO = F_FELT_CHAR_PIC6 (REGDATOI);                   00000620
      IF TERMIDL  > 0 THEN                                              00000630
           F7S.TERMID  = TERMIDI;                                       00000640
      IF FNRL > 0 THEN                                                  00000650
           F7S.FNR = F_FELT_CHAR_PIC11 (FNRI);                          00000660
      IF TKNRL > 0 THEN                                                 00000670
           F7S.TKNR = F_FELT_CHAR_PIC4 (TKNRI);                         00000680
      IF TILL_EKL > 0 THEN                                              00000690
           F7S.TILL_EK = TILL_EKI;                                      00000700
      IF BT_ANTL > 0 THEN                                               00000710
           F7S.BT_ANT = F_FELT_CHAR_PIC2 (BT_ANTI);                     00000720
      IF VIRK_DATO_MÅL > 0 THEN                                         00000730
           F7S.VIRK_DATO_MÅ = F_FELT_CHAR_PIC4 (VIRK_DATO_MÅI);         00000740
      IF FNR_EKL > 0 THEN                                               00000750
           F7S.FNR_EK = F_FELT_CHAR_PIC11 (FNR_EKI);                    00000760
                                                                        00000770
   END OVERFØR_F7_SØKER;                                                00000780
 /***  ********************************* ***/                           00000790
 /*    SISTE 2 LINJE                       */                           00000800
 /******************************************/                           00000810
 OVERFØR_F7_SØKER2:                                                     00000820
   PROC;                                                                00000830
                                                                        00000840
      IF PIL         > 0 THEN                                           00000850
           F7S.PENSJONSINNTEKT = PII;                                   00000860
      IF AIL         > 0 THEN                                           00000870
           F7S.ARBEIDSINNTEKT = AII;                                    00000880
      IF PI_EKL      > 0 THEN                                           00000890
           F7S.PENSJONSINNTEKT_EK = PI_EKI;                             00000900
      IF AI_EKL      > 0 THEN                                           00000910
           F7S.ARBEIDSINNTEKT_EK = AI_EKI;                              00000920
   END OVERFØR_F7_SØKER2;                                               00000930
