 /*       SIST ENDRET 17/01-91 09.45.45 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 08/11-83 14.28.38 AV   KARIN                    */00000010
 /*       SIST ENDRET 23/02-83 10.02.58 AV   KARIN                    */00000020
 /*       SIST ENDRET 04/11-82 16.03.14 AV   JANKR                    */00000030
 /*       SIST ENDRET 04/11-82 11.33.44 AV   JANKR                    */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /*    R0010807 - PROGRAM I PLI                                       */00000060
 /*    PROGRAMMERT AV JAN I JUNI 1981                                 */00000070
 /*HENSIKT:                                                           */00000080
 /*    SKRIVE PROSEDYRER FOR INNSETTING AV FORTEKSTER OG ATTRIBUTTER  */00000090
 /*TEKST_SPES_SØKER:                                                  */00000100
 /*    SETTER FORTEKSTER, ATTRIBUTTER I SPESIELL DEL SØKER.           */00000110
 /*FJERN_TEKST_SPES_SØKER:                                            */00000120
 /*    SETTER 0 I LENGDEKODE FOR TEKSTER SPESIELL DEL SØKER OG        */00000130
 /*    BLANKE I TEKSTFELTET.                                          */00000140
 /*TEKST_SPES_AVDØDE:                                                 */00000150
 /*    SETTER INN FORTEKSTER OG ATTRIBUTTER I SPESIELL DEL AVDØDE     */00000160
 /*FJERN_TEKST_SPES_AVDØDE:                                           */00000170
 /*    SETTER 0 I LENGDEKODE FOR TEKSTER SPESIELL DEL AVDØDE OG       */00000180
 /*    BLANKE I TEKSTFELTET.                                          */00000190
 %SKIP(3);                         /*SETTER FORTEKSTER,                 00000200
                                   ATTRIBUTTER I SPESIELL DEL SØKER*/   00000210
 TEKST_SPES_SØKER:                                                      00000220
   PROC;                                                                00000230
      DCL                                                               00000240
        NOR_NUM   CHAR(1) INIT('&');                                    00000250
                                                                        00000260
      S001081O.TFSO   = 'SPES.';                                        00000270
      S001081O.TFS2O  = 'STATSBORGER';                                  00000280
      S001081O.TFS3O  = 'BOSATT';                                       00000290
      S001081O.TFS4O  = 'FRAVIK BOS';                                   00000300
      S001081O.TFS5O  = 'TR.3ÅR';                                       00000310
      S001081O.TFS6O  = 'FRAVIK TRYGDET';                               00000320
      S001081O.TFS0O  = 'OPPL.';                                        00000330
      S001081O.TFS7O  = 'VILKÅR 10-1';                                  00000340
      S001081O.TFS8O  = 'KONVENSJON';                                   00000350
      S001081O.TFS9O  = 'FRAVIKSKODE 19-3';                             00000360
      S001081O.TFS1O  = 'SØKER';                                        00000370
      S001081O.TFS10O = 'FRAVIK FLYKT';                                 00000380
      S001081O.TFS11O = 'OVERKOMP UTL';                                 00000390
      S001081O.TFS12O = 'TT ETTER DØD MND   ';                          00000400
      S001081O.TFS13O = 'TT F67 ÅR';                                    00000410
      S001081O.TFS14O = 'TT E66 ÅR';                                    00000420
      S001081O.TFS15O = 'MND';                                          00000430
      S001081O.TFS16O = 'REDUSERT FRAMT TT ÅR ';                        00000440
      S001081O.TFS17O = 'TRYGDET VED DØD';                              00000450
      S001081O.TFS18O = 'VENTETID UTL';                                 00000460
      S001081O.TFS19O = 'IKKE GP';                                      00000470
                                                                        00000480
      IF ^ FEIL_FUNNET & TRANS_OPPL_OMR.TRANSKODE ^=                    00000490
                         TRANS_OPPL_OMR.TRANS_RETURKODE THEN            00000500
         S001081I.STATSBORGERL = CURSOR_POS;                            00000510
                                                                        00000520
      S001081O.STATSBORGERA   = NOR_NUM;                                00000530
      S001081O.BOSATTA        = NOR_NUM;                                00000540
      S001081O.FRAVIK_BOSATTA = DFHBMUNP;                               00000550
      S001081O.TRYGDET_3ÅRA   = DFHBMUNP;                               00000560
      S001081O.FRA_TRY_3ÅRA   = DFHBMUNP;                               00000570
      S001081O.FRAVIK_10_1A   = DFHBMUNP;                               00000580
      S001081O.KONVENSJONA    = DFHBMUNP;                               00000590
      S001081O.FRAVIK_19_3A   = DFHBMUNP;                               00000600
      S001081O.FRAVIK_FLYKTA  = DFHBMUNP;                               00000610
      S001081O.OVERKOMP_UTLA  = DFHBMUNP;                               00000620
      S001081O.TT_ETTER_DØDA  = NOR_NUM;                                00000630
      S001081O.TT_F67A        = NOR_NUM;                                00000640
      S001081O.TT_E66_ÅA      = NOR_NUM;                                00000650
      S001081O.TT_E66_MA      = NOR_NUM;                                00000660
      S001081O.TT_FRAMT_10_1A = NOR_NUM;                                00000670
      S001081O.TRYGDET_DØDA   = DFHBMUNP;                               00000680
      S001081O.TT_VENT_UTLA   = NOR_NUM;                                00000690
      S001081O.IKKE_GPA       = DFHBMUNP;                               00000700
   END TEKST_SPES_SØKER;                                                00000710
 %PAGE;                                                                 00000720
                                                                        00000730
                                       /* BLANKE I TEKSTFELTET*/        00000740
 FJERN_TEKST_SPES_SØKER:                                                00000750
   PROC;                                                                00000760
      S001081O.TFSO   = '     ';                                        00000770
      S001081O.TFS2O  = (11)' ';                                        00000780
      S001081O.TFS3O  = (6)' ';                                         00000790
      S001081O.TFS4O  = (10)' ';                                        00000800
      S001081O.TFS5O  = (6)' ';                                         00000810
      S001081O.TFS6O  = (14)' ';                                        00000820
      S001081O.TFS0O  = '     ';                                        00000830
      S001081O.TFS7O  = (11)' ';                                        00000840
      S001081O.TFS8O  = (10)' ';                                        00000850
      S001081O.TFS9O  = (16)' ';                                        00000860
      S001081O.TFS1O  = '     ';                                        00000870
      S001081O.TFS10O = (12)' ';                                        00000880
      S001081O.TFS11O = (12)' ';                                        00000890
      S001081O.TFS12O = (19)' ';                                        00000900
      S001081O.TFS13O = (9)' ';                                         00000910
      S001081O.TFS14O = (9)' ';                                         00000920
      S001081O.TFS15O = (3)' ';                                         00000930
      S001081O.TFS16O = (21)' ';                                        00000940
      S001081O.TFS17O = (15)' ';                                        00000950
      S001081O.TFS18O = (12)' ';                                        00000960
      S001081O.TFS19O = (7)' ';                                         00000970
   END FJERN_TEKST_SPES_SØKER;                                          00000980
                                                                        00000990
 BLOKKERE_EPSPES_SØKER:      /* BLOKKERER MED ASKIP OG PROTECT */       00001000
   PROC;                                                                00001010
      S001081O.STATSBORGERA   = DFHBMASK;                               00001020
      S001081O.BOSATTA        = DFHBMASK;                               00001030
      S001081O.FRAVIK_BOSATTA = DFHBMASK;                               00001040
      S001081O.TRYGDET_3ÅRA   = DFHBMASK;                               00001050
      S001081O.FRA_TRY_3ÅRA   = DFHBMASK;                               00001060
      S001081O.FRAVIK_10_1A   = DFHBMASK;                               00001070
      S001081O.KONVENSJONA    = DFHBMASK;                               00001080
      S001081O.FRAVIK_19_3A   = DFHBMASK;                               00001090
      S001081O.FRAVIK_FLYKTA  = DFHBMASK;                               00001100
      S001081O.OVERKOMP_UTLA  = DFHBMASK;                               00001110
      S001081O.TT_ETTER_DØDA  = DFHBMASK;                               00001120
      S001081O.TT_F67A        = DFHBMASK;                               00001130
      S001081O.TT_E66_ÅA      = DFHBMASK;                               00001140
      S001081O.TT_E66_MA      = DFHBMASK;                               00001150
      S001081O.TT_FRAMT_10_1A = DFHBMASK;                               00001160
      S001081O.TRYGDET_DØDA   = DFHBMASK;                               00001170
      S001081O.TT_VENT_UTLA   = DFHBMASK;                               00001180
      S001081O.IKKE_GPA       = DFHBMASK;                               00001190
   END BLOKKERE_EPSPES_SØKER;                                           00001200
                                                                        00001210
 %PAGE;                            /*SETTER FORTEKSTER, ATTRIBUTTER I   00001220
                                     SPESIELL DEL AVDØDE*/              00001230
 TEKST_SPES_AVDØDE:                                                     00001240
   PROC;                                                                00001250
      DCL                                                               00001260
        NOR_NUM   CHAR(1) INIT('&');                                    00001270
                                                                        00001280
      S001081O.TFSAO   = 'SPES.';                                       00001290
      S001081O.TFSA2O  = 'STATSBORGER';                                 00001300
      S001081O.TFSA3O  = 'BOSATT DØDSTPKT';                             00001310
      S001081O.TFSA4O  = 'TRYGDET 3 ÅR';                                00001320
      S001081O.TFSA0O  = 'OPPL.';                                       00001330
      S001081O.TFSA5O  = 'FRAVIK FLYKT ';                               00001340
      S001081O.TFSA6O  = 'OVERKOMP UTL   ';                             00001350
      S001081O.TFSA1O  = 'AVDØD';                                       00001360
      S001081O.TFSA7O  = 'TRYGDET VED DØD';                             00001370
      S001081O.TFSA8O  = 'TT F67 ÅR';                                   00001380
      S001081O.TFSA9O  = 'TT E66 ÅR';                                   00001390
      S001081O.TFSA10O = 'MND';                                         00001400
      S001081O.TFSA11O = 'REDUSERT FRAMT TT ÅR';                        00001410
                                                                        00001420
      IF ^ FEIL_FUNNET & TRANS_OPPL_OMR.TRANSKODE ^=                    00001430
                         TRANS_OPPL_OMR.TRANS_RETURKODE THEN            00001440
        S001081I.STATSBORGER_EKL = CURSOR_POS;                          00001450
                                                                        00001460
      S001081O.STATSBORGER_EKA  = NOR_NUM;                              00001470
      S001081O.BOSATT_EKA       = NOR_NUM;                              00001480
      S001081O.TRYGDET_3ÅR_EKA  = DFHBMUNP;                             00001490
      S001081O.FRAVIK_FLYKT_EKA = DFHBMUNP;                             00001500
      S001081O.OVERKOMP_UTL_EKA = DFHBMUNP;                             00001510
      S001081O.TRYGDET_DØD_EKA  = DFHBMUNP;                             00001520
      S001081O.TT_F67_EKA       = NOR_NUM;                              00001530
      S001081O.TT_E66_Å_EKA     = NOR_NUM;                              00001540
      S001081O.TT_E66_M_EKA     = NOR_NUM;                              00001550
      S001081O.TT_FRAMT_10_1EKA = NOR_NUM;                              00001560
   END TEKST_SPES_AVDØDE;                                               00001570
 %PAGE;                                                                 00001580
                                                                        00001590
                                /* BLANKE I TEKSTFELTET*/               00001600
 FJERN_TEKST_SPES_AVDØDE:                                               00001610
   PROC;                                                                00001620
      S001081O.TFSAO   = '     ';                                       00001630
      S001081O.TFSA2O  = (11)' ';                                       00001640
      S001081O.TFSA3O  = (15)' ';                                       00001650
      S001081O.TFSA4O  = (12)' ';                                       00001660
      S001081O.TFSA0O  = '     ';                                       00001670
      S001081O.TFSA5O  = (13)' ';                                       00001680
      S001081O.TFSA6O  = (15)' ';                                       00001690
      S001081O.TFSA1O  = '     ';                                       00001700
      S001081O.TFSA7O  = (15)' ';                                       00001710
      S001081O.TFSA8O  = (9)' ';                                        00001720
      S001081O.TFSA9O  = (9)' ';                                        00001730
      S001081O.TFSA10O = (3)' ';                                        00001740
      S001081O.TFSA11O = (20)' ';                                       00001750
   END FJERN_TEKST_SPES_AVDØDE;                                         00001760
                                                                        00001770
 BLOKKERE_EPSPES_AVDØDE:         /* BLOKKERER MED ASKIP OG PROT */      00001780
   PROC;                                                                00001790
      S001081O.STATSBORGER_EKA  = DFHBMASK;                             00001800
      S001081O.BOSATT_EKA       = DFHBMASK;                             00001810
      S001081O.TRYGDET_3ÅR_EKA  = DFHBMASK;                             00001820
      S001081O.FRAVIK_FLYKT_EKA = DFHBMASK;                             00001830
      S001081O.OVERKOMP_UTL_EKA = DFHBMASK;                             00001840
      S001081O.TRYGDET_DØD_EKA  = DFHBMASK;                             00001850
      S001081O.TT_F67_EKA       = DFHBMASK;                             00001860
      S001081O.TT_E66_Å_EKA     = DFHBMASK;                             00001870
      S001081O.TT_E66_M_EKA     = DFHBMASK;                             00001880
      S001081O.TT_FRAMT_10_1EKA = DFHBMASK;                             00001890
   END BLOKKERE_EPSPES_AVDØDE;                                          00001900
