 /*       SIST ENDRET 16/11-94 08.57.48 AV   JDA0310                  */00000000
 /*       SIST ENDRET 16/10-84 16.18.06 AV   KARIN                    */00000010
 /*       SIST ENDRET 26/09-83 15.12.33 AV   KARIN                    */00000020
 /* ***************************************************************** */00000030
 /*               R 0 0 1 0 6 0 8                                     */00000040
 /* ***************************************************************** */00000050
 /*IDENTIFIKASJON:                                                    */00000060
 /* **********************                                            */00000070
 /*  PROGRAM-IDENT : R0010608      TT_UP_EP      SUBPROGRAM           */00000080
 /*  PROGRAM-SPRÅK : PLI                                              */00000090
 /*  PROGRAMMERER  : BERGESTAD                                        */00000100
 /*  PROGRAMMET BLE LAGET : MAI 1981                                  */00000110
 /*  ENDRINGERSDATO : 16/10-84                                        */00000120
 /*  ENDRINGEN GJELDER: GRENSE FOR MAX TT, IKKE LENGER 40 ÅR          */00000130
 /*  ENDRINGEN BLE UTFØRT AV : KARIN                                  */00000140
 /*                                                                   */00000150
 /* ***************************************************************** */00000160
 /*HENSIKT:                                                           */00000170
 /* **********                                                        */00000180
 /*    BEREGNER MAKS TT FØR 1967, OG TT FRA 1966 TIL UFØRE/           */00000190
 /*    DØDSTIDSPUNKTET                                                */00000200
 /*  BRUK:                                                            */00000210
 /*    CALL TT_UP_EP(FNR,DATO,MAKS_TT_FØR_1967,TT_TIL_TPK);           */00000220
 /*  PARAMETER INN :                                                  */00000230
 /*    FNR,DATO                                                       */00000240
 /*  PARAMETER UT :                                                   */00000250
 /*    MAKS_TT_FØR_1967, TT_TIL_TPK                                   */00000260
 /*                                                                   */00000270
 /* ***************************************************************** */00000280
 /*PROGRAMTILKNYTTING:                                                */00000290
 /* ********************                                              */00000300
 /*  PROGRAMMET INCLUDES I R0010601 - KONTROLL_GRUNNBLANKETT_UP       */00000310
 /*  PROGRAMMET INCLUDES I R0010801 - KONTROLL_GRUNNBLANKETT_EP       */00000320
 /*                                                                   */00000330
 /* ***************************************************************** */00000340
 /*DATASETTOPPLYSNINGER:                                              */00000350
 /* ***********************                                           */00000360
 /*  INGEN                                                            */00000370
 /* ***************************************************************** */00000380
 /*FEILMELDINGER:                                                     */00000390
 /* *******************                                               */00000400
 /*  INGEN                                                            */00000410
 /* ***************************************************************** */00000420
 %PAGE;                                                                 00000430
 TT_UP_EP:                                                              00000440
    PROC(FNR,TPK_MÅ,MAKS_TT_FØR_1967,TT_TIL_TPK);                       00000450
   DCL                                                                  00000460
      FNR PIC'(11)9';                                                   00000470
   DCL                                                                  00000480
      W_FNR_MN PIC'(2)9' DEF FNR POS(3),                                00000490
      W_FNR_ÅR PIC'(2)9' DEF FNR POS(5),                                00000500
      W_PERSNR PIC'(3)9' DEF FNR POS(7);                                00000510
   DCL                                                                  00000520
      TPK_MÅ PIC'(4)9',                                                 00000530
      TPK_ÅM PIC'(4)9',                                                 00000540
      TPK_M DEF TPK_MÅ POS(1) PIC '99',                                 00000550
      TPK_Å DEF TPK_MÅ POS(3) PIC '99';                                 00000560
   DCL                                                                  00000570
      MAKS_TT_FØR_1967 PIC'(2)9',                                       00000580
      TT_TIL_TPK PIC'(4)9';                                             00000590
   DCL TIDLIGST_67          PIC'9999' INIT ('6700');                    00000600
 %SKIP(2);                                                              00000610
   TPK_ÅM = ((TPK_Å * 100) + TPK_M);                                    00000620
 %SKIP(2);                                                              00000630
   IF W_PERSNR >= 500 THEN                                              00000640
      MAKS_TT_FØR_1967 = 1967 - (1800 + W_FNR_ÅR +16);                  00000650
   ELSE                                                                 00000660
      DO;                                                               00000670
         MAKS_TT_FØR_1967 = 1967 - (                                    00000680
         W_FNR_ÅR + 1900 + 16);                                         00000690
         IF W_FNR_ÅR > 50               THEN                            00000700
            TIDLIGST_67 = (W_FNR_ÅR + 16) * 100;                        00000710
      END;                                                              00000720
   TT_TIL_TPK = TPK_ÅM - TIDLIGST_67;                                   00000730
   RETURN;                                                              00000740
 END TT_UP_EP;                                                          00000750
