 /*       SIST ENDRET 01/09-97 09.27.56 AV   TSB7339                  */00000000
 /*       SIST ENDRET 01/09-97 09.08.23 AV   SPA7339                  */00000010
 /*       SIST ENDRET 29/08-97 12.32.54 AV   JDA7339                  */00000020
 /*       SIST ENDRET 28/08-97 08.57.10 AV   SPA7339                  */00000030
 /* ***************************************************************** */00000040
 /* IDENTIFIKASJON                                                    */00000050
 /*     R0019F05 - LAGGET FOR LOVENDERING AV 1291                     */00000060
 /*                                   - CICS-HOVEDPROG I PLI          */00000070
 /*     PROGRAMMERER: SATISH  AUG 97                                  */00000080
 /* HENSIKT                                                           */00000090
 /*     SE FORKLARING NEDENFOR.                                       */00000100
 /* ***************************************************************** */00000110
 /*                                                                   */00000120
 /*                                                                   */00000130
 /*                                                                   */00000140
 /* THIS PROGRAM IS A SPECIAL COPY OF R0019F01 AND IS FOR ONE TIME ** */00000150
 /* RUN  WITH SPECIAL CHANGES.                                        */00000160
 /*                                                                   */00000170
 /*                                                                   */00000180
 /*SPECIAL KJØRING  00.08.97     SATISH     */                          00000190
 /*                                                                   */00000200
 /* ***************************************************************** */00000210
 /* ***************************************************************** */00000220
 /* ***************************************************************** */00000230
 /*                                                                   */00000240
 /*        PROGRAMMET LESER SEKVENSIELT GJENNOM D001RFMAIN.           */00000250
 /*           NÅR EN PERSON MED                                       */00000260
 /*   1.      PENSJONSTYPE1 = U/Y          &                          */00000270
 /*         A.    ALDER PÅ FØRST UFT < 2401 < 2601  BEREGENT          */00000280
 /*    2.     PENSJONSTYPE1 = E/B                                     */00000290
 /*           PENSJONSTYPE2 = E                                       */00000300
 /*              LESER AVDØDE ROT, STATUS, FØRST UFØRHIST             */00000310
 /*         B. ALDER-VED-DØD < 2601  !                                */00000320
 /*            ALDER PÅ UFT  < 2601   BEREGENT                */        00000330
 /*                                                                   */00000340
 /*                SKRIVE                                             */00000350
 /*                STØNADSBREV-BASEN OG TRANS-STATISTIKK-BASEN.       */00000360
 /*                REC FOR SKRIVING AV INFORMASJON TIL PENSJONISTEN   */00000370
 /*                                                                   */00000380
 /* ***************************************************************** */00000390
                                                                        00000400
 R0019F: PROC(COMMAREA_PEKER)                  OPTIONS (MAIN);          00000410
                                                                        00000420
                                                                        00000430
 %PAGE;                                                                 00000440
 %INCLUDE P0019906;               /* TRANS_OPPL_OMR                   */00000450
 %PAGE;                                                                 00000460
 %INCLUDE P0019908;               /* KOM_OMR                          */00000470
 %PAGE;                                                                 00000480
 %INCLUDE P0019910;               /* STYRINGSOMRÅDE                   */00000490
 %PAGE;                                                                 00000500
 %INCLUDE P0019912;               /* DIV_PARAM_OMR                    */00000510
 %PAGE;                                                                 00000520
 %INCLUDE P0014009;               /* POTALL_OPPL                      */00000530
 %PAGE;                                                                 00000540
 %INCLUDE P0019924;               /* G_V_TAB                          */00000550
 %PAGE;                                                                 00000560
 %INCLUDE P0019925;               /* G_TAB                            */00000570
 %PAGE;                                                                 00000580
 %INCLUDE P0019014;               /* FNR_TAB                          */00000590
 %PAGE;                                                                 00000600
 %INCLUDE S0019F;                 /* MAP TIL ALDERSKONVERTERING       */00000610
 %PAGE;                                                                 00000620
   DCL 1 B00     BASED (B00_PEKER),                                     00000630
 %INCLUDE P0019921;                                                     00000640
 %PAGE;                                                                 00000650
   DCL 1 B01     BASED (B01_PEKER),                                     00000660
 %INCLUDE P0019921;                                                     00000670
 %PAGE;                                                                 00000680
   DCL 1 B02     BASED (B02_PEKER),                                     00000690
 %INCLUDE P0019921;                                                     00000700
   DCL 1 WORK_TRANS_LISTE UNAL BASED (WORK_TRANS_LISTE_PEKER),          00000710
 %INCLUDE P0019911;                                                     00000720
                                                                        00000730
 %PAGE;                                                                 00000740
 %INCLUDE DFHBMSCA;                                                     00000750
 %PAGE;                                                                 00000760
 %INCLUDE DLIUIB;                                                       00000770
 %PAGE;                                                                 00000780
 %INCLUDE P0012002;   /* PCB - PEKER - OMR    */                        00000790
 %PAGE;                                                                 00000800
    DCL PLITDLI ENTRY;                                                  00000810
                                                                        00000820
    DCL 1 SEGMENTER,                                                    00000830
                                                                        00000840
           2 ROTSEGM,                                                   00000850
              3 FNR              FIXED DEC (11),                        00000860
              3 NAVN             CHAR(25),                              00000870
              3 TKNR             FIXED DEC (5),                         00000880
              3 SPROG            CHAR(1),                               00000890
              3 AI               FIXED DEC (5),                         00000900
              3 SPERRE           CHAR(1),                               00000910
                                                                        00000920
           2 STATUSSEGM,                                                00000930
              %INCLUDE P0019930;                                        00000940
                                                                        00000950
    DCL 1 TILKNSEGM,                                                    00000960
              %INCLUDE P0019931;                                        00000970
                                                                        00000980
    DCL 1 UFØRHISTSEGM,                                                 00000990
              %INCLUDE P0019935;                                        00001000
                                                                        00001010
    DCL 1 RF1 BASED (RF1_PCB_PEKER),                                    00001020
 %INCLUDE P0012003;                                                     00001030
    DCL 1 RF4 BASED (RF4_PCB_PEKER),                                    00001040
 %INCLUDE P0012003;                                                     00001050
                                                                        00001060
    DCL EN   FIXED BIN (31) INIT (1);                                   00001070
    DCL TO   FIXED BIN (31) INIT (2);                                   00001080
    DCL TRE  FIXED BIN (31) INIT (3);                                   00001090
    DCL FIRE FIXED BIN (31) INIT (4);                                   00001100
    DCL FEM  FIXED BIN (31) INIT (5);                                   00001110
    DCL SEKS FIXED BIN (31) INIT (6);                                   00001120
                                                                        00001130
    DCL KODE CHAR(2);                                                   00001140
                                                                        00001150
                                                                        00001160
    DCL 1 SSA1_ROT_GU,                                                  00001170
           2 SSA1_ROT_NAVN      CHAR(11) INIT ('RF0PERSN*D('),          00001180
           2 FELT1             CHAR(8)  INIT ('FNR     '),              00001190
           2 RELOOP1           CHAR(2)  INIT (' ='),                    00001200
           2 FNR               FIXED DEC (11),                          00001210
           2 HØYRE_PARENTES    CHAR(1)  INIT (')');                     00001220
                                                                        00001230
    DCL 1 SSA1_STATUS,                                                  00001240
           2 SSA1_STATUS_FELT   CHAR(11) INIT ('STATUS  *P('),          00001250
           2 FELT1             CHAR(8)  INIT ('STATKODE'),              00001260
           2 RELOOP1           CHAR(2)  INIT (' ='),                    00001270
           2 SSA1_STATUS_KODE   CHAR(1)  INIT ('S'),                    00001280
           2 HØYRE_PARENTES    CHAR(1)  INIT (')');                     00001290
                                                                        00001300
    DCL 1 SSA_ROT_GU,                                                   00001310
           2 SSA_ROT_NAVN      CHAR(11) INIT ('RF0PERSN*D('),           00001320
           2 FELT1             CHAR(8)  INIT ('FNR     '),              00001330
           2 RELOOP1           CHAR(2)  INIT (' ='),                    00001340
           2 FNR               FIXED DEC (11),                          00001350
           2 HØYRE_PARENTES    CHAR(1)  INIT (')');                     00001360
                                                                        00001370
    DCL 1 SSA_STATUS,                                                   00001380
           2 SSA_STATUS_FELT   CHAR(11) INIT ('STATUS  *P('),           00001390
           2 FELT1             CHAR(8)  INIT ('STATKODE'),              00001400
           2 RELOOP1           CHAR(2)  INIT (' ='),                    00001410
           2 SSA_STATUS_KODE   CHAR(1)  INIT ('S'),                     00001420
           2 CONC              CHAR(1)  INIT ('&'),                     00001430
           2 FELT2             CHAR(8)  INIT ('STKODHST'),              00001440
           2 RELOOP2           CHAR(2)  INIT (' ='),                    00001450
           2 SSA_STATUS_HIST   CHAR(1)  INIT (' '),                     00001460
           2 HØYRE_PARENTES    CHAR(1)  INIT (')');                     00001470
                                                                        00001480
    DCL 1 SSA_ROT_NE,                                                   00001490
           2 SSA_ROT_NAVN      CHAR(11) INIT ('RF0PERSN*D ');           00001500
                                                                        00001510
                                                                        00001520
    DCL SSA_UQUAL              CHAR(9)  INIT ('STATUS   ');             00001530
                                                                        00001540
 %PAGE;                                                                 00001550
                                                                        00001560
                                                                        00001570
    DCL 1 REC_TIL_OSLO_TKR,                                             00001580
          2 FNR                   PIC'(11)9',                           00001590
          2 NAVN                  CHAR(25),                             00001600
          2 TYPE                  PIC '9';                              00001610
                                                                        00001620
                                                                        00001630
    DCL COMMAREA_PEKER    POINTER;                                      00001640
    DCL BMSMAPBR          POINTER;                                      00001650
    DCL (UNSPEC,ADDR,VERIFY,                                            00001660
         DATE,NULL, CSTG, SUBSTR)      BUILTIN;                         00001670
    DCL W_GRUNNBL_DATO    FIXED DEC (7);                                00001680
                                                                        00001690
    DCL W_FNR_TILKN     PIC '(11)9';                                    00001700
    DCL W_FNR_TILKN_ÅR   DEF  W_FNR_TILKN POS (5) PIC '99' ;            00001710
   /*                                                                   00001720
                                                                        00001730
    DCL 01 OLARC,                                                       00001740
           02 FNR          PIC '(11)9',                                 00001750
           02 TKNR         PIC '(05)9',                                 00001760
           02 P_TYPE1      CHAR (01),                                   00001770
           02 P_TYPE2      CHAR (01),                                   00001780
           02 FIL1         CHAR (01) INIT (' '),                        00001790
           02 BUP_GML       PIC '99V99' INIT (0),                       00001800
           02 FIL2         CHAR (01) INIT (' '),                        00001810
           02 BUP_NY        PIC '99V99' INIT (0),                       00001820
           02 FIL3         CHAR (01) INIT (' '),                        00001830
           02 SPT_NY       PIC '99V99'       INIT (0),                  00001840
           02 FIL4         CHAR (01) INIT (' '),                        00001850
           02 TP_GML        PIC '(07)9'      INIT (0),                  00001860
           02 FIL5         CHAR (01) INIT (' '),                        00001870
           02 TP_GAR       PIC '(07)9' INIT  (0),                       00001880
           02 FIL6         CHAR (01) INIT (' '),                        00001890
           02 BUP_GML_EK    PIC '99V99'   INIT (0),                     00001900
           02 FIL7         CHAR (01) INIT (' '),                        00001910
           02 BUP_NY_EK     PIC '99V99' INIT (0),                       00001920
           02 FIL8         CHAR (01) INIT (' '),                        00001930
           02 SPT_NY_EK    PIC '99V99' INIT (0);                        00001940
     */                                                                 00001950
                                                                        00001960
    DCL 01 OLARC,                                                       00001970
           02 FNR          PIC '(11)9',                                 00001980
           02 TKNR         PIC '(04)9',                                 00001990
           02 FIL1         CHAR (05)  ,                                 00002000
           02 TEXT         CHAR (44);                                   00002010
                                                                        00002020
    DCL DAGENS_DATO      CHAR (6)                                  ;    00002030
                                                                        00002040
    DCL DAGENS_DATO_ÅR   DEF  DAGENS_DATO POS (1) PIC '99'         ,    00002050
        DAGENS_DATO_MND  DEF  DAGENS_DATO POS (3) PIC '99'         ,    00002060
        DAGENS_DATO_DAG  DEF  DAGENS_DATO POS (5) PIC '99'         ;    00002070
                                                                        00002080
    DCL W_DATO           CHAR (6)                                  ;    00002090
                                                                        00002100
    DCL W_DATO_DAG       DEF  W_DATO      POS (1) PIC '99'         ,    00002110
        W_DATO_MND       DEF  W_DATO      POS (3) PIC '99'         ,    00002120
        W_DATO_ÅR        DEF  W_DATO      POS (5) PIC '99'         ;    00002130
                                                                        00002140
    DCL MELDING           CHAR(78) INIT((78)' ');                       00002150
    DCL MELD2             CHAR(78) INIT((78)' ');                       00002160
                                                                        00002170
    DCL AVBRUDD BIT(1) INIT ('0'B);                                     00002180
    DCL OK      BIT(1) INIT ('1'B);                                     00002190
                                                                        00002200
    DCL W01_GET CHAR(4) INIT  ('GU  ');                                 00002210
    DCL W01_GU  CHAR(4) INIT  ('GU  ');                                 00002220
                                                                        00002230
    DCL SSAKVAL CHAR(9) INIT ('         ');                             00002240
                                                                        00002250
    DCL PICF4              PIC'(4)9'       INIT (0);                    00002260
    DCL PICX4              PIC'(4)9'       INIT (0);                    00002270
    DCL PICX4_POS1         PIC'(2)9'  DEF  PICX4 POS(1);                00002280
    DCL PICX4_POS3         PIC'(2)9'  DEF  PICX4 POS(3);                00002290
                                                                        00002300
    DCL START_TID           PIC'999B99B99'  INIT(0);                    00002310
    DCL SLUTT_TID           PIC'999B99B99'  INIT(0);                    00002320
    DCL RBA_PEKER           POINTER;                                    00002330
    DCL FEIL_RBA            POINTER;                                    00002340
                                                                        00002350
    DCL SYNC_POINT_TELL FIXED BIN (15) INIT(1);                         00002360
    DCL BRI_PROT_MDT    CHAR(1)        INIT('Z');                       00002370
    DCL PERIODE         FIXED BIN (15);                                 00002380
    DCL FIXED_BIN15     FIXED BIN (15);                                 00002390
    DCL LINJE_TELL      FIXED BIN (15);                                 00002400
    DCL W_SØKER_IND     FIXED BIN (15);                                 00002410
    DCL BARN_IND        FIXED BIN (15);                                 00002420
    DCL TILKN_IND       FIXED BIN (15);                                 00002430
    DCL PLASS_I_B02_IND FIXED BIN (15);                                 00002440
    DCL LOOP            FIXED BIN (15);                                 00002450
    DCL I               FIXED BIN (15);                                 00002460
    DCL J               FIXED DEC (3);                                  00002470
    DCL K               FIXED DEC (3);                                  00002480
    DCL IJ              FIXED DEC (7);                                  00002490
    DCL ALDER           FIXED DEC (5);                                  00002500
    DCL F05_IND         FIXED BIN (15);                                 00002510
                                                                        00002520
    DCL SSA_IND         CHAR(9) INIT ('NE-ROT-ST');                     00002530
    DCL PIC11           PIC '(11)9';                                    00002540
    DCL PIC6            PIC '(6)9',                                     00002550
        PIC4_DEF_PIC6   PIC '(4)9' DEF PIC6 POS(1);                     00002560
    DCL PIC4            PIC '(4)9',                                     00002570
        PIC4_POS1       PIC '(2)9' DEF PIC4 POS(1),                     00002580
        PIC4_POS3       PIC '(2)9' DEF PIC4 POS(3);                     00002590
    DCL PIC7            PIC '(7)9',                                     00002600
        PIC7_POS_7      PIC '(1)9' DEF PIC7 POS(7),                     00002610
        PIC7_POS_6_7    PIC '(2)9' DEF PIC7 POS(6),                     00002620
        PIC7_POS_5_7    PIC '(3)9' DEF PIC7 POS(5),                     00002630
        PIC7_POS_4_7    PIC '(4)9' DEF PIC7 POS(4),                     00002640
        PIC7_POS_3_7    PIC '(5)9' DEF PIC7 POS(3),                     00002650
        PIC7_POS_2_7    PIC '(6)9' DEF PIC7 POS(2);                     00002660
                                                                        00002670
    DCL TILKN_CODE      CHAR (1) INIT (' ');                            00002680
    DCL DL1_KODE        PIC '9';                                        00002690
    DCL W_ROT_FNR       PIC '(11)9';                                    00002700
    DCL ROT_KJONN       DEF W_ROT_FNR POS(9) PIC '9';                   00002710
    DCL W_BA_FNR        PIC '(11)9';                                    00002720
    DCL DATO_MÅ         PIC '(04)9';                                    00002730
    DCL DATO_ÅM         PIC '(04)9';                                    00002740
    DCL BA_KJONN        DEF W_BA_FNR POS(9) PIC '9';                    00002750
    DCL W_FNR_AVDØD     PIC '(11)9';                                    00002760
    DCL W_FNR           PIC '(11)9';                                    00002770
    DCL W_TKNR          PIC '(04)9';                                    00002780
    DCL W_FNR_C         CHAR (11)  ;                                    00002790
    DCL OK_FNR          CHAR (1)  INIT (' ');                           00002800
    DCL AVDØD_UFØRHIST_KODE   CHAR (1)  INIT (' ');                     00002810
    DCL AVDØD_ROT_STATUS_KODE CHAR (1)  INIT (' ');                     00002820
    DCL ANT_L           PIC '(07)9'INIT (0);                            00002830
    DCL ANT_S           PIC '(07)9'INIT (0);                            00002840
    DCL ANT_OMR_FAM     PIC '(07)9'INIT (0),                            00002850
        ANT_OMR_FAMX DEF ANT_OMR_FAM   CHAR (07);                       00002860
    DCL ANT_LEST_STATUS  PIC '(07)9'INIT (0),                           00002870
        ANT_LEST_STATUSX DEF ANT_LEST_STATUS  CHAR (07);                00002880
    DCL GRUNN_OMR1      CHAR      (1202);                               00002890
    DCL GRUNN_OMR2      CHAR      (1202);                               00002900
    DCL GRUNN_IDENT     CHAR      ( 8);                                 00002910
                                                                        00002920
    DCL 1 FEIL_STRUC,                                                   00002930
          2 FEIL_NR        FIXED DEC(5),                                00002940
          2 FEIL_MELDING   CHAR(78),                                    00002950
          2 KOM_OMR_PEKER  POINTER;                                     00002960
                                                                        00002970
                                                                        00002980
    ON ERROR SNAP                                                       00002990
    BEGIN;                                                              00003000
       ON ERROR SYSTEM;                                                 00003010
       MELDING = 'STOPP PÅ GRUNN AV PLI - ABEND, HOVEDFØDSELSNUMMER: '!!00003020
                  W_FNR;                                                00003030
       GOTO SLUTT;                                                      00003040
    END;                                                                00003050
                                                                        00003060
                                                                        00003070
    START_TID  = EIBTIME;                                               00003080
    ALLOCATE PCB_UIB_PEKER_OMR;                                         00003090
    ALLOCATE WORK_TRANS_LISTE;                                          00003100
    ALLOCATE FNRTAB;                                                    00003110
    ALLOCATE B00;                                                       00003120
    ALLOCATE B01;                                                       00003130
    ALLOCATE B02;                                                       00003140
    ALLOCATE POTALL_OPPL;                                               00003150
    ALLOCATE GV_TAB_RE                                                ; 00003160
    ALLOCATE G_TAB_RE                                                 ; 00003170
                                                                        00003180
    KOM_OMR.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);              00003190
    KOM_OMR.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);            00003200
    KOM_OMR.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);             00003210
    KOM_OMR.GV_PEKER         = ADDR (GRUNN_OMR1   ) ;                   00003220
    KOM_OMR.G_PEKER          = ADDR (GRUNN_OMR2   ) ;                   00003230
    FEIL_STRUC.KOM_OMR_PEKER = COMMAREA_PEKER;                          00003240
                                                                        00003250
                                                                        00003260
    B00           = '';                                                 00003270
    B01           = '';                                                 00003280
    B02           = '';                                                 00003290
    SEGMENTER     = '';                                                 00003300
    POTALL_OPPL   = '';                                                 00003310
    FNRTAB        = '';                                                 00003320
    GV_TAB_RE     = '';                                                 00003330
    G_TAB_RE      = '';                                                 00003340
    I = 1;                                                              00003350
    PIC6 = DATE;                                                        00003360
    PIC4 = PIC4_DEF_PIC6;                                               00003370
    PIC4 = PIC4 + 2;                                                    00003380
    IF  PIC4_POS3 > 12 THEN                                             00003390
       DO;                                                              00003400
          PIC4_POS1 = PIC4_POS1 + 1;                                    00003410
          PIC4_POS3 = PIC4_POS3 - 12;                                   00003420
       END;                                                             00003430
    TRANS_OPPL_OMR.TRANSKODE        = 'AUTO';                           00003440
    TRANS_OPPL_OMR.NY_GML_TRANS_IND = ' ';                              00003450
    TRANS_OPPL_OMR.FØDSNUMMER       = 0;                                00003460
    TRANS_OPPL_OMR.VIRKNINGSDATO    = 0;                                00003470
    TRANS_OPPL_OMR.BLANKETTYPE      = '  ';                             00003480
    TRANS_OPPL_OMR.TRANS_RETURKODE  = '    ';                           00003490
    DIV_PARAM_OMR. FEIL_MELD_NR     = 0;                                00003500
    DIV_PARAM_OMR. STØNADSBREV_ØNSKET_IND = '1'B;                       00003510
    DIV_PARAM_OMR. KJØRINGS_TYPE    = 'S';  /* STYRING AV R0014901 */   00003520
                                           /* INGEN SPERREPROBLEMATIKK*/00003530
    DIV_PARAM_OMR. ØNSKET_STATUS    = 'S';  /* STYRING AV R0013110 */   00003540
    STYRINGS_OMR . FUNKSJONSKODE    = 'F';  /* STYRING AV R0013110 */   00003550
                                                                        00003560
                                                                        00003570
                                                                        00003580
    GRUNN_IDENT                     = 'P0019924';                       00003590
                                                                        00003600
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                      00003610
                                                                        00003620
    GRUNN_IDENT                     = 'P0019925';                       00003630
                                                                        00003640
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                      00003650
                                                                        00003660
                                                                        00003670
                                                                        00003680
    IF PROGRAM_ID = 'R0010426' THEN                                     00003690
       DO;                                                              00003700
          EXEC CICS LOAD PROGRAM ('S0019F3');                           00003710
          ALLOCATE S0019FO;                                             00003720
          S0019FO.MELDINGO = 'NB NB  SJEKK AT KJØREDATO ER KORREKT !!'; 00003730
          S0019FO.DATO_MÅO = F_SNU_DATO(PIC4);                          00003740
          EXEC CICS SEND MAP('S0019F') MAPSET ('S0019F3') ERASE;        00003750
          PROGRAM_ID = 'R0019F05';                                      00003760
          EXEC CICS RETURN TRANSID('RF02') COMMAREA(KOM_OMR);           00003770
       END;                                                             00003780
                                                                        00003790
                                                                        00003800
    EXEC CICS RECEIVE MAP('S0019F') MAPSET ('S0019F3') SET (BMSMAPBR);  00003810
                                                                        00003820
                                                                        00003830
                                                                        00003840
                                                                        00003850
    IF S0019FI.FUNKSJONSKODEL > 0 &                                     00003860
       VERIFY(S0019FI.FUNKSJONSKODEI,'RVEFIAX') = 0 THEN                00003870
                                                                        00003880
       DO;                                                              00003890
          STYRINGS_OMR.FUNKSJONSKODE = S0019FI.FUNKSJONSKODEI ;         00003900
          EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR);       00003910
       END;                                                             00003920
                                                                        00003930
    ELSE                                                                00003940
       IF S0019FI.STYRE_KODEL > 0  THEN                                 00003950
          DO;                                                           00003960
             STYREKODE          =      S0019FI.STYRE_KODEI;             00003970
             EXEC CICS XCTL PROGRAM  ('R0010420')                       00003980
                            COMMAREA ( KOM_OMR  );                      00003990
          END;                                                          00004000
                                                                        00004010
                                                                        00004020
                                                                        00004030
    IF ^ F_NUMERISK(S0019FI.DATO_MÅI) THEN                              00004040
       DO;                                                              00004050
          S0019FI.DATO_MÅL = -1;                                        00004060
          MELDING ='TEGN SOM IKKE ER TALL I DATOFELT';                  00004070
       END;                                                             00004080
    ELSE IF ^ F_GYLDIG_DATO(S0019FO.DATO_MÅO) THEN                      00004090
       DO;                                                              00004100
          S0019FI.DATO_MÅL = -1;                                        00004110
          MELDING ='UGYLDIG DATO';                                      00004120
       END;                                                             00004130
    ELSE IF ^ F_NUMERISK(S0019FI.FNRI) THEN                             00004140
       DO;                                                              00004150
          S0019FI.FNRL = -1;                                            00004160
          MELDING ='TEGN SOM IKKE ER TALL I FØDSELSNUMMER - FELT';      00004170
       END;                                                             00004180
    ELSE IF ^ F_GYLDIG_FNR(S0019FO.FNRO) & S0019FO.FNRO  > 0 THEN       00004190
       DO;                                                              00004200
          S0019FI.FNRL = -1;                                            00004210
          MELDING ='UGYLDIG FØDSELSNUMMER ';                            00004220
       END;                                                             00004230
    ELSE IF ^ F_NUMERISK(S0019FI.ANT_Ø_BEHI) THEN                       00004240
       DO;                                                              00004250
          S0019FI.ANT_Ø_BEHL = -1;                                      00004260
          MELDING ='TEGN SOM IKKE ER TALL I ANTALL - FELT';             00004270
       END;                                                             00004280
    ELSE IF  S0019FO.ANT_Ø_BEHO = 1 & S0019FI.FNRI = 0 THEN             00004290
       DO;                                                              00004300
          S0019FI.ANT_Ø_BEHL = -1;                                      00004310
          MELDING ='FEIL KOMBINASJON - KJØRE-ANTALL = 1 OG FNR = 0';    00004320
       END;                                                             00004330
    ELSE IF                                                             00004340
         S0019FO.ANT_Ø_BEHO    = 999              !                     00004350
         S0019FO.ANT_Ø_BEHO    = 9999             !                     00004360
         S0019FO.ANT_Ø_BEHO    = 99999            !                     00004370
         S0019FO.ANT_Ø_BEHO    = 999999           THEN                  00004380
         DO;                                                            00004390
            S0019FI.ANT_Ø_BEHL = -1;                                    00004400
            MELDING            = 'ALLE SYV  9  TALLENE MÅ OPPGIS ';     00004410
         END;                                                           00004420
                                                                        00004430
    NESTE_HENDELSE_DATO_ÅM   = F_SNU_DATO(S0019FO.DATO_MÅO);            00004440
                                                                        00004450
    IF NESTE_HENDELSE_DATO_ÅM  >  PIC4   THEN                           00004460
     MELDING = ' OMREGNINGS DATO ER STORE ENN DAGEN DATO + 40 DAGER ';  00004470
                                                                        00004480
    EXEC CICS HANDLE CONDITION ERROR (CICS_ABEND);                      00004490
                                                                        00004500
    IF MELDING              ^= (78) ' ' THEN                            00004510
       CALL MAP_UT_OG_RETUR;                                            00004520
                                                                        00004530
                                                                        00004540
    S0019FO.ANT_LEST_STATUSO = 0;                                       00004550
    S0019FO.ANT_OMR_FAMO     = 0;                                       00004560
                                                                        00004570
    CALL DATABASE('OPEN');                                              00004580
                                                                        00004590
                                                                        00004600
    /** DERSOM EN GÅR INN HER STARTER EN SCAN PÅ NESTE FØDSELSNUMMER */ 00004610
    IF S0019FO.FNRO > 0 THEN                                            00004620
       DO;                                                              00004630
          SSA_IND = 'KV-ROT-ST';                                        00004640
          SSA_ROT_GU.FNR = S0019FO.FNRO;                                00004650
          CALL LES_ROT_STATUS_SEGM;                                     00004660
          W01_GET = 'GN  ';                                             00004670
          SSA_IND = 'NE-ROT-ST';                                        00004680
       END;                                                             00004690
                                                                        00004700
    IF S0019FO.ANT_Ø_BEHO > 1 THEN                                      00004710
       CALL LES_ROT_STATUS_SEGM;                                        00004720
 /* LES ROTSEGMENT-STATUSSSEGMENT MED GHN KVALIFISERT MED               00004730
          (STATUS-KODE = S OG STATUS-KODE-HIST = BLANK) */              00004740
 /* ***************************************************************** */00004750
 /* LESER FØRSTE PERSON SOM HAR PENSJON                               */00004760
 /* ***************************************************************** */00004770
                                                                        00004780
    W01_GET = 'GN  ';                                                   00004790
                                                                        00004800
                                                                        00004810
    MELD2       ='BEHANDLINGEN STARTER NÅ, JOBBEN TAR CA.03 TIMER';     00004820
                                                                        00004830
    PICX4        =   EIBTIME / 100                              ;       00004840
    S0019FO.DATO_MÅA     = DFHBMPRO;                                    00004850
    S0019FO.FNRA         = DFHBMPRO;                                    00004860
    S0019FO.ANT_Ø_BEHA   = DFHBMPRO;                                    00004870
    S0019FO.START_TIDO   = PICX4;                                       00004880
    EXEC CICS SEND MAP ('S0019F') MAPSET ('S0019F3') WAIT               00004890
                                           DATAONLY;                    00004900
                                                                        00004910
                                                                        00004920
    DAGENS_DATO  =   DATE                                       ;       00004930
    W_DATO_DAG   =   DAGENS_DATO_DAG                            ;       00004940
    W_DATO_MND   =   DAGENS_DATO_MND                            ;       00004950
    W_DATO_ÅR    =   DAGENS_DATO_ÅR                             ;       00004960
                                                                        00004970
    MELDING = (78)' ';                                                  00004980
    FEIL_STRUC.FEIL_MELDING = MELDING;                                  00004990
                                                                        00005000
    FEIL_STRUC.FEIL_MELDING =                                           00005010
                          'START TID ' !! PICX4 !! 'DATO ' !! W_DATO;   00005020
                                                                        00005030
    EXEC CICS WRITE DATASET('OMRFEIL')                                  00005040
         FROM (FEIL_STRUC.FEIL_MELDING) RIDFLD(FEIL_RBA) RBA;           00005050
                                                                        00005060
    MELDING = 'SPECIAL KJØRING    START KL:' !! PICX4 !!                00005070
                        '  DATO : ' !! W_DATO;                          00005080
                                                                        00005090
    FEIL_STRUC.FEIL_MELDING = MELDING;                                  00005100
    CALL SEND_TEXT;                                                     00005110
                                                                        00005120
    DO  IJ = 1 TO S0019FO.ANT_Ø_BEHO WHILE (OK & ^AVBRUDD);             00005130
                                                                        00005140
       W_FNR = ROTSEGM.FNR;                                             00005150
       W_TKNR= ROTSEGM.TKNR;                                            00005160
       DIV_PARAM_OMR.FEIL_MELD_NR = 0;                                  00005170
                                                                        00005180
       ANT_LEST_STATUS = ANT_LEST_STATUS + 1;                           00005190
       S0019FO.ANT_LEST_STATUSO = ANT_LEST_STATUSX;                     00005200
                                                                        00005210
       ANT_L      =  ANT_L + 1;                                         00005220
       IF ANT_L  > ANT_S     THEN                                       00005230
          DO;                                                           00005240
             ANT_S = ANT_S + 100000;                                    00005250
                                                                        00005260
             EXEC CICS ASKTIME;                                         00005270
             PICF4        =   EIBTIME / 100        ;                    00005280
                                                                        00005290
             MELDING = 'SPECIAL KJØRING    START KL:' !! PICX4 !!       00005300
                        '  DATO : ' !! W_DATO !!                        00005310
                        ' SISTE BILDE ENDERING ' !! PICF4;              00005320
                                                                        00005330
             S0019FO.MELDINGO = MELDING;                                00005340
             EXEC CICS SEND MAP ('S0019F') MAPSET('S0019F3') DATAONLY   00005350
                                              CURSOR;                   00005360
          END;                                                          00005370
                                                                        00005380
                                                                        00005390
                                                                        00005400
                                                                        00005410
 /*SPECIAL KJØRING  00.08.97     SATISH     */                          00005420
                                                                        00005430
                                                                        00005440
       OK_FNR = 'N';                                                    00005450
       IF  STATUSSEGM.PENSJONSTYPE1 = 'U'     !                         00005460
           STATUSSEGM.PENSJONSTYPE1 = 'Y'     THEN                      00005470
           DO;                                                          00005480
              IF STATUSSEGM.PENSJONSTYPE2 = 'E'   THEN                  00005490
                     CALL KONTROLL_TILKN;                               00005500
          /*           CALL KONTROLL_ROT_STATUS; */                     00005510
             ELSE                                                       00005520
              DO;                                                       00005530
                 CALL LES_UFØREHIST;                                    00005540
                                                                        00005550
                 IF FEIL_MELD_NR > 0  THEN                              00005560
                    DO;                                                 00005570
                       CALL ACCUM_FEIL;                                 00005580
                       GOTO LES_GN;                                     00005590
                    END;                                                00005600
                                                                        00005610
                 DATO_MÅ  = F_SNU_DATO(UFØRHISTSEGM.UFT_ÅM);            00005620
                 ALDER  = F_ALDER(W_FNR,DATO_MÅ);                       00005630
                                                                        00005640
                 IF UFØRHISTSEGM.BUP_GAR_KODE = 'D'  THEN               00005650
                    OK_FNR = 'J';                                       00005660
                ELSE                                                    00005670
                 IF UFØRHISTSEGM.BUP_GAR_KODE = 'E' THEN                00005680
                    DO;                                                 00005690
                       W_FNR_C = W_FNR;                                 00005700
                       IF SUBSTR(W_FNR_C,5,2) = '41' !                  00005710
                         SUBSTR(W_FNR_C,5,2) = '42' THEN                00005720
                         OK_FNR = 'J';                                  00005730
                    END;                                                00005740
              END;                                                      00005750
                                                                        00005760
           END;                  /*   IF PENSJONSTYPE1 = 'U' / Y     */ 00005770
      ELSE                                                              00005780
       IF STATUSSEGM.PENSJONSTYPE1 = 'E'   !                            00005790
          STATUSSEGM.PENSJONSTYPE1 = 'B'   !                            00005800
          STATUSSEGM.PENSJONSTYPE2 = 'E'    THEN                        00005810
                     CALL KONTROLL_TILKN;                               00005820
                                                                        00005830
                                                                        00005840
      ELSE                                                              00005850
                                                                        00005860
         GOTO LES_GN;                                                   00005870
                                                                        00005880
       IF OK_FNR = 'J'                    THEN                          00005890
          DO;                                                           00005900
       OLARC.FNR  = W_FNR;                                              00005910
       OLARC.TKNR = W_TKNR;                                             00005920
       OLARC.TEXT  = ' MED BEHANDLING ';                                00005930
       CALL  SKRIV_OLA_REC;                                             00005940
                                                                        00005950
              DIV_PARAM_OMR.FEIL_MELD_NR = 0;                           00005960
              DIV_PARAM_OMR.SØKER_IND    = 0;                           00005970
              DIV_PARAM_OMR.FAMILIE_IND  = 0;                           00005980
                                                                        00005990
              SEARCH_FNR = ROTSEGM.FNR;                                 00006000
              W_ROT_FNR  = ROTSEGM.FNR;                                 00006010
                                                                        00006020
              IF F_KJØNN(W_ROT_FNR) = 'K' THEN                          00006030
                                                                        00006040
                 SØKER_IND = 1;                                         00006050
                                                                        00006060
              ELSE                                                      00006070
                                                                        00006080
                 SØKER_IND = 2;                                         00006090
                                                                        00006100
              F05_IND = SØKER_IND;                                      00006110
                                                                        00006120
              IF SØKER_IND > 0 THEN                                     00006130
                 DO;                                                    00006140
                    B01        = '';                                    00006150
                    CALL ROSSFFB;                                       00006160
                 END;                                                   00006170
              ELSE                                                      00006180
                 GOTO LES_GN;                                           00006190
 /* ***************************************************************** */00006200
                       /*  CALL OPPRETT_SISTE_STATUS_FOR_FAMILIEN_BATCH 00006210
                                            (ROT_SEGM_FNR,SØKER_IND) */ 00006220
 /* SISTE STATUS TIL ROT-SEGM-FNR'S FAMILIE BLIR                      */00006230
 /* LEST INN I B02                                                    */00006240
 /* ***************************************************************** */00006250
                                                                        00006260
              IF FEIL_MELD_NR > 0 THEN                                  00006270
                                                                        00006280
                 DO;                                                    00006290
                    CALL ACCUM_FEIL;                                    00006300
                    GOTO LES_GU;                                        00006310
       /* AVBRUDD ELLER VIDERE?      AVBRUDD = '1';  */                 00006320
                                                                        00006330
                 END;                                                   00006340
                                                                        00006350
                                                                        00006360
              B02 = B01;                                                00006370
                                                                        00006380
              POTALL_OPPL   = '';                                       00006390
                                                                        00006400
              DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = ' ';                  00006410
              DIV_PARAM_OMR.BEREGNINGS_ALT_AVD  = ' ';                  00006420
              DIV_PARAM_OMR.FULLT_SÆRTILLEGG    = 0;                    00006430
              DIV_PARAM_OMR.GARANTITILLEGG_TP(1)= 0;                    00006440
              DIV_PARAM_OMR.GARANTITILLEGG_TP(2)= 0;                    00006450
              DIV_PARAM_OMR.ENGANGSBELØP_11_7(1)= 0;                    00006460
              DIV_PARAM_OMR.ENGANGSBELØP_11_7(2)= 0;                    00006470
              DIV_PARAM_OMR.FOLKETRYGD       (1)= 0;                    00006480
              DIV_PARAM_OMR.FOLKETRYGD       (2)= 0;                    00006490
              DIV_PARAM_OMR.FRIBELØP_MINSTE  (1)= 0;                    00006500
              DIV_PARAM_OMR.FRIBELØP_MINSTE  (2)= 0;                    00006510
              DIV_PARAM_OMR.FRIBELØP_SÆRBARN (1)= 0;                    00006520
              DIV_PARAM_OMR.FRIBELØP_SÆRBARN (2)= 0;                    00006530
              DIV_PARAM_OMR.FRIBELØP_FELLESBARN(1) = 0;                 00006540
              DIV_PARAM_OMR.FRIBELØP_FELLESBARN(2) = 0;                 00006550
              DIV_PARAM_OMR.FULLT_BT_V          = ' ';                  00006560
              DIV_PARAM_OMR.FULLT_BT_W          = ' ';                  00006570
              DIV_PARAM_OMR.FULLT_ET            = ' ';                  00006580
              DIV_PARAM_OMR.RETT_TIL_ÅFT     (1)= ' ';                  00006590
              DIV_PARAM_OMR.RETT_TIL_ÅFT     (2)= ' ';                  00006600
              DIV_PARAM_OMR.TAI              (1)= 0  ;                  00006610
              DIV_PARAM_OMR.TAI              (2)= 0  ;                  00006620
              DIV_PARAM_OMR.AP_KODE_AEY      (1)= ' ';                  00006630
              DIV_PARAM_OMR.AP_KODE_AEY      (2)= ' ';                  00006640
              DIV_PARAM_OMR.REGN_1291           = ' ';                  00006650
              NESTE_HENDELSE_DATO_ÅM    = F_SNU_DATO(S0019FO.DATO_MÅO); 00006660
                                                                        00006670
                                                                        00006680
                                                                        00006690
              EXEC CICS LINK PROGRAM('R0014901') COMMAREA(KOM_OMR);     00006700
 /* ***************************************************************** * 00006710
  * FAMILIEN AUTOMATISK ALDERSOPPDATERT OG BEREGNET                   * 00006720
  * PÅ NYTT.  RESULTATET BLIR SKREVET UT PÅ                           * 00006730
  * STØNADSBREV-BASEN OG STATISTIKK-TRANS-BASEN.                      * 00006740
  * ***************************************************************** */00006750
                                                                        00006760
              IF FEIL_MELD_NR = 0 THEN                                  00006770
                 DO;                                                    00006780
                                                                        00006790
 /* ***************************************************************** * 00006800
  * FAMILIEN BLIR SKREVET TILBAKE PÅ BASEN                            * 00006810
  * ***************************************************************** */00006820
                                                                        00006830
                    EXEC CICS LINK PROGRAM('R0015401')                  00006840
                                    COMMAREA(KOM_OMR);                  00006850
                                                                        00006860
                                                                        00006870
      /*******   ********************************************    *      00006880
       *     CALL   JUSTER-SB-ROTSEGMENTSTØNADSBREV-BASEN        *      00006890
       *                             (ST-BREV-NØKKEL-TABELL)     *      00006900
       * *****   ********************************************    */     00006910
                                                                        00006920
                    EXEC CICS LINK PROGRAM('R0017101')                  00006930
                                    COMMAREA(KOM_OMR);                  00006940
                                                                        00006950
                                                                        00006960
                 END;                                                   00006970
                                                                        00006980
              IF FEIL_MELD_NR > 0 THEN                                  00006990
                                                                        00007000
                 DO;                                                    00007010
                                                                        00007020
                                /* ********************************* *  00007030
                                 * SKRIV UT FEILMELDING OM FAMILIEN  *  00007040
                                 * ********************************* */ 00007050
                    CALL ACCUM_FEIL;                                    00007060
                    FEIL_MELD_NR = 0;                                   00007070
                                                                        00007080
                              /****** ********************************* 00007090
                                  CALL FJERN-TRANS-FRA-STØNADSBREV-BASE 00007100
                                       (STØNADSBREV-NØKKEL-TABELL)      00007110
                                ***** ********************************/ 00007120
                    EXEC CICS LINK PROGRAM('R0016401')                  00007130
                                    COMMAREA(KOM_OMR);                  00007140
                                                                        00007150
                    IF FEIL_MELD_NR > 0 THEN                            00007160
                       DO;                                              00007170
                          CALL ACCUM_FEIL;                              00007180
                          FEIL_MELD_NR = 0;                             00007190
                       END;                                             00007200
                                                                        00007210
                 END;                                                   00007220
                                                                        00007230
              FNRTAB        = '';                                       00007240
                                                                        00007250
                                                                        00007260
              EXEC CICS SYNCPOINT;                                      00007270
              CALL DATABASE('OPEN');                                    00007280
                                                                        00007290
            LES_GU:                                                     00007300
              SSA_ROT_GU.FNR = W_FNR;                                   00007310
              W01_GET        = 'GU  ';                                  00007320
              CALL GU_PÅ_ROT;                                           00007330
     /*                                                                 00007340
       OLARC.FNR  = W_FNR;                                              00007350
       OLARC.TEXT  = ' NY START  GU   ';                                00007360
       CALL  SKRIV_OLA_REC;                                             00007370
     */                                                                 00007380
                                                                        00007390
              W01_GET        = 'GN  ';                                  00007400
              CALL GN_PÅ_ROT;                                           00007410
     /*                                                                 00007420
                                                                        00007430
       OLARC.FNR  = ROTSEGM.FNR;                                        00007440
       OLARC.TEXT  = ' NEXT FNR  ';                                     00007450
       CALL  SKRIV_OLA_REC;                                             00007460
                                                                        00007470
     */                                                                 00007480
           END;  /*  IF   OK_FNR         */                             00007490
                                                                        00007500
                                                                        00007510
     LES_GN:                                                            00007520
                                                                        00007530
       CALL LES_ROT_STATUS_SEGM;                                        00007540
                                                                        00007550
 /* ***************************************************************** */00007560
 /* NESTE PERSON I SEKVENSEN LESES                                    */00007570
 /* ***************************************************************** */00007580
                                                                        00007590
           OLARC         = '';                                          00007600
 /*HL*/    DIV_PARAM_OMR. STØNADSBREV_ØNSKET_IND = '1'B;                00007610
                                                                        00007620
    END;    /*  DO  IJ = 1 TO ANT_Ø_BEHO WHILE   */                     00007630
                                                                        00007640
 %PAGE;                                                                 00007650
                                                                        00007660
 /* ***************************************************************** */00007670
 /* PROC LES ROT-STATUS MED KVALIFI CALL   FOR LESE TILKN SEGMENT     */00007680
 /* ***************************************************************** */00007690
  KONTROLL_ROT_STATUS: PROC;                                            00007700
                                                                        00007710
          W01_GET = 'GU  ';                                             00007720
          SSA_IND = 'KV-ROT-ST';                                        00007730
          SSA_ROT_GU.FNR = W_FNR       ;                                00007740
          CALL LES_ROT_STATUS_SEGM;                                     00007750
          W01_GET = 'GN  ';                                             00007760
          SSA_IND = 'NE-ROT-ST';                                        00007770
                                                                        00007780
          CALL KONTROLL_TILKN;                                          00007790
  END KONTROLL_ROT_STATUS;                                              00007800
 /* ***************************************************************** */00007810
 /* PROC LESER ALLE TILKN SEGMENT  OG KONTROLLER                      */00007820
 /* ***************************************************************** */00007830
 KONTROLL_TILKN: PROC;                                                  00007840
                                                                        00007850
    TILKN_CODE = ' ';                                                   00007860
    CALL LES_TILKN;                                                     00007870
    IF FEIL_MELD_NR > 0  THEN                                           00007880
       DO;                                                              00007890
          FEIL_MELD_NR = 0;                                             00007900
          GOTO KON_99;                                                  00007910
       END;                                                             00007920
                                                                        00007930
     DO K = 1 TO 2  WHILE ( TILKNSEGM.FNR_TILKN > 0 );                  00007940
                                                                        00007950
                                                                        00007960
        IF TILKNSEGM.TILKNYTNINGSKODE = 'D' THEN                        00007970
           DO;                                                          00007980
              W_FNR_AVDØD = TILKNSEGM.FNR_TILKN;                        00007990
              CALL KONTROLL_AVDØD_FNR;                                  00008000
              TILKN_CODE = 'J';                                         00008010
           END;                                                         00008020
                                                                        00008030
        IF TILKN_CODE = 'J'   THEN                                      00008040
           LEAVE;                                                       00008050
        CALL LES_TILKN;                                                 00008060
                                                                        00008070
        IF FEIL_MELD_NR > 0 THEN                                        00008080
           DO;                                                          00008090
              DIV_PARAM_OMR.FEIL_MELD_NR = 0;                           00008100
              K = 15;                                                   00008110
           END;                                                         00008120
     END;                                                               00008130
  KON_99:                                                               00008140
  END KONTROLL_TILKN;                                                   00008150
                                                                        00008160
                                                                        00008170
 /* ***************************************************************** */00008180
 /* PROC LESER ALLE TILKN SEGMENT  OG KONTROLLER                      */00008190
 /* ***************************************************************** */00008200
 KONTROLL_AVDØD_FNR: PROC;                                              00008210
                                                                        00008220
    AVDØD_ROT_STATUS_KODE = ' ';                                        00008230
    CALL LES_AVDØD_ROT_STATUS;                                          00008240
                                                                        00008250
    IF FEIL_MELD_NR > 0  THEN                                           00008260
          GOTO KONAVDØD_99;                                             00008270
                                                                        00008280
     IF AVDØD_ROT_STATUS_KODE = ' '  THEN                               00008290
          GOTO KONAVDØD_99;                                             00008300
                                                                        00008310
     DATO_ÅM  = STATUSSEGM.DØDSDATO_ÅMD /100;                           00008320
     DATO_MÅ  = F_SNU_DATO(DATO_ÅM);                                    00008330
     ALDER  = F_ALDER(W_FNR_AVDØD,DATO_MÅ);                             00008340
                                                                        00008350
     IF ALDER < 2601 THEN                                               00008360
                   OK_FNR = 'J';                                        00008370
    ELSE                                                                00008380
       DO;                                                              00008390
        AVDØD_UFØRHIST_KODE = ' ';                                      00008400
        CALL LES_UFØRHIST_AVDØD;                                        00008410
        IF FEIL_MELD_NR > 0  THEN                                       00008420
           DO;                                                          00008430
              CALL ACCUM_FEIL;                                          00008440
              GOTO LES_GN;                                              00008450
           END;                                                         00008460
                                                                        00008470
         IF  AVDØD_UFØRHIST_KODE = 'J' THEN                             00008480
            DO;                                                         00008490
               DATO_MÅ  = F_SNU_DATO(UFØRHISTSEGM.UFT_ÅM);              00008500
               ALDER  = F_ALDER(W_FNR_AVDØD,DATO_MÅ);                   00008510
                                                                        00008520
               IF ALDER < 2601 THEN                                     00008530
                   OK_FNR = 'J';                                        00008540
            END;                                                        00008550
       END;                                                             00008560
  KONAVDØD_99:                                                          00008570
  END KONTROLL_AVDØD_FNR;                                               00008580
                                                                        00008590
                                                                        00008600
                                                                        00008610
                                                                        00008620
 LES_TILKN: PROC;                                                       00008630
                                                                        00008640
                                                                        00008650
    DCL SSA_TILKN              CHAR(9)  INIT ('TILKN    ');             00008660
    DCL FUNC_GNP               CHAR(4)  INIT ('GNP ');                  00008670
                                                                        00008680
    CALL PLITDLI      (FIRE,                                            00008690
                       FUNC_GNP,                                        00008700
                       RF4,                                             00008710
                       TILKNSEGM,                                       00008720
                       SSA_TILKN);                                      00008730
                                                                        00008740
                                                                        00008750
                                                                        00008760
    IF DLIUIB.UIBFCTR                   ^=    '00000000'B THEN          00008770
       DO;                                                              00008780
          DL1_KODE = 9;                                                 00008790
          MELDING =                                                     00008800
           'NOE ER GALT MED DATABASEN PÅ KALL: GNP PÅ TILKN  KODE: '    00008810
            !! UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);               00008820
          GOTO SLUTT;                                                   00008830
       END;                                                             00008840
                                                                        00008850
    KODE = RF4.STATUS_KODE;                                             00008860
                                                                        00008870
    SELECT (RF4.STATUS_KODE);                                           00008880
                                                                        00008890
       WHEN ('  ')                                                      00008900
          DO;                                                           00008910
                                                                        00008920
             OK = '1'B;                                                 00008930
                                                                        00008940
          END;                                                          00008950
                                                                        00008960
       WHEN ('GE','GB')                                                 00008970
                                                                        00008980
          DO;                                                           00008990
             FEIL_MELD_NR = 497;                                        00009000
             PROGRAM_ID = 'R0019F05';                                   00009010
             FEIL_VED_LABEL = 'L110';                                   00009020
          END;                                                          00009030
                                                                        00009040
                                                                        00009050
       OTHERWISE                                                        00009060
 /* ***************************************************************** */00009070
 /* FEIL STATUSKODE                                                   */00009080
 /* ***************************************************************** */00009090
          DO;                                                           00009100
             DL1_KODE = 9;                                              00009110
             MELDING = 'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!    00009120
                       ' FRA GNP PÅ TILKN, FNR: ' !! W_FNR;             00009130
             GO TO SLUTT;                                               00009140
          END;                                                          00009150
                                                                        00009160
    END;                                                                00009170
                                                                        00009180
                                                                        00009190
 END LES_TILKN;                                                         00009200
                                                                        00009210
 /* ***************************************************************** */00009220
 /* LES UFØRHIST                                                      */00009230
 /* ***************************************************************** */00009240
 LES_UFØREHIST: PROC;                                                   00009250
                                                                        00009260
                                                                        00009270
    DCL SSA_UFØRHIST           CHAR(11)  INIT ('UFØRHIST*F');           00009280
    DCL FUNC_GNP               CHAR(4)  INIT ('GNP ');                  00009290
                                                                        00009300
    CALL PLITDLI      (FIRE,                                            00009310
                       FUNC_GNP,                                        00009320
                       RF4,                                             00009330
                       UFØRHISTSEGM,                                    00009340
                       SSA_UFØRHIST);                                   00009350
                                                                        00009360
                                                                        00009370
                                                                        00009380
    IF DLIUIB.UIBFCTR                   ^=    '00000000'B THEN          00009390
       DO;                                                              00009400
          DL1_KODE = 9;                                                 00009410
          MELDING =                                                     00009420
           'NOE ER GALT MED DATABASEN PÅ KALL: GNP PÅ TILKN  KODE: '    00009430
            !! UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);               00009440
          GOTO SLUTT;                                                   00009450
       END;                                                             00009460
                                                                        00009470
    KODE = RF4.STATUS_KODE;                                             00009480
                                                                        00009490
    SELECT (RF4.STATUS_KODE);                                           00009500
                                                                        00009510
       WHEN ('  ')                                                      00009520
          DO;                                                           00009530
                                                                        00009540
             OK = '1'B;                                                 00009550
                                                                        00009560
          END;                                                          00009570
                                                                        00009580
       WHEN ('GE','GB')                                                 00009590
                                                                        00009600
          DO;                                                           00009610
  L110:      FEIL_MELD_NR = 497;         /* FINNES IKKE UFøRHIST  */    00009620
             PROGRAM_ID = 'R0019F05';                                   00009630
             FEIL_VED_LABEL = 'L110';                                   00009640
          END;                                                          00009650
                                                                        00009660
                                                                        00009670
       OTHERWISE                                                        00009680
 /* ***************************************************************** */00009690
 /* FEIL STATUSKODE                                                   */00009700
 /* ***************************************************************** */00009710
          DO;                                                           00009720
             DL1_KODE = 9;                                              00009730
             MELDING = 'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!    00009740
                       ' FRA GNP PÅ UFØRHIST , FNR: ' !! W_FNR;         00009750
             GO TO SLUTT;                                               00009760
          END;                                                          00009770
                                                                        00009780
    END;                                                                00009790
                                                                        00009800
                                                                        00009810
 END LES_UFØREHIST;                                                     00009820
                                                                        00009830
 /* ***************************************************************** */00009840
 /* HOVED SEQUENCIAL  LES                                             */00009850
 /* ***************************************************************** */00009860
 LES_ROT_STATUS_SEGM:                                                   00009870
                                                                        00009880
  PROC;                                                                 00009890
                                                                        00009900
    IF SSA_IND = 'NE-ROT-ST' THEN                                       00009910
       CALL PLITDLI (FEM,W01_GET,RF4,SEGMENTER,SSA_ROT_NE,SSA_STATUS);  00009920
                                                                        00009930
    ELSE                                                                00009940
       CALL PLITDLI (FEM,W01_GET,RF4,SEGMENTER,SSA_ROT_GU,SSA_STATUS);  00009950
                                                                        00009960
    IF DLIUIB.UIBFCTR                   ^=    '00000000'B THEN          00009970
       DO;                                                              00009980
         DL1_KODE = 9;                                                  00009990
          MELDING =                                                     00010000
           'NOE ER GALT MED DATABASEN PÅ KALL: ' !! W01_GET !! ' KODE: '00010010
            !! UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);               00010020
          GOTO SLUTT;                                                   00010030
       END;                                                             00010040
                                                                        00010050
    KODE = RF4.STATUS_KODE;                                             00010060
                                                                        00010070
    SELECT (RF4.STATUS_KODE);                                           00010080
                                                                        00010090
       WHEN ('  ','GA','GK')                                            00010100
          DO;                                                           00010110
                                                                        00010120
             OK = '1'B;                                                 00010130
                                                                        00010140
          END;                                                          00010150
                                                                        00010160
       WHEN ('GB')                                                      00010170
                                                                        00010180
          DO;                                                           00010190
             MELDING = 'DATABASEN HAR NÅ BLITT GJENNOMLEST OG ' !!      00010200
                       'OPPDATERT MED LOVEENDERING 0897     GB';        00010210
             OK = '0'B;                                                 00010220
          END;                                                          00010230
                                                                        00010240
       WHEN ('GE')                                                      00010250
                                                                        00010260
          DO;                                                           00010270
             IF S0019FO.ANT_LEST_STATUSO = 0 THEN                       00010280
               MELDING = 'DETTE FØDESELSNUMMER FINNES IKKE I DATABASEN';00010290
             ELSE                                                       00010300
               MELDING = 'DATABASEN HAR NÅ BLITT GJENNOMLEST OG ' !!    00010310
                         'OPPDATERT MED LOVENDERING 0897      GE';      00010320
             OK = '0'B;                                                 00010330
             GOTO SLUTT;                                                00010340
          END;                                                          00010350
                                                                        00010360
                                                                        00010370
       OTHERWISE                                                        00010380
 /* ***************************************************************** */00010390
 /* FEIL STATUSKODE                                                   */00010400
 /* ***************************************************************** */00010410
          DO;                                                           00010420
             DL1_KODE = 9;                                              00010430
             MELDING = 'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!    00010440
                       ' FRA ' !! W01_GET !! 'CALL';                    00010450
             GO TO SLUTT;                                               00010460
          END;                                                          00010470
                                                                        00010480
    END;                                                                00010490
                                                                        00010500
 END LES_ROT_STATUS_SEGM;                                               00010510
                                                                        00010520
                                                                        00010530
 GU_PÅ_ROT:                                                             00010540
      PROC;                                                             00010550
                                                                        00010560
      W01_GET        = 'GU  ';                                          00010570
      CALL PLITDLI (FIRE,W01_GET,RF4,SEGMENTER,SSA_ROT_GU);             00010580
                                                                        00010590
      IF DLIUIB.UIBFCTR            ^=    '00000000'B THEN               00010600
         DO;                                                            00010610
            DL1_KODE = 9;                                               00010620
            MELDING =                                                   00010630
           'NOE ER GALT MED DATABASEN PÅ KALL: ' !! W01_GET !!          00010640
           ' KODE: ' !! UNSPEC(UIBFCTR) !!' '!! UNSPEC(UIBDLTR);        00010650
            GOTO SLUTT;                                                 00010660
         END;                                                           00010670
                                                                        00010680
      SELECT (RF4.STATUS_KODE);                                         00010690
                                                                        00010700
         WHEN ('  ')                                                    00010710
            ;                                                           00010720
                                                                        00010730
         OTHERWISE                                                      00010740
 /* ***************************************************************** */00010750
 /* FEIL STATUSKODE                                                   */00010760
 /* ***************************************************************** */00010770
            DO;                                                         00010780
               DL1_KODE = 9;                                            00010790
               MELDING =                                                00010800
                  'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!         00010810
                  ' FRA ' !! W01_GET !! 'CALL' !! W_FNR;                00010820
               GO TO SLUTT;                                             00010830
            END;                                                        00010840
                                                                        00010850
      END;                                                              00010860
                                                                        00010870
 END GU_PÅ_ROT;                                                         00010880
                                                                        00010890
 GN_PÅ_ROT:                                                             00010900
      PROC;                                                             00010910
      W01_GET = 'GN  ';                                                 00010920
                                                                        00010930
      CALL PLITDLI (FIRE,W01_GET,RF4,SEGMENTER,SSA_ROT_NE);             00010940
                                                                        00010950
      IF DLIUIB.UIBFCTR            ^=    '00000000'B THEN               00010960
         DO;                                                            00010970
            DL1_KODE = 9;                                               00010980
            MELDING =                                                   00010990
           'NOE ER GALT MED DATABASEN PÅ KALL: ' !! W01_GET !!          00011000
           ' KODE: ' !! UNSPEC(UIBFCTR) !!' '!! UNSPEC(UIBDLTR);        00011010
            GOTO SLUTT;                                                 00011020
         END;                                                           00011030
                                                                        00011040
      SELECT (RF4.STATUS_KODE);                                         00011050
                                                                        00011060
         WHEN ('  ')                                                    00011070
            ;                                                           00011080
                                                                        00011090
         WHEN ('GE','GB')                                               00011100
            DO;                                                         00011110
               MELDING =                                                00011120
                  'SLUTT På DATABASEN ' !! RF4.STATUS_KODE !!           00011130
                  ' MED ' !! W01_GET !! 'CALL' !! W_FNR;                00011140
               GO TO SLUTT;                                             00011150
            END;                                                        00011160
         OTHERWISE                                                      00011170
 /* ***************************************************************** */00011180
 /* FEIL STATUSKODE                                                   */00011190
 /* ***************************************************************** */00011200
            DO;                                                         00011210
               DL1_KODE = 9;                                            00011220
               MELDING =                                                00011230
                  'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!         00011240
                  ' FRA ' !! W01_GET !! 'CALL' !! W_FNR;                00011250
               GO TO SLUTT;                                             00011260
            END;                                                        00011270
                                                                        00011280
      END;                                                              00011290
                                                                        00011300
 END GN_PÅ_ROT;                                                         00011310
                                                                        00011320
 /* ***************************************************************** */00011330
 /* LES ROT -STATUS AVDØD                                             */00011340
 /* ***************************************************************** */00011350
 LES_AVDØD_ROT_STATUS:    PROC;                                         00011360
                                                                        00011370
    SSA1_ROT_GU.FNR  = W_FNR_AVDØD;                                     00011380
       CALL PLITDLI     (FEM,                                           00011390
                         W01_GU ,                                       00011400
                         RF1,                                           00011410
                         SEGMENTER,                                     00011420
                         SSA1_ROT_GU,                                   00011430
                         SSA1_STATUS);                                  00011440
                                                                        00011450
      IF DLIUIB.UIBFCTR            ^=    '00000000'B THEN               00011460
         DO;                                                            00011470
            DL1_KODE = 9;                                               00011480
            MELDING =                                                   00011490
           'NOE ER GALT MED DATABASEN PÅ KALL: ' !! W01_GET !!          00011500
           ' KODE: ' !! UNSPEC(UIBFCTR) !!' '!! UNSPEC(UIBDLTR);        00011510
            GOTO SLUTT;                                                 00011520
         END;                                                           00011530
                                                                        00011540
      SELECT (RF1.STATUS_KODE);                                         00011550
                                                                        00011560
         WHEN ('  ')                                                    00011570
            DO;                                                         00011580
               AVDØD_ROT_STATUS_KODE = 'J';                             00011590
            END;                                                        00011600
         WHEN ('GE','GB')                                               00011610
            DO;                                                         00011620
                 AVDØD_ROT_STATUS_KODE = ' ';                           00011630
            MELDING = 'ROT-STATUS SEG. AVDØD MANGLER :' !! W_FNR_AVDØD; 00011640
                 CALL SKRIVE_MELD;                                      00011650
            END;                                                        00011660
         OTHERWISE                                                      00011670
 /* ***************************************************************** */00011680
 /* FEIL STATUSKODE                                                   */00011690
 /* ***************************************************************** */00011700
            DO;                                                         00011710
               DL1_KODE = 9;                                            00011720
               MELDING =                                                00011730
                  'FEIL DLI-STATUSSKODE ' !! RF1.STATUS_KODE !!         00011740
                  ' FRA ' !! W01_GU  !! 'CALL' !! W_FNR;                00011750
               GO TO SLUTT;                                             00011760
            END;                                                        00011770
                                                                        00011780
      END;                                                              00011790
 END LES_AVDØD_ROT_STATUS;                                              00011800
                                                                        00011810
 /* ***************************************************************** */00011820
 /* LESER UFØRHIST FOR AVDØD FNR                                      */00011830
 /* ***************************************************************** */00011840
 LES_UFØRHIST_AVDØD:  PROC;                                             00011850
                                                                        00011860
    DCL SSA_UFØRHIST           CHAR(11)  INIT ('UFØRHIST*F');           00011870
    DCL FUNC_GNP               CHAR(4)  INIT ('GNP ');                  00011880
                                                                        00011890
    CALL PLITDLI      (FIRE,                                            00011900
                       FUNC_GNP,                                        00011910
                       RF1,                                             00011920
                       UFØRHISTSEGM,                                    00011930
                       SSA_UFØRHIST);                                   00011940
                                                                        00011950
                                                                        00011960
                                                                        00011970
    IF DLIUIB.UIBFCTR                   ^=    '00000000'B THEN          00011980
       DO;                                                              00011990
          DL1_KODE = 9;                                                 00012000
          MELDING =                                                     00012010
           'NOE ER GALT MED DATABASEN PÅ KALL: GNP PÅ TILKN  KODE: '    00012020
            !! UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);               00012030
          GOTO SLUTT;                                                   00012040
       END;                                                             00012050
                                                                        00012060
    KODE = RF1.STATUS_KODE;                                             00012070
                                                                        00012080
    SELECT (RF1.STATUS_KODE);                                           00012090
                                                                        00012100
       WHEN ('  ')                                                      00012110
          DO;                                                           00012120
                                                                        00012130
             AVDØD_UFØRHIST_KODE = 'J';                                 00012140
                                                                        00012150
          END;                                                          00012160
                                                                        00012170
       WHEN ('GE','GB')                                                 00012180
                                                                        00012190
          DO;                                                           00012200
             AVDØD_UFØRHIST_KODE = ' ';                                 00012210
          END;                                                          00012220
                                                                        00012230
                                                                        00012240
       OTHERWISE                                                        00012250
 /* ***************************************************************** */00012260
 /* FEIL STATUSKODE                                                   */00012270
 /* ***************************************************************** */00012280
          DO;                                                           00012290
             DL1_KODE = 9;                                              00012300
             MELDING = 'FEIL DLI-STATUSSKODE ' !! RF1.STATUS_KODE !!    00012310
                       ' FRA GNP PÅ UFØRHIST , FNR: ' !! W_FNR;         00012320
             GO TO SLUTT;                                               00012330
          END;                                                          00012340
                                                                        00012350
    END;                                                                00012360
                                                                        00012370
                                                                        00012380
 END LES_UFØRHIST_AVDØD;                                                00012390
 %PAGE;                                                                 00012400
 %INCLUDE R0019901;          /*     F_GYLDIG_DATO       */              00012410
 %PAGE;                                                                 00012420
 %INCLUDE R0019902;          /*     F_KJØNN             */              00012430
 %PAGE;                                                                 00012440
 %INCLUDE R0019904;          /*     F_GYLDIG_FNR        */              00012450
 %PAGE;                                                                 00012460
 %INCLUDE R0019905;          /*     F_ALDER             */              00012470
 %PAGE;                                                                 00012480
 %INCLUDE R0019910;          /*     F_NUMERISK          */              00012490
 %PAGE;                                                                 00012500
 %INCLUDE R0019913;          /*     F_SNU_DATO          */              00012510
 %PAGE;                                                                 00012520
 %INCLUDE R0019956;          /*     P9956_BER_G_CICS    */              00012530
 %PAGE;                                                                 00012540
 %INCLUDE R0019F21;          /*     ROSSFFB             */              00012550
 %PAGE;                                                                 00012560
                                                                        00012570
                                                                        00012580
                                                                        00012590
                                                                        00012600
 SLUTT:                                                                 00012610
    CALL SKRIVE_MELD;                                                   00012620
    EXEC CICS ASKTIME;                                                  00012630
    PICX4 = EIBTIME/100;                                                00012640
    S0019FO.STOPP_TIDO = PICX4;                                         00012650
    FEIL_STRUC.FEIL_MELDING =                                           00012660
                             W_FNR !! '   ' !! S0019FO.STOPP_TIDO;      00012670
                                                                        00012680
    EXEC CICS WRITE DATASET('OMRFEIL')                                  00012690
         FROM (FEIL_STRUC.FEIL_MELDING) RIDFLD(FEIL_RBA) RBA;           00012700
                                                                        00012710
    IF DL1_KODE = 0      THEN                                           00012720
    DO;                                                                 00012730
       IF S0019FO.ANT_Ø_BEHO = S0019FO.ANT_LEST_STATUSO THEN            00012740
          MELDING =                                                     00012750
                 'KJØRINGEN ER NORMALT AVSLUTTET PÅ FØDSELSNUMMER: ' !! 00012760
                                                                W_FNR;  00012770
                                                                        00012780
       ELSE                                                             00012790
           IF MELDING = (78)' ' THEN                                    00012800
              MELDING =                                                 00012810
                  'KJØRINGEN ER AVSLUTTET PÅ FØDSELSNUMMER: ' !! W_FNR; 00012820
                                                                        00012830
                                                                        00012840
        S0019FO.MELDINGO = MELDING;                                     00012850
        FEIL_STRUC.FEIL_MELDING = MELDING;                              00012860
        EXEC CICS WRITE DATASET('OMRFEIL')                              00012870
              FROM (FEIL_STRUC.FEIL_MELDING) RIDFLD(FEIL_RBA) RBA;      00012880
                                                                        00012890
                                                                        00012900
        EXEC CICS SEND MAP ('S0019F') MAPSET ('S0019F3') WAIT           00012910
                                           DATAONLY;                    00012920
       CALL SKRIVE_MELD;                                                00012930
    END;                                                                00012940
                                                                        00012950
    EXEC CICS RETURN;                                                   00012960
                                                                        00012970
                                                                        00012980
                                                                        00012990
  CICS_ABEND:                                                           00013000
    MELDING = 'STOPP PÅ GRUNN AV CICS - ABEND, HOVEDFØDSELSNUMMER: ' !! 00013010
               W_FNR;                                                   00013020
    GOTO SLUTT;                                                         00013030
                                                                        00013040
                                                                        00013050
  MAP_UT_OG_RETUR:                                                      00013060
   PROC;                                                                00013070
      S0019FO.MELDINGO = MELDING;                                       00013080
      EXEC CICS SEND MAP ('S0019F') MAPSET('S0019F3') DATAONLY          00013090
                                              CURSOR;                   00013100
      EXEC CICS RETURN TRANSID('RF02') COMMAREA (KOM_OMR);              00013110
  END  MAP_UT_OG_RETUR;                                                 00013120
                                                                        00013130
                                                                        00013140
 DATABASE:                                                              00013150
   PROC(STYRING);                                                       00013160
                                                                        00013170
   DCL                                                                  00013180
     STYRING                               CHAR(5),                     00013190
     NULL                                  BUILTIN,                     00013200
     UNSPEC                                BUILTIN;                     00013210
                                                                        00013220
                                                                        00013230
                                                                        00013240
                                                                        00013250
  %SKIP;                                                                00013260
  /* **************************************************************** */00013270
  /*                                                                  */00013280
  /*     DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-   */00013290
  /*     KALL                                                         */00013300
  /*                                                                  */00013310
  /* **************************************************************** */00013320
     DCL                                                                00013330
       W01_PSB_NAVN                CHAR (8)       INIT('B0019F01');     00013340
     DCL                                                                00013350
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');         00013360
     DCL                                                                00013370
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00013380
  %PAGE;                                                                00013390
  /* **************************************************************** */00013400
  /*                                                                  */00013410
  /*     ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00013420
  /*                                                                  */00013430
  /*                                                                  */00013440
  /* **************************************************************** */00013450
                                                                        00013460
  %PAGE;                                                                00013470
  /* **************************************************************** */00013480
  /*                                                                  */00013490
  /*     DLI CALL-PARAMETRE                                           */00013500
  /*                                                                  */00013510
  /* **************************************************************** */00013520
  %SKIP(2);                                                             00013530
     DCL 1  W01_DLI_PARAM,                                              00013540
            2   W02_GU             CHAR (4)       INIT('GU  '),         00013550
            2   W02_PARM_CT_1      FIXED BIN(31)  INIT(1),              00013560
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT(3),              00013570
            2   W02_PARM_CT_4      FIXED BIN(31)  INIT(4);              00013580
                                                                        00013590
  %PAGE;                                                                00013600
                                                                        00013610
     IF STYRING = 'OPEN' THEN                                           00013620
        DO;                                                             00013630
           CALL   PLITDLI                        (W02_PARM_CT_3,        00013640
                                                  W01_PCB_FUNCTION,     00013650
                                                  W01_PSB_NAVN,         00013660
                                                  UIBPTR);              00013670
                                                                        00013680
           IF DLIUIB.UIBFCTR                    =    '00000000'B THEN   00013690
             DO;                                                        00013700
               PCB_UIB_PEKER_OMR.PCB_PEKER      =    UIBPCBAL;          00013710
               PCB_UIB_PEKER_OMR.UIB_PEKER      =    UIBPTR;            00013720
             END;                                                       00013730
           ELSE                                                         00013740
             DO;                                                        00013750
                MELDING =                                               00013760
                 'NOE ER GALT MED DATABASEN PÅ ÅPNINGSKALLET, KODE: ' !!00013770
                  UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);            00013780
                GOTO SLUTT;                                             00013790
             END;                                                       00013800
        END;                                                            00013810
     ELSE                                                               00013820
        DO;                                                             00013830
           CALL   PLITDLI                        (W02_PARM_CT_1,        00013840
                                                  W01_TERM_FUNCTION);   00013850
           KOM_OMR.PCB_UIB_PEKER = NULL;                                00013860
        END;                                                            00013870
                                                                        00013880
 END DATABASE;                                                          00013890
                                                                        00013900
                                                                        00013910
 ACCUM_FEIL:                                                            00013920
    PROC;                                                               00013930
                                                                        00013940
      IF DIV_PARAM_OMR.FEIL_MELD_NR   = 497 THEN                        00013950
         DO;                                                            00013960
                                                                        00013970
           FEIL_STRUC.FEIL_NR          = 0;                             00013980
           DIV_PARAM_OMR.FEIL_MELD_NR  = 0;                             00013990
           GOTO ACCUM_999;                                              00014000
         END;                                                           00014010
                                                                        00014020
      FEIL_STRUC.FEIL_MELDING = 'PROGRAM: ' !! DIV_PARAM_OMR.PROGRAM_ID 00014030
             !! ' FEIL VED LABEL: ' !! DIV_PARAM_OMR.FEIL_VED_LABEL   !!00014040
                ' DB-STATUSKODE: '  !! DIV_PARAM_OMR.DB_STATUS_KODE   !!00014050
                ' HOVEDFNR: '  !! W_FNR;                                00014060
                                                                        00014070
    EXEC CICS WRITE DATASET('OMRFEIL')                                  00014080
              FROM (FEIL_STRUC.FEIL_MELDING) RIDFLD(FEIL_RBA) RBA;      00014090
                                                                        00014100
      FEIL_STRUC.FEIL_NR = DIV_PARAM_OMR.FEIL_MELD_NR;                  00014110
      EXEC CICS LINK PROGRAM ('R0019921') COMMAREA(FEIL_STRUC);         00014120
                                                                        00014130
    EXEC CICS WRITE DATASET('OMRFEIL')                                  00014140
              FROM (FEIL_STRUC.FEIL_MELDING) RIDFLD(FEIL_RBA) RBA;      00014150
                                                                        00014160
                                                                        00014170
 ACCUM_999:                                                             00014180
                                                                        00014190
 END ACCUM_FEIL;                                                        00014200
                                                                        00014210
                                                                        00014220
 SKRIVE_MELD:                                                           00014230
   PROC;                                                                00014240
                                                                        00014250
 /* MELDING = 'SISTE FNR UNDER BEHANDLING :' !! W_FNR;   */             00014260
                                                                        00014270
    FEIL_STRUC.FEIL_MELDING = MELDING;                                  00014280
                                                                        00014290
    EXEC CICS WRITE DATASET('OMRFEIL')                                  00014300
              FROM (FEIL_STRUC.FEIL_MELDING) RIDFLD(FEIL_RBA) RBA;      00014310
                                                                        00014320
                                                                        00014330
    DIV_PARAM_OMR.FEIL_MELD_NR = 0;                                     00014340
 END SKRIVE_MELD;                                                       00014350
                                                                        00014360
 SKRIV_OLA_REC: PROC;                                                   00014370
           ANT_OMR_FAM = ANT_OMR_FAM + 1;                               00014380
           S0019FO.ANT_OMR_FAMO = ANT_OMR_FAMX;                         00014390
                                                                        00014400
           EXEC CICS WRITE DATASET ('F0019F05')                         00014410
                                  FROM (OLARC)                          00014420
                                  RBA RIDFLD(RBA_PEKER);                00014430
         /*                                                             00014440
              OLARC.BUP_GML    =  0;                                    00014450
              OLARC.BUP_NY     =  0;                                    00014460
              OLARC.SPT_NY     =  0;                                    00014470
              OLARC.TP_GML     =  0;                                    00014480
              OLARC.TP_GAR     =  0;                                    00014490
              OLARC.BUP_GML_EK =  0;                                    00014500
              OLARC.BUP_NY_EK  =  0;                                    00014510
              OLARC.SPT_NY_EK  =  0;                                    00014520
       */                                                               00014530
 END SKRIV_OLA_REC;                                                     00014540
 SEND_TEXT:                                                             00014550
   PROC;                                                                00014560
                                                                        00014570
                                                                        00014580
      S0019FO.MELDINGO = MELDING;                                       00014590
      S0019FO.MELD2O   = MELD2;                                         00014600
      EXEC CICS SEND MAP ('S0019F') MAPSET('S0019F3') DATAONLY          00014610
                                              CURSOR;                   00014620
                                                                        00014630
                                                                        00014640
 END SEND_TEXT;                                                         00014650
                                                                        00014660
 END R0019F;                                                            00014670
                                                                        00014680
