 /*       SIST ENDRET 06/03-91 11.48.08 AV   DYBVIK                   */00000000
 /* ***************************************************************** */00000010
 /*               R 0 0 1 N 6 0 4                                     */00000020
 /* ***************************************************************** */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /* **********************                                            */00000050
 /*  PROGRAM-IDENT : R001N604 - BLANKER ARBEIDS-                      */00000060
 /*                             OMRÅDE UP_BARN  - SUBPROGRAM          */00000070
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000080
 /*  PROGRAMMERER  : SATISH                                           */00000090
 /*  PROGRAMMET BLE LAGET : DEC  1990                                 */00000100
 /*  ENDRINGERSDATO :                                                 */00000110
 /*  ENDRINGEN GJELDER:                                               */00000120
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000130
 /*                                                                   */00000140
 /* ***************************************************************** */00000150
 /*  ENDRINGERSDATO :          220487                                 */00000160
 /*  ENDRINGEN GJELDER:        PROSEDYREN OVERFØR_UP_BARN ER SKILT UT */00000170
 /*                            OG LAGT I R0010610                     */00000180
 /*  ENDRINGEN BLE UTFØRT AV : BRITT                                  */00000190
 /*                                                                   */00000200
 /* ***************************************************************** */00000210
 /*HENSIKT:                                                           */00000220
 /* **********                                                        */00000230
 /*  BRUKES VED REGISTRERING AV GRUNNBLANKETT_UP.                     */00000240
 /*  KONTROLLERER OPPLYSNINGER OM FORSØRGET BARN.                     */00000250
 /*  PROSEDYREN KONTROLL_UP_BARN MÅ CALLES MED PARAMETER              */00000260
 /*  (FEIL_FUNNET). VED FEIL RETURNERES '1'B, ELLERS '0'B.            */00000270
 /*                                                                   */00000280
 /* ***************************************************************** */00000290
 /*PROGRAMTILKNYTTING:                                                */00000300
 /* ********************                                              */00000310
 /*  PROGRAMMET INCLUDES AV R0010601 - KONTROLL_GRUNNBLANKETT_UP      */00000320
 /*  ARBEIDSOMRÅDET P0010601 ER INCLUDET I HOVEDPROG.                 */00000330
 /*  EXEC CICS LINK TIL R0019906 - ER FNR ENDRET ?                    */00000340
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN ER INCLUDET I HOVEDPROG :    */00000350
 /*    R0019904 - F_GYLDIG_FNR                                        */00000360
 /*    R0019905 - F_ALDER                                             */00000370
 /*    R0019910 - F_NUMERISK                                          */00000380
 /*    R0019912 - F_FELT_PIC_CHARNN  OG F_FELT_CHAR_PICNN             */00000390
 /*                                                                   */00000400
 /*  INTERNE PROSEDYRER :                                             */00000410
 /*    KONTROLL_UP_BARN  - BLANKETTKONTROLL                           */00000420
 /*                                                                   */00000430
 /*                                                                   */00000440
 /* ***************************************************************** */00000450
 /*DATASETTOPPLYSNINGER:                                              */00000460
 /* ***********************                                           */00000470
 /*   INGEN                                                           */00000480
 /* ***************************************************************** */00000490
 /*FEILMELDINGER:                                                     */00000500
 /* *******************                                               */00000510
 /*   MELDINGER LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM             */00000520
 /*   FEIL_FUNNET SETTES = '1'B.                                      */00000530
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDINGER PÅ SKJERMBILDET.   */00000540
 /*                                                                   */00000550
 /*ENDRET: 13.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000560
 /* ******                                                            */00000570
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000580
 /*    OM FNR ER ENDRET (R0019906).                                   */00000590
 /*                                                                   */00000600
 /* ***************************************************************** */00000610
 %PAGE;                                /*  */                           00000620
 /* ***************************************************************** */00000630
 /*                                                                   */00000640
 /*    KONTROLL AV UP_BARN.                                           */00000650
 /*                                                                   */00000660
 /* ***************************************************************** */00000670
 %SKIP(2);                                                              00000680
 KONTROLL_U2_BARN:                                                      00000690
   PROC (FEIL_FUNNET);                                                  00000700
 %SKIP;                                                                 00000710
   DCL                                                                  00000720
      FEIL_FUNNET BIT (1);                                              00000730
   DCL                                                                  00000740
      (FEIL19,                                                          00000750
      FEIL20,                                                           00000760
      FEIL21,                                                           00000770
      FEIL22) BIT (1);                                                  00000780
      FEIL19 = '0'B;                                                    00000790
      FEIL20 = '0'B;                                                    00000800
      FEIL21 = '0'B;                                                    00000810
      FEIL22 = '0'B;                                                    00000820
      FEIL_FUNNET = '0'B;                                               00000830
   DCL                                                                  00000840
      ANT_BARN FIXED BIN(15),                                           00000850
      TELL_BARN FIXED BIN(15),                                          00000860
      TELL FIXED BIN(15),                                               00000870
                                                                        00000880
      1 FNR_REG,                                                        00000890
        2 FNR1         FIXED DEC(11),                                   00000900
        2 FNR2         FIXED DEC(11),                                   00000910
        2 BRUKERID     CHAR     ( 4);                                   00000920
   DCL                                                                  00000930
      ALDER FIXED DEC (5);                                              00000940
      TELL_BARN = 0;                                                    00000950
                                                                        00000960
      FNR_REG.BRUKERID =          DIV_PARAM_OMR.CICS_IND;               00000970
                                                                        00000980
      DO ANT_BARN = 1 TO 12;                                            00000990
                                                                        00001000
       IF F_FELT_PIC_CHAR11(U2B.FNR_BARN(ANT_BARN)) ^= (11)'0' THEN     00001010
        DO;                                                             00001020
         IF ^F_NUMERISK(F_FELT_PIC_CHAR11(U2B.FNR_BARN(ANT_BARN)))      00001030
         THEN                                                           00001040
            DO;                                                         00001050
               IF ^FEIL19 THEN                                          00001060
                  DO;                                                   00001070
                     FEIL19 = '1'B;                                     00001080
                     U2B.FNR_BARNNR(ANT_BARN) = 200;                    00001090
                  END;                                                  00001100
               ELSE                                                     00001110
                  U2B.FNR_BARNNR(ANT_BARN) = 200;                       00001120
            END;                                                        00001130
         ELSE                                                           00001140
         IF ^ F_GYLDIG_FNR(U2B.FNR_BARN(ANT_BARN)) THEN                 00001150
            DO;                                                         00001160
               IF ^FEIL20 THEN                                          00001170
                  DO;                                                   00001180
                     FEIL20 = '1'B;                                     00001190
                     U2B.FNR_BARNNR(ANT_BARN) = 20;                     00001200
                  END;                                                  00001210
               ELSE                                                     00001220
                  U2B.FNR_BARNNR(ANT_BARN) = 999;                       00001230
            END;                                                        00001240
         ELSE                                                           00001250
            DO;                                                         00001260
               FNR_REG.FNR1 = U2B.FNR_BARN(ANT_BARN);                   00001270
               EXEC CICS LINK PROGRAM('R0019906')                       00001280
               COMMAREA(FNR_REG);                                       00001290
               IF FNR_REG.FNR2 > 0 THEN                                 00001300
                  DO;                                                   00001310
                    U2B.FNR_BARNNR(ANT_BARN) = 203;                     00001320
                    U2B.FNR_BARN(ANT_BARN) = FNR_REG.FNR2;              00001330
                    U2B.FNR_GML_BARN(ANT_BARN) = FNR_REG.FNR1;          00001340
                  END;                                                  00001350
               ALDER =                                                  00001360
               F_ALDER(U2B.FNR_BARN(ANT_BARN),U2S.VIRK_DATO_MÅ);        00001370
               IF ALDER > 1800 THEN                                     00001380
                  DO;                                                   00001390
                     IF ^FEIL21 THEN                                    00001400
                        DO;                                             00001410
                           FEIL21 = '1'B;                               00001420
                           U2B.FNR_BARNNR(ANT_BARN) = 21;               00001430
                        END;                                            00001440
                     ELSE                                               00001450
                        U2B.FNR_BARNNR(ANT_BARN) = 999;                 00001460
                  END;                                                  00001470
               ELSE                                                     00001480
                  IF ALDER < 0 THEN                                     00001490
                     DO;                                                00001500
                        IF ^FEIL22 THEN                                 00001510
                           DO;                                          00001520
                              FEIL22 = '1'B;                            00001530
                              U2B.FNR_BARNNR( ANT_BARN) = 22;           00001540
                           END;                                         00001550
                        ELSE                                            00001560
                           U2B.FNR_BARNNR( ANT_BARN) = 999;             00001570
                     END;                                               00001580
                                                                        00001590
 /*LOVENDRING MED VIRKNING FRA 1.1.91 HL : */                           00001600
                                                                        00001610
               ELSE                                                     00001620
                  IF F_SNU_DATO(U2S.VIRK_DATO_MÅ) > 9012  &             00001630
                     ALDER < 1 THEN                                     00001640
                     DO;                                                00001650
                        IF ^FEIL22 THEN                                 00001660
                           DO;                                          00001670
                              FEIL22 = '1'B;                            00001680
                              U2B.FNR_BARNNR( ANT_BARN) = 22;           00001690
                           END;                                         00001700
                        ELSE                                            00001710
                           U2B.FNR_BARNNR( ANT_BARN) = 999;             00001720
                     END;                                               00001730
                IF F_FELT_PIC_CHAR11(U2B.FNR_BARN(ANT_BARN)) =          00001740
                F_FELT_PIC_CHAR11(U2S.FNR) THEN                         00001750
                  DO;                                                   00001760
                    FEIL_FUNNET = '1'B;                                 00001770
                    U2B.FNR_BARNNR(ANT_BARN) = 165;                     00001780
                  END;                                                  00001790
                ELSE                                                    00001800
                IF F_FELT_PIC_CHAR11(U2B.FNR_BARN(ANT_BARN)) =          00001810
                F_FELT_PIC_CHAR11(U2S.FNR_EK) THEN                      00001820
                  DO;                                                   00001830
                    FEIL_FUNNET = '1'B;                                 00001840
                    U2B.FNR_BARNNR(ANT_BARN) = 165;                     00001850
                  END;                                                  00001860
              END;                                                      00001870
            IF U2B.RBT_BARN(ANT_BARN) = 'J' THEN                        00001880
              DO;                                                       00001890
                 IF F_SNU_DATO(U2S.VIRK_DATO_MÅ) < 8407 THEN            00001900
                    DO;                                                 00001910
                       FEIL_FUNNET = '1'B;                              00001920
                       U2S.VIRK_DATO_MÅNR = 276;                        00001930
                    END;                                                00001940
              END;                                                      00001950
            ELSE                                                        00001960
               IF U2B.RBT_BARN(ANT_BARN) ^= ' ' THEN                    00001970
                  DO;                                                   00001980
                     FEIL_FUNNET = '1'B;                                00001990
                     U2B.RBT_BARNNR(ANT_BARN) = 271;                    00002000
                  END;                                                  00002010
             TELL_BARN = TELL_BARN + 1;                                 00002020
            END;                                                        00002030
         ELSE                                                           00002040
            LEAVE;                                                      00002050
      END;                                                              00002060
      IF ^FEIL_FUNNET THEN                                              00002070
        IF U2S.BT_ANT ^= TELL_BARN THEN                                 00002080
           DO;                                                          00002090
              FEIL_FUNNET = '1'B;                                       00002100
              U2S.BT_ANTNR = 23;                                        00002110
           END;                                                         00002120
                                                                        00002130
      FEIL_FUNNET = FEIL_FUNNET ! FEIL21 ! FEIL22 ! FEIL19 ! FEIL20;    00002140
                                                                        00002150
  /*  HER SJEKKES OM ET FØDSELSNUMMER ER SKREVET MER ENN EN GANG    */  00002160
      IF ^FEIL_FUNNET  THEN                                             00002170
        IF U2S.BT_ANT > 0 THEN                                          00002180
           DO ANT_BARN = 1 TO 12 WHILE(U2B.FNR_BARN(ANT_BARN) > 0);     00002190
              DO TELL = ANT_BARN TO 12 WHILE(U2B.FNR_BARN(TELL) > 0);   00002200
                 IF TELL ^= ANT_BARN THEN                               00002210
                    IF U2B.FNR_BARN(TELL) = U2B.FNR_BARN(ANT_BARN) THEN 00002220
                       DO;                                              00002230
                          FEIL_FUNNET = '1'B;                           00002240
                          U2B.FNR_BARNNR(ANT_BARN) = 124;               00002250
                          U2B.FNR_BARNNR(TELL) = 999;                   00002260
                       END;                                             00002270
              END;                                                      00002280
           END;                                                         00002290
                                                                        00002300
  /*  HER GÅR EN INN I TABELLEN OG SETTER NULL I ALLE FNR ETTER DET     00002310
      FØRSTE SOM ER NULL */                                             00002320
                                                                        00002330
      DO ANT_BARN = 1 TO 12 UNTIL(F_FELT_PIC_CHAR11                     00002340
      (U2B.FNR_BARN(ANT_BARN)) = (11)'0');                              00002350
        IF F_FELT_PIC_CHAR11(U2B.FNR_BARN(ANT_BARN)) = (11)'0' THEN     00002360
           DO TELL = ANT_BARN TO 12;                                    00002370
              U2B.FNR_BARN(TELL) = 0;                                   00002380
              U2B.RBT_BARN(TELL) = ' ';                                 00002390
           END;                                                         00002400
      END;                                                              00002410
   END KONTROLL_U2_BARN;                                                00002420
