 /*       SIST ENDRET 25/02-97 11.52.47 AV   JDA7339                  */00000000
 /*       SIST ENDRET 06/02-96 13.20.12 AV   JDA0310                  */00000010
 /*       SIST ENDRET 10/01-96 10.55.55 AV   TSB0310                  */00000020
 /*       SIST ENDRET 17/02-94 13.29.56 AV   TRUDE                    */00000030
 /* ***************************************************************** */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /* **********************                                            */00000060
 /*  PROGRAM-IDENT : R00104E1  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000070
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000080
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000090
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000100
 /*                                                                   */00000110
 /* ***************************************************************** */00000120
 /*HENSIKT:                                                           */00000130
 /* **********                                                        */00000140
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000150
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000160
 /*    FORHÅND.                                                       */00000170
 /*    MAPS HØRER INN UNDER MAPSET 'S001F1'.                         */ 00000180
 /*                                                                   */00000190
 /* ***************************************************************** */00000200
 /*PROGRAMTILKNYTTING:                                                */00000210
 /* ********************                                              */00000220
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000230
 /*                                                                   */00000240
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000250
 /*    BRUK :                                                         */00000260
 /*    EXEC CICS XCTL PROGRAM ('R00104E1') COMMAREA(KOM_OMR);         */00000270
 /*    PROGRAMMET INCLUDER :                                          */00000280
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    E1       */00000290
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       E1       */00000300
 /* ***************************************************************** */00000310
 /*DATASETTOPPLYSNINGER:                                              */00000320
 /* ***********************                                           */00000330
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000340
 /*                                                                   */00000350
 /* ***************************************************************** */00000360
 /*FEILMELDINGER:                                                     */00000370
 /* *******************                                               */00000380
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000390
 /*                                                                   */00000400
 /* ***************************************************************** */00000410
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000420
                                                                        00000430
          %INCLUDE P0019906;                                            00000440
          %INCLUDE P0019908;                                            00000450
          %INCLUDE P0019910;                                            00000460
          %INCLUDE P0019912;                                            00000470
          %INCLUDE P0019913;                                            00000480
                                                                        00000490
 DCL                                                                    00000500
      (CSTG, ADDR)                   BUILTIN;                           00000510
 DCL  COMMAREA_PEKER         PTR,                                       00000520
      LOKAL_KOM_PTR          PTR;                                       00000530
                                                                        00000540
                                                                        00000550
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000560
 DCL                                                                    00000570
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000580
    DFHBMUNP             CHAR(1) INIT(' '),                             00000590
    DFHBMBRY             CHAR(1) INIT('H'),                             00000600
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000610
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000620
    MELDING6O            CHAR(10),                                      00000630
    YMELDING6O           CHAR(10);                                      00000640
                                                                        00000650
          %INCLUDE S001F1  ;                                            00000660
          %INCLUDE P0011401;                                            00000670
                                                                        00000680
                                                                        00000690
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000700
                                                                        00000710
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000720
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000730
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000740
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000750
                                                                        00000760
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000770
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000780
                                                                        00000790
 /*   HOVED PROC                              */                        00000800
       /*  ***************************        */                        00000810
                                                                        00000820
           CALL OVERFØR_E1SØKER_MAP;                /* R0011406 */      00000830
           CALL OVERFØR_E1KAP7_MAP;                 /* R0011406 */      00000840
           CALL OVERFØR_E1KAP8_MAP;                 /* R0011406 */      00000850
           CALL OVERFØR_E1KAP10_MAP;                /* R0011406 */      00000860
           CALL OVERFØR_E1KAP11_MAP;                /* R0011406 */      00000870
           S001141O.DUMMYA = 'Ø';                   /* PROT,DARK  */    00000880
                                                                        00000890
           /* FREE TRANS_OMR,TRANS_OPPL_OMR;   */                       00000900
                                                                        00000910
                                                                        00000920
  /* ***END HOVED PROC                  */                              00000930
                                                                        00000940
      EXEC CICS RETURN;                                                 00000950
                                                                        00000960
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00000970
      PROC(FIXED_DEC_5);                                                00000980
                                                                        00000990
      DCL                                                               00001000
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00001010
                                                                        00001020
   END SKRIV_FEIL;                                                      00001030
                                                                        00001040
        SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001050
                                                                        00001060
           DCL                                                          00001070
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001080
                                                                        00001090
        END SKRIV_FEIL_YP;                                              00001100
                                                                        00001110
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001120
                                                                        00001130
           DCL                                                          00001140
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001150
                                                                        00001160
        END SKRIV_FEIL_SP;                                              00001170
                                                                        00001180
          %INCLUDE R0019912;                                            00001190
          %INCLUDE R0011406;                                            00001200
                                                                        00001210
 END R001041;                                                           00001220
