 /*       SIST ENDRET 22/06-98 11.45.30 AV   JDA7339                  */00000000
 /*       SIST ENDRET 22/06-98 11.42.54 AV   JDA7339                  */00000010
 /*       SIST ENDRET 16/09-97 10.26.20 AV   JDA7339                  */00000020
 /*       SIST ENDRET 15/09-97 13.33.00 AV   JDA7339                  */00000030
 /*       SIST ENDRET 04/09-95 13.41.26 AV   TSB0310                  */00000040
 /*       SIST ENDRET 03/03-92 09.55.59 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 17/02-92 13.58.08 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 18/12-91 14.55.04 AV   HERMAN                   */00000070
 /*       SIST ENDRET 13/12-91 14.21.32 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 14/06-91 13.30.38 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 18/05-90 14.21.57 AV   HERMAN                   */00000100
 /*       SIST ENDRET 11/05-90 13.08.46 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 29/03-88 13.22.19 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 17/03-87 15.03.42 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 27/03-84 15.50.28 AV   KARIN                    */00000140
 /*       SIST ENDRET 25/05-83 12.59.40 AV   OLAV                     */00000150
 /*       SIST ENDRET 25/04-83 11.57.42 AV   JANKR                    */00000160
 /* **************************************************************** */ 00000170
 /*IDENTIFIKASJON:                                                   */ 00000180
 /*    R0014701 - PROSEDYRE I PLI                                    */ 00000190
 /*    PROGRAMMERER: JAN, JUNI 82                                    */ 00000200
 /* **************************************************************** */ 00000210
 /*HENSIKT:                                                          */ 00000220
 /*    BEREGNE ETTERLATTEPENSJON BARN BEGGE FORELDRE DØDE            */ 00000230
 /*PROGRAMTILKNYTNING:                                               */ 00000240
 /*    KALLES OPP AV PROGRAM R0013520                                */ 00000250
 /*BRUK:                                                             */ 00000260
 /*    EXEC CICS XCTL PROGRAM ('R0014701') COMMAREA (KOM_OMR)        */ 00000270
 /* **************************************************************** */ 00000280
 /* REVIDERT 27.4.90 HL                                              */ 00000290
 /* **************************************************************** */ 00000300
 %PAGE;                                                                 00000310
 REGN_FB:                                                               00000320
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000330
 %PAGE;                                                                 00000340
      %INCLUDE P0011001;                                                00000350
      %INCLUDE P0019906;                                                00000360
      %INCLUDE P0019908;                                                00000370
      %INCLUDE P0019910;                                                00000380
      %INCLUDE P0019912;                                                00000390
      %INCLUDE P0019924;                                                00000400
      %INCLUDE P0014002;                                                00000410
      %INCLUDE P0014003;                                                00000420
      %INCLUDE P0014009;                                                00000430
 %PAGE;                                                                 00000440
   DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                       00000450
   DCL COMMAREA_PEKER PTR;                                              00000460
 %PAGE;                                                                 00000470
   DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                       00000480
 %PAGE;                                                                 00000490
   DCL                                                                  00000500
      (CSTG,DATE,ROUND,SUBSTR,SUM,ADDR) BUILTIN;                        00000510
                                                                        00000520
  DCL W_PENSJON_ETTER                     CHAR     (1),                 00000530
      W_GP                                DEC FIXED(9,2) INIT (0),      00000540
      W_TP                                DEC FIXED(7)  INIT (0),       00000550
      W_BP_GARANTI                        DEC FIXED(7)  INIT (0),       00000560
      W_GARANTI                           DEC FIXED(7)  INIT (0),       00000570
      GARANTI_M                           DEC FIXED(7)  INIT (0),       00000580
      GARANTI_F                           DEC FIXED(7)  INIT (0),       00000590
      GARANTI_M2                          DEC FIXED(7)  INIT (0),       00000600
      GARANTI_F2                          DEC FIXED(7)  INIT (0),       00000610
      GARANTI                             DEC FIXED(7)  INIT (0),       00000620
      GARANTI_TILLEGG                     DEC FIXED(7)  INIT (0),       00000630
      W_ST                                DEC FIXED(7)  INIT (0),       00000640
      W_KT                                DEC FIXED(7)  INIT (0),       00000650
      W_TP_MOR                            DEC FIXED(7) INIT (0),        00000660
      W_TP_FAR                            DEC FIXED(7) INIT (0),        00000670
      W_ST_UFØR                           DEC FIXED(7)  INIT (0),       00000680
      W_KT_UFØR                           DEC FIXED(7)  INIT (0),       00000690
      W_GP_UFØR                           DEC FIXED(7)  INIT (0),       00000700
      W_SUM_UFØR                          DEC FIXED(7)  INIT (0),       00000710
      W_SUM_BP                            DEC FIXED(7)  INIT (0),       00000720
      W_ANTALL_BARN                       DEC FIXED(3)  INIT (0),       00000730
      MOR_IND                             FIXED BIN(15),                00000740
      FAR_IND                             FIXED BIN(15),                00000750
      I                                   FIXED BIN(15),                00000760
      FNR                                 PIC '(11)9' INIT (0);         00000770
   DCL                                                                  00000780
    1 FNR_R   DEF FNR POS(1),                                           00000790
      2 DAG                   PIC '(2)9',                               00000800
      2 MND                   PIC '(2)9',                               00000810
      2 ÅR                    PIC '(2)9',                               00000820
      2 ÅRHUNDRE              PIC '9',                                  00000830
      2 FILLER                PIC '(4)9';                               00000840
   DCL                                                                  00000850
    1 FNR_ÅM,                                                           00000860
      2 FNR_Å                 PIC '(2)9',                               00000870
      2 FNR_M                 PIC '(2)9';                               00000880
                                                                        00000890
   DCL DØDSTP_ÅMD             PIC '(6)9';                               00000900
   DCL DØDSTP_ÅR DEF DØDSTP_ÅMD POS(1)      PIC '99';                   00000910
   DCL DØDSÅR                 FIXED DEC (3);                            00000920
   /*9708 HL :*/                                                        00000930
   DCL VIRK_ÅM             FIXED DEC (4)   INIT (0);                    00000940
   DCL ALDER                  PIC 'S99999'   INIT (0);                  00000950
   DCL SPT_GARANTI         FIXED DEC (3,2)   INIT (0);                  00000960
   DCL GARANTI_HØYEST(2)      CHAR (1)       INIT ('N');                00000970
 %PAGE;                                                                 00000980
 /* ***************************************************************** */00000990
 /* PROGRAMMET STARTER HER.                                           */00001000
 /* ***************************************************************** */00001010
                                                                        00001020
    MOR_IND  = 1;                                                       00001030
    FAR_IND  = 2;                                                       00001040
    VIRK_ÅM  = B02.VIRK_DATO_ÅM(BER_SØ_IND);                            00001050
                                                                        00001060
    W_GP            = 0;                                                00001070
    W_TP_MOR        = 0;                                                00001080
    W_TP_FAR        = 0;                                                00001090
    W_GARANTI       = 0;                                                00001100
    W_GP_UFØR       = 0;                                                00001110
                                                                        00001120
 /* ***************************************************************** */00001130
 /* KALL SOM BEREGNER GRUNNPENSJON FOR BARN1.                         */00001140
 /* GP ER ÅRSBELØP OG IKKE DELT PÅ ANTALL BARN, IKKE FORHØYET.        */00001150
 /* ***************************************************************** */00001160
                                                                        00001170
    CALL BEREGN_GP_BARN1;                                               00001180
                                                                        00001190
 /* ***************************************************************** */00001200
 /* KALL SOM BEREGNER TILLEGGSPENSJON FOR BARN.                       */00001210
 /* ***************************************************************** */00001220
 /* W_TP ER MÅNEDSBELØP DELT PÅ ANTALL BARN, MEN IKKE FORHØYET.       */00001230
 /* ***************************************************************** */00001240
                                                                        00001250
    FNR             = B02.FNR(MOR_IND);                                 00001260
    POTALL_OPPL.IND = MOR_IND;                                          00001270
                                                                        00001280
    IF FNR > 0 THEN                                                     00001290
       DO;                                                              00001300
          DØDSÅR    = B02.DØDSDATO_ÅMD(MOR_IND) / 10000;                00001310
          CALL BEREGN_TP_BARN(W_TP_MOR,FNR_R.ÅR,POREKKE(MOR_IND));      00001320
                                                                        00001330
          IF FEIL_MELD_NR > 0  THEN                                     00001340
             GO TO L999;                                                00001350
          ELSE                                                          00001360
             PROGRAM_ID = 'R0014701';                                   00001370
       END;                                                             00001380
                                                                        00001390
    FNR             = B02.FNR(FAR_IND);                                 00001400
    POTALL_OPPL.IND = FAR_IND;                                          00001410
                                                                        00001420
    IF FNR > 0 THEN                                                     00001430
       DO;                                                              00001440
          DØDSÅR    = B02.DØDSDATO_ÅMD(FAR_IND) / 10000;                00001450
          CALL BEREGN_TP_BARN(W_TP_FAR,FNR_R.ÅR,POREKKE(FAR_IND));      00001460
                                                                        00001470
          IF FEIL_MELD_NR > 0  THEN                                     00001480
             GO TO L999;                                                00001490
          ELSE                                                          00001500
             PROGRAM_ID = 'R0014701';                                   00001510
       END;                                                             00001520
                                                                        00001530
    W_ANTALL_BARN   = B02.ANTALL_BARN(BER_SØ_IND);                      00001540
                                                                        00001550
 /* ***************************************************************** */00001560
 /* DERSOM MORENS PENSJON ER MINDRE ENN FARENS PENSJON.               */00001570
 /* ***************************************************************** */00001580
                                                                        00001590
  IF B02.FNR(MOR_IND) > 0 & B02.FNR(FAR_IND) > 0 THEN                   00001600
   DO;                                                                  00001610
     /* MOREN OG FAREN ER REGISTRERT SOM DØDE */                        00001620
    IF W_TP_MOR  < W_TP_FAR        THEN                                 00001630
       DO;                                                              00001640
          W_PENSJON_ETTER = 'F';                                        00001650
          W_TP            = W_TP_FAR / W_ANTALL_BARN + 0.5;             00001660
          POTALL_OPPL.IND = FAR_IND;                                    00001670
       END;                                                             00001680
                                                                        00001690
 /* ***************************************************************** */00001700
 /* MORENS PENSJON ER STØRST.                                         */00001710
 /* ***************************************************************** */00001720
                                                                        00001730
    ELSE                                                                00001740
       DO;                                                              00001750
          W_PENSJON_ETTER = 'M';                                        00001760
          W_TP            = W_TP_MOR / W_ANTALL_BARN + 0.5;             00001770
          POTALL_OPPL.IND = MOR_IND;                                    00001780
       END;                                                             00001790
   END;                                                                 00001800
  ELSE                                                                  00001810
   DO;                                                                  00001820
     /* MOREN OG ELLER FAREN ER UOPPGITT */                             00001830
     IF B02.FNR(MOR_IND) > 0 THEN                                       00001840
        /* MOREN ER REGISTRERT SOM DØD */                               00001850
        DO;                                                             00001860
          W_PENSJON_ETTER = 'M';                                        00001870
          W_TP            = W_TP_MOR / W_ANTALL_BARN + 0.5;             00001880
          POTALL_OPPL.IND = MOR_IND;                                    00001890
        END;                                                            00001900
     ELSE                                                               00001910
        DO;                                                             00001920
          IF B02.FNR(FAR_IND) > 0 THEN                                  00001930
          /* FAREN ER REGISTRERT SOM DØD */                             00001940
             DO;                                                        00001950
               W_PENSJON_ETTER = 'F';                                   00001960
               W_TP            = W_TP_FAR / W_ANTALL_BARN + 0.5;        00001970
               POTALL_OPPL.IND = MOR_IND;                               00001980
             END;                                                       00001990
          ELSE                                                          00002000
             DO;  /* INGEN AV FORELDRENE ER KJENT */                    00002010
                  /* OG VI HAR LAGT PENSJONEN INN I MORENS GP */        00002020
                W_PENSJON_ETTER = ' ';                                  00002030
                W_TP            = 0;                                    00002040
                POTALL_OPPL.IND = MOR_IND;                              00002050
             END;                                                       00002060
        END;                                                            00002070
   END;                                                                 00002080
                                                                        00002090
   IF GARANTI_HØYEST(MOR_IND) = 'J'       &                             00002100
      W_PENSJON_ETTER = 'M'                  THEN                       00002110
      B02.TP_GAR_KODE(SØKER_IND) = 'E';                                 00002120
   ELSE                                                                 00002130
   IF GARANTI_HØYEST(FAR_IND) = 'J'       &                             00002140
      W_PENSJON_ETTER = 'F'                  THEN                       00002150
      B02.TP_GAR_KODE(SØKER_IND) = 'E';                                 00002160
   ELSE                                                                 00002170
      B02.TP_GAR_KODE(SØKER_IND) = ' ';                                 00002180
                                                                        00002190
 /* ***************************************************************** */00002200
 /* F_BEREGN_SÆRTILLEGG_BARN ER EN FUNKSJON SOM BEREGNER SÆRTILLEGG   */00002210
 /* FOR BARN.                                                         */00002220
 /* ST ER MÅNEDSBELØP DELT PÅ ANTALL BARN OG FORHØYET.                */00002230
 /* ***************************************************************** */00002240
                                                                        00002250
    W_ST = F_BEREGN_SÆRTILLEGG_BARN(B02.VIRK_DATO_ÅM(BER_SØ_IND),       00002260
   B02.TT_ANV(BER_SØ_IND),W_TP,G,ST_PROSENT_ENSLIG,W_ANTALL_BARN);      00002270
                                                                        00002280
 /* ***************************************************************** */00002290
 /* F_BEREGN_KOMPENSASJONSTILLEGG ER EN FUNKSJON SOM BEREGNER         */00002300
 /* KOMPENSASJONSTILLEGG.                                             */00002310
 /* KT ER MÅNEDSBELØP DELT PÅ ANTALL BARN OG FORHØYET.                */00002320
 /* ***************************************************************** */00002330
                                                                        00002340
 /* ENDRET 10.02.88 SATISH                                            */00002350
 /* W_KT = F_BEREGN_KOMPENSASJONSTILLEGG(                            */ 00002360
 /*                              'Y',TT_ANV_BP,W_ANTALL_BARN,1,'J'); */ 00002370
 /* HIT TIL 10.02.88                                                  */00002380
                                                                        00002390
    W_KT = F_BEREGN_KOMPENSASJONSTILLEGG('B',                           00002400
          'P',B02.TT_ANV(BER_SØ_IND),W_ANTALL_BARN,1,'J');              00002410
                                                                        00002420
 /* ***************************************************************** */00002430
 /* HVIS BARNA ER BOSATT I UTLANDET SKAL DET IKKE YTES KOMP.TILLEGG.  */00002440
 /* DEN ENESTE MULIGHETEN FOR Å TESTE PÅ DETTE, ER Å TESTE MOT TKNR.  */00002450
 /* ERIK, 16.3.87.                                                    */00002460
 /* ***************************************************************** */00002470
                                                                        00002480
    IF B02.TKNR(BER_SØ_IND) = '2101' THEN                               00002490
       DO;                                                              00002500
          W_KT = 0 ;                                                    00002510
       END;                                                             00002520
                                                                        00002530
 /* ***************************************************************** */00002540
 /* DERSOM DET ER FLERE ENN ETT BARN I B02                            */00002550
 /* ***************************************************************** */00002560
                                                                        00002570
    IF W_ANTALL_BARN > 1 THEN                                           00002580
       DO;                                                              00002590
          W_GP = W_GP + G * 0.4;                                        00002600
          IF W_ANTALL_BARN > 2 THEN                                     00002610
             W_GP = W_GP + G * 0.25 * (W_ANTALL_BARN - 2);              00002620
       END;                                                             00002630
    W_GP = W_GP / (W_ANTALL_BARN * 12) + 0.5;                           00002640
                                                                        00002650
 /*KOMP.TILLEGGET ENDRET FRA 1.5.91 ( G > 34100 ) */                    00002660
                                                                        00002670
  IF G > 34100 THEN                                                     00002680
     IF W_KT > W_ST THEN                                                00002690
        W_KT = W_KT - W_ST;                                             00002700
     ELSE                                                               00002710
        W_KT = 0;                                                       00002720
    W_SUM_BP = W_GP + W_TP + W_ST + W_KT;                               00002730
                                                                        00002740
 /* ***************************************************************** */00002750
 /* GARANTI-BEREGNINGER.                                              */00002760
 /* ***************************************************************** */00002770
                                                                        00002780
                                                                        00002790
                                                                        00002800
 /* ***************************************************************** */00002810
 /* DERSOM DET ER MINDRE ENN 3 BARN I B02.                            */00002820
 /* ***************************************************************** */00002830
                                                                        00002840
    IF W_ANTALL_BARN < 2 THEN                                           00002850
          W_BP_GARANTI = 0.4 * G / 12 + 0.5;                            00002860
    ELSE                                                                00002870
       DO;                                                              00002880
                                                                        00002890
 /* ***************************************************************** */00002900
 /* ANTALL BARN I B02 ER STØRRE ENN 2.                                */00002910
 /* ***************************************************************** */00002920
                                                                        00002930
          W_BP_GARANTI = 0.4 * G * 2;                                   00002940
          W_BP_GARANTI = W_BP_GARANTI   +                               00002950
                         0.25 * G * (W_ANTALL_BARN - 2);                00002960
          W_BP_GARANTI = W_BP_GARANTI /                                 00002970
                         (W_ANTALL_BARN * 12) + 0.5;                    00002980
       END;                                                             00002990
    IF W_SUM_BP < W_BP_GARANTI THEN                                     00003000
       DO;                                                              00003010
          W_GARANTI         = W_BP_GARANTI - W_SUM_BP;                  00003020
          W_SUM_BP          = W_BP_GARANTI;                             00003030
       END;                                                             00003040
    ELSE                                                                00003050
    IF B02.GT_LOV92(1) > 0        !                                     00003060
       B02.GT_LOV92(2) > 0        !                                     00003070
       B02.GT_LOV92(3) > 0          THEN                                00003080
       DO;                                                              00003090
          FNR       = B02.FNR(MOR_IND);                                 00003100
          GARANTI_M = F_TILLEGGSPENSJON(FNR_R.ÅR,35500,                 00003110
                               B02.SPT_1291_MOR(3),                     00003120
                               B02.OPT_1291_MOR(3),                     00003130
                               B02.PÅ_1291_MOR(3),100,55,'J');          00003140
          GARANTI_M2 = F_TILLEGGSPENSJON(FNR_R.ÅR,35500,                00003150
                               B02.UFØRPENS.SPT_1291(1),                00003160
                               B02.UFØRPENS.OPT_1291(1),                00003170
                               B02.UFØRPENS.PÅ_1291(1),                 00003180
                               100,55,'J');                             00003190
          IF GARANTI_M2 > GARANTI_M        THEN                         00003200
             GARANTI_M = GARANTI_M2;                                    00003210
          FNR       = B02.FNR(FAR_IND);                                 00003220
          GARANTI_F = F_TILLEGGSPENSJON(FNR_R.ÅR,35500,                 00003230
                               B02.SPT_1291_FAR(3),                     00003240
                               B02.OPT_1291_FAR(3),                     00003250
                               B02.PÅ_1291_FAR(3),100,55,'J');          00003260
          GARANTI_F2 = F_TILLEGGSPENSJON(FNR_R.ÅR,35500,                00003270
                               B02.UFØRPENS.SPT_1291(2),                00003280
                               B02.UFØRPENS.OPT_1291(2),                00003290
                               B02.UFØRPENS.PÅ_1291(2),                 00003300
                               100,55,'J');                             00003310
          IF GARANTI_F2 > GARANTI_F        THEN                         00003320
             GARANTI_F = GARANTI_F2;                                    00003330
                                                                        00003340
          IF GARANTI_M > GARANTI_F         THEN                         00003350
             GARANTI = GARANTI_M;                                       00003360
          ELSE                                                          00003370
             GARANTI = GARANTI_F;                                       00003380
                                                                        00003390
          GARANTI   =  GARANTI/ W_ANTALL_BARN  + 0.5;                   00003400
          IF GARANTI >  W_TP                  THEN                      00003410
             DO;                                                        00003420
                GARANTI_TILLEGG =  GARANTI - W_TP;                      00003430
                IF W_ST > GARANTI_TILLEGG     THEN                      00003440
                   W_ST = W_ST - GARANTI_TILLEGG;                       00003450
                ELSE                                                    00003460
                   DO;                                                  00003470
                      W_SUM_BP = W_SUM_BP + GARANTI_TILLEGG - W_ST;     00003480
                      W_ST = 0;                                         00003490
                   END;                                                 00003500
             END;                                                       00003510
          ELSE                                                          00003520
             DO;                                                        00003530
                GARANTI = 0;                                            00003540
                GARANTI_TILLEGG = 0;                                    00003550
             END;                                                       00003560
                                                                        00003570
       END;                                                             00003580
    DO I = 3 TO 14;                                                     00003590
                                                                        00003600
 /* ***************************************************************** */00003610
 /* DERSOM BARNET HAR BARNEPENSJON                                    */00003620
 /* ***************************************************************** */00003630
                                                                        00003640
       IF B02.PENSJONSTYPE1 (I) = 'B' THEN                              00003650
          DO;                                                           00003660
                                                                        00003670
 /* ***************************************************************** */00003680
 /* DERSOM BARNET ER ETTERLATT MED UFØREPENSJON                       */00003690
 /* ***************************************************************** */00003700
                                                                        00003710
             IF B02.PENSJONSTYPE3(I) = 'U' THEN                         00003720
                DO;                                                     00003730
                                                                        00003740
 /* ***************************************************************** */00003750
 /* SYSTEMET KAN IKKE BEREGNE TILLEGGSPENSJON I SLIKE TILFELLE,       */00003760
 /* MELDING PÅ STØNADSBREVET OM DETTE.                                */00003770
 /* ***************************************************************** */00003780
                                                                        00003790
                    CALL BEREGN_GP_UFØR_ETTERLATT_BARN( I,              00003800
                                             B02.TT_ANV(I), W_GP_UFØR); 00003810
                    W_ST_UFØR   = F_BEREGN_SÆRTILLEGG_BARN(             00003820
                                             B02.VIRK_DATO_ÅM (I),      00003830
                                             B02.TT_ANV(I),             00003840
                                             0,G,ST_PROSENT_ENSLIG,1);  00003850
   /*  ENDRET 15.03.88  SATISH                                       */ 00003860
   /*               W_KT_UFØR   = F_BEREGN_KOMPENSASJONSTILLEGG('Y', */ 00003870
   /*                                         B02.TT_ANV(I),         */ 00003880
   /*                                         1,1,'J');              */ 00003890
   /*  HITTIL 15.03.88                                               */ 00003900
                    W_KT_UFØR   = F_BEREGN_KOMPENSASJONSTILLEGG('B',    00003910
                                          'P',B02.TT_ANV(I),            00003920
                                              1,1,'J');                 00003930
 /*KOMP.TILLEGGET ENDRET FRA 1.5.91 ( G > 34100 ) */                    00003940
                                                                        00003950
  IF G > 34100 THEN                                                     00003960
     IF W_KT_UFØR > W_ST_UFØR THEN                                      00003970
        W_KT_UFØR = W_KT_UFØR - W_ST_UFØR;                              00003980
     ELSE                                                               00003990
        W_KT_UFØR = 0;                                                  00004000
                    W_SUM_UFØR  =  W_GP_UFØR                            00004010
                                   + W_ST_UFØR                          00004020
                                   + W_KT_UFØR;                         00004030
                                                                        00004040
 /* ***************************************************************** */00004050
 /* DERSOM YTELSENE FOR UFØR ER W_STØRRE ENN SOM ETTERLATT BARN.      */00004060
 /* ***************************************************************** */00004070
                                                                        00004080
                    IF W_SUM_UFØR > W_SUM_BP THEN                       00004090
                       DO;                                              00004100
                          B02.UFØRPENS.GP  (I) = W_GP_UFØR;             00004110
                          B02.UFØRPENS.ST  (I) = W_ST_UFØR;             00004120
                          B02.UFØRPENS.KT  (I) = W_KT_UFØR;             00004130
                          B02.SUM_YTELSE   (I) = W_SUM_UFØR;            00004140
                                                                        00004150
 /* **************************************************************** */ 00004160
 /* ETTEBARN-SEGMENTET NULLES                                        */ 00004170
 /* **************************************************************** */ 00004180
                                                                        00004190
                          B02.ETTEBARN(I) = '';                         00004200
                       END;                                             00004210
                    ELSE                                                00004220
                       DO;                                              00004230
                                                                        00004240
 /* ***************************************************************** */00004250
 /* GARANTITILLEGGET LEGGES INN SOM GP.                               */00004260
 /* ***************************************************************** */00004270
                                                                        00004280
                          B02.PENSJON_ETTER(I) = W_PENSJON_ETTER;       00004290
                          B02.ETTEBARN.GP (I) = W_GP + W_GARANTI;       00004300
                          B02.ETTEBARN.TP (I) = W_TP;                   00004310
                          B02.ETTEBARN.ST (I) = W_ST;                   00004320
                          B02.ETTEBARN.KT (I) = W_KT;                   00004330
                          B02.SUM_YTELSE  (I) = W_SUM_BP;               00004340
                          B02.SPT_MOR     (I) = POREKKE.SPT(MOR_IND);   00004350
                          B02.OPT_MOR     (I) = POREKKE.OPT(MOR_IND);   00004360
                          B02.PÅ_MOR      (I) = POREKKE.PÅ (MOR_IND);   00004370
                 B02.PÅ_ETTER91_MOR(I) = POREKKE.PÅ_ETTER91(MOR_IND);   00004380
                          B02.SPT_FAR     (I) = POREKKE.SPT(FAR_IND);   00004390
                          B02.OPT_FAR     (I) = POREKKE.OPT(FAR_IND);   00004400
                          B02.PÅ_FAR      (I) = POREKKE.PÅ (FAR_IND);   00004410
                 B02.PÅ_ETTER91_FAR(I) = POREKKE.PÅ_ETTER91(FAR_IND);   00004420
                       END;                                             00004430
                 END;                                                   00004440
              ELSE                                                      00004450
                 DO;                                                    00004460
                                                                        00004470
 /* ***************************************************************** */00004480
 /* GARANTITILLEGGET LEGGES INN SOM GP.                               */00004490
 /* ***************************************************************** */00004500
                                                                        00004510
                    B02.PENSJON_ETTER(I) = W_PENSJON_ETTER;             00004520
                    B02.ETTEBARN.GP (I) = W_GP + W_GARANTI;             00004530
                    B02.ETTEBARN.TP (I) = W_TP;                         00004540
                    B02.ETTEBARN.ST (I) = W_ST;                         00004550
                    B02.ETTEBARN.KT (I) = W_KT;                         00004560
                          B02.GT_LOV92    (I) = GARANTI;                00004570
                    B02.GT_TILLEGG_LOV92  (I) = GARANTI_TILLEGG;        00004580
                    B02.SUM_YTELSE  (I) = W_SUM_BP;                     00004590
                    B02.SPT_MOR     (I) = POREKKE.SPT(MOR_IND);         00004600
                    B02.OPT_MOR     (I) = POREKKE.OPT(MOR_IND);         00004610
                    B02.PÅ_MOR      (I) = POREKKE.PÅ (MOR_IND);         00004620
                 B02.PÅ_ETTER91_MOR(I) = POREKKE.PÅ_ETTER91(MOR_IND);   00004630
                    B02.SPT_FAR     (I) = POREKKE.SPT(FAR_IND);         00004640
                    B02.OPT_FAR     (I) = POREKKE.OPT(FAR_IND);         00004650
                    B02.PÅ_FAR      (I) = POREKKE.PÅ (FAR_IND);         00004660
                 B02.PÅ_ETTER91_FAR(I) = POREKKE.PÅ_ETTER91(FAR_IND);   00004670
                 END;                                                   00004680
          END;                                                          00004690
    END;                                                                00004700
                                                                        00004710
 L999:                                                                  00004720
                                                                        00004730
 EXEC CICS RETURN;                                                      00004740
                                                                        00004750
        %INCLUDE R0014142; /* F_TILLEGGSPENSJON */                      00004760
        %INCLUDE R0014148; /* F_TP92            */                      00004770
        %INCLUDE R0014721;                                              00004780
        %INCLUDE R0014722;                                              00004790
        %INCLUDE R0014723;                                              00004800
        %INCLUDE R0014724;                                              00004810
        %INCLUDE R0014134;                                              00004820
        %INCLUDE R0014145;                                              00004830
        %INCLUDE R0014725;/*    F_TILL_P_BARN    */                     00004840
        %INCLUDE R0014199;/*  SPT_GARANTI_E      */                     00004850
        %INCLUDE R0019905;/*  F_ALDER            */                     00004860
        %INCLUDE R0019913;/*  F_SNU_DATO         */                     00004870
   END REGN_FB;                                                         00004880
