  /* *************************************************************** */ 00000000
  /* IDENTIFIKASJON:   R0017203                                      */ 00000010
  /* PROGRAMMERER:  HELEN    JULI, 1982                              */ 00000020
  /* HENSIKT:                                                        */ 00000030
  /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT    */ 00000040
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */ 00000050
  /*        HVER AJOURFØRT TRANSAKSJON.                              */ 00000060
  /* PROGRAMTILKNYTNING:                                             */ 00000070
  /*        PROGRAMMET KALLES OPP AV R0017001                        */ 00000080
  /*                                                                 */ 00000090
  /* *************************************************************** */ 00000100
    LAG_UFØRPENS_HEND:                                                  00000110
      PROC (PERSON_IND,EK_IND) OPTIONS (MAIN);                          00000120
  DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                        00000130
  /* *************************************************************** */ 00000140
  /*                                                                 */ 00000150
  /*   ARBEIDSOMRÅDE FOR  ROT_OPPLYSNINGER                           */ 00000160
  /*                                                                 */ 00000170
  /* *************************************************************** */ 00000180
  %SKIP;                                                                00000190
   DCL 1  W_ROT,                                                        00000200
          2   FNR                           FIXED DEC (11),             00000210
          2   NESTE_SB_VERSJON_NR           FIXED DEC (1),              00000220
          2   SISTE_TERMINAL_NR             FIXED DEC (1),              00000230
          2   SISTE_REGISTRERINGSTIDSPUNKT  FIXED DEC (11),             00000240
          2   PENSJTYP                      FIXED DEC (1),              00000250
          2   NAVN                              CHAR (25),              00000260
          2   TKNR                          FIXED DEC (5),              00000270
          2   SPRÅK                         FIXED DEC (1);              00000280
  /* *************************************************************** */ 00000290
  /*                                                                 */ 00000300
  /*   ARBEIDSOMRÅDE FOR HENDELSE_OPPLYSNINGER                       */ 00000310
  /*                                                                 */ 00000320
  /* *************************************************************** */ 00000330
  %SKIP;                                                                00000340
   DCL 1  W_HENDELSE,                                                   00000350
          2   HENDDATO                 FIXED DEC (11),                  00000360
          2   VERSJON                  FIXED DEC (3),                   00000370
          2   TERMINAL                 FIXED DEC (3),                   00000380
          2   FNR_EKTEF                FIXED DEC (11),                  00000390
          2   NAVN_EKTEF                    CHAR (25),                  00000400
          2   TEKSTYPE_A_KODE          FIXED DEC (1),                   00000410
          2   GP                       FIXED DEC (5),                   00000420
          2   TP                       FIXED DEC (5),                   00000430
          2   ST                       FIXED DEC (5),                   00000440
          2   KT                       FIXED DEC (3),                   00000450
          2   ET                       FIXED DEC (5),                   00000460
          2   BT                       FIXED DEC (5),                   00000470
          2   ANTALL_BARN              FIXED DEC (2),                   00000480
          2   VT_GP                    FIXED DEC (5),                   00000490
          2   VT_TP                    FIXED DEC (5),                   00000500
          2   TILLEGG_8_5_1            FIXED DEC (1),                   00000510
          2   TEKSTYPE_B1_KODE         FIXED DEC (1),                   00000520
          2   TEKSTYPE_B2_KODE         FIXED DEC (1),                   00000530
          2   APD                      FIXED DEC (3),                   00000540
          2   ØNSKET_APD               FIXED DEC (3),                   00000550
          2   UF_GRAD                  FIXED DEC (3),                   00000560
          2   TT                       FIXED DEC (3),                   00000570
          2   TT_EK                    FIXED DEC (3),                   00000580
          2   TEKSTYPE_C_KODE          FIXED DEC (1),                   00000590
          2   TEKSTYPE_D_KODE          FIXED DEC (1);                   00000600
  /* *************************************************************** */ 00000610
  /*                                                                 */ 00000620
  /*     ARBEIDSOMRÅDE FOR BEREGNINGSVEDLEGGSOPPLYSNINGER            */ 00000630
  /*                                                                 */ 00000640
  /* *************************************************************** */ 00000650
  %SKIP;                                                                00000660
   DCL 1  W_BERVEDL,                                                    00000670
          2   AAR                          FIXED DEC (2),               00000680
          2   G                            FIXED DEC (1),               00000690
          2   PI                           FIXED DEC (5),               00000700
          2   UFGRAD                       FIXED DEC (3),               00000710
          2   PP                           FIXED DEC (1),               00000720
          2   TEKSTYPE_D_KODE              FIXED DEC (1),               00000730
          2   TEKSTYPE_E_KODE              FIXED DEC (1),               00000740
          2   PI_EKTEF                     FIXED DEC (5),               00000750
          2   UFGRAD_EKTEF                 FIXED DEC (3),               00000760
          2   PP_EKTEF                     FIXED DEC (1),               00000770
          2   TEKSTYPE_E_KODE_EKTEF        FIXED DEC (1),               00000780
          2   SLUTTPOENGTALL               FIXED DEC (1),               00000790
          2   SPT                          FIXED DEC (1),               00000800
          2   SPT_EKTEF                    FIXED DEC (1),               00000810
          2   OPT                          FIXED DEC (1),               00000820
          2   OPT_EKTEF                    FIXED DEC (1);               00000830
  %SKIP;                                                                00000840
 DCL  PERSON_IND,                                                       00000850
      EK_IND                               FIXED BIN(15);               00000860
 DCL  HENDELSE_KEY_INDEX                   FIXED BIN(15);               00000870
 DCL  HENDELSE_KEY,                                                     00000880
      HENDELSE_NØKKEL                      CHAR (10);                   00000890
  /* *************************************************************** */ 00000900
  /* ARBEIDSOMRÅDE FOR OPPBEVARING AV FNR. OG ROT INFORMASJON        */ 00000910
  /* SOM BRUKES I JUSTER_SB_ROT_SEGMENT.                             */ 00000920
  /* *************************************************************** */ 00000930
 DCL  1  FNR_TABELL(14),                                                00000940
         2    FNR             FIXED DEC(11),                            00000950
         2    PENSJTYP             CHAR(1),                             00000960
         2    NAVN                 CHAR(25),                            00000970
         2    TKNR            FIXED DEC(5),                             00000980
         2    SPRÅK                CHAR(1);                             00000990
  /* *************************************************************** */ 00001000
  /* PROGRAMMET BEGYNNER HER. VI FINNER FNR. I FNR_TABELL ELLER      */ 00001010
  /* FØRSTE LEDIGE PLASS I FNR_TABELL.                               */ 00001020
  /* PROC A ER FELLES FOR ALLE LAG_HENDELSER FOR VOKSNE.             */ 00001030
  /* *************************************************************** */ 00001040
 A: PROC;                                                               00001050
    DO I = 1 TO 14 ;                                                    00001060
       IF FNR_TABELL.FNR(I) = B02.MF.RFOPERSN.FNR(PERSON_IND)  THEN     00001070
          DO;                                                           00001080
             F_IND = I;                                                 00001090
             I = 14;                                                    00001100
          END;                                                          00001110
       ELSE                                                             00001120
          IF FNR_TABELL.FNR(I) = 0   THEN                               00001130
             DO;                                                        00001140
                F_IND = I;                                              00001150
                FNR_TABELL.FNR(F_IND) =                                 00001160
                            B02.MF.RFOPERSN.FNR(PERSON_IND);            00001170
                I = 14;                                                 00001180
             END;                                                       00001190
          ELSE                                                          00001200
             IF I = 14  THEN                                            00001210
                CALL FEIL_MELDING ;                                     00001220
    END;                                                                00001230
    FNR_TABELL.PENSJTYP(F_IND) =                                        00001240
                              B02.MF.STATUS.PENSJONSTYPE1(PERSON_IND);  00001250
    FNR_TABELL.NAVN(F_IND) =  B02.MF.RFOPERSN.NAVN(PERSON_IND);         00001260
    FNR_TABELL.TKNR(F_IND) =  B02.MF.RFOPERSN.TKNR(PERSON_IND);         00001270
    FNR_TABELL.SPRÅK(F_IND) = B02.MF.FROPERSN.SPRÅK(PERSON_IND);        00001280
    W_HENDELSE.HENDDATO   =    B02.MF.STATUS.VIRKDATO_ÅM(BARN_IND);     00001290
    W_HENDELSE.VERSJON    =    SBROT.SISTE_SB_VERSJON_NR;               00001300
    W_HENDELSE.TERMINAL   =    EIBLK.EIBTRMID;                          00001310
    W_HENDELSE.FNR_EKTEF  =    B02.MF.RFOPERSN.FNR(EK_IND);             00001320
    W_HENDELSE.NAVN_EKTEF  =    B02.MF.RFOPERSN.NAVN(EK_IND);           00001330
    CALL  PLASSER_TEKSTYPE_A_KODE ;                                     00001340
    END;                                                                00001350
 B: PROC;                                                               00001360
    W_HENDELSE.GP         =    B02.MF.UFØRPENS.GP(PERSON_IND);          00001370
    W_HENDELSE.TP         =    B02.MF.UFØRPENS.TP(PERSON_IND);          00001380
    W_HENDELSE.ST         =    B02.MF.UFØRPENS.ST(PERSON_IND);          00001390
    W_HENDELSE.KT         =    B02.MF.UFØRPENS.KT(PERSON_IND);          00001400
    W_HENDELSE.ET         =    B02.MF.UFØRPENS.ET(PERSON_IND);          00001410
    W_HENDELSE.BT         =    B02.MF.UFØRPENS.BT(PERSON_IND);          00001420
    W_HENDELSE.ANTALL_BARN =   B02.MF.STATUS.ANTALL_BARN(PERSON_IND);   00001430
    W_HENDELSE.ÅFT        =    B02.MF.UFØRPENS.ÅFT(PERSON_IND);         00001440
    CALL  PLASSER_TEKSTYPE_B1_KODE;                                     00001450
    CALL  PLASSER_TEKSTYPE_B2_KODE;                                     00001460
  /* *************************************************************** */ 00001470
  /* FØLGENDE  3 FELT SKAL EVT. REDIGERES INN I TEKSTTYPE B1.        */ 00001480
  /* *************************************************************** */ 00001490
    W_HENDELSE.UFG        =    B02.MF.UFØRPENS.UFG(PERSON_IND);         00001500
    W_HENDELSE.TT         =    B02.MF.STATUS.TT_ANV(PERSON_IND);        00001510
    W_HENDELSE.TT_EK      =    B02.MF.STATUS.TT_ANV(EK_IND);            00001520
    CALL  PLASSER_TEKSTYPE_C_KODE;                                      00001530
    CALL  PLASSER_TEKSTYPE_D_KODE;                                      00001540
    END;                                                                00001550
  /* *************************************************************** */ 00001560
  /* HENDELSE SEGMENT SKRIVES UT.                                    */ 00001570
  /* *************************************************************** */ 00001580
    CALL INSERT_HEND_OG_DE_ØVRIGE_SEGMENTER;                            00001590
  /* *************************************************************** */ 00001600
  /*VI OPPBEVARER NØKKEL TIL HENDELSE SEGMENT I TILFELLE VI MÅ FJERNE*/ 00001610
  /*DEN DERSOM DET OPPSTÅR FEIL VED BEHANDLING AV SENERE HENDELSER.  */ 00001620
  /* *************************************************************** */ 00001630
    HENDELSE_NØKKEL =   HENDDATO!!VERSJON!!TERMINAL;                    00001640
    HENDELSE_KEY_INDEX = HENDELSE_KEY_INDEX + 1;                        00001650
    HENDELSE_KEY(HENDELSE_KEY_INDEX) = HENDELSE_NØKKEL;                 00001660
  /* *************************************************************** */ 00001670
  /*HENDELSE_NØKKEL ER  HENDATO:VERSJON:TERMINAL                     */ 00001680
  /* *************************************************************** */ 00001690
    IF W_HENDELSE.TP > 0                                                00001700
       & B02.MF.UFØRPENS.TP(PERSON_IND) ^=                              00001710
                               B01.MF.UFØRPENS.TP(PERSON_IND) THEN      00001720
       CALL BYGG_OPP_BEREGNINGS_VEDLEGG_SEGMENT;                        00001730
  END  LAG_UFØRPENS_HEND;                                               00001740
