 /*       SIST ENDRET 21/12-92 11.57.20 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 06/03-91 11.52.10 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 21/01-91 13.49.42 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 05/07-90 09.24.28 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 11/12-89 14.35.13 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 01/12-89 08.39.28 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 29/03-88 13.13.20 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 10/03-87 08.56.43 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 27/04-83 13.05.01 AV   OLAV                     */00000080
 /*       SIST ENDRET 20/04-83 08.31.14 AV   OLAV                     */00000090
 /*       SIST ENDRET 13/04-83 15.17.55 AV   OLAV                     */00000100
 /* ***************************************************************** */00000110
 /*IDENTIFIKASJON:                                                    */00000120
 /*    R0014121 - BEREGN_ETTERLATT_AP_DEL1 - INTERN PROC I PLI        */00000130
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982                           */00000140
 /*    ENDRET I JULI AV KARIN                                         */00000150
 /*HENSIKT:                                                           */00000160
 /*    PROGRAMMET STYRER BEREGNING AV A/E-PENSJON, OG OPPDATERER      */00000170
 /*    FORELØPIG ST, KT OG BT.                                        */00000180
 /*PROGRAMTILKNYTNING:                                                */00000190
 /*    PROGRAMMET BLIR INKLUDERT I R0014101 - (BEREGN_ETTERLATT_AP)   */00000200
 /*BRUK:                                                              */00000210
 /*    CALL BEREGN_ETTERLATT_AP_DEL1;                                 */00000220
 /* ***************************************************************** */00000230
 BEREGN_ETTERLATT_AP_DEL1:                                              00000240
  PROC;                                                                 00000250
                                                                        00000260
                                                                        00000270
                                                                        00000280
  DCL                                                                   00000290
     W_SUM_TP           FIXED DEC(5),                                   00000300
     W_ÅFT_MAX          FIXED DEC(5) INIT (0),                          00000310
     W_KOMPFAKTOR       FIXED DEC(3,1) INIT (1),                        00000320
     W_FORH_INDIKATOR   CHAR(1) INIT ('J');                             00000330
                                                                        00000340
 DCL                                                                    00000350
     W_BT                    FIXED DEC (5) INIT (0);                    00000360
                                                                        00000370
 /* FJERNET 8.12.89 HL - RUBBISH :  *************************           00000380
                                                                        00000390
 DCL                                                                    00000400
   1 W_FNR                   PIC'(11)9'                                 00000410
 DCL                                                                    00000420
   1 FNR_R DEF W_FNR,                                                   00000430
     2 ÅR                      PIC '99',                                00000440
     2 MND                     PIC '99',                                00000450
     2 DAG                     PIC '99',                                00000460
     2 ÅRHUNDRE                PIC '9',                                 00000470
     2 FILLER                  PIC '(4)9'                               00000480
                                                                        00000490
                                                                        00000500
 DCL                                                                    00000510
     W_FNR_EK    PIC '(11)9'                                            00000520
 DCL                                                                    00000530
     1 FNR_EK_R       DEF W_FNR_EK,                                     00000540
       2 DAG_EK       PIC'99',                                          00000550
       2 MND_EK       PIC'99',                                          00000560
       2 ÅR_EK        PIC'99',                                          00000570
       2 ÅRHUNDRE_EK  PIC'9',                                           00000580
       2 FILLER_EK    PIC'(4)9'                                         00000590
                                                                        00000600
  W_FNR_EK       = B02.FNR(BER_EK_IND)                                  00000610
                                                                        00000620
  W_FNR          = TRANS_OPPL_OMR.FØDSNUMMER                            00000630
                                                                        00000640
  HIT 8.12.89 HL ********************************** */                  00000650
                                                                        00000660
  CALL BEREGN_TP_ETTERLATT_AP;                                          00000670
                                                                        00000680
  /*YS VI HAR NÅ FÅTT OPPDATERT TP_EGEN, TP_PT_EGEN_55 OG TP_EK_PT*/    00000690
                                                                        00000700
                                                                        00000710
  IF FEIL_MELD_NR > 0  THEN                                             00000720
     GO TO RETUR;                                                       00000730
  ELSE                                                                  00000740
     PROGRAM_ID = 'R0014101';                                           00000750
                                                                        00000760
     /*-------------------------------------------------------------*/  00000770
     /*PENSON UTLAND . TRUDE MAI 1990                               */  00000780
     /*-------------------------------------------------------------*/  00000790
                                                                        00000800
          /* TAR BORT TESTEN PÅ P.RETT.ERSTATTER MED FØLGENDE , TRUDE*/ 00000810
  IF B02.BOSATT(BER_SØ_IND)    >  0  &                                  00000820
    (B02.TT_16_66(BER_SØ_IND)  = 0   &            /*NY0191*/            00000830
     B02.TT_16_66(BER_EK_IND)  = 0 )  THEN        /*NY0191*/            00000840
     CALL BEREGN_GP_ETTERLATT_AP_UTLAND;     /* R0014182 */             00000850
  ELSE                                                                  00000860
     CALL BEREGN_GP_ETTERLATT_AP;                                       00000870
    /* R0014132 */                                                      00000880
                                                                        00000890
  IF B02.YRKEPENS.YUG(BER_SØ_IND) > 0 THEN                              00000900
     CALL BEREGN_ETTERLATT_AP_YP;              /*4129*/                 00000910
  ELSE                                                                  00000920
     DO;                                                                00000930
 /*YS*/  IF TP_EGEN > (TP_PT_EGEN_55 + TP_EK_PT) THEN                   00000940
 /*YS*/     DO;                                                         00000950
 /*YS*/                                                                 00000960
 /*YS*/        B02.POENGTILLEGG_DATO_ÅM(BER_SØ_IND) = 0;                00000970
 /*YS*/        B02.POENGTILLEGG_KODE   (BER_SØ_IND) = ' ';              00000980
 /*YS*/        B02.POENGTILLEGG_DATO_ÅM(BER_EK_IND) = 0;                00000990
 /*YS*/        B02.POENGTILLEGG_KODE   (BER_EK_IND) = ' ';              00001000
                                                                        00001010
 /*YS*/        POREKKE(BER_SØ_IND)     = POREKKE(14);                   00001020
         /* PLASS 14 BRUKES SOM OPPBEVARINGSOMR. DA DENNE PLASSEN     */00001030
         /* ALLTID ER LEDIG I ALDERSPENSJON.                          */00001040
 /*YS*/        POREKKE_P67(BER_SØ_IND) = W_POREKKE;                     00001050
                                                                        00001060
 /*YS*/        B02.ALDERSP.TP(BER_SØ_IND)   = TP_EGEN;                  00001070
 /*YS*/        B02.ALDERSP.SPT(BER_SØ_IND)  = POREKKE.SPT(BER_SØ_IND);  00001080
 /*YS*/        B02.ALDERSP.OPT(BER_SØ_IND)  = POREKKE.OPT(BER_SØ_IND);  00001090
 /*YS*/        B02.ALDERSP.PÅ(BER_SØ_IND)   = POREKKE.PÅ (BER_SØ_IND);  00001100
 /*93*/        B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND)                       00001110
 /*93*/                               = POREKKE.PÅ_ETTER91(BER_SØ_IND); 00001120
 /*YS*/                                                                 00001130
 /*YS*/        B02.VT_SPT(BER_SØ_IND)   = POREKKE_P67.SPT(BER_SØ_IND);  00001140
 /*YS*/        B02.VT_OPT(BER_SØ_IND)   = POREKKE_P67.OPT(BER_SØ_IND);  00001150
 /*YS*/        B02.VT_PÅ (BER_SØ_IND)   = POREKKE_P67.PÅ (BER_SØ_IND);  00001160
 /*YS*/                                                                 00001170
 /*YS*/        B02.ETTEPENS.TP_BRUTTO(BER_SØ_IND) = 0;                  00001180
 /*YS*/        B02.ETTEPENS.TP_NETTO(BER_SØ_IND)  = 0;                  00001190
 /*YS*/     END;                                                        00001200
 /*YS*/  ELSE                                                           00001210
 /*YS*/     DO;                                                         00001220
 /*YS*/        B02.ALDERSP.TP(BER_SØ_IND)   = TP_PT_EGEN_55;            00001230
 /*YS*/        B02.ALDERSP.SPT(BER_SØ_IND)  = POREKKE.SPT(BER_SØ_IND);  00001240
 /*YS*/        B02.ALDERSP.OPT(BER_SØ_IND)  = POREKKE.OPT(BER_SØ_IND);  00001250
 /*YS*/        B02.ALDERSP.PÅ(BER_SØ_IND)   = POREKKE.PÅ (BER_SØ_IND);  00001260
 /*93*/        B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND)                       00001270
 /*93*/                               = POREKKE.PÅ_ETTER91(BER_SØ_IND); 00001280
 /*YS*/                                                                 00001290
 /*YS*/        B02.VT_SPT(BER_SØ_IND)   = POREKKE_P67.SPT(BER_SØ_IND);  00001300
 /*YS*/        B02.VT_OPT(BER_SØ_IND)   = POREKKE_P67.OPT(BER_SØ_IND);  00001310
 /*YS*/        B02.VT_PÅ (BER_SØ_IND)   = POREKKE_P67.PÅ (BER_SØ_IND);  00001320
 /*YS*/                                                                 00001330
 /*YS*/        B02.ETTEPENS.TP_BRUTTO(BER_SØ_IND) = TP_EK_PT;           00001340
 /*YS*/        B02.ETTEPENS.TP_NETTO(BER_SØ_IND)  = TP_EK_PT;           00001350
 /*YS*/                                                                 00001360
 /*YS*/     END;                                                        00001370
      END;                                                              00001380
                                                                        00001390
  W_SUM_TP = B02.ALDERSP.TP(BER_SØ_IND)+B02.TP_BRUTTO(BER_SØ_IND);      00001400
                                                                        00001410
                 /* --------------------------------------------------*/00001420
                 /* PENSJON UTLAND. TRUDE .---------------------------*/00001430
                 /* --------------------------------------------------*/00001440
  IF B02.BOSATT(BER_SØ_IND)               >  0  &                       00001450
    (B02.TT_16_66(BER_SØ_IND)  = 0    &                    /*NY0191*/   00001460
     B02.TT_16_66(BER_EK_IND)  = 0 )  THEN                 /*NY0191*/   00001470
     CALL SÆRTILLEGG_UTLAND(W_SUM_TP);                     /*R0014180*/ 00001480
  /* B02.ALDERSP.ST(BER_SØ_IND) = F_SÆRTILLEGG_UTLAND_EP(               00001490
                                           W_SUM_TP);  */   /*4183*/    00001500
  ELSE                                                                  00001510
     B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(                  00001520
                                         W_SUM_TP,0,'JA',               00001530
                                         ST_PROSENT_ENSLIG,             00001540
                                         100,                           00001550
                                         B02.TT_ANV(BER_SØ_IND));       00001560
                                                                        00001570
    /* W_KOMPFAKTOR ER LIK 1 DVS FULLT KOMPENSASJONSTILLEGG */          00001580
                                                                        00001590
  W_KOMPFAKTOR = 1.0;                                                   00001600
   /*    ENDRET   17.03.88    SATISH                                 */ 00001610
   /*    B02.ALDERSP.KT(BER_SØ_IND) = F_BEREGN_KOMPENSASJONSTILLEGG   */00001620
   /*                                (B02.PENSJONSTYPE2(BER_SØ_IND),  */00001630
   /*                                 B02.TT_ANV(BER_SØ_IND),         */00001640
   /*                                 0,                              */00001650
   /*                                 W_KOMPFAKTOR,                   */00001660
   /*                                 W_FORH_INDIKATOR);              */00001670
   /*                                                                 */00001680
   /*     HITTIL                                                      */00001690
         B02.ALDERSP.KT(BER_SØ_IND) = F_BEREGN_KOMPENSASJONSTILLEGG     00001700
                                     (B02.PENSJONSTYPE1(BER_SØ_IND),    00001710
                                      B02.PENSJONSTYPE2(BER_SØ_IND),    00001720
                                      B02.TT_ANV(BER_SØ_IND),           00001730
                                      0,                                00001740
                                      W_KOMPFAKTOR,                     00001750
                                      W_FORH_INDIKATOR);                00001760
                                                                        00001770
  /*  JEG HAR LAGT INN TEST HER PÅ OM SØKEREN ER BOSATT I     */        00001780
  /*  UTLANDET.  HVIS JA, SÅ SKAL KT VÆRE LIK 0. ERIK 8.12.86 */        00001790
                                                                        00001800
  IF B02.SPESOPPL.BOSATT(BER_SØ_IND) > 0 THEN                           00001810
     B02.ALDERSP.KT(BER_SØ_IND) = 0 ;                                   00001820
                                                                        00001830
                                                                        00001840
 /* B02.ALDERSP.BT(BER_SØ_IND) = 0.25 * G * B02.ANTALL_BARN             00001850
                                (BER_SØ_IND) / 12 + 0.5;  */            00001860
                                                                        00001870
    CALL BEREGN_BT(W_BT,100);                           /*NY0191*/      00001880
    B02.ALDERSP.BT(BER_SØ_IND) = W_BT;                  /*NY0191*/      00001890
                                                        /*NY0191*/      00001900
                                                                        00001910
                                                                        00001920
 RETUR:                                                                 00001930
                                                                        00001940
 END BEREGN_ETTERLATT_AP_DEL1;                                          00001950
