 /*       SIST ENDRET 24/01-96 13.17.00 AV   JDA0310                  */00000000
 /*       SIST ENDRET 17/08-95 13.10.38 AV   TSB0310                  */00000010
 /*       SIST ENDRET 11/07-94 13.10.43 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 14/03-88 08.19.48 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 02/03-88 09.33.34 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 08/09-87 12.07.21 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 01/09-87 08.49.24 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 11/11-86 11.47.17 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 01/09-86 13.20.27 AV   LUNDEBY                  */00000080
 /*       SIST ENDRET 21/12-84 09.44.43 AV   LUNDEBY                  */00000090
 /*       SIST ENDRET 19/09-83 12.53.37 AV   JANKR                    */00000100
 /* ***************************************************************** */00000110
 /* IDENTIFIKASJON                                                    */00000120
 /*     R0010420 - DET FØRSTE PROGRAM I ADMINISTRASJONSDELEN AV       */00000130
 /*                SYSTEMET.                                          */00000140
 /*                HOVEDPROGRAM I CICS/PLI.                           */00000150
 /*     PROGRAMMERER: JAN - H. KRISTENSEN AUGUST 1983.                */00000160
 /* HENSIKT                                                           */00000170
 /*     PROGRAMMET SKAL SENDE UT EN MAP FØRST FOR AT EN SKAL KUNNE    */00000180
 /*     VELGE STYREKODER FOR DET EN ØNSKER UTFØRT.                    */00000190
 /*     DERETTER SKAL DENNE MAPPEN RECEIVES SLIK AT DETTE PROGRAMMET  */00000200
 /*     KAN GI KONTROLL TIL DET AKTUELLE PROGRAM SOM UTFØRER DE       */00000210
 /*     FORSKJELLIGE AKSJONER.                                        */00000220
 /* PROGRAMTILKNYTNING                                                */00000230
 /*     BLIR AKTIVISERT FRA CICS MED TRANSKODE 'RA20' SOM SETTES I    */00000240
 /*     PROGRAM R0010301, I DETTE PROGRAM, SAMT I UNDERLIGGENDE       */00000250
 /*     R0010421, R0010422, R0010423, R0010424, R0010425.             */00000260
 /*                                                                   */00000270
 /* ***************************************************************** */00000280
                                                                        00000290
 R001B1: PROC(COMMAREA_PEKER)                  OPTIONS (MAIN);          00000300
                                                                        00000310
    %INCLUDE P0019906;            /* TRANS_OPPL_OMR                   */00000320
    %INCLUDE P0019908;            /* KOM_OMR        */                  00000330
    %INCLUDE P0019910;            /* STYRINGS_OMR                     */00000340
    %INCLUDE P0019912;            /* DIV_PARAM_OMR                    */00000350
    %INCLUDE P0019959;            /* OMRAADET FOR FUNKTAB             */00000360
    DCL 1 B01    BASED(B01_PEKER),                                      00000370
        %INCLUDE P0019921;        /* B01 (BASED)                      */00000380
    %INCLUDE S001A0;              /* HOVED - MAP FOR ADMINISTRASJON   */00000390
    %INCLUDE S00101;              /* HOVED - MENY                     */00000400
                                                                        00000410
    DCL                                                                 00000420
      HENT_MAP                   BIT  (1) INIT('0'B)          ,         00000430
     (ADDR , CSTG , SUBSTR)      BUILTIN                      ,         00000440
      BMSMAPBR                   POINTER                      ,         00000450
      IDENT_PEKER                POINTER                      ,         00000460
  /*  W01_IDENT                  CHAR (4)                     , */      00000470
      IDENT_BIT                  BIT (32) BASED(IDENT_PEKER)  ,         00000480
      COMMAREA_PEKER             POINTER                      ;         00000490
                                                                        00000500
   DCL 01 W01_IDENT_DEF,                                                00000510
          02 W01_IDENT_1_4                  CHAR (4),                   00000520
          02 W01_IDENT_5                    CHAR (1),                   00000530
       01 W01_IDENT DEF W01_IDENT_DEF      CHAR(05) ;                   00000540
                                                                        00000550
                                                                        00000560
                                                                        00000570
                                                                        00000580
    ALLOCATE B01;                                                       00000590
    ALLOCATE S001A0O;                                                   00000600
    KOM_OMR.B01_PEKER         =  ADDR(B01);                             00000610
    KOM_OMR.TRANS_LISTE_PEKER  =  ADDR(KOM_OMR.TRANS_LISTE_OMR);        00000620
    KOM_OMR.TRANS_OPPL_PEKER  =  ADDR(KOM_OMR.TRANS_OPPL_OMR);          00000630
    KOM_OMR.STYRINGS_PEKER    =  ADDR(KOM_OMR.STYRINGS_OMR);            00000640
    KOM_OMR.DIV_PARAM_PEKER   =  ADDR(KOM_OMR.DIV_PARAM_OMR);           00000650
    B01 = '';                                                           00000660
    KOM_OMR.TRANS_LISTE_OMR = '';                                       00000670
    S001A0O.CICS_INFOO = CICS_NAVN             ;                        00000680
                                                                        00000690
    IF PROGRAM_ID = 'R0010301' THEN          /* KOMMER IN FØRSTE GANG */00000700
       DO;                                                              00000710
      /*  EXEC CICS SEND MAP('S001A0') MAPSET('S001A03') MAPONLY ERASE; 00000720
      */                                                                00000730
          EXEC CICS SEND MAP('S001A0') MAPSET('S001A03')  ERASE;        00000740
       END;                                                             00000750
    ELSE                                                                00000760
       DO;                                                              00000770
          IF TRANS_OPPL_OMR.TRANSKODE = 'RA20' !                        00000780
             TRANS_OPPL_OMR.TRANSKODE = 'RA27' THEN                     00000790
             DO;                                                        00000800
                EXEC CICS RECEIVE MAP('S001A0')MAPSET('S001A03')        00000810
                                                  SET(BMSMAPBR);        00000820
                                                                        00000830
                IF S001A0I.STYRE_KODEL    >  0                  THEN    00000840
                   STYRINGS_OMR.STYREKODE =  S001A0I.STYRE_KODEI    ;   00000850
             END;                                                       00000860
          ELSE                                                          00000870
             HENT_MAP = '1'B;                                           00000880
                                                                        00000890
          PROGRAM_ID = 'R0010420';                                      00000900
                                                                        00000910
                                                                        00000920
          SELECT(STYRINGS_OMR.STYREKODE);                               00000930
                                                                        00000940
             WHEN('TB')                                                 00000950
                EXEC CICS XCTL PROGRAM('R0010422') COMMAREA(KOM_OMR);   00000960
                                                                        00000970
             WHEN('LB')                                                 00000980
                EXEC CICS XCTL PROGRAM('R0010423') COMMAREA(KOM_OMR);   00000990
                                                                        00001000
             WHEN('NB')                                                 00001010
                EXEC CICS XCTL PROGRAM('R0010424') COMMAREA(KOM_OMR);   00001020
                                                                        00001030
             WHEN('FB')                                                 00001040
                EXEC CICS XCTL PROGRAM('R0010425') COMMAREA(KOM_OMR);   00001050
                                                                        00001060
             WHEN('SK')                                                 00001070
               DO;                                                      00001080
               IF BRUKERID ^= 'T001'             THEN                   00001090
                  DO;                                                   00001100
                    IF DIV_PARAM_OMR.CICS_NAVN = 'HELPP001' THEN        00001110
                       W01_IDENT_5                = 'H';                00001120
                    ELSE                                                00001130
                       W01_IDENT_5                = ' ';                00001140
                                                                        00001150
                    W01_IDENT     = BRUKERID;                           00001160
                    IDENT_PEKER   = ADDR(W01_IDENT);                    00001170
                    EXEC CICS READ DATASET('FUNKTAD')                   00001180
                                     INTO (FUNKTAD)                     00001190
                                   RIDFLD (IDENT_BIT);                  00001200
                  END;                                                  00001210
                                                                        00001220
               IF BRUKERID         =  'T001'     !                      00001230
                  SUBSTR(STYRING,3,2) = 'SK'     THEN                   00001240
                                                                        00001250
                   EXEC CICS XCTL PROGRAM('R0010426') COMMAREA(KOM_OMR);00001260
                ELSE                                                    00001270
                   DO;                                                  00001280
                      IF HENT_MAP THEN                                  00001290
                         DO;                                            00001300
                            EXEC CICS LOAD PROGRAM ('S001A03');         00001310
                            ALLOCATE S001A0O;                           00001320
                            S001A0O.STYRE_KODEO= STYRINGS_OMR.STYREKODE;00001330
                            S001A0O.CICS_INFOO = CICS_NAVN             ;00001340
                         END;                                           00001350
                                                                        00001360
                      S001A0O.MELDINGO = 'UGYLDIG BRUKER-IDENT'       ; 00001370
                                                                        00001380
                     IF HENT_MAP THEN                                   00001390
                        EXEC CICS SEND MAP('S001A0') MAPSET ('S001A03') 00001400
                                                     ERASE;             00001410
                      ELSE                                              00001420
                        EXEC CICS SEND MAP('S001A0') MAPSET ('S001A03') 00001430
                                                     DATAONLY         ; 00001440
                   END;                                                 00001450
               END;                                                     00001460
             WHEN('SL')                                                 00001470
                EXEC CICS XCTL PROGRAM('R0010427') COMMAREA(KOM_OMR);   00001480
                                                                        00001490
             WHEN('IN')                                                 00001500
            EXEC CICS XCTL PROGRAM('R0010430') COMMAREA(KOM_OMR);       00001510
                                                                        00001520
  /* ENDRET 13.02.86   AL                                            */ 00001530
                                                                        00001540
             WHEN('XX')                                                 00001550
                DO;                                                     00001560
                                                                        00001570
                   TRANS_OPPL_OMR.TRANSKODE = 'R041' ;                  00001580
                   EXEC CICS XCTL PROGRAM('R0010401')                   00001590
                                              COMMAREA(KOM_OMR);        00001600
                END;                                                    00001610
                                                                        00001620
  /* HIT    13.02.86   AL                                            */ 00001630
                                                                        00001640
             OTHERWISE                                                  00001650
                DO;                                                     00001660
                   IF HENT_MAP THEN                                     00001670
                      DO;                                               00001680
                         EXEC CICS LOAD PROGRAM ('S001A03');            00001690
                         ALLOCATE S001A0O;                              00001700
                         S001A0O.STYRE_KODEO = STYRINGS_OMR.STYREKODE;  00001710
                         S001A0O.CICS_INFOO = CICS_NAVN             ;   00001720
                      END;                                              00001730
                                                                        00001740
                   S001A0O.MELDINGO = 'UGYLDIG KODE';                   00001750
                                                                        00001760
                   IF HENT_MAP THEN                                     00001770
                      EXEC CICS SEND MAP ('S001A0') MAPSET  ('S001A03') 00001780
                                                    ERASE             ; 00001790
                   ELSE                                                 00001800
                      EXEC CICS SEND MAP ('S001A0') MAPSET  ('S001A03') 00001810
                                                    DATAONLY          ; 00001820
                END;                                                    00001830
                                                                        00001840
                                                                        00001850
          END;      /* SELECT  */                                       00001860
                                                                        00001870
                                                                        00001880
                                                                        00001890
       END;                                                             00001900
                                                                        00001910
                                                                        00001920
    TRANS_OPPL_OMR.TRANSKODE = 'RA20';      /* DETTE PROGRAM  */        00001930
    PROGRAM_ID = 'R0010420';                                            00001940
    EXEC CICS RETURN TRANSID(TRANS_OPPL_OMR.TRANSKODE)                  00001950
                             COMMAREA(KOM_OMR) ;                        00001960
                                                                        00001970
                                                                        00001980
 END R001B1;                                                            00001990
