 /*       SIST ENDRET 29/08-97 12.28.53 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/08-97 08.53.16 AV   SPA7339                  */00000010
 /*       SIST ENDRET 28/07-97 12.34.33 AV   HLA7339                  */00000020
 /*       SIST ENDRET 04/04-97 08.40.43 AV   JDA7339                  */00000030
 /*       SIST ENDRET 19/07-96 11.01.13 AV   HLB0310                  */00000040
 /*       SIST ENDRET 18/07-94 10.00.15 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 23/03-93 12.17.57 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 25/01-93 08.11.20 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 08/09-92 15.16.13 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 24/08-92 12.27.30 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 24/07-92 13.05.29 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 17/06-92 10.45.58 AV   TRUDE                    */00000110
 /*       SIST ENDRET 17/02-92 13.46.08 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 26/03-91 16.32.55 AV   HERMAN                   */00000130
 /*       SIST ENDRET 28/01-91 11.31.55 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 11/12-90 13.23.16 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 30/01-90 15.14.44 AV   HERMAN                   */00000160
 /*       SIST ENDRET 10/01-90 14.40.01 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 20/12-89 08.09.28 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 01/12-89 08.40.51 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 31/03-87 08.55.03 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 16/12-86 08.14.42 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 29/01-86 10.55.45 AV   HERMAN                   */00000220
 /*       SIST ENDRET 12/07-85 10.24.43 AV   HERMAN                   */00000230
 /*       SIST ENDRET 18/06-85 16.48.04 AV   HERMAN                   */00000240
 /*       SIST ENDRET 08/02-85 13.03.33 AV   OLAV                     */00000250
 /*       SIST ENDRET 06/02-85 12.44.46 AV   OLAV                     */00000260
 /*       SIST ENDRET 06/08-84 14.03.35 AV   OLAV                     */00000270
 /*       SIST ENDRET 09/05-84 07.59.19 AV   OLAV                     */00000280
 /*       SIST ENDRET 21/02-84 10.25.35 AV   HERMAN                   */00000290
 /*       SIST ENDRET 08/02-84 12.54.32 AV   OLAV                     */00000300
 /*       SIST ENDRET 18/01-84 11.18.17 AV   OLAV                     */00000310
 /*       SIST ENDRET 09/05-83 09.24.24 AV   OLAV                     */00000320
 /*       SIST ENDRET 06/05-83 10.06.35 AV   OLAV                     */00000330
 /*       SIST ENDRET 05/05-83 13.50.30 AV   OLAV                     */00000340
 /*       SIST ENDRET 03/05-83 13.40.04 AV   OLAV                     */00000350
 /* ***************************************************************** */00000360
 /*IDENTIFIKASJON:                                                    */00000370
 /*    R0014522 - SUBRUTINE I PLI                                     */00000380
 /*    PROGRAMMERER: PER F. BERGESTAD, JUNI 1982                      */00000390
 /*HENSIKT:                                                           */00000400
 /*    RUTINEN BEREGNER TP_ETTERLATT_UP                               */00000410
 /*TILKNYTTING:                                                       */00000420
 /*    PROGRAMMET INCLUDES I 4501                                     */00000430
 /*ENDRING:                                                           */00000440
 /*    UNGE UFØRE FØR 1967 GARANTI SPT=1.6                            */00000450
 /*                                           16.10.89 TRUDE          */00000460
 /*ENDRING:                                                           */00000470
 /*    UNGE UFØRE FØR 1967 GARANTIEN ØKER TIL 2 FRA 01.91             */00000480
 /*                                           23.10.90 TRUDE          */00000490
 /* ***************************************************************** */00000500
  BEREGN_TP_ETTERLATT_UP:                                               00000510
    PROC ;                                                              00000520
 %PAGE;                                                                 00000530
    DCL      W_TP_ALT  FIXED DEC (7)   INIT (0);                        00000540
    DCL      W_TP      FIXED DEC (7)   INIT (0);                        00000550
    DCL      NEI              BIT (1)            INIT('0'B); /*UF*/     00000560
    DCL      SISTE_UFT        FIXED BIN(15);                            00000570
    DCL      TP_WORK           FIXED DEC (13,4);                        00000580
    DCL      FAKTOR1           FIXED DEC (13,5);  /*FRA 13,4 TS*/       00000590
    DCL      FAKTOR2           FIXED DEC (13,5);  /*FRA 13,4 TS*/       00000600
    DCL      YRKE_POENG       FIXED DEC (3,2)    INIT (0);              00000610
    DCL      PÅ_ETTER91_MERKE  CHAR (1) INIT (' ');                     00000620
    DCL      W_ÅR_E91         FIXED DEC (3) INIT (0);                   00000630
    DCL      ÅR_FYLLER_67     FIXED DEC (3) INIT (0);                   00000640
    DCL      PÅ_ETTER91_EK    CHAR (1) INIT ('N');                      00000650
    DCL      ALDER            PIC 'S99999';                             00000660
    DCL      SISTE_UFØRHIST_EK   FIXED DEC (5)  INIT (0);               00000670
                                                                        00000680
 /*FINN SISTE UFØRETIDSPUNKT*/                                          00000690
   /*0697 HL:*/                                                         00000700
    DO J = 7 TO 1 BY -1 UNTIL(B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,J) > 0);   00000710
       SISTE_UFT = J;                                                   00000720
    END;                                                                00000730
   /*0697 HL:*/                                                         00000740
    DO K = 7 TO 1 BY - 1 UNTIL(B02.UFØRHIST.UFT_ÅM(BER_EK_IND,K) > 0);  00000750
       SISTE_UFØRHIST_EK  = K;                                          00000760
    END;                                                          /*93*/00000770
                                                                  /*93*/00000780
 /* *****                                                               00000790
  ALDER = F_ALDER                                                       00000800
      (FØDSNUMMER_EK,F_SNU_DATO(B02.VIRK_DATO_ÅM(BER_EK_IND)));         00000810
  ******* */                                                            00000820
                                                                        00000830
  IF  FNR_EK_R.ÅR_EK > 22 & FNR_EK_R.ÅRHUNDRE_EK < 5 THEN               00000840
     DO;                                                                00000850
        ÅR_FYLLER_67    = FNR_EK_R.ÅR_EK + 67;                          00000860
     END;                                                               00000870
                                                                        00000880
    B01_B02_IND     = 2;                                                00000890
    POTALL_OPPL.IND = BER_SØ_IND;                                       00000900
    EXEC CICS LINK PROGRAM ('R0014141') COMMAREA(KOM_OMR);              00000910
                                                                        00000920
    IF FEIL_MELD_NR > 0  THEN                                           00000930
       GO TO RETUR;                                                     00000940
    ELSE                                                                00000950
       PROGRAM_ID = 'R0014501';                                         00000960
                                                                        00000970
   /* FRA HIT TRUDE 220792 . 'UNGE UFØRE' UFT < 6701*/                  00000980
    IF B02.BUP_GAR_KODE(BER_SØ_IND,1) = 'B'   THEN                      00000990
       DO;                                                              00001000
          B02.UFØRPENS.PÅ(BER_SØ_IND) = 40;                             00001010
          IF (B02.UFØRPENS.SPT(BER_SØ_IND) <                            00001020
                          B02.BUP_GARANTI(BER_SØ_IND,1)) THEN           00001030
          B02.UFØRPENS.SPT(BER_SØ_IND) = B02.BUP_GARANTI(BER_SØ_IND,1); 00001040
          POREKKE.SPT(BER_SØ_IND)  = B02.UFØRPENS.SPT(BER_SØ_IND);      00001050
          POREKKE.OPT(BER_SØ_IND)  = B02.UFØRPENS.OPT(BER_SØ_IND);      00001060
          POREKKE.PÅ (BER_SØ_IND)  = B02.UFØRPENS.PÅ(BER_SØ_IND);       00001070
       END;                                                             00001080
         /* TIL HIT TRUDE 220792  */                                    00001090
                                                                        00001100
    IF B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,SISTE_UFT) < 9200 THEN            00001110
       POREKKE.PÅ_ETTER91(BER_SØ_IND) = 0;                              00001120
                                                                        00001130
 /*YS  4424 SKAL BARE CALLES VED NY SKADE */                            00001140
 /*YS  TRANSTYPE9 = ENDRINGSBLANKETT      */                            00001150
                                                                        00001160
                                                                        00001170
                                                                        00001180
        IF (B02.YRKEPENS.YUG(BER_SØ_IND) >                              00001190
            B01.YRKEPENS.YUG(BER_SØ_IND)   )  &                         00001200
           TRANS_OPPL_OMR.TRANSTYPE ^= 9        THEN                    00001210
           DO;                                                          00001220
              CALL BEREGN_POENG_AV_AÅI;        /*4424*/                 00001230
              CALL BEREGN_TP_YP;               /*4425*/                 00001240
           END;                                                         00001250
        ELSE                                                            00001260
        IF B02.PENSJONSTYPE1(BER_SØ_IND) = 'Y'    THEN                  00001270
              CALL BEREGN_TP_YP;               /*4425*/                 00001280
        TP_YP = B02.YRKEPENS.TP(BER_SØ_IND);                            00001290
                                                                        00001300
    TP_UP     =  F_TP92(FNR_R.ÅR,G,                                     00001310
                                   POREKKE.SPT(BER_SØ_IND),             00001320
                                   POREKKE.OPT(BER_SØ_IND),             00001330
                                   POREKKE.PÅ (BER_SØ_IND),             00001340
                           POREKKE.PÅ_ETTER91 (BER_SØ_IND),             00001350
                                   UFGRAD,                              00001360
                                   100,'J');                            00001370
                                                                        00001380
 /*TILLEGG 1.2.89 HL :  */                                              00001390
                                                                        00001400
          TP_UP_55       = F_TP92(FNR_R.ÅR,G,                           00001410
                                    POREKKE.SPT(BER_SØ_IND),            00001420
                                    POREKKE.OPT(BER_SØ_IND),            00001430
                                    POREKKE.PÅ(BER_SØ_IND),             00001440
                            POREKKE.PÅ_ETTER91(BER_SØ_IND),             00001450
                                    UFGRAD,                             00001460
                                    55,'J');                            00001470
                                                                        00001480
 /*HIT 1.2.89 HL */                                                     00001490
  /* FLYTTER DENNE TIL SLUTT AV PGM PGA UF-GARANTIEN        */          00001500
  /* BLIR BEREGNET TIL SLUTT I  PGM . TRUDE 19.12.89        */          00001510
 /*YS   TP_EGEN    = B02.YRKEPENS.TP(BER_SØ_IND) + TP_UP;   */          00001520
 /*                                       TIL HIT TRUDE     */          00001530
                                                                        00001540
 /*ENDRET TILBAKE 26.3.87 HL - POREKKE MÅ SAVES - FRAPP 487 */          00001550
                                                                        00001560
    POREKKE(14) = POREKKE(BER_SØ_IND);                                  00001570
                                                                        00001580
    IF (B02.SIVILSTAND(BER_SØ_IND) = 'S'   &                            00001590
        B02.TP_PROSENT(BER_SØ_IND) =  0      )         THEN             00001600
                                                                        00001610
       DO;                                                              00001620
          B02.POENGTILLEGG_DATO_ÅM(BER_SØ_IND) = 0;                     00001630
          B02.POENGTILLEGG_KODE   (BER_SØ_IND) = ' ';                   00001640
                                                                        00001650
          TP_EGEN = TP_UP;                                              00001660
          TP_EGEN_55 = TP_UP_55;                                        00001670
        /*HL 0794  :  */                                                00001680
   B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND) = POREKKE.PÅ_ETTER91(BER_SØ_IND);00001690
                                                                        00001700
          GO TO RETUR;                                                  00001710
       END;                                                             00001720
                                                                        00001730
    IF B02.SIVILSTAND(BER_SØ_IND) ^= 'S'         THEN                   00001740
       B02.TP_PROSENT(BER_SØ_IND) =  55;                                00001750
                                                                        00001760
    B01_B02_IND     = 2;                                                00001770
    POTALL_OPPL.IND = BER_EK_IND;                                       00001780
    EXEC CICS LINK PROGRAM ('R0014141') COMMAREA(KOM_OMR);              00001790
                                                                        00001800
    IF FEIL_MELD_NR > 0  THEN                                           00001810
       GO TO RETUR;                                                     00001820
    ELSE                                                                00001830
       PROGRAM_ID = 'R0014501';                                         00001840
                                                                        00001850
 /*HVIS PÅ_ETTER91 ER SATT TIL '0' I 4141, SÅ SKAL DEN VÆRE 0*/         00001860
 /*HL 22.1.93 :*/                                                       00001870
                                                                        00001880
    IF POREKKE.PÅ_ETTER91(BER_EK_IND) = 0   THEN                        00001890
       PÅ_ETTER91_MERKE = 'J';                                          00001900
                                                                        00001910
                                                                        00001920
 /* 42 % TP FOR ÅR ETTER 1991 : */                                      00001930
                                                                        00001940
    IF ^(W_DØDSDATO_Å > 91       &                                      00001950
         FNR_EK_R.ÅR_EK > 25       &                                    00001960
         FNR_EK_R.ÅRHUNDRE_EK < 5 )   THEN                              00001970
            POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;                         00001980
                                                                        00001990
                                                                        00002000
          IF POREKKE.SPT(BER_SØ_IND) > 0 &                              00002010
             POREKKE.SPT(BER_EK_IND) > 0      THEN                      00002020
                                                                        00002030
 /*4143*/    CALL POENG_TILLEGG;                                        00002040
                                                                        00002050
                                                                        00002060
          IF POREKKE.TYPE(BER_SØ_IND) = 'O'     THEN                    00002070
 /*4153*/    CALL BEREGN_SPT_OPT_PÅ    (BER_SØ_IND,POREKKE(BER_SØ_IND), 00002080
                                                     W_FNR);            00002090
          ELSE                                                          00002100
 /*4156*/    CALL BEREGN_SPT_OPT_PÅ_ALT(BER_SØ_IND,POREKKE(BER_SØ_IND), 00002110
                                                     W_FNR);            00002120
                                                                        00002130
    IF B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,SISTE_UFT) < 9200 THEN            00002140
       POREKKE.PÅ_ETTER91(BER_SØ_IND) = 0;                              00002150
  /*TILLEGG 190796 HL : */                                              00002160
                                                                        00002170
        IF (B02.UFØRHIST.UFT_ÅM(BER_EK_IND,SISTE_UFØRHIST_EK) < 9200 &  00002180
           B02.UFØRHIST.UFT_ÅM(BER_EK_IND,SISTE_UFØRHIST_EK) > 7200 ) & 00002190
           ( B02.OPPHØRSKODE(BER_EK_IND,SISTE_UFØRHIST_EK) ^= 'J'  &    00002200
           B02.PENSJONSTYPE1(BER_EK_IND)                 = 'D')  THEN   00002210
                                                                        00002220
                                                                        00002230
                                                                        00002240
           DO;                                                          00002250
             IF (ÅR_FYLLER_67  > 91   &                                 00002260
                 POREKKE.POENG(BER_EK_IND,ÅR_FYLLER_67) > 0)  THEN      00002270
                 W_ÅR_E91 = 1;                                          00002280
                                                                        00002290
             IF  (ÅR_FYLLER_67 + 1)  > 91   &                           00002300
                 POREKKE.POENG(BER_EK_IND,(ÅR_FYLLER_67 + 1)) > 0  THEN 00002310
                 W_ÅR_E91 = W_ÅR_E91 + 1;                               00002320
                                                                        00002330
             IF  (ÅR_FYLLER_67 + 2)  > 91   &                           00002340
                 POREKKE.POENG(BER_EK_IND,(ÅR_FYLLER_67 + 2)) > 0  THEN 00002350
                 W_ÅR_E91 = W_ÅR_E91 + 1;                               00002360
                                                                        00002370
             IF  W_ÅR_E91 > 0     THEN                                  00002380
                 DO;                                                    00002390
                    PÅ_ETTER91_EK = 'J';                                00002400
                    POREKKE.PÅ_ETTER91(BER_EK_IND) = W_ÅR_E91;          00002410
                 END;                                                   00002420
             ELSE                                                       00002430
               DO;                                                      00002440
                 POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;                    00002450
                 PÅ_ETTER91_EK = 'N';                                   00002460
               END;                                                     00002470
           END;                                                         00002480
                                                                        00002490
                                                                        00002500
   /* FRA HIT TRUDE 220792 . 'UNGE UFØRE' UFT < 6701*/                  00002510
    IF B02.BUP_GAR_KODE(BER_SØ_IND,1) = 'B'   THEN                      00002520
       DO;                                                              00002530
          B02.UFØRPENS.PÅ(BER_SØ_IND) = 40;                             00002540
          IF (B02.UFØRPENS.SPT(BER_SØ_IND) <                            00002550
                          B02.BUP_GARANTI(BER_SØ_IND,1)) THEN           00002560
          B02.UFØRPENS.SPT(BER_SØ_IND) = B02.BUP_GARANTI(BER_SØ_IND,1); 00002570
          POREKKE.SPT(BER_SØ_IND)  = B02.UFØRPENS.SPT(BER_SØ_IND);      00002580
          POREKKE.OPT(BER_SØ_IND)  = B02.UFØRPENS.OPT(BER_SØ_IND);      00002590
          POREKKE.PÅ (BER_SØ_IND)  = B02.UFØRPENS.PÅ(BER_SØ_IND);       00002600
       END;                                                             00002610
         /* TIL HIT TRUDE 220792  */                                    00002620
                                                                        00002630
                                                                        00002640
    TP_UP_55       = F_TP92(FNR_R.ÅR,G,                                 00002650
                              POREKKE.SPT(BER_SØ_IND),                  00002660
                              POREKKE.OPT(BER_SØ_IND),                  00002670
                              POREKKE.PÅ(BER_SØ_IND),                   00002680
                            POREKKE.PÅ_ETTER91(BER_SØ_IND),             00002690
                              UFGRAD,                                   00002700
                              55,'J');                                  00002710
                                                                        00002720
     IF B02.YRKEPENS.YUG(BER_SØ_IND) > 0       THEN                     00002730
        DO;                                                             00002740
           IF POREKKE.SPT(BER_SØ_IND) >                                 00002750
                     B02.YRKEPENS.YPT(BER_SØ_IND)     THEN              00002760
              YRKE_POENG = POREKKE.SPT(BER_SØ_IND);                     00002770
           ELSE                                                         00002780
              YRKE_POENG = B02.YRKEPENS.YPT(BER_SØ_IND);                00002790
                                                                        00002800
           TP_WORK  = G * YRKE_POENG * 0.55;                            00002810
           TP_WORK  = TP_WORK * B02.YRKEPENS.YUG(BER_SØ_IND) /100;      00002820
           TP_WORK  = TP_WORK / 12;                                     00002830
           IF B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) = 0       THEN        00002840
              TP_WORK  = TP_WORK * 0.45;                                00002850
           ELSE                                                         00002860
              DO;                                                       00002870
                 FAKTOR1 = (B02.YRKEPENS.PÅ(BER_SØ_IND)                 00002880
                            - B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) )     00002890
                            / B02.YRKEPENS.PÅ(BER_SØ_IND) * 0.45;       00002900
                 FAKTOR2 = B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND)          00002910
                            / B02.YRKEPENS.PÅ(BER_SØ_IND) * 0.42;       00002920
                 TP_WORK = TP_WORK * (FAKTOR1 + FAKTOR2 + 0.00005);     00002930
              END;                                                      00002940
                                                                        00002950
           TP_YP_55 = TP_WORK + 0.5;                                    00002960
        END;                                                            00002970
                                                                        00002980
        TP_EGEN_55 = TP_UP_55 + TP_YP_55;                               00002990
                                                                        00003000
                                                                        00003010
                                                                        00003020
 /* ENDRET 11.12.86 HL - HVIS ALTERNATIV POREKKE, SOM EVT. ER     */    00003030
 /*   FRAPP 270          LAGT UT På PLASS 'IND + 11', IKKE HAR 'O'*/    00003040
 /*                    I TYPE, Så SKAL ALTERNATIV BEREGNING PRøVES*/    00003050
                                                                        00003060
          IF POREKKE.TYPE(BER_EK_IND) = 'O' &                           00003070
             POREKKE.TYPE(BER_EK_IND + 11) ^= 'D'   THEN                00003080
                                       /* O = ORDINÆR */                00003090
                                       /* D = UFØR FØR 73 */            00003100
             DO;                                                        00003110
 /*4153*/       CALL BEREGN_SPT_OPT_PÅ (BER_EK_IND,POREKKE(BER_EK_IND), 00003120
                                                      FØDSNUMMER_EK);   00003130
                                                                        00003140
 /* 42 % TP FOR ÅR ETTER 1991 : */                                      00003150
                                                                        00003160
    IF ^(W_DØDSDATO_Å > 91       &                                      00003170
         FNR_EK_R.ÅR_EK > 22       &                                    00003180
         FNR_EK_R.ÅRHUNDRE_EK < 5 )   THEN                              00003190
            POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;                         00003200
                                                                        00003210
    IF PÅ_ETTER91_MERKE = 'J'    THEN                                   00003220
       POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;                              00003230
                                                                        00003240
                TP_AVD   = F_TP92(FNR_EK_R.ÅR_EK,G,                     00003250
                                       POREKKE.SPT(BER_EK_IND),         00003260
                                       POREKKE.OPT(BER_EK_IND),         00003270
                                       POREKKE.PÅ (BER_EK_IND),         00003280
                                   POREKKE.PÅ_ETTER91 (BER_EK_IND),     00003290
                                       100,                             00003300
                                    B02.TP_PROSENT(BER_SØ_IND),'J');    00003310
             END;                                                       00003320
                                                                        00003330
          ELSE     /* TYPE ER DA U =  AP SOM VAR UP FØR 1973 */         00003340
                   /* ELLER      D = DØD SOM VAR UP FØR 1973 */         00003350
                                                                        00003360
             DO;                                                        00003370
 /*4156*/       CALL BEREGN_SPT_OPT_PÅ_ALT(                             00003380
                                BER_EK_IND,POREKKE(BER_EK_IND),         00003390
                                                      FØDSNUMMER_EK);   00003400
                                                                        00003410
                                                                        00003420
 /*4156*/       CALL BEREGN_SPT_OPT_PÅ_ALT(                             00003430
                                BER_EK_IND,POREKKE(BER_EK_IND + 11),    00003440
                                                      FØDSNUMMER_EK);   00003450
                                                                        00003460
                                                                        00003470
 /* 42 % TP FOR ÅR ETTER 1991 : */                                      00003480
                                                                        00003490
    IF ^(W_DØDSDATO_Å > 91       &                                      00003500
         FNR_EK_R.ÅR_EK > 22       &                                    00003510
         FNR_EK_R.ÅRHUNDRE_EK < 5 )   THEN                              00003520
            DO;                                                         00003530
               POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;                      00003540
               POREKKE.PÅ_ETTER91(BER_EK_IND + 11) = 0;                 00003550
            END;                                                        00003560
                                                                        00003570
    IF PÅ_ETTER91_MERKE = 'J'    THEN                                   00003580
       DO;                                                              00003590
          POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;                           00003600
          POREKKE.PÅ_ETTER91(BER_EK_IND + 11) = 0;                      00003610
       END;                                                             00003620
                                                                        00003630
                                                                        00003640
                                                                        00003650
 /*11.12.86 HL- FRAPP 270 - PENSJON ETTER ALTERNATIVE POENGREKKER, */   00003660
 /*              OG MED POENGTILLEGG, SKAL SAMMENLIGNES.           */   00003670
                                                                        00003680
                W_TP     = F_TP92(FNR_EK_R.ÅR_EK,G,                     00003690
                                    POREKKE.SPT(BER_EK_IND),            00003700
                                    POREKKE.OPT(BER_EK_IND),            00003710
                                    POREKKE.PÅ(BER_EK_IND),             00003720
                            POREKKE.PÅ_ETTER91(BER_EK_IND),             00003730
                                    100,                                00003740
                                    B02.TP_PROSENT(BER_SØ_IND),'J');    00003750
                                                                        00003760
                W_TP_ALT      = F_TP92(FNR_EK_R.ÅR_EK,G,                00003770
                                    POREKKE.SPT(BER_EK_IND + 11),       00003780
                                    POREKKE.OPT(BER_EK_IND + 11),       00003790
                                    POREKKE.PÅ(BER_EK_IND + 11),        00003800
                            POREKKE.PÅ_ETTER91(BER_EK_IND + 11),100,    00003810
                                    B02.TP_PROSENT(BER_SØ_IND),'J');    00003820
                                                                        00003830
                IF W_TP_ALT > W_TP                   THEN               00003840
                                                                        00003850
                   DO;                                                  00003860
                                                                        00003870
                      POREKKE(BER_EK_IND) =                             00003880
                                     POREKKE(BER_EK_IND + 11);          00003890
                                                                        00003900
                                                                        00003910
                      TP_AVD = W_TP_ALT;                                00003920
                                                                        00003930
                   END;                                                 00003940
                                                                        00003950
                ELSE                                                    00003960
                                                                        00003970
                      TP_AVD = W_TP;                                    00003980
                                                                        00003990
             END;                                                       00004000
                                                                        00004010
  /* GARANTI FOR GAMLE UNGE UFØRE FØDT FØR 1943   ER LAGT OVER*/        00004020
  /* I 4501   9708 HL                          */                       00004030
  /* ********************                                               00004040
  DØDSDATO_ÅM = B02.DØDSDATO_ÅMD(BER_EK_IND) / 100;                     00004050
  FIXED_DEC5  = F_ALDER(FØDSNUMMER_EK,F_SNU_DATO(DØDSDATO_ÅM));         00004060
  ALDER_VED_DØD = FIXED_DEC5;                                           00004070
                                                                        00004080
  IF B02.BUP_GAR_KODE(BER_EK_IND,1)  = 'E' THEN                         00004090
     CALL UF_DØD_GARANTI(BER_SØ_IND,RETUR_POENG);                       00004100
  ELSE                                                                  00004110
  IF B02.TP_GAR_KODE(BER_EK_IND) = 'E'     THEN                         00004120
     CALL UNGE_DØDE_E(B02.VIRK_DATO_ÅM(BER_SØ_IND),                     00004130
          FNR_EK_R.ÅR_EK,ALDER_VED_DØD,RETUR_POENG);                    00004140
                                                                        00004150
  IF RETUR_POENG > 0                      THEN                          00004160
    DO;                                                                 00004170
      W_GARANTI_TP      =  G * 0.45 * RETUR_POENG;                      00004180
      W_GARANTI_TP      =  W_GARANTI_TP * B02.TT_ANV(BER_EK_IND) / 40;  00004190
      W_GARANTI_TP      =  W_GARANTI_TP / 100;                          00004200
      W_GARANTI_TP      =  W_GARANTI_TP * B02.TP_PROSENT(BER_SØ_IND);   00004210
      W_GARANTI_TP      =  W_GARANTI_TP / 12 ;                          00004220
      W_GAR_TP          = W_GARANTI_TP + 0.5;                           00004230
                                                                        00004240
      IF W_GAR_TP  >  TP_AVD THEN                                       00004250
           TP_AVD = W_GAR_TP;                                           00004260
    END;                                                                00004270
 ************************************************************* */       00004280
 /* STATEMENT NEDENFOR ER BYTTET UT MED 'RETUR_POENG'  */               00004290
 /*   W_GARANTI_TP      =  G * 0.45 * B02.BUP_GARANTI(BER_EK_IND,1);*/  00004300
    /*TIL HIT TRUDE */                                                  00004310
                                                                        00004320
 /* ****************************************************** */           00004330
 /* YS - BEREGNING                                         */           00004340
 /* ****************************************************** */           00004350
                                                                        00004360
  IF B02.YRKEPENS.YUG(BER_EK_IND) > 0           THEN                    00004370
     DO;                                                                00004380
                                                                        00004390
        DCL KAP11_TP_AVD      FIXED DEC (5);                            00004400
        DCL VANLIG_TP_AVD     FIXED DEC (5);                            00004410
                                                                        00004420
  B02.YRKEPENS.SPT(BER_EK_IND) = POREKKE.SPT(BER_EK_IND);               00004430
                                                                        00004440
  IF B02.YRKEPENS.YUG(BER_EK_IND) = 100     &                           00004450
     B01.YRKEPENS.YUG(BER_EK_IND) < 100     &   /*26.1.90 HL*/          00004460
      (POREKKE.SPT(BER_EK_IND) >=                                       00004470
      B02.YRKEPENS.YPT(BER_EK_IND)  )          THEN                     00004480
                                                                        00004490
     DO;                                                                00004500
         B02.YRKEPENS.YPT(BER_EK_IND) = POREKKE.SPT(BER_EK_IND);        00004510
         B02.YRKEPENS.YPT_KODE(BER_EK_IND) = 'V';                       00004520
     END;                                                               00004530
                                                                        00004540
 /*POENGTALLET KAN OGSÅ ØKES PGA POENGTILLEGG - DETTE MÅ VI I DENNE*/   00004550
 /*OMGANG NØYE OSS MED Å BEREGNE FOR DE SOM DØR I SAMME ÅR SOM DE  */   00004560
 /*BLIR 100 PROSENT UFØR (FOR ANDRE HAR VI IKKE TILGJENGELIG DEN   */   00004570
 /*POENGREKKEN SOM POENGTILLEGGET SKAL LEGGES TIL) - HL 28.1.91    */   00004580
                                                                        00004590
 ELSE                                                                   00004600
    DO;                                                                 00004610
       W_UFØRETID_ÅM  = B02.YRKEHIST.YUFT_ÅM(BER_EK_IND,1);             00004620
       IF (W_DØDSDATO_Å = W_UFØRETID_Å)     &                           00004630
          (POREKKE.SPT(BER_EK_IND) >=                                   00004640
          B02.YRKEPENS.YPT(BER_EK_IND)  )          THEN                 00004650
                                                                        00004660
         DO;                                                            00004670
            B02.YRKEPENS.YPT(BER_EK_IND) = POREKKE.SPT(BER_EK_IND);     00004680
            B02.YRKEPENS.YPT_KODE(BER_EK_IND) = 'V';                    00004690
         END;                                                           00004700
    END;                                                                00004710
                                                                        00004720
                                                                        00004730
    TP_WORK  = G * B02.YRKEPENS.YPT(BER_EK_IND);                        00004740
    TP_WORK  = TP_WORK *  B02.TP_PROSENT(BER_SØ_IND) / 100;             00004750
    TP_WORK  = TP_WORK * B02.YRKEPENS.YUG(BER_EK_IND) /100;             00004760
    TP_WORK  = TP_WORK / 12;                                            00004770
    IF B02.YRKEPENS.PÅ_ETTER91(BER_EK_IND) = 0       THEN               00004780
       TP_WORK  = TP_WORK * 45 /100;                                    00004790
    ELSE                                                                00004800
       DO;                                                              00004810
          FAKTOR1 = (B02.YRKEPENS.PÅ(BER_EK_IND)                        00004820
                     - B02.YRKEPENS.PÅ_ETTER91(BER_EK_IND) )            00004830
                   / B02.YRKEPENS.PÅ(BER_EK_IND) * 45/100;              00004840
          FAKTOR2 = B02.YRKEPENS.PÅ_ETTER91(BER_EK_IND)                 00004850
                   / B02.YRKEPENS.PÅ(BER_EK_IND) * 42/100;              00004860
          TP_WORK = TP_WORK * (FAKTOR1 + FAKTOR2 + 0.00005);            00004870
       END;                                                             00004880
                                                                        00004890
       KAP11_TP_AVD     = TP_WORK + 0.5;                                00004900
                                                                        00004910
 /*     KAP11_TP_AVD       = F_TILLEGGSPENSJON(FNR_EK_R.ÅR_EK,G,        00004920
                             B02.YRKEPENS.YPT(BER_EK_IND),0,40,         00004930
                             B02.YRKEPENS.YUG(BER_EK_IND),              00004940
                             B02.TP_PROSENT(BER_SØ_IND),'J');   */      00004950
                                                                        00004960
        VANLIG_TP_AVD = TP_AVD *                                        00004970
                (100 - B02.YRKEPENS.YUG(BER_EK_IND)) / 100 + 0.5;       00004980
                                                                        00004990
        IF (KAP11_TP_AVD + VANLIG_TP_AVD) > TP_AVD     THEN             00005000
                                                                        00005010
           DO;                                                          00005020
              TP_AVD = KAP11_TP_AVD + VANLIG_TP_AVD;                    00005030
              DIV_PARAM_OMR.BEREGNINGS_ALT_AVD = '3';                   00005040
                                                                        00005050
 /*YS ********************************************************* */      00005060
 /*YS         DIV_PARAM_OMR.BEREGNINGS_ALT_AVD = '3' BETYR AT   */      00005070
 /*YS         DET LØNNER SEG MED YRKE-BEREGNING AV AVDØDES TP   */      00005080
 /*YS ********************************************************* */      00005090
                                                                        00005100
           END;                                                         00005110
                                                                        00005120
         END;                                                           00005130
                                                                        00005140
  /* VI HADDE GLEMT Å OPPDATERE PÅ_ETTER91 PÅ EGEN UFØRHIST*/           00005150
  /* TRUDE, 080992                                         */           00005160
                                                                        00005170
   B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND) = POREKKE.PÅ_ETTER91(BER_SØ_IND);00005180
                                                                        00005190
  /* ENDRINGER FORETATT 9708 HL - FLYTTET TIL 4501 */                   00005200
                                                                        00005210
  /* ***************************                                        00005220
  IF B02.BUP_GAR_KODE(BER_SØ_IND,1)    =   'E'   THEN                   00005230
     DO;                                                                00005240
        IF B02.VIRK_DATO_ÅM(BER_SØ_IND)      <  9101    THEN            00005250
           SPT_GARANTI = 1.6;                                           00005260
        ELSE                                                            00005270
        IF B02.VIRK_DATO_ÅM(BER_SØ_IND)      <  9201    THEN            00005280
           SPT_GARANTI = 2;                                             00005290
        ELSE                                                            00005300
        IF B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9205          THEN            00005310
             DO;                                                        00005320
                IF FNR_R.ÅR     = 25 THEN                               00005330
                   SPT_GARANTI = 2;                                     00005340
                ELSE                                                    00005350
                IF FNR_R.ÅR     > 25 &                                  00005360
                   FNR_R.ÅR     < 45 THEN                               00005370
                   SPT_GARANTI  = 2.5;                                  00005380
             END;                                                       00005390
        ELSE                                                            00005400
        IF B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9705          THEN            00005410
           DO;                                                          00005420
              IF FNR_R.ÅR     = 25 THEN                                 00005430
                 SPT_GARANTI = 2;                                       00005440
              ELSE                                                      00005450
                 SPT_GARANTI = 3;                                       00005460
           END;                                                         00005470
        ELSE                                                            00005480
           DO;                                                          00005490
              IF FNR_R.ÅR     < 31 THEN                                 00005500
                 SPT_GARANTI = 3;                                       00005510
              ELSE                                                      00005520
                 SPT_GARANTI = 3.3;                                     00005530
           END;                                                         00005540
                                                                        00005550
        TP_UP_GARANTI  = ( SPT_GARANTI * 0.45 * G );                    00005560
        TP_UP_GARANTI  = TP_UP_GARANTI / 40;                            00005570
        TP_UP_GARANTI  = TP_UP_GARANTI * B02.TT_ANV(BER_SØ_IND);        00005580
        TP_UP_GARANTI  = TP_UP_GARANTI / 12;                            00005590
        TP_UP_GARANTI  = TP_UP_GARANTI                                  00005600
                      * UFGRAD / 100;                                   00005610
        TP_GARANTI    = TP_UP_GARANTI + 0.5;                            00005620
                                                                        00005630
        IF TP_GARANTI  >   TP_UP  THEN                                  00005640
             DO;                                                        00005650
                TP_UP   = TP_GARANTI;                                   00005660
                B02.STATUS.TP_GAR_KODE(BER_SØ_IND)  = 'E';              00005670
             END;                                                       00005680
        ELSE                                                            00005690
           B02.STATUS.TP_GAR_KODE(BER_SØ_IND)  = ' ';                   00005700
                                                                        00005710
        IF B02.PENSJONSTYPE1(BER_SØ_IND)  = 'Y'  THEN                   00005720
           DO;                                                          00005730
              TP_GARANTI_YP  = (SPT_GARANTI * 0.45 * G);                00005740
              TP_GARANTI_YP  = TP_GARANTI_YP / 100;                     00005750
              TP_GARANTI_YP  = TP_GARANTI_YP                            00005760
                               * B02.YRKEPENS.YUG(BER_SØ_IND);          00005770
              TP_GARANTI_YP  = TP_GARANTI_YP / (40 * 12);               00005780
              TP_GARANTI_YP1 = TP_GARANTI_YP + 0.5;                     00005790
                                                                        00005800
              IF TP_GARANTI_YP1 > B02.YRKEPENS.TP(BER_SØ_IND) THEN      00005810
                 DO;                                                    00005820
                    B02.YRKEPENS.TP(BER_SØ_IND) = TP_GARANTI_YP1;       00005830
                    B02.STATUS.TP_GAR_KODE(BER_SØ_IND) = 'E';           00005840
                 END;                                                   00005850
              ELSE                                                      00005860
                 B02.STATUS.TP_GAR_KODE(BER_SØ_IND) = ' ';              00005870
           END;                                                         00005880
  *************************************************** */                00005890
 /* 9708 HL : ********************                                      00005900
        IF B02.STATUS.TP_GAR_KODE(BER_SØ_IND)  ^= 'E' THEN              00005910
           DO;                                                          00005920
              STØNADSBREV_ØNSKET_IND = NEI;                             00005930
           END;                                                         00005940
 *************************** */                                         00005950
 /*  END;   */                                                          00005960
                                                                        00005970
        TP_EGEN    = B02.YRKEPENS.TP(BER_SØ_IND) + TP_UP;               00005980
                                                                        00005990
    RETUR:                                                              00006000
                                                                        00006010
  END BEREGN_TP_ETTERLATT_UP;                                           00006020
