 /*       SIST ENDRET 05/01-98 16.03.04 AV   TSB7339                  */00000000
 /*       SIST ENDRET 05/01-98 16.01.32 AV   TSB7339                  */00000010
 /*       SIST ENDRET 28/01-85 13.23.49 AV   KARIN                    */00000020
 /*       SIST ENDRET 02/11-83 14.28.34 AV   OLAV                     */00000030
 /*       SIST ENDRET 27/10-82 08.13.55 AV   FARVIK                   */00000040
 /* ***************************************************************** */00000050
 /*IDENTIFIKASJON:                                                    */00000060
 /*    R0014145 - REGN_TT_67_TIL_70 - INTERN PROC I PLI.              */00000070
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982.                          */00000080
 /*HENSIKT:                                                           */00000090
 /*    B02.STATUS.TT_67_TIL_70 BLIR OPPDATERT.                     */   00000100
 /*    PROGRAMMET LEGGER TIL TRYGDETID FOR ÅRENE PERSONEN FYLLER 67,  */00000110
 /*    68 OG 69 ÅR. DETTE ER BARE AKTUELT FOR PERSONER SOM HAR INNTEKT*/00000120
 /*    OVER GRUNNBELØPET I DISSE ÅRENE.                               */00000130
 /*    FOR PERSONER FØDT FØR 1904 GJELDER IKKE DENNE REGELEN.         */00000140
 /*    FOR PERSONER FØDT I 1904, ER DET KUN DET 69. ÅRET SOM SKAL TAS */00000150
 /*    MED. (1973)                                                    */00000160
 /*    FOR PERSONER FØDT I 1905, ER DET BARE DET 68. OG 69. ÅRET SOM  */00000170
 /*    KAN MEDREGNES.                                                 */00000180
 /*    FOR PERSONER FØDT I 1906 OG SENERE KAN DET 67.,68., OG DET     */00000190
 /*    69. ÅRET MEDREGNES.                                            */00000200
 /*PROGRAMTILKNYTNING:                                                */00000210
 /*    PROGRAMMET BLIR INKLUDERT I OVERLIGGENDE PROGRAM.              */00000220
 /*BRUK:                                                              */00000230
 /*    CALL REGN_TT_67_TIL_70;                                        */00000240
 /* ***************************************************************** */00000250
 /*SIST ENDRET 28.1-85 AV KARIN SVENDSEN                              */00000260
 /*    DET BLE FEIL FOR FOLK FØDT I 1905, HER BLE DET I STEDET TESTET */00000270
 /*    PÅ 1904, M. A. ORD TRYKKFEIL.                                  */00000280
 /* ***************************************************************** */00000290
                                                                        00000300
 REGN_TT_67_TIL_70: PROC;                                               00000310
                                                                        00000320
 DCL                                                                    00000330
    INNT_ÅR               FIXED BIN(15);                                00000340
                                                                        00000350
 B02.STATUS.TT_67_TIL_70(BER_SØ_IND) = 0;                               00000360
                                                                        00000370
 IF FNR_R.ÅRHUNDRE < 5 THEN                                             00000380
                                                                        00000390
    DO;                                                                 00000400
       IF FNR_R.ÅR = 04    THEN                                         00000410
                                                                        00000420
          DO;                                                           00000430
             IF B02.PINNTEKT.PI(BER_SØ_IND,73) * 100 >                  00000440
                                          GV_TAB_ARRAY.G_V(73) THEN     00000450
                                                                        00000460
                B02.STATUS.TT_67_TIL_70(BER_SØ_IND) = 1;                00000470
          END;                                                          00000480
                                                                        00000490
       ELSE                                                             00000500
                                                                        00000510
          IF FNR_R.ÅR = 05        THEN                                  00000520
                                                                        00000530
             DO;                                                        00000540
                IF B02.PINNTEKT.PI(BER_SØ_IND,73) * 100 >               00000550
                                          GV_TAB_ARRAY.G_V(73) THEN     00000560
                                                                        00000570
                   B02.STATUS.TT_67_TIL_70(BER_SØ_IND) = 1;             00000580
                                                                        00000590
                IF B02.PINNTEKT.PI(BER_SØ_IND,74) * 100 >               00000600
                                           GV_TAB_ARRAY.G_V(74) THEN    00000610
                                                                        00000620
                   B02.STATUS.TT_67_TIL_70(BER_SØ_IND) =                00000630
                   B02.STATUS.TT_67_TIL_70(BER_SØ_IND) + 1;             00000640
             END;                                                       00000650
                                                                        00000660
          ELSE                                                          00000670
                                                                        00000680
             IF FNR_R.ÅR > 05        THEN                               00000690
                                                                        00000700
                DO INNT_ÅR = (FNR_R.ÅR + 67) TO (FNR_R.ÅR + 69);        00000710
                                                                        00000720
                   /* TRUDE 05.01.98 PINNTEKT 67:99 */                  00000730
                   IF INNT_ÅR > 99 THEN LEAVE;                          00000740
                      /* TIL HIT 05.01.98*/                             00000750
                                                                        00000760
                   IF INNT_ÅR = FNR_R.ÅR + 69     &                     00000770
                      B02.PINNTEKT.PI_KODE                              00000780
                                     (BER_SØ_IND,INNT_ÅR) = ' ' THEN    00000790
                                                                        00000800
                      DO;                                               00000810
                         IF B02.PINNTEKT.PI                             00000820
                                     (BER_SØ_IND,INNT_ÅR - 1) * 100 >   00000830
                                     GV_TAB_ARRAY.G_V(INNT_ÅR - 1) THEN 00000840
                                                                        00000850
                            B02.STATUS.TT_67_TIL_70(BER_SØ_IND) =       00000860
                            B02.STATUS.TT_67_TIL_70(BER_SØ_IND) + 1;    00000870
                      END;                                              00000880
                                                                        00000890
                  ELSE                                                  00000900
                                                                        00000910
                      DO;                                               00000920
                         IF B02.PINNTEKT.PI                             00000930
                                     (BER_SØ_IND,INNT_ÅR) * 100 >       00000940
                                     GV_TAB_ARRAY.G_V(INNT_ÅR) THEN     00000950
                                                                        00000960
                            B02.STATUS.TT_67_TIL_70(BER_SØ_IND) =       00000970
                            B02.STATUS.TT_67_TIL_70(BER_SØ_IND) + 1;    00000980
                      END;                                              00000990
                                                                        00001000
                END;                                                    00001010
     END;                                                               00001020
 END REGN_TT_67_TIL_70;                                                 00001030
