 /*       SIST ENDRET 29/03-88 13.15.06 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 19/01-88 08.22.43 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 10/07-85 09.39.02 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 26/07-84 12.48.23 AV   HERMAN                   */00000030
 /*       SIST ENDRET 29/04-83 12.43.14 AV   KARIN                    */00000040
 /*       SIST ENDRET 29/04-83 08.21.01 AV   KARIN                    */00000050
 /*       SIST ENDRET 27/04-83 12.46.25 AV   KARIN                    */00000060
 /*       SIST ENDRET 27/04-83 11.56.42 AV   KARIN                    */00000070
 /*       SIST ENDRET 21/12-82 15.07.20 AV   FARVIK                   */00000080
 /*       SIST ENDRET 21/12-82 07.58.28 AV   FARVIK                   */00000090
 /* ***************************************************************** */00000100
 /* IDENTIFIKASJON:                                                   */00000110
 /*     R0019939 - PROSEDYRE I PLI                                    */00000120
 /*     PROGRAMMERER: JAN, APRIL 1982                                 */00000130
 /* HENSIKT:                                                          */00000140
 /*     DENNE RUTINEN OPPHØRER BARNEPENSJON.                          */00000150
 /*     YNGSTE OG ØVRIGE BARN ER FLYTTET TIL B02                      */00000160
 /*     AVDØDE FORELDRE ER IKKE PÅ PLASS I B02                        */00000170
 /*     IND ER MF.INDEKS PÅ DET BARNET DET ER OPPHØR FOR.             */00000180
 /* PROGRAMTILKNYTNING:                                               */00000190
 /*     KALLES OPP AV PROGRAM R0011720.                               */00000200
 /* BRUK:                                                             */00000210
 /*     CALL BARNEPENSJON_OPPHØRER(IND)                               */00000220
 /* ***************************************************************** */00000230
 %SKIP;                                                                 00000240
 BARNEPENSJON_OPPHØRER:                                                 00000250
   PROC(IND);                                                           00000260
 /* ***************************************************************** */00000270
 /* DEKLARASJONER                                                     */00000280
 /* ***************************************************************** */00000290
   DCL                                                                  00000300
      NY_YNG_BARN_IND FIXED BIN(15),                                    00000310
      IND             FIXED BIN(15),                                    00000320
      I               FIXED BIN(15),                                    00000330
      J               FIXED BIN(15),                                    00000340
      K               FIXED BIN(15);                                    00000350
   DCL  HJELPEDATO1   PIC '(6)9';                                       00000360
   DCL                                                                  00000370
      1 HJ_DATO_YNG1 DEF HJELPEDATO1,                                   00000380
        2 HJ_DAG1     PIC '99',                                         00000390
        2 HJ_MND1     PIC '99',                                         00000400
        2 HJ_ÅR1      PIC '99';                                         00000410
   DCL  HJELPEDATO2   PIC '(6)9';                                       00000420
   DCL                                                                  00000430
      1 HJ_DATO_YNG2 DEF HJELPEDATO2,                                   00000440
        2 HJ_DAG2     PIC '99',                                         00000450
        2 HJ_MND2     PIC '99',                                         00000460
        2 HJ_ÅR2      PIC '99';                                         00000470
   DCL                                                                  00000480
      T_FNR           PIC '(11)9';                                      00000490
   DCL                                                                  00000500
      1 NR DEF T_FNR,                                                   00000510
        2 DG          PIC '99',                                         00000520
        2 MN          PIC '99',                                         00000530
        2 ÅR          PIC '99',                                         00000540
        2 PERSNR      PIC '99999';                                      00000550
                                                                        00000560
 /* ***************************************************************** */00000570
 /* PROGRAMMET STARTER HER                                            */00000580
 /* ***************************************************************** */00000590
                                                                        00000600
      PROGRAM_ID = 'R0019939';                                          00000610
                                                                        00000620
 /* ***************************************************************** */00000630
 /* DERSOM BARNET IKKE HAR PENSJON FRA FØR                            */00000640
 /* ***************************************************************** */00000650
                                                                        00000660
      IF B01.PENSJONSTYPE1(IND) ^= 'B' &                                00000670
         B01.PENSJONSTYPE1(IND) ^= 'N' THEN                             00000680
         DO;                                                            00000690
 L100:                                                                  00000700
            FEIL_VED_LABEL = '100';                                     00000710
            FEIL_MELD_NR = 1605;                                        00000720
            GO TO L999;                                                 00000730
         END;                                                           00000740
                                                                        00000750
 /*   IF B01.FNR(1) > 0 THEN                  */                        00000760
 /*         CALL FLYTT_B01_TIL_B02(1);        */                        00000770
 /*   IF B01.FNR(2) > 0 THEN                  */                        00000780
 /*         CALL FLYTT_B01_TIL_B02(2);        */                        00000790
                                                                        00000800
 /* ENDRET 7.10.87 HL - LINJENE OVENFOR ER ERSTATTET MED DE UNDER */    00000810
                                                                        00000820
      IF B01.FNR(1) > 0 THEN                                            00000830
         DO;                                                            00000840
            B02.PERSON(1) = B01.PERSON(1);                              00000850
            B02.VIRK_DATO_ÅM (1)      = HJ_VIRK_DATO_ÅM;                00000860
         END;                                                           00000870
                                                                        00000880
      IF B01.FNR(2) > 0 THEN                                            00000890
         DO;                                                            00000900
            B02.PERSON(2) = B01.PERSON(2);                              00000910
            B02.VIRK_DATO_ÅM (2)      = HJ_VIRK_DATO_ÅM;                00000920
         END;                                                           00000930
                                                                        00000940
 /* HIT 7.10.87 HL */                                                   00000950
                                                                        00000960
                                                                        00000970
 /* ***************************************************************** */00000980
 /* EN ELLER BEGGE FORELDRENE ER NÅ FLYTTET                           */00000990
 /* ***************************************************************** */00001000
                                                                        00001010
                                                                        00001020
 /* ***************************************************************** */00001030
 /* YNGSTE OG ØVRIGE BARN ER FLYTTET I B02 I PROGRAM R0011720         */00001040
 /* ***************************************************************** */00001050
                                                                        00001060
 /* ***************************************************************** */00001070
 /* DERSOM BARNET ER YNGSTE BARN                                      */00001080
 /* ***************************************************************** */00001090
                                                                        00001100
      IF IND = 3 THEN                                                   00001110
         DO;                                                            00001120
           IF B01.FNR(1) > 0 THEN                                       00001130
              CALL OPPHØR_KOBLING_TO_PERSONER(1,3);                     00001140
           IF B01.FNR(2) > 0 THEN                                       00001150
              CALL OPPHØR_KOBLING_TO_PERSONER(2,3);                     00001160
                                                                        00001170
 /* ***************************************************************** */00001180
 /* DERSOM DET ER FLERE BARN                                          */00001190
 /* ***************************************************************** */00001200
                                                                        00001210
           IF B01.ANTALL_BARN(IND) > 1 THEN                             00001220
              DO;                                                       00001230
                 TRANSTYPE = 35;                                        00001240
                                                                        00001250
 /* ***************************************************************** */00001260
 /* FINNER NY YNGSTE BARN                                             */00001270
 /* ***************************************************************** */00001280
                                                                        00001290
                 DO I = 4 TO 14 WHILE (B01.FNR(I) > 0);                 00001300
                    T_FNR   = B01.FNR(I);                               00001310
                    HJ_ÅR2  = ÅR;                                       00001320
                    HJ_MND2 = MN;                                       00001330
                    HJ_DAG2 = DG;                                       00001340
                    IF HJELPEDATO1 < HJELPEDATO2 THEN                   00001350
                       DO;                                              00001360
                         HJ_DATO_YNG1    = HJ_DATO_YNG2;                00001370
                         NY_YNG_BARN_IND = I;                           00001380
                       END;                                             00001390
                 END;                                                   00001400
   /*   ENDRET 15.03.88   SATISH                                      */00001410
   /*                                                                 */00001420
   /*            B02.PENSJONSTYPE2(NY_YNG_BARN_IND) = 'Y';            */00001430
   /*   HITTIL                                                        */00001440
                 B02.PENSJONSTYPE2(NY_YNG_BARN_IND) = 'P';              00001450
                 B02.FØRSTE_GANG_REG(NY_YNG_BARN_IND) = 'N';            00001460
                                                                        00001470
 /* ***************************************************************** */00001480
 /* HER KOBLES NY-YNGSTE-BARN TIL EN ELLER TO FORELDRE                */00001490
 /* ***************************************************************** */00001500
                                                                        00001510
                 IF B01.FNR(1) > 0 THEN                                 00001520
                    DO;                                                 00001530
                       CALL KOBLE_TO_PERSONER    (NY_YNG_BARN_IND,1);   00001540
                    END;                                                00001550
                 IF B01.FNR(2) > 0 THEN                                 00001560
                    DO;                                                 00001570
                       CALL KOBLE_TO_PERSONER    (NY_YNG_BARN_IND,2);   00001580
                    END;                                                00001590
                 B02.ANTALL_BARN(NY_YNG_BARN_IND) =                     00001600
                                 B02.ANTALL_BARN(3) - 1;                00001610
                                                                        00001620
 /* ***************************************************************** */00001630
 /* OPPHØRER KOBLING MELLOM NY_YNGSTE_BARN OG YNGSTE_BARN.            */00001640
 /* ***************************************************************** */00001650
                                                                        00001660
                 CALL OPPHØR_KOBLING_TO_PERSONER(NY_YNG_BARN_IND,3);    00001670
                                                                        00001680
 /* ***************************************************************** */00001690
 /* KOBLING FRA FORRIGE YNGSTE BARN TIL ØVRIGE BARN OPPHØRER.         */00001700
 /* ***************************************************************** */00001710
                                                                        00001720
                 DO K = 4 TO 14 WHILE (B01.FNR (K) > 0);                00001730
                    CALL OPPHØR_KOBLING_TO_PERSONER(K,3);               00001740
                 END;                                                   00001750
                                                                        00001760
 /* ***************************************************************** */00001770
 /* ØVRIGE BARN KOBLES TIL NY-YNGSTE-BARN                             */00001780
 /* ***************************************************************** */00001790
                                                                        00001800
                 DO K = 4 TO 14 WHILE (B01.FNR (K) > 0);                00001810
                    IF K ^= NY_YNG_BARN_IND THEN                        00001820
                       DO;                                              00001830
                          CALL KOBLE_TO_PERSONER(NY_YNG_BARN_IND,K);    00001840
                          B02.FØRSTE_GANG_REG(NY_YNG_BARN_IND) = 'N';   00001850
                       END;                                             00001860
                 END;                                                   00001870
              END;                                                      00001880
            ELSE                                                        00001890
                                                                        00001900
 /* ***************************************************************** */00001910
 /* IKKE FLERE BARN                                                   */00001920
 /* ***************************************************************** */00001930
                                                                        00001940
               TRANSTYPE                     = 55;                      00001950
                                                                        00001960
 /* ***************************************************************** */00001970
 /* DERSOM FORELDRENE IKKE ER TILKNYTTA FLERE PERSONER FJERNES        */00001980
 /* SPESDØD-SEGMENTET                                                 */00001990
 /* ***************************************************************** */00002000
                                                                        00002010
          IF B01.FNR_TILKN(1,1) = 0  THEN                               00002020
             DO;                                                        00002030
                B02.SPESOPPL.STATSBORGER(1)   = 0;                      00002040
                B02.SPESOPPL.OVERKOMP_UTL(1)  = ' ';                    00002050
                B02.SPESOPPL.FRAVIK_FLYKTN(1) = ' ';                    00002060
                B02.SPESOPPL.BOSATT(1)        = 0;                      00002070
                B02.SPESOPPL.TRYGDET_DØD(1)   = ' ';                    00002080
             END;                                                       00002090
          IF B01.FNR_TILKN(2,1) = 0  THEN                               00002100
             DO;                                                        00002110
                B02.SPESOPPL.STATSBORGER(2)   = 0;                      00002120
                B02.SPESOPPL.OVERKOMP_UTL(2)  = ' ';                    00002130
                B02.SPESOPPL.FRAVIK_FLYKTN(2) = ' ';                    00002140
                B02.SPESOPPL.BOSATT(2)        = 0;                      00002150
                B02.SPESOPPL.TRYGDET_DØD(2)   = ' ';                    00002160
             END;                                                       00002170
         END;                                                           00002180
      ELSE                                                              00002190
                                                                        00002200
 /* ***************************************************************** */00002210
 /* IND > 3 D.V.S IKKE YNGSTE BARN                                    */00002220
 /* ***************************************************************** */00002230
                                                                        00002240
         DO;                                                            00002250
            B02.ANTALL_BARN(3) = B02.ANTALL_BARN(3) - 1;                00002260
            CALL OPPHØR_KOBLING_TO_PERSONER(IND,3);                     00002270
            DO K = 3 TO 14 WHILE (B01.FNR (K) > 0);                     00002280
               B02.FØRSTE_GANG_REG(K) = 'N';                            00002290
            END;                                                        00002300
                                                                        00002310
 /* 26.7.84 ER LINJEN NEDENFOR SATT INN I PROGRAMMET                */  00002320
                                                                        00002330
            TRANSTYPE                     = 35;                         00002340
                                                                        00002350
 /* HIT  H.L.                                                       */  00002360
                                                                        00002370
         END;                                                           00002380
                                                                        00002390
                                                                        00002400
      IF B01.PENSJONSTYPE3(IND) = 'U' THEN                              00002410
         DO;                                                            00002420
                                                                        00002430
 /* ***************************************************************** */00002440
 /* UFØR BARNEPENSJONIST BLIR BARE UFØR                               */00002450
 /* ***************************************************************** */00002460
                                                                        00002470
            B02.VIRK_DATO_ÅM(IND)       = HJ_VIRK_DATO_ÅM;              00002480
            B02.PENSJONSTYPE1(IND)      = 'U';                          00002490
            B02.PENSJONSTYPE2(IND)      = 'P';                          00002500
            B02.PENSJONSTYPE3(IND)      = ' ';                          00002510
            B02.FØRSTE_GANG_REG(IND)    = 'N';                          00002520
            B02.ANTALL_BARN(IND)        = 0;                            00002530
            DO I = 1 TO 13 WHILE(B01.FNR_TILKN(IND,I) > 0);             00002540
                B02.TILKN.FNR_TILKN(IND,I)    = 0;                      00002550
            END;                                                        00002560
            TRANSTYPE = 21;                                             00002570
         END;                                                           00002580
      ELSE                                                              00002590
         DO;                                                            00002600
            B02.VIRK_DATO_ÅM (IND)      = HJ_VIRK_DATO_ÅM;              00002610
            B02.STATUS_KODE_HIST(IND)   = 'O';                          00002620
            B02.PENSJONSTYPE2(IND)      = ' ';                          00002630
            B02.FØRSTE_GANG_REG(IND)   = 'N';                           00002640
          END;                                                          00002650
 L999:                                                                  00002660
 EXEC CICS PURGE MESSAGE;                                               00002670
     END BARNEPENSJON_OPPHØRER;                                         00002680
