 /*       SIST ENDRET 05/12-97 13.08.32 AV   JDA7339                  */00000000
 /*       SIST ENDRET 27/11-97 11.50.18 AV   JDA7339                  */00000010
 /*       SIST ENDRET 25/02-97 11.55.11 AV   JDA7339                  */00000020
 /*       SIST ENDRET 11/02-97 14.27.16 AV   JDA7339                  */00000030
 /*       SIST ENDRET 05/02-96 12.39.09 AV   JDA0310                  */00000040
                                                                        00000050
 /* ***************************************************************** */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /* **********************                                            */00000080
 /*  PROGRAM-IDENT : R00104AF  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000090
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000100
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000110
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000120
 /*                                                                   */00000130
 /* ***************************************************************** */00000140
 /*HENSIKT:                                                           */00000150
 /* **********                                                        */00000160
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000170
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000180
 /*    FORHÅND.                                                       */00000190
 /*    MAPS HØRER INN UNDER MAPSET 'S001F3'.                         */ 00000200
 /*                                                                   */00000210
 /* ***************************************************************** */00000220
 /*PROGRAMTILKNYTTING:                                                */00000230
 /* ********************                                              */00000240
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000250
 /*                                                                   */00000260
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000270
 /*    BRUK :                                                         */00000280
 /*    EXEC CICS XCTL PROGRAM ('R00104AF') COMMAREA(KOM_OMR);         */00000290
 /*    PROGRAMMET INCLUDER :                                          */00000300
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    AF       */00000310
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       AF       */00000320
 /* ***************************************************************** */00000330
 /*DATASETTOPPLYSNINGER:                                              */00000340
 /* ***********************                                           */00000350
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000360
 /*                                                                   */00000370
 /* ***************************************************************** */00000380
 /*FEILMELDINGER:                                                     */00000390
 /* *******************                                               */00000400
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000410
 /*                                                                   */00000420
 /* ***************************************************************** */00000430
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000440
                                                                        00000450
          %INCLUDE P0019906;                                            00000460
          %INCLUDE P0019908;                                            00000470
          %INCLUDE P0019910;                                            00000480
          %INCLUDE P0019912;                                            00000490
          %INCLUDE P0019913;                                            00000500
 DCL                                                                    00000510
      (CSTG, ADDR)                   BUILTIN;                           00000520
 DCL  COMMAREA_PEKER         PTR,                                       00000530
      LOKAL_KOM_PTR          PTR;                                       00000540
                                                                        00000550
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000560
 DCL                                                                    00000570
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000580
    DFHBMUNP             CHAR(1) INIT(' '),                             00000590
    DFHBMBRY             CHAR(1) INIT('H'),                             00000600
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000610
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000620
    MELDING6O            CHAR(10),                                      00000630
    YMELDING6O           CHAR(10);                                      00000640
                                                                        00000650
          %INCLUDE S001F3  ;                                            00000660
          %INCLUDE P001UJ01;                                            00000670
                                                                        00000680
                                                                        00000690
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000700
                                                                        00000710
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000720
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000730
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000740
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000750
                                                                        00000760
                                                                        00000770
                                                                        00000780
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000790
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000800
                                                                        00000810
           CALL OVERFØR_KFPSØKER_MAP;                /* R001UJ06 */     00000820
           IF KFP.NORSK_BOSATT = 'N' THEN                               00000830
              DO;                                                       00000840
                 CALL OVERFØR_KFPSPES_MAP;           /* R001UJ06 */     00000850
              END;                                                      00000860
           S001UJ1O.DUMMYA = 'Ø';                   /* PROT,DARK  */    00000870
        /* FREE TRANS_OMR,TRANS_OPPL_OMR; */                            00000880
                                                                        00000890
                                                                        00000900
      EXEC CICS RETURN;                                                 00000910
                                                                        00000920
      /*   *******END HOVED PROGRAM   ***************** */              00000930
          %INCLUDE R001UJ06;                                            00000940
          %INCLUDE R0019912;                                            00000950
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00000960
      PROC(FIXED_DEC_5);                                                00000970
                                                                        00000980
      DCL                                                               00000990
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00001000
                                                                        00001010
   END SKRIV_FEIL;                                                      00001020
                                                                        00001030
        SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001040
                                                                        00001050
           DCL                                                          00001060
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001070
                                                                        00001080
        END SKRIV_FEIL_YP;                                              00001090
                                                                        00001100
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001110
                                                                        00001120
           DCL                                                          00001130
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001140
                                                                        00001150
        END SKRIV_FEIL_SP;                                              00001160
                                                                        00001170
                                                                        00001180
 END R001041;                                                           00001190
