 /*       SIST ENDRET 03/01-90 12.47.49 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 02/01-90 15.07.00 AV   TUYEN                    */00000010
 /*       SIST ENDRET 17/04-89 15.47.32 AV   TRUDE                    */00000020
 /*       SIST ENDRET 14/02-89 12.41.20 AV   DYBVIK                   */00000030
 /* ***************************************************************** */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /* **********************                                            */00000060
 /*  PROGRAM-IDENT : R001I903  MASSE-REGISTRERING AV INNTEKTER        */00000070
 /*                            FRA BRUDD-LISTE.                       */00000080
 /*  PROGRAM-SPRÅK : PLI/CICS                     HOVEDPROGRAM        */00000090
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */00000100
 /*  PROGRAMMET BLE LAGET : JAN 1989                                  */00000110
 /*  ENDRINGERSDATO :                                                 */00000120
 /*  ENDRINGEN GJELDER:                                               */00000130
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000140
 /*                                                                   */00000150
 /* ***************************************************************** */00000160
 /*HENSIKT:                                                           */00000170
 /* **********                                                        */00000180
 /*  PROGRAMMET STYRER REGISTRERING AV INNTEKTER FRA BRUDD-LISTE.     */00000190
 /*  INNTEKTENE LEGGES UT PÅ FILEN INBRUDD. FILEN OLBRUDD OPPDATERES  */00000200
 /*  FOR UTSKRIVING AV KONTROLL-LISTE.                                */00000210
 /*                                                                   */00000220
 /* ***************************************************************** */00000230
 /*PROGRAMTILKNYTTING:                                                */00000240
 /* ********************                                              */00000250
 /*  BLIR GITT KONTROLL V TRANSKODE RI9B.                             */00000260
 /*                                                                   */00000270
 /*  ARBEIDSOMRÅDER SOM BRUKES :                                      */00000280
 /*                                                                   */00000290
 /*          S001I9;                              MAP REG.INNT.       */00000300
 /*          P0019956;                            INNTEKTS_RAPPORT    */00000310
 /*          P0019906;                            TRANS_OPPL_OMR      */00000320
 /*          P0019908;                            KOM_OMR             */00000330
 /*          P0019910;                            STYRINGS_OMR        */00000340
 /*          P0019912;                            DIV_OMR             */00000350
 /*          P0019924;                            G_V TAB             */00000360
 /*          P0019925;                            G TAB               */00000370
 /*                                                                   */00000380
 /* ***************************************************************** */00000390
 /*DATASETTOPPLYSNINGER:                                              */00000400
 /* ***********************                                           */00000410
 /*  OUTPUT ER                                                        */00000420
 /*            OLBRUDD   TIL KONTROLL-LISTE                           */00000430
 /*            INBRUDD   TIL R0019D11 - SPLITT PENSJ/IKKE PENSJ.      */00000440
 /*                                                                   */00000450
 /* ***************************************************************** */00000460
 /*FEILMELDINGER:                                                     */00000470
 /* *******************                                               */00000480
 /*  FEIL-MELDINGER SKRIVES UT PÅ SKJERMBILDET.                       */00000490
 /*                                                                   */00000500
 /* ***************************************************************** */00000510
                                                                        00000520
 R001I93:                                                               00000530
    PROC            (COMMAREA_PEKER)                                    00000540
           OPTIONS  (MAIN);                                             00000550
                                                                        00000560
                                                                        00000570
    %PAGE;                                                              00000580
    DCL 01 INNT_RAPP,                                                   00000590
    %INCLUDE P0019956;                /* INNTEKTS-RAPPORTEN         */  00000600
                                                                        00000610
    %PAGE;                                                              00000620
    %INCLUDE S001I9  ;                /* MAP : REGISTRERING         */  00000630
                                                                        00000640
    %PAGE;                                                              00000650
    %INCLUDE P0019906;                /*  TRANS_OPPL_OMR   (BASED)  */  00000660
                                                                        00000670
    %PAGE;                                                              00000680
    %INCLUDE P0019908;                /*  KOM_OMR    (BASED)        */  00000690
                                                                        00000700
    %PAGE;                                                              00000710
    %INCLUDE P0019910;                /*  STYRINGS_OMRÅDE  (BASED)  */  00000720
                                                                        00000730
    %PAGE;                                                              00000740
    %INCLUDE P0019912;                /*  DIV_OMRÅDE (BASED)        */  00000750
                                                                        00000760
    %PAGE;                                                              00000770
    %INCLUDE P0019924;                /*  G_V TABELL                */  00000780
                                                                        00000790
    %PAGE;                                                              00000800
    %INCLUDE P0019925;                /*  G   TABELL                */  00000810
                                                                        00000820
    %PAGE;                                                              00000830
    %INCLUDE DFHBMSCA;                                                  00000840
                                                                        00000850
                                                                        00000860
                                                                        00000870
 /* ***************************************************************** */00000880
 /*                                                                   */00000890
 /*  TRANS-OMRÅDE FOR REG. AV INNTEKT                                 */00000900
 /*  TRANS-LISTE-OMR BRUKES FOR Å OPPBEVARE INNTEKTENE MENS           */00000910
 /*  KONTROLL_INNTEKTENE REGISTRERES.                                 */00000920
 /*                                                                   */00000930
 /* ***************************************************************** */00000940
                                                                        00000950
    DCL 1 TRANS_OMR UNAL BASED(TRANS_PEKER),                            00000960
          3 INNTEKT(16),                                                00000970
            4 FNRNR          FIXED DEC (5),                             00000980
            4 FNR            PIC '(11)9',                               00000990
            4 TYPENR         FIXED DEC (5),                             00001000
            4 TYPE           CHAR(1),                                   00001010
            4 ETYPENR        FIXED DEC (5),                             00001020
            4 ETYPE          CHAR(1),                                   00001030
            4 ÅRNR           FIXED DEC (5),                             00001040
            4 ÅR             PIC '(2)9',                                00001050
            4 ARTNR          FIXED DEC (5),                             00001060
            4 ART            PIC '(1)9',                                00001070
            4 MERKENR        FIXED DEC (5),                             00001080
            4 MERKE          PIC '(1)9',                                00001090
            4 KOMMNRNR       FIXED DEC (5),                             00001100
            4 KOMMNR         PIC '(4)9',                                00001110
            4 PG_INNTEKTNR   FIXED DEC (5),                             00001120
            4 PG_INNTEKT     PIC '(9)9',                                00001130
            4 AGIVKODENR     FIXED DEC (5),                             00001140
            4 AGIVKODE       PIC '(3)9';                                00001150
                                                                        00001160
    DCL 1 TRANS_LISTE_OMR UNAL BASED(TRANS_LISTE_PEKER),                00001170
          3 KTRL_INNTEKT(16),                                           00001180
            4 FNRNR          FIXED DEC (5),                             00001190
            4 FNR            PIC '(11)9',                               00001200
            4 TYPENR         FIXED DEC (5),                             00001210
            4 TYPE           CHAR(1),                                   00001220
            4 ETYPENR        FIXED DEC (5),                             00001230
            4 ETYPE          CHAR(1),                                   00001240
            4 ÅRNR           FIXED DEC (5),                             00001250
            4 ÅR             PIC '(2)9',                                00001260
            4 ARTNR          FIXED DEC (5),                             00001270
            4 ART            PIC '(1)9',                                00001280
            4 MERKENR        FIXED DEC (5),                             00001290
            4 MERKE          PIC '(1)9',                                00001300
            4 KOMMNRNR       FIXED DEC (5),                             00001310
            4 KOMMNR         PIC '(4)9',                                00001320
            4 PG_INNTEKTNR   FIXED DEC (5),                             00001330
            4 PG_INNTEKT     PIC '(9)9',                                00001340
            4 AGIVKODENR     FIXED DEC (5),                             00001350
            4 AGIVKODE       PIC '(3)9';                                00001360
                                                                        00001370
    DCL 1 TRANS_SAVE_OMR UNAL,                                          00001380
          3 SAVE_INNTEKT(16),                                           00001390
            4 FNRNR          FIXED DEC (5),                             00001400
            4 FNR            PIC '(11)9',                               00001410
            4 TYPENR         FIXED DEC (5),                             00001420
            4 TYPE           CHAR(1),                                   00001430
            4 ETYPENR        FIXED DEC (5),                             00001440
            4 ETYPE          CHAR(1),                                   00001450
            4 ÅRNR           FIXED DEC (5),                             00001460
            4 ÅR             PIC '(2)9',                                00001470
            4 ARTNR          FIXED DEC (5),                             00001480
            4 ART            PIC '(1)9',                                00001490
            4 MERKENR        FIXED DEC (5),                             00001500
            4 MERKE          PIC '(1)9',                                00001510
            4 KOMMNRNR       FIXED DEC (5),                             00001520
            4 KOMMNR         PIC '(4)9',                                00001530
            4 PG_INNTEKTNR   FIXED DEC (5),                             00001540
            4 PG_INNTEKT     PIC '(9)9',                                00001550
            4 AGIVKODENR     FIXED DEC (5),                             00001560
            4 AGIVKODE       PIC '(3)9';                                00001570
                                                                        00001580
                                                                        00001590
 /* ***************************************************************** */00001600
 /*   INPUT OMRÅDER FOR G_TAB OG G_V_TAB                              */00001610
 /* ***************************************************************** */00001620
                                                                        00001630
     DCL GRUNN_OMR1          CHAR  (1202);                              00001640
     DCL GRUNN_OMR2          CHAR  (1202);                              00001650
     DCL GRUNN_IDENT         CHAR  ( 8);                                00001660
                                                                        00001670
                                                                        00001680
 /* ***************************************************************** */00001690
 /*   FUNKSJONER, PEKERE                                              */00001700
 /* ***************************************************************** */00001710
                                                                        00001720
    DCL (ADDR, VERIFY, LOW, CSTG, ONCODE, SUBSTR, DATE, TIME,           00001730
         UNSPEC, STG)                                          BUILTIN; 00001740
                                                                        00001750
    DCL BMSMAPBR              POINTER;                                  00001760
    DCL COMMAREA_PEKER        POINTER;                                  00001770
                                                                        00001780
    DCL IN_RBA                POINTER;                                  00001790
                                                                        00001800
                                                                        00001810
 /* ************************************************************** */   00001820
 /*   DATOBEHANDLING                                               */   00001830
 /* ************************************************************** */   00001840
                                                                        00001850
    DCL                                                                 00001860
        01 DATO                  PIC '(6)9';                            00001870
    DCL                                                                 00001880
        01 DATO_REDEF DEF DATO,                                         00001890
           02 DAG                PIC '(2)9',                            00001900
           02 MND                PIC '(2)9',                            00001910
           02 ÅR                 PIC '(2)9';                            00001920
                                                                        00001930
    DCL                                                                 00001940
        01 HDATO                 PIC '(6)9';                            00001950
    DCL                                                                 00001960
        01 HDATO_REDEF DEF HDATO,                                       00001970
           02 ÅR                 PIC '(2)9',                            00001980
           02 MND                PIC '(2)9',                            00001990
           02 DAG                PIC '(2)9';                            00002000
                                                                        00002010
    DCL 1 TID,                                                          00002020
          2 TID1                 CHAR (6), /* TT,MM,.SEK    */          00002030
          2 TID2                 CHAR (3); /* MILL.SEK.     */          00002040
    DCL TID_D     DEFINED   TID  CHAR (9);                              00002050
                                                                        00002060
                                                                        00002070
 /* ************************************************************** */   00002080
 /*  INDEKSER, BRYTERE                                             */   00002090
 /* ************************************************************** */   00002100
                                                                        00002110
    DCL                                                                 00002120
        W01_ULIK                  BIT(1),                               00002130
        W01_STOR                  BIT(1),                               00002140
        FEIL_FUNNET               BIT(1),                               00002150
        FEIL_I_SØKER              BIT(1),                               00002160
        K                         FIXED BIN(15) INIT(0),                00002170
        I                         FIXED BIN(15) INIT(0),                00002180
        FEIL                      FIXED BIN(15) INIT(0),                00002190
        FEIL_I                    FIXED BIN(15) INIT(0);                00002200
                                                                        00002210
                                                                        00002220
 /* ************************************************************** */   00002230
 /*  FELTER FOR MAP-BEHANDLING OG FIL-BEHANDLING                   */   00002240
 /* ************************************************************** */   00002250
                                                                        00002260
    DCL                                                                 00002270
        ONKODE                    PIC'9999',                            00002280
        ONK DEF ONKODE            CHAR(4),                              00002290
        CURSOR_POS                FIXED BIN(15) INIT(-1);               00002300
                                                                        00002310
                                                                        00002320
 /* ************************************************************** */   00002330
 /*  FEILBEHANDLING                                                */   00002340
 /* ************************************************************** */   00002350
                                                                        00002360
    DCL MELDING                   CHAR     (77)      INIT(' ');         00002370
    DCL FEILKODE                  CHAR     ( 4);                        00002380
    DCL DSNAVN                    CHAR     ( 7);                        00002390
    DCL ANT_FEIL_SKREVET          FIXED DEC( 3);                        00002400
                                                                        00002410
                                                                        00002420
                                                                        00002430
 %PAGE;                                                                 00002440
    /* ************************************************************** */00002450
    /*   SLUTT PÅ DEKLARASJONENE .   EKSEKVERINGEN STARTER            */00002460
    /* ************************************************************** */00002470
                                                                        00002480
                                                                        00002490
                                                                        00002500
                                                                        00002510
        ON ERROR SNAP BEGIN     ;                                       00002520
           ON ERROR SYSTEM      ;                                       00002530
           ONKODE=ONCODE        ;                                       00002540
           FEILKODE = 'FEIL'    ;                                       00002550
           DSNAVN = EIBDS       ;                                       00002560
           GO TO FEILBEH        ;                                       00002570
        END;                                                            00002580
                                                                        00002590
        EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                      00002600
                                                                        00002610
        W01_ULIK = '0'B     ;                                           00002620
        W01_STOR = '0'B     ;                                           00002630
        FEILKODE = 'FEIL'   ;                                           00002640
        DSNAVN   = '       ';                                           00002650
                                                                        00002660
        KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER =                           00002670
                                         ADDR(KOM_OMR.DIV_PARAM_OMR);   00002680
                                                                        00002690
        KOM_OMR.PEKER_LISTE.TRANS_LISTE_PEKER =                         00002700
                                         ADDR(KOM_OMR.TRANS_LISTE_OMR); 00002710
        KOM_OMR.PEKER_LISTE.TRANS_PEKER    = ADDR(KOM_OMR.TRANS_OMR);   00002720
        KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER  =                         00002730
                                         ADDR(KOM_OMR.TRANS_OPPL_OMR);  00002740
        KOM_OMR.PEKER_LISTE.STYRINGS_PEKER = ADDR(KOM_OMR.STYRINGS_OMR);00002750
                                                                        00002760
        KOM_OMR.GV_PEKER          = ADDR (GRUNN_OMR1             );     00002770
        KOM_OMR.G_PEKER           = ADDR (GRUNN_OMR2             );     00002780
                                                                        00002790
        GV_TAB_RE       = '' ;                                          00002800
        G_TAB_RE        = '' ;                                          00002810
                                                                        00002820
        GRUNN_IDENT               = 'P0019924';                         00002830
                                                                        00002840
        CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                  00002850
                                                                        00002860
        GRUNN_IDENT               = 'P0019925';                         00002870
                                                                        00002880
        CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                  00002890
                                                                        00002900
        IF FRA_CICS THEN                                                00002910
           DO;                                                          00002920
                                                                        00002930
              TRANS_OMR       = ''   ;     /*  BLANK_INNTEKT      */    00002940
              TRANS_LISTE_OMR = ''   ;     /*  BLANK_KTRL_INNTEKT */    00002950
                                                                        00002960
              FRA_CICS = '0'B;                                          00002970
                                                                        00002980
           END;                                                         00002990
                                                                        00003000
 RECEIVE_MAP:                                                           00003010
                                                                        00003020
        EXEC CICS RECEIVE MAP('S001I09')                                00003030
                                     MAPSET('S001I93') SET(BMSMAPBR);   00003040
        CALL BLANK_MELDNR;                                              00003050
        FEIL_MELD_NR = 0;                                               00003060
                                                                        00003070
        IF S001I09I.FUNKSJONSKODEL > 0 THEN                             00003080
           DO;                                                          00003090
              IF S001I09I.FUNKSJONSKODEI = 'R'    &                     00003100
                 TRANSKODE      = 'RI9C' THEN                           00003110
                 DO;                                                    00003120
                                                                        00003130
                    /* ********************************************** */00003140
                    /* DET FØRSTE REGISTRERINGSBILDET SKRIVES UT      */00003150
                    /* IGJEN.                                         */00003160
                    /* ********************************************** */00003170
                                                                        00003180
                    TRANSKODE = 'RI9B';                                 00003190
                                                                        00003200
                    SAVE_INNTEKT = INNTEKT;                             00003210
                    INNTEKT      = KTRL_INNTEKT;                        00003220
                    KTRL_INNTEKT = SAVE_INNTEKT;                        00003230
                                                                        00003240
                    CALL OVERFØR_INNTEKT_MAP;                           00003250
                                                                        00003260
                    S001I09O.MELDING1O = (77)' ';                       00003270
                    S001I09O.MELDING2O = (77)' ';                       00003280
                    S001I09O.MELDING3O = (77)' ';                       00003290
                    S001I09O.MELDING4O = (77)' ';                       00003300
                    S001I09O.MELDING5O = (77)' ';                       00003310
                    S001I09O.MELDING6O = (77)' ';                       00003320
                                                                        00003330
                                                                        00003340
                    EXEC CICS SEND MAP('S001I09') MAPSET('S001I93')     00003350
                                          DATAONLY ERASEAUP CURSOR;     00003360
                                                                        00003370
                    EXEC CICS RETURN TRANSID(TRANSKODE)                 00003380
                                     COMMAREA(KOM_OMR);                 00003390
                 END;                                                   00003400
                                                                        00003410
              IF S001I09I.FUNKSJONSKODEI = 'X' THEN                     00003420
                 DO;                                                    00003430
                                                                        00003440
                    /* ********************************************** */00003450
                    /* PAUSEBILDET SKRIVES UT                         */00003460
                    /* ********************************************** */00003470
                                                                        00003480
                    EXEC CICS SEND MAP ('S001012') MAPSET ('S001I93')   00003490
                                                   MAPONLY ERASE;       00003500
                    EXEC CICS RETURN;                                   00003510
                 END;                                                   00003520
           END;                                                         00003530
                                                                        00003540
                                                                        00003550
                                                                        00003560
        ANT_FEIL_SKREVET = 0;                                           00003570
        FEIL_FUNNET      = '0'B;                                        00003580
        FEIL_I_SØKER     = '0'B;                                        00003590
                                                                        00003600
        /* ************************************************* */         00003610
        /* OPPLYSNINGENE PÅ BILDET OVERFØRES TIL TRANS_OMR   */         00003620
        /* OG KONTROLLERES.                                  */         00003630
        /* ************************************************* */         00003640
                                                                        00003650
        CALL OVERFØR_INNTEKT;                                           00003660
                                                                        00003670
        CALL KONTROLL_INNTEKT(FEIL_I_SØKER);                            00003680
                                                                        00003690
                                                                        00003700
        IF FEIL_I_SØKER = '0'B THEN                                     00003710
           FEIL_FUNNET = '0'B;                                          00003720
        ELSE                                                            00003730
           FEIL_FUNNET = '1'B;                                          00003740
                                                                        00003750
        IF FEIL_FUNNET THEN                                             00003760
           DO;                                                          00003770
                                                                        00003780
              /* ************************************************* */   00003790
              /* FEIL ER FUNNET. BILDET SENDES UT MED FEIL-        */   00003800
              /* MELDINGER.                                        */   00003810
              /* ************************************************* */   00003820
                                                                        00003830
              CALL OVERFØR_INNTEKT_MAP;                                 00003840
                                                                        00003850
              EXEC CICS SEND MAP('S001I09') MAPSET('S001I93')           00003860
                                          DATAONLY ERASEAUP CURSOR;     00003870
                                                                        00003880
              FEIL_MELD_NR = 666; /* => FEIL_FUNNET ER SATT. */         00003890
                                                                        00003900
           END;                                                         00003910
                                                                        00003920
        ELSE                                                            00003930
           DO;                                                          00003940
                                                                        00003950
              IF TRANSKODE = 'RI9B' THEN                                00003960
                 DO;                                                    00003970
                                                                        00003980
                    /* ******************************************* */   00003990
                    /* DET FØRSTE BILDET ER KONTROLLERT OG FEIL-   */   00004000
                    /* FRITT.  OPPLYSNINGENE FLYTTES OVER I KTRL_  */   00004010
                    /* INNTEKT, OG BILDET GJØRES KLART FOR         */   00004020
                    /* KONTROLLREGISTRERING.                       */   00004030
                    /* ******************************************* */   00004040
                                                                        00004050
                    TRANSKODE = 'RI9C';                                 00004060
                                                                        00004070
                    IF KTRL_INNTEKT.FNR(1) ^= 0 THEN                    00004080
                       DO;                                              00004090
                          SAVE_INNTEKT = INNTEKT;                       00004100
                          INNTEKT      = KTRL_INNTEKT;                  00004110
                          KTRL_INNTEKT = SAVE_INNTEKT;                  00004120
                          CALL OVERFØR_INNTEKT_MAP;                     00004130
                          S001I09O.MELDING1O = 'KONTROLLREGISTRER ' !!  00004140
                                               'INNTEKTENE.';           00004150
                       END;                                             00004160
                    ELSE                                                00004170
                       DO;                                              00004180
                          CALL OVERFØR_INNTEKT_HOPPL_MAP;               00004190
                          KTRL_INNTEKT = INNTEKT;                       00004200
                          INNTEKT = ''    ;                             00004210
                          DO I = 1 TO 16;                               00004220
                             INNTEKT.FNR(I) = KTRL_INNTEKT.FNR(I);      00004230
                          END;                                          00004240
                       END;                                             00004250
                                                                        00004260
        /* FØDSELSNUMMER BLOKKERES FOR REGISTRERING.          */        00004270
                                                                        00004280
                    S001I09O.FNR1A = DFHBMASK;                          00004290
                    S001I09O.FNR2A = DFHBMASK;                          00004300
                    S001I09O.FNR3A = DFHBMASK;                          00004310
                    S001I09O.FNR4A = DFHBMASK;                          00004320
                    S001I09O.FNR5A = DFHBMASK;                          00004330
                    S001I09O.FNR6A = DFHBMASK;                          00004340
                    S001I09O.FNR7A = DFHBMASK;                          00004350
                    S001I09O.FNR8A = DFHBMASK;                          00004360
                    S001I09O.FNR9A = DFHBMASK;                          00004370
                    S001I09O.FNR10A = DFHBMASK;                         00004380
                    S001I09O.FNR11A = DFHBMASK;                         00004390
                    S001I09O.FNR12A = DFHBMASK;                         00004400
                    S001I09O.FNR13A = DFHBMASK;                         00004410
                    S001I09O.FNR14A = DFHBMASK;                         00004420
                    S001I09O.FNR15A = DFHBMASK;                         00004430
                    S001I09O.FNR16A = DFHBMASK;                         00004440
                                                                        00004450
                    EXEC CICS SEND MAP('S001I09') MAPSET('S001I93')     00004460
                                                  MAPONLY ERASE;        00004470
                                                                        00004480
                    EXEC CICS SEND MAP('S001I09') MAPSET('S001I93')     00004490
                                                  DATAONLY CURSOR;      00004500
                                                                        00004510
                 END;                                                   00004520
              ELSE                                                      00004530
                 DO;                                                    00004540
                                                                        00004550
                    /* ******************************************* */   00004560
                    /* DET ANDRE BILDET ER KONTROLLERT OG FEIL-    */   00004570
                    /* FRITT.  DET SJEKKES AT DE TO REGISTRERINGENE*/   00004580
                    /* ER LIKE.  HVIS IKKE SENDES UT FEILMELDING.  */   00004590
                    /* ******************************************* */   00004600
                                                                        00004610
                    DO I = 1 TO 16 WHILE(KTRL_INNTEKT.FNR(I) > 0);      00004620
                       IF KTRL_INNTEKT.TYPE (I)   ^= INNTEKT.TYPE(I)   !00004630
                          KTRL_INNTEKT.ETYPE(I)   ^= INNTEKT.ETYPE(I)  !00004640
                          KTRL_INNTEKT.ÅR (I)     ^= INNTEKT.ÅR (I)    !00004650
                          KTRL_INNTEKT.ART (I)    ^= INNTEKT.ART (I)   !00004660
                          KTRL_INNTEKT.MERKE(I)   ^= INNTEKT.MERKE(I)  !00004670
                          KTRL_INNTEKT.KOMMNR(I)  ^= INNTEKT.KOMMNR(I) !00004680
                          KTRL_INNTEKT.PG_INNTEKT(I) ^=                 00004690
                                                INNTEKT.PG_INNTEKT(I)  !00004700
                          KTRL_INNTEKT.AGIVKODE(I) ^=                   00004710
                                                INNTEKT.AGIVKODE(I) THEN00004720
                          DO;                                           00004730
                             FEIL_I = I;                                00004740
                             W01_ULIK = '1'B;                           00004750
                             I = 16 ;                                   00004760
                          END;                                          00004770
                       ELSE                                             00004780
                          IF KTRL_INNTEKT.PG_INNTEKT(I) > 500000 !      00004790
                             KTRL_INNTEKT.PG_INNTEKT(I) = 500000 THEN   00004800
                             DO;                                        00004810
                                FEIL_I = I;                             00004820
                                W01_STOR = '1'B;                        00004830
                                I = 16 ;                                00004840
                             END;                                       00004850
                    END;                                                00004860
                                                                        00004870
                    IF W01_ULIK !                                       00004880
                       W01_STOR THEN                                    00004890
                       DO;                                              00004900
                          S001I09O.MELDING1O = (77)' ';                 00004910
                          S001I09O.MELDING2O = (77)' ';                 00004920
                          S001I09O.MELDING3O = (77)' ';                 00004930
                          S001I09O.MELDING4O = (77)' ';                 00004940
                          S001I09O.MELDING5O = (77)' ';                 00004950
                          S001I09O.MELDING6O = (77)' ';                 00004960
                                                                        00004970
                          IF W01_ULIK THEN                              00004980
                             IF INNTEKT.PG_INNTEKT(FEIL_I) > 500000 !   00004990
                                INNTEKT.PG_INNTEKT(FEIL_I) =            00005000
                                                         500000 THEN    00005010
                                DO;                                     00005020
                                   S001I09O.MELDING2O =                 00005030
                                                'KONTROLLLINJE ULIK' !! 00005040
                                               ' 1.REGISTRERTE LINJE.'; 00005050
                                                                        00005060
                                   S001I09O.MELDING3O =                 00005070
                                            'KONTROLLER HØY INNTEKT!.'; 00005080
                                END;                                    00005090
                             ELSE                                       00005100
                                S001I09O.MELDING2O =                    00005110
                                                'KONTROLLLINJE ULIK' !! 00005120
                                               ' 1.REGISTRERTE LINJE.'; 00005130
                          ELSE                                          00005140
                             S001I09O.MELDING2O =                       00005150
                                            'KONTROLLER HØY INNTEKT!.'; 00005160
                                                                        00005170
                          CALL SETT_ATTRIBUTTER;                        00005180
                                                                        00005190
                          W01_ULIK = '0'B;                              00005200
  /*                      W01_STOR = '0'B;   */                         00005210
                                                                        00005220
                          TRANSKODE = 'RI9C';                           00005230
                                                                        00005240
                          CALL OVERFØR_INNTEKT_MAP;                     00005250
                                                                        00005260
                          EXEC CICS SEND MAP('S001I09')                 00005270
                                                      MAPSET('S001I93') 00005280
                                                      DATAONLY CURSOR;  00005290
                                                                        00005300
                          TRANSKODE = 'RI9C';                           00005310
                                                                        00005320
  /* TILLEGG 02/01-90 AV TUYEN */                                       00005330
                                                                        00005340
                          IF W01_STOR THEN                              00005350
                             DO;                                        00005360
                                W01_STOR = '0'B;                        00005370
                                EXEC CICS RECEIVE MAP('S001I09')        00005380
                                  MAPSET('S001I93') DATAONLY            00005390
                                  SET(BMSMAPBR);                        00005400
                                GO TO OPPDAT ;                          00005410
                             END;                                       00005420
                       END;                                             00005430
                    ELSE                                                00005440
                       DO;                                              00005450
                                                                        00005460
  OPPDAT:                                                               00005470
  /* TIL HIT */                                                         00005480
                          /* ************************************* */   00005490
                          /* REGISTRERINGENE ER NÅ RIKTIGE.        */   00005500
                          /* OPPDATER_FILER FORETAR VIDERE BEHAND- */   00005510
                          /* LING.  KLAR FOR NY REGISTRERING.      */   00005520
                          /* ************************************* */   00005530
                                                                        00005540
                          CALL OPPDATER_FILER;                          00005550
                                                                        00005560
                          EXEC CICS SEND MAP('S001I09')                 00005570
                                         MAPSET('S001I93')              00005580
                                         MAPONLY ERASE;                 00005590
                                                                        00005600
                          FRA_CICS     = '1'B;                          00005610
                          TRANSKODE    = 'RI9B';                        00005620
                       END;                                             00005630
                 END;                                                   00005640
           END;                                                         00005650
                                                                        00005660
        EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);          00005670
                                                                        00005680
                                                                        00005690
 FEILBEH:                                                               00005700
                                                                        00005710
        EXEC CICS HANDLE CONDITION ERROR(ABEND);                        00005720
                                                                        00005730
        PROGRAM_ID = 'R001I903';                                        00005740
                                                                        00005750
        ALLOCATE S001I09O;                                              00005760
                                                                        00005770
        S001I09O.MELDING2O =                                            00005780
                                                                        00005790
                 'F E I L  H A R  O P P S T Å T T ! ! !.';              00005800
                                                                        00005810
        S001I09O.MELDING3O =                                            00005820
                 'EIBRCODE : ' !! UNSPEC(EIBRCODE);                     00005830
                                                                        00005840
        S001I09O.MELDING4O =                                            00005850
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00005860
                                         !! '. DATASETT : ' !! DSNAVN;  00005870
                                                                        00005880
        S001I09O.MELDING5O =                                            00005890
                      'PROGRAMNAVN :  ' !! PROGRAM_ID !!                00005900
                      '.INGEN OPPDATERING ER BLITT UTFØRT.';            00005910
                                                                        00005920
        S001I09O.MELDING6O =                                            00005930
                      'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';        00005940
                                                                        00005950
                                                                        00005960
        EXEC CICS SEND MAP('S001I09')               MAPSET('S001I93');  00005970
                                                                        00005980
        EXEC CICS RECEIVE MAP('S001I09')                                00005990
                                       MAPSET('S001I93') SET(BMSMAPBR); 00006000
                                                                        00006010
                                                                        00006020
        EXEC CICS SYNCPOINT ROLLBACK;                                   00006030
                                                                        00006040
                                                                        00006050
        TERMINERINGS_IND = 'F';                                         00006060
                                                                        00006070
                                                                        00006080
 ABEND:                                                                 00006090
        EXEC CICS ABEND ABCODE(FEIL);                                   00006100
                                                                        00006110
                                                                        00006120
 /* ***************************************************************** */00006130
 /*           I N T E R N E     P R O C E D U R E R                   */00006140
 /* ***************************************************************** */00006150
                                                                        00006160
                                                                        00006170
 /* ***************************************************************** */00006180
 /* SETTER CURSOR PÅ DEN LINJEN SOM ER FEIL                           */00006190
 /* ***************************************************************** */00006200
 SETT_ATTRIBUTTER: PROC;                                                00006210
                                                                        00006220
        SELECT (FEIL_I);                                                00006230
           WHEN (1)                                                     00006240
              S001I09I.TYPE1L = CURSOR_POS;                             00006250
           WHEN (2)                                                     00006260
              S001I09I.TYPE2L = CURSOR_POS;                             00006270
           WHEN (3)                                                     00006280
              S001I09I.TYPE3L = CURSOR_POS;                             00006290
           WHEN (4)                                                     00006300
              S001I09I.TYPE4L = CURSOR_POS;                             00006310
           WHEN (5)                                                     00006320
              S001I09I.TYPE5L = CURSOR_POS;                             00006330
           WHEN (6)                                                     00006340
              S001I09I.TYPE6L = CURSOR_POS;                             00006350
           WHEN (7)                                                     00006360
              S001I09I.TYPE7L = CURSOR_POS;                             00006370
           WHEN (8)                                                     00006380
              S001I09I.TYPE8L = CURSOR_POS;                             00006390
           WHEN (9)                                                     00006400
              S001I09I.TYPE9L = CURSOR_POS;                             00006410
           WHEN (10)                                                    00006420
              S001I09I.TYPE10L = CURSOR_POS;                            00006430
           WHEN (11)                                                    00006440
              S001I09I.TYPE11L = CURSOR_POS;                            00006450
           WHEN (12)                                                    00006460
              S001I09I.TYPE12L = CURSOR_POS;                            00006470
           WHEN (13)                                                    00006480
              S001I09I.TYPE13L = CURSOR_POS;                            00006490
           WHEN (14)                                                    00006500
              S001I09I.TYPE14L = CURSOR_POS;                            00006510
           WHEN (15)                                                    00006520
              S001I09I.TYPE15L = CURSOR_POS;                            00006530
           WHEN (16)                                                    00006540
              S001I09I.TYPE16L = CURSOR_POS;                            00006550
           OTHERWISE;                                                   00006560
        END;                                                            00006570
    END SETT_ATTRIBUTTER;                                               00006580
                                                                        00006590
 %PAGE;                                                                 00006600
 /* ***************************************************************** */00006610
 /*                                                                   */00006620
 /* PROSEDYREN OVERFØRER OPPL. OM INNT FRA SKJERMBILDET TIL           */00006630
 /*    TRANS_OMR I KOM_OMR.                                           */00006640
 /*                                                                   */00006650
 /* ***************************************************************** */00006660
 OVERFØR_INNTEKT:                                                       00006670
    PROC;                                                               00006680
                                                                        00006690
    DCL (TELL1,TELL2) FIXED BIN(15);                                    00006700
                                                                        00006710
        IF FNR1L > 0 THEN                                               00006720
           INNTEKT.FNR(1) = F_FELT_CHAR_PIC11(FNR1O);                   00006730
                                                                        00006740
        IF FNR2L > 0 THEN                                               00006750
           INNTEKT.FNR(2) = F_FELT_CHAR_PIC11(FNR2O);                   00006760
                                                                        00006770
        IF FNR3L > 0 THEN                                               00006780
           INNTEKT.FNR(3) = F_FELT_CHAR_PIC11(FNR3O);                   00006790
                                                                        00006800
        IF FNR4L > 0 THEN                                               00006810
           INNTEKT.FNR(4) = F_FELT_CHAR_PIC11(FNR4O);                   00006820
                                                                        00006830
        IF FNR5L > 0 THEN                                               00006840
           INNTEKT.FNR(5) = F_FELT_CHAR_PIC11(FNR5O);                   00006850
                                                                        00006860
        IF FNR6L > 0 THEN                                               00006870
           INNTEKT.FNR(6) = F_FELT_CHAR_PIC11(FNR6O);                   00006880
                                                                        00006890
        IF FNR7L > 0 THEN                                               00006900
           INNTEKT.FNR(7) = F_FELT_CHAR_PIC11(FNR7O);                   00006910
                                                                        00006920
        IF FNR8L > 0 THEN                                               00006930
           INNTEKT.FNR(8) = F_FELT_CHAR_PIC11(FNR8O);                   00006940
                                                                        00006950
        IF FNR9L > 0 THEN                                               00006960
           INNTEKT.FNR(9) = F_FELT_CHAR_PIC11(FNR9O);                   00006970
                                                                        00006980
        IF FNR10L > 0 THEN                                              00006990
           INNTEKT.FNR(10) = F_FELT_CHAR_PIC11(FNR10O);                 00007000
                                                                        00007010
        IF FNR11L > 0 THEN                                              00007020
           INNTEKT.FNR(11) = F_FELT_CHAR_PIC11(FNR11O);                 00007030
                                                                        00007040
        IF FNR12L > 0 THEN                                              00007050
           INNTEKT.FNR(12) = F_FELT_CHAR_PIC11(FNR12O);                 00007060
                                                                        00007070
        IF FNR13L > 0 THEN                                              00007080
           INNTEKT.FNR(13) = F_FELT_CHAR_PIC11(FNR13O);                 00007090
                                                                        00007100
        IF FNR14L > 0 THEN                                              00007110
           INNTEKT.FNR(14) = F_FELT_CHAR_PIC11(FNR14O);                 00007120
                                                                        00007130
        IF FNR15L > 0 THEN                                              00007140
           INNTEKT.FNR(15) = F_FELT_CHAR_PIC11(FNR15O);                 00007150
                                                                        00007160
        IF FNR16L > 0 THEN                                              00007170
           INNTEKT.FNR(16) = F_FELT_CHAR_PIC11(FNR16O);                 00007180
                                                                        00007190
                                                                        00007200
                                                                        00007210
                                                                        00007220
        IF TYPE1L > 0 THEN                                              00007230
           INNTEKT.TYPE(1) = TYPE1O;                                    00007240
                                                                        00007250
        IF TYPE2L > 0 THEN                                              00007260
           INNTEKT.TYPE(2) = TYPE2O;                                    00007270
                                                                        00007280
        IF TYPE3L > 0 THEN                                              00007290
           INNTEKT.TYPE(3) = TYPE3O;                                    00007300
                                                                        00007310
        IF TYPE4L > 0 THEN                                              00007320
           INNTEKT.TYPE(4) = TYPE4O;                                    00007330
                                                                        00007340
        IF TYPE5L > 0 THEN                                              00007350
           INNTEKT.TYPE(5) = TYPE5O;                                    00007360
                                                                        00007370
        IF TYPE6L > 0 THEN                                              00007380
           INNTEKT.TYPE(6) = TYPE6O;                                    00007390
                                                                        00007400
        IF TYPE7L > 0 THEN                                              00007410
           INNTEKT.TYPE(7) = TYPE7O;                                    00007420
                                                                        00007430
        IF TYPE8L > 0 THEN                                              00007440
           INNTEKT.TYPE(8) = TYPE8O;                                    00007450
                                                                        00007460
        IF TYPE9L > 0 THEN                                              00007470
           INNTEKT.TYPE(9) = TYPE9O;                                    00007480
                                                                        00007490
        IF TYPE10L > 0 THEN                                             00007500
           INNTEKT.TYPE(10) = TYPE10O;                                  00007510
                                                                        00007520
        IF TYPE11L > 0 THEN                                             00007530
           INNTEKT.TYPE(11) = TYPE11O;                                  00007540
                                                                        00007550
        IF TYPE12L > 0 THEN                                             00007560
           INNTEKT.TYPE(12) = TYPE12O;                                  00007570
                                                                        00007580
        IF TYPE13L > 0 THEN                                             00007590
           INNTEKT.TYPE(13) = TYPE13O;                                  00007600
                                                                        00007610
        IF TYPE14L > 0 THEN                                             00007620
           INNTEKT.TYPE(14) = TYPE14O;                                  00007630
                                                                        00007640
        IF TYPE15L > 0 THEN                                             00007650
           INNTEKT.TYPE(15) = TYPE15O;                                  00007660
                                                                        00007670
        IF TYPE16L > 0 THEN                                             00007680
           INNTEKT.TYPE(16) = TYPE16O;                                  00007690
                                                                        00007700
                                                                        00007710
                                                                        00007720
                                                                        00007730
        IF ETYPE1L > 0 THEN                                             00007740
           INNTEKT.ETYPE(1) = ETYPE1O;                                  00007750
                                                                        00007760
        IF ETYPE2L > 0 THEN                                             00007770
           INNTEKT.ETYPE(2) = ETYPE2O;                                  00007780
                                                                        00007790
        IF ETYPE3L > 0 THEN                                             00007800
           INNTEKT.ETYPE(3) = ETYPE3O;                                  00007810
                                                                        00007820
        IF ETYPE4L > 0 THEN                                             00007830
           INNTEKT.ETYPE(4) = ETYPE4O;                                  00007840
                                                                        00007850
        IF ETYPE5L > 0 THEN                                             00007860
           INNTEKT.ETYPE(5) = ETYPE5O;                                  00007870
                                                                        00007880
        IF ETYPE6L > 0 THEN                                             00007890
           INNTEKT.ETYPE(6) = ETYPE6O;                                  00007900
                                                                        00007910
        IF ETYPE7L > 0 THEN                                             00007920
           INNTEKT.ETYPE(7) = ETYPE7O;                                  00007930
                                                                        00007940
        IF ETYPE8L > 0 THEN                                             00007950
           INNTEKT.ETYPE(8) = ETYPE8O;                                  00007960
                                                                        00007970
        IF ETYPE9L > 0 THEN                                             00007980
           INNTEKT.ETYPE(9) = ETYPE9O;                                  00007990
                                                                        00008000
        IF ETYPE10L > 0 THEN                                            00008010
           INNTEKT.ETYPE(10) = ETYPE10O;                                00008020
                                                                        00008030
        IF ETYPE11L > 0 THEN                                            00008040
           INNTEKT.ETYPE(11) = ETYPE11O;                                00008050
                                                                        00008060
        IF ETYPE12L > 0 THEN                                            00008070
           INNTEKT.ETYPE(12) = ETYPE12O;                                00008080
                                                                        00008090
        IF ETYPE13L > 0 THEN                                            00008100
           INNTEKT.ETYPE(13) = ETYPE13O;                                00008110
                                                                        00008120
        IF ETYPE14L > 0 THEN                                            00008130
           INNTEKT.ETYPE(14) = ETYPE14O;                                00008140
                                                                        00008150
        IF ETYPE15L > 0 THEN                                            00008160
           INNTEKT.ETYPE(15) = ETYPE15O;                                00008170
                                                                        00008180
        IF ETYPE16L > 0 THEN                                            00008190
           INNTEKT.ETYPE(16) = ETYPE16O;                                00008200
                                                                        00008210
                                                                        00008220
                                                                        00008230
                                                                        00008240
        IF ÅR1L > 0 THEN                                                00008250
           INNTEKT.ÅR(1) =                                              00008260
                       F_FELT_CHAR_PIC2(ÅR1O);                          00008270
                                                                        00008280
        IF ÅR2L > 0 THEN                                                00008290
           INNTEKT.ÅR(2) =                                              00008300
                       F_FELT_CHAR_PIC2(ÅR2O);                          00008310
                                                                        00008320
        IF ÅR3L > 0 THEN                                                00008330
           INNTEKT.ÅR(3) =                                              00008340
                       F_FELT_CHAR_PIC2(ÅR3O);                          00008350
                                                                        00008360
        IF ÅR4L > 0 THEN                                                00008370
           INNTEKT.ÅR(4) =                                              00008380
                       F_FELT_CHAR_PIC2(ÅR4O);                          00008390
                                                                        00008400
        IF ÅR5L > 0 THEN                                                00008410
           INNTEKT.ÅR(5) =                                              00008420
                       F_FELT_CHAR_PIC2(ÅR5O);                          00008430
                                                                        00008440
        IF ÅR6L > 0 THEN                                                00008450
           INNTEKT.ÅR(6) =                                              00008460
                       F_FELT_CHAR_PIC2(ÅR6O);                          00008470
                                                                        00008480
        IF ÅR7L > 0 THEN                                                00008490
           INNTEKT.ÅR(7) =                                              00008500
                       F_FELT_CHAR_PIC2(ÅR7O);                          00008510
                                                                        00008520
        IF ÅR8L > 0 THEN                                                00008530
           INNTEKT.ÅR(8) =                                              00008540
                       F_FELT_CHAR_PIC2(ÅR8O);                          00008550
                                                                        00008560
        IF ÅR9L > 0 THEN                                                00008570
           INNTEKT.ÅR(9) =                                              00008580
                       F_FELT_CHAR_PIC2(ÅR9O);                          00008590
                                                                        00008600
        IF ÅR10L > 0 THEN                                               00008610
           INNTEKT.ÅR(10) =                                             00008620
                       F_FELT_CHAR_PIC2(ÅR10O);                         00008630
                                                                        00008640
        IF ÅR11L > 0 THEN                                               00008650
           INNTEKT.ÅR(11) =                                             00008660
                       F_FELT_CHAR_PIC2(ÅR11O);                         00008670
                                                                        00008680
        IF ÅR12L > 0 THEN                                               00008690
           INNTEKT.ÅR(12) =                                             00008700
                       F_FELT_CHAR_PIC2(ÅR12O);                         00008710
                                                                        00008720
        IF ÅR13L > 0 THEN                                               00008730
           INNTEKT.ÅR(13) =                                             00008740
                       F_FELT_CHAR_PIC2(ÅR13O);                         00008750
                                                                        00008760
        IF ÅR14L > 0 THEN                                               00008770
           INNTEKT.ÅR(14) =                                             00008780
                       F_FELT_CHAR_PIC2(ÅR14O);                         00008790
                                                                        00008800
        IF ÅR15L > 0 THEN                                               00008810
           INNTEKT.ÅR(15) =                                             00008820
                       F_FELT_CHAR_PIC2(ÅR15O);                         00008830
                                                                        00008840
        IF ÅR16L > 0 THEN                                               00008850
           INNTEKT.ÅR(16) =                                             00008860
                       F_FELT_CHAR_PIC2(ÅR16O);                         00008870
                                                                        00008880
                                                                        00008890
                                                                        00008900
                                                                        00008910
        IF ART1L > 0 THEN                                               00008920
           INNTEKT.ART(1) =                                             00008930
                       F_FELT_CHAR_PIC1(ART1O);                         00008940
                                                                        00008950
        IF ART2L > 0 THEN                                               00008960
           INNTEKT.ART(2) =                                             00008970
                       F_FELT_CHAR_PIC1(ART2O);                         00008980
                                                                        00008990
        IF ART3L > 0 THEN                                               00009000
           INNTEKT.ART(3) =                                             00009010
                       F_FELT_CHAR_PIC1(ART3O);                         00009020
                                                                        00009030
        IF ART4L > 0 THEN                                               00009040
           INNTEKT.ART(4) =                                             00009050
                       F_FELT_CHAR_PIC1(ART4O);                         00009060
                                                                        00009070
        IF ART5L > 0 THEN                                               00009080
           INNTEKT.ART(5) =                                             00009090
                       F_FELT_CHAR_PIC1(ART5O);                         00009100
                                                                        00009110
        IF ART6L > 0 THEN                                               00009120
           INNTEKT.ART(6) =                                             00009130
                       F_FELT_CHAR_PIC1(ART6O);                         00009140
                                                                        00009150
        IF ART7L > 0 THEN                                               00009160
           INNTEKT.ART(7) =                                             00009170
                       F_FELT_CHAR_PIC1(ART7O);                         00009180
                                                                        00009190
        IF ART8L > 0 THEN                                               00009200
           INNTEKT.ART(8) =                                             00009210
                       F_FELT_CHAR_PIC1(ART8O);                         00009220
                                                                        00009230
        IF ART9L > 0 THEN                                               00009240
           INNTEKT.ART(9) =                                             00009250
                       F_FELT_CHAR_PIC1(ART9O);                         00009260
                                                                        00009270
        IF ART10L > 0 THEN                                              00009280
           INNTEKT.ART(10) =                                            00009290
                       F_FELT_CHAR_PIC1(ART10O);                        00009300
                                                                        00009310
        IF ART11L > 0 THEN                                              00009320
           INNTEKT.ART(11) =                                            00009330
                       F_FELT_CHAR_PIC1(ART11O);                        00009340
                                                                        00009350
        IF ART12L > 0 THEN                                              00009360
           INNTEKT.ART(12) =                                            00009370
                       F_FELT_CHAR_PIC1(ART12O);                        00009380
                                                                        00009390
        IF ART13L > 0 THEN                                              00009400
           INNTEKT.ART(13) =                                            00009410
                       F_FELT_CHAR_PIC1(ART13O);                        00009420
                                                                        00009430
        IF ART14L > 0 THEN                                              00009440
           INNTEKT.ART(14) =                                            00009450
                       F_FELT_CHAR_PIC1(ART14O);                        00009460
                                                                        00009470
        IF ART15L > 0 THEN                                              00009480
           INNTEKT.ART(15) =                                            00009490
                       F_FELT_CHAR_PIC1(ART15O);                        00009500
                                                                        00009510
        IF ART16L > 0 THEN                                              00009520
           INNTEKT.ART(16) =                                            00009530
                       F_FELT_CHAR_PIC1(ART16O);                        00009540
                                                                        00009550
                                                                        00009560
                                                                        00009570
                                                                        00009580
        IF MERKE1L > 0 THEN                                             00009590
           INNTEKT.MERKE(1) =                                           00009600
                       F_FELT_CHAR_PIC1(MERKE1O);                       00009610
                                                                        00009620
        IF MERKE2L > 0 THEN                                             00009630
           INNTEKT.MERKE(2) =                                           00009640
                       F_FELT_CHAR_PIC1(MERKE2O);                       00009650
                                                                        00009660
        IF MERKE3L > 0 THEN                                             00009670
           INNTEKT.MERKE(3) =                                           00009680
                       F_FELT_CHAR_PIC1(MERKE3O);                       00009690
                                                                        00009700
        IF MERKE4L > 0 THEN                                             00009710
           INNTEKT.MERKE(4) =                                           00009720
                       F_FELT_CHAR_PIC1(MERKE4O);                       00009730
                                                                        00009740
        IF MERKE5L > 0 THEN                                             00009750
           INNTEKT.MERKE(5) =                                           00009760
                       F_FELT_CHAR_PIC1(MERKE5O);                       00009770
                                                                        00009780
        IF MERKE6L > 0 THEN                                             00009790
           INNTEKT.MERKE(6) =                                           00009800
                       F_FELT_CHAR_PIC1(MERKE6O);                       00009810
                                                                        00009820
        IF MERKE7L > 0 THEN                                             00009830
           INNTEKT.MERKE(7) =                                           00009840
                       F_FELT_CHAR_PIC1(MERKE7O);                       00009850
                                                                        00009860
        IF MERKE8L > 0 THEN                                             00009870
           INNTEKT.MERKE(8) =                                           00009880
                       F_FELT_CHAR_PIC1(MERKE8O);                       00009890
                                                                        00009900
        IF MERKE9L > 0 THEN                                             00009910
           INNTEKT.MERKE(9) =                                           00009920
                       F_FELT_CHAR_PIC1(MERKE9O);                       00009930
                                                                        00009940
        IF MERKE10L > 0 THEN                                            00009950
           INNTEKT.MERKE(10) =                                          00009960
                       F_FELT_CHAR_PIC1(MERKE10O);                      00009970
                                                                        00009980
        IF MERKE11L > 0 THEN                                            00009990
           INNTEKT.MERKE(11) =                                          00010000
                       F_FELT_CHAR_PIC1(MERKE11O);                      00010010
                                                                        00010020
        IF MERKE12L > 0 THEN                                            00010030
           INNTEKT.MERKE(12) =                                          00010040
                       F_FELT_CHAR_PIC1(MERKE12O);                      00010050
                                                                        00010060
        IF MERKE13L > 0 THEN                                            00010070
           INNTEKT.MERKE(13) =                                          00010080
                       F_FELT_CHAR_PIC1(MERKE13O);                      00010090
                                                                        00010100
        IF MERKE14L > 0 THEN                                            00010110
           INNTEKT.MERKE(14) =                                          00010120
                       F_FELT_CHAR_PIC1(MERKE14O);                      00010130
                                                                        00010140
        IF MERKE15L > 0 THEN                                            00010150
           INNTEKT.MERKE(15) =                                          00010160
                       F_FELT_CHAR_PIC1(MERKE15O);                      00010170
                                                                        00010180
        IF MERKE16L > 0 THEN                                            00010190
           INNTEKT.MERKE(16) =                                          00010200
                       F_FELT_CHAR_PIC1(MERKE16O);                      00010210
                                                                        00010220
                                                                        00010230
                                                                        00010240
                                                                        00010250
        IF KOMMNR1L > 0 THEN                                            00010260
           INNTEKT.KOMMNR(1) =                                          00010270
                       F_FELT_CHAR_PIC4(KOMMNR1O);                      00010280
                                                                        00010290
        IF KOMMNR2L > 0 THEN                                            00010300
           INNTEKT.KOMMNR(2) =                                          00010310
                       F_FELT_CHAR_PIC4(KOMMNR2O);                      00010320
                                                                        00010330
        IF KOMMNR3L > 0 THEN                                            00010340
           INNTEKT.KOMMNR(3) =                                          00010350
                       F_FELT_CHAR_PIC4(KOMMNR3O);                      00010360
                                                                        00010370
        IF KOMMNR4L > 0 THEN                                            00010380
           INNTEKT.KOMMNR(4) =                                          00010390
                       F_FELT_CHAR_PIC4(KOMMNR4O);                      00010400
                                                                        00010410
        IF KOMMNR5L > 0 THEN                                            00010420
           INNTEKT.KOMMNR(5) =                                          00010430
                       F_FELT_CHAR_PIC4(KOMMNR5O);                      00010440
                                                                        00010450
        IF KOMMNR6L > 0 THEN                                            00010460
           INNTEKT.KOMMNR(6) =                                          00010470
                       F_FELT_CHAR_PIC4(KOMMNR6O);                      00010480
                                                                        00010490
        IF KOMMNR7L > 0 THEN                                            00010500
           INNTEKT.KOMMNR(7) =                                          00010510
                       F_FELT_CHAR_PIC4(KOMMNR7O);                      00010520
                                                                        00010530
        IF KOMMNR8L > 0 THEN                                            00010540
           INNTEKT.KOMMNR(8) =                                          00010550
                       F_FELT_CHAR_PIC4(KOMMNR8O);                      00010560
                                                                        00010570
        IF KOMMNR9L > 0 THEN                                            00010580
           INNTEKT.KOMMNR(9) =                                          00010590
                       F_FELT_CHAR_PIC4(KOMMNR9O);                      00010600
                                                                        00010610
        IF KOMMNR10L > 0 THEN                                           00010620
           INNTEKT.KOMMNR(10) =                                         00010630
                       F_FELT_CHAR_PIC4(KOMMNR10O);                     00010640
                                                                        00010650
        IF KOMMNR11L > 0 THEN                                           00010660
           INNTEKT.KOMMNR(11) =                                         00010670
                       F_FELT_CHAR_PIC4(KOMMNR11O);                     00010680
                                                                        00010690
        IF KOMMNR12L > 0 THEN                                           00010700
           INNTEKT.KOMMNR(12) =                                         00010710
                       F_FELT_CHAR_PIC4(KOMMNR12O);                     00010720
                                                                        00010730
        IF KOMMNR13L > 0 THEN                                           00010740
           INNTEKT.KOMMNR(13) =                                         00010750
                       F_FELT_CHAR_PIC4(KOMMNR13O);                     00010760
                                                                        00010770
        IF KOMMNR14L > 0 THEN                                           00010780
           INNTEKT.KOMMNR(14) =                                         00010790
                       F_FELT_CHAR_PIC4(KOMMNR14O);                     00010800
                                                                        00010810
        IF KOMMNR15L > 0 THEN                                           00010820
           INNTEKT.KOMMNR(15) =                                         00010830
                       F_FELT_CHAR_PIC4(KOMMNR15O);                     00010840
                                                                        00010850
        IF KOMMNR16L > 0 THEN                                           00010860
           INNTEKT.KOMMNR(16) =                                         00010870
                       F_FELT_CHAR_PIC4(KOMMNR16O);                     00010880
                                                                        00010890
                                                                        00010900
                                                                        00010910
                                                                        00010920
        IF INNTEKT1L > 0 THEN                                           00010930
           INNTEKT.PG_INNTEKT(1) =                                      00010940
                       F_FELT_CHAR_PIC9(INNTEKT1I);                     00010950
                                                                        00010960
        IF INNTEKT2L > 0 THEN                                           00010970
           INNTEKT.PG_INNTEKT(2) =                                      00010980
                       F_FELT_CHAR_PIC9(INNTEKT2I);                     00010990
                                                                        00011000
        IF INNTEKT3L > 0 THEN                                           00011010
           INNTEKT.PG_INNTEKT(3) =                                      00011020
                       F_FELT_CHAR_PIC9(INNTEKT3I);                     00011030
                                                                        00011040
        IF INNTEKT4L > 0 THEN                                           00011050
           INNTEKT.PG_INNTEKT(4) =                                      00011060
                       F_FELT_CHAR_PIC9(INNTEKT4I);                     00011070
                                                                        00011080
        IF INNTEKT5L > 0 THEN                                           00011090
           INNTEKT.PG_INNTEKT(5) =                                      00011100
                       F_FELT_CHAR_PIC9(INNTEKT5I);                     00011110
                                                                        00011120
        IF INNTEKT6L > 0 THEN                                           00011130
           INNTEKT.PG_INNTEKT(6) =                                      00011140
                       F_FELT_CHAR_PIC9(INNTEKT6I);                     00011150
                                                                        00011160
        IF INNTEKT7L > 0 THEN                                           00011170
           INNTEKT.PG_INNTEKT(7) =                                      00011180
                       F_FELT_CHAR_PIC9(INNTEKT7I);                     00011190
                                                                        00011200
        IF INNTEKT8L > 0 THEN                                           00011210
           INNTEKT.PG_INNTEKT(8) =                                      00011220
                       F_FELT_CHAR_PIC9(INNTEKT8I);                     00011230
                                                                        00011240
        IF INNTEKT9L > 0 THEN                                           00011250
           INNTEKT.PG_INNTEKT(9) =                                      00011260
                       F_FELT_CHAR_PIC9(INNTEKT9I);                     00011270
                                                                        00011280
        IF INNTEKT10L > 0 THEN                                          00011290
           INNTEKT.PG_INNTEKT(10) =                                     00011300
                       F_FELT_CHAR_PIC9(INNTEKT10I);                    00011310
                                                                        00011320
        IF INNTEKT11L > 0 THEN                                          00011330
           INNTEKT.PG_INNTEKT(11) =                                     00011340
                       F_FELT_CHAR_PIC9(INNTEKT11I);                    00011350
                                                                        00011360
        IF INNTEKT12L > 0 THEN                                          00011370
           INNTEKT.PG_INNTEKT(12) =                                     00011380
                       F_FELT_CHAR_PIC9(INNTEKT12I);                    00011390
                                                                        00011400
        IF INNTEKT13L > 0 THEN                                          00011410
           INNTEKT.PG_INNTEKT(13) =                                     00011420
                       F_FELT_CHAR_PIC9(INNTEKT13I);                    00011430
                                                                        00011440
        IF INNTEKT14L > 0 THEN                                          00011450
           INNTEKT.PG_INNTEKT(14) =                                     00011460
                       F_FELT_CHAR_PIC9(INNTEKT14I);                    00011470
                                                                        00011480
        IF INNTEKT15L > 0 THEN                                          00011490
           INNTEKT.PG_INNTEKT(15) =                                     00011500
                       F_FELT_CHAR_PIC9(INNTEKT15I);                    00011510
                                                                        00011520
        IF INNTEKT16L > 0 THEN                                          00011530
           INNTEKT.PG_INNTEKT(16) =                                     00011540
                       F_FELT_CHAR_PIC9(INNTEKT16I);                    00011550
                                                                        00011560
                                                                        00011570
                                                                        00011580
                                                                        00011590
        IF AGIVKODE1L > 0 THEN                                          00011600
           INNTEKT.AGIVKODE(1) =                                        00011610
                       F_FELT_CHAR_PIC3(AGIVKODE1I);                    00011620
                                                                        00011630
        IF AGIVKODE2L > 0 THEN                                          00011640
           INNTEKT.AGIVKODE(2) =                                        00011650
                       F_FELT_CHAR_PIC3(AGIVKODE2I);                    00011660
                                                                        00011670
        IF AGIVKODE3L > 0 THEN                                          00011680
           INNTEKT.AGIVKODE(3) =                                        00011690
                       F_FELT_CHAR_PIC3(AGIVKODE3I);                    00011700
                                                                        00011710
        IF AGIVKODE4L > 0 THEN                                          00011720
           INNTEKT.AGIVKODE(4) =                                        00011730
                       F_FELT_CHAR_PIC3(AGIVKODE4I);                    00011740
                                                                        00011750
        IF AGIVKODE5L > 0 THEN                                          00011760
           INNTEKT.AGIVKODE(5) =                                        00011770
                       F_FELT_CHAR_PIC3(AGIVKODE5I);                    00011780
                                                                        00011790
        IF AGIVKODE6L > 0 THEN                                          00011800
           INNTEKT.AGIVKODE(6) =                                        00011810
                       F_FELT_CHAR_PIC3(AGIVKODE6I);                    00011820
                                                                        00011830
        IF AGIVKODE7L > 0 THEN                                          00011840
           INNTEKT.AGIVKODE(7) =                                        00011850
                       F_FELT_CHAR_PIC3(AGIVKODE7I);                    00011860
                                                                        00011870
        IF AGIVKODE8L > 0 THEN                                          00011880
           INNTEKT.AGIVKODE(8) =                                        00011890
                       F_FELT_CHAR_PIC3(AGIVKODE8I);                    00011900
                                                                        00011910
        IF AGIVKODE9L > 0 THEN                                          00011920
           INNTEKT.AGIVKODE(9) =                                        00011930
                       F_FELT_CHAR_PIC3(AGIVKODE9I);                    00011940
                                                                        00011950
        IF AGIVKODE10L > 0 THEN                                         00011960
           INNTEKT.AGIVKODE(10) =                                       00011970
                       F_FELT_CHAR_PIC3(AGIVKODE10I);                   00011980
                                                                        00011990
        IF AGIVKODE11L > 0 THEN                                         00012000
           INNTEKT.AGIVKODE(11) =                                       00012010
                       F_FELT_CHAR_PIC3(AGIVKODE11I);                   00012020
                                                                        00012030
        IF AGIVKODE12L > 0 THEN                                         00012040
           INNTEKT.AGIVKODE(12) =                                       00012050
                       F_FELT_CHAR_PIC3(AGIVKODE12I);                   00012060
                                                                        00012070
        IF AGIVKODE13L > 0 THEN                                         00012080
           INNTEKT.AGIVKODE(13) =                                       00012090
                       F_FELT_CHAR_PIC3(AGIVKODE13I);                   00012100
                                                                        00012110
        IF AGIVKODE14L > 0 THEN                                         00012120
           INNTEKT.AGIVKODE(14) =                                       00012130
                       F_FELT_CHAR_PIC3(AGIVKODE14I);                   00012140
                                                                        00012150
        IF AGIVKODE15L > 0 THEN                                         00012160
           INNTEKT.AGIVKODE(15) =                                       00012170
                       F_FELT_CHAR_PIC3(AGIVKODE15I);                   00012180
                                                                        00012190
        IF AGIVKODE16L > 0 THEN                                         00012200
           INNTEKT.AGIVKODE(16) =                                       00012210
                       F_FELT_CHAR_PIC3(AGIVKODE16I);                   00012220
                                                                        00012230
   /* HER NULLER EN TABELLEN ETTER DET FØRSTE ELEMENT SOM ER NULL */    00012240
                                                                        00012250
        DO TELL1 = 1 TO 16 UNTIL                                        00012260
              (F_FELT_PIC_CHAR11(INNTEKT.FNR(TELL1)) = '00000000000');  00012270
        END;                                                            00012280
                                                                        00012290
        DO TELL2 = TELL1 TO 16;                                         00012300
           INNTEKT.FNR (TELL2)       = 0;                               00012310
           INNTEKT.ÅR  (TELL2)       = 0;                               00012320
           INNTEKT.TYPE (TELL2)      = ' ';                             00012330
           INNTEKT.ETYPE (TELL2)     = ' ';                             00012340
           INNTEKT.ART (TELL2)       = 0;                               00012350
           INNTEKT.MERKE (TELL2)     = 0;                               00012360
           INNTEKT.KOMMNR (TELL2)    = 0;                               00012370
           INNTEKT.PG_INNTEKT(TELL2) = 0;                               00012380
           INNTEKT.AGIVKODE (TELL2)  = 0;                               00012390
        END;                                                            00012400
                                                                        00012410
    END OVERFØR_INNTEKT;                                                00012420
 %PAGE;                                /*  */                           00012430
 /* ***************************************************************** */00012440
 /*                                                                   */00012450
 /*    KONTROLL AV INNTEKT.                                           */00012460
 /*                                                                   */00012470
 /* ***************************************************************** */00012480
                                                                        00012490
 KONTROLL_INNTEKT:                                                      00012500
    PROC (FEIL_FUNNET);                                                 00012510
                                                                        00012520
    DCL                                                                 00012530
        FEIL_FUNNET             BIT (1);                                00012540
    DCL                                                                 00012550
        KEY_BIT                 BIT(32) BASED (KEY_PEKER),              00012560
        KEY_PEKER               POINTER,                                00012570
        KOMMNR_RECL             CHAR (100);                             00012580
    DCL                                                                 00012590
        KEY_BIT_ST              BIT(32) BASED (KEY_PEKER_ST),           00012600
        KEY_PEKER_ST            POINTER,                                00012610
        STRYK_RECL              CHAR (19),                              00012620
        KEY                     PIC '(13)9';                            00012630
    DCL                                                                 00012640
        (FEIL19,                                                        00012650
         FEIL20,                                                        00012660
         FEIL21,                                                        00012670
         FEIL22,                                                        00012680
         FEIL23,                                                        00012690
         FEIL24,                                                        00012700
         FEIL25)                BIT (1);                                00012710
    DCL                                                                 00012720
        ANT_LINJER              FIXED BIN(15);                          00012730
                                                                        00012740
                                                                        00012750
    DCL                                                                 00012760
        1 FNR_REG,                                                      00012770
          2 FNR                 FIXED DEC(11),                          00012780
          2 FNR2                FIXED DEC(11),                          00012790
          2 BRUKERID            CHAR     ( 4),                          00012800
                                                                        00012810
        ALDER                   FIXED DEC (5);                          00012820
                                                                        00012830
    DCL                                                                 00012840
        W_FNR                   PIC'(11)9';                             00012850
    DCL                                                                 00012860
        1 FNR DEF W_FNR,                                                00012870
          2 DAG                 PIC'(2)9',                              00012880
          2 MND                 PIC'(2)9',                              00012890
          2 AAR                 PIC'(2)9',                              00012900
          2 ÅRHUNDRE            PIC'9',                                 00012910
          2 REST                PIC'(4)9';                              00012920
                                                                        00012930
    DCL                                                                 00012940
        HJ_MÅ                   PIC'(4)9';                              00012950
                                                                        00012960
                                                                        00012970
                                                                        00012980
                                                                        00012990
        FEIL19       = '0'B;                                            00013000
        FEIL20       = '0'B;                                            00013010
        FEIL21       = '0'B;                                            00013020
        FEIL22       = '0'B;                                            00013030
        FEIL23       = '0'B;                                            00013040
        FEIL24       = '0'B;                                            00013050
        FEIL25       = '0'B;                                            00013060
        FEIL_FUNNET  = '0'B;                                            00013070
                                                                        00013080
                                                                        00013090
        DO ANT_LINJER = 1 TO 16 WHILE                                   00013100
                        (F_FELT_PIC_CHAR11(INNTEKT.FNR(ANT_LINJER) >    00013110
                                                     '00000000000'));   00013120
                                                                        00013130
           W_FNR     = INNTEKT.FNR(ANT_LINJER);                         00013140
                                                                        00013150
           IF ^F_NUMERISK                                               00013160
                      (F_FELT_PIC_CHAR11(INNTEKT.FNR(ANT_LINJER))) THEN 00013170
              DO;                                                       00013180
                 FEIL_FUNNET = '1'B;                                    00013190
                 INNTEKT.FNRNR(ANT_LINJER) = 200;                       00013200
              END;                                                      00013210
           ELSE                                                         00013220
              IF ^F_GYLDIG_FNR(INNTEKT.FNR(ANT_LINJER)) THEN            00013230
                 DO;                                                    00013240
                    FEIL_FUNNET = '1'B;                                 00013250
                    INNTEKT.FNRNR(ANT_LINJER) = 1;                      00013260
                 END;                                                   00013270
              ELSE                                                      00013280
                 DO;                                                    00013290
                    FNR_REG.FNR = INNTEKT.FNR(ANT_LINJER);              00013300
                    EXEC CICS LINK PROGRAM('R0019906')                  00013310
                                                    COMMAREA(FNR_REG);  00013320
                    IF FNR_REG.FNR2 > 0 THEN                            00013330
                       DO;                                              00013340
                          INNTEKT.FNRNR(ANT_LINJER) = 203;              00013350
                          INNTEKT.FNR(ANT_LINJER) = FNR_REG.FNR2;       00013360
                       END;                                             00013370
                 END;                                                   00013380
                                                                        00013390
           KEY_PEKER = ADDR(INNTEKT.KOMMNR(ANT_LINJER));                00013400
                                                                        00013410
           IF VERIFY(INNTEKT.TYPE(ANT_LINJER),'BCDSU') ^= 0 THEN        00013420
              DO;                                                       00013430
                 IF ^FEIL20 THEN                                        00013440
                    DO;                                                 00013450
                       FEIL20 = '1'B;                                   00013460
                       INNTEKT.TYPENR(ANT_LINJER) = 245;                00013470
                    END;                                                00013480
                 ELSE                                                   00013490
                    INNTEKT.TYPENR(ANT_LINJER) = 999;                   00013500
              END;                                                      00013510
                                                                        00013520
           IF VERIFY(INNTEKT.ETYPE(ANT_LINJER),'019') ^= 0 THEN         00013530
              DO;                                                       00013540
                 IF ^FEIL20 THEN                                        00013550
                    DO;                                                 00013560
                       FEIL20 = '1'B;                                   00013570
                       INNTEKT.ETYPENR(ANT_LINJER) = 258;               00013580
                    END;                                                00013590
                 ELSE                                                   00013600
                    INNTEKT.ETYPENR(ANT_LINJER) = 999;                  00013610
              END;                                                      00013620
                                                                        00013630
           IF ^F_NUMERISK                                               00013640
                       (F_FELT_PIC_CHAR2(INNTEKT.ÅR(ANT_LINJER))) THEN  00013650
              DO;                                                       00013660
                IF ^FEIL19 THEN                                         00013670
                   DO;                                                  00013680
                      FEIL19 = '1'B;                                    00013690
                      INNTEKT.ÅRNR(ANT_LINJER) = 200;                   00013700
                   END;                                                 00013710
                ELSE                                                    00013720
                   INNTEKT.ÅRNR(ANT_LINJER) = 999;                      00013730
              END;                                                      00013740
                                                                        00013750
           ELSE                                                         00013760
              IF INNTEKT.ÅR(ANT_LINJER) < 63 THEN                       00013770
                 DO;                                                    00013780
                    IF ^FEIL19 THEN                                     00013790
                       DO;                                              00013800
                          FEIL19 = '1'B;                                00013810
                          INNTEKT.ÅRNR(ANT_LINJER) = 249;               00013820
                       END;                                             00013830
                    ELSE                                                00013840
                       INNTEKT.ÅRNR(ANT_LINJER) = 999;                  00013850
                 END;                                                   00013860
                                                                        00013870
              ELSE                                                      00013880
                 IF GV_TAB_ARRAY.INNTRAP_SPERREDATO                     00013890
                               (INNTEKT.ÅR(ANT_LINJER)) = 999999 THEN   00013900
                    DO;                                                 00013910
                       IF ^FEIL19 THEN                                  00013920
                          DO;                                           00013930
                             FEIL19 = '1'B;                             00013940
                             INNTEKT.ÅRNR(ANT_LINJER) = 249;            00013950
                          END;                                          00013960
                       ELSE                                             00013970
                          INNTEKT.ÅRNR(ANT_LINJER) = 999;               00013980
                    END;                                                00013990
                                                                        00014000
                 ELSE                                                   00014010
                    IF INNTEKT.ÅR(ANT_LINJER) < 67 THEN                 00014020
                       DO;                                              00014030
                          IF ^FEIL19 THEN                               00014040
                             DO;                                        00014050
                                FEIL19 = '1'B;                          00014060
                                INNTEKT.ÅRNR(ANT_LINJER) = 251;         00014070
                             END;                                       00014080
                          ELSE                                          00014090
                             INNTEKT.ÅRNR(ANT_LINJER) = 999;            00014100
                       END;                                             00014110
                    ELSE                                                00014120
                                                                        00014130
                       IF INNTEKT.FNRNR(ANT_LINJER) = 0 THEN            00014140
                                                                        00014150
                          DO;                                           00014160
                             HJ_MÅ     = INNTEKT.ÅR(ANT_LINJER);        00014170
                             ALDER     =                                00014180
                                F_ALDER(INNTEKT.FNR(ANT_LINJER),HJ_MÅ); 00014190
                                                                        00014200
                             IF ^(ALDER < 7000 &                        00014210
                                  ALDER > 1600) THEN                    00014220
                                DO;                                     00014230
                                   IF ^FEIL19 THEN                      00014240
                                      DO;                               00014250
                                         FEIL19 = '1'B;                 00014260
                                         INNTEKT.ÅRNR(ANT_LINJER) = 252;00014270
                                      END;                              00014280
                                   ELSE                                 00014290
                                      INNTEKT.ÅRNR(ANT_LINJER) = 999;   00014300
                                END;                                    00014310
                          END;                                          00014320
                                                                        00014330
           IF ^F_NUMERISK(F_FELT_PIC_CHAR1(                             00014340
                                      INNTEKT.ART(ANT_LINJER))) THEN    00014350
              DO;                                                       00014360
                 IF ^FEIL21 THEN                                        00014370
                    DO;                                                 00014380
                       FEIL21 = '1'B;                                   00014390
                       INNTEKT.ARTNR(ANT_LINJER) = 200;                 00014400
                    END;                                                00014410
                 ELSE                                                   00014420
                    INNTEKT.ARTNR(ANT_LINJER) = 999;                    00014430
              END;                                                      00014440
           ELSE                                                         00014450
                                                                        00014460
              IF VERIFY(F_FELT_PIC_CHAR1(                               00014470
                         INNTEKT.ART(ANT_LINJER)),'123') ^= 0 THEN      00014480
                 DO;                                                    00014490
                    IF ^FEIL21 THEN                                     00014500
                       DO;                                              00014510
                          FEIL21 = '1'B;                                00014520
                          INNTEKT.ARTNR(ANT_LINJER) = 246;              00014530
                       END;                                             00014540
                    ELSE                                                00014550
                       INNTEKT.ARTNR(ANT_LINJER) = 999;                 00014560
                 END;                                                   00014570
                                                                        00014580
              ELSE                                                      00014590
                 IF ( INNTEKT.ART(ANT_LINJER) = 3 &                     00014600
                      INNTEKT.TYPE(ANT_LINJER) ^= 'B' ) THEN            00014610
                    DO;                                                 00014620
                       IF ^FEIL21 THEN                                  00014630
                          DO;                                           00014640
                             FEIL21 = '1'B;                             00014650
                             INNTEKT.ARTNR(ANT_LINJER) = 285;           00014660
                          END;                                          00014670
                       ELSE                                             00014680
                          INNTEKT.ARTNR(ANT_LINJER) = 999;              00014690
                    END;                                                00014700
                                                                        00014710
           IF ^F_NUMERISK(F_FELT_PIC_CHAR1(                             00014720
                                      INNTEKT.MERKE(ANT_LINJER))) THEN  00014730
              DO;                                                       00014740
                 IF ^FEIL22 THEN                                        00014750
                    DO;                                                 00014760
                       FEIL22 = '1'B;                                   00014770
                       INNTEKT.MERKENR(ANT_LINJER) = 200;               00014780
                    END;                                                00014790
                 ELSE                                                   00014800
                    INNTEKT.MERKENR(ANT_LINJER) = 999;                  00014810
              END;                                                      00014820
           ELSE                                                         00014830
              IF VERIFY(F_FELT_PIC_CHAR1(                               00014840
                      INNTEKT.MERKE(ANT_LINJER)),'0123459') ^= 0 THEN   00014850
                 DO;                                                    00014860
                    IF ^FEIL22 THEN                                     00014870
                       DO;                                              00014880
                          FEIL22 = '1'B;                                00014890
                          INNTEKT.MERKENR(ANT_LINJER) = 247;            00014900
                       END;                                             00014910
                    ELSE                                                00014920
                       INNTEKT.MERKENR(ANT_LINJER) = 999;               00014930
                 END;                                                   00014940
                                                                        00014950
                                                                        00014960
           IF (INNTEKT.TYPE(ANT_LINJER) = 'B' &                         00014970
               INNTEKT.MERKE(ANT_LINJER) ^= 0 &                         00014980
               INNTEKT.MERKE(ANT_LINJER) ^= 1 &                         00014990
               INNTEKT.MERKE(ANT_LINJER) ^= 4) THEN                     00015000
              DO;                                                       00015010
                 IF ^FEIL22 THEN                                        00015020
                    DO;                                                 00015030
                       FEIL22 = '1'B;                                   00015040
                       INNTEKT.MERKENR(ANT_LINJER) = 287;               00015050
                       INNTEKT.TYPENR(ANT_LINJER) = 999;                00015060
                    END;                                                00015070
                 ELSE                                                   00015080
                    INNTEKT.MERKENR(ANT_LINJER) = 999;                  00015090
              END;                                                      00015100
                                                                        00015110
                                                                        00015120
           IF (INNTEKT.TYPE(ANT_LINJER) = 'C ' &                        00015130
               INNTEKT.MERKE(ANT_LINJER) ^= 0) !                        00015140
                                                                        00015150
              (INNTEKT.TYPE(ANT_LINJER) = 'S ' &                        00015160
               INNTEKT.MERKE(ANT_LINJER) ^= 0) !                        00015170
                                                                        00015180
              (INNTEKT.TYPE(ANT_LINJER) = 'U ' &                        00015190
               INNTEKT.MERKE(ANT_LINJER) ^= 0) THEN                     00015200
                                                                        00015210
              DO;                                                       00015220
                 IF ^FEIL22 THEN                                        00015230
                    DO;                                                 00015240
                       FEIL22 = '1'B;                                   00015250
                       INNTEKT.MERKENR(ANT_LINJER) = 286;               00015260
                       INNTEKT.TYPENR(ANT_LINJER) = 999;                00015270
                    END;                                                00015280
                 ELSE                                                   00015290
                    INNTEKT.MERKENR(ANT_LINJER) = 999;                  00015300
              END;                                                      00015310
                                                                        00015320
                                                                        00015330
           IF (INNTEKT.TYPE(ANT_LINJER) = 'D ' &                        00015340
               INNTEKT.MERKE(ANT_LINJER) ^= 0 &                         00015350
               INNTEKT.MERKE(ANT_LINJER) ^= 1 &                         00015360
               INNTEKT.MERKE(ANT_LINJER) ^= 2 &                         00015370
               INNTEKT.MERKE(ANT_LINJER) ^= 3) THEN                     00015380
                                                                        00015390
              DO;                                                       00015400
                 IF ^FEIL22 THEN                                        00015410
                    DO;                                                 00015420
                       FEIL22 = '1'B;                                   00015430
                       INNTEKT.MERKENR(ANT_LINJER) = 288;               00015440
                       INNTEKT.TYPENR(ANT_LINJER) = 999;                00015450
                    END;                                                00015460
                 ELSE                                                   00015470
                    INNTEKT.MERKENR(ANT_LINJER) = 999;                  00015480
              END;                                                      00015490
                                                                        00015500
                                                                        00015510
           IF ^F_NUMERISK(F_FELT_PIC_CHAR4(                             00015520
                                      INNTEKT.KOMMNR(ANT_LINJER))) THEN 00015530
              DO;                                                       00015540
                 IF ^FEIL23 THEN                                        00015550
                    DO;                                                 00015560
                       FEIL23 = '1'B;                                   00015570
                       INNTEKT.KOMMNRNR(ANT_LINJER) = 200;              00015580
                    END;                                                00015590
                 ELSE                                                   00015600
                    INNTEKT.KOMMNRNR(ANT_LINJER) = 999;                 00015610
              END;                                                      00015620
           ELSE                                                         00015630
              IF INNTEKT.TYPE(ANT_LINJER) = 'S' THEN                    00015640
                 INNTEKT.KOMMNR(ANT_LINJER) = 0000;                     00015650
              ELSE                                                      00015660
                 DO;                                                    00015670
                    EXEC CICS HANDLE CONDITION NOTFND(NOTFND1);         00015680
                    EXEC CICS READ DATASET ('KOMTAB') RIDFLD(KEY_BIT)   00015690
                                                    INTO(KOMMNR_RECL);  00015700
                    GOTO KOMM_UT1;                                      00015710
                NOTFND1:                                                00015720
                                                                        00015730
    /* ENDRET 170787 BRITT: KOMMUNENR. SOM BEGYNNER MED 6 OG 7000 OG */ 00015740
    /*                   9000 ER GYLDIGE. FEILRAPP. 319.          */    00015750
                                                                        00015760
                    IF ^((INNTEKT.KOMMNR(ANT_LINJER) > 6000 &           00015770
                          INNTEKT.KOMMNR(ANT_LINJER) < 7001 ) !         00015780
                          INNTEKT.KOMMNR(ANT_LINJER) = 9000 ) THEN      00015790
                       DO;                                              00015800
                          IF ^FEIL23 THEN                               00015810
                             DO;                                        00015820
                                FEIL23 = '1'B;                          00015830
                                INNTEKT.KOMMNRNR(ANT_LINJER) = 248;     00015840
                             END;                                       00015850
                          ELSE                                          00015860
                             INNTEKT.KOMMNRNR(ANT_LINJER) = 999;        00015870
                          LEAVE;                                        00015880
                       END;                                             00015890
                KOMM_UT1:                                               00015900
                    IF INNTEKT.TYPE(ANT_LINJER) = 'U' &                 00015910
                       INNTEKT.KOMMNR(ANT_LINJER) ^= 0301 THEN          00015920
                       IF ^FEIL23 THEN                                  00015930
                          DO;                                           00015940
                             FEIL23 = '1'B;                             00015950
                             INNTEKT.KOMMNRNR(ANT_LINJER) = 248;        00015960
                          END;                                          00015970
                 END;                                                   00015980
                                                                        00015990
                                                                        00016000
           IF ^F_NUMERISK(F_FELT_PIC_CHAR3(                             00016010
                                    INNTEKT.AGIVKODE(ANT_LINJER))) THEN 00016020
              DO;                                                       00016030
                 IF ^FEIL25 THEN                                        00016040
                    DO;                                                 00016050
                       FEIL25 = '1'B;                                   00016060
                       INNTEKT.AGIVKODENR(ANT_LINJER) = 200;            00016070
                    END;                                                00016080
                 ELSE                                                   00016090
                    INNTEKT.AGIVKODENR(ANT_LINJER) = 999;               00016100
              END;                                                      00016110
           ELSE                                                         00016120
              IF INNTEKT.AGIVKODE(ANT_LINJER) > 0 &                     00016130
                 INNTEKT.TYPE(ANT_LINJER) ^= 'D' THEN                   00016140
                 DO;                                                    00016150
                    IF ^FEIL20 THEN                                     00016160
                       DO;                                              00016170
                          FEIL20 = '1'B;                                00016180
                          INNTEKT.TYPENR(ANT_LINJER) = 257;             00016190
                       END;                                             00016200
                    ELSE                                                00016210
                       INNTEKT.TYPENR(ANT_LINJER) = 999;                00016220
                 END;                                                   00016230
                                                                        00016240
           KEY       = INNTEKT.FNR(ANT_LINJER) * 100 +                  00016250
                       INNTEKT.ÅR(ANT_LINJER);                          00016260
           KEY_PEKER_ST = ADDR(KEY);                                    00016270
                                                                        00016280
           EXEC CICS HANDLE CONDITION NOTFND(ALT_OK1);                  00016290
           EXEC CICS READ DATASET ('STRYK') RIDFLD(KEY_BIT_ST)          00016300
                                               INTO(STRYK_RECL);        00016310
           IF ^FEIL19 THEN                                              00016320
              DO;                                                       00016330
                 FEIL19 = '1'B;                                         00016340
                 INNTEKT.ÅRNR(ANT_LINJER) = 266;                        00016350
              END;                                                      00016360
           ELSE                                                         00016370
              INNTEKT.ÅRNR(ANT_LINJER) = 999;                           00016380
                                                                        00016390
 ALT_OK1:                                                               00016400
        END;                                                            00016410
                                                                        00016420
                                                                        00016430
        IF ANT_LINJER = 1 THEN                                          00016440
           DO;                                                          00016450
              INNTEKT.FNRNR(ANT_LINJER) = 250;                          00016460
              FEIL_FUNNET = '1'B;                                       00016470
           END;                                                         00016480
                                                                        00016490
                                                                        00016500
        FEIL_FUNNET = FEIL_FUNNET ! FEIL19 ! FEIL20 ! FEIL21 ! FEIL22 ! 00016510
                                    FEIL23 ! FEIL24 ! FEIL25;           00016520
                                                                        00016530
                                                                        00016540
    END KONTROLL_INNTEKT;                                               00016550
 %PAGE;                                /*  */                           00016560
 /* ***************************************************************** */00016570
 /*                                                                   */00016580
 /*    BLANKING AV MELDINGSNUMMER.                                    */00016590
 /*                                                                   */00016600
 /* ***************************************************************** */00016610
                                                                        00016620
 BLANK_MELDNR:                                                          00016630
    PROC;                                                               00016640
        DO I = 1 TO 16;                                                 00016650
           INNTEKT.FNRNR (I)       = 0;                                 00016660
           INNTEKT.TYPENR (I)      = 0;                                 00016670
           INNTEKT.ETYPENR (I)     = 0;                                 00016680
           INNTEKT.ÅRNR (I)        = 0;                                 00016690
           INNTEKT.ARTNR (I)       = 0;                                 00016700
           INNTEKT.MERKENR (I)     = 0;                                 00016710
           INNTEKT.KOMMNRNR (I)    = 0;                                 00016720
           INNTEKT.PG_INNTEKTNR(I) = 0;                                 00016730
           INNTEKT.AGIVKODENR (I)  = 0;                                 00016740
        END;                                                            00016750
    END BLANK_MELDNR;                                                   00016760
 %SKIP;                                                                 00016770
                                                                        00016780
 /* ***************************************************************** */00016790
 /*                                                                   */00016800
 /*   PROSEDYRA OVERFØRER DATA FRA INNTEKT_OMR TIL                    */00016810
 /*   SKJERMBILDE                                                     */00016820
 /*   MAP: S001I09                                                    */00016830
 /*   MAPSET: S001I93                                                 */00016840
 /*                                                                   */00016850
 /* ***************************************************************** */00016860
                                                                        00016870
 OVERFØR_INNTEKT_MAP:                                                   00016880
    PROC;                                                               00016890
    DCL                                                                 00016900
        NORMAL CHAR (1) INIT(' '),                                      00016910
        NOR_NUM CHAR (1) INIT('&'),                                     00016920
        BRI_NUM CHAR (1) INIT('Q');                                     00016930
                                                                        00016940
                                                                        00016950
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(1)) ^= (11)'0' THEN            00016960
           DO;                                                          00016970
              S001I09O.FNR1O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(1));  00016980
              S001I09O.ÅR1O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(1)) ;   00016990
              S001I09O.TYPE1O     = INNTEKT.TYPE(1)                ;    00017000
              S001I09O.ETYPE1O    = INNTEKT.ETYPE(1)               ;    00017010
              S001I09O.ART1O      = F_FELT_PIC_CHAR1(INNTEKT.ART(1)) ;  00017020
              S001I09O.MERKE1O    =                                     00017030
                                F_FELT_PIC_CHAR1(INNTEKT.MERKE(1)) ;    00017040
              S001I09O.KOMMNR1O   =                                     00017050
                                F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(1));    00017060
              S001I09O.INNTEKT1O  =                                     00017070
                                F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(1));00017080
              S001I09O.AGIVKODE1O =                                     00017090
                                F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(1)) ; 00017100
           END;                                                         00017110
                                                                        00017120
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(2)) ^= (11)'0' THEN            00017130
           DO;                                                          00017140
              S001I09O.FNR2O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(2));  00017150
              S001I09O.ÅR2O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(2)) ;   00017160
              S001I09O.TYPE2O     = INNTEKT.TYPE(2)                ;    00017170
              S001I09O.ETYPE2O    = INNTEKT.ETYPE(2)               ;    00017180
              S001I09O.ART2O      = F_FELT_PIC_CHAR1(INNTEKT.ART(2)) ;  00017190
              S001I09O.MERKE2O    =                                     00017200
                              F_FELT_PIC_CHAR1(INNTEKT.MERKE(2)) ;      00017210
              S001I09O.KOMMNR2O   =                                     00017220
                              F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(2));      00017230
              S001I09O.INNTEKT2O  =                                     00017240
                              F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(2)) ; 00017250
              S001I09O.AGIVKODE2O =                                     00017260
                              F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(2)) ;   00017270
           END;                                                         00017280
                                                                        00017290
                                                                        00017300
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(3)) ^= (11)'0' THEN            00017310
           DO;                                                          00017320
              S001I09O.FNR3O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(3));  00017330
              S001I09O.ÅR3O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(3)) ;   00017340
              S001I09O.TYPE3O     = INNTEKT.TYPE(3)                ;    00017350
              S001I09O.ETYPE3O    = INNTEKT.ETYPE(3)               ;    00017360
              S001I09O.ART3O      = F_FELT_PIC_CHAR1(INNTEKT.ART(3)) ;  00017370
              S001I09O.MERKE3O    =                                     00017380
                                F_FELT_PIC_CHAR1(INNTEKT.MERKE(3)) ;    00017390
              S001I09O.KOMMNR3O   =                                     00017400
                                F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(3));    00017410
              S001I09O.INNTEKT3O  =                                     00017420
                                F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(3));00017430
              S001I09O.AGIVKODE3O =                                     00017440
                                F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(3)) ; 00017450
           END;                                                         00017460
                                                                        00017470
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(4)) ^= (11)'0' THEN            00017480
           DO;                                                          00017490
              S001I09O.FNR4O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(4));  00017500
              S001I09O.ÅR4O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(4)) ;   00017510
              S001I09O.TYPE4O     = INNTEKT.TYPE(4)                ;    00017520
              S001I09O.ETYPE4O    = INNTEKT.ETYPE(4)               ;    00017530
              S001I09O.ART4O      = F_FELT_PIC_CHAR1(INNTEKT.ART(4)) ;  00017540
              S001I09O.MERKE4O    = F_FELT_PIC_CHAR1(INNTEKT.MERKE(4)); 00017550
              S001I09O.KOMMNR4O   = F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(4));00017560
              S001I09O.INNTEKT4O  =                                     00017570
                              F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(4)) ; 00017580
              S001I09O.AGIVKODE4O =                                     00017590
                              F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(4)) ;   00017600
           END;                                                         00017610
                                                                        00017620
                                                                        00017630
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(5)) ^= (11)'0' THEN            00017640
           DO;                                                          00017650
              S001I09O.FNR5O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(5));  00017660
              S001I09O.ÅR5O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(5)) ;   00017670
              S001I09O.TYPE5O     = INNTEKT.TYPE(5)                ;    00017680
              S001I09O.ETYPE5O    = INNTEKT.ETYPE(5)               ;    00017690
              S001I09O.ART5O      = F_FELT_PIC_CHAR1(INNTEKT.ART(5)) ;  00017700
              S001I09O.MERKE5O    = F_FELT_PIC_CHAR1(INNTEKT.MERKE(5)); 00017710
              S001I09O.KOMMNR5O   = F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(5));00017720
              S001I09O.INNTEKT5O  =                                     00017730
                                F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(5));00017740
              S001I09O.AGIVKODE5O =                                     00017750
                                F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(5)) ; 00017760
           END;                                                         00017770
                                                                        00017780
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(6)) ^= (11)'0' THEN            00017790
           DO;                                                          00017800
              S001I09O.FNR6O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(6));  00017810
              S001I09O.ÅR6O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(6)) ;   00017820
              S001I09O.TYPE6O     = INNTEKT.TYPE(6)                ;    00017830
              S001I09O.ETYPE6O    = INNTEKT.ETYPE(6)               ;    00017840
              S001I09O.ART6O      = F_FELT_PIC_CHAR1(INNTEKT.ART(6)) ;  00017850
              S001I09O.MERKE6O    = F_FELT_PIC_CHAR1(INNTEKT.MERKE(6)); 00017860
              S001I09O.KOMMNR6O   = F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(6));00017870
              S001I09O.INNTEKT6O  =                                     00017880
                               F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(6)); 00017890
              S001I09O.AGIVKODE6O =                                     00017900
                               F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(6)) ;  00017910
           END;                                                         00017920
                                                                        00017930
                                                                        00017940
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(7)) ^= (11)'0' THEN            00017950
           DO;                                                          00017960
              S001I09O.FNR7O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(7));  00017970
              S001I09O.ÅR7O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(7)) ;   00017980
              S001I09O.TYPE7O     = INNTEKT.TYPE(7)                ;    00017990
              S001I09O.ETYPE7O    = INNTEKT.ETYPE(7)                ;   00018000
              S001I09O.ART7O      = F_FELT_PIC_CHAR1(INNTEKT.ART(7)) ;  00018010
              S001I09O.MERKE7O    = F_FELT_PIC_CHAR1(INNTEKT.MERKE(7)); 00018020
              S001I09O.KOMMNR7O   = F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(7));00018030
              S001I09O.INNTEKT7O  =                                     00018040
                                F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(7));00018050
              S001I09O.AGIVKODE7O =                                     00018060
                                F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(7)) ; 00018070
           END;                                                         00018080
                                                                        00018090
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(8)) ^= (11)'0' THEN            00018100
           DO;                                                          00018110
              S001I09O.FNR8O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(8));  00018120
              S001I09O.ÅR8O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(8)) ;   00018130
              S001I09O.TYPE8O     = INNTEKT.TYPE(8)                ;    00018140
              S001I09O.ETYPE8O    = INNTEKT.ETYPE(8)               ;    00018150
              S001I09O.ART8O      = F_FELT_PIC_CHAR1(INNTEKT.ART(8)) ;  00018160
              S001I09O.MERKE8O    = F_FELT_PIC_CHAR1(INNTEKT.MERKE(8)); 00018170
              S001I09O.KOMMNR8O   = F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(8));00018180
              S001I09O.INNTEKT8O  =                                     00018190
                              F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(8)) ; 00018200
              S001I09O.AGIVKODE8O =                                     00018210
                              F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(8)) ;   00018220
           END;                                                         00018230
                                                                        00018240
                                                                        00018250
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(9)) ^= (11)'0' THEN            00018260
           DO;                                                          00018270
              S001I09O.FNR9O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(9));  00018280
              S001I09O.ÅR9O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(9)) ;   00018290
              S001I09O.TYPE9O     = INNTEKT.TYPE(9)                ;    00018300
              S001I09O.ETYPE9O    = INNTEKT.ETYPE(9)               ;    00018310
              S001I09O.ART9O      = F_FELT_PIC_CHAR1(INNTEKT.ART(9)) ;  00018320
              S001I09O.MERKE9O    = F_FELT_PIC_CHAR1(INNTEKT.MERKE(9)); 00018330
              S001I09O.KOMMNR9O   = F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(9));00018340
              S001I09O.INNTEKT9O  =                                     00018350
                                F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(9));00018360
              S001I09O.AGIVKODE9O =                                     00018370
                                F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(9)) ; 00018380
           END;                                                         00018390
                                                                        00018400
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(10)) ^= (11)'0' THEN           00018410
           DO;                                                          00018420
              S001I09O.FNR10O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(10));00018430
              S001I09O.ÅR10O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(10)) ; 00018440
              S001I09O.TYPE10O     = INNTEKT.TYPE(10)                ;  00018450
              S001I09O.ETYPE10O    = INNTEKT.ETYPE(10)               ;  00018460
              S001I09O.ART10O      = F_FELT_PIC_CHAR1(INNTEKT.ART(10)); 00018470
              S001I09O.MERKE10O    =                                    00018480
                             F_FELT_PIC_CHAR1(INNTEKT.MERKE(10));       00018490
              S001I09O.KOMMNR10O   =                                    00018500
                             F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(10));      00018510
              S001I09O.INNTEKT10O  =                                    00018520
                             F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(10)) ; 00018530
              S001I09O.AGIVKODE10O =                                    00018540
                             F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(10)) ;   00018550
           END;                                                         00018560
                                                                        00018570
                                                                        00018580
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(11)) ^= (11)'0' THEN           00018590
           DO;                                                          00018600
              S001I09O.FNR11O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(11));00018610
              S001I09O.ÅR11O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(11)) ; 00018620
              S001I09O.TYPE11O     = INNTEKT.TYPE(11)                ;  00018630
              S001I09O.ETYPE11O    = INNTEKT.ETYPE(11)               ;  00018640
              S001I09O.ART11O      = F_FELT_PIC_CHAR1(INNTEKT.ART(11)); 00018650
              S001I09O.MERKE11O    =                                    00018660
                               F_FELT_PIC_CHAR1(INNTEKT.MERKE(11)) ;    00018670
              S001I09O.KOMMNR11O   =                                    00018680
                               F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(11));    00018690
              S001I09O.INNTEKT11O  =                                    00018700
                               F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(11));00018710
              S001I09O.AGIVKODE11O =                                    00018720
                               F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(11));  00018730
           END;                                                         00018740
                                                                        00018750
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(12)) ^= (11)'0' THEN           00018760
           DO;                                                          00018770
              S001I09O.FNR12O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(12));00018780
              S001I09O.ÅR12O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(12)) ; 00018790
              S001I09O.ETYPE12O    = INNTEKT.ETYPE(12)               ;  00018800
              S001I09O.TYPE12O     = INNTEKT.TYPE(12)                ;  00018810
              S001I09O.ART12O      = F_FELT_PIC_CHAR1(INNTEKT.ART(12)); 00018820
              S001I09O.MERKE12O    =                                    00018830
                             F_FELT_PIC_CHAR1(INNTEKT.MERKE(12)) ;      00018840
              S001I09O.KOMMNR12O   =                                    00018850
                             F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(12));      00018860
              S001I09O.INNTEKT12O  =                                    00018870
                             F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(12)) ; 00018880
              S001I09O.AGIVKODE12O =                                    00018890
                             F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(12)) ;   00018900
           END;                                                         00018910
                                                                        00018920
                                                                        00018930
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(13)) ^= (11)'0' THEN           00018940
           DO;                                                          00018950
              S001I09O.FNR13O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(13));00018960
              S001I09O.ÅR13O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(13)) ; 00018970
              S001I09O.TYPE13O     = INNTEKT.TYPE(13)                ;  00018980
              S001I09O.ETYPE13O    = INNTEKT.ETYPE(13)               ;  00018990
              S001I09O.ART13O      = F_FELT_PIC_CHAR1(INNTEKT.ART(13)); 00019000
              S001I09O.MERKE13O    =                                    00019010
                              F_FELT_PIC_CHAR1(INNTEKT.MERKE(13)) ;     00019020
              S001I09O.KOMMNR13O   =                                    00019030
                              F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(13));     00019040
              S001I09O.INNTEKT13O  =                                    00019050
                              F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(13)); 00019060
              S001I09O.AGIVKODE13O =                                    00019070
                              F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(13)) ;  00019080
           END;                                                         00019090
                                                                        00019100
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(14)) ^= (11)'0' THEN           00019110
           DO;                                                          00019120
              S001I09O.FNR14O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(14));00019130
              S001I09O.ÅR14O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(14)) ; 00019140
              S001I09O.TYPE14O     = INNTEKT.TYPE(14)                ;  00019150
              S001I09O.ETYPE14O    = INNTEKT.ETYPE(14)               ;  00019160
              S001I09O.ART14O      = F_FELT_PIC_CHAR1(INNTEKT.ART(14)); 00019170
              S001I09O.MERKE14O    =                                    00019180
                             F_FELT_PIC_CHAR1(INNTEKT.MERKE(14)) ;      00019190
              S001I09O.KOMMNR14O   =                                    00019200
                             F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(14));      00019210
              S001I09O.INNTEKT14O  =                                    00019220
                             F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(14)) ; 00019230
              S001I09O.AGIVKODE14O =                                    00019240
                             F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(14)) ;   00019250
           END;                                                         00019260
                                                                        00019270
                                                                        00019280
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(15)) ^= (11)'0' THEN           00019290
           DO;                                                          00019300
              S001I09O.FNR15O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(15));00019310
              S001I09O.ÅR15O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(15)) ; 00019320
              S001I09O.TYPE15O     = INNTEKT.TYPE(15)                ;  00019330
              S001I09O.ETYPE15O    = INNTEKT.ETYPE(15)               ;  00019340
              S001I09O.ART15O      = F_FELT_PIC_CHAR1(INNTEKT.ART(15)); 00019350
              S001I09O.MERKE15O    =                                    00019360
                              F_FELT_PIC_CHAR1(INNTEKT.MERKE(15)) ;     00019370
              S001I09O.KOMMNR15O   =                                    00019380
                              F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(15));     00019390
              S001I09O.INNTEKT15O  =                                    00019400
                              F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(15)); 00019410
              S001I09O.AGIVKODE15O =                                    00019420
                              F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(15));   00019430
           END;                                                         00019440
                                                                        00019450
                                                                        00019460
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(16)) ^= (11)'0' THEN           00019470
           DO;                                                          00019480
              S001I09O.FNR16O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(16));00019490
              S001I09O.ÅR16O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(16)) ; 00019500
              S001I09O.TYPE16O     = INNTEKT.TYPE(16)                ;  00019510
              S001I09O.ETYPE16O    = INNTEKT.ETYPE(16)               ;  00019520
              S001I09O.ART16O      = F_FELT_PIC_CHAR1(INNTEKT.ART(16)); 00019530
              S001I09O.MERKE16O    =                                    00019540
                             F_FELT_PIC_CHAR1(INNTEKT.MERKE(16)) ;      00019550
              S001I09O.KOMMNR16O   =                                    00019560
                             F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(16));      00019570
              S001I09O.INNTEKT16O =                                     00019580
                             F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(16));  00019590
              S001I09O.AGIVKODE16O =                                    00019600
                             F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(16)) ;   00019610
           END;                                                         00019620
                                                                        00019630
                                                                        00019640
 /* *********************************************** */                  00019650
 /* FEILMELDINGER MARKERING AV  FELT (ATTRIBUTTENE) */                  00019660
 /* *********************************************** */                  00019670
                                                                        00019680
        S001I09O.DUMMYA = '_';                                          00019690
                                                                        00019700
                                                                        00019710
        IF INNTEKT.FNRNR(1) = 0 THEN                                    00019720
           S001I09O.FNR1A = NOR_NUM;                                    00019730
        ELSE                                                            00019740
           DO;                                                          00019750
              S001I09O.FNR1A = BRI_NUM;                                 00019760
              S001I09I.FNR1L = CURSOR_POS;                              00019770
              IF INNTEKT.FNRNR(1) ^= 999 THEN                           00019780
                 CALL SKRIV_FEIL(INNTEKT.FNRNR(1));                     00019790
           END;                                                         00019800
                                                                        00019810
        IF INNTEKT.ÅRNR(1) = 0 THEN                                     00019820
           S001I09O.ÅR1A = NOR_NUM;                                     00019830
        ELSE                                                            00019840
           DO;                                                          00019850
              S001I09O.ÅR1A = BRI_NUM;                                  00019860
              S001I09I.ÅR1L = CURSOR_POS;                               00019870
              IF INNTEKT.ÅRNR(1) ^= 999 THEN                            00019880
                 CALL SKRIV_FEIL(INNTEKT.ÅRNR(1));                      00019890
           END;                                                         00019900
                                                                        00019910
        IF INNTEKT.ETYPENR(1) = 0 THEN                                  00019920
           S001I09O.ETYPE1A = NORMAL;                                   00019930
        ELSE                                                            00019940
           DO;                                                          00019950
              S001I09O.ETYPE1A = DFHBMBRY;                              00019960
              S001I09I.ETYPE1L = CURSOR_POS;                            00019970
              IF INNTEKT.ETYPENR(1) ^= 999 THEN                         00019980
                 CALL SKRIV_FEIL(INNTEKT.ETYPENR(1));                   00019990
           END;                                                         00020000
                                                                        00020010
        IF INNTEKT.TYPENR(1) = 0 THEN                                   00020020
           S001I09O.TYPE1A = NORMAL;                                    00020030
        ELSE                                                            00020040
           DO;                                                          00020050
              S001I09O.TYPE1A = DFHBMBRY;                               00020060
              S001I09I.TYPE1L = CURSOR_POS;                             00020070
              IF INNTEKT.TYPENR(1) ^= 999 THEN                          00020080
                 CALL SKRIV_FEIL(INNTEKT.TYPENR(1));                    00020090
           END;                                                         00020100
                                                                        00020110
        IF INNTEKT.ARTNR(1) = 0 THEN                                    00020120
              S001I09O.ART1A = NOR_NUM;                                 00020130
        ELSE                                                            00020140
           DO;                                                          00020150
              S001I09O.ART1A = BRI_NUM;                                 00020160
              S001I09I.ART1L = CURSOR_POS;                              00020170
              IF INNTEKT.ARTNR(1) ^= 999 THEN                           00020180
                 CALL SKRIV_FEIL(INNTEKT.ARTNR(1));                     00020190
           END;                                                         00020200
                                                                        00020210
        IF INNTEKT.MERKENR(1) = 0 THEN                                  00020220
           S001I09O.MERKE1A = NOR_NUM;                                  00020230
        ELSE                                                            00020240
           DO;                                                          00020250
              S001I09O.MERKE1A = BRI_NUM;                               00020260
              S001I09I.MERKE1L = CURSOR_POS;                            00020270
              IF INNTEKT.MERKENR(1) ^= 999 THEN                         00020280
                 CALL SKRIV_FEIL(INNTEKT.MERKENR(1));                   00020290
           END;                                                         00020300
                                                                        00020310
        IF INNTEKT.KOMMNRNR(1) = 0 THEN                                 00020320
           S001I09O.KOMMNR1A = NOR_NUM;                                 00020330
        ELSE                                                            00020340
           DO;                                                          00020350
              S001I09O.KOMMNR1A = BRI_NUM;                              00020360
              S001I09I.KOMMNR1L = CURSOR_POS;                           00020370
              IF INNTEKT.KOMMNRNR(1) ^= 999 THEN                        00020380
                 CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(1));                  00020390
           END;                                                         00020400
                                                                        00020410
        IF INNTEKT.PG_INNTEKTNR(1) = 0 THEN                             00020420
           S001I09O.INNTEKT1A = NOR_NUM;                                00020430
        ELSE                                                            00020440
           DO;                                                          00020450
              S001I09O.INNTEKT1A = BRI_NUM;                             00020460
              S001I09I.INNTEKT1L = CURSOR_POS;                          00020470
              IF INNTEKT.PG_INNTEKTNR(1) ^= 999 THEN                    00020480
                 CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(1));              00020490
           END;                                                         00020500
                                                                        00020510
        IF INNTEKT.AGIVKODENR(1) = 0 THEN                               00020520
           S001I09O.AGIVKODE1A = NOR_NUM;                               00020530
        ELSE                                                            00020540
           DO;                                                          00020550
              S001I09O.AGIVKODE1A = BRI_NUM;                            00020560
              S001I09I.AGIVKODE1L = CURSOR_POS;                         00020570
              IF INNTEKT.AGIVKODENR(1) ^= 999 THEN                      00020580
                 CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(1));                00020590
           END;                                                         00020600
                                                                        00020610
                                                                        00020620
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(2)) ^= (11)'0' THEN            00020630
           DO;                                                          00020640
              IF INNTEKT.FNRNR(2) = 0 THEN                              00020650
                 S001I09O.FNR2A = NOR_NUM;                              00020660
              ELSE                                                      00020670
                 DO;                                                    00020680
                    S001I09O.FNR2A = BRI_NUM;                           00020690
                    S001I09I.FNR2L = CURSOR_POS;                        00020700
                    IF INNTEKT.FNRNR(2) ^= 999 THEN                     00020710
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(2));               00020720
                 END;                                                   00020730
                                                                        00020740
              IF INNTEKT.ÅRNR(2) = 0 THEN                               00020750
                 S001I09O.ÅR2A = NOR_NUM;                               00020760
              ELSE                                                      00020770
                 DO;                                                    00020780
                    S001I09O.ÅR2A = BRI_NUM;                            00020790
                    S001I09I.ÅR2L = CURSOR_POS;                         00020800
                    IF INNTEKT.ÅRNR(2) ^= 999 THEN                      00020810
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(2));                00020820
                 END;                                                   00020830
                                                                        00020840
              IF INNTEKT.ETYPENR(2) = 0 THEN                            00020850
                 S001I09O.ETYPE2A = NORMAL;                             00020860
              ELSE                                                      00020870
                 DO;                                                    00020880
                    S001I09O.ETYPE2A = DFHBMBRY;                        00020890
                    S001I09I.ETYPE2L = CURSOR_POS;                      00020900
                    IF INNTEKT.ETYPENR(2) ^= 999 THEN                   00020910
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(2));             00020920
                 END;                                                   00020930
                                                                        00020940
              IF INNTEKT.TYPENR(2) = 0 THEN                             00020950
                 S001I09O.TYPE2A = NORMAL;                              00020960
              ELSE                                                      00020970
                 DO;                                                    00020980
                    S001I09O.TYPE2A = DFHBMBRY;                         00020990
                    S001I09I.TYPE2L = CURSOR_POS;                       00021000
                    IF INNTEKT.TYPENR(2) ^= 999 THEN                    00021010
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(2));              00021020
                 END;                                                   00021030
                                                                        00021040
              IF INNTEKT.ARTNR(2) = 0 THEN                              00021050
                 S001I09O.ART2A = NOR_NUM;                              00021060
              ELSE                                                      00021070
                 DO;                                                    00021080
                    S001I09O.ART2A = BRI_NUM;                           00021090
                    S001I09I.ART2L = CURSOR_POS;                        00021100
                    IF INNTEKT.ARTNR(2) ^= 999 THEN                     00021110
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(2));               00021120
                 END;                                                   00021130
                                                                        00021140
              IF INNTEKT.MERKENR(2) = 0 THEN                            00021150
                 S001I09O.MERKE2A = NOR_NUM;                            00021160
              ELSE                                                      00021170
                 DO;                                                    00021180
                    S001I09O.MERKE2A = BRI_NUM;                         00021190
                    S001I09I.MERKE2L = CURSOR_POS;                      00021200
                    IF INNTEKT.MERKENR(2) ^= 999 THEN                   00021210
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(2));             00021220
                 END;                                                   00021230
                                                                        00021240
              IF INNTEKT.KOMMNRNR(2) = 0 THEN                           00021250
                 S001I09O.KOMMNR2A = NOR_NUM;                           00021260
              ELSE                                                      00021270
                 DO;                                                    00021280
                    S001I09O.KOMMNR2A = BRI_NUM;                        00021290
                    S001I09I.KOMMNR2L = CURSOR_POS;                     00021300
                    IF INNTEKT.KOMMNRNR(2) ^= 999 THEN                  00021310
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(2));            00021320
                 END;                                                   00021330
                                                                        00021340
              IF INNTEKT.PG_INNTEKTNR(2) = 0 THEN                       00021350
                 S001I09O.INNTEKT2A = NOR_NUM;                          00021360
              ELSE                                                      00021370
                 DO;                                                    00021380
                    S001I09O.INNTEKT2A = BRI_NUM;                       00021390
                    S001I09I.INNTEKT2L = CURSOR_POS;                    00021400
                    IF INNTEKT.PG_INNTEKTNR(2) ^= 999 THEN              00021410
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(2));        00021420
                 END;                                                   00021430
                                                                        00021440
              IF INNTEKT.AGIVKODENR(2) = 0 THEN                         00021450
                 S001I09O.AGIVKODE2A = NOR_NUM;                         00021460
              ELSE                                                      00021470
                 DO;                                                    00021480
                    S001I09O.AGIVKODE2A = BRI_NUM;                      00021490
                    S001I09I.AGIVKODE2L = CURSOR_POS;                   00021500
                    IF INNTEKT.AGIVKODENR(2) ^= 999 THEN                00021510
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(2));          00021520
                 END;                                                   00021530
                                                                        00021540
           END;                                                         00021550
                                                                        00021560
                                                                        00021570
                                                                        00021580
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(3)) ^= (11)'0' THEN            00021590
           DO;                                                          00021600
              IF INNTEKT.FNRNR(3) = 0 THEN                              00021610
                 S001I09O.FNR3A = NOR_NUM;                              00021620
              ELSE                                                      00021630
                 DO;                                                    00021640
                    S001I09O.FNR3A = BRI_NUM;                           00021650
                    S001I09I.FNR3L = CURSOR_POS;                        00021660
                    IF INNTEKT.FNRNR(3) ^= 999 THEN                     00021670
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(3));               00021680
                 END;                                                   00021690
                                                                        00021700
              IF INNTEKT.ÅRNR(3) = 0 THEN                               00021710
                 S001I09O.ÅR3A = NOR_NUM;                               00021720
              ELSE                                                      00021730
                 DO;                                                    00021740
                    S001I09O.ÅR3A = BRI_NUM;                            00021750
                    S001I09I.ÅR3L = CURSOR_POS;                         00021760
                    IF INNTEKT.ÅRNR(3) ^= 999 THEN                      00021770
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(3));                00021780
                 END;                                                   00021790
                                                                        00021800
              IF INNTEKT.TYPENR(3) = 0 THEN                             00021810
                 S001I09O.TYPE3A = NORMAL;                              00021820
              ELSE                                                      00021830
                 DO;                                                    00021840
                    S001I09O.TYPE3A = DFHBMBRY;                         00021850
                    S001I09I.TYPE3L = CURSOR_POS;                       00021860
                    IF INNTEKT.TYPENR(3) ^= 999 THEN                    00021870
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(3));              00021880
                 END;                                                   00021890
                                                                        00021900
              IF INNTEKT.ETYPENR(3) = 0 THEN                            00021910
                 S001I09O.ETYPE3A = NORMAL;                             00021920
              ELSE                                                      00021930
                 DO;                                                    00021940
                    S001I09O.ETYPE3A = DFHBMBRY;                        00021950
                    S001I09I.ETYPE3L = CURSOR_POS;                      00021960
                    IF INNTEKT.ETYPENR(3) ^= 999 THEN                   00021970
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(3));             00021980
                 END;                                                   00021990
                                                                        00022000
              IF INNTEKT.ARTNR(3) = 0 THEN                              00022010
                 S001I09O.ART3A = NOR_NUM;                              00022020
              ELSE                                                      00022030
                 DO;                                                    00022040
                    S001I09O.ART3A = BRI_NUM;                           00022050
                    S001I09I.ART3L = CURSOR_POS;                        00022060
                    IF INNTEKT.ARTNR(3) ^= 999 THEN                     00022070
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(3));               00022080
                 END;                                                   00022090
                                                                        00022100
              IF INNTEKT.MERKENR(3) = 0 THEN                            00022110
                 S001I09O.MERKE3A = NOR_NUM;                            00022120
              ELSE                                                      00022130
                 DO;                                                    00022140
                    S001I09O.MERKE3A = BRI_NUM;                         00022150
                    S001I09I.MERKE3L = CURSOR_POS;                      00022160
                    IF INNTEKT.MERKENR(3) ^= 999 THEN                   00022170
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(3));             00022180
                 END;                                                   00022190
                                                                        00022200
              IF INNTEKT.KOMMNRNR(3) = 0 THEN                           00022210
                 S001I09O.KOMMNR3A = NOR_NUM;                           00022220
              ELSE                                                      00022230
                 DO;                                                    00022240
                    S001I09O.KOMMNR3A = BRI_NUM;                        00022250
                    S001I09I.KOMMNR3L = CURSOR_POS;                     00022260
                    IF INNTEKT.KOMMNRNR(3) ^= 999 THEN                  00022270
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(3));            00022280
                 END;                                                   00022290
                                                                        00022300
              IF INNTEKT.PG_INNTEKTNR(3) = 0 THEN                       00022310
                 S001I09O.INNTEKT3A = NOR_NUM;                          00022320
              ELSE                                                      00022330
                 DO;                                                    00022340
                    S001I09O.INNTEKT3A = BRI_NUM;                       00022350
                    S001I09I.INNTEKT3L = CURSOR_POS;                    00022360
                    IF INNTEKT.PG_INNTEKTNR(3) ^= 999 THEN              00022370
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(3));        00022380
                 END;                                                   00022390
                                                                        00022400
              IF INNTEKT.AGIVKODENR(3) = 0 THEN                         00022410
                 S001I09O.AGIVKODE3A = NOR_NUM;                         00022420
              ELSE                                                      00022430
                 DO;                                                    00022440
                    S001I09O.AGIVKODE3A = BRI_NUM;                      00022450
                    S001I09I.AGIVKODE3L = CURSOR_POS;                   00022460
                    IF INNTEKT.AGIVKODENR(3) ^= 999 THEN                00022470
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(3));          00022480
                 END;                                                   00022490
                                                                        00022500
           END;                                                         00022510
                                                                        00022520
                                                                        00022530
                                                                        00022540
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(4)) ^= (11)'0' THEN            00022550
           DO;                                                          00022560
              IF INNTEKT.FNRNR(4) = 0 THEN                              00022570
                 S001I09O.FNR4A = NOR_NUM;                              00022580
              ELSE                                                      00022590
                 DO;                                                    00022600
                    S001I09O.FNR4A = BRI_NUM;                           00022610
                    S001I09I.FNR4L = CURSOR_POS;                        00022620
                    IF INNTEKT.FNRNR(4) ^= 999 THEN                     00022630
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(4));               00022640
                 END;                                                   00022650
                                                                        00022660
              IF INNTEKT.ÅRNR(4) = 0 THEN                               00022670
                 S001I09O.ÅR4A = NOR_NUM;                               00022680
              ELSE                                                      00022690
                 DO;                                                    00022700
                    S001I09O.ÅR4A = BRI_NUM;                            00022710
                    S001I09I.ÅR4L = CURSOR_POS;                         00022720
                    IF INNTEKT.ÅRNR(4) ^= 999 THEN                      00022730
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(4));                00022740
                 END;                                                   00022750
                                                                        00022760
              IF INNTEKT.TYPENR(4) = 0 THEN                             00022770
                 S001I09O.TYPE4A = NORMAL;                              00022780
              ELSE                                                      00022790
                 DO;                                                    00022800
                    S001I09O.TYPE4A = DFHBMBRY;                         00022810
                    S001I09I.TYPE4L = CURSOR_POS;                       00022820
                    IF INNTEKT.TYPENR(4) ^= 999 THEN                    00022830
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(4));              00022840
                 END;                                                   00022850
                                                                        00022860
              IF INNTEKT.ETYPENR(4) = 0 THEN                            00022870
                 S001I09O.ETYPE4A = NORMAL;                             00022880
              ELSE                                                      00022890
                 DO;                                                    00022900
                    S001I09O.ETYPE4A = DFHBMBRY;                        00022910
                    S001I09I.ETYPE4L = CURSOR_POS;                      00022920
                    IF INNTEKT.ETYPENR(4) ^= 999 THEN                   00022930
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(4));             00022940
                 END;                                                   00022950
                                                                        00022960
              IF INNTEKT.ARTNR(4) = 0 THEN                              00022970
                 S001I09O.ART4A = NOR_NUM;                              00022980
              ELSE                                                      00022990
                 DO;                                                    00023000
                    S001I09O.ART4A = BRI_NUM;                           00023010
                    S001I09I.ART4L = CURSOR_POS;                        00023020
                    IF INNTEKT.ARTNR(4) ^= 999 THEN                     00023030
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(4));               00023040
                 END;                                                   00023050
                                                                        00023060
              IF INNTEKT.MERKENR(4) = 0 THEN                            00023070
                 S001I09O.MERKE4A = NOR_NUM;                            00023080
              ELSE                                                      00023090
                 DO;                                                    00023100
                    S001I09O.MERKE4A = BRI_NUM;                         00023110
                    S001I09I.MERKE4L = CURSOR_POS;                      00023120
                    IF INNTEKT.MERKENR(4) ^= 999 THEN                   00023130
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(4));             00023140
                 END;                                                   00023150
                                                                        00023160
              IF INNTEKT.KOMMNRNR(4) = 0 THEN                           00023170
                 S001I09O.KOMMNR4A = NOR_NUM;                           00023180
              ELSE                                                      00023190
                 DO;                                                    00023200
                    S001I09O.KOMMNR4A = BRI_NUM;                        00023210
                    S001I09I.KOMMNR4L = CURSOR_POS;                     00023220
                    IF INNTEKT.KOMMNRNR(4) ^= 999 THEN                  00023230
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(4));            00023240
                 END;                                                   00023250
                                                                        00023260
              IF INNTEKT.PG_INNTEKTNR(4) = 0 THEN                       00023270
                 S001I09O.INNTEKT4A = NOR_NUM;                          00023280
              ELSE                                                      00023290
                 DO;                                                    00023300
                    S001I09O.INNTEKT4A = BRI_NUM;                       00023310
                    S001I09I.INNTEKT4L = CURSOR_POS;                    00023320
                    IF INNTEKT.PG_INNTEKTNR(4) ^= 999 THEN              00023330
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(4));        00023340
                 END;                                                   00023350
                                                                        00023360
              IF INNTEKT.AGIVKODENR(4) = 0 THEN                         00023370
                 S001I09O.AGIVKODE4A = NOR_NUM;                         00023380
              ELSE                                                      00023390
                 DO;                                                    00023400
                    S001I09O.AGIVKODE4A = BRI_NUM;                      00023410
                    S001I09I.AGIVKODE4L = CURSOR_POS;                   00023420
                    IF INNTEKT.AGIVKODENR(4) ^= 999 THEN                00023430
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(4));          00023440
                 END;                                                   00023450
                                                                        00023460
           END;                                                         00023470
                                                                        00023480
                                                                        00023490
                                                                        00023500
                                                                        00023510
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(5)) ^= (11)'0' THEN            00023520
           DO;                                                          00023530
              IF INNTEKT.FNRNR(5) = 0 THEN                              00023540
                 S001I09O.FNR5A = NOR_NUM;                              00023550
              ELSE                                                      00023560
                 DO;                                                    00023570
                    S001I09O.FNR5A = BRI_NUM;                           00023580
                    S001I09I.FNR5L = CURSOR_POS;                        00023590
                    IF INNTEKT.FNRNR(5) ^= 999 THEN                     00023600
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(5));               00023610
                 END;                                                   00023620
                                                                        00023630
              IF INNTEKT.ÅRNR(5) = 0 THEN                               00023640
                 S001I09O.ÅR5A = NOR_NUM;                               00023650
              ELSE                                                      00023660
                 DO;                                                    00023670
                    S001I09O.ÅR5A = BRI_NUM;                            00023680
                    S001I09I.ÅR5L = CURSOR_POS;                         00023690
                    IF INNTEKT.ÅRNR(5) ^= 999 THEN                      00023700
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(5));                00023710
                 END;                                                   00023720
                                                                        00023730
              IF INNTEKT.TYPENR(5) = 0 THEN                             00023740
                 S001I09O.TYPE5A = NORMAL;                              00023750
              ELSE                                                      00023760
                 DO;                                                    00023770
                    S001I09O.TYPE5A = DFHBMBRY;                         00023780
                    S001I09I.TYPE5L = CURSOR_POS;                       00023790
                    IF INNTEKT.TYPENR(5) ^= 999 THEN                    00023800
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(5));              00023810
                 END;                                                   00023820
                                                                        00023830
              IF INNTEKT.ETYPENR(5) = 0 THEN                            00023840
                 S001I09O.ETYPE5A = NORMAL;                             00023850
              ELSE                                                      00023860
                 DO;                                                    00023870
                    S001I09O.ETYPE5A = DFHBMBRY;                        00023880
                    S001I09I.ETYPE5L = CURSOR_POS;                      00023890
                    IF INNTEKT.ETYPENR(5) ^= 999 THEN                   00023900
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(5));             00023910
                 END;                                                   00023920
                                                                        00023930
              IF INNTEKT.ARTNR(5) = 0 THEN                              00023940
                 S001I09O.ART5A = NOR_NUM;                              00023950
              ELSE                                                      00023960
                 DO;                                                    00023970
                    S001I09O.ART5A = BRI_NUM;                           00023980
                    S001I09I.ART5L = CURSOR_POS;                        00023990
                    IF INNTEKT.ARTNR(5) ^= 999 THEN                     00024000
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(5));               00024010
                 END;                                                   00024020
                                                                        00024030
              IF INNTEKT.MERKENR(5) = 0 THEN                            00024040
                 S001I09O.MERKE5A = NOR_NUM;                            00024050
              ELSE                                                      00024060
                 DO;                                                    00024070
                    S001I09O.MERKE5A = BRI_NUM;                         00024080
                    S001I09I.MERKE5L = CURSOR_POS;                      00024090
                    IF INNTEKT.MERKENR(5) ^= 999 THEN                   00024100
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(5));             00024110
                 END;                                                   00024120
                                                                        00024130
              IF INNTEKT.KOMMNRNR(5) = 0 THEN                           00024140
                 S001I09O.KOMMNR5A = NOR_NUM;                           00024150
              ELSE                                                      00024160
                 DO;                                                    00024170
                    S001I09O.KOMMNR5A = BRI_NUM;                        00024180
                    S001I09I.KOMMNR5L = CURSOR_POS;                     00024190
                    IF INNTEKT.KOMMNRNR(5) ^= 999 THEN                  00024200
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(5));            00024210
                 END;                                                   00024220
                                                                        00024230
              IF INNTEKT.PG_INNTEKTNR(5) = 0 THEN                       00024240
                 S001I09O.INNTEKT5A = NOR_NUM;                          00024250
              ELSE                                                      00024260
                 DO;                                                    00024270
                    S001I09O.INNTEKT5A = BRI_NUM;                       00024280
                    S001I09I.INNTEKT5L = CURSOR_POS;                    00024290
                    IF INNTEKT.PG_INNTEKTNR(5) ^= 999 THEN              00024300
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(5));        00024310
                 END;                                                   00024320
                                                                        00024330
              IF INNTEKT.AGIVKODENR(5) = 0 THEN                         00024340
                 S001I09O.AGIVKODE5A = NOR_NUM;                         00024350
              ELSE                                                      00024360
                 DO;                                                    00024370
                    S001I09O.AGIVKODE5A = BRI_NUM;                      00024380
                    S001I09I.AGIVKODE5L = CURSOR_POS;                   00024390
                    IF INNTEKT.AGIVKODENR(5) ^= 999 THEN                00024400
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(5));          00024410
                 END;                                                   00024420
                                                                        00024430
           END;                                                         00024440
                                                                        00024450
                                                                        00024460
                                                                        00024470
                                                                        00024480
                                                                        00024490
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(6)) ^= (11)'0' THEN            00024500
           DO;                                                          00024510
              IF INNTEKT.FNRNR(6) = 0 THEN                              00024520
                 S001I09O.FNR6A = NOR_NUM;                              00024530
              ELSE                                                      00024540
                 DO;                                                    00024550
                    S001I09O.FNR6A = BRI_NUM;                           00024560
                    S001I09I.FNR6L = CURSOR_POS;                        00024570
                    IF INNTEKT.FNRNR(6) ^= 999 THEN                     00024580
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(6));               00024590
                 END;                                                   00024600
                                                                        00024610
              IF INNTEKT.ÅRNR(6) = 0 THEN                               00024620
                 S001I09O.ÅR6A = NOR_NUM;                               00024630
              ELSE                                                      00024640
                 DO;                                                    00024650
                    S001I09O.ÅR6A = BRI_NUM;                            00024660
                    S001I09I.ÅR6L = CURSOR_POS;                         00024670
                    IF INNTEKT.ÅRNR(6) ^= 999 THEN                      00024680
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(6));                00024690
                 END;                                                   00024700
                                                                        00024710
              IF INNTEKT.TYPENR(6) = 0 THEN                             00024720
                 S001I09O.TYPE6A = NORMAL;                              00024730
              ELSE                                                      00024740
                 DO;                                                    00024750
                    S001I09O.TYPE6A = DFHBMBRY;                         00024760
                    S001I09I.TYPE6L = CURSOR_POS;                       00024770
                    IF INNTEKT.TYPENR(6) ^= 999 THEN                    00024780
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(6));              00024790
                 END;                                                   00024800
                                                                        00024810
              IF INNTEKT.ETYPENR(6) = 0 THEN                            00024820
                 S001I09O.ETYPE6A = NORMAL;                             00024830
              ELSE                                                      00024840
                 DO;                                                    00024850
                    S001I09O.ETYPE6A = DFHBMBRY;                        00024860
                    S001I09I.ETYPE6L = CURSOR_POS;                      00024870
                    IF INNTEKT.ETYPENR(6) ^= 999 THEN                   00024880
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(6));             00024890
                 END;                                                   00024900
                                                                        00024910
              IF INNTEKT.ARTNR(6) = 0 THEN                              00024920
                 S001I09O.ART6A = NOR_NUM;                              00024930
              ELSE                                                      00024940
                 DO;                                                    00024950
                    S001I09O.ART6A = BRI_NUM;                           00024960
                    S001I09I.ART6L = CURSOR_POS;                        00024970
                    IF INNTEKT.ARTNR(6) ^= 999 THEN                     00024980
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(6));               00024990
                 END;                                                   00025000
                                                                        00025010
              IF INNTEKT.MERKENR(6) = 0 THEN                            00025020
                 S001I09O.MERKE6A = NOR_NUM;                            00025030
              ELSE                                                      00025040
                 DO;                                                    00025050
                    S001I09O.MERKE6A = BRI_NUM;                         00025060
                    S001I09I.MERKE6L = CURSOR_POS;                      00025070
                    IF INNTEKT.MERKENR(6) ^= 999 THEN                   00025080
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(6));             00025090
                 END;                                                   00025100
                                                                        00025110
              IF INNTEKT.KOMMNRNR(6) = 0 THEN                           00025120
                 S001I09O.KOMMNR6A = NOR_NUM;                           00025130
              ELSE                                                      00025140
                 DO;                                                    00025150
                    S001I09O.KOMMNR6A = BRI_NUM;                        00025160
                    S001I09I.KOMMNR6L = CURSOR_POS;                     00025170
                    IF INNTEKT.KOMMNRNR(6) ^= 999 THEN                  00025180
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(6));            00025190
                 END;                                                   00025200
                                                                        00025210
              IF INNTEKT.PG_INNTEKTNR(6) = 0 THEN                       00025220
                 S001I09O.INNTEKT6A = NOR_NUM;                          00025230
              ELSE                                                      00025240
                 DO;                                                    00025250
                    S001I09O.INNTEKT6A = BRI_NUM;                       00025260
                    S001I09I.INNTEKT6L = CURSOR_POS;                    00025270
                    IF INNTEKT.PG_INNTEKTNR(6) ^= 999 THEN              00025280
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(6));        00025290
                 END;                                                   00025300
                                                                        00025310
              IF INNTEKT.AGIVKODENR(6) = 0 THEN                         00025320
                 S001I09O.AGIVKODE6A = NOR_NUM;                         00025330
              ELSE                                                      00025340
                 DO;                                                    00025350
                    S001I09O.AGIVKODE6A = BRI_NUM;                      00025360
                    S001I09I.AGIVKODE6L = CURSOR_POS;                   00025370
                    IF INNTEKT.AGIVKODENR(6) ^= 999 THEN                00025380
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(6));          00025390
                 END;                                                   00025400
           END;                                                         00025410
                                                                        00025420
                                                                        00025430
                                                                        00025440
                                                                        00025450
                                                                        00025460
                                                                        00025470
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(7)) ^= (11)'0' THEN            00025480
           DO;                                                          00025490
              IF INNTEKT.FNRNR(7) = 0 THEN                              00025500
                 S001I09O.FNR7A = NOR_NUM;                              00025510
              ELSE                                                      00025520
                 DO;                                                    00025530
                    S001I09O.FNR7A = BRI_NUM;                           00025540
                    S001I09I.FNR7L = CURSOR_POS;                        00025550
                    IF INNTEKT.FNRNR(7) ^= 999 THEN                     00025560
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(7));               00025570
                 END;                                                   00025580
                                                                        00025590
              IF INNTEKT.ÅRNR(7) = 0 THEN                               00025600
                 S001I09O.ÅR7A = NOR_NUM;                               00025610
              ELSE                                                      00025620
                 DO;                                                    00025630
                    S001I09O.ÅR7A = BRI_NUM;                            00025640
                    S001I09I.ÅR7L = CURSOR_POS;                         00025650
                    IF INNTEKT.ÅRNR(7) ^= 999 THEN                      00025660
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(7));                00025670
                 END;                                                   00025680
                                                                        00025690
              IF INNTEKT.TYPENR(7) = 0 THEN                             00025700
                 S001I09O.TYPE7A = NORMAL;                              00025710
              ELSE                                                      00025720
                 DO;                                                    00025730
                    S001I09O.TYPE7A = DFHBMBRY;                         00025740
                    S001I09I.TYPE7L = CURSOR_POS;                       00025750
                    IF INNTEKT.TYPENR(7) ^= 999 THEN                    00025760
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(7));              00025770
                 END;                                                   00025780
                                                                        00025790
              IF INNTEKT.ETYPENR(7) = 0 THEN                            00025800
                 S001I09O.ETYPE7A = NORMAL;                             00025810
              ELSE                                                      00025820
                 DO;                                                    00025830
                    S001I09O.ETYPE7A = DFHBMBRY;                        00025840
                    S001I09I.ETYPE7L = CURSOR_POS;                      00025850
                    IF INNTEKT.ETYPENR(7) ^= 999 THEN                   00025860
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(7));             00025870
                 END;                                                   00025880
                                                                        00025890
              IF INNTEKT.ARTNR(7) = 0 THEN                              00025900
                 S001I09O.ART7A = NOR_NUM;                              00025910
              ELSE                                                      00025920
                 DO;                                                    00025930
                    S001I09O.ART7A = BRI_NUM;                           00025940
                    S001I09I.ART7L = CURSOR_POS;                        00025950
                    IF INNTEKT.ARTNR(7) ^= 999 THEN                     00025960
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(7));               00025970
                 END;                                                   00025980
                                                                        00025990
              IF INNTEKT.MERKENR(7) = 0 THEN                            00026000
                 S001I09O.MERKE7A = NOR_NUM;                            00026010
              ELSE                                                      00026020
                 DO;                                                    00026030
                    S001I09O.MERKE7A = BRI_NUM;                         00026040
                    S001I09I.MERKE7L = CURSOR_POS;                      00026050
                    IF INNTEKT.MERKENR(7) ^= 999 THEN                   00026060
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(7));             00026070
                 END;                                                   00026080
                                                                        00026090
              IF INNTEKT.KOMMNRNR(7) = 0 THEN                           00026100
                 S001I09O.KOMMNR7A = NOR_NUM;                           00026110
              ELSE                                                      00026120
                 DO;                                                    00026130
                    S001I09O.KOMMNR7A = BRI_NUM;                        00026140
                    S001I09I.KOMMNR7L = CURSOR_POS;                     00026150
                    IF INNTEKT.KOMMNRNR(7) ^= 999 THEN                  00026160
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(7));            00026170
                 END;                                                   00026180
                                                                        00026190
              IF INNTEKT.PG_INNTEKTNR(7) = 0 THEN                       00026200
                 S001I09O.INNTEKT7A = NOR_NUM;                          00026210
              ELSE                                                      00026220
                 DO;                                                    00026230
                    S001I09O.INNTEKT7A = BRI_NUM;                       00026240
                    S001I09I.INNTEKT7L = CURSOR_POS;                    00026250
                    IF INNTEKT.PG_INNTEKTNR(7) ^= 999 THEN              00026260
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(7));        00026270
                 END;                                                   00026280
                                                                        00026290
              IF INNTEKT.AGIVKODENR(7) = 0 THEN                         00026300
                 S001I09O.AGIVKODE7A = NOR_NUM;                         00026310
              ELSE                                                      00026320
                 DO;                                                    00026330
                    S001I09O.AGIVKODE7A = BRI_NUM;                      00026340
                    S001I09I.AGIVKODE7L = CURSOR_POS;                   00026350
                    IF INNTEKT.AGIVKODENR(7) ^= 999 THEN                00026360
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(7));          00026370
                 END;                                                   00026380
           END;                                                         00026390
                                                                        00026400
                                                                        00026410
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(8)) ^= (11)'0' THEN            00026420
           DO;                                                          00026430
              IF INNTEKT.FNRNR(8) = 0 THEN                              00026440
                 S001I09O.FNR8A = NOR_NUM;                              00026450
              ELSE                                                      00026460
                 DO;                                                    00026470
                    S001I09O.FNR8A = BRI_NUM;                           00026480
                    S001I09I.FNR8L = CURSOR_POS;                        00026490
                    IF INNTEKT.FNRNR(8) ^= 999 THEN                     00026500
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(8));               00026510
                 END;                                                   00026520
                                                                        00026530
              IF INNTEKT.ÅRNR(8) = 0 THEN                               00026540
                 S001I09O.ÅR8A = NOR_NUM;                               00026550
              ELSE                                                      00026560
                 DO;                                                    00026570
                    S001I09O.ÅR8A = BRI_NUM;                            00026580
                    S001I09I.ÅR8L = CURSOR_POS;                         00026590
                    IF INNTEKT.ÅRNR(8) ^= 999 THEN                      00026600
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(8));                00026610
                 END;                                                   00026620
                                                                        00026630
              IF INNTEKT.TYPENR(8) = 0 THEN                             00026640
                 S001I09O.TYPE8A = NORMAL;                              00026650
              ELSE                                                      00026660
                 DO;                                                    00026670
                    S001I09O.TYPE8A = DFHBMBRY;                         00026680
                    S001I09I.TYPE8L = CURSOR_POS;                       00026690
                    IF INNTEKT.TYPENR(8) ^= 999 THEN                    00026700
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(8));              00026710
                 END;                                                   00026720
                                                                        00026730
              IF INNTEKT.ETYPENR(8) = 0 THEN                            00026740
                 S001I09O.ETYPE8A = NORMAL;                             00026750
              ELSE                                                      00026760
                 DO;                                                    00026770
                    S001I09O.ETYPE8A = DFHBMBRY;                        00026780
                    S001I09I.ETYPE8L = CURSOR_POS;                      00026790
                    IF INNTEKT.ETYPENR(8) ^= 999 THEN                   00026800
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(8));             00026810
                 END;                                                   00026820
                                                                        00026830
              IF INNTEKT.ARTNR(8) = 0 THEN                              00026840
                 S001I09O.ART8A = NOR_NUM;                              00026850
              ELSE                                                      00026860
                 DO;                                                    00026870
                    S001I09O.ART8A = BRI_NUM;                           00026880
                    S001I09I.ART8L = CURSOR_POS;                        00026890
                    IF INNTEKT.ARTNR(8) ^= 999 THEN                     00026900
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(8));               00026910
                 END;                                                   00026920
                                                                        00026930
              IF INNTEKT.MERKENR(8) = 0 THEN                            00026940
                 S001I09O.MERKE8A = NOR_NUM;                            00026950
              ELSE                                                      00026960
                 DO;                                                    00026970
                    S001I09O.MERKE8A = BRI_NUM;                         00026980
                    S001I09I.MERKE8L = CURSOR_POS;                      00026990
                    IF INNTEKT.MERKENR(8) ^= 999 THEN                   00027000
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(8));             00027010
                 END;                                                   00027020
                                                                        00027030
              IF INNTEKT.KOMMNRNR(8) = 0 THEN                           00027040
                 S001I09O.KOMMNR8A = NOR_NUM;                           00027050
              ELSE                                                      00027060
                 DO;                                                    00027070
                    S001I09O.KOMMNR8A = BRI_NUM;                        00027080
                    S001I09I.KOMMNR8L = CURSOR_POS;                     00027090
                    IF INNTEKT.KOMMNRNR(8) ^= 999 THEN                  00027100
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(8));            00027110
                 END;                                                   00027120
                                                                        00027130
              IF INNTEKT.PG_INNTEKTNR(8) = 0 THEN                       00027140
                 S001I09O.INNTEKT8A = NOR_NUM;                          00027150
              ELSE                                                      00027160
                 DO;                                                    00027170
                    S001I09O.INNTEKT8A = BRI_NUM;                       00027180
                    S001I09I.INNTEKT8L = CURSOR_POS;                    00027190
                    IF INNTEKT.PG_INNTEKTNR(8) ^= 999 THEN              00027200
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(8));        00027210
                 END;                                                   00027220
                                                                        00027230
              IF INNTEKT.AGIVKODENR(8) = 0 THEN                         00027240
                 S001I09O.AGIVKODE8A = NOR_NUM;                         00027250
              ELSE                                                      00027260
                 DO;                                                    00027270
                    S001I09O.AGIVKODE8A = BRI_NUM;                      00027280
                    S001I09I.AGIVKODE8L = CURSOR_POS;                   00027290
                    IF INNTEKT.AGIVKODENR(8) ^= 999 THEN                00027300
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(8));          00027310
                 END;                                                   00027320
           END;                                                         00027330
                                                                        00027340
                                                                        00027350
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(9)) ^= (11)'0' THEN            00027360
           DO;                                                          00027370
              IF INNTEKT.FNRNR(9) = 0 THEN                              00027380
                 S001I09O.FNR9A = NOR_NUM;                              00027390
              ELSE                                                      00027400
                 DO;                                                    00027410
                    S001I09O.FNR9A = BRI_NUM;                           00027420
                    S001I09I.FNR9L = CURSOR_POS;                        00027430
                    IF INNTEKT.FNRNR(9) ^= 999 THEN                     00027440
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(9));               00027450
                 END;                                                   00027460
                                                                        00027470
              IF INNTEKT.ÅRNR(9) = 0 THEN                               00027480
                 S001I09O.ÅR9A = NOR_NUM;                               00027490
              ELSE                                                      00027500
                 DO;                                                    00027510
                    S001I09O.ÅR9A = BRI_NUM;                            00027520
                    S001I09I.ÅR9L = CURSOR_POS;                         00027530
                    IF INNTEKT.ÅRNR(9) ^= 999 THEN                      00027540
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(9));                00027550
                 END;                                                   00027560
                                                                        00027570
              IF INNTEKT.TYPENR(9) = 0 THEN                             00027580
                 S001I09O.TYPE9A = NORMAL;                              00027590
              ELSE                                                      00027600
                 DO;                                                    00027610
                    S001I09O.TYPE9A = DFHBMBRY;                         00027620
                    S001I09I.TYPE9L = CURSOR_POS;                       00027630
                    IF INNTEKT.TYPENR(9) ^= 999 THEN                    00027640
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(9));              00027650
                 END;                                                   00027660
                                                                        00027670
              IF INNTEKT.ETYPENR(9) = 0 THEN                            00027680
                 S001I09O.ETYPE9A = NORMAL;                             00027690
              ELSE                                                      00027700
                 DO;                                                    00027710
                    S001I09O.ETYPE9A = DFHBMBRY;                        00027720
                    S001I09I.ETYPE9L = CURSOR_POS;                      00027730
                    IF INNTEKT.ETYPENR(9) ^= 999 THEN                   00027740
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(9));             00027750
                 END;                                                   00027760
                                                                        00027770
              IF INNTEKT.ARTNR(9) = 0 THEN                              00027780
                 S001I09O.ART9A = NOR_NUM;                              00027790
              ELSE                                                      00027800
                 DO;                                                    00027810
                    S001I09O.ART9A = BRI_NUM;                           00027820
                    S001I09I.ART9L = CURSOR_POS;                        00027830
                    IF INNTEKT.ARTNR(9) ^= 999 THEN                     00027840
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(9));               00027850
                 END;                                                   00027860
                                                                        00027870
              IF INNTEKT.MERKENR(9) = 0 THEN                            00027880
                 S001I09O.MERKE9A = NOR_NUM;                            00027890
              ELSE                                                      00027900
                 DO;                                                    00027910
                    S001I09O.MERKE9A = BRI_NUM;                         00027920
                    S001I09I.MERKE9L = CURSOR_POS;                      00027930
                    IF INNTEKT.MERKENR(9) ^= 999 THEN                   00027940
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(9));             00027950
                 END;                                                   00027960
                                                                        00027970
              IF INNTEKT.KOMMNRNR(9) = 0 THEN                           00027980
                 S001I09O.KOMMNR9A = NOR_NUM;                           00027990
              ELSE                                                      00028000
                 DO;                                                    00028010
                    S001I09O.KOMMNR9A = BRI_NUM;                        00028020
                    S001I09I.KOMMNR9L = CURSOR_POS;                     00028030
                    IF INNTEKT.KOMMNRNR(9) ^= 999 THEN                  00028040
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(9));            00028050
                 END;                                                   00028060
                                                                        00028070
              IF INNTEKT.PG_INNTEKTNR(9) = 0 THEN                       00028080
                 S001I09O.INNTEKT9A = NOR_NUM;                          00028090
              ELSE                                                      00028100
                 DO;                                                    00028110
                    S001I09O.INNTEKT9A = BRI_NUM;                       00028120
                    S001I09I.INNTEKT9L = CURSOR_POS;                    00028130
                    IF INNTEKT.PG_INNTEKTNR(9) ^= 999 THEN              00028140
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(9));        00028150
                 END;                                                   00028160
                                                                        00028170
              IF INNTEKT.AGIVKODENR(9) = 0 THEN                         00028180
                 S001I09O.AGIVKODE9A = NOR_NUM;                         00028190
              ELSE                                                      00028200
                 DO;                                                    00028210
                    S001I09O.AGIVKODE9A = BRI_NUM;                      00028220
                    S001I09I.AGIVKODE9L = CURSOR_POS;                   00028230
                    IF INNTEKT.AGIVKODENR(9) ^= 999 THEN                00028240
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(9));          00028250
                 END;                                                   00028260
           END;                                                         00028270
                                                                        00028280
                                                                        00028290
                                                                        00028300
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(10)) ^= (11)'0' THEN           00028310
           DO;                                                          00028320
              IF INNTEKT.FNRNR(10) = 0 THEN                             00028330
                 S001I09O.FNR10A = NOR_NUM;                             00028340
              ELSE                                                      00028350
                 DO;                                                    00028360
                    S001I09O.FNR10A = BRI_NUM;                          00028370
                    S001I09I.FNR10L = CURSOR_POS;                       00028380
                    IF INNTEKT.FNRNR(10) ^= 999 THEN                    00028390
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(10));              00028400
                 END;                                                   00028410
                                                                        00028420
              IF INNTEKT.ÅRNR(10) = 0 THEN                              00028430
                 S001I09O.ÅR10A = NOR_NUM;                              00028440
              ELSE                                                      00028450
                 DO;                                                    00028460
                    S001I09O.ÅR10A = BRI_NUM;                           00028470
                    S001I09I.ÅR10L = CURSOR_POS;                        00028480
                    IF INNTEKT.ÅRNR(10) ^= 999 THEN                     00028490
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(10));               00028500
                 END;                                                   00028510
                                                                        00028520
              IF INNTEKT.TYPENR(10) = 0 THEN                            00028530
                 S001I09O.TYPE10A = NORMAL;                             00028540
              ELSE                                                      00028550
                 DO;                                                    00028560
                    S001I09O.TYPE10A = DFHBMBRY;                        00028570
                    S001I09I.TYPE10L = CURSOR_POS;                      00028580
                    IF INNTEKT.TYPENR(10) ^= 999 THEN                   00028590
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(10));             00028600
                 END;                                                   00028610
                                                                        00028620
              IF INNTEKT.ETYPENR(10) = 0 THEN                           00028630
                 S001I09O.ETYPE10A = NORMAL;                            00028640
              ELSE                                                      00028650
                 DO;                                                    00028660
                    S001I09O.ETYPE10A = DFHBMBRY;                       00028670
                    S001I09I.ETYPE10L = CURSOR_POS;                     00028680
                    IF INNTEKT.ETYPENR(10) ^= 999 THEN                  00028690
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(10));            00028700
                 END;                                                   00028710
                                                                        00028720
              IF INNTEKT.ARTNR(10) = 0 THEN                             00028730
                 S001I09O.ART10A = NOR_NUM;                             00028740
              ELSE                                                      00028750
                 DO;                                                    00028760
                    S001I09O.ART10A = BRI_NUM;                          00028770
                    S001I09I.ART10L = CURSOR_POS;                       00028780
                    IF INNTEKT.ARTNR(10) ^= 999 THEN                    00028790
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(10));              00028800
                 END;                                                   00028810
                                                                        00028820
              IF INNTEKT.MERKENR(10) = 0 THEN                           00028830
                 S001I09O.MERKE10A = NOR_NUM;                           00028840
              ELSE                                                      00028850
                 DO;                                                    00028860
                    S001I09O.MERKE10A = BRI_NUM;                        00028870
                    S001I09I.MERKE10L = CURSOR_POS;                     00028880
                    IF INNTEKT.MERKENR(10) ^= 999 THEN                  00028890
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(10));            00028900
                 END;                                                   00028910
                                                                        00028920
              IF INNTEKT.KOMMNRNR(10) = 0 THEN                          00028930
                 S001I09O.KOMMNR10A = NOR_NUM;                          00028940
              ELSE                                                      00028950
                 DO;                                                    00028960
                    S001I09O.KOMMNR10A = BRI_NUM;                       00028970
                    S001I09I.KOMMNR10L = CURSOR_POS;                    00028980
                    IF INNTEKT.KOMMNRNR(10) ^= 999 THEN                 00028990
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(10));           00029000
                 END;                                                   00029010
                                                                        00029020
              IF INNTEKT.PG_INNTEKTNR(10) = 0 THEN                      00029030
                 S001I09O.INNTEKT10A = NOR_NUM;                         00029040
              ELSE                                                      00029050
                 DO;                                                    00029060
                    S001I09O.INNTEKT10A = BRI_NUM;                      00029070
                    S001I09I.INNTEKT10L = CURSOR_POS;                   00029080
                    IF INNTEKT.PG_INNTEKTNR(10) ^= 999 THEN             00029090
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(10));       00029100
                 END;                                                   00029110
                                                                        00029120
              IF INNTEKT.AGIVKODENR(10) = 0 THEN                        00029130
                 S001I09O.AGIVKODE10A = NOR_NUM;                        00029140
              ELSE                                                      00029150
                 DO;                                                    00029160
                    S001I09O.AGIVKODE10A = BRI_NUM;                     00029170
                    S001I09I.AGIVKODE10L = CURSOR_POS;                  00029180
                    IF INNTEKT.AGIVKODENR(10) ^= 999 THEN               00029190
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(10));         00029200
                 END;                                                   00029210
           END;                                                         00029220
                                                                        00029230
                                                                        00029240
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(11)) ^= (11)'0' THEN           00029250
           DO;                                                          00029260
              IF INNTEKT.FNRNR(11) = 0 THEN                             00029270
                 S001I09O.FNR11A = NOR_NUM;                             00029280
              ELSE                                                      00029290
                 DO;                                                    00029300
                    S001I09O.FNR11A = BRI_NUM;                          00029310
                    S001I09I.FNR11L = CURSOR_POS;                       00029320
                    IF INNTEKT.FNRNR(11) ^= 999 THEN                    00029330
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(11));              00029340
                 END;                                                   00029350
                                                                        00029360
              IF INNTEKT.ÅRNR(11) = 0 THEN                              00029370
                 S001I09O.ÅR11A = NOR_NUM;                              00029380
              ELSE                                                      00029390
                 DO;                                                    00029400
                    S001I09O.ÅR11A = BRI_NUM;                           00029410
                    S001I09I.ÅR11L = CURSOR_POS;                        00029420
                    IF INNTEKT.ÅRNR(11) ^= 999 THEN                     00029430
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(11));               00029440
                 END;                                                   00029450
                                                                        00029460
              IF INNTEKT.TYPENR(11) = 0 THEN                            00029470
                 S001I09O.TYPE11A = NORMAL;                             00029480
              ELSE                                                      00029490
                 DO;                                                    00029500
                    S001I09O.TYPE11A = DFHBMBRY;                        00029510
                    S001I09I.TYPE11L = CURSOR_POS;                      00029520
                    IF INNTEKT.TYPENR(11) ^= 999 THEN                   00029530
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(11));             00029540
                 END;                                                   00029550
                                                                        00029560
              IF INNTEKT.ETYPENR(11) = 0 THEN                           00029570
                 S001I09O.ETYPE11A = NORMAL;                            00029580
              ELSE                                                      00029590
                 DO;                                                    00029600
                    S001I09O.ETYPE11A = DFHBMBRY;                       00029610
                    S001I09I.ETYPE11L = CURSOR_POS;                     00029620
                    IF INNTEKT.ETYPENR(11) ^= 999 THEN                  00029630
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(11));            00029640
                 END;                                                   00029650
                                                                        00029660
              IF INNTEKT.ARTNR(11) = 0 THEN                             00029670
                 S001I09O.ART11A = NOR_NUM;                             00029680
              ELSE                                                      00029690
                 DO;                                                    00029700
                    S001I09O.ART11A = BRI_NUM;                          00029710
                    S001I09I.ART11L = CURSOR_POS;                       00029720
                    IF INNTEKT.ARTNR(11) ^= 999 THEN                    00029730
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(11));              00029740
                 END;                                                   00029750
                                                                        00029760
              IF INNTEKT.MERKENR(11) = 0 THEN                           00029770
                 S001I09O.MERKE11A = NOR_NUM;                           00029780
              ELSE                                                      00029790
                 DO;                                                    00029800
                    S001I09O.MERKE11A = BRI_NUM;                        00029810
                    S001I09I.MERKE11L = CURSOR_POS;                     00029820
                    IF INNTEKT.MERKENR(11) ^= 999 THEN                  00029830
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(11));            00029840
                 END;                                                   00029850
                                                                        00029860
              IF INNTEKT.KOMMNRNR(11) = 0 THEN                          00029870
                 S001I09O.KOMMNR11A = NOR_NUM;                          00029880
              ELSE                                                      00029890
                 DO;                                                    00029900
                    S001I09O.KOMMNR11A = BRI_NUM;                       00029910
                    S001I09I.KOMMNR11L = CURSOR_POS;                    00029920
                    IF INNTEKT.KOMMNRNR(11) ^= 999 THEN                 00029930
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(11));           00029940
                 END;                                                   00029950
                                                                        00029960
              IF INNTEKT.PG_INNTEKTNR(11) = 0 THEN                      00029970
                 S001I09O.INNTEKT11A = NOR_NUM;                         00029980
              ELSE                                                      00029990
                 DO;                                                    00030000
                    S001I09O.INNTEKT11A = BRI_NUM;                      00030010
                    S001I09I.INNTEKT11L = CURSOR_POS;                   00030020
                    IF INNTEKT.PG_INNTEKTNR(11) ^= 999 THEN             00030030
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(11));       00030040
                 END;                                                   00030050
                                                                        00030060
              IF INNTEKT.AGIVKODENR(11) = 0 THEN                        00030070
                 S001I09O.AGIVKODE11A = NOR_NUM;                        00030080
              ELSE                                                      00030090
                 DO;                                                    00030100
                    S001I09O.AGIVKODE11A = BRI_NUM;                     00030110
                    S001I09I.AGIVKODE11L = CURSOR_POS;                  00030120
                    IF INNTEKT.AGIVKODENR(11) ^= 999 THEN               00030130
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(11));         00030140
                 END;                                                   00030150
           END;                                                         00030160
                                                                        00030170
                                                                        00030180
                                                                        00030190
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(12)) ^= (11)'0' THEN           00030200
           DO;                                                          00030210
              IF INNTEKT.FNRNR(12) = 0 THEN                             00030220
                 S001I09O.FNR12A = NOR_NUM;                             00030230
              ELSE                                                      00030240
                 DO;                                                    00030250
                    S001I09O.FNR12A = BRI_NUM;                          00030260
                    S001I09I.FNR12L = CURSOR_POS;                       00030270
                    IF INNTEKT.FNRNR(12) ^= 999 THEN                    00030280
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(12));              00030290
                 END;                                                   00030300
                                                                        00030310
              IF INNTEKT.ÅRNR(12) = 0 THEN                              00030320
                 S001I09O.ÅR12A = NOR_NUM;                              00030330
              ELSE                                                      00030340
                 DO;                                                    00030350
                    S001I09O.ÅR12A = BRI_NUM;                           00030360
                    S001I09I.ÅR12L = CURSOR_POS;                        00030370
                    IF INNTEKT.ÅRNR(12) ^= 999 THEN                     00030380
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(12));               00030390
                 END;                                                   00030400
                                                                        00030410
              IF INNTEKT.TYPENR(12) = 0 THEN                            00030420
                 S001I09O.TYPE12A = NORMAL;                             00030430
              ELSE                                                      00030440
                 DO;                                                    00030450
                    S001I09O.TYPE12A = DFHBMBRY;                        00030460
                    S001I09I.TYPE12L = CURSOR_POS;                      00030470
                    IF INNTEKT.TYPENR(12) ^= 999 THEN                   00030480
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(12));             00030490
                 END;                                                   00030500
                                                                        00030510
              IF INNTEKT.ETYPENR(12) = 0 THEN                           00030520
                 S001I09O.ETYPE12A = NORMAL;                            00030530
              ELSE                                                      00030540
                 DO;                                                    00030550
                    S001I09O.ETYPE12A = DFHBMBRY;                       00030560
                    S001I09I.ETYPE12L = CURSOR_POS;                     00030570
                    IF INNTEKT.ETYPENR(12) ^= 999 THEN                  00030580
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(12));            00030590
                 END;                                                   00030600
                                                                        00030610
              IF INNTEKT.ARTNR(12) = 0 THEN                             00030620
                 S001I09O.ART12A = NOR_NUM;                             00030630
              ELSE                                                      00030640
                 DO;                                                    00030650
                    S001I09O.ART12A = BRI_NUM;                          00030660
                    S001I09I.ART12L = CURSOR_POS;                       00030670
                    IF INNTEKT.ARTNR(12) ^= 999 THEN                    00030680
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(12));              00030690
                 END;                                                   00030700
                                                                        00030710
              IF INNTEKT.MERKENR(12) = 0 THEN                           00030720
                 S001I09O.MERKE12A = NOR_NUM;                           00030730
              ELSE                                                      00030740
                 DO;                                                    00030750
                    S001I09O.MERKE12A = BRI_NUM;                        00030760
                    S001I09I.MERKE12L = CURSOR_POS;                     00030770
                    IF INNTEKT.MERKENR(12) ^= 999 THEN                  00030780
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(12));            00030790
                 END;                                                   00030800
                                                                        00030810
              IF INNTEKT.KOMMNRNR(12) = 0 THEN                          00030820
                 S001I09O.KOMMNR12A = NOR_NUM;                          00030830
              ELSE                                                      00030840
                 DO;                                                    00030850
                    S001I09O.KOMMNR12A = BRI_NUM;                       00030860
                    S001I09I.KOMMNR12L = CURSOR_POS;                    00030870
                    IF INNTEKT.KOMMNRNR(12) ^= 999 THEN                 00030880
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(12));           00030890
                 END;                                                   00030900
                                                                        00030910
              IF INNTEKT.PG_INNTEKTNR(12) = 0 THEN                      00030920
                 S001I09O.INNTEKT12A = NOR_NUM;                         00030930
              ELSE                                                      00030940
                 DO;                                                    00030950
                    S001I09O.INNTEKT12A = BRI_NUM;                      00030960
                    S001I09I.INNTEKT12L = CURSOR_POS;                   00030970
                    IF INNTEKT.PG_INNTEKTNR(12) ^= 999 THEN             00030980
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(12));       00030990
                 END;                                                   00031000
                                                                        00031010
              IF INNTEKT.AGIVKODENR(12) = 0 THEN                        00031020
                 S001I09O.AGIVKODE12A = NOR_NUM;                        00031030
              ELSE                                                      00031040
                 DO;                                                    00031050
                    S001I09O.AGIVKODE12A = BRI_NUM;                     00031060
                    S001I09I.AGIVKODE12L = CURSOR_POS;                  00031070
                    IF INNTEKT.AGIVKODENR(12) ^= 999 THEN               00031080
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(12));         00031090
                 END;                                                   00031100
           END;                                                         00031110
                                                                        00031120
                                                                        00031130
                                                                        00031140
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(13)) ^= (11)'0' THEN           00031150
           DO;                                                          00031160
              IF INNTEKT.FNRNR(13) = 0 THEN                             00031170
                 S001I09O.FNR13A = NOR_NUM;                             00031180
              ELSE                                                      00031190
                 DO;                                                    00031200
                    S001I09O.FNR13A = BRI_NUM;                          00031210
                    S001I09I.FNR13L = CURSOR_POS;                       00031220
                    IF INNTEKT.FNRNR(13) ^= 999 THEN                    00031230
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(13));              00031240
                 END;                                                   00031250
                                                                        00031260
              IF INNTEKT.ÅRNR(13) = 0 THEN                              00031270
                 S001I09O.ÅR13A = NOR_NUM;                              00031280
              ELSE                                                      00031290
                 DO;                                                    00031300
                    S001I09O.ÅR13A = BRI_NUM;                           00031310
                    S001I09I.ÅR13L = CURSOR_POS;                        00031320
                    IF INNTEKT.ÅRNR(13) ^= 999 THEN                     00031330
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(13));               00031340
                 END;                                                   00031350
                                                                        00031360
              IF INNTEKT.TYPENR(13) = 0 THEN                            00031370
                 S001I09O.TYPE13A = NORMAL;                             00031380
              ELSE                                                      00031390
                 DO;                                                    00031400
                    S001I09O.TYPE13A = DFHBMBRY;                        00031410
                    S001I09I.TYPE13L = CURSOR_POS;                      00031420
                    IF INNTEKT.TYPENR(13) ^= 999 THEN                   00031430
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(13));             00031440
                 END;                                                   00031450
                                                                        00031460
              IF INNTEKT.ETYPENR(13) = 0 THEN                           00031470
                 S001I09O.ETYPE13A = NORMAL;                            00031480
              ELSE                                                      00031490
                 DO;                                                    00031500
                    S001I09O.ETYPE13A = DFHBMBRY;                       00031510
                    S001I09I.ETYPE13L = CURSOR_POS;                     00031520
                    IF INNTEKT.ETYPENR(13) ^= 999 THEN                  00031530
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(13));            00031540
                 END;                                                   00031550
                                                                        00031560
              IF INNTEKT.ARTNR(13) = 0 THEN                             00031570
                 S001I09O.ART13A = NOR_NUM;                             00031580
              ELSE                                                      00031590
                 DO;                                                    00031600
                    S001I09O.ART13A = BRI_NUM;                          00031610
                    S001I09I.ART13L = CURSOR_POS;                       00031620
                    IF INNTEKT.ARTNR(13) ^= 999 THEN                    00031630
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(13));              00031640
                 END;                                                   00031650
                                                                        00031660
              IF INNTEKT.MERKENR(13) = 0 THEN                           00031670
                 S001I09O.MERKE13A = NOR_NUM;                           00031680
              ELSE                                                      00031690
                 DO;                                                    00031700
                    S001I09O.MERKE13A = BRI_NUM;                        00031710
                    S001I09I.MERKE13L = CURSOR_POS;                     00031720
                    IF INNTEKT.MERKENR(13) ^= 999 THEN                  00031730
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(13));            00031740
                 END;                                                   00031750
                                                                        00031760
              IF INNTEKT.KOMMNRNR(13) = 0 THEN                          00031770
                 S001I09O.KOMMNR13A = NOR_NUM;                          00031780
              ELSE                                                      00031790
                 DO;                                                    00031800
                    S001I09O.KOMMNR13A = BRI_NUM;                       00031810
                    S001I09I.KOMMNR13L = CURSOR_POS;                    00031820
                    IF INNTEKT.KOMMNRNR(13) ^= 999 THEN                 00031830
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(13));           00031840
                 END;                                                   00031850
                                                                        00031860
              IF INNTEKT.PG_INNTEKTNR(13) = 0 THEN                      00031870
                 S001I09O.INNTEKT13A = NOR_NUM;                         00031880
              ELSE                                                      00031890
                 DO;                                                    00031900
                    S001I09O.INNTEKT13A = BRI_NUM;                      00031910
                    S001I09I.INNTEKT13L = CURSOR_POS;                   00031920
                    IF INNTEKT.PG_INNTEKTNR(13) ^= 999 THEN             00031930
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(13));       00031940
                 END;                                                   00031950
                                                                        00031960
              IF INNTEKT.AGIVKODENR(13) = 0 THEN                        00031970
                 S001I09O.AGIVKODE13A = NOR_NUM;                        00031980
              ELSE                                                      00031990
                 DO;                                                    00032000
                    S001I09O.AGIVKODE13A = BRI_NUM;                     00032010
                    S001I09I.AGIVKODE13L = CURSOR_POS;                  00032020
                    IF INNTEKT.AGIVKODENR(13) ^= 999 THEN               00032030
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(13));         00032040
                 END;                                                   00032050
           END;                                                         00032060
                                                                        00032070
                                                                        00032080
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(14)) ^= (11)'0' THEN           00032090
           DO;                                                          00032100
              IF INNTEKT.FNRNR(14) = 0 THEN                             00032110
                 S001I09O.FNR14A = NOR_NUM;                             00032120
              ELSE                                                      00032130
                 DO;                                                    00032140
                    S001I09O.FNR14A = BRI_NUM;                          00032150
                    S001I09I.FNR14L = CURSOR_POS;                       00032160
                    IF INNTEKT.FNRNR(14) ^= 999 THEN                    00032170
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(14));              00032180
                 END;                                                   00032190
                                                                        00032200
              IF INNTEKT.ÅRNR(14) = 0 THEN                              00032210
                 S001I09O.ÅR14A = NOR_NUM;                              00032220
              ELSE                                                      00032230
                 DO;                                                    00032240
                    S001I09O.ÅR14A = BRI_NUM;                           00032250
                    S001I09I.ÅR14L = CURSOR_POS;                        00032260
                    IF INNTEKT.ÅRNR(14) ^= 999 THEN                     00032270
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(14));               00032280
                 END;                                                   00032290
                                                                        00032300
              IF INNTEKT.TYPENR(14) = 0 THEN                            00032310
                 S001I09O.TYPE14A = NORMAL;                             00032320
              ELSE                                                      00032330
                 DO;                                                    00032340
                    S001I09O.TYPE14A = DFHBMBRY;                        00032350
                    S001I09I.TYPE14L = CURSOR_POS;                      00032360
                    IF INNTEKT.TYPENR(14) ^= 999 THEN                   00032370
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(14));             00032380
                 END;                                                   00032390
                                                                        00032400
              IF INNTEKT.ETYPENR(14) = 0 THEN                           00032410
                 S001I09O.ETYPE14A = NORMAL;                            00032420
              ELSE                                                      00032430
                 DO;                                                    00032440
                    S001I09O.ETYPE14A = DFHBMBRY;                       00032450
                    S001I09I.ETYPE14L = CURSOR_POS;                     00032460
                    IF INNTEKT.ETYPENR(14) ^= 999 THEN                  00032470
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(14));            00032480
                 END;                                                   00032490
                                                                        00032500
              IF INNTEKT.ARTNR(14) = 0 THEN                             00032510
                 S001I09O.ART14A = NOR_NUM;                             00032520
              ELSE                                                      00032530
                 DO;                                                    00032540
                    S001I09O.ART14A = BRI_NUM;                          00032550
                    S001I09I.ART14L = CURSOR_POS;                       00032560
                    IF INNTEKT.ARTNR(14) ^= 999 THEN                    00032570
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(14));              00032580
                 END;                                                   00032590
                                                                        00032600
              IF INNTEKT.MERKENR(14) = 0 THEN                           00032610
                 S001I09O.MERKE14A = NOR_NUM;                           00032620
              ELSE                                                      00032630
                 DO;                                                    00032640
                    S001I09O.MERKE14A = BRI_NUM;                        00032650
                    S001I09I.MERKE14L = CURSOR_POS;                     00032660
                    IF INNTEKT.MERKENR(14) ^= 999 THEN                  00032670
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(14));            00032680
                 END;                                                   00032690
                                                                        00032700
              IF INNTEKT.KOMMNRNR(14) = 0 THEN                          00032710
                 S001I09O.KOMMNR14A = NOR_NUM;                          00032720
              ELSE                                                      00032730
                 DO;                                                    00032740
                    S001I09O.KOMMNR14A = BRI_NUM;                       00032750
                    S001I09I.KOMMNR14L = CURSOR_POS;                    00032760
                    IF INNTEKT.KOMMNRNR(14) ^= 999 THEN                 00032770
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(14));           00032780
                 END;                                                   00032790
                                                                        00032800
              IF INNTEKT.PG_INNTEKTNR(14) = 0 THEN                      00032810
                 S001I09O.INNTEKT14A = NOR_NUM;                         00032820
              ELSE                                                      00032830
                 DO;                                                    00032840
                    S001I09O.INNTEKT14A = BRI_NUM;                      00032850
                    S001I09I.INNTEKT14L = CURSOR_POS;                   00032860
                    IF INNTEKT.PG_INNTEKTNR(14) ^= 999 THEN             00032870
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(14));       00032880
                 END;                                                   00032890
                                                                        00032900
              IF INNTEKT.AGIVKODENR(14) = 0 THEN                        00032910
                 S001I09O.AGIVKODE14A = NOR_NUM;                        00032920
              ELSE                                                      00032930
                 DO;                                                    00032940
                    S001I09O.AGIVKODE14A = BRI_NUM;                     00032950
                    S001I09I.AGIVKODE14L = CURSOR_POS;                  00032960
                    IF INNTEKT.AGIVKODENR(14) ^= 999 THEN               00032970
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(14));         00032980
                 END;                                                   00032990
           END;                                                         00033000
                                                                        00033010
                                                                        00033020
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(15)) ^= (11)'0' THEN           00033030
           DO;                                                          00033040
              IF INNTEKT.FNRNR(15) = 0 THEN                             00033050
                 S001I09O.FNR15A = NOR_NUM;                             00033060
              ELSE                                                      00033070
                 DO;                                                    00033080
                    S001I09O.FNR15A = BRI_NUM;                          00033090
                    S001I09I.FNR15L = CURSOR_POS;                       00033100
                    IF INNTEKT.FNRNR(15) ^= 999 THEN                    00033110
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(15));              00033120
                 END;                                                   00033130
                                                                        00033140
              IF INNTEKT.ÅRNR(15) = 0 THEN                              00033150
                 S001I09O.ÅR15A = NOR_NUM;                              00033160
              ELSE                                                      00033170
                 DO;                                                    00033180
                    S001I09O.ÅR15A = BRI_NUM;                           00033190
                    S001I09I.ÅR15L = CURSOR_POS;                        00033200
                    IF INNTEKT.ÅRNR(15) ^= 999 THEN                     00033210
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(15));               00033220
                 END;                                                   00033230
                                                                        00033240
              IF INNTEKT.TYPENR(15) = 0 THEN                            00033250
                 S001I09O.TYPE15A = NORMAL;                             00033260
              ELSE                                                      00033270
                 DO;                                                    00033280
                    S001I09O.TYPE15A = DFHBMBRY;                        00033290
                    S001I09I.TYPE15L = CURSOR_POS;                      00033300
                    IF INNTEKT.TYPENR(15) ^= 999 THEN                   00033310
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(15));             00033320
                 END;                                                   00033330
                                                                        00033340
              IF INNTEKT.ETYPENR(15) = 0 THEN                           00033350
                 S001I09O.ETYPE15A = NORMAL;                            00033360
              ELSE                                                      00033370
                 DO;                                                    00033380
                    S001I09O.ETYPE15A = DFHBMBRY;                       00033390
                    S001I09I.ETYPE15L = CURSOR_POS;                     00033400
                    IF INNTEKT.ETYPENR(15) ^= 999 THEN                  00033410
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(15));            00033420
                 END;                                                   00033430
                                                                        00033440
              IF INNTEKT.ARTNR(15) = 0 THEN                             00033450
                 S001I09O.ART15A = NOR_NUM;                             00033460
              ELSE                                                      00033470
                 DO;                                                    00033480
                    S001I09O.ART15A = BRI_NUM;                          00033490
                    S001I09I.ART15L = CURSOR_POS;                       00033500
                    IF INNTEKT.ARTNR(15) ^= 999 THEN                    00033510
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(15));              00033520
                 END;                                                   00033530
                                                                        00033540
              IF INNTEKT.MERKENR(15) = 0 THEN                           00033550
                 S001I09O.MERKE15A = NOR_NUM;                           00033560
              ELSE                                                      00033570
                 DO;                                                    00033580
                    S001I09O.MERKE15A = BRI_NUM;                        00033590
                    S001I09I.MERKE15L = CURSOR_POS;                     00033600
                    IF INNTEKT.MERKENR(15) ^= 999 THEN                  00033610
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(15));            00033620
                 END;                                                   00033630
                                                                        00033640
              IF INNTEKT.KOMMNRNR(15) = 0 THEN                          00033650
                 S001I09O.KOMMNR15A = NOR_NUM;                          00033660
              ELSE                                                      00033670
                 DO;                                                    00033680
                    S001I09O.KOMMNR15A = BRI_NUM;                       00033690
                    S001I09I.KOMMNR15L = CURSOR_POS;                    00033700
                    IF INNTEKT.KOMMNRNR(15) ^= 999 THEN                 00033710
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(15));           00033720
                 END;                                                   00033730
                                                                        00033740
              IF INNTEKT.PG_INNTEKTNR(15) = 0 THEN                      00033750
                 S001I09O.INNTEKT15A = NOR_NUM;                         00033760
              ELSE                                                      00033770
                 DO;                                                    00033780
                    S001I09O.INNTEKT15A = BRI_NUM;                      00033790
                    S001I09I.INNTEKT15L = CURSOR_POS;                   00033800
                    IF INNTEKT.PG_INNTEKTNR(15) ^= 999 THEN             00033810
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(15));       00033820
                 END;                                                   00033830
                                                                        00033840
              IF INNTEKT.AGIVKODENR(15) = 0 THEN                        00033850
                 S001I09O.AGIVKODE15A = NOR_NUM;                        00033860
              ELSE                                                      00033870
                 DO;                                                    00033880
                    S001I09O.AGIVKODE15A = BRI_NUM;                     00033890
                    S001I09I.AGIVKODE15L = CURSOR_POS;                  00033900
                    IF INNTEKT.AGIVKODENR(15) ^= 999 THEN               00033910
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(15));         00033920
                 END;                                                   00033930
           END;                                                         00033940
                                                                        00033950
                                                                        00033960
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(16)) ^= (11)'0' THEN           00033970
           DO;                                                          00033980
              IF INNTEKT.FNRNR(16) = 0 THEN                             00033990
                 S001I09O.FNR16A = NOR_NUM;                             00034000
              ELSE                                                      00034010
                 DO;                                                    00034020
                    S001I09O.FNR16A = BRI_NUM;                          00034030
                    S001I09I.FNR16L = CURSOR_POS;                       00034040
                    IF INNTEKT.FNRNR(16) ^= 999 THEN                    00034050
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(16));              00034060
                 END;                                                   00034070
                                                                        00034080
              IF INNTEKT.ÅRNR(16) = 0 THEN                              00034090
                 S001I09O.ÅR16A = NOR_NUM;                              00034100
              ELSE                                                      00034110
                 DO;                                                    00034120
                    S001I09O.ÅR16A = BRI_NUM;                           00034130
                    S001I09I.ÅR16L = CURSOR_POS;                        00034140
                    IF INNTEKT.ÅRNR(16) ^= 999 THEN                     00034150
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(16));               00034160
                 END;                                                   00034170
                                                                        00034180
              IF INNTEKT.TYPENR(16) = 0 THEN                            00034190
                 S001I09O.TYPE16A = NORMAL;                             00034200
              ELSE                                                      00034210
                 DO;                                                    00034220
                    S001I09O.TYPE16A = DFHBMBRY;                        00034230
                    S001I09I.TYPE16L = CURSOR_POS;                      00034240
                    IF INNTEKT.TYPENR(16) ^= 999 THEN                   00034250
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(16));             00034260
                 END;                                                   00034270
                                                                        00034280
              IF INNTEKT.ETYPENR(16) = 0 THEN                           00034290
                 S001I09O.ETYPE16A = NORMAL;                            00034300
              ELSE                                                      00034310
                 DO;                                                    00034320
                    S001I09O.ETYPE16A = DFHBMBRY;                       00034330
                    S001I09I.ETYPE16L = CURSOR_POS;                     00034340
                    IF INNTEKT.ETYPENR(16) ^= 999 THEN                  00034350
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(16));            00034360
                 END;                                                   00034370
                                                                        00034380
              IF INNTEKT.ARTNR(16) = 0 THEN                             00034390
                 S001I09O.ART16A = NOR_NUM;                             00034400
              ELSE                                                      00034410
                 DO;                                                    00034420
                    S001I09O.ART16A = BRI_NUM;                          00034430
                    S001I09I.ART16L = CURSOR_POS;                       00034440
                    IF INNTEKT.ARTNR(16) ^= 999 THEN                    00034450
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(16));              00034460
                 END;                                                   00034470
                                                                        00034480
              IF INNTEKT.MERKENR(16) = 0 THEN                           00034490
                 S001I09O.MERKE16A = NOR_NUM;                           00034500
              ELSE                                                      00034510
                 DO;                                                    00034520
                    S001I09O.MERKE16A = BRI_NUM;                        00034530
                    S001I09I.MERKE16L = CURSOR_POS;                     00034540
                    IF INNTEKT.MERKENR(16) ^= 999 THEN                  00034550
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(16));            00034560
                 END;                                                   00034570
                                                                        00034580
              IF INNTEKT.KOMMNRNR(16) = 0 THEN                          00034590
                 S001I09O.KOMMNR16A = NOR_NUM;                          00034600
              ELSE                                                      00034610
                 DO;                                                    00034620
                    S001I09O.KOMMNR16A = BRI_NUM;                       00034630
                    S001I09I.KOMMNR16L = CURSOR_POS;                    00034640
                    IF INNTEKT.KOMMNRNR(16) ^= 999 THEN                 00034650
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(16));           00034660
                 END;                                                   00034670
                                                                        00034680
              IF INNTEKT.PG_INNTEKTNR(16) = 0 THEN                      00034690
                 S001I09O.INNTEKT16A = NOR_NUM;                         00034700
              ELSE                                                      00034710
                 DO;                                                    00034720
                    S001I09O.INNTEKT16A = BRI_NUM;                      00034730
                    S001I09I.INNTEKT16L = CURSOR_POS;                   00034740
                    IF INNTEKT.PG_INNTEKTNR(16) ^= 999 THEN             00034750
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(16));       00034760
                 END;                                                   00034770
                                                                        00034780
              IF INNTEKT.AGIVKODENR(16) = 0 THEN                        00034790
                 S001I09O.AGIVKODE16A = NOR_NUM;                        00034800
              ELSE                                                      00034810
                 DO;                                                    00034820
                    S001I09O.AGIVKODE16A = BRI_NUM;                     00034830
                    S001I09I.AGIVKODE16L = CURSOR_POS;                  00034840
                    IF INNTEKT.AGIVKODENR(16) ^= 999 THEN               00034850
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(16));         00034860
                 END;                                                   00034870
           END;                                                         00034880
                                                                        00034890
    END OVERFØR_INNTEKT_MAP;                                            00034900
                                                                        00034910
                                                                        00034920
 /* ***************************************************************** */00034930
 /*                                                                   */00034940
 /*   PROSEDYRA OVERFØRER FNR OG ÅR FRA INNTEKT_OMR TIL               */00034950
 /*   SKJERMBILDE. RESTEN BLANKES.                                    */00034960
 /*   MAP: S001I09                                                    */00034970
 /*   MAPSET: S001I93                                                 */00034980
 /*                                                                   */00034990
 /* ***************************************************************** */00035000
                                                                        00035010
                                                                        00035020
 OVERFØR_INNTEKT_HOPPL_MAP:                                             00035030
    PROC;                                                               00035040
                                                                        00035050
                                                                        00035060
        S001I09O.FNR1O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(1));        00035070
                                                                        00035080
        IF INNTEKT.FNR(2) ^= 0 THEN                                     00035090
           S001I09O.FNR2O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(2));        00035100
                                                                        00035110
        IF INNTEKT.FNR(3) ^= 0 THEN                                     00035120
           S001I09O.FNR3O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(3));        00035130
                                                                        00035140
        IF INNTEKT.FNR(4) ^= 0 THEN                                     00035150
           S001I09O.FNR4O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(4));        00035160
                                                                        00035170
        IF INNTEKT.FNR(5) ^= 0 THEN                                     00035180
           S001I09O.FNR5O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(5));        00035190
                                                                        00035200
        IF INNTEKT.FNR(6) ^= 0 THEN                                     00035210
           S001I09O.FNR6O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(6));        00035220
                                                                        00035230
        IF INNTEKT.FNR(7) ^= 0 THEN                                     00035240
           S001I09O.FNR7O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(7));        00035250
                                                                        00035260
        IF INNTEKT.FNR(8) ^= 0 THEN                                     00035270
           S001I09O.FNR8O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(8));        00035280
                                                                        00035290
        IF INNTEKT.FNR(9) ^= 0 THEN                                     00035300
           S001I09O.FNR9O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(9));        00035310
                                                                        00035320
        IF INNTEKT.FNR(10) ^= 0 THEN                                    00035330
           S001I09O.FNR10O  = F_FELT_PIC_CHAR11(INNTEKT.FNR(10));       00035340
                                                                        00035350
        IF INNTEKT.FNR(11) ^= 0 THEN                                    00035360
           S001I09O.FNR11O  = F_FELT_PIC_CHAR11(INNTEKT.FNR(11));       00035370
                                                                        00035380
        IF INNTEKT.FNR(12) ^= 0 THEN                                    00035390
           S001I09O.FNR12O  = F_FELT_PIC_CHAR11(INNTEKT.FNR(12));       00035400
                                                                        00035410
        IF INNTEKT.FNR(13) ^= 0 THEN                                    00035420
           S001I09O.FNR13O  = F_FELT_PIC_CHAR11(INNTEKT.FNR(13));       00035430
                                                                        00035440
        IF INNTEKT.FNR(14) ^= 0 THEN                                    00035450
           S001I09O.FNR14O  = F_FELT_PIC_CHAR11(INNTEKT.FNR(14));       00035460
                                                                        00035470
        IF INNTEKT.FNR(15) ^= 0 THEN                                    00035480
           S001I09O.FNR15O  = F_FELT_PIC_CHAR11(INNTEKT.FNR(15));       00035490
                                                                        00035500
        IF INNTEKT.FNR(16) ^= 0 THEN                                    00035510
           S001I09O.FNR16O  = F_FELT_PIC_CHAR11(INNTEKT.FNR(16));       00035520
                                                                        00035530
                                                                        00035540
        S001I09I.TYPE1L     = CURSOR_POS;                               00035550
                                                                        00035560
        S001I09O.TYPE1O     = LOW(1);                                   00035570
        S001I09O.TYPE2O     = LOW(1);                                   00035580
        S001I09O.TYPE3O     = LOW(1);                                   00035590
        S001I09O.TYPE4O     = LOW(1);                                   00035600
        S001I09O.TYPE5O     = LOW(1);                                   00035610
        S001I09O.TYPE6O     = LOW(1);                                   00035620
        S001I09O.TYPE7O     = LOW(1);                                   00035630
        S001I09O.TYPE8O     = LOW(1);                                   00035640
        S001I09O.TYPE9O     = LOW(1);                                   00035650
        S001I09O.TYPE10O    = LOW(1);                                   00035660
        S001I09O.TYPE11O    = LOW(1);                                   00035670
        S001I09O.TYPE12O    = LOW(1);                                   00035680
        S001I09O.TYPE13O    = LOW(1);                                   00035690
        S001I09O.TYPE14O    = LOW(1);                                   00035700
        S001I09O.TYPE15O    = LOW(1);                                   00035710
        S001I09O.TYPE16O    = LOW(1);                                   00035720
                                                                        00035730
        S001I09O.ETYPE1O    = LOW(1);                                   00035740
        S001I09O.ETYPE2O    = LOW(1);                                   00035750
        S001I09O.ETYPE3O    = LOW(1);                                   00035760
        S001I09O.ETYPE4O    = LOW(1);                                   00035770
        S001I09O.ETYPE5O    = LOW(1);                                   00035780
        S001I09O.ETYPE6O    = LOW(1);                                   00035790
        S001I09O.ETYPE7O    = LOW(1);                                   00035800
        S001I09O.ETYPE8O    = LOW(1);                                   00035810
        S001I09O.ETYPE9O    = LOW(1);                                   00035820
        S001I09O.ETYPE10O   = LOW(1);                                   00035830
        S001I09O.ETYPE11O   = LOW(1);                                   00035840
        S001I09O.ETYPE12O   = LOW(1);                                   00035850
        S001I09O.ETYPE13O   = LOW(1);                                   00035860
        S001I09O.ETYPE14O   = LOW(1);                                   00035870
        S001I09O.ETYPE15O   = LOW(1);                                   00035880
        S001I09O.ETYPE16O   = LOW(1);                                   00035890
                                                                        00035900
        S001I09O.ÅR1O       = LOW(2);                                   00035910
        S001I09O.ÅR2O       = LOW(2);                                   00035920
        S001I09O.ÅR3O       = LOW(2);                                   00035930
        S001I09O.ÅR4O       = LOW(2);                                   00035940
        S001I09O.ÅR5O       = LOW(2);                                   00035950
        S001I09O.ÅR6O       = LOW(2);                                   00035960
        S001I09O.ÅR7O       = LOW(2);                                   00035970
        S001I09O.ÅR8O       = LOW(2);                                   00035980
        S001I09O.ÅR9O       = LOW(2);                                   00035990
        S001I09O.ÅR10O      = LOW(2);                                   00036000
        S001I09O.ÅR11O      = LOW(2);                                   00036010
        S001I09O.ÅR12O      = LOW(2);                                   00036020
        S001I09O.ÅR13O      = LOW(2);                                   00036030
        S001I09O.ÅR14O      = LOW(2);                                   00036040
        S001I09O.ÅR15O      = LOW(2);                                   00036050
        S001I09O.ÅR16O      = LOW(2);                                   00036060
                                                                        00036070
        S001I09O.ART1O      = LOW(1);                                   00036080
        S001I09O.ART2O      = LOW(1);                                   00036090
        S001I09O.ART3O      = LOW(1);                                   00036100
        S001I09O.ART4O      = LOW(1);                                   00036110
        S001I09O.ART5O      = LOW(1);                                   00036120
        S001I09O.ART6O      = LOW(1);                                   00036130
        S001I09O.ART7O      = LOW(1);                                   00036140
        S001I09O.ART8O      = LOW(1);                                   00036150
        S001I09O.ART9O      = LOW(1);                                   00036160
        S001I09O.ART10O     = LOW(1);                                   00036170
        S001I09O.ART11O     = LOW(1);                                   00036180
        S001I09O.ART12O     = LOW(1);                                   00036190
        S001I09O.ART13O     = LOW(1);                                   00036200
        S001I09O.ART14O     = LOW(1);                                   00036210
        S001I09O.ART15O     = LOW(1);                                   00036220
        S001I09O.ART16O     = LOW(1);                                   00036230
                                                                        00036240
        S001I09O.MERKE1O    = LOW(1);                                   00036250
        S001I09O.MERKE2O    = LOW(1);                                   00036260
        S001I09O.MERKE3O    = LOW(1);                                   00036270
        S001I09O.MERKE4O    = LOW(1);                                   00036280
        S001I09O.MERKE5O    = LOW(1);                                   00036290
        S001I09O.MERKE6O    = LOW(1);                                   00036300
        S001I09O.MERKE7O    = LOW(1);                                   00036310
        S001I09O.MERKE8O    = LOW(1);                                   00036320
        S001I09O.MERKE9O    = LOW(1);                                   00036330
        S001I09O.MERKE10O   = LOW(1);                                   00036340
        S001I09O.MERKE11O   = LOW(1);                                   00036350
        S001I09O.MERKE12O   = LOW(1);                                   00036360
        S001I09O.MERKE13O   = LOW(1);                                   00036370
        S001I09O.MERKE14O   = LOW(1);                                   00036380
        S001I09O.MERKE15O   = LOW(1);                                   00036390
        S001I09O.MERKE16O   = LOW(1);                                   00036400
                                                                        00036410
        S001I09O.KOMMNR1O   = LOW(4);                                   00036420
        S001I09O.KOMMNR2O   = LOW(4);                                   00036430
        S001I09O.KOMMNR3O   = LOW(4);                                   00036440
        S001I09O.KOMMNR4O   = LOW(4);                                   00036450
        S001I09O.KOMMNR5O   = LOW(4);                                   00036460
        S001I09O.KOMMNR6O   = LOW(4);                                   00036470
        S001I09O.KOMMNR7O   = LOW(4);                                   00036480
        S001I09O.KOMMNR8O   = LOW(4);                                   00036490
        S001I09O.KOMMNR9O   = LOW(4);                                   00036500
        S001I09O.KOMMNR10O  = LOW(4);                                   00036510
        S001I09O.KOMMNR11O  = LOW(4);                                   00036520
        S001I09O.KOMMNR12O  = LOW(4);                                   00036530
        S001I09O.KOMMNR13O  = LOW(4);                                   00036540
        S001I09O.KOMMNR14O  = LOW(4);                                   00036550
        S001I09O.KOMMNR15O  = LOW(4);                                   00036560
        S001I09O.KOMMNR16O  = LOW(4);                                   00036570
                                                                        00036580
        S001I09O.INNTEKT1O  = LOW(9);                                   00036590
        S001I09O.INNTEKT2O  = LOW(9);                                   00036600
        S001I09O.INNTEKT3O  = LOW(9);                                   00036610
        S001I09O.INNTEKT4O  = LOW(9);                                   00036620
        S001I09O.INNTEKT5O  = LOW(9);                                   00036630
        S001I09O.INNTEKT6O  = LOW(9);                                   00036640
        S001I09O.INNTEKT7O  = LOW(9);                                   00036650
        S001I09O.INNTEKT8O  = LOW(9);                                   00036660
        S001I09O.INNTEKT9O  = LOW(9);                                   00036670
        S001I09O.INNTEKT10O = LOW(9);                                   00036680
        S001I09O.INNTEKT11O = LOW(9);                                   00036690
        S001I09O.INNTEKT12O = LOW(9);                                   00036700
        S001I09O.INNTEKT13O = LOW(9);                                   00036710
        S001I09O.INNTEKT14O = LOW(9);                                   00036720
        S001I09O.INNTEKT15O = LOW(9);                                   00036730
        S001I09O.INNTEKT16O = LOW(9);                                   00036740
                                                                        00036750
        S001I09O.AGIVKODE1O = LOW(3);                                   00036760
        S001I09O.AGIVKODE2O = LOW(3);                                   00036770
        S001I09O.AGIVKODE3O = LOW(3);                                   00036780
        S001I09O.AGIVKODE4O = LOW(3);                                   00036790
        S001I09O.AGIVKODE5O = LOW(3);                                   00036800
        S001I09O.AGIVKODE6O = LOW(3);                                   00036810
        S001I09O.AGIVKODE7O = LOW(3);                                   00036820
        S001I09O.AGIVKODE8O = LOW(3);                                   00036830
        S001I09O.AGIVKODE9O = LOW(3);                                   00036840
        S001I09O.AGIVKODE10O = LOW(3);                                  00036850
        S001I09O.AGIVKODE11O = LOW(3);                                  00036860
        S001I09O.AGIVKODE12O = LOW(3);                                  00036870
        S001I09O.AGIVKODE13O = LOW(3);                                  00036880
        S001I09O.AGIVKODE14O = LOW(3);                                  00036890
        S001I09O.AGIVKODE15O = LOW(3);                                  00036900
        S001I09O.AGIVKODE16O = LOW(3);                                  00036910
                                                                        00036920
        S001I09O.MELDING1O   = 'KONTROLLREGISTRER INNTEKTENE.';         00036930
                                                                        00036940
    END OVERFØR_INNTEKT_HOPPL_MAP;                                      00036950
                                                                        00036960
                                                                        00036970
 /* ***************************************************************** */00036980
 /*                                                                   */00036990
 /*   PROSEDYRA OPPDATERER FILER MED DATA FRA TRANSOMRÅDE INNTEKT.    */00037000
 /*                                                                   */00037010
 /* ***************************************************************** */00037020
                                                                        00037030
                                                                        00037040
 OPPDATER_FILER:                                                        00037050
    PROC;                                                               00037060
                                                                        00037070
    DCL                                                                 00037080
        01 NYKKEL   DEF KEY,                                            00037090
           02 KONTOR_N           CHAR(3)    ,                           00037100
           02 TERMID_N           CHAR(4)    ,                           00037110
           02 FNR_N              PIC '(11)9',                           00037120
           02 REGTPK_N           CHAR(6)    ,                           00037130
           02 IÅR_N              PIC '(2)9' ,                           00037140
           02 BLTYPE_N           CHAR(1)    ,                           00037150
           02 IART_N             CHAR(1)    ,                           00037160
           02 KOMMNR1_N          PIC '(4)9' ,                           00037170
           02 AGIVNR_N           PIC '(3)9' ,                           00037180
           02 RAPPDATO_N         PIC '(6)9' ;                           00037190
                                                                        00037200
    DCL                                                                 00037210
        KEY_BIT                  BIT(32) BASED (KEY_PEKER),             00037220
        KEY_PEKER                POINTER                ,               00037230
        KEY_RECL                 CHAR (97)              ,               00037240
        KEY                      CHAR (41)              ;               00037250
    DCL                                                                 00037260
        LISTE_RECL               CHAR(97)   ;                           00037270
    DCL                                                                 00037280
        01 REC_OMR DEF LISTE_RECL,                                      00037290
           02 KONTOR             CHAR(3)    ,                           00037300
           02 TERMID             CHAR(4)    ,                           00037310
           02 FNR                PIC '(11)9',                           00037320
           02 REGTPK             CHAR(6)    ,                           00037330
           02 IÅR                PIC '(2)9' ,                           00037340
           02 BLTYPE             CHAR(1)    ,                           00037350
           02 IART               CHAR(1)    ,                           00037360
           02 KOMMNR1            PIC '(4)9' ,                           00037370
           02 AGIVNR             PIC '(3)9' ,                           00037380
           02 RAPPDATO           PIC '(6)9' ,                           00037390
           02 NAVN               CHAR(25)   ,                           00037400
           02 INNTEKT            PIC '(7)9' ,                           00037410
           02 ETYPE              CHAR(1)    ,                           00037420
           02 MERKE              CHAR(1)    ,                           00037430
           02 DÅR                PIC '(2)9' ,                           00037440
           02 KOMMNR2            PIC '(4)9' ,                           00037450
           02 BRUKERID           CHAR(4)    ,                           00037460
           02 FNR2               PIC '(11)9',                           00037470
           02 INDEKS             CHAR(1)    ;                           00037480
                                                                        00037490
           HDATO        = DATE();                                       00037500
           DATO_REDEF.ÅR = HDATO_REDEF.ÅR ;                             00037510
           DATO_REDEF.MND = HDATO_REDEF.MND;                            00037520
           DATO_REDEF.DAG = HDATO_REDEF.DAG;                            00037530
                                                                        00037540
           DO I = 1 TO 16 WHILE(INNTEKT.FNR(I) ^= 0);                   00037550
                                                                        00037560
              EXEC CICS DELAY INTERVAL(002);                            00037570
                                                                        00037580
              TID_D     = TIME  ;                                       00037590
              INNT_RAPP       = '';                                     00037600
                                                                        00037610
              REC_ART         = INNTEKT.TYPE(I);                        00037620
              RAPP_ART        = INNTEKT.ETYPE(I);                       00037630
              INNT_ÅR         = INNTEKT.ÅR(I);                          00037640
              KOMM_NR         = INNTEKT.KOMMNR(I);                      00037650
              RAPP_DATO       = HDATO;                                  00037660
              INNT_RAPP.FNR   = INNTEKT.FNR(I);                         00037670
                                                                        00037680
              IF INNTEKT.ART(I) = 1              THEN                   00037690
                 PI(1)        = INNTEKT.PG_INNTEKT(I);                  00037700
              ELSE                                                      00037710
                 IF INNTEKT.ART(I) = 2           THEN                   00037720
                    PI(3)     = INNTEKT.PG_INNTEKT(I);                  00037730
                 ELSE                                                   00037740
                    IF INNTEKT.ART(I) = 3        THEN                   00037750
                       PI(2)  = INNTEKT.PG_INNTEKT(I);                  00037760
                                                                        00037770
              INNTEKT_OMB     = INNTEKT.MERKE(I);                       00037780
                                                                        00037790
                                                                        00037800
              EXEC CICS WRITE DATASET('INBRUDD') FROM (INNT_RAPP)       00037810
                                                 RIDFLD (IN_RBA) RBA;   00037820
                                                                        00037830
                                                                        00037840
              LISTE_RECL     = ''                   ;                   00037850
              REC_OMR.KONTOR = 'SA'                 ;                   00037860
              REC_OMR.FNR    = INNTEKT.FNR(I)       ;                   00037870
              REC_OMR.IÅR    = INNTEKT.ÅR(I)        ;                   00037880
              REC_OMR.BLTYPE = INNTEKT.TYPE(I)      ;                   00037890
              REC_OMR.IART   = INNTEKT.ART(I)       ;                   00037900
              REC_OMR.KOMMNR1 = INNTEKT.KOMMNR(I)   ;                   00037910
              REC_OMR.AGIVNR = INNTEKT.AGIVKODE(I)  ;                   00037920
              REC_OMR.RAPPDATO = DATO               ;                   00037930
                                                                        00037940
              REC_OMR.DÅR    = 0                    ;                   00037950
              REC_OMR.TERMID = EIBTRMID             ;                   00037960
              REC_OMR.REGTPK = TID1                 ;                   00037970
              REC_OMR.BRUKERID = STYRINGS_OMR.BRUKERID;                 00037980
              REC_OMR.INNTEKT = INNTEKT.PG_INNTEKT(I);                  00037990
                                                                        00038000
              REC_OMR.ETYPE  = INNTEKT.ETYPE(I)     ;                   00038010
              REC_OMR.MERKE  = INNTEKT.MERKE(I)     ;                   00038020
              REC_OMR.INDEKS = '1'                  ;                   00038030
                                                                        00038040
                                                                        00038050
              NYKKEL.KONTOR_N = 'SA'                ;                   00038060
              NYKKEL.FNR_N   = INNTEKT.FNR(I)       ;                   00038070
              NYKKEL.IÅR_N   = INNTEKT.ÅR(I)        ;                   00038080
              NYKKEL.BLTYPE_N = INNTEKT.TYPE(I)     ;                   00038090
              NYKKEL.IART_N  = INNTEKT.ART(I)       ;                   00038100
              NYKKEL.KOMMNR1_N = INNTEKT.KOMMNR(I)  ;                   00038110
              NYKKEL.AGIVNR_N = INNTEKT.AGIVKODE(I) ;                   00038120
              NYKKEL.RAPPDATO_N = DATO              ;                   00038130
              NYKKEL.TERMID_N = EIBTRMID            ;                   00038140
              NYKKEL.REGTPK_N = TID1                ;                   00038150
              KEY_PEKER      = ADDR(KEY)            ;                   00038160
              KEY_RECL       = LISTE_RECL           ;                   00038170
                                                                        00038180
              EXEC CICS WRITE DATASET ('OLBRUDD') RIDFLD (KEY_BIT )     00038190
                                                   FROM (KEY_RECL);     00038200
                                                                        00038210
                                                                        00038220
                                                                        00038230
                                                                        00038240
           END;                                                         00038250
                                                                        00038260
    END OPPDATER_FILER;                                                 00038270
                                                                        00038280
  /* ***************************************************************  */00038290
  /*    PROSEDYREN                                                    */00038300
  /*    PROSEDYREN SETTER INN AKTUELLE FEILMELDINGER PÅ               */00038310
  /*    MELDINGSFELTENE I MAPEN VIA LINK TIL R0019921 SOM GÅR INN I   */00038320
  /*    FEILMELDINGSBASEN.                                            */00038330
  /* ***************************************************************  */00038340
  % PAGE;                                                               00038350
     SKRIV_FEIL:                                                        00038360
       PROC (FEILNR);                                                   00038370
       DCL                                                              00038380
          FEILNR UNAL FIXED DEC (5),                                    00038390
          1 FEIL_STRUC,                                                 00038400
            2 FEIL_NR          FIXED DEC(5),                            00038410
            2 FEIL_MELDING     CHAR(78),                                00038420
            2 KOM_OMR_PEKER    POINTER;                                 00038430
                                                                        00038440
         IF FRA_UTEN_DIALOG ! FRA_MED_DIALOG THEN                       00038450
           IF FEIL_MELD_NR > 0 THEN                                     00038460
             DO;                                                        00038470
               S001I09O.MELDING1O =                                     00038480
                           'PROGRAM ' !! DIV_PARAM_OMR.PROGRAM_ID !!    00038490
                           ' GÅR I FEIL VED LABEL NR. '           !!    00038500
                           DIV_PARAM_OMR.FEIL_VED_LABEL;                00038510
               ANT_FEIL_SKREVET = 2;                                    00038520
             END;                                                       00038530
                                                                        00038540
          IF ANT_FEIL_SKREVET < 7 THEN                                  00038550
             DO;                                                        00038560
               KOM_OMR_PEKER = COMMAREA_PEKER;                          00038570
               FEIL_NR       = FEILNR;                                  00038580
               EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC); 00038590
                                                                        00038600
               ANT_FEIL_SKREVET = ANT_FEIL_SKREVET + 1;                 00038610
               IF ANT_FEIL_SKREVET = 1 THEN                             00038620
                  S001I09O.MELDING1O = FEIL_MELDING;                    00038630
               ELSE                                                     00038640
                  IF ANT_FEIL_SKREVET = 2 THEN                          00038650
                     S001I09O.MELDING2O = FEIL_MELDING;                 00038660
                  ELSE                                                  00038670
                     IF ANT_FEIL_SKREVET = 3 THEN                       00038680
                        S001I09O.MELDING3O = FEIL_MELDING;              00038690
                     ELSE                                               00038700
                        IF ANT_FEIL_SKREVET = 4 THEN                    00038710
                           S001I09O.MELDING4O = FEIL_MELDING;           00038720
                        ELSE                                            00038730
                           IF ANT_FEIL_SKREVET = 5 THEN                 00038740
                              S001I09O.MELDING5O = FEIL_MELDING;        00038750
                           ELSE                                         00038760
                              IF ANT_FEIL_SKREVET = 6 THEN              00038770
                                 S001I09O.MELDING6O = FEIL_MELDING;     00038780
             END;                                                       00038790
       END SKRIV_FEIL;                                                  00038800
 %PAGE;                                                                 00038810
  /* ********************************************************** */      00038820
  /*          E K S T E R N E   P R O C E D U R E R             */      00038830
  /* ********************************************************** */      00038840
                                                                        00038850
                                                                        00038860
                                                                        00038870
 %PAGE;                                                                 00038880
      %INCLUDE R0019901;               /* TESTER OM DATO ER GYLDIG  */  00038890
 %PAGE;                                                                 00038900
      %INCLUDE R0019902;               /* FINNE KJØNN               */  00038910
 %PAGE;                                                                 00038920
      %INCLUDE R0019903;               /* EKTEFELLES ALDER GYLDIG   */  00038930
 %PAGE;                                                                 00038940
      %INCLUDE R0019904;               /* FØDSELSNUMMERKONTROLL     */  00038950
 %PAGE;                                                                 00038960
      %INCLUDE R0019905;               /* BEREGNER ALDER            */  00038970
 %PAGE;                                                                 00038980
      %INCLUDE R0019907;               /* TABELLSØKING              */  00038990
 %PAGE;                                                                 00039000
      %INCLUDE R0019908;               /* DAGENS DATO PLUSS 1       */  00039010
 %PAGE;                                                                 00039020
      %INCLUDE R0019910;               /* NUMERISK KONTROLL         */  00039030
 %PAGE;                                                                 00039040
      %INCLUDE R0019911;               /* DATO KONTROLL             */  00039050
 %PAGE;                                                                 00039060
      %INCLUDE R0019912;               /* KONVERTERING CHAR ==> PIC /   00039070
                                          PIC ==> CHAR              */  00039080
 %PAGE;                                                                 00039090
      %INCLUDE R0019956;               /*     P9956_BER_G_CICS    */    00039100
                                                                        00039110
                                                                        00039120
                                                                        00039130
   END R001I93;                                                         00039140
