 /*       SIST ENDRET 08/09-87 12.06.20 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 07/03-86 10.03.34 AV   ANNE                     */00000010
 /*       SIST ENDRET 05/09-83 08.13.52 AV   JANKR                    */00000020
 /* ***************************************************************** */00000030
 /* IDENTIFIKASJON                                                    */00000040
 /*     R0010424 - PROGRAM SOM FORETAR  OPPDATERING AV STATSBORGER    */00000050
 /*                TABELLEN UNDER ADMINISTRASJONSDELEN AV SYSTEMET.   */00000060
 /*                HOVEDPROGRAM I CICS/PLI.                           */00000070
 /*     PROGRAMMERER: JAN - H. KRISTENSEN SETTEMBER 1983.             */00000080
 /* HENSIKT                                                           */00000090
 /*     PROGRAMMET SKAL SENDE UT EN MAP FØRST FOR AT EN SKAL KUNNE    */00000100
 /*     VELGE KODE FOR DET EN ØNSKER UTFØRT.                          */00000110
 /*     DERETTER SKAL DENNE MAPPEN RECEIVES SLIK AT DETTE PROGRAMMET  */00000120
 /*     KAN GI KONTROLL TIL DEN AKTUELLE PROGRAMDELEN SOM UTFØRER     */00000130
 /*     AKSJONEN.                                                     */00000140
 /* PROGRAMTILKNYTNING                                                */00000150
 /*     BLIR GITT KONTROLL FRA PROGRAM R0010420 SOM ER STYREPROGRAM   */00000160
 /*     UNDER ADMINISTRASJONSDELEN.                                   */00000170
 /*                                                                   */00000180
 /* ***************************************************************** */00000190
                                                                        00000200
 R001B1: PROC(COMMAREA_PEKER)                  OPTIONS (MAIN);          00000210
                                                                        00000220
    %INCLUDE P0019908;            /* KOM_OMR                          */00000230
    %INCLUDE P0019912;            /* DIV_PARAM_OMR                    */00000240
    %INCLUDE P0019910;            /* STYRINGS_OMR                     */00000250
    %INCLUDE P0019906;            /* TRANS_OPPL_OMR                   */00000260
    %INCLUDE S001A4;              /* MAP TIL LKNR ENDRING FOR         */00000270
                                  /* ADMINISTRASJON.                  */00000280
    %INCLUDE DFHBMSCA;            /* HJELPE STRUKTUR FOR ATTRIBUTTER  */00000290
                                                                        00000300
    DCL                                                                 00000310
      1 ADM_OMR                  BASED(B01_PEKER), /* DETTE SIDEN B01 */00000320
        2 FORRIGE_AKSJON         CHAR(2),          /* IKKE BRUKES HER */00000330
                                                                        00000340
      1 STATSBRNR_REC            BASED(STATSBRNR_PEKER),                00000350
        2 STATSBORGER            PIC '(3)9',                            00000360
        2 FILLER                 CHAR (2),                              00000370
        2 NAVN                   CHAR (25),                             00000380
                                                                        00000390
      CSTG                       BUILTIN,                               00000400
      ADDR                       BUILTIN,                               00000410
      LENGTH                     BUILTIN,                               00000420
      KEY_BIT                    BIT(24) BASED (KEY_PEKER),             00000430
      KEY_PEKER                  POINTER,                               00000440
      STATSBRNR_PEKER            POINTER,                               00000450
      BMSMAPBR                   POINTER,                               00000460
      COMMAREA_PEKER             POINTER;                               00000470
                                                                        00000480
                                                                        00000490
    KOM_OMR.STYRINGS_PEKER  = ADDR(KOM_OMR.STYRINGS_OMR);               00000500
    KOM_OMR.TRANS_OPPL_PEKER= ADDR(KOM_OMR.TRANS_OPPL_OMR);             00000510
    KOM_OMR.DIV_PARAM_PEKER = ADDR(KOM_OMR.DIV_PARAM_OMR);              00000520
    TRANSKODE               = 'RA24';        /* DETTE PROGRAM  */       00000530
                                                                        00000540
                                                                        00000550
    IF PROGRAM_ID = 'R0010420' THEN         /* KOMMER IN FØRSTE GANG */ 00000560
                                                                        00000570
       DO;                                                              00000580
          EXEC CICS SEND MAP('S001A4') MAPSET('S001A43') MAPONLY ERASE; 00000590
                                                                        00000600
       END;                                                             00000610
                                                                        00000620
                                                                        00000630
    ELSE IF PROGRAM_ID = 'R0010424' THEN       /*   DETTE PROGRAM   */  00000640
                                                                        00000650
       DO;                                                              00000660
          EXEC CICS RECEIVE MAP('S001A4')MAPSET('S001A43')              00000670
                                         SET  (BMSMAPBR);               00000680
          S001A4O.MELDINGO  = ' ';                                      00000690
          KEY_PEKER         = ADDR(S001A4I.STATSBORGERI);               00000700
                                                                        00000710
                                                                        00000720
 /* ENDRET 18.02.86   AL                                       */       00000730
                                                                        00000740
          IF S001A4I.FUNKSJONSKODEL > 0 &                               00000750
             VERIFY(S001A4I.FUNKSJONSKODEI,'RVEFIAX') = 0 THEN          00000760
                                                                        00000770
 /* HIT    18.02.86   AL                                       */       00000780
                                                                        00000790
             DO;                                                        00000800
                FUNKSJONSKODE = S001A4I.FUNKSJONSKODEI;                 00000810
                EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR); 00000820
             END;                                                       00000830
                                                                        00000840
          IF S001A4I.STYRE_KODEL > 0 &                                  00000850
             S001A4I.STYRE_KODEI ^= 'NB' THEN                           00000860
             DO;                                                        00000870
                STYREKODE  = S001A4I.STYRE_KODEI;                       00000880
                EXEC CICS XCTL PROGRAM ('R0010420') COMMAREA (KOM_OMR); 00000890
             END;                                                       00000900
                                                                        00000910
          SELECT(S001A4I.AKSJONI);                                      00000920
             WHEN('VS')                                                 00000930
                DO;                                                     00000940
                   CALL BLANK_TEKST;                                    00000950
                   CALL TEKST_PROT;                                     00000960
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VS);        00000970
                   EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT)   00000980
                                               SET(STATSBRNR_PEKER);    00000990
                   CALL OVERFØR_TIL_MAP;                                00001000
                   FORRIGE_AKSJON = 'VS';                               00001010
                                                                        00001020
                END;                                                    00001030
             WHEN('VN')                                                 00001040
                DO;                                                     00001050
                   CALL BLANK_TEKST;                                    00001060
                   CALL TEKST_PROT;                                     00001070
                   S001A4O.STATSBORGERO = S001A4O.STATSBORGERO + 1;     00001080
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VN);        00001090
                   EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT)   00001100
                                            GTEQ  SET(STATSBRNR_PEKER); 00001110
                   CALL OVERFØR_TIL_MAP;                                00001120
                   FORRIGE_AKSJON = 'VN';                               00001130
                                                                        00001140
                END;                                                    00001150
             WHEN('VF')                                                 00001160
                DO;                                                     00001170
                   CALL BLANK_TEKST;                                    00001180
                   CALL TEKST_PROT;                                     00001190
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VS);        00001200
                   EXEC CICS STARTBR DATASET ('STATTAB') EQUAL          00001210
                                        RIDFLD(KEY_BIT);                00001220
                   EXEC CICS HANDLE CONDITION ENDFILE(NOTFND_VN);       00001230
                   EXEC CICS READPREV DATASET ('STATTAB')RIDFLD(KEY_BIT)00001240
                                                 SET(STATSBRNR_PEKER);  00001250
                   EXEC CICS READPREV DATASET ('STATTAB')RIDFLD(KEY_BIT)00001260
                                                 SET(STATSBRNR_PEKER);  00001270
                   CALL OVERFØR_TIL_MAP;                                00001280
                   FORRIGE_AKSJON = 'VF';                               00001290
                                                                        00001300
                END;                                                    00001310
         /*  WHEN('RS')                                                 00001320
                DO;                                                     00001330
                   CALL BLANK_TEKST;                                    00001340
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_RS);        00001350
                   EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT)   00001360
                                                 SET(STATSBRNR_PEKER);  00001370
                   S001A4O.MELDINGO =                                   00001380
                       'DETTE STATSBOREGERNUMMER FINNES FRA FØR';       00001390
                   CALL TEKST_PROT;                                     00001400
                   CALL SEND_MAP;                                       00001410
                                                                        00001420
                END;                                                    00001430
             WHEN('ES')                                                 00001440
                DO;                                                     00001450
                   CALL BLANK_TEKST;                                    00001460
                   CALL TEKST_PROT;                                     00001470
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VS);        00001480
                   EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT)   00001490
                                                 SET(STATSBRNR_PEKER);  00001500
                   CALL TEKST_UNP;                                      00001510
                   CALL OVERFØR_TIL_MAP;                                00001520
                   FORRIGE_AKSJON = 'ES';                               00001530
                                                                        00001540
                END;                                                    00001550
             WHEN('SS')                                                 00001560
                DO;                                                     00001570
                                                                        00001580
                   SELECT (FORRIGE_AKSJON);                             00001590
                      WHEN('RS')                                        00001600
                         DO;                                            00001610
                            CALL OVERFØR_FRA_MAP;                       00001620
                            CALL KONTROLL_AV_INPUT;                     00001630
                            EXEC CICS WRITE DATASET ('STATTAB')         00001640
                                FROM (STATSBRNR_REC)  RIDFLD(KEY_BIT);  00001650
                            S001A4O.MELDINGO =                          00001660
                            'TEKSTEN TIL DETTE STATSBORGERNUMMER ER NÅ' 00001670
                            !! ' SKREVET TIL SYSTEMET';                 00001680
                         END;                                           00001690
                      WHEN('ES')                                        00001700
                         DO;                                            00001710
                            EXEC CICS READ DATASET ('STATTAB') UPDATE   00001720
                                 RIDFLD(KEY_BIT) SET(STATSBRNR_PEKER);  00001730
                            CALL OVERFØR_FRA_MAP;                       00001740
                            CALL KONTROLL_AV_INPUT;                     00001750
                            EXEC CICS REWRITE DATASET ('STATTAB')       00001760
                                                  FROM (STATSBRNR_REC); 00001770
                            S001A4O.MELDINGO =                          00001780
                            'TEKSTEN TIL DETTE STATSBORGERNUMMER ER'    00001790
                            !! ' NÅ ENDRET';                            00001800
                         END;                                           00001810
                      OTHERWISE                                         00001820
                         DO;                                            00001830
                            S001A4O.MELDINGO =                          00001840
                            'GAL KODE FØR SS, BARE RS ELLER ES TILLATT';00001850
                         END;                                           00001860
                                                                        00001870
                   END;                                                 00001880
                                                                        00001890
                   CALL TEKST_PROT;                                     00001900
                   FORRIGE_AKSJON = 'SS';                               00001910
                END;                                                    00001920
             WHEN('FS')                                                 00001930
                DO;                                                     00001940
                   CALL BLANK_TEKST;                                    00001950
                   CALL TEKST_PROT;                                     00001960
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VS);        00001970
                   EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT)   00001980
                                                 SET(STATSBRNR_PEKER);  00001990
                   EXEC CICS DELETE DATASET ('STATTAB') RIDFLD(KEY_BIT);00002000
                   S001A4O.MELDINGO ='DETTE STATSBORGERNUMMER OG NAVN ' 00002010
                                   !!'ER FJERNET';                      00002020
                   CALL OVERFØR_TIL_MAP;                                00002030
                   FORRIGE_AKSJON = 'FS';                               00002040
                                                                        00002050
                END; */                                                 00002060
             WHEN('XX')                                                 00002070
                DO;                                                     00002080
                   PROGRAM_ID = 'R0010301';    /* LITT JUKS !!!!     */ 00002090
                   EXEC CICS XCTL PROGRAM ('R0010420')                  00002100
                                  COMMAREA (KOM_OMR);                   00002110
                END;                                                    00002120
             OTHERWISE                                                  00002130
                DO;                                                     00002140
                   S001A4O.MELDINGO = 'UGYLDIG KODE';                   00002150
                   CALL TEKST_PROT;                                     00002160
                   S001A4I.AKSJONL = -1;     /* CURSOR */               00002170
                   S001A4I.STATSBORGERL   = 0;                          00002180
                END;                                                    00002190
                                                                        00002200
                                                                        00002210
          END;      /* SELECT  */                                       00002220
                                                                        00002230
          CALL SEND_MAP;                                                00002240
                                                                        00002250
                                                                        00002260
       END;                                                             00002270
                                                                        00002280
                                                                        00002290
  UT:                                                                   00002300
    PROGRAM_ID = 'R0010424';                                            00002310
    EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);              00002320
                                                                        00002330
                                                                        00002340
  NOTFND_VS:                                                            00002350
    S001A4O.MELDINGO =                                                  00002360
           'DETTE STATSBORGERNUMMER FINNES IKKE I SYSTEMET';            00002370
    CALL SEND_MAP;                                                      00002380
    GOTO UT;                                                            00002390
                                                                        00002400
                                                                        00002410
  NOTFND_VN:                                                            00002420
    S001A4O.MELDINGO =                                                  00002430
           'INGEN FLERE STATSBORGERNUMMER I DENNE RETNING';             00002440
    CALL SEND_MAP;                                                      00002450
    GOTO UT;                                                            00002460
                                                                        00002470
                                                                        00002480
  NOTFND_RS:                                                            00002490
    CALL TEKST_UNP;                                                     00002500
    FORRIGE_AKSJON = 'RS';                                              00002510
    CALL SEND_MAP;                                                      00002520
    GOTO UT;                                                            00002530
                                                                        00002540
                                                                        00002550
  SEND_MAP: PROC;                                                       00002560
     EXEC CICS SEND MAP ('S001A4') MAPSET ('S001A43')                   00002570
                                 CURSOR     DATAONLY ;                  00002580
  END SEND_MAP;                                                         00002590
                                                                        00002600
                                                                        00002610
  BLANK_TEKST: PROC;                                                    00002620
     S001A4O.NAVNO          = ' ';                                      00002630
  END BLANK_TEKST;                                                      00002640
                                                                        00002650
                                                                        00002660
  TEKST_UNP: PROC;                                                      00002670
     S001A4I.NAVNL          = -1;   /* CURSOR   */                      00002680
     S001A4I.STATSBORGERL   = 0;                                        00002690
     S001A4O.STATSBORGERA   = '9';  /* ASKIP + BRIGHT + MDT */          00002700
     S001A4O.NAVNA          = 'I';  /* UNP + BRI + MDT      */          00002710
  END TEKST_UNP;                                                        00002720
                                                                        00002730
                                                                        00002740
  TEKST_PROT: PROC;                                                     00002750
     S001A4I.NAVNL          = 0;                                        00002760
     S001A4I.STATSBORGERL   = -1;  /* CURSOR   */                       00002770
     S001A4O.STATSBORGERA   = 'P'; /* BRIGHT + NUM + UNP + MDT */       00002780
     S001A4O.NAVNA          = DFHBMASB;                                 00002790
  END TEKST_PROT;                                                       00002800
                                                                        00002810
                                                                        00002820
  OVERFØR_TIL_MAP: PROC;                                                00002830
     S001A4O.STATSBORGERO   = STATSBRNR_REC.STATSBORGER;                00002840
     S001A4O.NAVNO          = STATSBRNR_REC.NAVN;                       00002850
  END OVERFØR_TIL_MAP;                                                  00002860
                                                                        00002870
                                                                        00002880
  OVERFØR_FRA_MAP: PROC;                                                00002890
                                                                        00002900
     ALLOCATE STATSBRNR_REC;                                            00002910
     STATSBRNR_REC                 = '';                                00002920
     STATSBRNR_REC.STATSBORGER     = S001A4O.STATSBORGERO;              00002930
     IF S001A4I.NAVNL         > 0 THEN                                  00002940
        STATSBRNR_REC.NAVN         = S001A4I.NAVNI;                     00002950
                                                                        00002960
  END OVERFØR_FRA_MAP;                                                  00002970
                                                                        00002980
                                                                        00002990
                                                                        00003000
                                                                        00003010
  KONTROLL_AV_INPUT:  PROC;                                             00003020
                                                                        00003030
     IF STATSBRNR_REC. NAVN = ' ' THEN                                  00003040
        DO;                                                             00003050
           S001A4O.MELDINGO = 'NAVN ER IKKE UTFYLLT';                   00003060
           S001A4I.NAVNL     = -1;      /* CURSOR      */               00003070
        END;                                                            00003080
                                                                        00003090
     ELSE                                                               00003100
        RETURN;            /*  RETURNERER UTEN Å HA FUNNET FEIL  */     00003110
                                                                        00003120
                                                                        00003130
    /* HIT KOMMER EN BARE DERSOM DET ER FEIL, DA BLIR DET EN    */      00003140
    /* ANNEN UTGANG                                             */      00003150
                                                                        00003160
    CALL SEND_MAP;                                                      00003170
    GOTO UT;                                                            00003180
                                                                        00003190
                                                                        00003200
  END KONTROLL_AV_INPUT;                                                00003210
                                                                        00003220
                                                                        00003230
 END R001B1;                                                            00003240
