 /*       SIST ENDRET 28/10-98 14.39.26 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/10-98 14.37.11 AV   JDA7339                  */00000010
 /*       SIST ENDRET 08/10-98 13.46.49 AV   JDA7339                  */00000020
 /*       SIST ENDRET 08/10-98 13.45.18 AV   JDA7339                  */00000030
 /*       SIST ENDRET 12/06-98 13.33.59 AV   SPA7339                  */00000040
 /*       SIST ENDRET 25/05-98 12.37.46 AV   SPA7339                  */00000050
 /*       SIST ENDRET 30/03-98 12.55.38 AV   JDA7339                  */00000060
 /*       SIST ENDRET 16/03-98 14.39.42 AV   JDA7339                  */00000070
 /*       SIST ENDRET 04/08-97 14.09.47 AV   JDA7339                  */00000080
 /*       SIST ENDRET 30/01-95 09.18.08 AV   JDA0310                  */00000090
 /*       SIST ENDRET 16/11-94 08.53.56 AV   JDA0310                  */00000100
 /*       SIST ENDRET 02/09-94 13.23.23 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 24/05-94 14.03.41 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 25/02-94 12.24.29 AV   HERMAN                   */00000130
 /* ***************************************************************** */00000140
 /*               R 0 0 1 U 6 0 5                                     */00000150
 /* ***************************************************************** */00000160
 /*IDENTIFIKASJON:                                                    */00000170
 /* **********************                                            */00000180
 /*  PROGRAM-IDENT : R001U605   KONTROLL_U3_SPES   SUBPROGRAM         */00000190
 /*  PROGRAM-SPRÅK : PLI                                              */00000200
 /*  PROGRAMMERER  : HERMAN                                           */00000210
 /*  PROGRAMMET BLE LAGET :       1993                                */00000220
 /*                                                                   */00000230
 /* ***************************************************************** */00000240
 /*HENSIKT:                                                           */00000250
 /* **********                                                        */00000260
 /*  KONTROLLERER GRUNNBLANKETT U3 - DEN SPESIELLE DEL.               */00000270
 /*  RETURNERER FEIL_FUNNET = '1'B VED FEIL, ELLERS '0'B.             */00000280
 /*                                                                   */00000290
 /* ***************************************************************** */00000300
 /*PROGRAMTILKNYTTING:                                                */00000310
 /* ********************                                              */00000320
 /*  PROGRAMMET INCLUDES AV R001U601 - KONTROLL_GRUNNBLANKETT_U3      */00000330
 /*  ARBEIDSOMRÅDET P001U601 ER INCLUDET I HOVEDPROG.                 */00000340
 /*  BRUK :                                                           */00000350
 /*      CALL KONTROLL_U3_SPES(FEIL_FUNNET);                          */00000360
 /*                                                                   */00000370
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN INCLUDES I HOVEDPROG :       */00000380
 /*      R0019910 - F_NUMERISK                                        */00000390
 /*      R0019912 - F_FELT_PIC_CHARNN                                 */00000400
 /*      VERIFY   - BUILTIN-FUNCTION                                  */00000410
 /*                                                                   */00000420
 /*  EKSTERN PROSEDYRE SOM CALLES :                                   */00000430
 /*                                                                   */00000440
 /*  INTERNE PROSEDYRER :                                             */00000450
 /*      KONTROLL_U3_SPES(FEIL_FUNNET)                                */00000460
 /*      SJEKK_TT_NUMERISK                                            */00000470
 /*                                                                   */00000480
 /* ***************************************************************** */00000490
 /*DATASETTOPPLYSNINGER:                                              */00000500
 /* ***********************                                           */00000510
 /*   STATTAB - STATSBORGERSKAPSTABELL - EXEC CICS READ DATASET       */00000520
 /*                                      ('STATTAB')........          */00000530
 /* ***************************************************************** */00000540
 /*FEILMELDINGER:                                                     */00000550
 /* *******************                                               */00000560
 /*   MELDINGSNR LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM            */00000570
 /*   FEIL_FUNNET SETTES = '1'B.                                      */00000580
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDINGER PÅ SKJERMBILDET.   */00000590
 /*                                                                   */00000600
 /* ***************************************************************** */00000610
 KONTROLL_U3_SPES:                                                      00000620
    PROC(FEIL_FUNNET);                                                  00000630
                                                                        00000640
    DCL                                                                 00000650
       FEIL_FUNNET         BIT(1);                                      00000660
    DCL                                                                 00000670
       KEY_BIT1                   BIT(32) BASED (KEY_PEKER1),           00000680
       KEY_BIT2                   BIT(32) BASED (KEY_PEKER2),           00000690
       KEY_PEKER1                 POINTER,                              00000700
       KEY_PEKER2                 POINTER,                              00000710
       ST_RECL                    CHAR (35);                            00000720
    DCL                                                                 00000730
       T_FNR               PIC'(11)9';                                  00000740
    DCL                                                                 00000750
       1 FNR DEF T_FNR,                                                 00000760
          2 DG             PIC'99',                                     00000770
          2 MN             PIC'99',                                     00000780
          2 ÅR             PIC'99',                                     00000790
          2 PERSNR,                                                     00000800
             3 ÅRHUNDRE    PIC'999',                                    00000810
             3 REST        PIC'99';                                     00000820
    DCL                                                                 00000830
       FYLT_SEKSTISJU      PIC'(4)9',                                   00000840
       FYLT_SYTTI          PIC'(4)9';                                   00000850
    DCL                                                                 00000860
       HJ_UFT_ÅM           PIC'(4)9',                                   00000870
       HJ_UFT_Å DEF HJ_UFT_ÅM POS(1)    PIC'99',                        00000880
       HJ_UFT_M DEF HJ_UFT_ÅM POS(3)    PIC'99',                        00000890
       HJ_VIRK_ÅM          PIC'(4)9',                                   00000900
       HJ_STI_ÅM           PIC'(4)9',                                   00000910
       FEIL                BIT(1);                                      00000920
    DCL                                                                 00000930
       TT_MAKS_TIL_DATO    PIC'(4)9',                                   00000940
       TIL_DATO_ÅM         PIC'(4)9',                                   00000950
       W_TT_MND            PIC'99';                                     00000960
    DCL                                                                 00000970
       MAKS_TT_FØR_1967    PIC'99',                                     00000980
       TT_TIL_TPK          PIC'(4)9',                                   00000990
       TT_E66_ÅM           PIC'(4)9';                                   00001000
                                                                        00001010
 /* ***************************************************************** */00001020
 /* TESTER OM FORUTSETNINGENE FOR Å KONTROLLERE FELTENE I SPES.INFO   */00001030
 /* DELEN ER TILSTEDE. DVS.:                                          */00001040
 /* - ET ELLER FLERE FELT MÅ VÆRE UTFYLT                              */00001050
 /* - NUMERISKE FELT KAN BARE INNEHOLDE NUMERISKE VERDIER             */00001060
 /* ***************************************************************** */00001070
                                                                        00001080
    TT_E66_ÅM   = U3SP.TT_E66_Å * 100 + U3SP.TT_E66_M;                  00001090
    T_FNR       = U3S.FNR;                                              00001100
    FEIL_FUNNET = '0'B;                                                 00001110
    KEY_PEKER1  = ADDR(U3SP.STATSBORGER);                               00001120
    KEY_PEKER2  = ADDR(U3SP.BOSATT);                                    00001130
    HJ_UFT_ÅM   = F_SNU_DATO(U3S.UFT_MÅ);                               00001140
    HJ_VIRK_ÅM  = F_SNU_DATO(U3S.VIRK_DATO_MÅ);                         00001150
    CALL SJEKK_TT_NUMERISK;                                             00001160
                                                                        00001170
    IF ^FEIL_FUNNET THEN                                                00001180
       DO;                                                              00001190
          /* -------------------------------------------------------- */00001200
          /* FELTKONTROLLER........                                   */00001210
          /* -------------------------------------------------------- */00001220
          /* 3.1 STATSBORGERSKAP */                                     00001230
          EXEC CICS HANDLE CONDITION NOTFND(NOTFND1);                   00001240
          EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT1)           00001250
                                               INTO(ST_RECL);           00001260
          GOTO STAT_UT;                                                 00001270
                                                                        00001280
          NOTFND1:                                                      00001290
              FEIL_FUNNET        = '1'B;                                00001300
              U3SP.STATSBORGERNR = 24;                                  00001310
              GOTO STAT_UT;                                             00001320
                                                                        00001330
          /* 3.2 BOSATT */                                              00001340
          STAT_UT:                                                      00001350
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND2);               00001360
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT2)       00001370
                                               INTO(ST_RECL);           00001380
              GOTO BO_UT;                                               00001390
                                                                        00001400
          NOTFND2:                                                      00001410
              FEIL_FUNNET   = '1'B;                                     00001420
              U3SP.BOSATTNR = 25;                                       00001430
              GOTO BO_UT;                                               00001440
          BO_UT:                                                        00001450
                                                                        00001460
          /* 3.3.1 "UNNTAK FRA MEDLEMSSKAP - 9802 */                    00001470
          IF U3SP.UNNTAK_12_2 = 'N' THEN                                00001480
             U3SP.UNNTAK_12_2 = ' ';                                    00001490
          IF VERIFY(U3SP.UNNTAK_12_2,'J ') ^= 0 THEN                    00001500
             DO;                                                        00001510
                FEIL_FUNNET         = '1'B;                             00001520
                U3SP.UNNTAK_12_2NR = 367;                               00001530
             END;                                                       00001540
          IF U3SP.STI_MÅ_3B > 0 THEN                                    00001550
             DO;                                                        00001560
                HJ_STI_ÅM   = F_SNU_DATO(U3SP.STI_MÅ_3B);               00001570
                IF  ^(HJ_STI_ÅM >= HJ_UFT_ÅM  &                         00001580
                     HJ_STI_ÅM <= HJ_VIRK_ÅM) THEN                      00001590
                   DO;                                                  00001600
                      FEIL_FUNNET        = '1'B;                        00001610
                      U3SP.STI_MÅ_3BNR      = 362;                      00001620
                   END;                                                 00001630
             END;                                                       00001640
                                                                        00001650
          /* 3.3.2 "FRAVIK UTLAND UNDER 5 ÅR" - UTGÅR 9802*/            00001660
   /*SKAL FJERNES - NY U3 :                                             00001670
          IF U3SP.FRAVIK_8_1_3C   = 'N' THEN                            00001680
             U3SP.FRAVIK_8_1_3C   = ' ';                                00001690
          IF VERIFY(U3SP.FRAVIK_8_1_3C,'J ') ^= 0 THEN                  00001700
             DO;                                                        00001710
                FEIL_FUNNET         = '1'B;                             00001720
                U3SP.FRAVIK_8_1_3CNR = 367;                             00001730
             END;                                                       00001740
                                                                        00001750
          IF U3SP.STI_MÅ_3C > 0 THEN                                    00001760
             DO;                                                        00001770
                HJ_STI_ÅM   = F_SNU_DATO(U3SP.STI_MÅ_3C);               00001780
                IF  ^(HJ_STI_ÅM >= HJ_UFT_ÅM  &                         00001790
                      HJ_STI_ÅM <= HJ_VIRK_ÅM) THEN                     00001800
                   DO;                                                  00001810
                      FEIL_FUNNET        = '1'B;                        00001820
                      U3SP.STI_MÅ_3CNR      = 362;                      00001830
                   END;                                                 00001840
             END;                                                       00001850
      HIT, NY U3  9803 ****************************** */                00001860
                                                                        00001870
          IF (U3S.ATT_UF ^= 'X') THEN                                   00001880
             DO;  /* IKKE KRAV VED ATTFØRING */                         00001890
                /* 3.4.1 "PENSJONSTRYGDET" */                           00001900
                IF U3SP.PENSJONSTRYGDET = 'N' THEN                      00001910
                   U3SP.PENSJONSTRYGDET = ' ';                          00001920
                ELSE                                                    00001930
                IF U3SP.PENSJONSTRYGDET = 'X' THEN                      00001940
                   U3SP.PENSJONSTRYGDET = 'J';                          00001950
                ELSE                                                    00001960
                IF VERIFY(U3SP.PENSJONSTRYGDET,'J ') ^= 0 THEN          00001970
                   DO;                                                  00001980
                      FEIL_FUNNET            = '1'B;                    00001990
                      U3SP.PENSJONSTRYGDETNR = 354;                     00002000
                   END;                                                 00002010
                                                                        00002020
                /* 3.4.2 "GP ETTER TT=PÅ */                             00002030
                IF U3SP.TT_LIK_PÅ = 'N' THEN                            00002040
                   U3SP.TT_LIK_PÅ = ' ';                                00002050
                ELSE                                                    00002060
                IF U3SP.TT_LIK_PÅ = 'X' THEN                            00002070
                   U3SP.TT_LIK_PÅ = 'J';                                00002080
                ELSE                                                    00002090
                IF VERIFY(U3SP.TT_LIK_PÅ,'J ') ^= 0 THEN                00002100
                   DO;                                                  00002110
                      FEIL_FUNNET         = '1'B;                       00002120
                      U3SP.TT_LIK_PÅNR    = 478;                        00002130
                   END;                                                 00002140
                                                                        00002150
                /* 3.4.3 "MINST 20 ÅRS BOTID" */                        00002160
                IF U3SP.MINST_20_ÅR = 'N' THEN                          00002170
                   U3SP.MINST_20_ÅR = ' ';                              00002180
                ELSE                                                    00002190
                IF U3SP.MINST_20_ÅR = 'X' THEN                          00002200
                   U3SP.MINST_20_ÅR = 'J';                              00002210
                ELSE                                                    00002220
                   IF VERIFY(U3SP.MINST_20_ÅR,'J ') ^= 0 THEN           00002230
                      DO;                                               00002240
                         FEIL_FUNNET            = '1'B;                 00002250
                         U3SP.MINST_20_ÅRNR     = 355;                  00002260
                      END;                                              00002270
                                                                        00002280
                /* 3.4.4 "FRAVIK GAMLE KONVENSJONER (IKKE EØS)" */      00002290
                IF U3SP.KONVENSJON = 'N' THEN                           00002300
                   U3SP.KONVENSJON = ' ';                               00002310
                IF VERIFY(U3SP.KONVENSJON,'J ') ^= 0 THEN               00002320
                   DO;                                                  00002330
                      FEIL_FUNNET       = '1'B;                         00002340
                      U3SP.KONVENSJONNR = 125;                          00002350
                   END;                                                 00002360
                                                                        00002370
                /* 3.4.5 "FRAVIK EØS KONVENSJONEN" */                   00002380
                IF U3SP.FRAVIK_BOSATT_EØS = 'N'      THEN               00002390
                   U3SP.FRAVIK_BOSATT_EØS = ' ';                        00002400
                IF VERIFY(U3SP.FRAVIK_BOSATT_EØS,'J ') ^= 0 THEN        00002410
                   DO;                                                  00002420
                      FEIL_FUNNET       = '1'B;                         00002430
                      U3SP.FRAVIK_BOSATT_EØSNR = 450; /*EØS-HL*/        00002440
                   END;                                                 00002450
                                                                        00002460
                /* 3.4.6 "FRAVIK BOSATT (GAMLE 8-1)" */                 00002470
                IF U3SP.FRAVIK_8_1 = 'N' THEN                           00002480
                   U3SP.FRAVIK_8_1 = ' ';                               00002490
                ELSE                                                    00002500
                IF U3SP.FRAVIK_8_1 = 'X' THEN                           00002510
                   U3SP.FRAVIK_8_1 = 'J';                               00002520
                ELSE                                                    00002530
                IF VERIFY(U3SP.FRAVIK_8_1,'J ') ^= 0 THEN               00002540
                   DO;                                                  00002550
                      FEIL_FUNNET         = '1'B;                       00002560
                      U3SP.FRAVIK_8_1NR   =  58;                        00002570
                   END;                                                 00002580
                /* ----------------------------------------------- */   00002590
                IF U3SP.TT_PÅ = 'N' THEN                                00002600
                   U3SP.TT_PÅ = ' ';                                    00002610
                ELSE                                                    00002620
                IF U3SP.TT_PÅ = 'X' THEN                                00002630
                   U3SP.TT_PÅ = 'J';                                    00002640
                ELSE                                                    00002650
                IF VERIFY(U3SP.TT_PÅ,'J ') ^= 0 THEN                    00002660
                   DO;                                                  00002670
                      FEIL_FUNNET         = '1'B;                       00002680
                      U3SP.TT_PÅNR        = 478;                        00002690
                   END;                                                 00002700
                /* ----------------------------------------------- */   00002710
                IF U3SP.TT_FRAMTIDIG = 'N' THEN                         00002720
                   U3SP.TT_FRAMTIDIG = ' ';                             00002730
                ELSE                                                    00002740
                IF U3SP.TT_FRAMTIDIG = 'X' THEN                         00002750
                   U3SP.TT_FRAMTIDIG = 'J';                             00002760
                ELSE                                                    00002770
                IF VERIFY(U3SP.TT_FRAMTIDIG,'J ') ^= 0 THEN             00002780
                   DO;                                                  00002790
                      FEIL_FUNNET         = '1'B;                       00002800
                      U3SP.TT_FRAMTIDIGNR = 479;                        00002810
                   END;                                                 00002820
                /* ----------------------------------------------- */   00002830
                IF U3SP.TT_FAKTISK = 'N' THEN                           00002840
                   U3SP.TT_FAKTISK = ' ';                               00002850
                ELSE                                                    00002860
                IF U3SP.TT_FAKTISK = 'X' THEN                           00002870
                   U3SP.TT_FAKTISK = 'J';                               00002880
                ELSE                                                    00002890
                   IF VERIFY(U3SP.TT_FAKTISK,'J ') ^= 0 THEN            00002900
                      DO;                                               00002910
                         FEIL_FUNNET         = '1'B;                    00002920
                         U3SP.TT_FAKTISKNR   = 480;                     00002930
                      END;                                              00002940
                                                                        00002950
                /* 3.4.7 "FRAVIK BOSATT (GAMLE 5-1)" UTGÅR 9803 */      00002960
                /*  IF U3SP.FRAVIK_5_1   = 'X'     THEN                 00002970
                       U3SP.FRAVIK_5_1   = 'J';                         00002980
                    ELSE                                                00002990
                    IF VERIFY(U3SP.FRAVIK_5_1,'J ') ^= 0 THEN           00003000
                       DO;                                              00003010
                          FEIL_FUNNET         = '1'B;                   00003020
                          U3SP.FRAVIK_5_1NR   = 481;                    00003030
                       END;                                             00003040
                  HIT - NY U3 ********************************** */     00003050
                                                                        00003060
                /* 3.4.7 "FRAVIK UNG UFØRE (M/GARANTERT TP)" */         00003070
                IF U3SP.UNG_UFØR = 'N' THEN                             00003080
                   U3SP.UNG_UFØR = ' ';                                 00003090
                ELSE                                                    00003100
                IF U3SP.UNG_UFØR = 'X' THEN                             00003110
                   U3SP.UNG_UFØR = 'J';                                 00003120
                ELSE                                                    00003130
                IF VERIFY(U3SP.UNG_UFØR,'J ') ^= 0 THEN                 00003140
                   DO;                                                  00003150
                      FEIL_FUNNET     = '1'B;                           00003160
                      U3SP.UNG_UFØRNR = 482;                            00003170
                   END;                                                 00003180
             END; /* IKKE KRAV VED ATTFØRING */                         00003190
                                                                        00003200
          /* 3.5 "FRAVIK FOR FLYKTING */                                00003210
          IF U3SP.FRAVIK_FLYKT = 'N'     THEN                           00003220
             U3SP.FRAVIK_FLYKT = ' ';                                   00003230
          IF VERIFY(U3SP.FRAVIK_FLYKT,'J ') ^= 0 THEN                   00003240
             DO;                                                        00003250
                FEIL_FUNNET         = '1'B;                             00003260
                U3SP.FRAVIK_FLYKTNR = 26;                               00003270
             END;                                                       00003280
                                                                        00003290
          /* 3.6 OVERKOMPENSASJON UTLENDING */                          00003300
          IF VERIFY(U3SP.OVERKOMP_UTL,'JN ') ^= 0 THEN                  00003310
             DO;                                                        00003320
                FEIL_FUNNET         = '1'B;                             00003330
                U3SP.OVERKOMP_UTLNR = 35;                               00003340
             END;                                                       00003350
                                                                        00003360
          /* 3.9 TRYGDETIDEN ENDRES */                                  00003370
          IF VERIFY(U3SP.TT_ENDRES,'J ') ^= 0 THEN                      00003380
             DO;                                                        00003390
                FEIL_FUNNET         = '1'B;                             00003400
                U3SP.TT_ENDRESNR    = 451;  /*EØS-HL */                 00003410
             END;                                                       00003420
                                                                        00003430
          /* 3.10 TRYGDETID ANNET KONV.LAND MEDREGNET */                00003440
          IF U3SP.TT_NORDEN_ANNET = 'N' THEN                            00003450
             U3SP.TT_NORDEN_ANNET = ' ';                                00003460
          IF VERIFY(U3SP.TT_NORDEN_ANNET,'J ') ^= 0 THEN                00003470
             DO;                                                        00003480
                FEIL_FUNNET         = '1'B;                             00003490
                U3SP.TT_NORDEN_ANNETNR = 361;                           00003500
             END;                                                       00003510
                                                                        00003520
          /* 3.11 IKKE GP (GAMMEL NORDISK KONVENSJON */                 00003530
             IF VERIFY(U3SP.IKKE_GP,'J ') ^= 0 THEN                     00003540
                DO;                                                     00003550
                   FEIL_FUNNET    = '1'B;                               00003560
                   U3SP.IKKE_GPNR = 36;                                 00003570
                END;                                                    00003580
                                                                        00003590
          /* 3.12 AVKORT SÆRTILLEGG (KONVENSJON) */                     00003600
             IF U3SP.AVKORT_SÆRTILL = 'N' THEN                          00003610
                U3SP.AVKORT_SÆRTILL = ' ';                              00003620
             IF VERIFY(AVKORT_SÆRTILL,'J ') ^= 0 THEN                   00003630
                DO;                                                     00003640
                   FEIL_FUNNET            = '1'B;                       00003650
                   U3SP.AVKORT_SÆRTILLNR  = 452; /*EØS-HL*/             00003660
                END;                                                    00003670
                                                                        00003680
          /* 3.13 BEREGNING ETTER KONVENSJON */                         00003690
          IF U3SP.BEREGNING_KONV = 'N' THEN                             00003700
             U3SP.BEREGNING_KONV = ' ';                                 00003710
          IF VERIFY(U3SP.BEREGNING_KONV,'J ') ^= 0 THEN                 00003720
             DO;                                                        00003730
                FEIL_FUNNET            = '1'B;                          00003740
                U3SP.BEREGNING_KONVNR  = 356;                           00003750
             END;                                                       00003760
                                                                        00003770
          /* -------------------------------------------------------- */00003780
          /* EØS - INFORMASJON :                                      */00003790
          /* -------------------------------------------------------- */00003800
                                                                        00003810
          /* 3.14 BEREGN FOLKETRYGD */                                  00003820
          IF (U3S.ATT_UF ^= 'X') THEN                                   00003830
             IF VERIFY(U3SP.BEREGN_FOLKETRYGD,'JN ')^= 0 THEN           00003840
                DO;                                                     00003850
                   FEIL_FUNNET            = '1'B;                       00003860
                   U3SP.BEREGN_FOLKETRYGDNR = 453;   /*EØS-HL */        00003870
                END;                                                    00003880
                                                                        00003890
          /* 3.15 INNTEKT > 1G I EØS OMRÅDET PÅ UFT */                  00003900
          IF (U3S.ATT_UF ^= 'X') THEN                                   00003910
             DO;  /* IKKE ATTFØRINGSPENGER */                           00003920
                IF VERIFY(U3SP.EØS_8_4_3A,'JN ') ^= 0 THEN              00003930
                   DO;  /* JA NEI BLANK */                              00003940
                      FEIL_FUNNET            = '1'B;                    00003950
                      U3SP.EØS_8_4_3ANR      = 454;       /*EØS-HL */   00003960
                   END; /* JA NEI BLANK */                              00003970
                IF HJ_VIRK_ÅM > 9400 &                                  00003980
                   (  U3SP.TT_TEORETISK_EØS_ÅR                          00003990
                    + U3SP.TT_TEORETISK_EØS_MND                         00004000
                    + U3SP.TT_PRORATA_EØS_MND                           00004010
                    + U3SP.TT_PRORATA_EØS_ÅR  > 0)THEN                  00004020
                   DO;  /* EØS BEREGNING SKAL FORETAS */                00004030
                      IF U3S.VILKÅR_8_4_3A = 'J' THEN                   00004040
                         IF U3SP.EØS_8_4_3A    = 'N' THEN               00004050
                            DO;  /* MÅ VÆRE SAMSVAR */                  00004060
                               FEIL_FUNNET            = '1'B;           00004070
                               U3SP.EØS_8_4_3ANR      = 1550;           00004080
                            END; /* MÅ VÆRE SAMSVAR */                  00004090
                         ELSE                                           00004100
                         IF VERIFY(U3SP.EØS_8_4_3A,'JN') ^= 0 THEN      00004110
                            DO;  /* KRAV TIL UTFYLLING */               00004120
                               FEIL_FUNNET            = '1'B;           00004130
                               U3SP.EØS_8_4_3ANR      = 1551;           00004140
                            END; /* KRAV TIL UTFYLLING */               00004150
                   END; /* EØS BEREGNING SKAL FORETAS */                00004160
             END; /* IKKE ATTFØRINGSPENGER */                           00004170
                                                                        00004180
          /* 3.16 POENGÅR I EØS OMRÅDET */                              00004190
             IF EØS_ÅR(1) > 0               THEN                        00004200
                DO;                                                     00004210
                   IF EØS_ÅR(1) < 67         THEN                       00004220
                      DO;                                               00004230
                         FEIL_FUNNET          = '1'B;                   00004240
                         EØS_ÅRNR(1)          = 457;       /*EØS-HL */  00004250
                      END;                                              00004260
                   ELSE                                                 00004270
                   DO J = 2 TO 33 WHILE (EØS_ÅR(J) > 0);                00004280
                      IF EØS_ÅR(J - 1) >= EØS_ÅR (J)   THEN             00004290
                         DO;                                            00004300
                            FEIL_FUNNET       = '1'B;                   00004310
                            EØS_ÅRNR(1)       = 461;                    00004320
                         END;                                           00004330
                   END;                                                 00004340
                END;                                                    00004350
          /* 3.17 POENGÅR I EØS - IKKE PRO RATA */                      00004360
                                                                        00004370
             IF EØS_ÅR_IKKE_PRO_RATA(1) > 0     THEN                    00004380
                DO;                                                     00004390
                   IF EØS_ÅR_IKKE_PRO_RATA(1) < 67    THEN              00004400
                      DO;                                               00004410
                         FEIL_FUNNET          = '1'B;                   00004420
                         EØS_ÅR_IKKE_PRO_RATANR(1) = 457;               00004430
                      END;                                              00004440
                   ELSE                                                 00004450
                   DO J = 2 TO 9 WHILE (EØS_ÅR_IKKE_PRO_RATA(J) > 0);   00004460
                      IF EØS_ÅR_IKKE_PRO_RATA(J - 1) >=                 00004470
                         EØS_ÅR_IKKE_PRO_RATA (J)   THEN                00004480
                         DO;                                            00004490
                            FEIL_FUNNET       = '1'B;                   00004500
                            EØS_ÅR_IKKE_PRO_RATANR(1) = 461;            00004510
                         END;                                           00004520
                   END;                                                 00004530
                END;                                                    00004540
   /* 9803* HIT */                                                      00004550
          /* 3.18 TEORETISK TRYGDETID I EØS */                          00004560
          IF TT_TEORETISK_EØS_MND > 12 THEN                             00004570
             DO;                                                        00004580
                FEIL_FUNNET            = '1'B;                          00004590
                TT_TEORETISK_EØS_MNDNR = 455;       /*EØS-HL */         00004600
             END;                                                       00004610
                                                                        00004620
          /* 3.19 PRO RATA TRYGDETID I EØS */                           00004630
          IF TT_PRORATA_EØS_MND > 12 THEN                               00004640
             DO;                                                        00004650
                FEIL_FUNNET          = '1'B;                            00004660
                TT_PRORATA_EØS_MNDNR = 456;      /* EØS-HL */           00004670
             END;                                                       00004680
                                                                        00004690
          /* 3.23 TRYGDETID NORDISK ARTIKKEL 13 */                      00004700
           IF U3SP.TT_FAKTISK_NORDISK_MND > 12   THEN                   00004710
              DO;                                                       00004720
                 FEIL_FUNNET            = '1'B;                         00004730
                 TT_FAKTISK_NORDISK_MNDNR = 418;                        00004740
              END;                                                      00004750
          IF U3SP.TT_FAKTISK_NORDISK_ÅR >                               00004760
             U3SP.TT_TEORETISK_EØS_ÅR THEN                              00004770
             DO;                                                        00004780
                FEIL_FUNNET            = '1'B;                          00004790
                U3SP.TT_FAKTISK_NORDISK_ÅRNR = 419;                     00004800
             END;                                                       00004810
          ELSE                                                          00004820
          IF U3SP.TT_FAKTISK_NORDISK_ÅR =                               00004830
             U3SP.TT_TEORETISK_EØS_ÅR THEN                              00004840
             DO;                                                        00004850
                IF U3SP.TT_FAKTISK_NORDISK_MND >                        00004860
                   U3SP.TT_TEORETISK_EØS_MND   THEN                     00004870
                   DO;                                                  00004880
                      FEIL_FUNNET            = '1'B;                    00004890
                      U3SP.TT_FAKTISK_NORDISK_ÅRNR = 419;               00004900
                   END;                                                 00004910
             END;                                                       00004920
    END;                                                                00004930
                                                                        00004940
 /* ***************************************************************** */00004950
 /*              DIV. KRYSSKONTROLLER                                 */00004960
 /* ***************************************************************** */00004970
                                                                        00004980
    IF ^FEIL_FUNNET THEN                                                00004990
       DO;                                                              00005000
          IF (U3S.ATT_UF = 'X') THEN                                    00005010
             DO;  /* FELT SOM IKKE SKAL UTFYLLES VED ATTFØRING EØS */   00005020
                /* 3.4.1 */                                             00005030
                IF (U3SP.PENSJONSTRYGDET ^= ' ') THEN                   00005040
                   DO;                                                  00005050
                      U3SP.PENSJONSTRYGDETNR = 1553;                    00005060
                      FEIL_FUNNET = '1'B;                               00005070
                   END;                                                 00005080
                /* 3.4.2 */                                             00005090
                IF (U3SP.TT_LIK_PÅ ^= ' ') THEN                         00005100
                   DO;                                                  00005110
                      U3SP.TT_LIK_PÅNR = 1553;                          00005120
                      FEIL_FUNNET = '1'B;                               00005130
                   END;                                                 00005140
                /* 3.4.3 */                                             00005150
                IF (U3SP.MINST_20_ÅR ^= ' ') THEN                       00005160
                   DO;                                                  00005170
                      U3SP.MINST_20_ÅRNR = 1553;                        00005180
                      FEIL_FUNNET = '1'B;                               00005190
                   END;                                                 00005200
                /* 3.4.4 */                                             00005210
                IF (U3SP.KONVENSJON ^= ' ') THEN                        00005220
                   DO;                                                  00005230
                      U3SP.KONVENSJONNR = 1553;                         00005240
                      FEIL_FUNNET = '1'B;                               00005250
                   END;                                                 00005260
                IF (U3SP.KONVENSJON_LANDNR >0) THEN                     00005270
                   DO;                                                  00005280
                      U3SP.KONVENSJON_LANDNR = 1553;                    00005290
                      FEIL_FUNNET = '1'B;                               00005300
                   END;                                                 00005310
                /* 3.4.5 */                                             00005320
                IF (U3SP.FRAVIK_BOSATT_EØS ^=' ') THEN                  00005330
                   DO;                                                  00005340
                      U3SP.FRAVIK_BOSATT_EØSNR = 1553;                  00005350
                      FEIL_FUNNET = '1'B;                               00005360
                   END;                                                 00005370
                /* 3.4.6 */                                             00005380
                IF (U3SP.FRAVIK_8_1 ^=' ') THEN                         00005390
                   DO;                                                  00005400
                      U3SP.FRAVIK_8_1NR = 1553;                         00005410
                      FEIL_FUNNET = '1'B;                               00005420
                   END;                                                 00005430
                IF (U3SP.TT_PÅ ^=' ') THEN                              00005440
                   DO;                                                  00005450
                      U3SP.TT_PÅNR = 1553;                              00005460
                      FEIL_FUNNET = '1'B;                               00005470
                   END;                                                 00005480
                IF (U3SP.TT_FRAMTIDIG ^=' ') THEN                       00005490
                   DO;                                                  00005500
                      U3SP.TT_FRAMTIDIGNR = 1553;                       00005510
                      FEIL_FUNNET = '1'B;                               00005520
                   END;                                                 00005530
                IF (U3SP.TT_FAKTISK ^=' ') THEN                         00005540
                   DO;                                                  00005550
                      U3SP.TT_FAKTISKNR = 1553;                         00005560
                      FEIL_FUNNET = '1'B;                               00005570
                   END;                                                 00005580
                /* 3.4.7 */                                             00005590
                IF (U3SP.UNG_UFØR ^=' ') THEN                           00005600
                   DO;                                                  00005610
                      U3SP.UNG_UFØRNR = 1553;                           00005620
                      FEIL_FUNNET = '1'B;                               00005630
                   END;                                                 00005640
                /* 3.08 SKAL IKKE FYLLES UT */                          00005650
                IF (U3SP.TT_F67 > 0) THEN                               00005660
                   DO;                                                  00005670
                      U3SP.TT_F67NR = 1553;                             00005680
                      FEIL_FUNNET = '1'B;                               00005690
                   END;                                                 00005700
                IF (U3SP.TT_E66_Å >0) THEN                              00005710
                   DO;                                                  00005720
                      U3SP.TT_E66_ÅNR = 1553;                           00005730
                      FEIL_FUNNET = '1'B;                               00005740
                   END;                                                 00005750
                IF (U3SP.TT_E66_M >0) THEN                              00005760
                   DO;                                                  00005770
                      U3SP.TT_E66_MNR = 1553;                           00005780
                      FEIL_FUNNET = '1'B;                               00005790
                   END;                                                 00005800
                IF (U3SP.TT_F67_EK > 0) THEN                            00005810
                   DO;                                                  00005820
                      U3SP.TT_F67_EKNR = 1553;                          00005830
                      FEIL_FUNNET = '1'B;                               00005840
                   END;                                                 00005850
                IF (U3SP.TT_E66_Å_EK > 0) THEN                          00005860
                   DO;                                                  00005870
                      U3SP.TT_E66_Å_EKNR = 1553;                        00005880
                      FEIL_FUNNET = '1'B;                               00005890
                   END;                                                 00005900
                IF (U3SP.TT_E66_M_EK > 0) THEN                          00005910
                   DO;                                                  00005920
                      U3SP.TT_E66_M_EKNR = 1553;                        00005930
                      FEIL_FUNNET = '1'B;                               00005940
                   END;                                                 00005950
                IF (U3SP.FRAVIK_19_3 ^=' ') THEN                        00005960
                   DO;                                                  00005970
                      U3SP.FRAVIK_19_3NR = 1553;                        00005980
                      FEIL_FUNNET = '1'B;                               00005990
                   END;                                                 00006000
                /* 3.09 */                                              00006010
                IF (U3SP.TT_ENDRES ^=' ') THEN                          00006020
                   DO;                                                  00006030
                      U3SP.TT_ENDRESNR = 1553;                          00006040
                      FEIL_FUNNET = '1'B;                               00006050
                   END;                                                 00006060
                /* 3.11 */                                              00006070
                IF (U3SP.IKKE_GP ^=' ') THEN                            00006080
                   DO;                                                  00006090
                      U3SP.IKKE_GPNR = 1553;                            00006100
                      FEIL_FUNNET = '1'B;                               00006110
                   END;                                                 00006120
                /* 3.12 */                                              00006130
                IF (U3SP.TP_NORDISK > 0) THEN                           00006140
                   DO;                                                  00006150
                      U3SP.TP_NORDISKNR = 1553;                         00006160
                      FEIL_FUNNET = '1'B;                               00006170
                   END;                                                 00006180
                IF (U3SP.TP_NORDISK_LAND > 0) THEN                      00006190
                   DO;                                                  00006200
                      U3SP.TP_NORDISK_LANDNR = 1553;                    00006210
                      FEIL_FUNNET = '1'B;                               00006220
                   END;                                                 00006230
                /* 3.14 */                                              00006240
                IF (U3SP.BEREGN_FOLKETRYGD ^=' ') THEN                  00006250
                   DO;                                                  00006260
                      U3SP.BEREGN_FOLKETRYGDNR = 1553;                  00006270
                      FEIL_FUNNET = '1'B;                               00006280
                   END;                                                 00006290
                /* 3.15 */                                              00006300
                IF (U3SP.EØS_8_4_3A ^= ' ') THEN                        00006310
                   DO;                                                  00006320
                      U3SP.EØS_8_4_3ANR = 1553;                         00006330
                      FEIL_FUNNET = '1'B;                               00006340
                   END;                                                 00006350
                /* 3.17 */                                              00006360
                DO J = 1 TO 9;                                          00006370
                   IF (U3SP.EØS_ÅR_IKKE_PRO_RATA(J) > 0) THEN           00006380
                      DO;                                               00006390
                         U3SP.EØS_ÅR_IKKE_PRO_RATANR = 1553;            00006400
                         FEIL_FUNNET                 = '1'B;            00006410
                      END;                                              00006420
                END;                                                    00006430
                /* 3.19 */                                              00006440
                IF (U3SP.TT_PRORATA_EØS_ÅR > 0) THEN                    00006450
                   DO;                                                  00006460
                      U3SP.TT_PRORATA_EØS_ÅRNR = 1553;                  00006470
                      FEIL_FUNNET = '1'B;                               00006480
                   END;                                                 00006490
                IF (U3SP.TT_PRORATA_EØS_MND > 0) THEN                   00006500
                   DO;                                                  00006510
                      U3SP.TT_PRORATA_EØS_MNDNR = 1553;                 00006520
                      FEIL_FUNNET = '1'B;                               00006530
                   END;                                                 00006540
                /* 3.20 */                                              00006550
                IF (U3SP.PENSJON_EØS > 0) THEN                          00006560
                   DO;                                                  00006570
                      U3SP.PENSJON_EØSNR = 1553;                        00006580
                      FEIL_FUNNET = '1'B;                               00006590
                   END;                                                 00006600
                /* 3.21 HER MÅ SPERRE LEGGES SE 3.17 FOR EKS */         00006610
                /* 3.22 HER MÅ SPERRE LEGGES SE 3.19 FOR EKS */         00006620
                /* 3.23 */                                              00006630
                IF (U3SP.TT_FAKTISK_NORDISK_ÅR > 0) THEN                00006640
                   DO;                                                  00006650
                      U3SP.TT_FAKTISK_NORDISK_ÅRNR = 1553;              00006660
                      FEIL_FUNNET = '1'B;                               00006670
                   END;                                                 00006680
                IF (U3SP.TT_FAKTISK_NORDISK_MND > 0) THEN               00006690
                   DO;                                                  00006700
                      U3SP.TT_FAKTISK_NORDISK_MNDNR = 1553;             00006710
                      FEIL_FUNNET = '1'B;                               00006720
                   END;                                                 00006730
                /* 3.24 */                                              00006740
                IF (U3SP.PÅ_FAKTISK_NORDISK > 0) THEN                   00006750
                   DO;                                                  00006760
                      U3SP.PÅ_FAKTISK_NORDISKNR = 1553;                 00006770
                      FEIL_FUNNET = '1'B;                               00006780
                   END;                                                 00006790
                /* 3.25 */                                              00006800
                IF (U3SP.GP_VIRK_NORDISK_MÅ > 0) THEN                   00006810
                   DO;                                                  00006820
                      U3SP.GP_VIRK_NORDISK_MÅNR = 1553;                 00006830
                      FEIL_FUNNET = '1'B;                               00006840
                   END;                                                 00006850
                /* 3.26 */                                              00006860
                IF (U3SP.TP_VIRK_NORDISK_MÅ > 0) THEN                   00006870
                   DO;                                                  00006880
                      U3SP.TP_VIRK_NORDISK_MÅNR = 1553;                 00006890
                      FEIL_FUNNET = '1'B;                               00006900
                   END;                                                 00006910
             END; /* FELT SOM IKKE SKAL UTFYLLES VED ATTFØRING EØS */   00006920
          ELSE                                                          00006930
             DO;  /* FELT SOM ER KRAV VED UFØREPENSJON */               00006940
                /* 3.14 & 3.18 */                                       00006950
                IF (U3SP.BEREGN_FOLKETRYGD =' ') &                      00006960
                   (U3SP.TT_PRORATA_EØS_ÅR                              00006970
                   +U3SP.TT_PRORATA_EØS_MND > 0 ) THEN                  00006980
                   DO;                                                  00006990
                      U3SP.BEREGN_FOLKETRYGDNR = 0453;                  00007000
                      FEIL_FUNNET = '1'B;                               00007010
                   END;                                                 00007020
                                                                        00007030
             END; /* FELT SOM ER KRAV VED UFØREPENSJON */               00007040
                                                                        00007050
            /* FRAVIK PGA "UNG UFØR" */                                 00007060
  /* GJELDER NY U3 */                                                   00007070
            IF U3SP.UNNTAK_12_2 ^= 'J' &                                00007080
               U3SP.STI_MÅ_3B      > 0   THEN                           00007090
               DO;                                                      00007100
                  FEIL_FUNNET         = '1'B;                           00007110
                  U3SP.UNNTAK_12_2NR = 368;                             00007120
               END;                                                     00007130
            IF U3SP.UNNTAK_12_2 = 'J' &                                 00007140
               U3SP.STI_MÅ_3B     = 0   THEN                            00007150
               DO;                                                      00007160
                  FEIL_FUNNET         = '1'B;                           00007170
                  U3SP.UNNTAK_12_2NR = 368;                             00007180
               END;                                                     00007190
    /* HIT 9803 *************** */                                      00007200
            /* FRAVIK PGA IKKE OVER 5 ÅR I UTLANDET - UTGÅR             00007210
            IF U3SP.FRAVIK_8_1_3C ^= 'J' &                              00007220
               U3SP.STI_MÅ_3C      > 0   THEN                           00007230
               DO;                                                      00007240
                  FEIL_FUNNET         = '1'B;                           00007250
                  U3SP.FRAVIK_8_1_3CNR = 368;                           00007260
               END;                                                     00007270
            IF U3SP.FRAVIK_8_1_3C = 'J' &                               00007280
               U3SP.STI_MÅ_3C     = 0   THEN                            00007290
               DO;                                                      00007300
                  FEIL_FUNNET         = '1'B;                           00007310
                  U3SP.FRAVIK_8_1_3CNR = 462;                           00007320
               END;                               ******* */            00007330
    /* KONTROLL AV AT STI ER IDENTISK VED FRAVIK BEGGE - UTGÅR*/        00007340
    /*      IF U3SP.STI_MÅ_3B > 0       &                               00007350
               U3SP.STI_MÅ_3C > 0       &                               00007360
               U3SP.STI_MÅ_3B ^= U3SP.STI_MÅ_3C   THEN                  00007370
               DO;                                                      00007380
                  FEIL_FUNNET         = '1'B;                           00007390
                  U3SP.STI_MÅ_3CNR    = 483;                            00007400
               END;                                                     00007410
    ********************************************* */                    00007420
            /* KONTROLL FRAVIK BOSATT - GAMMEL FORSKRIFT TIL 8-1 */     00007430
            IF U3SP.FRAVIK_8_1 ^= 'J'   &                               00007440
               (U3SP.TT_PÅ = 'J'  !  U3SP.TT_FRAMTIDIG = 'J'            00007450
                ! U3SP.TT_FAKTISK = 'J'   )          THEN               00007460
               DO;                                                      00007470
                  FEIL_FUNNET         = '1'B;                           00007480
                  U3SP.FRAVIK_8_1NR   = 484;                            00007490
               END;                                                     00007500
                                                                        00007510
            IF (BOSATT ^= 0      &                                      00007520
                U3S.ATT_UF ^= 'X') THEN                                 00007530
               IF ^(PENSJONSTRYGDET     = 'J'  !                        00007540
                    TT_LIK_PÅ           = 'J'  !                        00007550
                    MINST_20_ÅR         = 'J'  !                        00007560
                    KONVENSJON          = 'J'  !                        00007570
                    FRAVIK_8_1          = 'J'  !                        00007580
        /*          FRAVIK_5_1          = 'J'  ! */                     00007590
                    FRAVIK_BOSATT_EØS   = 'J'  !                        00007600
                    UNG_UFØR            = 'J' ) THEN                    00007610
                  DO;                                                   00007620
                     FEIL_FUNNET         = '1'B;                        00007630
                     U3SP.PENSJONSTRYGDETNR = 463;                      00007640
                  END;                                                  00007650
            IF BOSATT = 0                        THEN                   00007660
               IF (PENSJONSTRYGDET     = 'J')  !                        00007670
                  (MINST_20_ÅR         = 'J')  !                        00007680
                  (KONVENSJON          = 'J')  !                        00007690
                  (FRAVIK_BOSATT_EØS   = 'J')      THEN                 00007700
                  DO;                                                   00007710
                     FEIL_FUNNET         = '1'B;                        00007720
                     U3SP.BOSATTNR       = 465;                         00007730
                  END;                                                  00007740
                                                                        00007750
            IF (KONVENSJON          = 'J') &                            00007760
               (FRAVIK_BOSATT_EØS   = 'J')      THEN                    00007770
                  DO;                                                   00007780
                     FEIL_FUNNET         = '1'B;                        00007790
                     U3SP.KONVENSJONNR   = 466;                         00007800
                  END;                                                  00007810
                                                                        00007820
            IF FRAVIK_BOSATT_EØS   = 'J'   &                            00007830
                    FRAVIK_FLYKT  ^= 'J'         THEN                   00007840
               IF ^(STATSBORGER < 107)       & /*NORDEN          */     00007850
                  ^(STATSBORGER = 112)       & /*BELGIA          */     00007860
                  ^(STATSBORGER = 117)       & /*FRANKRIKE       */     00007870
                  ^(STATSBORGER = 118)       & /*GIBRALTAR       */     00007880
                  ^(STATSBORGER = 119)       & /*HELLAS          */     00007890
                  ^(STATSBORGER = 121)       & /*IRLAND          */     00007900
                  ^(STATSBORGER = 123)       & /*ITALIA          */     00007910
                  ^(STATSBORGER = 129)       & /*LUXEMBURG       */     00007920
                  ^(STATSBORGER = 127)       & /*NEDERLAND       */     00007930
                  ^(STATSBORGER = 132)       & /*PORTUGAL        */     00007940
                  ^(STATSBORGER = 137)       & /*SPANIA          */     00007950
                  ^(STATSBORGER = 139)       & /*STORBRITANNIA   */     00007960
                  ^(STATSBORGER = 144)       & /*VEST-TYSKLAND   */     00007970
                  ^(STATSBORGER = 151)       & /*ØST-TYSKLAND    */     00007980
                  ^(STATSBORGER = 153) THEN    /*ØSTERRIKE       */     00007990
                  DO;                                                   00008000
                     FEIL_FUNNET         = '1'B;                        00008010
                     FRAVIK_BOSATT_EØSNR = 467;                         00008020
                  END;                                                  00008030
                                                                        00008040
            IF FRAVIK_FLYKT = 'J'                 THEN                  00008050
               IF BOSATT > 0    &       /*IKKE I NORGE*/                00008060
                  PENSJONSTRYGDET ^= 'J'           THEN                 00008070
                  DO;                                                   00008080
                     FEIL_FUNNET         = '1'B;                        00008090
                     FRAVIK_FLYKTNR      = 469;                         00008100
                  END;                                                  00008110
                                                                        00008120
            /* KONTROLL GAMMEL NORDISK KONVENSJON */                    00008130
            IF BOSATT > 106 THEN                                        00008140
               DO;                                                      00008150
                  IF IKKE_GP = 'J' THEN                                 00008160
                     DO;                                                00008170
                        FEIL_FUNNET         = '1'B;                     00008180
                        IKKE_GPNR           = 470;                      00008190
                     END;                                               00008200
                                                                        00008210
                  IF AVKORT_SÆRTILL = 'J' THEN                          00008220
                     DO;                                                00008230
                        FEIL_FUNNET         = '1'B;                     00008240
                        AVKORT_SÆRTILLNR    = 471;                      00008250
                     END;                                               00008260
               END;                                                     00008270
                                                                        00008280
            IF BEREGNING_KONV = 'J'        &                            00008290
               (TT_NORDEN_ANNET = 'J'   !                               00008300
                AVKORT_SÆRTILL  = 'J')             THEN                 00008310
                  DO;                                                   00008320
                     FEIL_FUNNET         = '1'B;                        00008330
                     BEREGNING_KONVNR    = 472;                         00008340
                  END;                                                  00008350
                                                                        00008360
            IF TT_FRA1937_ÅR > 0    &                                   00008370
               HJ_VIRK_ÅM < 9100                THEN                    00008380
                  DO;                                                   00008390
                     FEIL_FUNNET         = '1'B;                        00008400
                     TT_FRA1937_ÅRNR     = 475;                         00008410
                  END;                                                  00008420
                                                                        00008430
 /*         IF  ^(TT_F67 = 0  & TT_E66_Å = 0)   &                       00008440
               HJ_VIRK_ÅM > 9100                THEN                    00008450
                  DO;                                                   00008460
                     FEIL_FUNNET         = '1'B;                        00008470
                     TT_F67NR            = 474;                         00008480
                  END;                                    */            00008490
           IF U3SP.TT_E66_Å > 0         THEN                            00008500
           DO;                                                          00008510
           /* TRYGDETID TIL SØKER ER UTFYLT */                          00008520
              CALL TT_UP_EP(U3S.FNR,U3S.UFT_MÅ,MAKS_TT_FØR_1967,        00008530
              TT_TIL_TPK);                                              00008540
              IF TT_E66_ÅM > TT_TIL_TPK THEN                            00008550
                 DO;                                                    00008560
                    FEIL_FUNNET     = '1'B;                             00008570
                    U3SP.TT_E66_ÅNR = 112;                              00008580
                    U3SP.TT_E66_MNR = 999;                              00008590
                 END;                                                   00008600
            END;                                                        00008610
            IF TT_ENDRES = 'J'           THEN                           00008620
               IF HJ_VIRK_ÅM < 9100   &                                 00008630
                  ^(TT_F67 > 0  ! TT_E66_Å > 0)    THEN                 00008640
                  DO;                                                   00008650
                     FEIL_FUNNET         = '1'B;                        00008660
                     TT_F67NR            = 477;                         00008670
                  END;                                                  00008680
               ELSE /*VIRK ER DA ETTER 1.1.91*/                         00008690
               IF TT_FRA1937_ÅR = 0                THEN                 00008700
                  DO;                                                   00008710
                     FEIL_FUNNET         = '1'B;                        00008720
                     TT_FRA1937_ÅRNR     = 476;                         00008730
                  END;                                                  00008740
                                                                        00008750
            IF U3SP.AVKORT_SÆRTILL  ^= 'J'  &                           00008760
               U3SP.TP_NORDISK > 0                  THEN                00008770
               DO;                                                      00008780
                  FEIL_FUNNET         = '1'B;                           00008790
                  U3SP.TP_NORDISKNR   = 458;     /*EØS-HL*/             00008800
               END;                                                     00008810
            IF U3SP.AVKORT_SÆRTILL  ^= 'J'  &                           00008820
               U3SP.TP_NORDISK_LAND > 0             THEN                00008830
               DO;                                                      00008840
                  FEIL_FUNNET         = '1'B;                           00008850
                  U3SP.TP_NORDISK_LANDNR = 459;  /*EØS-HL*/             00008860
               END;                                                     00008870
            IF U3SP.TP_NORDISK     > 0      &                           00008880
               U3SP.TP_NORDISK_LAND = 0             THEN                00008890
               DO;                                                      00008900
                  FEIL_FUNNET         = '1'B;                           00008910
                  U3SP.TP_NORDISK_LANDNR = 460;  /*EØS-HL*/             00008920
               END;                                                     00008930
                                                                        00008940
        FYLT_SEKSTISJU = ((ÅR + 67) * 12) + MN;                         00008950
                                                                        00008960
        FYLT_SYTTI = FYLT_SEKSTISJU + (3 * 12);                         00008970
                                                                        00008980
 /* ***************************************************************** */00008990
 /* KONTROLLERER SØKERENS TRYGDETID :                                 */00009000
 /* ***************************************************************** */00009010
                                                                        00009020
    TT_MAKS_TIL_DATO = (HJ_UFT_Å - FNR.ÅR - 16) * 100 + HJ_UFT_M;       00009030
                                                                        00009040
    W_TT_MND  = U3SP.TT_FRA1937_ÅR * 12 + U3SP.TT_FRA1937_MND;          00009050
                                                                        00009060
    IF W_TT_MND > TT_MAKS_TIL_DATO THEN                                 00009070
       DO;                                                              00009080
          FEIL_FUNNET     = '1'B;                                       00009090
          U3SP.TT_FRA1937_ÅRNR  = 359;                                  00009100
       END;                                                             00009110
 END;                                                                   00009120
                                                                        00009130
   SJEKK_TT_NUMERISK: PROC;                                             00009140
                                                                        00009150
     IF ^F_NUMERISK(F_FELT_PIC_CHAR2(U3SP.TT_FRA1937_ÅR)) THEN          00009160
        DO;                                                             00009170
           FEIL_FUNNET           = '1'B;                                00009180
           U3SP.TT_FRA1937_ÅRNR  = 200;                                 00009190
        END;                                                            00009200
     IF ^F_NUMERISK(F_FELT_PIC_CHAR2(U3SP.TT_FRA1937_MND)) THEN         00009210
        DO;                                                             00009220
           FEIL_FUNNET           = '1'B;                                00009230
           U3SP.TT_FRA1937_MNDNR = 200;                                 00009240
        END;                                                            00009250
     IF ^F_NUMERISK(F_FELT_PIC_CHAR4(U3SP.STI_MÅ_3B)) THEN              00009260
        DO;                                                             00009270
           FEIL_FUNNET        = '1'B;                                   00009280
           U3SP.STI_MÅ_3BNR      = 200;                                 00009290
        END;                                                            00009300
 /*FJERNES I NY U3 :                                                    00009310
     IF ^F_NUMERISK(F_FELT_PIC_CHAR4(U3SP.STI_MÅ_3C)) THEN              00009320
        DO;                                                             00009330
           FEIL_FUNNET        = '1'B;                                   00009340
           U3SP.STI_MÅ_3CNR      = 200;                                 00009350
        END;      HIT   9803  *************************** */            00009360
     IF ^F_NUMERISK(F_FELT_PIC_CHAR2(U3SP.TT_F67)) THEN                 00009370
        DO;                                                             00009380
           FEIL_FUNNET           = '1'B;                                00009390
           U3SP.TT_F67NR         = 200;                                 00009400
        END;                                                            00009410
     IF ^F_NUMERISK(F_FELT_PIC_CHAR2(U3SP.TT_E66_Å)) THEN               00009420
        DO;                                                             00009430
           FEIL_FUNNET           = '1'B;                                00009440
           U3SP.TT_E66_ÅNR       = 200;                                 00009450
        END;                                                            00009460
     IF ^F_NUMERISK(F_FELT_PIC_CHAR2(U3SP.TT_E66_M)) THEN               00009470
        DO;                                                             00009480
           FEIL_FUNNET           = '1'B;                                00009490
           U3SP.TT_E66_MNR       = 200;                                 00009500
        END;                                                            00009510
     IF ^F_NUMERISK(F_FELT_PIC_CHAR2(U3SP.TT_F67_EK)) THEN              00009520
        DO;                                                             00009530
           FEIL_FUNNET           = '1'B;                                00009540
           U3SP.TT_F67_EKNR      = 200;                                 00009550
        END;                                                            00009560
     IF ^F_NUMERISK(F_FELT_PIC_CHAR2(U3SP.TT_E66_Å_EK)) THEN            00009570
        DO;                                                             00009580
           FEIL_FUNNET           = '1'B;                                00009590
           U3SP.TT_E66_Å_EKNR    = 200;                                 00009600
        END;                                                            00009610
     IF ^F_NUMERISK(F_FELT_PIC_CHAR2(U3SP.TT_E66_M_EK)) THEN            00009620
        DO;                                                             00009630
           FEIL_FUNNET           = '1'B;                                00009640
           U3SP.TT_E66_M_EKNR    = 200;                                 00009650
        END;                                                            00009660
   END SJEKK_TT_NUMERISK;                                               00009670
                                                                        00009680
  END KONTROLL_U3_SPES;                                                 00009690
