 /*       SIST ENDRET 22/07-97 12.21.30 AV   JDA7339                  */00000000
 /*       SIST ENDRET 11/02-97 13.41.36 AV   JDA7339                  */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /* **********************                                            */00000040
 /*  PROGRAM-IDENT : R001UJ05   KONTROLL_KFP_SPES  SUBPROGRAM         */00000050
 /*  PROGRAM-SPRÅK : PLI                                              */00000060
 /*  PROGRAMMERER  : SATISH/ TRUDE                                    */00000070
 /*  PROGRAMMET BLE LAGET : 0896                                      */00000080
 /* ***************************************************************** */00000090
 /*HENSIKT:                                                           */00000100
 /* **********                                                        */00000110
 /*  KONTROLLERER GRUNNBLANKETT KFP - DEN SPESIELLE DEL.              */00000120
 /*  RETURNERER FEIL_FUNNET = '1'B VED FEIL, ELLERS '0'B.             */00000130
 /*                                                                   */00000140
 /* ***************************************************************** */00000150
 /*PROGRAMTILKNYTTING:                                                */00000160
 /* ********************                                              */00000170
 /*  PROGRAMMET INCLUDES AV R001UJ01 - KONTROLL_GRUNNBLANKETT_KFP     */00000180
 /*  ARBEIDSOMRÅDET P001UJ01 ER INCLUDET I HOVEDPROG.                 */00000190
 /*  BRUK :                                                           */00000200
 /*      CALL KONTROLL_KFP_SPES(FEIL_FUNNET)                          */00000210
 /*                                                                   */00000220
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN INCLUDES I HOVEDPROG :       */00000230
 /*      R0019907 - F_TABSØKC_FUNNET                                  */00000240
 /*      R0019910 - F_NUMERISK                                        */00000250
 /*      R0019912 - F_FELT_PIC_CHARNN                                 */00000260
 /*      VERIFY   - BUILTIN-FUNCTION                                  */00000270
 /*                                                                   */00000280
 /*  EKSTERN PROSEDYRE SOM CALLES :                                   */00000290
 /*      R001UJ08 - TT_KFP       (INCLUDE I HOVEDPROG)                */00000300
 /*                                                                   */00000310
 /*  INTERNE PROSEDYRER :                                             */00000320
 /*      KONTROLL_KFP_SPES(FEIL_FUNNET)                               */00000330
 /*      SJEKK_TT_NUMERISK                                            */00000340
 /*                                                                   */00000350
 /* ***************************************************************** */00000360
 /*DATASETTOPPLYSNINGER:                                              */00000370
 /* ***********************                                           */00000380
 /*   INGEN                                                           */00000390
 /* ***************************************************************** */00000400
 /*FEILMELDINGER:                                                     */00000410
 /* *******************                                               */00000420
 /*   MELDINGSNR LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM            */00000430
 /*   FEIL_FUNNET SETTES = '1'B.                                      */00000440
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDINGER PÅ SKJERMBILDET.   */00000450
 /*   KFP SKAL HA FEILMELDINGSNUMRE FRA 400 TIL 494.  ERIK 31.10.88   */00000460
 /*                                                                   */00000470
 /* ***************************************************************** */00000480
 KONTROLL_KFP_SPES:                                                     00000490
   PROC(FEIL_FUNNET);                                                   00000500
 %PAGE;                                                                 00000510
   DCL                                                                  00000520
      FEIL_FUNNET                        BIT(1);                        00000530
   DCL                                                                  00000540
      KEY_BIT1                   BIT(32) BASED (KEY_PEKER1),            00000550
      KEY_BIT2                   BIT(32) BASED (KEY_PEKER2),            00000560
      KEY_PEKER1                 POINTER,                               00000570
      KEY_PEKER2                 POINTER,                               00000580
      ST_RECL                    CHAR (35);                             00000590
   DCL                                                                  00000600
      T_FNR                              PIC'(11)9',                    00000610
      T_VIRK_DATO                        PIC'(4)9';                     00000620
   DCL                                                                  00000630
      T_VIRK_DATO_MMM                    PIC'(4)9';                     00000640
   DCL                                                                  00000650
      VIRK_DATO_M DEF T_VIRK_DATO POS(1) PIC'(2)9',                     00000660
      VIRK_DATO_Å DEF T_VIRK_DATO POS(3) PIC'(2)9';                     00000670
   DCL                                                                  00000680
      HJ_FELT_3                          CHAR(3);                       00000690
   DCL                                                                  00000700
      1 NR DEF T_FNR,                                                   00000710
        2 DG                             PIC'99',                       00000720
        2 MN                             PIC'99',                       00000730
        2 ÅR                             PIC'99',                       00000740
        2 PERSNR,                                                       00000750
          3 ÅRHUNDRE                     PIC'999',                      00000760
          3 REST                         PIC'99';                       00000770
   DCL                                                                  00000780
      FYLT_SEKSTISJU                     PIC'(4)9';                     00000790
   DCL                                                                  00000800
      FYLT_SEKSTISEKS                    PIC'(4)9'; /* ERIK 28.10.88 */ 00000810
   DCL                                                                  00000820
      FYLT_SEKSTIFEM                     PIC'(4)9'; /* ERIK 28.10.88 */ 00000830
   DCL                                                                  00000840
      TT_MAKS_TIL_DATO                   PIC'9999',                     00000850
      W_TT_MND                           PIC'9999',                     00000860
      OVER_MND                           PIC'99',                       00000870
      TT                                 PIC'99';                       00000880
   DCL                                                                  00000890
      TT_TIL_TPK                         PIC'(4)9',                     00000900
      TT_16_66_ÅM                        PIC'(4)9';                     00000910
 %SKIP(2);                                                              00000920
      T_FNR       = KFP.FNR;                                            00000930
      T_VIRK_DATO = KFP.VIRK_DATO_MÅ;                                   00000940
      TT_16_66_ÅM = (KFPSP.TT_16_66_Å * 100) + KFPSP.TT_16_66_M;        00000950
      KEY_PEKER1  = ADDR(KFPSP.STATSBORGER);                            00000960
      KEY_PEKER2  = ADDR(KFPSP.BOSATT);                                 00000970
 %PAGE;                                /*    */                         00000980
 /* ***************************************************************** */00000990
 /* TESTER OM FORUTSETNINGENE FOR Å KONTROLLERE FELTENE I SPES.INFO   */00001000
 /* DELEN ER TILSTEDE.                                                */00001010
 /* ***************************************************************** */00001020
  FEIL_FUNNET = '0'B;                                                   00001030
  CALL SJEKK_TT_NUMERISK;                                               00001040
                                                                        00001050
  IF ^FEIL_FUNNET THEN                                                  00001060
    DO;                                                                 00001070
      IF KFPSP.TT_16_66_Å          =  0 &                               00001080
         KFPSP.TT_16_66_M          = 0 &                                00001090
         KFPSP.STATSBORGER         = 0     &                            00001100
         KFPSP.BOSATT              = 0     &                            00001110
         KFPSP.OVERKOMP_UTL        = ' ' THEN                           00001120
        DO;                                                             00001130
          FEIL_FUNNET        = '1'B;                                    00001140
          KFP.NORSK_BOSATTNR = 61;                                      00001150
        END;                                                            00001160
      ELSE                                                              00001170
        DO;                                                             00001180
 /* ***************************************************************** */00001190
 /* FELTKONTROLLER.........                                           */00001200
 /* ***************************************************************** */00001210
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND1);               00001220
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT1)       00001230
                                               INTO(ST_RECL);           00001240
              GOTO STAT_UT;                                             00001250
          NOTFND1:                                                      00001260
              FEIL_FUNNET        = '1'B;                                00001270
              KFPSP.STATSBORGERNR = 24;                                 00001280
              GOTO STAT_UT;                                             00001290
          STAT_UT:                                                      00001300
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND2);               00001310
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT2)       00001320
                                               INTO(ST_RECL);           00001330
              GOTO BO_UT;                                               00001340
          NOTFND2:                                                      00001350
              FEIL_FUNNET   = '1'B;                                     00001360
              KFPSP.BOSATTNR = 25;                                      00001370
              GOTO BO_UT;                                               00001380
          BO_UT:                                                        00001390
                                                                        00001400
          IF ^(KFPSP.FRAVIK_FLYKT  = ' ' !                              00001410
               KFPSP.FRAVIK_FLYKT  = 'J') THEN                          00001420
            DO;                                                         00001430
              FEIL_FUNNET         = '1'B;                               00001440
              KFPSP.FRAVIK_FLYKTNR = 403;                               00001450
            END;                                                        00001460
                                                                        00001470
         IF KFPSP.FRAVIK_FLYKT = 'J' & KFPSP.TT_16_66_Å > 0 THEN        00001480
              DO;                                                       00001490
                FEIL_FUNNET         = '1'B;                             00001500
                KFPSP.FRAVIK_FLYKTNR = 403;                             00001510
                KFPSP.TT_16_66_ÅNR  = 999;                              00001520
              END;                                                      00001530
                                                                        00001540
          IF ^(KFPSP.OVERKOMP_UTL = 'J' !                               00001550
                               KFPSP.OVERKOMP_UTL = ' ') THEN           00001560
            DO;                                                         00001570
              FEIL_FUNNET         = '1';                                00001580
              KFPSP.OVERKOMP_UTLNR = 35;                                00001590
            END;                                                        00001600
          IF KFPSP.TT_16_66_M > 12 THEN                                 00001610
            DO;                                                         00001620
              FEIL_FUNNET = '1'B;                                       00001630
              KFPSP.TT_16_66_MNR = 31;                                  00001640
            END;                                                        00001650
        END;                                                            00001660
 /* ***************************************************************** */00001670
 /* KRYSSKONTROLLER                                                   */00001680
 /* ***************************************************************** */00001690
                                                                        00001700
 /* ***************************************************************** */00001710
 /* REGNER UT ÅR OG MND VEDKOMMENDE FYLLER 66 ÅR (ÅÅMM)               */00001720
 /*(SIFFER 7-9 ANGIR ÅRHUNDRE:1800-TALLET 500-749,1900-TALLET 000-499)*/00001730
 /* ***************************************************************** */00001740
            IF ÅRHUNDRE <= 499 THEN                                     00001750
               FYLT_SEKSTISEKS = ((ÅR + 66) * 12) + MN;                 00001760
           ELSE                                                         00001770
               FYLT_SEKSTISEKS = (((ÅR + 66) - 100) * 12) + MN;         00001780
 /* ***************************************************************** */00001790
 /* REGNER UT ÅR OG MND VEDKOMMENDE FYLLER 65 ÅR (ÅÅMM)               */00001800
 /*(SIFFER 7-9 ANGIR ÅRHUNDRE:1800-TALLET 500-749,1900-TALLET 000-499)*/00001810
 /* ***************************************************************** */00001820
           IF ÅRHUNDRE <= 499 THEN                                      00001830
              FYLT_SEKSTIFEM = ((ÅR + 65) * 12) + MN;                   00001840
           ELSE                                                         00001850
              FYLT_SEKSTIFEM = (((ÅR + 65) - 100) * 12) + MN;           00001860
 /* ***************************************************************** */00001870
 /* REGNER OM ANT.MND.VENTET I UTLANDET (MM) TIL ÅR OG MND (ÅÅMM)     */00001880
 /* ***************************************************************** */00001890
           T_VIRK_DATO_MMM = (VIRK_DATO_Å * 12) + VIRK_DATO_M;          00001900
 /* ***************************************************************** */00001910
 /* KONTROLL AV SØKERENS TRYGDETID:                                   */00001920
 /* ***************************************************************** */00001930
                IF KFPSP.TT_16_66_Å = 0 &                               00001940
                   KFPSP.TT_16_66_M = 0 &                               00001950
                   KFPSP.FRAVIK_FLYKT = ' ' THEN  /* 0797 */            00001960
                   DO;                                                  00001970
                     FEIL_FUNNET = '1'B;                                00001980
                     KFPSP.TT_16_66_ÅNR = 999;                          00001990
                     KFPSP.TT_16_66_MNR = 999;                          00002000
                   END;                                                 00002010
                                                                        00002020
    TT_MAKS_TIL_DATO = (VIRK_DATO_Å - NR.ÅR - 16) * 100 + VIRK_DATO_M;  00002030
    W_TT_MND  = KFPSP.TT_16_66_Å * 12 + KFPSP.TT_16_66_M;               00002040
                                                                        00002050
    IF W_TT_MND > TT_MAKS_TIL_DATO THEN                                 00002060
       DO;                                                              00002070
          FEIL_FUNNET     = '1'B;                                       00002080
          KFPSP.TT_16_66_ÅNR  = 359;                                    00002090
       END;                                                             00002100
                                                                        00002110
     END; /* ^FEIL FUNNET*/                                             00002120
                                                                        00002130
                                                                        00002140
  SJEKK_TT_NUMERISK:                                                    00002150
      PROC;                                                             00002160
                                                                        00002170
            IF ^F_NUMERISK(F_FELT_PIC_CHAR2(KFPSP.TT_16_66_Å)) THEN     00002180
               DO;                                                      00002190
                  FEIL_FUNNET         = '1'B;                           00002200
                  KFPSP.TT_16_66_ÅNR  = 200;                            00002210
               END;                                                     00002220
            IF ^F_NUMERISK(F_FELT_PIC_CHAR2(KFPSP.TT_16_66_M)) THEN     00002230
               DO;                                                      00002240
                  FEIL_FUNNET         = '1'B;                           00002250
                  KFPSP.TT_16_66_MNR  = 200;                            00002260
               END;                                                     00002270
      END SJEKK_TT_NUMERISK;                                            00002280
 END KONTROLL_KFP_SPES;                                                 00002290
