 /*       SIST ENDRET 29/08-97 12.28.07 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/08-97 08.52.46 AV   SPA7339                  */00000010
 /*       SIST ENDRET 19/03-97 10.44.52 AV   JDA7339                  */00000020
 /*       SIST ENDRET 10/05-94 10.05.32 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 21/04-93 15.38.22 AV   TRUDE                    */00000040
 /*       SIST ENDRET 12/06-92 13.52.20 AV   TRUDE                    */00000050
 /*       SIST ENDRET 23/03-92 14.59.00 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 16/03-92 09.50.09 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 17/02-92 13.45.16 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 28/01-92 12.26.33 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 14/06-91 13.25.43 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 11/12-90 13.22.04 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 04/10-90 15.15.00 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 29/08-90 11.02.03 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 27/06-90 08.44.56 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 18/06-90 11.23.07 AV   HERMAN                   */00000150
 /*       SIST ENDRET 18/06-90 11.14.56 AV   HERMAN                   */00000160
 /*       SIST ENDRET 18/06-90 11.11.42 AV   HERMAN                   */00000170
 /*       SIST ENDRET 16/06-90 12.54.24 AV   HERMAN                   */00000180
 /*       SIST ENDRET 15/06-90 22.52.28 AV   HERMAN                   */00000190
 /*       SIST ENDRET 27/03-90 12.08.06 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 11/01-90 09.04.32 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 22/12-89 09.23.18 AV   HERMAN                   */00000220
 /*       SIST ENDRET 01/12-89 08.40.14 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 31/05-89 08.30.24 AV   DYBVIK                   */00000240
 /*       SIST ENDRET 17/03-89 15.01.32 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 14/12-88 13.18.53 AV   DYBVIK                   */00000260
 /*       SIST ENDRET 29/03-88 13.14.02 AV   DYBVIK                   */00000270
 /*       SIST ENDRET 10/03-87 08.57.17 AV   DYBVIK                   */00000280
 /*       SIST ENDRET 13/06-84 13.56.49 AV   OLAV                     */00000290
 /*       SIST ENDRET 26/10-83 20.33.27 AV   OLAV                     */00000300
 /*       SIST ENDRET 06/07-83 06.46.22 AV   OLAV                     */00000310
 /*       SIST ENDRET 19/05-83 08.55.59 AV   OLAV                     */00000320
 /*       SIST ENDRET 13/04-83 15.18.16 AV   OLAV                     */00000330
 /* ***************************************************************** */00000340
 /*IDENTIFIKASJON:                                                    */00000350
 /*    R0014137 - JUSTER_MED_APD - INTERN PROC I PLI.                 */00000360
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982.                          */00000370
 /*HENSIKT:                                                           */00000380
 /*    PROGRAMMET JUSTERER DIVERSE ALDERSP. ELEMENTER I B02 MED APD.  */00000390
 /*PROGRAMTILKNYTNING:                                                */00000400
 /*    PROGRAMMET BLIR INKLUDERT I 4126 OG 4222                  .    */00000410
 /*BRUK:                                                              */00000420
 /*    CALL JUSTER_MED_APD;                                           */00000430
 /*ENDRET  : 23.10.90 AV TRUDE. GARANTIEN FOR UNGE UFØRE FØR 1867     */00000440
 /*          ENDRES FRA 1.6 TIL 2 FRA 0191.                           */00000450
 /* ***************************************************************** */00000460
 JUSTER_MED_APD: PROC;                                                  00000470
 DCL W_FNR_EK           PIC'(11)9';                                     00000480
 DCL FNR_ÅR_EK          DEF W_FNR_EK POS(5) PIC '99';                   00000490
 DCL SUM_TP             FIXED DEC(5);                                   00000500
 DCL W_KOMPFAKTOR       FIXED DEC(3,1);                                 00000510
 DCL W_APD              FIXED DEC(3);                                   00000520
 DCL W_GP               FIXED DEC(11,4);        /*29.9.89 HL*/          00000530
 DCL W_BT               FIXED DEC(5) INIT(0);                           00000540
 DCL W_DATO_ÅM          PIC'(4)9';                                      00000550
 DCL W_ÅR  DEF W_DATO_ÅM POS(1)   PIC'99';                              00000560
 DCL W_MN  DEF W_DATO_ÅM POS(3)   PIC'99';                              00000570
 DCL W_DATO_MÅ          PIC'9999';                                      00000580
                                                                        00000590
 DCL SPT_GARANTI        FIXED DEC(3,2) INIT (0);          /*UF*/        00000600
 DCL TP_GARANTI1        FIXED DEC(5) INIT (0);            /*UF*/        00000610
 DCL TP_GARANTI         FIXED DEC(11,4) INIT (0);         /*UF*/        00000620
 DCL UFGRAD             FIXED DEC(3) INIT(0);             /*UF*/        00000630
 DCL SEKSTI             FIXED DEC(5) INIT(0);       /*HL*/              00000640
                                                                        00000650
 DCL YRKE_GP         FIXED DEC (7) INIT (0);                            00000660
 DCL YRKE_TP         FIXED DEC (7) INIT (0);                            00000670
 DCL ALDER_TP        FIXED DEC (7) INIT (0);                            00000680
 DCL TP_YA_PT_55     FIXED DEC (7) INIT (0);                            00000690
  DCL ALDER_TP_55     FIXED DEC (7) INIT (0);                           00000700
  DCL REST_GRAD       FIXED DEC (3) INIT (0);                           00000710
  DCL REST_APD        FIXED DEC (5,2) INIT (0);                         00000720
  DCL REST_HJELP      FIXED DEC (7,4) INIT (0);                         00000730
  DCL GP_FAKTOR       FIXED DEC (5,4) INIT (0);                         00000740
  DCL        TP_WORK           FIXED DEC (13,4);                        00000750
  DCL        FAKTOR1           FIXED DEC (13,4);                        00000760
  DCL        FAKTOR2           FIXED DEC (13,4);                        00000770
  DCL SISTE_KODE      PIC '9';                                          00000780
  DCL J  FIXED BIN (15);                                                00000790
                                                                        00000800
 W_DATO_ÅM = B02.VIRK_DATO_ÅM(BER_SØ_IND);                              00000810
 W_DATO_MÅ = W_MN !! W_ÅR;                                              00000820
                                                                        00000830
 W_APD = B02.ALDERSP.APD(BER_SØ_IND);                                   00000840
 IF W_APD = 0    THEN                                                   00000850
    W_APD = 100;                                                        00000860
                                                                        00000870
 W_FNR_EK = B02.FNR(BER_EK_IND); /* FLYTTET.TRUDE */                    00000880
                                                                        00000890
                         /***  GP - ENDRET PGA AFP ***/                 00000900
                                                                        00000910
 /* *************************************************************** */  00000920
 /* FØRST FINNER VI OM GP SKAL REDUSERES PGA AV EKTEFELLENS PENSJON */  00000930
 /* VI SETTER EVT KODE FOR GAMMEL_SAMMENSTØTS_REGEL                 */  00000940
 /* *************************************************************** */  00000950
                                                                        00000960
 IF B02.PENSJONSTYPE2(BER_SØ_IND)  = 'S'   !                            00000970
    (B02.PENSJONSTYPE2(BER_SØ_IND) = 'N'   &                            00000980
     B02.SIVILSTAND   (BER_SØ_IND) = 'G'   &                            00000990
     B02.PENSJONSTYPE2(BER_EK_IND) = 'P')  THEN                         00001000
                                                                        00001010
    DO;                                                                 00001020
                                                                        00001030
 /*TILLEGG 18.9.89 HL - LOVENDRING 7.2 NR 2 B - 2. SETNING UTGÅR */     00001040
                                                                        00001050
       IF B01.PENSJONSTYPE2(BER_SØ_IND)    = 'S'    &                   00001060
          B01.STATUS_KODE_HIST(BER_SØ_IND) = ' '    &                   00001070
          B01.UFØRPENS.UFG    (BER_EK_IND) < 100    &                   00001080
          B01.UFØRPENS.UFG    (BER_EK_IND) >   0    &                   00001090
          B01.VIRK_DATO_ÅM    (BER_SØ_IND) < 9001  THEN                 00001100
                                                                        00001110
          B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'J';               00001120
                                                                        00001130
       IF  (B02.PENSJONSTYPE1(BER_EK_IND) = 'U' !                       00001140
            B02.PENSJONSTYPE1(BER_EK_IND) = 'Y'  )    THEN              00001150
          DO;                                                           00001160
                                                                        00001170
             IF (B02.VIRK_DATO_ÅM    (BER_SØ_IND) < 9001 !              00001180
                B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'J') THEN    00001190
                                                                        00001200
                GP_FAKTOR= 1 - 0.25*B02.UFØRPENS.UFG(BER_EK_IND)/100;   00001210
             ELSE                                                       00001220
                DO;                                                     00001230
                   B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'N';      00001240
                   GP_FAKTOR = 0.75;                                    00001250
                END;                                                    00001260
          END;                                                          00001270
       ELSE                                                             00001280
          GP_FAKTOR = 0.75;                                             00001290
    END;                                                                00001300
 ELSE                                                                   00001310
    GP_FAKTOR = 1;                                                      00001320
                                                                        00001330
 /* *************************************************************** */  00001340
 /* SÅ FINNER VI OM HER SKAL BEREGNES MED YRKESSKADEFORDELER        */  00001350
 /*     BEREGNINGS_ALT_EGEN = '3' BETYR AT YP GIR FORDEL            */  00001360
 /*     BEREGNINGS_ALT_EGEN = '4' BETYR AT YP GIR FORDEL  -         */  00001370
 /*                     OG AT HER ER ETTERLATTE-FORDEL I BEREGNINGEN*/  00001380
 /* *************************************************************** */  00001390
                                                                        00001400
  IF DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '3' !                          00001410
     DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '4'   THEN                     00001420
                                                                        00001430
     DO;                                                                00001440
 /*           YRKE_GP=(B02.YRKEPENS.YUG(BER_SØ_IND)/100)    */          00001450
 /*                    * GP_FAKTOR * W_APD / 100            */          00001460
 /*                    * G / 12 + 0.5;                      */          00001470
                                                                        00001480
 /*ENDRET 27.3.90 HL - SPLITTET OPP : */                                00001490
                                                                        00001500
        W_GP   = B02.YRKEPENS.YUG(BER_SØ_IND)/100;                      00001510
        W_GP   = W_GP * G;                                              00001520
        W_GP   = W_GP * GP_FAKTOR;                                      00001530
        W_GP   = W_GP * W_APD;                                          00001540
        W_GP   = W_GP / 100;                                            00001550
        W_GP   = W_GP / 12;                                             00001560
        YRKE_GP= W_GP + 0.5;                                            00001570
                                                                        00001580
        REST_GRAD = 100 - B02.YRKEPENS.YUG(BER_SØ_IND);                 00001590
        IF REST_GRAD > 0      THEN                                      00001600
                                                                        00001610
              REST_APD   = (REST_GRAD / 100) * W_APD;                   00001620
        ELSE                                                            00001630
              REST_APD   = 0;                                           00001640
                                                                        00001650
        B02.ALDERSP.GP(BER_SØ_IND) =  G * GP_FAKTOR *                   00001660
 /*                                         REST_APD / 100 *  */        00001670
                                            REST_APD * 0.01 *           00001680
                                      B02.TT_ANV(BER_SØ_IND)/           00001690
                                      (40 * 12) + 0.5;                  00001700
        B02.ALDERSP.GP(BER_SØ_IND) =                                    00001710
                           B02.ALDERSP.GP(BER_SØ_IND) + YRKE_GP;        00001720
     END;                                                               00001730
  ELSE                                                                  00001740
                                                                        00001750
     B02.ALDERSP.GP(BER_SØ_IND) =  G * GP_FAKTOR *                      00001760
                                  W_APD / 100 *                         00001770
                                  B02.TT_ANV(BER_SØ_IND)/               00001780
                                  (40 * 12) + 0.5;                      00001790
                                                                        00001800
                                                                        00001810
                         /*** TP  ***/                                  00001820
                                                                        00001830
 IF B02.TP_BRUTTO(BER_SØ_IND) > 0 THEN   /* ETTERL_ALT ER STØRST */     00001840
                                                                        00001850
  DO;                                                                   00001860
                                                                        00001870
     IF DIV_PARAM_OMR.BEREGNINGS_ALT_AVD = '3'   THEN                   00001880
                                                                        00001890
 /* *************************************************************** */  00001900
 /*     ALT_AVD ='3' BETYR AT EKTEFELLEN HADDE EN YRKESSKADE, SOM   */  00001910
 /*     GIR DEN ETTERLATTE EN PENSJONSFORDEL. KODEN ER SATT I 4131  */  00001920
 /* *************************************************************** */  00001930
                                                                        00001940
        B02.TP_BRUTTO(BER_SØ_IND) = B02.TP_BRUTTO(BER_SØ_IND)           00001950
                                    * W_APD / 100 + 0.5;                00001960
     ELSE                                                               00001970
                                                                        00001980
              B02.TP_BRUTTO(BER_SØ_IND) = F_TP92(FNR_ÅR_EK,             00001990
                                          G,B02.SPT_AVD(BER_SØ_IND),    00002000
                                          B02.OPT_AVD(BER_SØ_IND),      00002010
                                          B02.PÅ_AVD (BER_SØ_IND),      00002020
                              B02.ETTEPENS.PÅ_ETTER91(BER_SØ_IND),      00002030
                                          W_APD,55,'J');                00002040
                                                                        00002050
 /* *************************************************************** */  00002060
 /*   SÅ MÅ DET TESTES OM GJENLEVENDE HAR YRKESSKADEFORDELER -      */  00002070
 /*   ALT_EGEN = '4' = BÅDE FORDEL ETTER AVDØDE, OG AV EGEN YP      */  00002080
 /* *************************************************************** */  00002090
                                                                        00002100
     IF DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '4'   THEN                  00002110
                                                                        00002120
        DO;                                                             00002130
                                                                        00002140
          TP_WORK  = G * B02.YRKEPENS.YPT(BER_SØ_IND) * 0.55;           00002150
          TP_WORK  = TP_WORK * B02.YRKEPENS.YUG(BER_SØ_IND) /100;       00002160
          TP_WORK  = TP_WORK / 12;                                      00002170
          IF B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) = 0    THEN            00002180
          TP_YA_PT_55 = TP_WORK * 0.45 * W_APD / 100 + 0.5;             00002190
                                                                        00002200
          ELSE                                                          00002210
             DO;                                                        00002220
                FAKTOR1 = (B02.YRKEPENS.PÅ(BER_SØ_IND)                  00002230
                           - B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) )      00002240
                         / B02.YRKEPENS.PÅ(BER_SØ_IND) * 0.45;          00002250
                FAKTOR2 = B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND)           00002260
                         / B02.YRKEPENS.PÅ(BER_SØ_IND) * 0.42;          00002270
           TP_YA_PT_55 = TP_WORK * (FAKTOR1 + FAKTOR2 + 0.00005) + 0.5; 00002280
            END;                                                        00002290
                                                                        00002300
 /*        TP_YA_PT_55 = B02.YRKEPENS.YPT(BER_SØ_IND)                   00002310
                         * G * 0.45 * 0.55                              00002320
                         * B02.YRKEPENS.YUG(BER_SØ_IND) / 100           00002330
                         * W_APD / 100                                  00002340
                         / 12 + 0.5;               */                   00002350
                                                                        00002360
           ALDER_TP_55 = F_TP92(FNR_R.ÅR,G,                             00002370
                         POREKKE.SPT(BER_SØ_IND),                       00002380
                         POREKKE.OPT(BER_SØ_IND),                       00002390
                         POREKKE.PÅ (BER_SØ_IND),                       00002400
                 POREKKE.PÅ_ETTER91 (BER_SØ_IND),                       00002410
                         REST_APD,55,'J');                              00002420
           B02.ALDERSP.TP(BER_SØ_IND) = TP_YA_PT_55 +                   00002430
                                        ALDER_TP_55;                    00002440
        END;                                                            00002450
     ELSE                                                               00002460
                                                                        00002470
        B02.ALDERSP.TP(BER_SØ_IND)= F_TP92(FNR_R.ÅR,G,                  00002480
                         POREKKE.SPT(BER_SØ_IND),                       00002490
                         POREKKE.OPT(BER_SØ_IND),                       00002500
                         POREKKE.PÅ (BER_SØ_IND),                       00002510
                 POREKKE.PÅ_ETTER91 (BER_SØ_IND),                       00002520
                         W_APD,55,'J');                                 00002530
  END;                                                                  00002540
     ELSE   /*ETTERLATTE-ALTERNATIVET GIR IKKE FORDEL */                00002550
                                                                        00002560
 /* *************************************************************** */  00002570
 /*   SÅ MÅ DET TESTES OM GJENLEVENDE HAR YRKESSKADEFORDELER -      */  00002580
 /*   ALT_EGEN = '3' = FORDEL AV EGEN YRKESSKADE                    */  00002590
 /* *************************************************************** */  00002600
                                                                        00002610
   IF DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '3'   THEN                    00002620
      DO;                                                               00002630
                                                                        00002640
          TP_WORK  = G * B02.YRKEPENS.YPT(BER_SØ_IND);                  00002650
          TP_WORK  = TP_WORK * B02.YRKEPENS.YUG(BER_SØ_IND) /100;       00002660
          TP_WORK  = TP_WORK / 12;                                      00002670
          IF B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) = 0    THEN            00002680
          YRKE_TP  = TP_WORK * 0.45 * W_APD / 100 + 0.5;                00002690
                                                                        00002700
          ELSE                                                          00002710
             DO;                                                        00002720
                FAKTOR1 = (B02.YRKEPENS.PÅ(BER_SØ_IND)                  00002730
                           - B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) )      00002740
                         / B02.YRKEPENS.PÅ(BER_SØ_IND) * 0.45;          00002750
                FAKTOR2 = B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND)           00002760
                         / B02.YRKEPENS.PÅ(BER_SØ_IND) * 0.42;          00002770
                YRKE_TP = TP_WORK * (FAKTOR1 + FAKTOR2 + 0.00005) + 0.5;00002780
            END;                                                        00002790
                                                                        00002800
  /*     YRKE_TP = B02.YRKEPENS.YPT(BER_SØ_IND)                         00002810
                   * G * 0.45 * W_APD / 100                             00002820
                   * B02.YRKEPENS.YUG(BER_SØ_IND)                       00002830
                   / (100 * 12) + 0.5;               */                 00002840
                                                                        00002850
         ALDER_TP = F_TP92(FNR_R.ÅR,G,                                  00002860
                         POREKKE.SPT(BER_SØ_IND),                       00002870
                         POREKKE.OPT(BER_SØ_IND),                       00002880
                         POREKKE.PÅ (BER_SØ_IND),                       00002890
                 POREKKE.PÅ_ETTER91 (BER_SØ_IND),                       00002900
                         REST_APD,100,'J');                             00002910
                                                                        00002920
         B02.ALDERSP.TP(BER_SØ_IND) = YRKE_TP + ALDER_TP;               00002930
      END;                                                              00002940
                                                                        00002950
   ELSE                                                                 00002960
                                                                        00002970
                                                                        00002980
            B02.ALDERSP.TP(BER_SØ_IND) =                                00002990
                                   F_TP92(FNR_R.ÅR,G,                   00003000
                                   B02.ALDERSP.SPT(BER_SØ_IND),         00003010
                                   B02.ALDERSP.OPT(BER_SØ_IND),         00003020
                                   B02.ALDERSP.PÅ (BER_SØ_IND),         00003030
                           B02.ALDERSP.PÅ_ETTER91 (BER_SØ_IND),         00003040
                                   W_APD,100,'J');                      00003050
                                                                        00003060
                         /***  ST - ENDRET PGA AFP ***/                 00003070
                                                                        00003080
                         /*UF GARANTI 1.6 NÅR STATUS.TP_GAR_KODE='E'*/  00003090
                         /*FRA HIT, TRUDE 8.1.90                   '*/  00003100
                                                                        00003110
   DO J = 7 TO 1 BY -1 UNTIL (B02.UFØRHIST.BUP_GAR_KODE(BER_SØ_IND,J)   00003120
                                 ^= 'D');                               00003130
      SISTE_KODE  = J;                                                  00003140
   END;                                                                 00003150
                                                                        00003160
                                                                        00003170
  /*UNG UFØR BLE IKKE RIKTIG VED OVERGANG TIL ALDER  8.1.90. TRUDE */   00003180
                                                                        00003190
  /*     IF B02.STATUS.TP_GAR_KODE(BER_SØ_IND) = 'E'   &       */       00003200
    IF B01.PENSJONSTYPE1     (BER_SØ_IND) = 'U'   THEN                  00003210
       IF B01.BUP_GAR_KODE (BER_SØ_IND,1) = 'E'   THEN   /*9708 HL*/    00003220
            DO;                                                         00003230
              IF B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9101 THEN               00003240
                                                /*NY FRA 0191    */     00003250
                                                /*GARANTIEN ØKER */     00003260
                 SPT_GARANTI  = 1.6;            /*FRA 1.6 TIL 2  */     00003270
              ELSE                              /*TRUDE,1090     */     00003280
                 SPT_GARANTI  = 2;                                      00003290
                                                                        00003300
  /*TS*/      IF B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9201 &                  00003310
  /*TS*/         B02.VIRK_DATO_ÅM(BER_SØ_IND) > 9100 THEN               00003320
                DO;                                                     00003330
                 IF FNR_R.ÅR     > 24 &                                 00003340
                    FNR_R.ÅR     < 45 THEN         /*GARANTIEN ØKER */  00003350
                    SPT_GARANTI  = 2;            /* TIL 2.5 0192 */     00003360
                 ELSE                                                   00003370
                   IF FNR_R.ÅR  =  23 !                                 00003380
                      FNR_R.ÅR  =  24  THEN                             00003390
                      SPT_GARANTI  = 1.6;                               00003400
                END;                                                    00003410
                                                                        00003420
  /*TS*/      IF B02.VIRK_DATO_ÅM(BER_SØ_IND) > 9200 &                  00003430
  /*TS*/         B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9205 THEN               00003440
                DO;                                                     00003450
                 IF FNR_R.ÅR     > 25 &                                 00003460
                    FNR_R.ÅR     < 45 THEN         /*GARANTIEN ØKER */  00003470
                    SPT_GARANTI  = 2.5;            /* TIL 2.5 0192 */   00003480
                 ELSE                                                   00003490
                   IF FNR_R.ÅR    =  25 THEN                            00003500
                      SPT_GARANTI  = 2;                                 00003510
                   ELSE                                                 00003520
                    IF  FNR_R.ÅR     = 23 !                             00003530
                        FNR_R.ÅR     = 24 THEN                          00003540
                        SPT_GARANTI  = 1.6;                             00003550
                END;     /*TS 1.92 TIL HIT */                           00003560
                                                                        00003570
                                                                        00003580
  /*TS*/      IF B02.VIRK_DATO_ÅM(BER_SØ_IND) > 9204 &                  00003590
  /*HL*/         B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9705 &                  00003600
                 B02.BUP_GAR_KODE(BER_SØ_IND,SISTE_KODE) ^= 'D' THEN    00003610
                DO;                                                     00003620
                 IF FNR_R.ÅR     > 25 &                                 00003630
                    FNR_R.ÅR     < 45 THEN         /*GARANTIEN ØKER */  00003640
                    SPT_GARANTI  = 3.0;            /* TIL 3.0 0192 */   00003650
                 ELSE                                                   00003660
                   IF FNR_R.ÅR    =  25 THEN                            00003670
                      SPT_GARANTI  = 2;                                 00003680
                   ELSE                                                 00003690
                    IF  FNR_R.ÅR     = 23 !                             00003700
                        FNR_R.ÅR     = 24 THEN                          00003710
                        SPT_GARANTI  = 1.6;                             00003720
                END;     /*TS 1.92 TIL HIT */                           00003730
                                                                        00003740
  /* GARANTIEN GÅR OPP TIL 3.3 FRA 9705 FOR FØDTE I 1931-42*/           00003750
                                                                        00003760
              ELSE                                                      00003770
              IF B02.VIRK_DATO_ÅM(BER_SØ_IND) > 9704 &                  00003780
  /*OVERGANG FRA 'E' TIL 'B' 9707 (FØDT 41,42) FANGES OPP I 4901*/      00003790
                 B02.BUP_GAR_KODE(BER_SØ_IND,SISTE_KODE) ^= 'D' THEN    00003800
                DO;                                                     00003810
                 IF FNR_R.ÅR     > 25 &                                 00003820
                    FNR_R.ÅR     < 45 THEN                              00003830
                    IF FNR_R.ÅR  > 30   THEN                            00003840
                       SPT_GARANTI  = 3.3;                              00003850
                    ELSE                                                00003860
                       SPT_GARANTI  = 3.0;                              00003870
                 ELSE                                                   00003880
                   IF FNR_R.ÅR    =  25 THEN                            00003890
                      SPT_GARANTI  = 2;                                 00003900
                   ELSE                                                 00003910
                    IF  FNR_R.ÅR     = 23 !                             00003920
                        FNR_R.ÅR     = 24 THEN                          00003930
                        SPT_GARANTI  = 1.6;                             00003940
                END;     /*TS 1.92 TIL HIT */                           00003950
  /*UF*/         TP_GARANTI  = ( SPT_GARANTI * 0.45 * G );              00003960
  /*UF*/         TP_GARANTI  = TP_GARANTI * B02.TT_ANV(BER_SØ_IND);     00003970
  /*UF*/         TP_GARANTI  = TP_GARANTI / ( 40 * 12) ;                00003980
  /*UF*/         TP_GARANTI  = TP_GARANTI * W_APD / 100;                00003990
  /*UF*/         TP_GARANTI1 = TP_GARANTI + 0.5;                        00004000
  /*UF*/                                                                00004010
  /*UF*/         IF TP_GARANTI1 > B02.ALDERSP.TP(BER_SØ_IND)  THEN      00004020
  /*UF*/            DO;                                                 00004030
  /*UF*/               B02.ALDERSP.TP(BER_SØ_IND)   = TP_GARANTI1;      00004040
  /*UF*/               B02.STATUS.TP_GAR_KODE(BER_SØ_IND)  = 'E';       00004050
  /*UF*/            END;                                                00004060
  /*UF*/    END;                                                        00004070
                                                                        00004080
                                            /*TIL HIT, TRUDE 8.1.90 */  00004090
                                                                        00004100
 SUM_TP = B02.ALDERSP.TP(BER_SØ_IND) + B02.TP_BRUTTO(BER_SØ_IND);       00004110
                                                                        00004120
 IF B02.PENSJONSTYPE2(BER_SØ_IND)  = 'S'   !                            00004130
    (B02.PENSJONSTYPE2(BER_SØ_IND) = 'N'   &                            00004140
     B02.SIVILSTAND   (BER_SØ_IND) = 'G'   &                            00004150
     B02.PENSJONSTYPE2(BER_EK_IND) = 'P')  THEN                         00004160
                                                                        00004170
    B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(                   00004180
                                         SUM_TP,0,'JA',                 00004190
                                         ST_PROSENT_SAMST,              00004200
                                         B02.ALDERSP.APD(BER_SØ_IND),   00004210
                                         B02.TT_ANV(BER_SØ_IND));       00004220
 ELSE                                                                   00004230
                                                                        00004240
 /*ENDRET 2.3.89 HL - DOBBELT ST TIL DEN SOM FORSØRGER EK > 60 */       00004250
                                                                        00004260
                         /*** ET  ***/                                  00004270
 IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'F' THEN                            00004280
                                                                        00004290
       DO;                                                              00004300
                                                    /* FLYTTES OPP  */  00004310
 /*31.5.89 HL       W_FNR_EK = B02.FNR(BER_EK_IND);    I PGM .TRUDE  */ 00004320
                                                                        00004330
       /*DENNE TESTEN VAR GLEMT I DETTE PGM. TRUDE 21.04.93 */          00004340
                                                                        00004350
       /*LOVENDRING OM BEHOVSPRØVET FORSØRGINGSTILLEGG FRA 1.5.91 :*/   00004360
       /* SÅ SNART DET SKAL BEREGNES MED HØYERE GRUNNBELØP ENN     */   00004370
       /* PR 30.4.91, SÅ SKAL ALL BEREGNING SKJE I R0014011        */   00004380
                                                                        00004390
            IF G > 34100 THEN                                           00004400
               DO;                                                      00004410
                  B02.ALDERSP.ET(BER_SØ_IND) = 0;                       00004420
  /*HL*/          IF B02.FT_SKAL_BEREGNES(BER_SØ_IND) ^= 'J'  THEN      00004430
                     B02.FT_SKAL_BEREGNES(BER_SØ_IND) = 'N';            00004440
               END;                                                     00004450
            ELSE                                                        00004460
              B02.ALDERSP.ET(BER_SØ_IND) = 0.5 * G *                    00004470
                            B02.TT_ANV(BER_SØ_IND) *                    00004480
                   B02.ALDERSP.APD(BER_SØ_IND) / (100 * 12 * 40) + 0.5; 00004490
                                                                        00004500
 /*LOVENDRING 1.1.91 HL : */                                            00004510
                                                                        00004520
           IF W_DATO_ÅM > 9100       THEN                               00004530
              SEKSTI = 6001;                                            00004540
           ELSE                                                         00004550
              SEKSTI = 6000;                                            00004560
                                                                        00004570
                    /*REGELENDRING 9401 GLEMT FOR DENNE GRUPPE*/        00004580
                    /*TRUDE, 090594  ST-PROSENT & DATO > 9400 & PT2=F*/ 00004590
                                                                        00004600
           IF F_ALDER(W_FNR_EK,W_DATO_MÅ) >= SEKSTI          &          00004610
              W_DATO_ÅM                   >  8903           THEN        00004620
             DO;                                                        00004630
               IF W_DATO_ÅM  >  9400    THEN                            00004640
                  B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(     00004650
                                         SUM_TP,0,'JA',                 00004660
                                        (ST_PROSENT_ENSLIG * 2),        00004670
                                         B02.ALDERSP.APD(BER_SØ_IND),   00004680
                                         B02.TT_ANV(BER_SØ_IND));       00004690
                ELSE                                                    00004700
                  B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(     00004710
                                         SUM_TP,0,'JA',                 00004720
                                        (ST_PROSENT_SAMST * 2),         00004730
                                         B02.ALDERSP.APD(BER_SØ_IND),   00004740
                                         B02.TT_ANV(BER_SØ_IND));       00004750
             END;                                                       00004760
           ELSE                                                         00004770
                                                                        00004780
              B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(         00004790
                                         SUM_TP,0,'JA',                 00004800
                                         ST_PROSENT_ENSLIG,             00004810
                                         B02.ALDERSP.APD(BER_SØ_IND),   00004820
                                         B02.TT_ANV(BER_SØ_IND));       00004830
       END;                                                             00004840
                                                                        00004850
 ELSE                                                                   00004860
                                                                        00004870
    B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(                   00004880
                                         SUM_TP,0,'JA',                 00004890
                                         ST_PROSENT_ENSLIG,             00004900
                                         B02.ALDERSP.APD(BER_SØ_IND),   00004910
                                         B02.TT_ANV(BER_SØ_IND));       00004920
                                                                        00004930
       /*----------------------------------------------------------*/   00004940
       /* SÆTILLEGG BOSATT UTLAND. MÅ KALL OPP R0014180 .----------*/   00004950
       /*--------------------------------------TRUDE 021090--------*/   00004960
       /*----------------------------------------------------------*/   00004970
                                                                        00004980
     IF B02.BOSATT(BER_SØ_IND) > 0 &                                    00004990
     B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9101  THEN                          00005000
         CALL SÆRTILLEGG_UTLAND(SUM_TP);   /* R0014180 */               00005010
                                                                        00005020
                         /***  BT  ***/                                 00005030
 /* ***************************************************************** */00005040
 /*                                                                   */00005050
 /*  B02.ALDERSP.BT(BER_SØ_IND) =                                     */00005060
 /*     0.25 * G * B02.ANTALL_BARN(BER_SØ_IND) *                      */00005070
 /*     B02.ALDERSP.APD(BER_SØ_IND) / (12 * 100) + 0.5;               */00005080
 /*                                                                   */00005090
 /* FORMELEN OVER ER ERSTATTEN AV NEDEFORLIGGENE CALL PGA             */00005100
 /* NY REGEL FOR BEREGNING AV BARNETILLEGG FRA 1.7.84     OLAV        */00005110
 /* ***************************************************************** */00005120
                                                                        00005130
 CALL BEREGN_BT(W_BT,                                                   00005140
                B02.ALDERSP.APD(BER_SØ_IND));                           00005150
                                                                        00005160
 B02.ALDERSP.BT (BER_SØ_IND) = W_BT;                                    00005170
                                                                        00005180
                                                                        00005190
  /*  DET KAN VÆRE AT APD SKAL VÆRE LIK 0 .              */             00005200
  /*  VI MÅ DA NULLSTILLE BELØPSFELTENE.                 */             00005210
  /*  TRUDE, 1303092.                                    */             00005220
                                                                        00005230
                         /*** KT  ***/                                  00005240
 IF B02.ALDERSP.APD(BER_SØ_IND) = 0 THEN                                00005250
   DO;                                  /* DO-END NYTT,UTENOM      */   00005260
                                        /* KOMPFAKTOR ,TRUDE,130392*/   00005270
    W_KOMPFAKTOR = 0;                                                   00005280
    B02.ALDERSP.GP(BER_SØ_IND)   = 0;                                   00005290
    B02.ALDERSP.TP(BER_SØ_IND)   = 0;                                   00005300
    B02.ALDERSP.ST(BER_SØ_IND)   = 0;                                   00005310
    B02.ALDERSP.BT(BER_SØ_IND)   = 0;                                   00005320
    B02.ALDERSP.ET(BER_SØ_IND)   = 0;                                   00005330
    B02.TP_NETTO(BER_SØ_IND)     = 0;        /*200392 TS*/              00005340
    B02.TP_BRUTTO(BER_SØ_IND)    = 0;        /*200392 TS*/              00005350
    B02.GT_LOV92 (BER_SØ_IND)    = 0;        /*200392 TS*/              00005360
    B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;    /*200392 TS*/              00005370
                                                                        00005380
    IF B02.PENSJONSTYPE2(BER_SØ_IND)  = 'E' THEN                        00005390
       B02.GT_LOV92 (BER_EK_IND)      = 0;        /*200392 TS*/         00005400
  END;                                                                  00005410
 ELSE                                                                   00005420
    IF B02.ALDERSP.APD(BER_SØ_IND) = 25 THEN                            00005430
 /*NYE REGLER FOR KOMP FRA 1.5.91 : */                                  00005440
                                                                        00005450
       IF G > 34100 THEN                                                00005460
          W_KOMPFAKTOR = 1;                                             00005470
       ELSE                                                             00005480
          W_KOMPFAKTOR = 0.5;                                           00005490
    ELSE                                                                00005500
       W_KOMPFAKTOR = 1;                                                00005510
   /*    ENDRET   17.03.88    SATISH                                 */ 00005520
   /*                                                                 */00005530
   /*  B02.ALDERSP.KT(BER_SØ_IND) = F_BEREGN_KOMPENSASJONSTILLEGG     */00005540
   /*                    (B02.PENSJONSTYPE2(BER_SØ_IND),              */00005550
   /*                     B02.TT_ANV(BER_SØ_IND),1,W_KOMPFAKTOR,'J'); */00005560
   /*     HITTIL                                                      */00005570
                                                                        00005580
                                                                        00005590
 IF (B02.PENSJONSTYPE2(BER_SØ_IND) = 'N'   &                            00005600
     B02.SIVILSTAND   (BER_SØ_IND) = 'G'   &                            00005610
     B02.PENSJONSTYPE2(BER_EK_IND) = 'P')  THEN                         00005620
                                                                        00005630
    B02.ALDERSP.KT(BER_SØ_IND) = F_BEREGN_KOMPENSASJONSTILLEGG          00005640
                         (B02.PENSJONSTYPE1(BER_SØ_IND),'S',            00005650
                          B02.TT_ANV(BER_SØ_IND),1,W_KOMPFAKTOR,'J');   00005660
                                                                        00005670
 ELSE                                                                   00005680
    B02.ALDERSP.KT(BER_SØ_IND) = F_BEREGN_KOMPENSASJONSTILLEGG          00005690
                         (B02.PENSJONSTYPE1(BER_SØ_IND),                00005700
                          B02.PENSJONSTYPE2(BER_SØ_IND),                00005710
                          B02.TT_ANV(BER_SØ_IND),1,W_KOMPFAKTOR,'J');   00005720
                                                                        00005730
 IF B02.SPESOPPL.BOSATT(BER_SØ_IND) > 0 THEN                            00005740
    B02.ALDERSP.KT(BER_SØ_IND) = 0 ;                                    00005750
                                                                        00005760
                                                                        00005770
  /*  TESTEN PÅ BOSATT > 0 ER LAGT INN I FORBINDELSE MED */             00005780
  /*  FFU - SAKEN.  UTENLANDSBOENDE SKAL IKKE HA KOMP.   */             00005790
  /*  ERIK 22.12.86.                                     */             00005800
                                                                        00005810
                                                                        00005820
                                                                        00005830
                                                                        00005840
                                                                        00005850
                                                                        00005860
 END JUSTER_MED_APD;                                                    00005870
