 /*       SIST ENDRET 26/08-91 14.44.17 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 24/06-91 11.53.02 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 19/06-91 10.21.25 AV   HERMAN                   */00000020
 /*       SIST ENDRET 14/06-91 09.41.54 AV   DYBVIK                   */00000030
 /******************************************************************* */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /************************                                            */00000060
 /*  PROGRAM-IDENT : R001TK83 - HOVEDPROGRAM.                         */00000070
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000080
 /*  PROGRAMMERER  : TUYEN                                            */00000090
 /*  PROGRAM LAGET : JUNI 91                                          */00000100
 /*          ENDRET: AUG  91 (SKRIV OM PGA MULIGHET FOR SØKING        */00000110
 /*                           BÅDE PÅ NR OG NAVN                      */00000120
 /******************************************************************* */00000130
 /*HENSIKT:                                                           */00000140
 /************                                                        */00000150
 /*  BLANKETTKONTROLL FOR DIV  - MERKELAPPER.                         */00000160
 /******************************************************************* */00000170
 /*PROGRAMTILKNYTTING:                                                */00000180
 /**********************                                              */00000190
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSKODE RT83.          */00000200
 /*                                                                   */00000210
 /******************************************************************* */00000220
 /*DATASETTOPPLYSNINGER:                                              */00000230
 /*************************                                           */00000240
 /*  CMSDIV   (T001/P001.CMSDIV.VSAM)                                 */00000250
 /*  DIVPATH  (T001/P001.CMSDIV.VSAM.PATH)                            */00000260
 /*                                                                   */00000270
 /******************************************************************* */00000280
 /*FEILMELDINGER:                                                     */00000290
 /*********************                                               */00000300
 /*                                                                   */00000310
 /*                                                                   */00000320
 /* ***************************************************************** */00000330
 R01TK83:                                                               00000340
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000350
                                                                        00000360
 %PAGE;                                                                 00000370
      %INCLUDE S001T8;             /* MERKELAP-MAPSETTET   */           00000380
 %PAGE;                                                                 00000390
      %INCLUDE P001TK03;           /* KOM_OMRÅDE (BASED) */             00000400
 %PAGE;                                                                 00000410
      %INCLUDE DFHBMSCA;                                                00000420
 %PAGE;                                                                 00000430
                                                                        00000440
   DCL                                                                  00000450
      (BMSMAPBR,                                                        00000460
      COMMAREA_PEKER) PTR;                                              00000470
   DCL                                                                  00000480
      (CSTG,                                                            00000490
      STG,                                                              00000500
      ADDR,                                                             00000510
      VERIFY,                                                           00000520
      UNSPEC,                                                           00000530
      LOW,                                                              00000540
      NULL,                                                             00000550
      ONCODE,                                                           00000560
      DATE,                                                             00000570
      LENGTH,                                                           00000580
      SUBSTR) BUILTIN;                                                  00000590
                                                                        00000600
 /* HJELPE-VARIABLE */                                                  00000610
 /*-----------------*/                                                  00000620
                                                                        00000630
   DCL                                                                  00000640
      FEIL_FUNNET                 BIT(1)  INIT ('1'B),                  00000650
      FEIL_FT                     BIT(1)  INIT ('0'B),                  00000660
      FEIL_AM                     BIT(1)  INIT ('0'B),                  00000670
      FEIL_RS                     BIT(1)  INIT ('0'B),                  00000680
      FEIL_RP                     BIT(1)  INIT ('0'B),                  00000690
      FEIL_GP                     BIT(1)  INIT ('0'B),                  00000700
      FEIL_30                     BIT(1)  INIT ('0'B),                  00000710
      FEIL_AS                     BIT(1)  INIT ('0'B),                  00000720
      FEIL_LP                     BIT(1)  INIT ('0'B),                  00000730
      FEIL_FRH                    BIT(1)  INIT ('0'B),                  00000740
      FEIL_235                    BIT(1)  INIT ('0'B),                  00000750
      FEIL_RTV                    BIT(1)  INIT ('0'B),                  00000760
      FEIL_PEN                    BIT(1)  INIT ('0'B),                  00000770
      FEIL_1Ø                     BIT(1)  INIT ('0'B),                  00000780
      ONKODE                      PIC'9999',                            00000790
      CURSOR_POS                  FIXED BIN(15) INIT(-1),               00000800
      ONK DEF ONKODE              CHAR(4),                              00000810
      FEIL                        FIXED BIN(15) INIT(0),                00000820
      FEILKODE                    CHAR(4),                              00000830
      ANT_FEIL_SKREVET            FIXED DEC (3),                        00000840
      FATAL_FEIL                  BIT (1) INIT ('0'B),                  00000850
      LES_NR                      PIC'999',                             00000860
      LES_NAVN                    CHAR (49),                            00000870
      LENGDE                      PIC'99',                              00000880
      LES_NR_M_SEQ                PIC'9999',                            00000890
      I                           PIC'9'  INIT (1),                     00000900
      J                           PIC'9'  INIT (1),                     00000910
      K                           PIC'99' INIT (1),                     00000920
      NR_TAB(1:50)                PIC'9999' INIT (0),                   00000930
      MER_INFO                    BIT (1) INIT ('1'B),                  00000940
      TK_FINNES                   BIT (1) INIT ('0'B),                  00000950
      SOK_NR                      BIT (1) INIT ('0'B),                  00000960
      FUNNET_I_FIL                BIT (1) INIT ('0'B),                  00000970
      DSNAVN                      CHAR(8);                              00000980
                                                                        00000990
   DCL HJ_NR          PIC '( 3)9' INIT (0),                             00001000
       HJ_NR_SEQ      PIC '( 1)9' INIT (0),                             00001010
       HJ_FT          CHAR ( 3)   INIT (''),                            00001020
       HJ_AM          CHAR ( 2)   INIT (''),                            00001030
       HJ_RS          CHAR ( 2)   INIT (''),                            00001040
       HJ_RP          CHAR ( 2)   INIT (''),                            00001050
       HJ_GP          CHAR ( 2)   INIT (''),                            00001060
       HJ_30          CHAR ( 2)   INIT (''),                            00001070
       HJ_AS          CHAR ( 2)   INIT (''),                            00001080
       HJ_LP          CHAR ( 2)   INIT (''),                            00001090
       HJ_FRH         CHAR ( 2)   INIT (''),                            00001100
       HJ_235         CHAR ( 2)   INIT (''),                            00001110
       HJ_RTV         CHAR ( 2)   INIT (''),                            00001120
       HJ_PEN         CHAR ( 2)   INIT (''),                            00001130
       HJ_1Ø          CHAR ( 2)   INIT (''),                            00001140
       HJ_FT_PIC      PIC '( 3)9',                                      00001150
       HJ_AM_PIC      PIC '( 2)9',                                      00001160
       HJ_RS_PIC      PIC '( 2)9',                                      00001170
       HJ_RP_PIC      PIC '( 2)9',                                      00001180
       HJ_GP_PIC      PIC '( 2)9',                                      00001190
       HJ_30_PIC      PIC '( 2)9',                                      00001200
       HJ_AS_PIC      PIC '( 2)9',                                      00001210
       HJ_LP_PIC      PIC '( 2)9',                                      00001220
       HJ_FRH_PIC     PIC '( 2)9',                                      00001230
       HJ_235_PIC     PIC '( 2)9',                                      00001240
       HJ_RTV_PIC     PIC '( 2)9',                                      00001250
       HJ_PEN_PIC     PIC '( 2)9',                                      00001260
       HJ_1Ø_PIC      PIC '( 2)9';                                      00001270
                                                                        00001280
   DCL 1 HJ_DIV(1:7),                                                   00001290
         5 NAVN_ADR   CHAR (49);                                        00001300
                                                                        00001310
   DCL 1 FIL_REC,                                                       00001320
         5 NR_M_SEQ     PIC '( 4)9',                                    00001330
         5 NAVN_ADR     CHAR (49),                                      00001340
         5 F1Ø          CHAR ( 2),                                      00001350
         5 RTV          CHAR ( 2),                                      00001360
         5 PEN          CHAR ( 2),                                      00001370
         5 F30          CHAR ( 2),                                      00001380
         5 FT           CHAR ( 3),                                      00001390
         5 RS           CHAR ( 2),                                      00001400
         5 RP           CHAR ( 2),                                      00001410
         5 GP           CHAR ( 2),                                      00001420
         5 AM           CHAR ( 2),                                      00001430
         5 AS           CHAR ( 2),                                      00001440
         5 LP           CHAR ( 2),                                      00001450
         5 FRH          CHAR ( 2),                                      00001460
         5 F235         CHAR ( 2);                                      00001470
                                                                        00001480
   DCL 1 FEIL_STRUC,                                                    00001490
         5 FEIL_NR      FIXED DEC ( 5),                                 00001500
         5 FEIL_MELDING      CHAR (78),                                 00001510
         5 KOM_OMR_PEKER  POINTER;                                      00001520
 %PAGE;                                                                 00001530
                                                                        00001540
 /* SLUTT PÅ DEKLARASJONER */                                           00001550
 /**************************/                                           00001560
                                                                        00001570
 ON ERROR SNAP BEGIN       ;                                            00001580
    ON ERROR SYSTEM        ;                                            00001590
    ONKODE=ONCODE          ;                                            00001600
    FEILKODE = 'FEIL'      ;                                            00001610
    GO TO FEILBEH          ;                                            00001620
 END;                                                                   00001630
                                                                        00001640
 FEILKODE        = 'FEIL'   ;                                           00001650
 PROGRAM_ID      = 'R001TK83';                                          00001660
                                                                        00001670
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00001680
 EXEC CICS IGNORE CONDITION MAPFAIL       ;                             00001690
                                                                        00001700
 FUNKSJONSKODE = ' ';                                                   00001710
 STYREKODE     = ' ';                                                   00001720
                                                                        00001730
 IF SEND_MAP THEN                                                       00001740
    DO;                                                                 00001750
       SEND_MAP = '0'B;                                                 00001760
                                                                        00001770
       ALLOCATE S001005O;                                               00001780
       S001005I.TKNRL = CURSOR_POS;                                     00001790
                                                                        00001800
       EXEC CICS SEND MAP('S001005')                                    00001810
                MAPSET('S001T83') ERASE CURSOR;                         00001820
    END;                                                                00001830
                                                                        00001840
 EXEC CICS RECEIVE MAP('S001005')                                       00001850
        MAPSET('S001T83') SET(BMSMAPBR);                                00001860
                                                                        00001870
 IF S001005I.FUNKSJONSKODEL > 0 THEN                                    00001880
     FUNKSJONSKODE = S001005I.FUNKSJONSKODEI;                           00001890
 ELSE                                                                   00001900
     IF S001005I.STYREKODEL > 0 THEN                                    00001910
          STYREKODE = S001005I.STYREKODEI;                              00001920
                                                                        00001930
 DO WHILE ((FUNKSJONSKODE = ' ') &                                      00001940
           (STYREKODE = ' '));                                          00001950
                                                                        00001960
   K           = 1;                                                     00001970
   NR_TAB      = 0;                                                     00001980
                                                                        00001990
   CALL INITIERING;                                                     00002000
                                                                        00002010
   IF S001005I.TKNRL > 0 THEN                                           00002020
      DO;                                                               00002030
         LES_NR = S001005I.TKNRI;                                       00002040
         SOK_NR = '1'B;                                                 00002050
      END;                                                              00002060
   ELSE                                                                 00002070
      IF S001005I.NAVNL > 0 THEN                                        00002080
         DO;                                                            00002090
            LES_NAVN = S001005I.NAVNI;                                  00002100
                                                                        00002110
            DO LENGDE = 49 TO 1 BY -1                                   00002120
               WHILE (SUBSTR(LES_NAVN,LENGDE,1) = ' ');                 00002130
            END;                                                        00002140
                                                                        00002150
            SOK_NR   = '0'B;                                            00002160
         END;                                                           00002170
      ELSE                                                              00002180
         DO;                                                            00002190
            LES_NR = 0;                                                 00002200
            SOK_NR = '1'B;                                              00002210
         END;                                                           00002220
                                                                        00002230
   ALLOCATE S001004O;                                                   00002240
   S001004I.DIVI(1).NAVN_ADRL = CURSOR_POS;                             00002250
                                                                        00002260
   IF ^SOK_NR THEN                                                      00002270
      DO;                                                               00002280
         EXEC CICS HANDLE CONDITION NOTFND (IKKE_FUNNET_NAVN)           00002290
                                    DUPKEY (DUPLIKAT)                   00002300
                                    ENDFILE (SLUTT_FIL);                00002310
                                                                        00002320
         EXEC CICS STARTBR DATASET ('DIVPATH')                          00002330
                           GENERIC                                      00002340
                           GTEQ                                         00002350
                           RIDFLD (LES_NAVN)                            00002360
                           KEYLENGTH (LENGDE);                          00002370
                                                                        00002380
         EXEC CICS READNEXT DATASET ('DIVPATH')                         00002390
                           INTO (FIL_REC)                               00002400
                           GENERIC                                      00002410
                           GTEQ                                         00002420
                           RIDFLD (LES_NAVN)                            00002430
                           KEYLENGTH (LENGDE);                          00002440
                                                                        00002450
 IKKE_DUPLIKAT:                                                         00002460
                                                                        00002470
         IF SUBSTR(FIL_REC.NR_M_SEQ,4,1) = '1' THEN                     00002480
            DO;                                                         00002490
               LES_NR = SUBSTR(FIL_REC.NR_M_SEQ,1,3);                   00002500
                                                                        00002510
               EXEC CICS ENDBR DATASET ('DIVPATH');                     00002520
                                                                        00002530
               CALL BEHANDLE;                                           00002540
                                                                        00002550
               ALLOCATE S001005O;                                       00002560
               S001005I.TKNRL      = CURSOR_POS;                        00002570
                                                                        00002580
               GOTO MELDING_OPPD;                                       00002590
            END;                                                        00002600
         ELSE                                                           00002610
            GOTO IKKE_FUNNET_NAVN;                                      00002620
                                                                        00002630
 DUPLIKAT:                                                              00002640
         NR_TAB(K) = FIL_REC.NR_M_SEQ;                                  00002650
                                                                        00002660
         K         = K + 1;                                             00002670
                                                                        00002680
         EXEC CICS READNEXT DATASET ('DIVPATH')                         00002690
                            INTO (FIL_REC)                              00002700
                            RIDFLD (LES_NAVN);                          00002710
                                                                        00002720
 SLUTT_DUP:                                                             00002730
                                                                        00002740
         NR_TAB(K) = FIL_REC.NR_M_SEQ;                                  00002750
                                                                        00002760
         EXEC CICS ENDBR DATASET ('DIVPATH');                           00002770
                                                                        00002780
         K = 1;                                                         00002790
                                                                        00002800
         DO WHILE (NR_TAB(K) ^= 0);                                     00002810
            IF SUBSTR(NR_TAB(K),4,1) = 1 THEN                           00002820
               DO;                                                      00002830
                  LES_NR = SUBSTR(NR_TAB(K),1,3);                       00002840
                                                                        00002850
                  CALL BEHANDLE;                                        00002860
                                                                        00002870
                  S001004O.MELDING1O = 'DERSOM DU IKKE VIL SØKE MER';   00002880
                  S001004O.MELDING2O = 'ETTER DETTE NAVNET SKRIV M I';  00002890
                  S001004O.MELDING3O = 'STYREKODE OG TRYKK ENTER';      00002900
                  S001004O.MELDING4O = '';                              00002910
                  S001004O.MELDING5O = 'ELLERS TRYKK BARE ENTER';       00002920
                                                                        00002930
                  S001004I.STYREKODEL= CURSOR_POS;                      00002940
                                                                        00002950
                  EXEC CICS SEND MAP ('S001004') MAPSET ('S001T83')     00002960
                            CURSOR ERASE;                               00002970
                                                                        00002980
                  EXEC CICS RECEIVE MAP ('S001004') MAPSET ('S001T83')  00002990
                            SET (BMSMAPBR);                             00003000
                                                                        00003010
                  CALL SJEKK_UT;                                        00003020
                  CALL INITIERING;                                      00003030
               END;                                                     00003040
                                                                        00003050
            K = K + 1;                                                  00003060
         END;                                                           00003070
                                                                        00003080
         ALLOCATE S001005O;                                             00003090
         S001005I.TKNRL      = CURSOR_POS;                              00003100
                                                                        00003110
         GOTO NY_NR_NAVN;                                               00003120
                                                                        00003130
      END;                                                              00003140
                                                                        00003150
   ELSE                                                                 00003160
      CALL BEHANDLE;                                                    00003170
                                                                        00003180
   ALLOCATE S001005O;                                                   00003190
   S001005I.TKNRL      = CURSOR_POS;                                    00003200
                                                                        00003210
   GOTO MELDING_OPPD;                                                   00003220
                                                                        00003230
 SLUTT_FIL:                                                             00003240
                                                                        00003250
   ALLOCATE S001005O;                                                   00003260
   S001005I.TKNRL      = CURSOR_POS;                                    00003270
                                                                        00003280
   S001005O.MELDING_1O = 'HELE FILEN ER LEST';                          00003290
                                                                        00003300
   GOTO NY_NR_NAVN;                                                     00003310
                                                                        00003320
 IKKE_FUNNET_NAVN:                                                      00003330
                                                                        00003340
   EXEC CICS ENDBR DATASET ('DIVPATH');                                 00003350
                                                                        00003360
   ALLOCATE S001005O;                                                   00003370
   S001005I.TKNRL      = CURSOR_POS;                                    00003380
                                                                        00003390
   S001005O.MELDING_1O = 'DET FINNES INGEN SLIK NAVN:' !! LES_NAVN;     00003400
                                                                        00003410
   GOTO NY_NR_NAVN;                                                     00003420
                                                                        00003430
 MELDING_OPPD:                                                          00003440
                                                                        00003450
   S001005O.MELDING_1O = 'DATA ER BLITT REGISTRERT/OPPDATERT!';         00003460
                                                                        00003470
 NY_NR_NAVN:                                                            00003480
                                                                        00003490
   EXEC CICS SEND MAP('S001005') MAPSET('S001T83')                      00003500
           CURSOR ERASE;                                                00003510
                                                                        00003520
   EXEC CICS RECEIVE MAP('S001005')                                     00003530
           MAPSET('S001T83') SET(BMSMAPBR);                             00003540
                                                                        00003550
   IF S001005I.FUNKSJONSKODEL > 0 THEN                                  00003560
      FUNKSJONSKODE = S001005I.FUNKSJONSKODEI;                          00003570
   ELSE                                                                 00003580
      IF S001005I.STYREKODEL > 0 THEN                                   00003590
         STYREKODE = S001005I.STYREKODEI;                               00003600
                                                                        00003610
 END; /* WHILE */                                                       00003620
                                                                        00003630
                                                                        00003640
 IF FUNKSJONSKODE ^= ' ' THEN                                           00003650
    IF (VERIFY(FUNKSJONSKODE, 'Rr') = 0) THEN                           00003660
      DO;                                                               00003670
         PROGRAM_ID = 'R001TK04';                                       00003680
         TRANSKODE = 'RT04';                                            00003690
      END;                                                              00003700
                                                                        00003710
    ELSE                                                                00003720
      IF (VERIFY(FUNKSJONSKODE, 'Hh') = 0) THEN                         00003730
         DO;                                                            00003740
            TRANSKODE = 'RT08';                                         00003750
            PROGRAM_ID = 'R001TK08';                                    00003760
         END;                                                           00003770
                                                                        00003780
      ELSE                                                              00003790
         IF (VERIFY(FUNKSJONSKODE, 'Ff') = 0) THEN                      00003800
            DO;                                                         00003810
               PROGRAM_ID = 'R001TK09';                                 00003820
               TRANSKODE = 'RT09';                                      00003830
            END;                                                        00003840
                                                                        00003850
         ELSE                                                           00003860
            DO;                                                         00003870
               PROGRAM_ID = 'R001TK03';                                 00003880
               TRANSKODE = 'RT03';                                      00003890
            END;                                                        00003900
                                                                        00003910
 ELSE                                                                   00003920
   IF (VERIFY(STYREKODE, 'Aa') = 0) THEN                                00003930
      DO;                                                               00003940
         IF SUBSTR(FUNKSJON,3,1) = '' THEN                              00003950
            DO;                                                         00003960
                PROGRAM_ID = 'R001TK04';                                00003970
                TRANSKODE = 'RT04';                                     00003980
            END;                                                        00003990
         ELSE                                                           00004000
            DO;                                                         00004010
               PROGRAM_ID = 'R001TK07';                                 00004020
               TRANSKODE = 'RT07';                                      00004030
            END;                                                        00004040
      END;                                                              00004050
                                                                        00004060
   ELSE                                                                 00004070
      IF (VERIFY(STYREKODE, 'Mm') = 0) THEN                             00004080
         DO;                                                            00004090
            PROGRAM_ID = 'R001TK80';                                    00004100
            TRANSKODE = 'RT80';                                         00004110
         END;                                                           00004120
      ELSE                                                              00004130
         DO;                                                            00004140
            PROGRAM_ID = 'R001TK04';                                    00004150
            TRANSKODE = 'RT04';                                         00004160
         END;                                                           00004170
                                                                        00004180
 SEND_MAP      = '1'B;                                                  00004190
 STYREKODE     = ' ';                                                   00004200
 FUNKSJONSKODE = ' ';                                                   00004210
                                                                        00004220
                                                                        00004230
 EXEC CICS XCTL PROGRAM(PROGRAM_ID) COMMAREA(KOM_OMR);                  00004240
                                                                        00004250
 /* INTERNE PROSEDYRER */                                               00004260
 /*--------------------*/                                               00004270
                                                                        00004280
 INITIERING: PROC;                                                      00004290
                                                                        00004300
   FIL_REC   = '';                                                      00004310
                                                                        00004320
   HJ_NR     = 0;                                                       00004330
   HJ_NR_SEQ = 0;                                                       00004340
   HJ_FT     = '';                                                      00004350
   HJ_AM     = '';                                                      00004360
   HJ_RS     = '';                                                      00004370
   HJ_RP     = '';                                                      00004380
   HJ_GP     = '';                                                      00004390
   HJ_30     = '';                                                      00004400
   HJ_AS     = '';                                                      00004410
   HJ_LP     = '';                                                      00004420
   HJ_FRH    = '';                                                      00004430
   HJ_235    = '';                                                      00004440
   HJ_RTV    = '';                                                      00004450
   HJ_PEN    = '';                                                      00004460
   HJ_1Ø     = '';                                                      00004470
   HJ_DIV    = '';                                                      00004480
                                                                        00004490
   HJ_FT_PIC = 0;                                                       00004500
   HJ_AM_PIC = 0;                                                       00004510
   HJ_RS_PIC = 0;                                                       00004520
   HJ_RP_PIC = 0;                                                       00004530
   HJ_GP_PIC = 0;                                                       00004540
   HJ_30_PIC = 0;                                                       00004550
   HJ_AS_PIC = 0;                                                       00004560
   HJ_LP_PIC = 0;                                                       00004570
   HJ_FRH_PIC= 0;                                                       00004580
   HJ_235_PIC= 0;                                                       00004590
   HJ_RTV_PIC= 0;                                                       00004600
   HJ_PEN_PIC= 0;                                                       00004610
   HJ_1Ø_PIC = 0;                                                       00004620
                                                                        00004630
   FEIL_FUNNET = '1'B;                                                  00004640
                                                                        00004650
 END INITIERING;                                                        00004660
                                                                        00004670
                                                                        00004680
 BEHANDLE: PROC;                                                        00004690
                                                                        00004700
   EXEC CICS HANDLE CONDITION NOTFND (IKKE_FUNNET);                     00004710
                                                                        00004720
   S001004O.NRO = LES_NR;                                               00004730
                                                                        00004740
   LES_NR_M_SEQ = LES_NR !! '1';                                        00004750
                                                                        00004760
   EXEC CICS READ DATASET ('CMSDIV')                                    00004770
                  INTO    (FIL_REC)                                     00004780
                  RIDFLD  (LES_NR_M_SEQ);                               00004790
                                                                        00004800
   CALL GI_DATA_TIL_SKJERM_1;                                           00004810
                                                                        00004820
   FUNNET_I_FIL   = '1'B;                                               00004830
                                                                        00004840
   I              = 2;                                                  00004850
   LES_NR_M_SEQ   = LES_NR !! I;                                        00004860
                                                                        00004870
   FIL_REC = '';                                                        00004880
                                                                        00004890
   EXEC CICS HANDLE CONDITION NOTFND (IKKE_FUNNET_2);                   00004900
                                                                        00004910
   EXEC CICS READ DATASET ('CMSDIV')                                    00004920
                  INTO    (FIL_REC)                                     00004930
                  RIDFLD  (LES_NR_M_SEQ);                               00004940
                                                                        00004950
   CALL GI_DATA_TIL_SKJERM_2;                                           00004960
                                                                        00004970
   IKKE_FUNNET_2:                                                       00004980
      MER_INFO = '0'B;                                                  00004990
                                                                        00005000
   I = I - 1;                                                           00005010
                                                                        00005020
   GOTO L100;                                                           00005030
                                                                        00005040
   IKKE_FUNNET:                                                         00005050
                                                                        00005060
      FUNNET_I_FIL   = '0'B;                                            00005070
                                                                        00005080
   L100:                                                                00005090
                                                                        00005100
      EXEC CICS SEND MAP('S001004') MAPSET('S001T83')                   00005110
                CURSOR ERASE;                                           00005120
                                                                        00005130
      EXEC CICS RECEIVE MAP('S001004')                                  00005140
                MAPSET('S001T83') SET(BMSMAPBR);                        00005150
                                                                        00005160
      CALL SJEKK_UT;                                                    00005170
                                                                        00005180
      CALL SJEKK_FEIL;                                                  00005190
                                                                        00005200
      LES_NR_M_SEQ = LES_NR !! '1';                                     00005210
                                                                        00005220
      IF FUNNET_I_FIL THEN                                              00005230
         EXEC CICS READ DATASET ('CMSDIV')                              00005240
                        INTO    (FIL_REC)                               00005250
                        RIDFLD  (LES_NR_M_SEQ)                          00005260
                        UPDATE;                                         00005270
                                                                        00005280
      FIL_REC = '';                                                     00005290
                                                                        00005300
      FIL_REC.NR_M_SEQ = LES_NR !! '1';                                 00005310
                                                                        00005320
      CALL GI_FILRECORD_VERDI;                                          00005330
                                                                        00005340
      CALL SKRIV_FIL;                                                   00005350
                                                                        00005360
 END BEHANDLE;                                                          00005370
                                                                        00005380
                                                                        00005390
 GI_DATA_TIL_SKJERM_1: PROC;                                            00005400
                                                                        00005410
   S001004O.DIVO(1).NAVN_ADRO = FIL_REC.NAVN_ADR;                       00005420
   HJ_DIV(1).NAVN_ADR         = FIL_REC.NAVN_ADR;                       00005430
                                                                        00005440
   S001004O.FTO   = FIL_REC.FT;                                         00005450
   HJ_FT          = FIL_REC.FT;                                         00005460
                                                                        00005470
   S001004O.AMO   = FIL_REC.AM;                                         00005480
   HJ_AM          = FIL_REC.AM;                                         00005490
                                                                        00005500
   S001004O.RSO   = FIL_REC.RS;                                         00005510
   HJ_RS          = FIL_REC.RS;                                         00005520
                                                                        00005530
   S001004O.RPO   = FIL_REC.RP;                                         00005540
   HJ_RP          = FIL_REC.RP;                                         00005550
                                                                        00005560
   S001004O.GPO   = FIL_REC.GP;                                         00005570
   HJ_GP          = FIL_REC.GP;                                         00005580
                                                                        00005590
   S001004O.F30O  = FIL_REC.F30;                                        00005600
   HJ_30          = FIL_REC.F30;                                        00005610
                                                                        00005620
   S001004O.ASO   = FIL_REC.AS;                                         00005630
   HJ_AS          = FIL_REC.AS;                                         00005640
                                                                        00005650
   S001004O.LPO   = FIL_REC.LP;                                         00005660
   HJ_LP          = FIL_REC.LP;                                         00005670
                                                                        00005680
   S001004O.FRHO  = FIL_REC.FRH;                                        00005690
   HJ_FRH         = FIL_REC.FRH;                                        00005700
                                                                        00005710
   S001004O.F235O = FIL_REC.F235;                                       00005720
   HJ_235         = FIL_REC.F235;                                       00005730
                                                                        00005740
   S001004O.RTVO  = FIL_REC.RTV;                                        00005750
   HJ_RTV         = FIL_REC.RTV;                                        00005760
                                                                        00005770
   S001004O.PENO  = FIL_REC.PEN;                                        00005780
   HJ_PEN         = FIL_REC.PEN;                                        00005790
                                                                        00005800
   S001004O.F1ØO  = FIL_REC.F1Ø;                                        00005810
   HJ_1Ø          = FIL_REC.F1Ø;                                        00005820
                                                                        00005830
 END GI_DATA_TIL_SKJERM_1;                                              00005840
                                                                        00005850
                                                                        00005860
 GI_DATA_TIL_SKJERM_2: PROC;                                            00005870
                                                                        00005880
   MER_INFO = '1'B;                                                     00005890
                                                                        00005900
   DO WHILE (MER_INFO);                                                 00005910
      S001004O.DIVO(I).NAVN_ADRO = FIL_REC.NAVN_ADR;                    00005920
      HJ_DIV(I).NAVN_ADR         = FIL_REC.NAVN_ADR;                    00005930
                                                                        00005940
      I = I + 1;                                                        00005950
                                                                        00005960
      FIL_REC = '';                                                     00005970
      LES_NR_M_SEQ   = LES_NR !! I;                                     00005980
                                                                        00005990
      EXEC CICS READ DATASET ('CMSDIV')                                 00006000
                     INTO    (FIL_REC)                                  00006010
                     RIDFLD  (LES_NR_M_SEQ);                            00006020
   END;                                                                 00006030
                                                                        00006040
 END GI_DATA_TIL_SKJERM_2;                                              00006050
                                                                        00006060
                                                                        00006070
 SJEKK_FEIL: PROC;                                                      00006080
                                                                        00006090
      DO WHILE (FEIL_FUNNET);                                           00006100
                                                                        00006110
         J = 1;                                                         00006120
                                                                        00006130
         DO WHILE (J < 8);                                              00006140
            IF S001004I.DIVI(J).NAVN_ADRL > 0 THEN                      00006150
               HJ_DIV(J).NAVN_ADR = S001004I.DIVI(J).NAVN_ADRI;         00006160
                                                                        00006170
            J = J + 1;                                                  00006180
         END;                                                           00006190
                                                                        00006200
         IF S001004I.FTL > 0 THEN                                       00006210
            DO;                                                         00006220
               HJ_FT = S001004I.FTI;                                    00006230
                                                                        00006240
               IF VERIFY(S001004I.FTI,'0123456789 ') ^= 0 THEN          00006250
                  FEIL_FT = '1'B;                                       00006260
               ELSE                                                     00006270
                  FEIL_FT = '0'B;                                       00006280
            END;                                                        00006290
                                                                        00006300
         IF S001004I.AML > 0 THEN                                       00006310
            DO;                                                         00006320
               HJ_AM = S001004I.AMI;                                    00006330
                                                                        00006340
               IF VERIFY(S001004I.AMI,'0123456789 ') ^= 0 THEN          00006350
                  FEIL_AM = '1'B;                                       00006360
               ELSE                                                     00006370
                  FEIL_AM = '0'B;                                       00006380
            END;                                                        00006390
                                                                        00006400
         IF S001004I.RSL > 0 THEN                                       00006410
            DO;                                                         00006420
               HJ_RS = S001004I.RSI;                                    00006430
                                                                        00006440
               IF VERIFY(S001004I.RSI,'0123456789 ') ^= 0 THEN          00006450
                  FEIL_RS = '1'B;                                       00006460
               ELSE                                                     00006470
                  FEIL_RS = '0'B;                                       00006480
            END;                                                        00006490
                                                                        00006500
         IF S001004I.RPL > 0 THEN                                       00006510
            DO;                                                         00006520
               HJ_RP = S001004I.RPI;                                    00006530
                                                                        00006540
               IF VERIFY(S001004I.RPI,'0123456789 ') ^= 0 THEN          00006550
                  FEIL_RP = '1'B;                                       00006560
               ELSE                                                     00006570
                  FEIL_RP = '0'B;                                       00006580
            END;                                                        00006590
                                                                        00006600
         IF S001004I.GPL > 0 THEN                                       00006610
            DO;                                                         00006620
               HJ_GP = S001004I.GPI;                                    00006630
                                                                        00006640
               IF VERIFY(S001004I.GPI,'0123456789 ') ^= 0 THEN          00006650
                  FEIL_GP = '1'B;                                       00006660
               ELSE                                                     00006670
                  FEIL_GP = '0'B;                                       00006680
            END;                                                        00006690
                                                                        00006700
         IF S001004I.F30L > 0 THEN                                      00006710
            DO;                                                         00006720
               HJ_30 = S001004I.F30I;                                   00006730
                                                                        00006740
               IF VERIFY(S001004I.F30I,'0123456789 ') ^= 0 THEN         00006750
                  FEIL_30 = '1'B;                                       00006760
               ELSE                                                     00006770
                  FEIL_30 = '0'B;                                       00006780
            END;                                                        00006790
                                                                        00006800
         IF S001004I.ASL > 0 THEN                                       00006810
            DO;                                                         00006820
               HJ_AS = S001004I.ASI;                                    00006830
                                                                        00006840
               IF VERIFY(S001004I.ASI,'0123456789 ') ^= 0 THEN          00006850
                  FEIL_AS = '1'B;                                       00006860
               ELSE                                                     00006870
                  FEIL_AS = '0'B;                                       00006880
            END;                                                        00006890
                                                                        00006900
         IF S001004I.LPL > 0 THEN                                       00006910
            DO;                                                         00006920
               HJ_LP = S001004I.LPI;                                    00006930
                                                                        00006940
               IF VERIFY(S001004I.LPI,'0123456789 ') ^= 0 THEN          00006950
                  FEIL_LP = '1'B;                                       00006960
               ELSE                                                     00006970
                  FEIL_LP = '0'B;                                       00006980
             END;                                                       00006990
                                                                        00007000
         IF S001004I.FRHL > 0 THEN                                      00007010
            DO;                                                         00007020
               HJ_FRH = S001004I.FRHI;                                  00007030
                                                                        00007040
               IF VERIFY(S001004I.FRHI,'0123456789 ') ^= 0 THEN         00007050
                  FEIL_FRH = '1'B;                                      00007060
               ELSE                                                     00007070
                  FEIL_FRH = '0'B;                                      00007080
            END;                                                        00007090
                                                                        00007100
         IF S001004I.F235L > 0 THEN                                     00007110
            DO;                                                         00007120
               HJ_235 = S001004I.F235I;                                 00007130
                                                                        00007140
               IF VERIFY(S001004I.F235I,'0123456789 ') ^= 0 THEN        00007150
                  FEIL_235 = '1'B;                                      00007160
               ELSE                                                     00007170
                  FEIL_235 = '0'B;                                      00007180
            END;                                                        00007190
                                                                        00007200
         IF S001004I.RTVL > 0 THEN                                      00007210
            DO;                                                         00007220
               HJ_RTV = S001004I.RTVI;                                  00007230
                                                                        00007240
               IF VERIFY(S001004I.RTVI,'0123456789 ') ^= 0 THEN         00007250
                  FEIL_RTV = '1'B;                                      00007260
               ELSE                                                     00007270
                  FEIL_RTV = '0'B;                                      00007280
            END;                                                        00007290
                                                                        00007300
         IF S001004I.PENL > 0 THEN                                      00007310
            DO;                                                         00007320
               HJ_PEN = S001004I.PENI;                                  00007330
                                                                        00007340
               IF VERIFY(S001004I.PENI,'0123456789 ') ^= 0 THEN         00007350
                  FEIL_PEN = '1'B;                                      00007360
               ELSE                                                     00007370
                  FEIL_PEN = '0'B;                                      00007380
            END;                                                        00007390
                                                                        00007400
         IF S001004I.F1ØL > 0 THEN                                      00007410
            DO;                                                         00007420
               HJ_1Ø = S001004I.F1ØI;                                   00007430
                                                                        00007440
               IF VERIFY(S001004I.F1ØI,'0123456789 ') ^= 0 THEN         00007450
                  FEIL_1Ø = '1'B;                                       00007460
               ELSE                                                     00007470
                  FEIL_1Ø = '0'B;                                       00007480
            END;                                                        00007490
                                                                        00007500
         IF FEIL_FT  ! FEIL_AM   ! FEIL_RS  ! FEIL_RP  !                00007510
            FEIL_GP  ! FEIL_30   ! FEIL_AS  ! FEIL_LP  !                00007520
            FEIL_FRH ! FEIL_235  ! FEIL_RTV ! FEIL_PEN ! FEIL_1Ø THEN   00007530
            DO;                                                         00007540
               FEIL_FUNNET = '1'B;                                      00007550
               S001004O.MELDING1O = 'DET MÅ VÆRE NUMMERISK VERDI HER!'; 00007560
            END;                                                        00007570
                                                                        00007580
         ELSE                                                           00007590
            FEIL_FUNNET = '0'B;                                         00007600
                                                                        00007610
         IF FEIL_FT THEN                                                00007620
            S001004I.FTL = CURSOR_POS;                                  00007630
                                                                        00007640
         IF FEIL_AM THEN                                                00007650
            S001004I.AML = CURSOR_POS;                                  00007660
                                                                        00007670
         IF FEIL_RS THEN                                                00007680
            S001004I.RSL = CURSOR_POS;                                  00007690
                                                                        00007700
         IF FEIL_RP THEN                                                00007710
            S001004I.RPL = CURSOR_POS;                                  00007720
                                                                        00007730
         IF FEIL_GP THEN                                                00007740
            S001004I.GPL = CURSOR_POS;                                  00007750
                                                                        00007760
         IF FEIL_30 THEN                                                00007770
            S001004I.F30L = CURSOR_POS;                                 00007780
                                                                        00007790
         IF FEIL_AS THEN                                                00007800
            S001004I.ASL = CURSOR_POS;                                  00007810
                                                                        00007820
         IF FEIL_LP THEN                                                00007830
            S001004I.LPL = CURSOR_POS;                                  00007840
                                                                        00007850
         IF FEIL_FRH THEN                                               00007860
            S001004I.FRHL = CURSOR_POS;                                 00007870
                                                                        00007880
         IF FEIL_235 THEN                                               00007890
            S001004I.F235L = CURSOR_POS;                                00007900
                                                                        00007910
         IF FEIL_RTV THEN                                               00007920
            S001004I.RTVL = CURSOR_POS;                                 00007930
                                                                        00007940
         IF FEIL_PEN THEN                                               00007950
            S001004I.PENL = CURSOR_POS;                                 00007960
                                                                        00007970
         IF FEIL_1Ø THEN                                                00007980
            S001004I.F1ØL = CURSOR_POS;                                 00007990
                                                                        00008000
         IF FEIL_FUNNET THEN                                            00008010
            DO;                                                         00008020
               S001004O.NRO   = HJ_NR;                                  00008030
               J = 1;                                                   00008040
                                                                        00008050
               DO WHILE (J < 8);                                        00008060
                  S001004O.DIVO(J).NAVN_ADRO = HJ_DIV(J).NAVN_ADR;      00008070
                                                                        00008080
                  J = J + 1;                                            00008090
               END;                                                     00008100
                                                                        00008110
               S001004O.FTO   = HJ_FT;                                  00008120
               S001004O.AMO   = HJ_AM;                                  00008130
               S001004O.RSO   = HJ_RS;                                  00008140
               S001004O.RPO   = HJ_RP;                                  00008150
               S001004O.GPO   = HJ_GP;                                  00008160
               S001004O.F30O  = HJ_30;                                  00008170
               S001004O.ASO   = HJ_AS;                                  00008180
               S001004O.LPO   = HJ_LP;                                  00008190
               S001004O.FRHO  = HJ_FRH;                                 00008200
               S001004O.F235O = HJ_235;                                 00008210
               S001004O.RTVO  = HJ_RTV;                                 00008220
               S001004O.PENO  = HJ_PEN;                                 00008230
               S001004O.F1ØO  = HJ_1Ø;                                  00008240
                                                                        00008250
               EXEC CICS SEND MAP('S001004') MAPSET('S001T83')          00008260
                         CURSOR ERASE;                                  00008270
                                                                        00008280
               EXEC CICS RECEIVE MAP('S001004')                         00008290
                         MAPSET('S001T83') SET(BMSMAPBR);               00008300
                                                                        00008310
               CALL SJEKK_UT;                                           00008320
            END;                                                        00008330
                                                                        00008340
      END;                                                              00008350
                                                                        00008360
 END SJEKK_FEIL;                                                        00008370
                                                                        00008380
                                                                        00008390
 GI_FILRECORD_VERDI: PROC;                                              00008400
                                                                        00008410
      FIL_REC.NAVN_ADR = HJ_DIV(1).NAVN_ADR;                            00008420
                                                                        00008430
      IF HJ_FT ^= '' THEN                                               00008440
         HJ_FT_PIC = HJ_FT;                                             00008450
                                                                        00008460
      IF HJ_AM ^= '' THEN                                               00008470
         HJ_AM_PIC = HJ_AM;                                             00008480
                                                                        00008490
      IF HJ_RS ^= '' THEN                                               00008500
         HJ_RS_PIC = HJ_RS;                                             00008510
                                                                        00008520
      IF HJ_RP ^= '' THEN                                               00008530
         HJ_RP_PIC = HJ_RP;                                             00008540
                                                                        00008550
      IF HJ_GP ^= '' THEN                                               00008560
         HJ_GP_PIC = HJ_GP;                                             00008570
                                                                        00008580
      IF HJ_30 ^= '' THEN                                               00008590
         HJ_30_PIC = HJ_30;                                             00008600
                                                                        00008610
      IF HJ_AS ^= '' THEN                                               00008620
         HJ_AS_PIC = HJ_AS;                                             00008630
                                                                        00008640
      IF HJ_LP ^= '' THEN                                               00008650
         HJ_LP_PIC = HJ_LP;                                             00008660
                                                                        00008670
      IF HJ_FRH ^= '' THEN                                              00008680
         HJ_FRH_PIC = HJ_FRH;                                           00008690
                                                                        00008700
      IF HJ_235 ^= '' THEN                                              00008710
         HJ_235_PIC = HJ_235;                                           00008720
                                                                        00008730
      IF HJ_RTV ^= '' THEN                                              00008740
         HJ_RTV_PIC = HJ_RTV;                                           00008750
                                                                        00008760
      IF HJ_PEN ^= '' THEN                                              00008770
         HJ_PEN_PIC = HJ_PEN;                                           00008780
                                                                        00008790
      IF HJ_1Ø ^= '' THEN                                               00008800
         HJ_1Ø_PIC = HJ_1Ø;                                             00008810
                                                                        00008820
      IF HJ_FT ^= '' THEN                                               00008830
         FIL_REC.FT = HJ_FT_PIC;                                        00008840
      ELSE                                                              00008850
         FIL_REC.FT = HJ_FT;                                            00008860
                                                                        00008870
      IF HJ_AM ^= '' THEN                                               00008880
         FIL_REC.AM = HJ_AM_PIC;                                        00008890
      ELSE                                                              00008900
         FIL_REC.AM = HJ_AM;                                            00008910
                                                                        00008920
      IF HJ_RS ^= '' THEN                                               00008930
         FIL_REC.RS = HJ_RS_PIC;                                        00008940
      ELSE                                                              00008950
         FIL_REC.RS = HJ_RS;                                            00008960
                                                                        00008970
      IF HJ_RP ^= '' THEN                                               00008980
         FIL_REC.RP = HJ_RP_PIC;                                        00008990
      ELSE                                                              00009000
         FIL_REC.RP = HJ_RP;                                            00009010
                                                                        00009020
      IF HJ_GP ^= '' THEN                                               00009030
         FIL_REC.GP = HJ_GP_PIC;                                        00009040
      ELSE                                                              00009050
         FIL_REC.GP = HJ_GP;                                            00009060
                                                                        00009070
      IF HJ_30 ^= '' THEN                                               00009080
         FIL_REC.F30 = HJ_30_PIC;                                       00009090
      ELSE                                                              00009100
         FIL_REC.F30 = HJ_30;                                           00009110
                                                                        00009120
      IF HJ_AS ^= '' THEN                                               00009130
         FIL_REC.AS = HJ_AS_PIC;                                        00009140
      ELSE                                                              00009150
         FIL_REC.AS = HJ_AS;                                            00009160
                                                                        00009170
      IF HJ_LP ^= '' THEN                                               00009180
         FIL_REC.LP = HJ_LP_PIC;                                        00009190
      ELSE                                                              00009200
         FIL_REC.LP = HJ_LP;                                            00009210
                                                                        00009220
      IF HJ_FRH ^= '' THEN                                              00009230
         FIL_REC.FRH = HJ_FRH_PIC;                                      00009240
      ELSE                                                              00009250
         FIL_REC.FRH = HJ_FRH;                                          00009260
                                                                        00009270
      IF HJ_235 ^= '' THEN                                              00009280
         FIL_REC.F235 = HJ_235_PIC;                                     00009290
      ELSE                                                              00009300
         FIL_REC.F235 = HJ_235;                                         00009310
                                                                        00009320
      IF HJ_RTV ^= '' THEN                                              00009330
         FIL_REC.RTV = HJ_RTV_PIC;                                      00009340
      ELSE                                                              00009350
         FIL_REC.RTV = HJ_RTV;                                          00009360
                                                                        00009370
      IF HJ_PEN ^= '' THEN                                              00009380
         FIL_REC.PEN = HJ_PEN_PIC;                                      00009390
      ELSE                                                              00009400
         FIL_REC.PEN = HJ_PEN;                                          00009410
                                                                        00009420
      IF HJ_1Ø ^= '' THEN                                               00009430
         FIL_REC.F1Ø = HJ_1Ø_PIC;                                       00009440
      ELSE                                                              00009450
         FIL_REC.F1Ø = HJ_1Ø;                                           00009460
                                                                        00009470
 END GI_FILRECORD_VERDI;                                                00009480
                                                                        00009490
                                                                        00009500
 SKRIV_FIL: PROC;                                                       00009510
                                                                        00009520
      IF FUNNET_I_FIL THEN                                              00009530
         EXEC CICS REWRITE DATASET ('CMSDIV')                           00009540
                           FROM    (FIL_REC);                           00009550
      ELSE                                                              00009560
         EXEC CICS WRITE DATASET ('CMSDIV')                             00009570
                         FROM    (FIL_REC)                              00009580
                         RIDFLD  (LES_NR_M_SEQ);                        00009590
                                                                        00009600
      J = 2;                                                            00009610
                                                                        00009620
      DO WHILE (J <= I);                                                00009630
         LES_NR_M_SEQ     = LES_NR !! J;                                00009640
                                                                        00009650
         EXEC CICS READ DATASET ('CMSDIV')                              00009660
                        INTO    (FIL_REC)                               00009670
                        RIDFLD  (LES_NR_M_SEQ)                          00009680
                        UPDATE;                                         00009690
                                                                        00009700
         FIL_REC          = '';                                         00009710
         FIL_REC.NR_M_SEQ = LES_NR !! J;                                00009720
                                                                        00009730
         FIL_REC.NAVN_ADR = HJ_DIV(J).NAVN_ADR;                         00009740
                                                                        00009750
         EXEC CICS REWRITE DATASET ('CMSDIV')                           00009760
                           FROM    (FIL_REC);                           00009770
                                                                        00009780
         J = J + 1;                                                     00009790
      END;                                                              00009800
                                                                        00009810
      I = I + 1;                                                        00009820
                                                                        00009830
      DO WHILE (I < 8);                                                 00009840
         FIL_REC = '';                                                  00009850
                                                                        00009860
         FIL_REC.NR_M_SEQ = LES_NR !! I;                                00009870
         LES_NR_M_SEQ     = LES_NR !! I;                                00009880
                                                                        00009890
         IF HJ_DIV(I).NAVN_ADR ^= '' THEN                               00009900
            DO;                                                         00009910
               FIL_REC.NAVN_ADR = HJ_DIV(I).NAVN_ADR;                   00009920
                                                                        00009930
               EXEC CICS WRITE DATASET ('CMSDIV')                       00009940
                               FROM    (FIL_REC)                        00009950
                               RIDFLD  (LES_NR_M_SEQ);                  00009960
            END;                                                        00009970
                                                                        00009980
         I = I + 1;                                                     00009990
      END;                                                              00010000
                                                                        00010010
 END SKRIV_FIL;                                                         00010020
                                                                        00010030
                                                                        00010040
 SJEKK_UT: PROC;                                                        00010050
                                                                        00010060
    IF S001004I.FUNKSJONSKODEL > 0 THEN                                 00010070
       FUNKSJONSKODE = S001004I.FUNKSJONSKODEI;                         00010080
    ELSE                                                                00010090
       IF S001004I.STYREKODEL > 0 THEN                                  00010100
          STYREKODE = S001004I.STYREKODEI;                              00010110
                                                                        00010120
    IF FUNKSJONSKODE ^= ' ' THEN                                        00010130
       DO;                                                              00010140
          IF (VERIFY(FUNKSJONSKODE, 'Rr') = 0) THEN                     00010150
            DO;                                                         00010160
               PROGRAM_ID = 'R001TK04';                                 00010170
               TRANSKODE = 'RT04';                                      00010180
            END;                                                        00010190
                                                                        00010200
          ELSE                                                          00010210
            IF (VERIFY(FUNKSJONSKODE, 'Hh') = 0) THEN                   00010220
               DO;                                                      00010230
                  TRANSKODE = 'RT08';                                   00010240
                  PROGRAM_ID = 'R001TK08';                              00010250
               END;                                                     00010260
                                                                        00010270
            ELSE                                                        00010280
               IF (VERIFY(FUNKSJONSKODE, 'Ff') = 0) THEN                00010290
                  DO;                                                   00010300
                     PROGRAM_ID = 'R001TK09';                           00010310
                     TRANSKODE = 'RT09';                                00010320
                  END;                                                  00010330
                                                                        00010340
               ELSE                                                     00010350
                  DO;                                                   00010360
                     PROGRAM_ID = 'R001TK03';                           00010370
                     TRANSKODE = 'RT03';                                00010380
                  END;                                                  00010390
                                                                        00010400
          SEND_MAP      = '1'B;                                         00010410
          STYREKODE     = ' ';                                          00010420
          FUNKSJONSKODE = ' ';                                          00010430
                                                                        00010440
                                                                        00010450
          EXEC CICS XCTL PROGRAM(PROGRAM_ID)                            00010460
               COMMAREA(KOM_OMR);                                       00010470
       END;                                                             00010480
                                                                        00010490
    ELSE                                                                00010500
      IF STYREKODE ^= ' ' THEN                                          00010510
         DO;                                                            00010520
             IF (VERIFY(STYREKODE, 'Aa') = 0) THEN                      00010530
                DO;                                                     00010540
                   IF SUBSTR(FUNKSJON,3,1) = '' THEN                    00010550
                      DO;                                               00010560
                          PROGRAM_ID = 'R001TK04';                      00010570
                          TRANSKODE = 'RT04';                           00010580
                      END;                                              00010590
                   ELSE                                                 00010600
                      DO;                                               00010610
                         PROGRAM_ID = 'R001TK07';                       00010620
                         TRANSKODE = 'RT07';                            00010630
                      END;                                              00010640
                END;                                                    00010650
                                                                        00010660
             ELSE                                                       00010670
                IF (VERIFY(STYREKODE, 'Mm') = 0) THEN                   00010680
                   DO;                                                  00010690
                      PROGRAM_ID = 'R001TK80';                          00010700
                      TRANSKODE = 'RT80';                               00010710
                   END;                                                 00010720
                ELSE                                                    00010730
                   DO;                                                  00010740
                      PROGRAM_ID = 'R001TK04';                          00010750
                      TRANSKODE = 'RT04';                               00010760
                   END;                                                 00010770
                                                                        00010780
            SEND_MAP      = '1'B;                                       00010790
            STYREKODE     = ' ';                                        00010800
            FUNKSJONSKODE = ' ';                                        00010810
                                                                        00010820
            EXEC CICS XCTL PROGRAM(PROGRAM_ID)                          00010830
                   COMMAREA(KOM_OMR);                                   00010840
         END;                                                           00010850
 END SJEKK_UT;                                                          00010860
                                                                        00010870
                                                                        00010880
                                                                        00010890
                                                                        00010900
  FEILBEH:                                                              00010910
                                                                        00010920
     S001004O.MELDING1O =                                               00010930
                                                                        00010940
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00010950
                                                                        00010960
     S001004O.MELDING2O =                                               00010970
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00010980
                                                                        00010990
     S001004O.MELDING3O =                                               00011000
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00011010
                                         !! '. DATASETT : ' !! DSNAVN;  00011020
                                                                        00011030
     S001004O.MELDING4O =                                               00011040
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00011050
                                                                        00011060
     EXEC CICS SEND MAP('S001004') MAPSET('S001T83') ERASE;             00011070
                                                                        00011080
     EXEC CICS RECEIVE MAP('S001004')                                   00011090
                       MAPSET('S001T83') SET(BMSMAPBR);                 00011100
                                                                        00011110
                                                                        00011120
     EXEC CICS SYNCPOINT ROLLBACK;                                      00011130
                                                                        00011140
     EXEC CICS RETURN;                                                  00011150
                                                                        00011160
                                                                        00011170
 END R01TK83;                                                           00011180
