 /*       SIST ENDRET 06/04-94 14.53.38 AV   DYBVIK                   */00000000
 /* ***************************************************************** */00000010
 /*               R001IA01                                        */    00000020
 /* ***************************************************************** */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /* **********************                                            */00000050
 /*  PROGRAM-IDENT : R001IA01 - KONTROLL OMSORGSPOENG  OO - HOVEDPROG */00000060
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000070
 /*  PROGRAMMERER  : ?                                                */00000080
 /*  PROGRAMMET BLE LAGET  ?                                          */00000090
 /*                                                                   */00000100
 /* ***************************************************************** */00000110
 /*HENSIKT:                                                           */00000120
 /* **********                                                        */00000130
 /*  PROGRAMMET KONTROLLERER OMSORGSPOENG                             */00000140
 /*  TIL R001IA01.                                                    */00000150
 /* ***************************************************************** */00000160
 /*PROGRAMTILKNYTTING:                                                */00000170
 /* ********************                                              */00000180
 /*  PROGRAMMETS TRANSKODER ER RIA0, RIA1, RIA2, RIA3,RIA4 OG RIA5.   */00000190
 /*  PROGRAMMET KALLES FRA R001I101 - REGISTRERING MED TRANSKODE      */00000200
 /*  RIA0:                                                            */00000210
 /*    EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);         */00000220
 /*  PROGRAMMET HAR EXEC CICS XCTL TIL:                               */00000230
 /*    R0010301 - VALG AV FUNKSJON                                    */00000240
 /*    R001I101 - REGISTRERING                                        */00000250
 /*  PROGRAMMET BRUKER FØLGENDE MAPSET:                               */00000260
 /*      MAP - S001IA01- REGISTRERINGSBILDE OMSORGSPOENG              */00000270
 /*                                                                   */00000280
 /* ***************************************************************** */00000290
 /*DATASETTOPPLYSNINGER:                                              */00000300
 /* ***********************                                           */00000310
 /*  FØDSELSNUMMERENDRINGSREGISERET BLIR LEST I SUBPROGRAM R001IA03   */00000320
 /*  VED CALL TIL R0019906.                                           */00000330
 /* ***************************************************************** */00000340
 /* ***************************************************************** */00000350
  R001IA:                                                               00000360
    PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                 00000370
  %PAGE;                                                                00000380
  %INCLUDE S001IA;    /*  OMSORGSPOENG   */                             00000390
  %PAGE;                                                                00000400
  %INCLUDE P001IA01;  /*  BLANKET-OMR                    */             00000410
  %PAGE;                                                                00000420
  %INCLUDE P0019906;  /*                                 */             00000430
  %PAGE;                                                                00000440
  %INCLUDE P0019908;  /*  TRANS_OMRÅDE (BASED)           */             00000450
  %PAGE;                                                                00000460
  %INCLUDE P0019910;  /*  STYRINGS_OMRÅDE (BASED)           */          00000470
  %PAGE;                                                                00000480
  %INCLUDE P0019912;  /*  DIV-PARAM_OMRÅDE (BASED)          */          00000490
  %PAGE;                                                                00000500
                                                                        00000510
   DCL 01 ROOT,                                                         00000520
  %INCLUDE P0019927;  /*  RF0PERSN                          */          00000530
                                                                        00000540
   DCL 01 PI_SEGM,                                                      00000550
    /* -------------------------------------------------------------- */00000560
    /*   INNTEKTS-SEGMENTET                                           */00000570
    /* -------------------------------------------------------------- */00000580
                                                                        00000590
          4   ÅR          FIXED    DEC   (3) ,                          00000600
          4   KODE                           ,                          00000610
              5  TYPE             CHAR  (1) ,                           00000620
              5  MERKE            PIC   '9' ,                           00000630
          4   PI             FIXED    DEC   (7) ,                       00000640
          4   PI_KOMMNR      FIXED    DEC   (5) ,                       00000650
          4   PI_RAPPDATO    FIXED    DEC   (5) ;                       00000660
                                                                        00000670
    /* ************************************************************** */00000680
    /*                                                                */00000690
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00000700
    /*                                                                */00000710
    /* ************************************************************** */00000720
                                                                        00000730
       DCL 1  W01_DLI_PARAM,                                            00000740
              2   W02_GU                  CHAR (4)   INIT ('GU  '),     00000750
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),     00000760
              2   W02_GHNP                CHAR (4)   INIT ('GHNP'),     00000770
              2   W02_GHU                 CHAR (4)   INIT ('GHU '),     00000780
              2   W02_REPL                CHAR (4)   INIT ('REPL'),     00000790
              2   W02_DLET                CHAR (4)   INIT ('DLET'),     00000800
              2   W02_ISRT                CHAR (4)   INIT ('ISRT'),     00000810
              2   W02_PARM_CT_1     FIXED BIN  (31)  INIT (1),          00000820
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00000830
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00000840
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),          00000850
              2   W02_PERSONEN_ER_SPERRET BIT  (1)   INIT ('1'B),       00000860
              2   W02_MER_DATA            BIT  (1)   INIT ('1'B),       00000870
              2   W02_SS_ER_DØD           BIT  (1)   INIT ('0'B),       00000880
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');  00000890
                                                                        00000900
       DCL    W01_IO                 CHAR (265)      INIT ( '' );       00000910
       DCL    W01_HJELPE_IO          CHAR (265) BASED (W01_HJELPE_PTR); 00000920
                                                                        00000930
                                                                        00000940
    /* ************************************************************** */00000950
    /*                                                                */00000960
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00000970
    /*                                                                */00000980
    /* ************************************************************** */00000990
                                                                        00001000
       DCL    SSA_UQUAL                          CHAR (9) INIT ((9)' ');00001010
                                                                        00001020
       DCL 1  SSA1_RF0PERSN                ,                            00001030
              2    HDEL                          CHAR (17)  INIT        00001040
                   ('RF0PERSN(FNR     '),                               00001050
              2    REL_OP                        CHAR (2)   INIT (' ='),00001060
              2    PKEY               FIXED      DEC  (11)  INIT ( 0  ),00001070
              2    HP                            CHAR (1)   INIT (')' );00001080
                                                                        00001090
                                                                        00001100
       DCL 1  SSA1_PINNTEKT          UNALIGNED,                         00001110
              2    HDEL                       CHAR (17)  INIT           00001120
                   ('PINNTEKT(INNTÅRTY'),                               00001130
              2    REL_OP                     CHAR (2)   INIT (' ='),   00001140
              2    ÅR                 FIXED   DEC  (2),                 00001150
              2    TYPE                       CHAR (1),                 00001160
              2    HP                         CHAR (1)   INIT (')');    00001170
                                                                        00001180
                                                                        00001190
    /* ************************************************************** */00001200
    /*                                                                */00001210
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00001220
    /*                                                                */00001230
    /* ************************************************************** */00001240
                                                                        00001250
    %PAGE;                                                              00001260
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00001270
                                                                        00001280
    %PAGE;                                                              00001290
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                   00001300
    %INCLUDE P0012003;                         /* PCB                 */00001310
                                                                        00001320
    DCL  W01_PSB_NAVN             CHAR (8)  INIT ('B001R001');          00001330
                                                                        00001340
  %PAGE;                                                                00001350
    DCL PLITDLI ENTRY;                                                  00001360
                                                                        00001370
  %INCLUDE DFHBMSCA;                                                    00001380
  %INCLUDE DLIUIB  ;                                                    00001390
  %PAGE;                                                                00001400
    DCL                                                                 00001410
       (BMSMAPBR, COMMAREA_PEKER, P_RBA) PTR;                           00001420
                                                                        00001430
                                                                        00001440
    DCL   UIB_RC_OK        BIT (8)    INIT (0);                         00001450
                                                                        00001460
    DCL PLIXOPT CHAR(13) VAR STATIC EXTERNAL INIT(                      00001470
                                                'NOSPIE NOSTAE');       00001480
    DCL                                                                 00001490
       (ADDR,UNSPEC,CSTG,ONCODE,VERIFY,SUBSTR, DATE) BUILTIN;           00001500
    DCL 01 UT,                                                          00001510
          02 FRA_FNR           PIC '(11)9',                             00001520
          02 TIL_FNR           PIC '(11)9',                             00001530
          02 START_ÅR          PIC '(02)9',                             00001540
          02 BARN_ANTTAL       PIC '(02)9',                             00001550
          02 TAB(12),                                                   00001560
           03  FNR_BARN        PIC '(11)9';                             00001570
    DCL                                                                 00001580
       FEIL_FUNNET     BIT (1),                                         00001590
       FEIL_I_SØKER    BIT (1),                                         00001600
       FEIL_I_BARN     BIT (1),                                         00001610
       FEIL_I_SPES     BIT (1),                                         00001620
       MER_DATA        BIT (1),                                         00001630
       FEIL_KODE       BIT (1),                                         00001640
       ONKODE PIC'9999',                                                00001650
       CURSOR_POS FIXED BIN(15) INIT(-1),                               00001660
       ONK DEF ONKODE CHAR(4),                                          00001670
       FEILKODE       CHAR(4),                                          00001680
       SKRIV_KODE     CHAR(1),                                          00001690
       RF1_KODE       CHAR(1),                                          00001700
       DSNAVN         CHAR(8),                                          00001710
       ANT_FEIL_SKREVET FIXED DEC (3);                                  00001720
  %PAGE;                                                                00001730
     /*ON ERROR SNAP BEGIN;                                             00001740
          ON ERROR SYSTEM        ;                                      00001750
          ONKODE=ONCODE          ;                                      00001760
          FEILKODE  = ONK        ;                                      00001770
          DSNAVN     = EIBDS     ;                                      00001780
          GO TO FEILBEH          ;                                      00001790
       END;*/                                                           00001800
                                                                        00001810
 FEILKODE  = 'FEIL';                                                    00001820
 DSNAVN     = '        ';                                               00001830
                                                                        00001840
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00001850
                                                                        00001860
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00001870
                                                                        00001880
 IF FRA_CICS THEN                                                       00001890
  DO;                                                                   00001900
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);00001910
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);     00001920
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);  00001930
  END;                                                                  00001940
                                                                        00001950
                                                                        00001960
 IF HENT_FRAM_MAP  THEN                                                 00001970
   DO;                                                                  00001980
     /* SKJERMBILDE GRUNNBLANKETT-OO */                                 00001990
     EXEC CICS SEND MAP('S001IA1') MAPSET('S001IA3') MAPONLY            00002000
                                                         SET (BMSMAPBR);00002010
     ALLOCATE S001IA1O;                                                 00002020
     S001IA1O.CICS_INFOO = CICS_NAVN;                                   00002030
     TRANSKODE = 'RIA0';                                                00002040
   END;                                                                 00002050
                                                                        00002060
 RECEIVE_MAP:                                                           00002070
                                                                        00002080
 IF ^HENT_FRAM_MAP THEN                                                 00002090
    DO;                                                                 00002100
       EXEC CICS RECEIVE MAP('S001IA1')                                 00002110
                                    MAPSET('S001IA3') SET(BMSMAPBR);    00002120
       CALL BLANK_OO_MELDNR;                                            00002130
       FEIL_MELD_NR = 0;                                                00002140
    END;                                                                00002150
                                                                        00002160
 IF S001IA1I.FUNKSJONSKODEL > 0 THEN                                    00002170
    DO;                                                                 00002180
       FUNKSJONSKODE = S001IA1I.FUNKSJONSKODEI;                         00002190
                                                                        00002200
             /* KONTROLLEN TILBAKE TIL R001030 - VALG AV FUNKSJON */    00002210
        EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);           00002220
   END;                                                                 00002230
                                                                        00002240
                                                                        00002250
                                                                        00002260
 IF STYREKODE ^= 'OO'  &  FRA_CICS THEN                                 00002270
    TRANSKODE = 'RIA1';                                                 00002280
 ELSE                                                                   00002290
  DO;                                                                   00002300
                                                                        00002310
    TRANS_RETURKODE  = TRANSKODE;                                       00002320
    ANT_FEIL_SKREVET = 0;                                               00002330
    FEIL_FUNNET      = '0'B;                                            00002340
    FEIL_I_SØKER     = '0'B;                                            00002350
    FEIL_I_BARN      = '0'B;                                            00002360
    FEIL_I_SPES      = '0'B;                                            00002370
    FEIL_I_YSKADE    = '0'B;                                            00002380
                                                                        00002390
    SELECT (TRANSKODE);                                                 00002400
      WHEN('RIA0')                                                      00002410
        DO;                                                             00002420
           CALL BLANK_OO_SØKER;                             /*R001IA02*/00002430
           CALL BLANK_OO_SPES;                              /*R001IA02*/00002440
           CALL BLANK_OO_MELDNR;                            /*R001IA02*/00002450
           CALL OVERFØR_OO_SØKER;                           /*R001IA09*/00002460
           CALL KONTROLL_OO_SØKER(FEIL_I_SØKER);                        00002470
                                                                        00002480
           IF ^FEIL_I_SØKER       THEN                                  00002490
               DO;                                                      00002500
                  CALL OVERFØR_INNTEKT_TIL(FEIL_I_SØKER);  /*R001IA04*/ 00002510
               END;                                                     00002520
        END;                                                            00002530
      WHEN('RIA1')                                                      00002540
         DO;                                                            00002550
                                                            /*R001IA02*/00002560
           CALL BLANK_OO_MELDNR;                            /*R001IA02*/00002570
           CALL OVERFØR_OO_SØKER;                           /*R001IA02*/00002580
           CALL KONTROLL_OO_SØKER(FEIL_I_SØKER);            /*R001IA03*/00002590
           IF ^FEIL_I_SØKER       THEN                                  00002600
               DO;                                                      00002610
                  CALL OVERFØR_INNTEKT_TIL(FEIL_I_SØKER);  /*R001IA04*/ 00002620
               END;                                                     00002630
        END;                                                            00002640
     OTHERWISE;                                                         00002650
        /*INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER */00002660
    END;                                                                00002670
                                                                        00002680
    IF FEIL_I_SØKER = '0'B &                                            00002690
        FEIL_I_SPES = '0'B   THEN                                       00002700
        FEIL_FUNNET = '0'B;                                             00002710
    ELSE                                                                00002720
        FEIL_FUNNET = '1'B;                                             00002730
                                                                        00002740
                                                                        00002750
                                                                        00002760
    IF ^FEIL_FUNNET   THEN                                              00002770
        DO;                                                             00002780
           IF TRANSKODE = 'RIA1'   THEN                                 00002790
              TRANSKODE = 'RIA0';                                       00002800
            ELSE                                                        00002810
              TRANS_RETURKODE  = TRANSKODE ;                            00002820
                                                                        00002830
            IF TRANSKODE  = 'RIA0' THEN                                 00002840
              DO;                                                       00002850
                 CALL BLANK_OO_MAP;                                     00002860
                 S001IA1I.FRA_FNRL  = CURSOR_POS;                       00002870
                 EXEC CICS SEND MAP('S001IA1') MAPSET('S001IA3')        00002880
                                MAPONLY ERASE ;                         00002890
              END;                                                      00002900
        END;                                                            00002910
    ELSE                                                                00002920
    IF FEIL_FUNNET ! HENT_FRAM_MAP !                                    00002930
       FRA_UTEN_DIALOG ! TRANS_RETURKODE ^= TRANSKODE THEN              00002940
       DO;                                                              00002950
                                                                        00002960
          IF TRANSKODE = 'RIA0' THEN                                    00002970
           TRANSKODE = 'RIA1';                                          00002980
                                                                        00002990
          CALL BLANK_OO_MAP;                                            00003000
          CALL OVERFØR_OOSØKER_MAP;                                     00003010
                                                                        00003020
                                                                        00003030
          IF HENT_FRAM_MAP  THEN                                        00003040
             DO;                                                        00003050
               IF TRANSKODE ^= 'RIA0' THEN                              00003060
                 EXEC CICS SEND MAP('S001IA1') MAPSET('S001IA3')        00003070
                                        ERASE CURSOR;                   00003080
            ELSE                                                        00003090
              IF TRANSKODE ^= 'RIA1' THEN                               00003100
               EXEC CICS SEND MAP('S001IA1') MAPSET('S001IA3') ERASEAUP 00003110
                                                     DATAONLY CURSOR;   00003120
            END;                                                        00003130
         ELSE                                                           00003140
            DO;                                                         00003150
              IF TRANSKODE ^= 'RIA0' THEN                               00003160
               EXEC CICS SEND MAP('S001IA1') MAPSET('S001IA3')          00003170
                                        ERASE CURSOR;                   00003180
              ELSE                                                      00003190
               IF TRANSKODE ^= 'RIA1' THEN                              00003200
               EXEC CICS SEND MAP('S001IA1') MAPSET('S001IA3') ERASEAUP 00003210
                                                     DATAONLY CURSOR;   00003220
               HENT_FRAM_MAP = '0'B;                                    00003230
                                                                        00003240
               FEIL_MELD_NR  = 666;/* => FEIL_FUNNET ER SATT. */        00003250
                                                                        00003260
               IF  FRA_CICS THEN                                        00003270
                 EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR); 00003280
              ELSE                                                      00003290
                GOTO RECEIVE_MAP;                                       00003300
            END;                                                        00003310
                                                                        00003320
                                                                        00003330
           IF TRANSKODE = 'RIA1' THEN                                   00003340
             TRANS_RETURKODE = 'RIA0';                                  00003350
          ELSE                                                          00003360
             TRANS_RETURKODE = TRANSKODE;                               00003370
       END;                                                             00003380
   END;                                                                 00003390
                                                                        00003400
   CALL UTGANG;                                                         00003410
                                                                        00003420
  UTGANG: PROC;                                                         00003430
       EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);           00003440
  END UTGANG;                                                           00003450
                                                                        00003460
  FEILBEH:                                                              00003470
                                                                        00003480
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00003490
                                                                        00003500
     PROGRAM_ID = 'R001IA01';                                           00003510
                                                                        00003520
     ALLOCATE S001IA1O;                                                 00003530
     S001IA1O.CICS_INFOO = CICS_NAVN;                                   00003540
                                                                        00003550
     S001IA1O.MELDING2O =                                               00003560
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00003570
                                                                        00003580
     S001IA1O.MELDING3O =                                               00003590
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00003600
                                                                        00003610
     S001IA1O.MELDING4O =                                               00003620
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00003630
                                         !! '. DATASETT : ' !! DSNAVN;  00003640
                                                                        00003650
     S001IA1O.MELDING5O =                                               00003660
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00003670
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00003680
                                                                        00003690
     S001IA1O.MELDING6O =                                               00003700
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00003710
                                                                        00003720
                                                                        00003730
     EXEC CICS SEND MAP('S001IA1')                                      00003740
                                                 MAPSET('S001IA3');     00003750
                                                                        00003760
     EXEC CICS RECEIVE MAP('S001IA1')                                   00003770
                                    MAPSET('S001IA3') SET(BMSMAPBR);    00003780
                                                                        00003790
                                                                        00003800
     EXEC CICS SYNCPOINT ROLLBACK;                                      00003810
                                                                        00003820
                                                                        00003830
     TERMINERINGS_IND = 'F';                                            00003840
                                                                        00003850
     TRANSKODE  = 'RIA1';                                               00003860
                                                                        00003870
     CALL UTGANG;                                                       00003880
                                                                        00003890
  ABEND:                                                                00003900
     EXEC CICS ABEND ABCODE(FEIL);                                      00003910
                                                                        00003920
                                                                        00003930
  %PAGE;                                                                00003940
       %INCLUDE R001IA02;               /* BLANK  ARBEIDSOMRÅDE */      00003950
  %PAGE;                                                                00003960
       %INCLUDE R001IA03;               /* KONTROLL AV SØKERDELEN */    00003970
  %PAGE;                                                                00003980
       %INCLUDE R001IA04;               /* FLYTTING AV BARNEDATA OG     00003990
                                        KONTROLL */                     00004000
  %PAGE;                                                                00004010
       %INCLUDE R001IA06;               /* ARBEIDSOMRÅDE -> MAP */      00004020
                                                                        00004030
  %PAGE;                                                                00004040
       %INCLUDE R001IA09;               /* MAP -> ARBEIDSOMRÅDE */      00004050
  %PAGE;                                                                00004060
       %INCLUDE R0019901;               /*  TESTER OM DATO ER GYLDIG */ 00004070
  %PAGE;                                                                00004080
       %INCLUDE R0019904;               /* FØDSELSNUMMERKONTROLL */     00004090
  %PAGE;                                                                00004100
       %INCLUDE R0019910;               /* NUMERISK KONTROLL */         00004110
  %PAGE;                                                                00004120
       %INCLUDE R0019911;               /*  DATO KONTROLL  */           00004130
       %INCLUDE R0019912;               /*  F_FELT_PIC_CHA */           00004140
  %PAGE;                                                                00004150
       %INCLUDE R0019944;               /* SKRIV_FEIL       */          00004160
    END R001IA;                                                         00004170
                                                                        00004180
