 /*       SIST ENDRET 24/10-97 11.57.19 AV   JDA7339                  */00000000
 /*       SIST ENDRET 07/12-93 14.54.28 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 20/10-93 13.15.40 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 20/10-93 12.33.56 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 25/09-92 12.20.45 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 26/09-83 08.33.34 AV   LUNDEBY                  */00000050
 /*       SIST ENDRET 23/09-83 14.16.25 AV   LUNDEBY                  */00000060
 /*       SIST ENDRET 06/04-83 14.00.23 AV   LUNDEBY                  */00000070
                                                                        00000080
                                                                        00000090
  /* **************************************************************** */00000100
  /*IDENTIFIKASJON:                                                   */00000110
  /*    R0015601 - HOVEDPROGRAM I PLI                                 */00000120
  /*                                                                  */00000130
  /*    PROGRAMMERER: S. LUNDEBY , SFK , DESEMBER 1982                */00000140
  /*                                                                  */00000150
  /*HENSIKT:                                                          */00000160
  /*    SJEKKER ROT-SEGMENTET OM PERSONEN ER SPERRET                  */00000170
  /*    OG SPERRER DET MED :                                          */00000180
  /*                                                                  */00000190
  /*    ROT_SEGM. EKSISTERTE      :      J                            */00000200
  /*    ROT_SEGM. EKSISTERTE IKKE :      D     (FOR DUMMY-SEGM)       */00000210
  /*                                                                  */00000220
  /*PROGRAMTILKNYTNING:                                               */00000230
  /*                                                                  */00000240
  /*BRUKER                                                            */00000250
  /*                                                                  */00000260
  /* **************************************************************** */00000270
                                                                        00000280
  R001560 :                                                             00000290
    PROC            (COMMAREA_PEKER)                                    00000300
           OPTIONS  (MAIN);                                             00000310
                                                                        00000320
    %PAGE;                                                              00000330
    %INCLUDE P0019906;                              /* TRANS_OPPL_OMR */00000340
                                                                        00000350
    %PAGE;                                                              00000360
    %INCLUDE P0019908;                              /* KOM_OMR        */00000370
                                                                        00000380
    %PAGE;                                                              00000390
    %INCLUDE P0019910;                              /* STYRINGS_OMR   */00000400
                                                                        00000410
    %PAGE;                                                              00000420
    %INCLUDE P0019912;                              /* DIV_PARAM_OMR  */00000430
                                                                        00000440
    %PAGE;                                                              00000450
       DCL 1 B01              BASED (B01_PEKER),                        00000460
    %INCLUDE P0019921;                              /* B01            */00000470
                                                                        00000480
    %PAGE;                                                              00000490
       DCL 1 B02              BASED (B02_PEKER),                        00000500
    %INCLUDE P0019921;                              /* B02            */00000510
                                                                        00000520
    %PAGE;                                                              00000530
    /* ************************************************************** */00000540
    /*                                                                */00000550
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00000560
    /*                                                                */00000570
    /* ************************************************************** */00000580
                                                                        00000590
       DCL                                                              00000600
         ( ADDR , CSTG , LOW , STG , SUBSTR , DATE )  BUILTIN;          00000610
       DCL                                                              00000620
         PLITDLI ENTRY;                                                 00000630
                                                                        00000640
    /* ************************************************************** */00000650
    /*                                                                */00000660
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000670
    /*                                                                */00000680
    /* ************************************************************** */00000690
                                                                        00000700
    %INCLUDE DLIUIB;                                                    00000710
                                                                        00000720
       DCL                                                              00000730
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00000740
       DCL                                                              00000750
           COMMAREA_PEKER            POINTER;                           00000760
       DCL                                                              00000770
           W01_HJELPE_PTR            POINTER;                           00000780
       DCL  OVER_RBA                 POINTER;                           00000790
                                                                        00000800
    /* ************************************************************** */00000810
    /*                                                                */00000820
    /*   OPPTELINGS- OG LOOP-PARAMETRE M.M                            */00000830
    /*                                                                */00000840
    /* ************************************************************** */00000850
                                                                        00000860
       DCL 1  W01_OMR                   UNALIGNED,                      00000870
              2   I                     FIXED  BIN  (15)     INIT ( 0 ),00000880
              2   W02_ANT_GANGER_I_WAIT FIXED  BIN  (15)     INIT ( 0 ),00000890
              2   B                            CHAR (1)      INIT (' ');00000900
                                                                        00000910
                                                                        00000920
    /* ************************************************************** */00000930
    /*                                                                */00000940
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00000950
    /*                                                                */00000960
    /* ************************************************************** */00000970
                                                                        00000980
       DCL 1  W01_DLI_PARAM,                                            00000990
              2   W02_GHU                 CHAR (4)   INIT ('GHU '),     00001000
              2   W02_ISRT                CHAR (4)   INIT ('ISRT'),     00001010
              2   W02_REPL                CHAR (4)   INIT ('REPL'),     00001020
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00001030
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00001040
              2   W02_OUT2                CHAR (20)  INIT ((20)' '),    00001050
              2   W02_SPERREBEHANDLING    BIT  (1)   INIT ('0'B),       00001060
              2   W02_PERSONEN_ER_SPERRET BIT  (1)   INIT ('1'B);       00001070
                                                                        00001080
       DCL    W01_IO                 CHAR (100)      INIT ( (100) ' '); 00001090
       DCL    W01_HJELPE_IO          CHAR (100) BASED (W01_HJELPE_PTR); 00001100
                                                                        00001110
    /* ************************************************************** */00001120
    /*                                                                */00001130
    /*   DL1 SSA-OMRÅDER FOR ROT                                      */00001140
    /*                                                                */00001150
    /* ************************************************************** */00001160
                                                                        00001170
       DCL    SSA_UQUAL                         CHAR (9)  INIT ((9)' ');00001180
                                                                        00001190
       DCL 1  SSA1_RF0PERSN          UNALIGNED,                         00001200
              2    HDEL                         CHAR (17) INIT          00001210
                   ('RF0PERSN(FNR     '),                               00001220
              2    REL_OP                       CHAR (2)  INIT (' ='),  00001230
              2    PKEY               FIXED     DEC  (11) INIT ( 0  ),  00001240
              2    HP                           CHAR (1)  INIT (')' );  00001250
                                                                        00001260
    /* ************************************************************** */00001270
    /*                                                                */00001280
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00001290
    /*                                                                */00001300
    /* ************************************************************** */00001310
                                                                        00001320
    %PAGE;                                                              00001330
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00001340
                                                                        00001350
    %PAGE;                                                              00001360
       DCL 1  HF1              BASED (HF1_PCB_PEKER),                   00001370
    %INCLUDE P0012003;                         /* PCB                 */00001380
                                                                        00001390
                                                                        00001400
    DCL 1 OVERFOR_REC,                                                  00001410
          2 FRST           CHAR (9) INIT ('000000001'),                 00001420
          2 FNR            PIC '(11)9',                                 00001430
          2 REST           CHAR (54)  INIT ( (54) ' ' ),                00001440
          2 OVER_DATO      CHAR (06)  INIT ( '    ' );                  00001450
                                                                        00001460
    /* ************************************************************** */00001470
    /*                                                                */00001480
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00001490
    /*     ---------------------------------------------------        */00001500
    /*                                                                */00001510
    /*                                                                */00001520
    /*      INITIERING AV PARAMETRE TIL DIV_PARAM_OMR.                */00001530
    /*                                                                */00001540
    /*      SETTER UIBPTR = UIB_PEKER   SOM OVERFØRES ETTER           */00001550
    /*      INITIERINGS-KALL   I     R0012001 .                       */00001560
    /*                                                                */00001570
    /* ************************************************************** */00001580
                                                                        00001590
    DB_STATUS_KODE                          =   '  '         ;          00001600
    PROGRAM_ID                              =   'R0015602'   ;          00001610
    UIBPTR                                  =    UIB_PEKER   ;          00001620
    OVER_DATO                               =    DATE;                  00001630
                                                                        00001640
                                                                        00001650
    /* ********************************************************** */    00001660
    /*        SJEKKER ROT-SEGM FINNES I HISTORIK DATABASE         */    00001670
    /* ********************************************************** */    00001680
    EXEC CICS ENTER TRACEID(10) FROM (SEARCH_FNR);                      00001690
    SSA1_RF0PERSN.PKEY                      =    SEARCH_FNR  ;          00001700
    CALL P020_LES_ROT_GHU;                                              00001710
                                                                        00001720
    DB_STATUS_KODE  =  HF1.STATUS_KODE;                                 00001730
    IF   DLIUIB.UIBFCTR                    ^=    UIB_RC_OK         THEN 00001740
      DO;                                                               00001750
         /* ********************************************** */           00001760
         /* UIB'S RETURCODE ER UAKSEPTABEL                 */           00001770
         /* ********************************************** */           00001780
  L100:                                                                 00001790
         FEIL_MELD_NR                 =   500;                          00001800
         FEIL_VED_LABEL               =  '100';                         00001810
         GO TO L999;                                                    00001820
      END;                                                              00001830
                                                                        00001840
                                                                        00001850
     SELECT    ( HF1.STATUS_KODE);                                      00001860
      WHEN     ('  ')                 /*     PERSONEN FINNES I DB.   */ 00001870
                                                                        00001880
        DO;                                                             00001890
            OVERFOR_REC.FNR = SEARCH_FNR  ;                             00001900
            EXEC CICS WRITE DATASET ( 'OVERFOR' )                       00001910
                            FROM    (OVERFOR_REC)                       00001920
                            RIDFLD  (OVER_RBA)                          00001930
                            RBA;                                        00001940
                                                                        00001950
            FEIL_MELD_NR                 =   382;                       00001960
            FEIL_VED_LABEL               =  '100';                      00001970
        END;                                                            00001980
                                                                        00001990
      WHEN ('GE')                /*      PERSONEN FINNES IKKE I DB.  */ 00002000
        DO;                                                             00002010
            FEIL_MELD_NR                 =   000;                       00002020
            FEIL_VED_LABEL               =  '000';                      00002030
        END;                                                            00002040
                                                                        00002050
                                                                        00002060
      OTHERWISE                                                         00002070
        DO;                                                             00002080
          /* ************************************************ */        00002090
          /*    UGYLDIG STATUSKODE FRA DLI                    */        00002100
          /* ************************************************ */        00002110
  L140:                                                                 00002120
          FEIL_MELD_NR    =  500;                                       00002130
          FEIL_VED_LABEL  = '140';                                      00002140
          DB_STATUS_KODE  =  HF1.STATUS_KODE;                           00002150
          GO TO L999;                                                   00002160
        END;                                                            00002170
     END;     /*   SELECT : STATUS-KODE ETTER KALL MOT ROT  */          00002180
                                                                        00002190
                                                                        00002200
                                                                        00002210
                                                                        00002220
                                                                        00002230
    %PAGE;                                                              00002240
    /* ************************************************************** */00002250
    /*                                                                */00002260
    /* PROCEDURE FOR LESE ROT-SEGM              ( GHU   )             */00002270
    /*                                                                */00002280
    /* ************************************************************** */00002290
                                                                        00002300
    P020_LES_ROT_GHU:                                                   00002310
      PROC;                                                             00002320
                                                                        00002330
      CALL PLITDLI                              (W02_PARM_CT_4,         00002340
                                                 W02_GHU,               00002350
                                                 HF1,                   00002360
                                                 W01_IO,                00002370
                                                 SSA1_RF0PERSN);        00002380
    END P020_LES_ROT_GHU;                                               00002390
                                                                        00002400
                                                                        00002410
  L999:                                                                 00002420
                                                                        00002430
    EXEC CICS RETURN;                                                   00002440
  END    R001560;                                                       00002450
