 /*       SIST ENDRET 30/03-88 11.04.44 AV   HERMAN                   */00000000
 /*       SIST ENDRET 23/09-87 11.49.20 AV   DYBVIK                   */00000010
 R001NO4: PROCEDURE (RF1_PCB_PEKER) OPTIONS (MAIN);                     00000020
 %SKIP(3);                                                              00000030
 /********************************************************************/ 00000040
 /*IDENTIFIKASJON                                                    */ 00000050
 /*     R001NO40            -           HOVEDPROGRAM I PL1           */ 00000060
 /*                                     DL1 (IKKE CICS)              */ 00000070
 /*     BRITT FOSSUM        -           APRIL 1986                   */ 00000080
 /*HENSIKT                                                           */ 00000090
 /*     PROGRAMMET DANNER EN RECORD MED GRUNNLAGSDATA SOM SKAL       */ 00000100
 /*     DANNE GRUNNLAG FOR KONVERTERING AV NORTRYGD PENSJONER.       */ 00000110
 /*INPUT                                                             */ 00000120
 /*     FREGFNR SOM BLIR DANNET AV AA-REG.                           */ 00000130
 /*     RF-BASEN                                                     */ 00000140
 /*OUTPUT                                                            */ 00000150
 /*     NORFILE SOM GÅR INN I NORTRYGD TRANSPORTSYSTEM               */ 00000160
 /********************************************************************/ 00000170
 %SKIP(2);                                                              00000180
 /* -------------------------------------------------------------- */   00000190
 /*                                                                */   00000200
 /*   FILER, ARBEIDSOMRÅDER                                        */   00000210
 /*                                                                */   00000220
 /* -------------------------------------------------------------- */   00000230
                                                                        00000240
     DCL RF1_PCB_PEKER   POINTER        ,                               00000250
         PLITDLI         ENTRY          ;                               00000260
                                                                        00000270
 /*  FILER    */                                                        00000280
                                                                        00000290
     DCL SYSPRINT        FILE STREAM PRINT;                             00000300
     DCL NORFILE         FILE RECORD OUTPUT;                            00000310
     DCL FREGFNR         FILE RECORD INPUT;                             00000320
                                                                        00000330
 /*  RECORD-BESKRIVESE INPUT-RECORD  */                                 00000340
                                                                        00000350
     DCL 01 FNR_REC,                                                    00000360
            05 INN_TKNR  PIC '(04)9',                                   00000370
            05 INN_FNR   PIC '(11)9';                                   00000380
                                                                        00000390
 %INCLUDE P001NO20;       /*  OUTPUTOMRÅDE NOR_REC                */    00000400
                                                                        00000410
                                                                        00000420
 /* -------------------------------------------------------------- */   00000430
 /*                                                                */   00000440
 /*   DLI CALL-PARAMETRE                                           */   00000450
 /*                                                                */   00000460
 /* -------------------------------------------------------------- */   00000470
                                                                        00000480
     DCL 01  W01_DLI_PARAM   ,                                          00000490
             03  W02_GET         CHAR      (04)    INIT ('    ' ) ,     00000500
             03  W02_PARM_CT_3   FIXED BIN (31)    INIT (3      ) ,     00000510
             03  W02_PARM_CT_4   FIXED BIN (31)    INIT (4      ) ,     00000520
             03  W02_PARM_CT_5   FIXED BIN (31)    INIT (5      ) ;     00000530
                                                                        00000540
 /* -------------------------------------------------------------- */   00000550
 /*                                                                */   00000560
 /*   INPUT/OUTPUT OMRÅDER                                         */   00000570
 /*                                                                */   00000580
 /* -------------------------------------------------------------- */   00000590
                                                                        00000600
     DCL  W01_IO                 CHAR   (100) ;                         00000610
     DCL  W01_HJELPE_IO  BASED(W01_INP_PEKER)   CHAR   (100) ;          00000620
                                                                        00000630
     DCL  01 ROT         ,                                              00000640
          %INCLUDE P0019927                  ;                          00000650
                                                                        00000660
     DCL  01  STATUS     ,                                              00000670
          %INCLUDE P0019930                  ;                          00000680
                                                                        00000690
     DCL  01  TILKN (13) ,                                              00000700
          %INCLUDE P0019931                  ;                          00000710
                                                                        00000720
     DCL  01  ALDERSP    ,                                              00000730
          %INCLUDE P0019932                  ;                          00000740
                                                                        00000750
     DCL  01  UFØRPENS  ,                                               00000760
          %INCLUDE P0019934                  ;                          00000770
                                                                        00000780
     DCL  01  ETTEPENS   ,                                              00000790
          %INCLUDE P0019937                  ;                          00000800
                                                                        00000810
     DCL  01  ETTEBARN   ,                                              00000820
          %INCLUDE P0019938                  ;                          00000830
                                                                        00000840
     DCL  W01_INP_PEKER           POINTER        ;                      00000850
                                                                        00000860
 /* -------------------------------------------------------------- */   00000870
 /*                                                                */   00000880
 /*   DL1 SSA-OMRÅDER                                              */   00000890
 /*                                                                */   00000900
 /* -------------------------------------------------------------- */   00000910
                                                                        00000920
 %PAGE;                                                                 00000930
     DCL  SSA_UQUAL  STATIC   CHAR      (09) ;                          00000940
                                                                        00000950
     DCL  SSA_P_UQUAL  STATIC CHAR      (11) ;                          00000960
                                                                        00000970
     DCL  01  SSA1_RF0PERSN   STATIC,                                   00000980
              03  HDEL        CHAR      (17)      INIT                  00000990
                                                  ('RF0PERSN(FNR     '),00001000
              03  REL_OP      CHAR      (02)      INIT (' =')    ,      00001010
              03  PKEY        FIXED DEC (11)      INIT ( 0  )    ,      00001020
              03  HP          CHAR      (01)      INIT (')' )    ;      00001030
                                                                        00001040
 /* -------------------------------------------------------------- */   00001050
 /*                                                                */   00001060
 /*   PCB-PEKER-OMR    OG    PCB-OMR                               */   00001070
 /*                                                                */   00001080
 /* -------------------------------------------------------------- */   00001090
                                                                        00001100
 %PAGE;                                                                 00001110
     DCL  01  RF1                 BASED     (RF1_PCB_PEKER)          ,  00001120
        %INCLUDE P0012003;                                              00001130
                                                                        00001140
                                                                        00001150
 /* -------------------------------------------------------------- */   00001160
 /*                                                                */   00001170
 /*  TELLERE, BRYTERE, INNEBYGDE FUNKSJONER                        */   00001180
 /*                                                                */   00001190
 /* -------------------------------------------------------------- */   00001200
                                                                        00001210
     DCL TELLER_LEST     BINARY FIXED(31) INIT (0);                     00001220
     DCL TELLER_NORREC   BINARY FIXED(31) INIT (0);                     00001230
                                                                        00001240
     DCL MER_DATA        BIT(1)           INIT ('1'B);                  00001250
     DCL INGEN_FEIL      BIT(1)           INIT ('1'B);                  00001260
                                                                        00001270
     DCL (PLIRETC, DATE, TIME, ONCODE, VERIFY)                          00001280
                                                                BUILTIN;00001290
     DCL RETCODE         BINARY FIXED(31)   INIT (0);                   00001300
                                                                        00001310
     DCL BARN_INDEX      BINARY FIXED(15);                              00001320
     DCL I               BINARY FIXED(15);                              00001330
     DCL J               BINARY FIXED(15);                              00001340
                                                                        00001350
                                                                        00001360
 /*------------------------------------------------------------------*/ 00001370
 /*  HJELPEOMRÅDER                                                   */ 00001380
 /*------------------------------------------------------------------*/ 00001390
                                                                        00001400
     DCL W01_PENSJON_ETTER        CHAR      (1);                        00001410
     DCL FNR_PIC                  PIC      '(11)9';                     00001420
                                                                        00001430
 /*  HJELPEOMRÅDE FOR Å SNU FNR */                                      00001440
                                                                        00001450
     DCL 01  W01_FNUM     DEF    INN_FNR        ,                       00001460
             03  W02_FÅR          PIC      '(2)9',                      00001470
             03  W02_FMND         PIC      '(2)9',                      00001480
             03  W02_FDAG         PIC      '(2)9',                      00001490
             03  W02_FREST        PIC      '(5)9';                      00001500
                                                                        00001510
     DCL W01_FDAG_SAVE            PIC      '(2)9';                      00001520
                                                                        00001530
 /*  DATO-HÅNDTERING  */                                                00001540
                                                                        00001550
     DCL 01 W01_DATO,                                                   00001560
            02 W01_ÅR                  CHAR(2),                         00001570
            02 W01_MND                 CHAR(2),                         00001580
            02 W01_DAG                 CHAR(2);                         00001590
     DCL 01 W01_DATO_DEF DEF W01_DATO  CHAR(6);                         00001600
                                                                        00001610
 /*  TIDS-HÅNDTERING  */                                                00001620
                                                                        00001630
     DCL 01 W01_TID,                                                    00001640
            02 W01_TTMM                CHAR(4),                         00001650
            02 W01_TID_REST            CHAR(5);                         00001660
     DCL 01 W01_TID_DEF DEF W01_TID    CHAR(9);                         00001670
                                                                        00001680
                                                                        00001690
 %SKIP(2);                                                              00001700
 /*------------------------------------------------------------------*/ 00001710
 /*  SLUTT PÅ DEKLARASJONENE.                                        */ 00001720
 /*------------------------------------------------------------------*/ 00001730
                                                                        00001740
                                                                        00001750
          ON ERROR BEGIN;                                               00001760
             ON ERROR SYSTEM;                                           00001770
             PUT FILE (SYSPRINT) EDIT ('FEIL HAR OPPSTÅTT. ONCODE = ',  00001780
                                        ONCODE)                         00001790
                                      ( SKIP,COL(4),A,A(4));            00001800
             PUT FILE (SYSPRINT) EDIT ('SISTE FNR: ',                   00001810
                                        INN_FNR)                        00001820
                                      ( SKIP,COL(4),A,P'999999B999B99');00001830
             RETCODE = 100;                                             00001840
          END;                                                          00001850
                                                                        00001860
                                                                        00001870
          ON ENDFILE (FREGFNR)     MER_DATA   = '0'B;                   00001880
                                                                        00001890
                                                                        00001900
 /*------------------------------------------------------------------*/ 00001910
 /* DIV INITIERING.                                                  */ 00001920
 /*------------------------------------------------------------------*/ 00001930
                                                                        00001940
          OPEN FILE (FREGFNR),                                          00001950
               FILE (SYSPRINT),                                         00001960
               FILE (NORFILE);                                          00001970
                                                                        00001980
          W01_DATO_DEF = DATE;                                          00001990
          W01_TID_DEF  = TIME;                                          00002000
                                                                        00002010
                                                                        00002020
          PUT FILE (SYSPRINT) EDIT ('START KJØRING R001NO40 ',          00002030
                                     W01_DAG,W01_MND,W01_ÅR,' KL.',     00002040
                                     W01_TTMM)                          00002050
                                   (PAGE,COL(4),A,A,A,A,A,A);           00002060
                                                                        00002070
                                                                        00002080
 /*------------------------------------------------------------------*/ 00002090
 /* 1. RECORD PÅ FILEN BLIR LEST.                                    */ 00002100
 /*------------------------------------------------------------------*/ 00002110
                                                                        00002120
          READ FILE(FREGFNR) INTO (FNR_REC);                            00002130
                                                                        00002140
                                                                        00002150
 /*------------------------------------------------------------------*/ 00002160
 /* HOVEDPROSEDYRE.                                                  */ 00002170
 /* ETTER AT EN RECORD ER LEST, BLIR TELLER OPPDATERT, OG PROSE-     */ 00002180
 /* DYREN SOM FLYTTER DATA TIL NOR-RECORDEN BLIR KALT.               */ 00002190
 /*------------------------------------------------------------------*/ 00002200
                                                                        00002210
          DO WHILE (MER_DATA);                                          00002220
                                                                        00002230
             TELLER_LEST      = TELLER_LEST + 1;                        00002240
                                                                        00002250
             NOR_RECORD          = '';                                  00002260
             W01_PENSJON_ETTER   = ' ';                                 00002270
             INGEN_FEIL          = '1'B;                                00002280
                                                                        00002290
                                                                        00002300
 /*------------------------------------------------------------------*/ 00002310
 /*     LESER RF01 (ROT-SEGMENTET) FOR DENNE PERSON                  */ 00002320
 /*     ETTER AT INN-FNR ER SNUDD  (FRA ÅÅMMDD TIL DDMMÅÅ)           */ 00002330
 /*------------------------------------------------------------------*/ 00002340
                                                                        00002350
                                                                        00002360
             W01_FDAG_SAVE = W02_FDAG;                                  00002370
             W02_FDAG = W02_FÅR;                                        00002380
             W02_FÅR  = W01_FDAG_SAVE;                                  00002390
                                                                        00002400
             PKEY = INN_FNR;                                            00002410
                                                                        00002420
             W02_GET = 'GU  ';                                          00002430
             CALL PLITDLI     (W02_PARM_CT_4,                           00002440
                               W02_GET,                                 00002450
                               RF1,                                     00002460
                               ROT,                                     00002470
                               SSA1_RF0PERSN);                          00002480
                                                                        00002490
             IF RF1.STATUS_KODE  = '  '  THEN                           00002500
                DO;                                                     00002510
                                                                        00002520
 /*------------------------------------------------------------------*/ 00002530
 /*     LESER SISTE STATUS.                                          */ 00002540
 /*------------------------------------------------------------------*/ 00002550
                                                                        00002560
                                                                        00002570
                   W02_GET = 'GNP ' ;                                   00002580
                   SSA_P_UQUAL = 'STATUS  *P ';                         00002590
                   CALL PLITDLI (W02_PARM_CT_4,                         00002600
                                 W02_GET,                               00002610
                                 RF1,                                   00002620
                                 STATUS,                                00002630
                                 SSA_P_UQUAL);                          00002640
                                                                        00002650
                   IF RF1.STATUS_KODE = ' ' THEN                        00002660
                      DO;                                               00002670
                                                                        00002680
 /*------------------------------------------------------------------*/ 00002690
 /*     TESTER OM DET ER SISTE STATUS SOM ER LEST                    */ 00002700
 /*------------------------------------------------------------------*/ 00002710
                                                                        00002720
                                                                        00002730
                         IF STATUS.STATUS_KODE = 'S' THEN               00002740
                            DO;                                         00002750
                                                                        00002760
 /*------------------------------------------------------------------*/ 00002770
 /*     TESTER OM TILFELLET ER OPPHØRT.                              */ 00002780
 /*------------------------------------------------------------------*/ 00002790
                                                                        00002800
                                                                        00002810
                               IF STATUS_KODE_HIST  = ' '             & 00002820
                                 VERIFY(STATUS.PENSJONSTYPE1,'AUEJBN')  00002830
                                                    = 0             THEN00002840
                                IF                                      00002850
                                 ^(STATUS.SUM_YTELSE     =  0  &        00002860
                                   STATUS.PENSJONSTYPE1  = 'A' &        00002870
                                   STATUS.PENSJONSTYPE2 ^= 'E'    ) THEN00002880
                                  DO;                                   00002890
                                                                        00002900
 /*------------------------------------------------------------------*/ 00002910
 /* OPPLYSNINGENE FRA ROT OG STATUS BLIR FLYTTET, TILKN. LESES.      */ 00002920
 /* BEHANDLINGEN VIDERE ER AVHENGIG AV PENSJONSTYPE.                 */ 00002930
 /*------------------------------------------------------------------*/ 00002940
                                                                        00002950
                                     CALL P010_FLYTT_ROT_STATUS;        00002960
                                                                        00002970
                                     SELECT (STATUS.PENSJONSTYPE1);     00002980
                                        WHEN ('A')                      00002990
                                           DO;                          00003000
                                              CALL P020_BEH_AP;         00003010
                                           END;                         00003020
                                        WHEN ('U')                      00003030
                                           DO;                          00003040
                                              CALL P030_BEH_UP;         00003050
                                           END;                         00003060
                                        WHEN ('E','J')                  00003070
                                           DO;                          00003080
                                              CALL P040_BEH_EP;         00003090
                                           END;                         00003100
                                        WHEN ('B','N')                  00003110
                                           DO;                          00003120
                                              CALL P050_BEH_BP;         00003130
                                           END;                         00003140
                                        OTHERWISE;                      00003150
                                     END;                               00003160
                                                                        00003170
                                     IF INGEN_FEIL THEN                 00003180
                                        DO;                             00003190
                                           CALL P060_BEH_TILKN;         00003200
                                                                        00003210
                                           WRITE FILE (NORFILE)         00003220
                                                 FROM (NOR_RECORD);     00003230
                                           TELLER_NORREC =              00003240
                                                     TELLER_NORREC + 1; 00003250
                                        END;                            00003260
                                  END;                                  00003270
                            END;                                        00003280
                         ELSE                                           00003290
                            DO;                                         00003300
                               PUT FILE (SYSPRINT) EDIT ('PERSON ',     00003310
                                                          INN_FNR,      00003320
                                                ' MANGLER SISTE STATUS')00003330
                                          (SKIP(2),COL(4),A,P'(11)9',A);00003340
                            END;                                        00003350
                                                                        00003360
                      END;                                              00003370
                END;                                                    00003380
                                                                        00003390
             READ FILE(FREGFNR) INTO (FNR_REC);                         00003400
                                                                        00003410
          END;                                                          00003420
                                                                        00003430
                                                                        00003440
 /*------------------------------------------------------------------*/ 00003450
 /* AVSLUTNING.                                                      */ 00003460
 /*------------------------------------------------------------------*/ 00003470
                                                                        00003480
          PUT FILE (SYSPRINT) EDIT ('ANTALL PERSONER LEST: ',           00003490
                                     TELLER_LEST)                       00003500
                                   (SKIP(2),COL(4),A,P'9999999');       00003510
          PUT FILE (SYSPRINT) EDIT ('ANTALL REC. DANNET: ',             00003520
                                     TELLER_NORREC)                     00003530
                                   (SKIP(2),COL(4),A,P'9999999');       00003540
          PUT FILE (SYSPRINT) EDIT ('SISTE FNR BEHANDLET: ',INN_FNR)    00003550
                                   (SKIP,COL(4),A,P'99999999999');      00003560
          W01_DATO_DEF = DATE;                                          00003570
          W01_TID_DEF  = TIME;                                          00003580
          PUT FILE (SYSPRINT) EDIT ('STOPP KJØRING R001NO40 ',          00003590
                                     W01_DAG,W01_MND,W01_ÅR,' KL.',     00003600
                                     W01_TTMM)                          00003610
                                   (SKIP,COL(4),A,A,A,A,A,A);           00003620
                                                                        00003630
          CALL PLIRETC(RETCODE);                                        00003640
                                                                        00003650
          CLOSE FILE (SYSPRINT),                                        00003660
                FILE (FREGFNR),                                         00003670
                FILE (NORFILE);                                         00003680
                                                                        00003690
          RETURN;                                                       00003700
                                                                        00003710
                                                                        00003720
                                                                        00003730
 /*------------------------------------------------------------------*/ 00003740
 /*      I N T E R N E   P R O S E D Y R E R                         */ 00003750
 /*------------------------------------------------------------------*/ 00003760
 %PAGE;                                                                 00003770
 /*------------------------------------------------------------------*/ 00003780
 /* FLYTTER OPPLYSNINGER FRA ROT OG STATUS TIL NOR-RECORDEN.         */ 00003790
 /* LESER TILKNYTNINGENE.                                            */ 00003800
 /*------------------------------------------------------------------*/ 00003810
 P010_FLYTT_ROT_STATUS: PROCEDURE;                                      00003820
                                                                        00003830
          W01_TID_DEF = TIME;                                           00003840
                                                                        00003850
 /*------------------------------------------------------------------*/ 00003860
 /* FYLLER OPPLYSNINGER I HODET.                                     */ 00003870
 /*------------------------------------------------------------------*/ 00003880
                                                                        00003890
          HODE.TKNR = INN_TKNR;                                         00003900
          HODE.RECORD_TYPE = 'PV';                                      00003910
          HODE.TRANSTYPE = '01';                                        00003920
          HODE.TRANSDATO = W01_DATO_DEF;                                00003930
          HODE.TRANSTID  = W01_TTMM;                                    00003940
                                                                        00003950
 /*------------------------------------------------------------------*/ 00003960
 /* FLYTTER ANDRE FELTER                                             */ 00003970
 /*------------------------------------------------------------------*/ 00003980
                                                                        00003990
          FNR_PIC                  = ROT.FNR;                           00004000
          DATA.FNR                 = FNR_PIC;                           00004010
          DATA.TKNR                = INN_TKNR;                          00004020
          DATA.VIRKNINGS_DATO      = STATUS.VIRK_DATO_ÅM;               00004030
                                                                        00004040
          DATA.PENSJONSTYPE        = STATUS.PENSJONSTYPE1 !!            00004050
                                     STATUS.PENSJONSTYPE2 !!            00004060
                                     STATUS.PENSJONSTYPE3 ;             00004070
                                                                        00004080
 /*------------------------------------------------------------------*/ 00004090
 /* TRYGDETID SKAL IKKE OVERFØRES FOR BARNEPENSJONISTER EN AV FOR-   */ 00004100
 /* ELDRENE DØD. TLF. FRA M. STENEHJEM 160787                        */ 00004110
 /*------------------------------------------------------------------*/ 00004120
                                                                        00004130
          IF STATUS.PENSJONSTYPE1 ^= 'N'  THEN                          00004140
             DATA.TRYGDETID        = STATUS.TT_ANV;                     00004150
                                                                        00004160
          DATA.ANT_BARN            = STATUS.ANTALL_BARN;                00004170
          DATA.SUM_YTELSE          = STATUS.SUM_YTELSE;                 00004180
                                                                        00004190
 /*------------------------------------------------------------------*/ 00004200
  /* STARTER LESING AV TILKNYTTEDE PERSONER FOR Å FINNE EVENTUELLE */   00004210
  /* YTELSER TIL EKTEFELLE OG BARN                                 */   00004220
 /*------------------------------------------------------------------*/ 00004230
                                                                        00004240
          DO I = 1 TO 13;                                               00004250
             TILKN.FNR_TILKN(I) = 0;                                    00004260
          END;                                                          00004270
                                                                        00004280
          DO I = 1 TO 13 ;                                              00004290
             SSA_UQUAL = 'TILKN    ';                                   00004300
             CALL PLITDLI (W02_PARM_CT_4,                               00004310
                           W02_GET,                                     00004320
                           RF1,                                         00004330
                           TILKN(I),                                    00004340
                           SSA_UQUAL);                                  00004350
             IF ^(RF1.STATUS_KODE = '  '   !                            00004360
                  RF1.STATUS_KODE = 'GK' ) THEN                         00004370
                I = 13;                                                 00004380
          END;                                                          00004390
     END P010_FLYTT_ROT_STATUS;                                         00004400
                                                                        00004410
                                                                        00004420
 %PAGE;                                                                 00004430
 /*------------------------------------------------------------------*/ 00004440
 /* PERSONEN HAR ALDERSPENSJON.  ALDERSSEGMENTET LESES, OG FELTENE   */ 00004450
 /* FLYTTES OVER I NOR-RECORDEN.                                     */ 00004460
 /*------------------------------------------------------------------*/ 00004470
 P020_BEH_AP: PROCEDURE;                                                00004480
                                                                        00004490
                                                                        00004500
          SSA_UQUAL = 'ALDERSP  ';                                      00004510
          CALL PLITDLI (W02_PARM_CT_4,                                  00004520
                        W02_GET,                                        00004530
                        RF1,                                            00004540
                        ALDERSP,                                        00004550
                        SSA_UQUAL);                                     00004560
                                                                        00004570
          IF RF1.STATUS_KODE = '  ' !                                   00004580
             RF1.STATUS_KODE = 'GK' THEN                                00004590
             DO;                                                        00004600
                DATA.GRUNNPENSJON  = ALDERSP.GP;                        00004610
                DATA.NETTO_GRUNNPENSJON = ALDERSP.GP;                   00004620
                DATA.TILLEGGSPENSJON = ALDERSP.TP;                      00004630
                DATA.NETTO_TILLEGGSPENSJON = ALDERSP.TP;                00004640
                DATA.SÆRTILLEGG            = ALDERSP.ST;                00004650
                DATA.KOMPTILLEGG           = ALDERSP.KT;                00004660
                IF STATUS.PENSJONSTYPE2 = 'F'  THEN                     00004670
                   DATA.EKTEFELLETILLEGG   = ALDERSP.ET;                00004680
                DATA.BARNETILLEGG          = ALDERSP.BT;                00004690
                DATA.ARBEIDSINNTEKT     = ALDERSP.FAI * 100;            00004700
                DATA.PENSJONSGRAD       = ALDERSP.APD;                  00004710
                DATA.POENGÅR            = ALDERSP.PÅ;                   00004720
                DATA.SLUTTPOENGTALL    = ALDERSP.SPT * 100;             00004730
                DATA.SLUTTPOENG_MED_OVERKOMP  = ALDERSP.OPT * 100;      00004740
                DATA.VENTET_PROSENT = ALDERSP.VENTEFAKTOR * 100;        00004750
                                                                        00004760
                /* ************************************************* */ 00004770
                /* VENTET_OPPLYSNINGER SKAL BARE OVERFØRES NÅR VEN-  */ 00004780
                /* TETILLEGG SKAL UTBETALES.(TLF M.STENEHJEM 220587) */ 00004790
                /* ************************************************* */ 00004800
                                                                        00004810
                IF DATA.VENTET_PROSENT > 0 THEN                         00004820
                   DO;                                                  00004830
                      DATA.VENTET_POENGÅR = ALDERSP.VT_PÅ;              00004840
                      DATA.VENTET_SLUTT_POENG = ALDERSP.VT_SPT * 100;   00004850
                      DATA.VENTET_SLUTT_MED_OVERKOMP =                  00004860
                                                  ALDERSP.VT_OPT * 100; 00004870
                      DATA.VENTET_GRUNNPENSJON = ALDERSP.VT_GP;         00004880
                      DATA.VENTET_TILLEGGSPENSJON = ALDERSP.VT_TP;      00004890
                      DATA.TRYGDETID_VED_67       = ALDERSP.TT_VENT;    00004900
                   END;                                                 00004910
                                                                        00004920
 /* PERSONEN HAR ETTERLATTEPENSJON I TILLEGG TIL ALDERSPENSJON.      */ 00004930
                                                                        00004940
                IF STATUS.PENSJONSTYPE2 = 'E' THEN                      00004950
                   DO;                                                  00004960
                      SSA_UQUAL = 'ETTEPENS ';                          00004970
                      CALL PLITDLI (W02_PARM_CT_4,                      00004980
                                    W02_GET,                            00004990
                                    RF1,                                00005000
                                    ETTEPENS,                           00005010
                                    SSA_UQUAL);                         00005020
                      IF RF1.STATUS_KODE = '  ' !                       00005030
                         RF1.STATUS_KODE = 'GK' THEN                    00005040
                         DO;                                            00005050
                            DATA.TILLEGGSPENSJON =                      00005060
                                            DATA.TILLEGGSPENSJON  +     00005070
                                                     ETTEPENS.TP_BRUTTO;00005080
                            DATA.NETTO_TILLEGGSPENSJON =                00005090
                                            DATA.NETTO_TILLEGGSPENSJON +00005100
                                                     ETTEPENS.TP_NETTO; 00005110
                            DATA.ARBEIDSINNTEKT =                       00005120
                                            ETTEPENS.FORVENTET * 100;   00005130
                            DATA.POENGÅR_ETTER_AVDØD =                  00005140
                                            ETTEPENS.PÅ_AVD;            00005150
                            DATA.SLUTTP_ETTER_AVDØD =                   00005160
                                                 ETTEPENS.SPT_AVD * 100;00005170
                            DATA.SLUTTP_MED_OVER_ETTER_AVD =            00005180
                                                 ETTEPENS.OPT_AVD * 100;00005190
                            IF ETTEPENS.PÅ_AVD > 0 THEN                 00005200
                               DO;                                      00005210
                                  IF STATUS.SIVILSTAND = 'E' THEN       00005220
                                     DATA.PROS_AV_AVDØD_TILLEGSP = 55;  00005230
                                  ELSE                                  00005240
                                     DATA.PROS_AV_AVDØD_TILLEGSP =      00005250
                                                   ETTEPENS.TP_PROSENT; 00005260
                               END;                                     00005270
                         END;                                           00005280
                                                                        00005290
                      ELSE                                              00005300
                         CALL P100_SKRIV_FEIL                           00005310
                                 ('2',STATUS.PENSJONSTYPE2,SSA_UQUAL);  00005320
                   END;                                                 00005330
             END;                                                       00005340
          ELSE                                                          00005350
             CALL P100_SKRIV_FEIL('1',STATUS.PENSJONSTYPE1,SSA_UQUAL);  00005360
     END P020_BEH_AP;                                                   00005370
                                                                        00005380
                                                                        00005390
 %PAGE;                                                                 00005400
 /*------------------------------------------------------------------*/ 00005410
 /* PERSONEN HAR UFØREPENSJON.  UFØRESEGMENTET LESES, OG FELTENE   */   00005420
 /* FLYTTES OVER I NOR-RECORDEN.                                   */   00005430
 /*------------------------------------------------------------------*/ 00005440
 P030_BEH_UP: PROCEDURE;                                                00005450
                                                                        00005460
                                                                        00005470
                                                                        00005480
          SSA_UQUAL = 'UFØRPENS ';                                      00005490
          CALL PLITDLI (W02_PARM_CT_4,                                  00005500
                        W02_GET,                                        00005510
                        RF1,                                            00005520
                        UFØRPENS,                                       00005530
                        SSA_UQUAL);                                     00005540
          IF RF1.STATUS_KODE = '  ' !                                   00005550
             RF1.STATUS_KODE = 'GK' THEN                                00005560
             DO;                                                        00005570
                DATA.GRUNNPENSJON  = UFØRPENS.GP;                       00005580
                DATA.NETTO_GRUNNPENSJON = UFØRPENS.GP;                  00005590
                DATA.TILLEGGSPENSJON = UFØRPENS.TP;                     00005600
                DATA.NETTO_TILLEGGSPENSJON = UFØRPENS.TP;               00005610
                DATA.SÆRTILLEGG            = UFØRPENS.ST;               00005620
                DATA.KOMPTILLEGG           = UFØRPENS.KT;               00005630
                IF STATUS.PENSJONSTYPE2 = 'F'  THEN                     00005640
                   DATA.EKTEFELLETILLEGG = UFØRPENS.ET;                 00005650
                DATA.BARNETILLEGG          = UFØRPENS.BT;               00005660
                IF UFØRPENS.ÅFT > 0                       THEN          00005670
                   DO;                                                  00005680
                      DATA.HAR_ÅTTE_FEM_TILLEGG = 'J';                  00005690
                      DATA.ÅTTE_FEM_TILLEGG = UFØRPENS.ÅFT;             00005700
                   END;                                                 00005710
                DATA.PENSJONSGRAD     = UFØRPENS.UFG;                   00005720
                DATA.POENGÅR                 = UFØRPENS.PÅ;             00005730
                DATA.SLUTTPOENGTALL = UFØRPENS.SPT * 100;               00005740
                DATA.SLUTTPOENG_MED_OVERKOMP = UFØRPENS.OPT * 100;      00005750
                                                                        00005760
 /* PERSONEN HAR ETTERLATTEPENSJON I TILLEGG TIL UFØREPENSJON      */   00005770
                                                                        00005780
                IF STATUS.PENSJONSTYPE2 = 'E' THEN                      00005790
                   DO;                                                  00005800
                      SSA_UQUAL = 'ETTEPENS ';                          00005810
                      CALL PLITDLI (W02_PARM_CT_4,                      00005820
                                    W02_GET,                            00005830
                                    RF1,                                00005840
                                    ETTEPENS,                           00005850
                                    SSA_UQUAL);                         00005860
                      IF RF1.STATUS_KODE = '  ' !                       00005870
                         RF1.STATUS_KODE = 'GK' THEN                    00005880
                         DO;                                            00005890
                            IF ETTEPENS.GP_BRUTTO > 0       THEN        00005900
                               DO;                                      00005910
                                  DATA.GRUNNPENSJON  =                  00005920
                                                ETTEPENS.GP_BRUTTO;     00005930
                                  DATA.NETTO_GRUNNPENSJON =             00005940
                                                ETTEPENS.GP_NETTO;      00005950
                                  DATA.TILLEGGSPENSJON =                00005960
                                                DATA.TILLEGGSPENSJON +  00005970
                                                ETTEPENS.TP_BRUTTO;     00005980
                                  DATA.NETTO_TILLEGGSPENSJON =          00005990
                                           DATA.NETTO_TILLEGGSPENSJON + 00006000
                                           ETTEPENS.TP_NETTO;           00006010
                                  DATA.SÆRTILLEGG   = ETTEPENS.ST;      00006020
                                  IF ETTEPENS.PÅ_AVD > 0 THEN           00006030
                                     DO;                                00006040
                                        IF STATUS.SIVILSTAND = 'E' THEN 00006050
                                           DATA.PROS_AV_AVDØD_TILLEGSP =00006060
                                                                    55; 00006070
                                        ELSE                            00006080
                                           DATA.PROS_AV_AVDØD_TILLEGSP =00006090
                                                   ETTEPENS.TP_PROSENT; 00006100
                                     END;                               00006110
                               END;                                     00006120
                            DATA.ARBEIDSINNTEKT =                       00006130
                                             ETTEPENS.FORVENTET * 100;  00006140
                            DATA.POENGÅR_ETTER_AVDØD = ETTEPENS.PÅ_AVD; 00006150
                            DATA.SLUTTP_ETTER_AVDØD =                   00006160
                                              ETTEPENS.SPT_AVD * 100;   00006170
                            DATA.SLUTTP_MED_OVER_ETTER_AVD =            00006180
                                              ETTEPENS.OPT_AVD * 100;   00006190
                         END;                                           00006200
                                                                        00006210
                      ELSE                                              00006220
                         CALL P100_SKRIV_FEIL                           00006230
                                 ('2',STATUS.PENSJONSTYPE2,SSA_UQUAL);  00006240
                   END;                                                 00006250
             END;                                                       00006260
          ELSE                                                          00006270
             CALL P100_SKRIV_FEIL('1',STATUS.PENSJONSTYPE1,SSA_UQUAL);  00006280
     END P030_BEH_UP;                                                   00006290
                                                                        00006300
                                                                        00006310
 %PAGE;                                                                 00006320
 /*------------------------------------------------------------------*/ 00006330
 /* PERSONEN HAR ETTERLATTEPENSJON ELLER ER ETTERLATT FAMILIE-     */   00006340
 /* PLEIER. ETTERLATTE-SEGMENTET LESES, OG FELTENE FLYTTES OVER I  */   00006350
 /* NOR-RECORDEN.                                                  */   00006360
 /*------------------------------------------------------------------*/ 00006370
 P040_BEH_EP: PROCEDURE;                                                00006380
                                                                        00006390
                                                                        00006400
                                                                        00006410
          SSA_UQUAL = 'ETTEPENS ';                                      00006420
          CALL PLITDLI (W02_PARM_CT_4,                                  00006430
                        W02_GET,                                        00006440
                        RF1,                                            00006450
                        ETTEPENS,                                       00006460
                        SSA_UQUAL);                                     00006470
          IF RF1.STATUS_KODE = '  ' !                                   00006480
             RF1.STATUS_KODE = 'GK' THEN                                00006490
             DO;                                                        00006500
                                                                        00006510
                DATA.GRUNNPENSJON  = ETTEPENS.GP_BRUTTO;                00006520
                DATA.NETTO_GRUNNPENSJON = ETTEPENS.GP_NETTO;            00006530
                DATA.TILLEGGSPENSJON = ETTEPENS.TP_BRUTTO;              00006540
                DATA.NETTO_TILLEGGSPENSJON  = ETTEPENS.TP_NETTO;        00006550
                DATA.SÆRTILLEGG          = ETTEPENS.ST;                 00006560
                DATA.KOMPTILLEGG         = ETTEPENS.KT;                 00006570
                IF ETTEPENS.PÅ_AVD > 0 THEN                             00006580
                   DO;                                                  00006590
                      IF STATUS.SIVILSTAND = 'E' THEN                   00006600
                         DATA.PROS_AV_AVDØD_TILLEGSP = 55;              00006610
                      ELSE                                              00006620
                         DATA.PROS_AV_AVDØD_TILLEGSP =                  00006630
                                                   ETTEPENS.TP_PROSENT; 00006640
                   END;                                                 00006650
                DATA.ARBEIDSINNTEKT = ETTEPENS.FORVENTET * 100;         00006660
                DATA.POENGÅR_ETTER_AVDØD = ETTEPENS.PÅ_AVD;             00006670
                DATA.SLUTTP_ETTER_AVDØD  = ETTEPENS.SPT_AVD * 100;      00006680
                DATA.SLUTTP_MED_OVER_ETTER_AVD = ETTEPENS.OPT_AVD * 100;00006690
             END;                                                       00006700
          ELSE                                                          00006710
             CALL P100_SKRIV_FEIL('1',STATUS.PENSJONSTYPE1,SSA_UQUAL);  00006720
     END P040_BEH_EP;                                                   00006730
                                                                        00006740
                                                                        00006750
 %PAGE;                                                                 00006760
 /*------------------------------------------------------------------*/ 00006770
 /* PERSONEN HAR BARNEPENSJON (EN ELLER BEGGE FORELDRENE DØDE)     */   00006780
 /* BARNEPENS-SEGMENTET LESES, OG FELTENE FLYTTES OVER I           */   00006790
 /* NOR-RECORDEN.                                                  */   00006800
 /*------------------------------------------------------------------*/ 00006810
 P050_BEH_BP: PROCEDURE;                                                00006820
                                                                        00006830
                                                                        00006840
                                                                        00006850
 /*     PERSONEN HAR UFØRE/ATTFØRING I VENTETID PÅ UFØRE I TILLEGG */   00006860
 /*     TIL BARNEPENSJON                                           */   00006870
                                                                        00006880
    DCL W01_STATUS_KODE_UFØR   BIT(1) INIT ('0'B);                      00006890
                                                                        00006900
          IF STATUS.PENSJONSTYPE3 = 'U' !                               00006910
             STATUS.PENSJONSTYPE3 = 'A' THEN                            00006920
             DO;                                                        00006930
                SSA_UQUAL = 'UFØRPENS ';                                00006940
                CALL PLITDLI (W02_PARM_CT_4,                            00006950
                              W02_GET,                                  00006960
                              RF1,                                      00006970
                              UFØRPENS,                                 00006980
                              SSA_UQUAL);                               00006990
                IF RF1.STATUS_KODE = '  ' !                             00007000
                   RF1.STATUS_KODE = 'GK' THEN                          00007010
                   DO;                                                  00007020
                      W01_STATUS_KODE_UFØR = '1'B;                      00007030
                   END;                                                 00007040
                ELSE                                                    00007050
                   DO;                                                  00007060
                      W01_STATUS_KODE_UFØR = '0'B;                      00007070
                      CALL P100_SKRIV_FEIL                              00007080
                           ('3',STATUS.PENSJONSTYPE3,SSA_UQUAL);        00007090
                   END;                                                 00007100
             END;                                                       00007110
                                                                        00007120
          SSA_UQUAL = 'ETTEBARN ';                                      00007130
          CALL PLITDLI (W02_PARM_CT_4,                                  00007140
                        W02_GET,                                        00007150
                        RF1,                                            00007160
                        ETTEBARN,                                       00007170
                        SSA_UQUAL);                                     00007180
          IF RF1.STATUS_KODE = '  ' !                                   00007190
             RF1.STATUS_KODE = 'GK' THEN                                00007200
             DO;                                                        00007210
                W01_PENSJON_ETTER = ETTEBARN.PENSJON_ETTER;             00007220
                DATA.GRUNNPENSJON  = ETTEBARN.GP;                       00007230
                DATA.NETTO_GRUNNPENSJON = ETTEBARN.GP;                  00007240
                IF STATUS.PENSJONSTYPE1 = 'B' THEN                      00007250
                   DO;                                                  00007260
                      DATA.TILLEGGSPENSJON = ETTEBARN.TP;               00007270
                      DATA.NETTO_TILLEGGSPENSJON = ETTEBARN.TP;         00007280
                      DATA.SÆRTILLEGG   = ETTEBARN.ST;                  00007290
                      DATA.KOMPTILLEGG  = ETTEBARN.KT;                  00007300
                   END;                                                 00007310
                IF ETTEBARN.SPT_MOR ^< ETTEBARN.SPT_FAR THEN            00007320
                   DO;                                                  00007330
                      DATA.POENGÅR_ETTER_AVDØD = ETTEBARN.PÅ_MOR;       00007340
                      DATA.SLUTTP_ETTER_AVDØD = ETTEBARN.SPT_MOR * 100; 00007350
                      DATA.SLUTTP_MED_OVER_ETTER_AVD =                  00007360
                                                ETTEBARN.OPT_MOR * 100; 00007370
                   END;                                                 00007380
                ELSE                                                    00007390
                   DO;                                                  00007400
                      DATA.POENGÅR_ETTER_AVDØD = ETTEBARN.PÅ_FAR;       00007410
                      DATA.SLUTTP_ETTER_AVDØD = ETTEBARN.SPT_FAR * 100; 00007420
                      DATA.SLUTTP_MED_OVER_ETTER_AVD =                  00007430
                                                ETTEBARN.OPT_FAR * 100; 00007440
                   END;                                                 00007450
                                                                        00007460
                DATA.BARNEPENSJONS_TYPE =  STATUS.PENSJONSTYPE1;        00007470
                                                                        00007480
                                                                        00007490
                IF (STATUS.PENSJONSTYPE3 = 'U' !                        00007500
                    STATUS.PENSJONSTYPE3 = 'A' ) &                      00007510
                    W01_STATUS_KODE_UFØR = '1'B  THEN                   00007520
                   DO;                                                  00007530
                      DATA.GRUNNPENSJON = UFØRPENS.GP;                  00007540
                      DATA.NETTO_GRUNNPENSJON = UFØRPENS.GP;            00007550
                      DATA.TILLEGGSPENSJON = UFØRPENS.TP;               00007560
                      DATA.NETTO_TILLEGGSPENSJON = UFØRPENS.TP;         00007570
                      DATA.SÆRTILLEGG = UFØRPENS.ST;                    00007580
                      DATA.KOMPTILLEGG = UFØRPENS.KT;                   00007590
                      DATA.PENSJONSGRAD = UFØRPENS.UFG;                 00007600
                   END;                                                 00007610
                                                                        00007620
             END;                                                       00007630
          ELSE                                                          00007640
             CALL P100_SKRIV_FEIL('1',STATUS.PENSJONSTYPE1,SSA_UQUAL);  00007650
     END P050_BEH_BP;                                                   00007660
                                                                        00007670
                                                                        00007680
 %PAGE;                                                                 00007690
 /*------------------------------------------------------------------*/ 00007700
 /* DE TIDLIGERE LESTE TILKNYTNINGENE FLYTTES OVER I RECORDEN,     */   00007710
 /* ETTER AT STATUS FOR DISSE ER LEST.  DENNE PROSEDYREN KALLES    */   00007720
 /* BARE HVIS TIDLIGERE BEHANDLING ER FEILFRI.                     */   00007730
 /*------------------------------------------------------------------*/ 00007740
 P060_BEH_TILKN: PROCEDURE;                                             00007750
                                                                        00007760
                                                                        00007770
          BARN_INDEX = 2;                                               00007780
                                                                        00007790
          DO I = 1 TO 13 WHILE(TILKN.FNR_TILKN(I) > 0);                 00007800
                                                                        00007810
             PKEY = TILKN.FNR_TILKN(I);                                 00007820
                                                                        00007830
             W02_GET = 'GU';                                            00007840
             SSA_UQUAL = 'STATUS   ';                                   00007850
             CALL PLITDLI     (W02_PARM_CT_5,                           00007860
                               W02_GET,                                 00007870
                               RF1,                                     00007880
                               STATUS,                                  00007890
                               SSA1_RF0PERSN,                           00007900
                               SSA_UQUAL);                              00007910
             IF RF1.STATUS_KODE = '  ' !                                00007920
                RF1.STATUS_KODE = 'GA' !                                00007930
                RF1.STATUS_KODE = 'GK' THEN                             00007940
                DO;                                                     00007950
                                                                        00007960
 /*------------------------------------------------------------------*/ 00007970
 /*     TESTER OM DET ER SISTE STATUS SOM ER LEST                    */ 00007980
 /*------------------------------------------------------------------*/ 00007990
                                                                        00008000
                                                                        00008010
                   IF STATUS.STATUS_KODE = 'S' THEN                     00008020
                      DO;                                               00008030
                         SELECT (TILKN.TILKNYTNINGSKODE(I));            00008040
                            WHEN ('L')                                  00008050
                               DO;                                      00008060
                                  FNR_PIC =         TILKN.FNR_TILKN(I); 00008070
                                  DATA.FNR_TAB(BARN_INDEX) =  FNR_PIC;  00008080
                                  DATA.KODE(BARN_INDEX) =               00008090
                                                STATUS.PENSJONSTYPE2;   00008100
                                  BARN_INDEX = BARN_INDEX + 1;          00008110
                               END;                                     00008120
     /* ENDRET 14.03.88 SATISH                              */          00008130
     /*                     WHEN ('Y')                      */          00008140
     /*  HITTIL                                             */          00008150
                            WHEN ('B','N')                              00008160
                               DO;                                      00008170
                                  FNR_PIC =         TILKN.FNR_TILKN(I); 00008180
                                  DATA.FNR_TAB(2) = FNR_PIC;            00008190
                                  DATA.KODE(2) =                        00008200
                                                STATUS.PENSJONSTYPE2;   00008210
                               END;                                     00008220
                            WHEN ('A','D','F','G','U')                  00008230
                               DO;                                      00008240
  /* ENDRET 140388 BF */          IF STATUS.PENSJONSTYPE1 ^= 'L'   THEN 00008250
  /* TIDLIGERE        */             DO;                                00008260
  /* WHEN ('B','N')   */               FNR_PIC =   TILKN.FNR_TILKN(I);  00008270
  /* ER FLYTTET HIT.  */               IF (STATUS.PENSJONSTYPE1 = 'B' ! 00008280
  /* DET STO PÅ FEIL  */                  STATUS.PENSJONSTYPE1 = 'N') & 00008290
  /* PLASS TIDLIGERE. */                  F_KJØNN(FNR_PIC) =            00008300
                                              W01_PENSJON_ETTER  THEN   00008310
                                          DO;                           00008320
                                             DATA.FNR_TAB(1) = FNR_PIC; 00008330
                                             DATA.KODE(1) =             00008340
                                               STATUS.PENSJONSTYPE2;    00008350
                                          END;                          00008360
  /* HIT BF           */               ELSE                             00008370
                                           DO;                          00008380
                                              DATA.FNR_TAB(1) = FNR_PIC;00008390
                                              DATA.KODE(1) =            00008400
                                                STATUS.PENSJONSTYPE1;   00008410
                                              IF STATUS.PENSJONSTYPE2   00008420
                                                           = 'M'  THEN  00008430
                                                 DATA.EK_INNT_OVER_4G = 00008440
                                                                  'J';  00008450
                                              ELSE                      00008460
                                                 IF STATUS.PENSJONSTYPE200008470
                                                           = 'U'  THEN  00008480
                                                    DATA.EK_INNT_OVER_4G00008490
                                                               = 'N';   00008500
                                           END;                         00008510
                                     END;                               00008520
                               END;                                     00008530
                            OTHERWISE;                                  00008540
                         END;                                           00008550
                      END;                                              00008560
                   ELSE                                                 00008570
                      DO;                                               00008580
                         PUT FILE (SYSPRINT) EDIT ('PERSON ',           00008590
                                                   TILKN.FNR_TILKN(I),  00008600
                                                ' MANGLER SISTE STATUS')00008610
                                          (SKIP(2),COL(4),A,P'(11)9',A);00008620
                      END;                                              00008630
                END;                                                    00008640
             ELSE                                                       00008650
                PUT FILE (SYSPRINT) EDIT ('TILKNYTTET PERSON ',         00008660
                                           TILKN.FNR_TILKN(I),          00008670
                                         ' TIL PERSON ',INN_FNR,        00008680
                                         ' MANGLER SISTE STATUS')       00008690
                                         (SKIP(2),COL(4),A,P'(11)9',A,  00008700
                                         P'(11)9',A);                   00008710
          END;                                                          00008720
                                                                        00008730
 /*------------------------------------------------------------------*/ 00008740
 /* DERSOM DET IKKE FINS EKTEFELLE/AVDØD I OVERFØRINGEN, BLIR BARN   */ 00008750
 /* FLYTTET EN POS. NED I TABELLEN.                                  */ 00008760
 /*------------------------------------------------------------------*/ 00008770
                                                                        00008780
          IF DATA.FNR_TAB(1) =  (11)' '    THEN                         00008790
             DO;                                                        00008800
                DO J = 1 TO 12;                                         00008810
                   DATA.FNR_KODE(J) = DATA.FNR_KODE(J + 1);             00008820
                END;                                                    00008830
                DATA.FNR_KODE(13) = '';                                 00008840
             END;                                                       00008850
                                                                        00008860
     END P060_BEH_TILKN;                                                00008870
                                                                        00008880
 %PAGE;                                                                 00008890
 /*------------------------------------------------------------------*/ 00008900
 /* SKRIVER FEILMELDING NÅR FORVENTET SEGMENT IKKE FINNES            */ 00008910
 /*------------------------------------------------------------------*/ 00008920
 P100_SKRIV_FEIL: PROC (P100_PT, P100_PT_INNHOLD, P100_SEGM);           00008930
                                                                        00008940
     DCL  P100_PT             CHAR (1),                                 00008950
          P100_PT_INNHOLD     CHAR (1),                                 00008960
          P100_SEGM           CHAR (9);                                 00008970
                                                                        00008980
          PUT FILE (SYSPRINT) EDIT ('PERSON ', INN_FNR,                 00008990
                                    ' HAR PENSJONSTYPE', P100_PT,       00009000
                                    ' = ', P100_PT_INNHOLD,             00009010
                                    ', MEN MANGLER ', P100_SEGM,        00009020
                                    '-SEGMENTET.')                      00009030
                             (SKIP(2),COL(4),A,P'(11)9',A,A,A,A,A,A,A); 00009040
          INGEN_FEIL = '0'B;                                            00009050
          RETCODE    = 100;                                             00009060
                                                                        00009070
                                                                        00009080
     END P100_SKRIV_FEIL;                                               00009090
                                                                        00009100
                                                                        00009110
 %PAGE;                                                                 00009120
 /*------------------------------------------------------------------*/ 00009130
 /*      E K S T E R N E   P R O S E D Y R E R                       */ 00009140
 /*------------------------------------------------------------------*/ 00009150
                                                                        00009160
 %INCLUDE R0019902;       /*  F_KJØNN                             */    00009170
                                                                        00009180
                                                                        00009190
 END R001NO4;                                                           00009200
