 /*       SIST ENDRET 24/10-97 11.59.54 AV   JDA7339                  */00000000
 /*       SIST ENDRET 25/09-97 10.53.09 AV   HLA7339                  */00000010
 /*       SIST ENDRET 14/08-97 07.30.41 AV   HLA7339                  */00000020
 /*       SIST ENDRET 04/08-97 14.28.03 AV   SPA7339                  */00000030
 /*       SIST ENDRET 11/02-97 13.19.30 AV   JDA7339                  */00000040
 /*       SIST ENDRET 20/09-95 11.38.50 AV   JDA0310                  */00000050
 /*       SIST ENDRET 07/09-94 09.41.05 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 15/03-94 13.51.15 AV   DYBVIK                   */00000070
 /*IDENTIFIKASJON:                                                    */00000080
 /*    R001UE01  -   HOVEDPROGRAM I CICS                              */00000090
 /*    PROGRAMMERER: SATISH - 94                                      */00000100
 /*HENSIKT:                                                           */00000110
 /*    BEHANDLER ENDRINGSBLANKETTEN 'EN'                              */00000120
 /*ENDRING:                                                           */00000130
 /*PROGRAMTILKNYTNING:                                                */00000140
 /*    PROSEDYRENE INCLUDES I BEHANDLINGA AV ENDRINGSBLANKETTER TIL   */00000150
 /*    DET MASKINELLE FOLKETRYGDSYSTEMET.                             */00000160
 /*    ARBEIDSOMRÅDE: P001UE01  (LIGGER I R001.TEST.COPYLIB)          */00000170
 /*BRUK:                                                              */00000180
 R00114:                                                                00000190
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000200
 %PAGE;                                                                 00000210
 %INCLUDE S001UE;    /*  ENDRINGSBLANKETT-1 MAPSETTET   */              00000220
 %PAGE;                                                                 00000230
 %INCLUDE P001UE01;  /*  TRANS-OMR FOR ENDRINGSBLANKETT-1        */     00000240
 %PAGE;                                                                 00000250
 %INCLUDE P0019906;  /*  TRANS-OPPL-OMRÅDE (BASED)        */            00000260
 %PAGE;                                                                 00000270
 %INCLUDE P0019908;  /*  KOM-OMRÅDE (BASED)               */            00000280
 %PAGE;                                                                 00000290
 %INCLUDE P0019910;  /*  STYRINGS-OMRÅDE (BASED)          */            00000300
 %PAGE;                                                                 00000310
 %INCLUDE P0019912;  /*  DIV_OMRÅDE (BASED)      */                     00000320
 %PAGE;                                                                 00000330
 %INCLUDE DFHBMSCA;                                                     00000340
 %PAGE;                                                                 00000350
   DCL                                                                  00000360
      (BMSMAPBR,COMMAREA_PEKER) PTR;                                    00000370
   DCL                                                                  00000380
      (ADDR,UNSPEC,CSTG,ONCODE,VERIFY,SUBSTR) BUILTIN;                  00000390
   DCL                                                                  00000400
      FEIL_FUNNET  BIT (1),                                             00000410
      ONKODE PIC'9999',                                                 00000420
      CURSOR_POS FIXED BIN(15) INIT(-1),                                00000430
      ONK DEF ONKODE CHAR(4),                                           00000440
      FEILKODE       CHAR(4),                                           00000450
      DSNAVN         CHAR(8),                                           00000460
      ANT_FEIL_SKREVET FIXED DEC (3);                                   00000470
 %SKIP(1);                                                              00000480
 %PAGE;                                                                 00000490
      ON ERROR SNAP BEGIN       ;                                       00000500
         ON ERROR SYSTEM        ;                                       00000510
         ONKODE=ONCODE          ;                                       00000520
         FEILKODE = ONK         ;                                       00000530
         DSNAVN   = EIBDS       ;                                       00000540
         GO TO FEILBEH          ;                                       00000550
      END;                                                              00000560
                                                                        00000570
 FEILKODE = 'FEIL'      ;                                               00000580
 DSNAVN   = '        '  ;                                               00000590
                                                                        00000600
                                                                        00000610
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00000620
                                                                        00000630
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00000640
                                                                        00000650
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000660
                                                                        00000670
 IF FRA_CICS THEN                                                       00000680
  DO;                                                                   00000690
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);00000700
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);     00000710
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);  00000720
  END;                                                                  00000730
                                                                        00000740
 IF HENT_FRAM_MAP  THEN                                                 00000750
   DO;                                                                  00000760
     EXEC CICS SEND MAP('S001UE1') MAPSET('S001UE3') MAPONLY            00000770
     SET (BMSMAPBR);                                                    00000780
     ALLOCATE S001UE1O;                                                 00000790
     S001UE1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                     00000800
   END;                                                                 00000810
                                                                        00000820
 RECEIVE_MAP:                                                           00000830
                                                                        00000840
                                                                        00000850
 IF ^HENT_FRAM_MAP THEN                                                 00000860
    DO;                                                                 00000870
       EXEC CICS RECEIVE MAP('S001UE1')                                 00000880
                                    MAPSET('S001UE3') SET(BMSMAPBR);    00000890
       CALL BLANK_EN_MELDNR;                                            00000900
       FEIL_MELD_NR = 0;                                                00000910
    END;                                                                00000920
                                                                        00000930
 IF FUNKSJONSKODEL > 0 THEN                                             00000940
    DO;                                                                 00000950
       FUNKSJONSKODE = FUNKSJONSKODEI;                                  00000960
       EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);            00000970
    END;                                                                00000980
                                                                        00000990
 IF STYRE_KODEL > 0 THEN                                                00001000
    DO;                                                                 00001010
       STYREKODE = STYRE_KODEI;                                         00001020
       TRANSKODE = 'R041';                                              00001030
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00001040
    END;                                                                00001050
                                                                        00001060
                                                                        00001070
                                                                        00001080
 IF STYREKODE ^= 'EN'  &  FRA_CICS THEN                                 00001090
    TRANSKODE = 'R041';                                                 00001100
                                                                        00001110
 ELSE                                                                   00001120
  DO;                                                                   00001130
   TRANS_RETURKODE = TRANSKODE;                                         00001140
                                                                        00001150
   SELECT (TRANSKODE);                                                  00001160
    WHEN('RUE0')                                                        00001170
       DO;                                                              00001180
         CALL BLANK_EN_SØKER;                                           00001190
         CALL BLANK_EN_KAP7;                                            00001200
         CALL BLANK_EN_KAP8;                                            00001210
         CALL BLANK_EN_KAP10;                                           00001220
         CALL BLANK_EN_KAP11;                                           00001230
         CALL BLANK_EN_SPES;                                            00001240
         CALL BLANK_EN_INNTEKT;                                         00001250
         CALL BLANK_EN_MELDNR;                                          00001260
         CALL OVERFØR_EN_SØKER;                                         00001270
         CALL OVERFØR_EN_KAP7;                                          00001280
         CALL OVERFØR_EN_KAP8;                                          00001290
         CALL OVERFØR_EN_KAP10;                                         00001300
         CALL OVERFØR_EN_KAP11;                                         00001310
         CALL OVERFØR_EN_SPES;                                          00001320
         CALL OVERFØR_EN_INNTEKT;                                       00001330
         CALL KONTROLL_EN_SØKER(FEIL_FUNNET);                           00001340
         CALL KONTROLL_EN_KAP7(FEIL_FUNNET);                            00001350
         CALL KONTROLL_EN_KAP8(FEIL_FUNNET);                            00001360
         CALL KONTROLL_EN_KAP10(FEIL_FUNNET);                           00001370
         CALL KONTROLL_EN_KAP11(FEIL_FUNNET);                           00001380
         CALL KONTROLL_EN_SPES(FEIL_FUNNET);                            00001390
       END;                                                             00001400
    WHEN('RUE1')                                                        00001410
       DO;                                                              00001420
         CALL BLANK_EN_MELDNR;                                          00001430
         CALL OVERFØR_EN_SØKER;                                         00001440
         CALL OVERFØR_EN_KAP7;                                          00001450
         CALL OVERFØR_EN_KAP8;                                          00001460
         CALL OVERFØR_EN_KAP10;                                         00001470
         CALL OVERFØR_EN_KAP11;                                         00001480
         CALL OVERFØR_EN_SPES;                                          00001490
         CALL OVERFØR_EN_INNTEKT;                                       00001500
         CALL KONTROLL_EN_SØKER(FEIL_FUNNET);                           00001510
         CALL KONTROLL_EN_KAP7(FEIL_FUNNET);                            00001520
         CALL KONTROLL_EN_KAP8(FEIL_FUNNET);                            00001530
         CALL KONTROLL_EN_KAP10(FEIL_FUNNET);                           00001540
         CALL KONTROLL_EN_KAP11(FEIL_FUNNET);                           00001550
         CALL KONTROLL_EN_SPES(FEIL_FUNNET);                            00001560
       END;                                                             00001570
    OTHERWISE;                                                          00001580
                                                                        00001590
       /* INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER */00001600
                                                                        00001610
   END;                                                                 00001620
                                                                        00001630
 IF FEIL_FUNNET ! HENT_FRAM_MAP ! FRA_UTEN_DIALOG !                     00001640
    TRANS_RETURKODE ^= TRANSKODE THEN                                   00001650
                                                                        00001660
    DO;                                                                 00001670
       IF TRANSKODE = 'RUE0' THEN                                       00001680
          TRANSKODE = 'RUE1';                                           00001690
       CALL BLANK_EN_MAP;                                               00001700
       CALL OVERFØR_ENSØKER_MAP;                                        00001710
       CALL OVERFØR_ENKAP7_MAP;                                         00001720
       CALL OVERFØR_ENKAP8_MAP;                                         00001730
       CALL OVERFØR_ENKAP10_MAP;                                        00001740
       CALL OVERFØR_ENKAP11_MAP;                                        00001750
       CALL OVERFØR_EN_SPES_MAP;                                        00001760
       CALL OVERFØR_EN_INNTEKT_MAP;                                     00001770
                                                                        00001780
      IF HENT_FRAM_MAP THEN                                             00001790
        EXEC CICS SEND MAP('S001UE1') MAPSET('S001UE3')  ERASE CURSOR;  00001800
      ELSE                                                              00001810
        EXEC CICS SEND MAP('S001UE1') MAPSET('S001UE3') ERASEAUP        00001820
                                                    DATAONLY CURSOR;    00001830
      FEIL_MELD_NR  = 666;/* => FEIL_FUNNET ER SATT. */                 00001840
      HENT_FRAM_MAP = '0'B;                                             00001850
                                                                        00001860
      IF  FRA_CICS THEN                                                 00001870
        EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);          00001880
      ELSE                                                              00001890
        GOTO RECEIVE_MAP;                                               00001900
                                                                        00001910
    END;                                                                00001920
                                                                        00001930
   ELSE                                                                 00001940
                                                                        00001950
    DO;                                                                 00001960
                                                                        00001970
      IF TRANSKODE = 'RUE0' THEN                                        00001980
        TRANS_RETURKODE = 'RUE1';                                       00001990
      ELSE                                                              00002000
        TRANS_RETURKODE = TRANSKODE;                                    00002010
      IF  FRA_CICS  THEN                                                00002020
        DO;                                                             00002030
          BLANKETTYPE = STYREKODE;                                      00002040
          TRANSKODE = 'R042';                                           00002050
        END;                                                            00002060
    END;                                                                00002070
  END;                                                                  00002080
                                                                        00002090
  CALL UTGANG;                                                          00002100
                                                                        00002110
  UTGANG: PROC;                                                         00002120
    IF  FRA_CICS THEN                                                   00002130
      EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);             00002140
    ELSE                                                                00002150
      EXEC CICS RETURN;                                                 00002160
  END UTGANG;                                                           00002170
                                                                        00002180
                                                                        00002190
  FEILBEH:                                                              00002200
                                                                        00002210
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00002220
                                                                        00002230
     PROGRAM_ID = 'R0011401';                                           00002240
                                                                        00002250
     S001UE1O.MELDING2O =                                               00002260
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00002270
                                                                        00002280
     S001UE1O.MELDING3O =                                               00002290
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00002300
                                                                        00002310
     S001UE1O.MELDING4O =                                               00002320
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00002330
                                         !! '. DATASETT : ' !! DSNAVN;  00002340
                                                                        00002350
     S001UE1O.MELDING5O =                                               00002360
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00002370
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00002380
                                                                        00002390
     S001UE1O.MELDING6O =                                               00002400
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00002410
                                                                        00002420
                                                                        00002430
     EXEC CICS SEND MAP('S001UE1')                                      00002440
                                                 MAPSET('S001UE3');     00002450
                                                                        00002460
     EXEC CICS RECEIVE MAP('S001UE1')                                   00002470
                                    MAPSET('S001UE3') SET(BMSMAPBR);    00002480
                                                                        00002490
                                                                        00002500
     EXEC CICS SYNCPOINT ROLLBACK;                                      00002510
                                                                        00002520
                                                                        00002530
     TERMINERINGS_IND = 'F';                                            00002540
                                                                        00002550
     TRANSKODE  = 'R041';                                               00002560
                                                                        00002570
     CALL UTGANG;                                                       00002580
                                                                        00002590
  ABEND:                                                                00002600
     EXEC CICS ABEND ABCODE(FEIL);                                      00002610
                                                                        00002620
  PF1:                                                                  00002630
                                                                        00002640
                                                                        00002650
 /* LEGGER UNDERKJENT TRANS UT PÅ VENTEDATABASE HVIS GYLDIG     */      00002660
 /* FNR OG VIRKNINGSDATO,ELLERS FORKASTES TRANSAKSJONEN.        */      00002670
                                                                        00002680
     IF ^(ENS.FNRNR = 1          !                                      00002690
          ENS.FNRNR = 200        !                                      00002700
          ENS.VIRK_DATO_MÅNR = 9 !                                      00002710
          ENS.VIRK_DATO_MÅNR = 200) THEN                                00002720
        DO;                                                             00002730
                                                                        00002740
           IF FØDSNUMMER    = 0   THEN                                  00002750
                                                                        00002760
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER FORKASTET.           */      00002770
                                                                        00002780
              DO;                                                       00002790
                 FEIL_MELD_NR  = 0;                                     00002800
                 S001UE1O.MELDING6O =                                   00002810
                         'REGISTERINGEN ER IKKE AVSLUTTET MED "ENTER"'!!00002820
                         '.TRANSAKSJONEN ER FORKASTET.';                00002830
                                                                        00002840
              END;                                                      00002850
           ELSE                                                         00002860
              DO;                                                       00002870
                                                                        00002880
                 SEARCH_FNR  = TRANS_OPPL_OMR.FØDSNUMMER;               00002890
                 IF FRA_CICS THEN                                       00002900
                    BLANKETTYPE = STYREKODE;                            00002910
                                                                        00002920
                                                                        00002930
                 IF FEIL_MELD_NR = 666 &      /*BLANKETTKONTROLLFEIL*/  00002940
                    ^FRA_MED_DIALOG     THEN  /*IKKE BASEKONTROLLFEIL*/ 00002950
                    FUNKSJONSKODE = 'B';                                00002960
                                                                        00002970
                 EXEC CICS LINK PROGRAM('R0010490') COMMAREA(KOM_OMR);  00002980
                                                                        00002990
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER LAGT UT PÅ VENTEBASE.*/      00003000
                                                                        00003010
                 S001UE1O.MELDING6O =                                   00003020
                         'TRANSAKSJONEN ER LAGT UT PÅ VENTEREGISTER.';  00003030
              END;                                                      00003040
                                                                        00003050
                                                                        00003060
           EXEC CICS SEND MAP('S001UE1') MAPSET('S001UE3')              00003070
                                                           DATAONLY;    00003080
     /* DUMMY SEND-KALL.                              */                00003090
                                                                        00003100
           EXEC CICS SEND MAP('S001UE1')                                00003110
                                                  MAPSET('S001UE3');    00003120
           EXEC CICS DELAY INTERVAL(005);                               00003130
                                                                        00003140
           TERMINERINGS_IND = 'F';                                      00003150
                                                                        00003160
           TRANSKODE  = 'R041';                                         00003170
                                                                        00003180
           CALL UTGANG;                                                 00003190
                                                                        00003200
        END;                                                            00003210
     ELSE                                                               00003220
        DO;                                                             00003230
           TERMINERINGS_IND = 'F';                                      00003240
                                                                        00003250
           TRANSKODE = 'R041';                                          00003260
                                                                        00003270
           S001UE1O.MELDING6O =                                         00003280
                                                                        00003290
   'NB** TRANSAKSJONEN ER FORKASTET P.G.A. UGYLDIG FNR EL. VDATO **NB'; 00003300
                                                                        00003310
           EXEC CICS SEND MAP('S001UE1') MAPSET('S001UE3')              00003320
                                                           DATAONLY;    00003330
     /* DUMMY SEND-KALL.                            */                  00003340
                                                                        00003350
           EXEC CICS SEND MAP('S001UE1')                                00003360
                                    MAPSET('S001UE3');                  00003370
                                                                        00003380
           EXEC CICS DELAY INTERVAL(005);                               00003390
           CALL UTGANG;                                                 00003400
        END;                                                            00003410
                                                                        00003420
                                                                        00003430
  PF2:                                                                  00003440
     TERMINERINGS_IND   = 'F';                                          00003450
                                                                        00003460
     S001UE1O.MELDING6O =                                               00003470
      'NBNBNBNBNB***    TRANSAKSJONEN ER FORKASTET.    ***NBNBNBNBNB';  00003480
                                                                        00003490
     EXEC CICS SEND MAP('S001UE1') MAPSET('S001UE3')                    00003500
                                                      DATAONLY ;        00003510
     /* DUMMY SEND-KALL.                                     */         00003520
                                                                        00003530
     EXEC CICS SEND MAP('S001UE1')                                      00003540
                                    MAPSET('S001UE3');                  00003550
     EXEC CICS DELAY INTERVAL(005);                                     00003560
                                                                        00003570
                                                                        00003580
     TRANSKODE = 'R041';                                                00003590
                                                                        00003600
     CALL UTGANG;                                                       00003610
 /* ================================================================= */00003620
     %INCLUDE R001UE02;  /* BLANK  ARBEIDSOMRÅDE                     */ 00003630
     %INCLUDE R001UE03;  /* KONTROLL AV SØKERDELEN                   */ 00003640
     %INCLUDE R001UE05;  /* KONTROLL AV KAP 7,8,10                   */ 00003650
     %INCLUDE R001UE06;  /* ARBEIDSOMRÅDE -> MAP                     */ 00003660
     %INCLUDE R001UE09;  /* MAP -> ARBEIDSOMRÅDE                     */ 00003670
 /*  %INCLUDE R0019803;     FK_TIDSBEGR_ATTF                         */ 00003680
 /*  %INCLUDE R0019804;     FK_SKJERM_ATTF                           */ 00003690
 /*  %INCLUDE R0019805;     FK_FRYSP_3ÅR_ARB                         */ 00003700
 /*  %INCLUDE R0019806;     FK_FRYSP_TIDSB                           */ 00003710
 /*  %INCLUDE R0019807;     FK_INNT_OVER_2G                          */ 00003720
     %INCLUDE R0019901;  /* TESTER OM DATO ER GYLDIG                 */ 00003730
     %INCLUDE R0019902;  /* FINNE KJØNN                              */ 00003740
     %INCLUDE R0019904;  /* FØDSELSNUMMERKONTROLL                    */ 00003750
     %INCLUDE R0019905;  /* BEREGNER ALDER                           */ 00003760
     %INCLUDE R0019907;  /* TABELLSØKING                             */ 00003770
     %INCLUDE R0019908;  /* DAGENS DATO PLUSS 1                      */ 00003780
     %INCLUDE R0019910;  /* NUMERISK KONTROLL                        */ 00003790
     %INCLUDE R0019912;  /* KONVERTERING CHAR ==> PIC / PIC ==> CHAR */ 00003800
     %INCLUDE R0019913;  /* F_SNU_DATO                               */ 00003810
     %INCLUDE R0019944;  /* SKRIV_FEIL                               */ 00003820
     %INCLUDE R0019964;  /* F_6MDR                                   */ 00003830
 /* ================================================================= */00003840
                                                                        00003850
   END R00114;                                                          00003860
