 /*       SIST ENDRET 20/03-91 13.33.00 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 01/12-89 08.38.22 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 12/05-87 08.33.30 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 07/02-86 09.56.21 AV   FARVIK                   */00000030
 /*       SIST ENDRET 22/10-85 14.59.35 AV   FARVIK                   */00000040
 /*       SIST ENDRET 27/08-85 10.31.19 AV   FARVIK                   */00000050
 /*       SIST ENDRET 18/10-82 16.38.13 AV   PERB                     */00000060
 /* ***************************************************************** */00000070
 /*IDENTIFIKASJON:                                                    */00000080
 /*    R001NB02 PLI                                                   */00000090
 /*    PROGRAMMERER: R.FARVIK, DATA-UTVIKLING AS NOV-90               */00000100
 /*HENSIKT:                                                           */00000110
 /*    R001NB02 INNEHOLDER:                                           */00000120
 /*      PROSEDYRER FOR BLANKING AV EB_TRANS_OMR.                     */00000130
 /*ENDRING:                                                           */00000140
 /*    PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL          */00000150
 /*    FB_TRANS_OMR ER SKILT UT OG LAGT I R0011109. 050587  BRITT     */00000160
 /*PROGRAMTILKNYTNING:                                                */00000170
 /*    PROSEDYRENE INKLUDERES I ALDERSBEHANDLINGA TIL DET             */00000180
 /*    MASKINELLE FOLKETRYGDSYSTEMET.                                 */00000190
 /*    ARBEIDSOMRÅDE: P001NB01  (LIGGER I R001.TEST.COPYLIB)          */00000200
 /*BRUK:                                                              */00000210
 /*    %INCLUDE R001NB02;                                             */00000220
 /*    BLANK_B6_BARN:    BLANKER BARNEDELEN                           */00000230
 /*    BLANK_B6_GEN:     BLANKER GENERELL DEL                         */00000240
 /*    BLANK_B6_AVD:     BLANKER AVDØDES DEL                          */00000250
 /*    BLANK_B6_MELDNR:  SETTER 0 I MELDINGSNUMMERNE                  */00000260
 /* ***************************************************************** */00000270
 %PAGE;                                                                 00000280
 /* ***************************************************************** */00000290
 /*                                                                   */00000300
 /*   PROSEDYREN BLANKER B6_BARNEDELEN I B6_TRANS_OMR I               */00000310
 /*   KOM_OMR FOR SØKNADER ETTERLATTE BARN, EN AV FORELDRENE DØD.     */00000320
 /*                                                                   */00000330
 /* ***************************************************************** */00000340
 %SKIP;                                                                 00000350
  BLANK_B6_BARN:                                                        00000360
    PROC;                                                               00000370
       DCL                                                              00000380
          ANT_BARN                          FIXED BIN (15);             00000390
          B6B.REGDATO                       = 0      ;                  00000400
          B6B.TERMID                        = '    ' ;                  00000410
          DO ANT_BARN                       = 1 TO 10;                  00000420
             B6B.TAB.FNR_BARN(ANT_BARN)     = 0      ;                  00000430
             B6B.TAB.FNR_GML_BARN(ANT_BARN) = 0      ;                  00000440
             B6B.TAB.NAVN_BARN(ANT_BARN)    = (25)' ';                  00000450
             B6B.TAB.TKNR(ANT_BARN)         = 0      ;                  00000460
          END;                                                          00000470
    END BLANK_B6_BARN;                                                  00000480
 %PAGE;                                                                 00000490
 /* ***************************************************************** */00000500
 /*                                                                   */00000510
 /*   PROSEDYREN BLANKER B6_GEN.DELEN I B6_TRANS_OMR I                */00000520
 /*   KOM_OMR FOR ETTERLATTE BARN.                                    */00000530
 /*                                                                   */00000540
 /* ***************************************************************** */00000550
 %SKIP;                                                                 00000560
  BLANK_B6_GEN:                                                         00000570
    PROC;                                                               00000580
       B6B.SPRÅK        = ' ';                                          00000590
       B6B.KT           = ' ';                                          00000600
       B6B.VIRK_DATO_MÅ = 0;                                            00000610
       B6B.BEREG_RED_TT = ' ';                                          00000620
       B6B.TT_REDUSERT   = 0;                                           00000630
       B6B.KONVENSJON    = 0;                                           00000640
       B6B.PENSJONSTRYGDET = ' ';                                       00000650
       B6B.MINST_20ÅR      = ' ';                                       00000660
    END BLANK_B6_GEN;                                                   00000670
 %SKIP;                                                                 00000680
 /* ***************************************************************** */00000690
 /*                                                                   */00000700
 /*   PROSEDYREN BLANKER B6_AVD.DELEN I B6_TRANS_OMR I                */00000710
 /*   KOM_OMR FOR ETTERLATTE BARN.                                    */00000720
 /*                                                                   */00000730
 /* ***************************************************************** */00000740
 %SKIP;                                                                 00000750
  BLANK_B6_AVD:                                                         00000760
    PROC;                                                               00000770
       B6B.FNR_DØD        = 0;                                          00000780
       B6B.FNR_GML_DØD    = 0;                                          00000790
       B6B.NAVN_DØD       = (25)' ';                                    00000800
       B6B.DØDSDATO       = 0;                                          00000810
       B6B.VILKÅR_8_4_3A  = ' ';                                        00000820
       B6B.VP_ÅR_DØD(1)   = 0;                                          00000830
       B6B.VP_ÅR_DØD(2)   = 0;                                          00000840
       B6B.VP_ÅR_DØD(3)   = 0;                                          00000850
       B6B.PI_DØD         = 0;                                          00000860
    END BLANK_B6_AVD;                                                   00000870
 %PAGE;                                                                 00000880
 /* ***************************************************************** */00000890
 /*                                                                   */00000900
 /*   PROSEDYRE FOR Å SETTE 0 MELDINGSNUMMERNE I B6_TRANS_OMR I       */00000910
 /*   KOM_OMR.                                                        */00000920
 /*                                                                   */00000930
 /* ***************************************************************** */00000940
 %SKIP;                                                                 00000950
  BLANK_B6_MELDNR:                                                      00000960
    PROC;                                                               00000970
    DCL                                                                 00000980
       ANT_BARN                           FIXED BIN (15);               00000990
                                                                        00001000
       B6B.REGDATONR                      = 0;                          00001010
       B6B.TERMIDNR                       = 0;                          00001020
       DO ANT_BARN                        = 1 TO 10;                    00001030
          B6B.TAB.FNR_BARNNR(ANT_BARN)    = 0;                          00001040
          B6B.TAB.NAVN_BARNNR(ANT_BARN)   = 0;                          00001050
          B6B.TAB.TKNRNR(ANT_BARN)        = 0;                          00001060
       END;                                                             00001070
 %SKIP;                                                                 00001080
 /*      0 I MELDINGSNUMMERNE I GENERELL DEL                          */00001090
 %SKIP;                                                                 00001100
       B6B.SPRÅKNR        = 0;                                          00001110
       B6B.KTNR           = 0;                                          00001120
       B6B.VIRK_DATO_MÅNR = 0;                                          00001130
       B6B.BEREG_RED_TTNR = 0;                                          00001140
       B6B.TT_REDUSERTNR   = 0;                                         00001150
       B6B.KONVENSJONNR    = 0;                                         00001160
       B6B.PENSJONSTRYGDETNR = 0;                                       00001170
       B6B.MINST_20ÅRNR      = 0;                                       00001180
 %SKIP;                                                                 00001190
 /*      0 I MELDINGSNUMMERNE I DEL OM AVDØD                          */00001200
 %SKIP;                                                                 00001210
       B6B.FNR_DØDNR        = 0;                                        00001220
       B6B.NAVN_DØDNR       = 0;                                        00001230
       B6B.DØDSDATONR       = 0;                                        00001240
       B6B.VILKÅR_8_4_3ANR  = 0;                                        00001250
       B6B.VP_ÅR_DØDNR(1)   = 0;                                        00001260
       B6B.VP_ÅR_DØDNR(2)   = 0;                                        00001270
       B6B.VP_ÅR_DØDNR(3)   = 0;                                        00001280
       B6B.PI_DØDNR         = 0;                                        00001290
  END BLANK_B6_MELDNR;                                                  00001300
