 /*       SIST ENDRET 28/07-97 12.33.59 AV   HLA7339                  */00000000
 /*       SIST ENDRET 14/04-89 13.36.42 AV   HERMAN                   */00000010
 /*       SIST ENDRET 31/03-87 09.41.29 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 14/10-86 10.00.24 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 14/02-84 14.18.38 AV   HERMAN                   */00000040
 /*       SIST ENDRET 30/01-84 11.10.39 AV   OLAV                     */00000050
 /*       SIST ENDRET 08/11-83 13.14.29 AV   OLAV                     */00000060
 /*       SIST ENDRET 08/11-82 11.45.57 AV   FARVIK                   */00000070
 /* ***************************************************************** */00000080
 /*IDENTIFIKASJON:                                                    */00000090
 /*    R0014123 _ BEREGN_APD_OVERGANG_FRA_UP - INTERN PROC I PLI.     */00000100
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982.                          */00000110
 /*HENSIKT:                                                           */00000120
 /*    PROGRAMMET BEREGNER APD VED OVERGANP FRA UP.                 . */00000130
 /*PROGRAMTILKNYTNING:                                                */00000140
 /*    PROGRAMMET BLIR INKLUDERT I OVERLIGGENDE PROGRAM.              */00000150
 /*BRUK:                                                              */00000160
 /*    CALL BEREGN_APD_OVERGANG_FRA_UP;                               */00000170
 /* ***************************************************************** */00000180
 BEREGN_APD_OVERGANG_FRA_UP: PROC;                                      00000190
                                                                        00000200
  DCL                                                                   00000210
    I                    FIXED BIN(15),                                 00000220
    J                    FIXED BIN(15),                                 00000230
    K               FIXED BIN(15),                                      00000240
    L               FIXED BIN(15),                                      00000250
    UFG                  FIXED DEC(3),                                  00000260
    UFT                  FIXED DEC(5),                                  00000270
    W_APD_UP             FIXED DEC(3);                                  00000280
                                                                        00000290
    /*0697 HL:*/                                                        00000300
    DO K = 7 TO 1 BY -1 UNTIL   (B02.UFØRHIST.UFT_ÅM                    00000310
                               (BER_SØ_IND,K) > 0);                     00000320
      UFT =  B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,K);                         00000330
      I = K;                                                            00000340
    END;                                                                00000350
                                                                        00000360
    IF B02.UFØRHIST.UFØRGRAD.UFG_ØVRIGE(BER_SØ_IND,I,1) = 0 THEN        00000370
     UFG = B02.UFØRHIST.UFG(BER_SØ_IND,I);                              00000380
    ELSE                                                                00000390
    /*0697 HL:*/                                                        00000400
     DO L = 7 TO 1 BY -1 UNTIL (B02.UFØRHIST.UFØRGRAD.UFG_ØVRIGE        00000410
                                (BER_SØ_IND,I,L) > 0);                  00000420
        UFG = B02.UFØRHIST.UFØRGRAD.UFG_ØVRIGE(BER_SØ_IND,I,L);         00000430
      END;                                                              00000440
                                                                        00000450
    IF UFT > 7212 THEN                                                  00000460
      DO;                                                               00000470
        IF UFT < 7307 THEN                                              00000480
          DO;                                                           00000490
 /*YS*/     IF UFG < 51 THEN                                            00000500
              W_APD_UP = 50;                                            00000510
                                                                        00000520
 /*         ELSE IF UFG < 76 THEN ** FEIL-RETTET 6.10.86 HL */          00000530
            ELSE IF UFG < 70 THEN  /* SE FRAPP 409 */                   00000540
              W_APD_UP = 75;                                            00000550
                                                                        00000560
            ELSE                                                        00000570
              W_APD_UP = 100;                                           00000580
          END;                                                          00000590
                                                                        00000600
 /*YS*/ ELSE IF UFG < 51 THEN               /* UFT > 7306  */           00000610
          W_APD_UP = 50;                                                00000620
                                                                        00000630
        ELSE IF UFG < 76 THEN                                           00000640
          W_APD_UP = 75;                                                00000650
                                                                        00000660
        ELSE                                                            00000670
          W_APD_UP = 100;                                               00000680
      END;                                                              00000690
                                                                        00000700
 /*YS*/   ELSE IF UFG < 51 THEN           /* UFT < 7301  */             00000710
      W_APD_UP = 50;                                                    00000720
                                                                        00000730
    ELSE IF UFG < 66 THEN                                               00000740
      W_APD_UP = 75;                                                    00000750
                                                                        00000760
    ELSE                                                                00000770
      W_APD_UP = 100;                                                   00000780
                                                                        00000790
 /* ENDRING 14.2.84 HL ********/                                        00000800
                                                                        00000810
 IF B02.ALDERSP.APD(BER_SØ_IND) < W_APD_UP               THEN           00000820
                                                                        00000830
 /* HIT                ********/                                        00000840
                                                                        00000850
    DO;                                                                 00000860
       B02.ALDERSP.APD       (BER_SØ_IND) = W_APD_UP;                   00000870
       B02.ALDERSP.KONV_GRAD (BER_SØ_IND) = W_APD_UP;                   00000880
       B02.ALDERSP.UTTAKS_APD(BER_SØ_IND) = W_APD_UP;                   00000890
       B02.ALDERSP.P67_KODE  (BER_SØ_IND) = '2';    /* KONVERTERING */  00000900
       B02.ALDERSP.UTTAKSDATO_ÅM(BER_SØ_IND) =                          00000910
                  B02.STATUS.VIRK_DATO_ÅM(BER_SØ_IND);                  00000920
    END;                                                                00000930
                                                                        00000940
 /* TILLEGG 14.2.84 HL. */                                              00000950
                                                                        00000960
 ELSE                                                                   00000970
                                                                        00000980
    IF B02.ALDERSP.KONV_GRAD (BER_SØ_IND) < W_APD_UP     THEN           00000990
       B02.ALDERSP.KONV_GRAD (BER_SØ_IND) = W_APD_UP;                   00001000
                                                                        00001010
 /* HIT                 */                                              00001020
                                                                        00001030
 END BEREGN_APD_OVERGANG_FRA_UP;                                        00001040
