 /*       SIST ENDRET 29/08-97 12.33.34 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/08-97 10.09.26 AV   SPA7339                  */00000010
 /*       SIST ENDRET 06/10-94 09.17.18 AV   TSB0310                  */00000020
 /*       SIST ENDRET 25/02-94 13.10.12 AV   HERMAN                   */00000030
 /*       SIST ENDRET 13/12-91 12.48.29 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 06/03-91 14.08.20 AV   DYBVIK                   */00000050
 /* ***************************************************************** */00000060
 /*NY  VERSJON AV ETTELATT EKTEFELLE   E3                             */00000070
 /* ***************************************************************** */00000080
 R001N8:                                                                00000090
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000100
 %PAGE;                                                                 00000110
 %INCLUDE S001N8;    /*  ETTERLATT EKTEFELLE-MAPSETTET   */             00000120
 %PAGE;                                                                 00000130
 %INCLUDE S00120;    /*  YRKESSKADE-MAPSETTET   */             /*YS*/   00000140
 %PAGE;                                                                 00000150
 %INCLUDE P001N801;  /*  TRANS_OMR FOR ETTERLATTEPENSJON       */       00000160
 %PAGE;                                                                 00000170
 %INCLUDE P0019903;  /*  STATSBORGERTABELLEN            */              00000180
 %PAGE;                                                                 00000190
 %INCLUDE P0019906;  /*  TRANS_OPPL_OMRÅDE (BASED)    */                00000200
 %PAGE;                                                                 00000210
 %INCLUDE P0019908;  /*  KOM-OMRÅDE (BASED)           */                00000220
 %PAGE;                                                                 00000230
 %INCLUDE P0019910;  /*  STYRINGS_OMRÅDE (BASED)      */                00000240
 %PAGE;                                                                 00000250
 %INCLUDE P0019912;  /*  DIV_OMRÅDE (BASED)      */                     00000260
 %PAGE;                                                                 00000270
 %INCLUDE DFHBMSCA;                                                     00000280
 %PAGE;                                                                 00000290
   DCL                                                                  00000300
      (BMSMAPBR,COMMAREA_PEKER)             PTR;                        00000310
   DCL                                                                  00000320
      (UNSPEC, DATE,ADDR,CSTG,ONCODE,VERIFY,SUBSTR) BUILTIN;            00000330
   DCL                                                                  00000340
      FEIL_FUNNET                           BIT (1),                    00000350
      ONKODE                                PIC'9999',                  00000360
      CURSOR_POS                            FIXED BIN(15) INIT(-1),     00000370
      ONK DEF ONKODE                        CHAR(4),                    00000380
      FEILKODE                              CHAR(4),                    00000390
      DSNAVN                                CHAR(8),                    00000400
      ANT_FEIL_SKREVET                      FIXED DEC (3);              00000410
   DCL                                                                  00000420
      TYPE                                  CHAR(1),                    00000430
      DATO                                  PIC'(6)9';                  00000440
  DCL                                                                   00000450
      1 DAGENS_DATO DEF DATO,                                           00000460
        2 DAG           PIC'99',                                        00000470
        2 MND           PIC'99',                                        00000480
        2 AAR           PIC'99';                                        00000490
                                                                        00000500
                                                                        00000510
 %PAGE;                                                                 00000520
      ON ERROR SNAP BEGIN;                                              00000530
         ON ERROR SYSTEM;                                               00000540
         ONKODE = ONCODE;                                               00000550
         FEILKODE = ONK;                                                00000560
         DSNAVN   = EIBRCODE;                                           00000570
         GO TO  FEILBEH ;                                               00000580
      END;                                                              00000590
                                                                        00000600
 FEILKODE   = 'FEIL'    ;                                               00000610
 DSNAVN     = '        ';                                               00000620
                                                                        00000630
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00000640
                                                                        00000650
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00000660
                                                                        00000670
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000680
 DATO                                 = DATE;                           00000690
                                                                        00000700
 IF FRA_CICS THEN                                                       00000710
  DO;                                                                   00000720
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);00000730
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);     00000740
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);  00000750
  END;                                                                  00000760
                                                                        00000770
 IF HENT_FRAM_MAP  THEN                                                 00000780
    DO;                                                                 00000790
       EXEC CICS SEND MAP('S001N81') MAPSET('S001N83') MAPONLY          00000800
       SET (BMSMAPBR);                                                  00000810
       ALLOCATE S001N81O;                                               00000820
       S001N81O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                  00000830
    END;                                                                00000840
                                                                        00000850
 RECEIVE_MAP:                                                           00000860
                                                                        00000870
 IF ^HENT_FRAM_MAP THEN                                                 00000880
    DO;                                                                 00000890
                                                                        00000900
 /*YS*/IF TRANSKODE ^= 'RN85'  THEN                                     00000910
          EXEC CICS RECEIVE MAP('S001N81')                              00000920
                                    MAPSET('S001N83') SET(BMSMAPBR);    00000930
 /*YS*/ELSE                                                             00000940
 /*YS*/   EXEC CICS RECEIVE MAP('S001201')                              00000950
 /*YS*/                             MAPSET('S001203') SET(BMSMAPBR);    00000960
                                                                        00000970
       CALL BLANK_E3_MELDNR;                                            00000980
 /*YS*/CALL BLANK_E3Y_MELDNR;                                           00000990
       FEIL_MELD_NR = 0;                                                00001000
                                                                        00001010
    END;                                                                00001020
                                                                        00001030
 IF TRANSKODE = 'RN85' THEN                                  /*YS*/     00001040
    DO;                                                      /*YS*/     00001050
                                                                        00001060
 /*YS*/IF S001201I.FUNKSJONSKODEL > 0 THEN                              00001070
 /*YS*/   DO;                                                           00001080
 /*YS*/      FUNKSJONSKODE = S001201I.FUNKSJONSKODEI;                   00001090
 /*YS*/      EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);      00001100
 /*YS*/   END;                                                          00001110
                                                                        00001120
 /*YS*/IF S001201I.STYRE_KODEL > 0 THEN                                 00001130
 /*YS*/   DO;                                                           00001140
 /*YS*/      STYREKODE = S001201I.STYRE_KODEI;                          00001150
 /*YS*/      TRANSKODE = 'R041';                                        00001160
 /*YS*/      EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);      00001170
          END;                                                          00001180
    END;                                                     /*YS*/     00001190
 ELSE                                                        /*YS*/     00001200
    DO;                                                      /*YS*/     00001210
 /*YS*/IF S001N81I.FUNKSJONSKODEL > 0 THEN                              00001220
          DO;                                                           00001230
 /*YS*/      FUNKSJONSKODE = S001N81I.FUNKSJONSKODEI;                   00001240
             EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);      00001250
          END;                                                          00001260
                                                                        00001270
 /*YS*/IF S001N81I.STYRE_KODEL > 0 THEN                                 00001280
          DO;                                                           00001290
 /*YS*/      STYREKODE = S001N81I.STYRE_KODEI;                          00001300
             TRANSKODE = 'R041';                                        00001310
             EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);      00001320
          END;                                                          00001330
    END;                                                     /*YS*/     00001340
                                                                        00001350
 IF STYREKODE ^= 'E3'  &  FRA_CICS THEN                                 00001360
    TRANSKODE  = 'R041';                                                00001370
 ELSE                                                                   00001380
    DO;                                                                 00001390
       TRANS_RETURKODE = TRANSKODE;                                     00001400
                                                                        00001410
   SELECT (TRANSKODE);                                                  00001420
    WHEN('RN80')                                                        00001430
       DO;                                                              00001440
          CALL BLANK_E3_SØKER;                                          00001450
          CALL BLANK_E3_SPES_SØKER;                                     00001460
          CALL BLANK_E3_SPES_AVDØDE;                                    00001470
          CALL BLANK_E3_MELDNR;                                         00001480
 /*YS*/   CALL BLANK_Y3_ETTERL;                                         00001490
 /*YS*/   CALL BLANK_E3Y_MELDNR;                                        00001500
          CALL OVERFØR_E3_SØKER;                                        00001510
          CALL KONTROLL_E3_SØKER(FEIL_FUNNET);                          00001520
       END;                                                             00001530
    WHEN('RN81')                                                        00001540
       DO;                                                              00001550
         CALL BLANK_E3_MELDNR;                                          00001560
         IF FUNKSJONSKODE ^= 'V' THEN                                   00001570
            DO;                                                         00001580
               CALL BLANK_E3_SPES_SØKER;                                00001590
               CALL BLANK_E3_SPES_AVDØDE;                               00001600
            END;                                                        00001610
         CALL OVERFØR_E3_SØKER;                                         00001620
         CALL KONTROLL_E3_SØKER(FEIL_FUNNET);                           00001630
       END;                                                             00001640
    WHEN('RN82')                                                        00001650
       /* SØKER: BOSATT = N, AVDØDE: BOSATT ^= N  */                    00001660
       DO;                                                              00001670
         CALL BLANK_E3_MELDNR;                                          00001680
         CALL BLANK_E3_SPES_AVDØDE;                                     00001690
         CALL OVERFØR_E3_SØKER;                                         00001700
         CALL OVERFØR_E3_SPES_SØKER;                                    00001710
         CALL KONTROLL_E3_SØKER(FEIL_FUNNET);                           00001720
         IF E3S.NORSK_BOSATT = 'J' THEN                                 00001730
            CALL BLANK_E3_SPES_SØKER;                                   00001740
         ELSE                                                           00001750
            CALL KONTROLL_E3_SPES(FEIL_FUNNET);                         00001760
       END;                                                             00001770
    WHEN('RN83')                                                        00001780
       DO;                                                              00001790
       /* SØKER: BOSATT = J, AVDØDE: BOSATT = N  */                     00001800
          CALL BLANK_E3_MELDNR;                                         00001810
          CALL BLANK_E3_SPES_SØKER;                                     00001820
          CALL OVERFØR_E3_SØKER;                                        00001830
          CALL OVERFØR_E3_SPES_AVDØDE;                                  00001840
          CALL KONTROLL_E3_SØKER(FEIL_FUNNET);                          00001850
          IF E3S.NORSK_BOSATT_EK = 'J' !                                00001860
             E3S.NORSK_BOSATT_EK = ' ' THEN                             00001870
             CALL BLANK_E3_SPES_AVDØDE;                                 00001880
          ELSE                                                          00001890
             CALL KONTROLL_E3_SPES_EK(FEIL_FUNNET);                     00001900
       END;                                                             00001910
    WHEN('RN84')                                                        00001920
       DO;                                                              00001930
       /* SØKER: BOSATT = N, AVDØDE: BOSATT = N  */                     00001940
          CALL BLANK_E3_MELDNR;                                         00001950
          CALL OVERFØR_E3_SØKER;                                        00001960
          CALL OVERFØR_E3_SPES_SØKER;                                   00001970
          CALL OVERFØR_E3_SPES_AVDØDE;                                  00001980
          CALL KONTROLL_E3_SØKER(FEIL_FUNNET);                          00001990
          IF E3S.NORSK_BOSATT = 'J' THEN                                00002000
             CALL BLANK_E3_SPES_SØKER;                                  00002010
          ELSE                                                          00002020
             CALL KONTROLL_E3_SPES(FEIL_FUNNET);                        00002030
          IF E3S.NORSK_BOSATT_EK = 'J' !                                00002040
             E3S.NORSK_BOSATT_EK = ' ' THEN                             00002050
             CALL BLANK_E3_SPES_AVDØDE;                                 00002060
          ELSE                                                          00002070
             CALL KONTROLL_E3_SPES_EK(FEIL_FUNNET);                     00002080
       END;                                                             00002090
    WHEN('RN85')                                                /*YS*/  00002100
 /*YS*/DO;                                                              00002110
 /*YS*/   CALL BLANK_E3_MELDNR;                                         00002120
 /*YS*/   CALL BLANK_E3Y_MELDNR;                                        00002130
 /*YS*/   CALL OVERFØR_Y3_SØKER;                                        00002140
 /*YS*/   CALL KONTROLL_E3_YRKESSKADE(FEIL_FUNNET);                     00002150
 /*YS*/END;                                                             00002160
    OTHERWISE;                                                          00002170
       /* INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER */00002180
 END;                                                                   00002190
                                                                        00002200
    IF E3S.NORSK_BOSATT = 'N' & ^FEIL_FUNNET THEN                       00002210
       DO;                                                              00002220
          TRANSKODE              = 'RN82';                              00002230
          IF E3S.NORSK_BOSATT_EK = 'N' THEN                             00002240
             TRANSKODE           = 'RN84';                              00002250
       END;                                                             00002260
    ELSE                                                                00002270
       IF E3S.NORSK_BOSATT_EK    = 'N' & ^FEIL_FUNNET THEN              00002280
          TRANSKODE              = 'RN83';                              00002290
                                                                        00002300
    IF (TRANSKODE = 'RN82' ! TRANSKODE = 'RN83' ! TRANSKODE = 'RN84') & 00002310
       E3S.NORSK_BOSATT = 'J' & (E3S.NORSK_BOSATT_EK = 'J' !            00002320
       E3S.NORSK_BOSATT_EK  = ' ') THEN                                 00002330
       TRANSKODE        = 'RN81';                                       00002340
    ELSE                                                                00002350
       IF (TRANSKODE = 'RN83' ! TRANSKODE = 'RN84') &                   00002360
          E3S.NORSK_BOSATT = 'N' & (E3S.NORSK_BOSATT_EK = 'J' !         00002370
          E3S.NORSK_BOSATT_EK = ' ') THEN                               00002380
          TRANSKODE = 'RN82';                                           00002390
       ELSE                                                             00002400
          IF (TRANSKODE = 'RN82' ! TRANSKODE = 'RN84') &                00002410
             E3S.NORSK_BOSATT = 'J' & E3S.NORSK_BOSATT_EK = 'N' THEN    00002420
             TRANSKODE = 'RN83';                                        00002430
          ELSE                                                          00002440
             IF (TRANSKODE = 'RN82' ! TRANSKODE = 'RN83') &             00002450
                E3S.NORSK_BOSATT = 'N' & E3S.NORSK_BOSATT_EK = 'N' THEN 00002460
                TRANSKODE = 'RN84';                                     00002470
                                                                        00002480
 /*YS*/ IF TRANS_RETURKODE = 'RN85' THEN                                00002490
 /*YS*/    TRANSKODE       = 'RN85';                                    00002500
                                                                        00002510
 IF FEIL_FUNNET ! HENT_FRAM_MAP ! FRA_UTEN_DIALOG !                     00002520
    TRANS_RETURKODE ^= TRANSKODE THEN                                   00002530
    DO;                                                                 00002540
                                                                        00002550
 /*YS*/IF TRANSKODE ^= 'RN85'  THEN                                     00002560
 /*YS*/   DO;                                                           00002570
             IF TRANSKODE = 'RN80' THEN                                 00002580
                TRANSKODE = 'RN81';                                     00002590
             CALL BLANK_E3_MAP;                                         00002600
             CALL OVERFØR_E3SØKER_MAP;                                  00002610
 /*YS*/   END;                                                          00002620
                                                                        00002630
       SELECT (TRANSKODE);                                              00002640
          WHEN ('RN81')                                                 00002650
             DO;                                                        00002660
                CALL FJERN_TEKST_SPES_SØKER;                            00002670
                CALL FJERN_TEKST_SPES_AVDØDE;                           00002680
                CALL BLOKKERE_E3SPES_SØKER;                             00002690
                CALL BLOKKERE_E3SPES_AVDØDE;                            00002700
             END;                                                       00002710
          WHEN ('RN82')                                                 00002720
             DO;                                                        00002730
                CALL TEKST_SPES_SØKER;                                  00002740
                CALL OVERFØR_E3SPES_SØKER_MAP;                          00002750
                CALL FJERN_TEKST_SPES_AVDØDE;                           00002760
                CALL BLOKKERE_E3SPES_AVDØDE;                            00002770
             END;                                                       00002780
          WHEN ('RN83')                                                 00002790
             DO;                                                        00002800
                CALL TEKST_SPES_AVDØDE;                                 00002810
                CALL OVERFØR_E3SPES_AVDØDE_MAP;                         00002820
                CALL FJERN_TEKST_SPES_SØKER;                            00002830
                CALL BLOKKERE_E3SPES_SØKER;                             00002840
             END;                                                       00002850
          WHEN ('RN84')                                                 00002860
             DO;                                                        00002870
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00002880
                CALL TEKST_SPES_SØKER;                                  00002890
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00002900
                CALL TEKST_SPES_AVDØDE;                                 00002910
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00002920
                CALL OVERFØR_E3SPES_SØKER_MAP;                          00002930
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00002940
                CALL OVERFØR_E3SPES_AVDØDE_MAP;                         00002950
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00002960
             END;                                                       00002970
 /*YS*/   WHEN ('RN85')                                                 00002980
 /*YS*/      DO;                                                        00002990
 /*YS*/         CALL BLANK_Y3_MAP;                                      00003000
 /*YS*/         CALL OVERFØR_E3Y_MAP;                                   00003010
 /*YS*/      END;                                                       00003020
          OTHERWISE;                                                    00003030
       END;                                                             00003040
                                                                        00003050
      IF HENT_FRAM_MAP THEN                                             00003060
 /*YS*/  IF TRANSKODE ^= 'RN85' THEN                                    00003070
            EXEC CICS SEND MAP('S001N81') MAPSET('S001N83')             00003080
                                          ERASE CURSOR;                 00003090
 /*YS*/  ELSE                                                           00003100
 /*YS*/     EXEC CICS SEND MAP('S001201') MAPSET('S001203')             00003110
 /*YS*/                                   ERASE CURSOR;                 00003120
      ELSE                                                              00003130
 /*YS*/  IF TRANSKODE ^= 'RN85' THEN                                    00003140
            EXEC CICS SEND MAP('S001N81') MAPSET('S001N83') ERASEAUP    00003150
                                                DATAONLY CURSOR;        00003160
 /*YS*/  ELSE                                                           00003170
            EXEC CICS SEND MAP('S001201') MAPSET('S001203') ERASEAUP    00003180
                                                DATAONLY CURSOR;        00003190
      FEIL_MELD_NR  = 666;/* => FEIL_FUNNET ER SATT. */                 00003200
      HENT_FRAM_MAP = '0'B;                                             00003210
                                                                        00003220
      IF  FRA_CICS THEN                                                 00003230
         EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);         00003240
      ELSE                                                              00003250
         GOTO RECEIVE_MAP;                                              00003260
    END;                                                                00003270
   ELSE                                                                 00003280
      DO;                                                               00003290
                                                                        00003300
 /*YS*/  /*------------------------------------------------------*/     00003310
 /*YS*/  /* KONTROLLEN FOR ETTERLATT-EKTEFELLE-BILDET ER FERDIG. */     00003320
 /*YS*/  /* DERSOM DET ER YRKESSKADE PREUTFYLLES YRKESSKADE-     */     00003330
 /*YS*/  /* BILDET OG SENDES UT.                                 */     00003340
 /*YS*/  /*------------------------------------------------------*/     00003350
                                                                        00003360
 /*YS*/  IF TRANSKODE          ^= 'RN85' &                              00003370
 /*YS*/     E3S.YSKADE_TILLEGG  = 'J'    THEN                           00003380
 /*YS*/     DO;                                                         00003390
                                                                        00003400
 /*YS*/        ALLOCATE S001201O;                                       00003410
               S001201O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00003420
 /*YS*/        S001201O.FNRO    = F_FELT_PIC_CHAR11(E3S.FNR_EK);        00003430
 /*YS*/        S001201O.TKNRO   = F_FELT_PIC_CHAR4(E3S.TKNR);           00003440
 /*YS*/        S001201O.NAVNO   = E3S.NAVN_EK;                          00003450
 /*YS*/        S001201O.VIRK_DATOO =                                    00003460
 /*YS*/                           F_FELT_PIC_CHAR4(E3S.VIRK_DATO_MÅ);   00003470
                                                                        00003480
 /*YS*/        IF E3S.SIVILSTAND = 'U' THEN                             00003490
 /*YS*/           S001201O.FNR_SAMBOERO =                               00003500
 /*YS*/                           F_FELT_PIC_CHAR11(E3S.FNR);           00003510
 /*YS*/        ELSE                                                     00003520
 /*YS*/           S001201O.FNR_EKO =                                    00003530
 /*YS*/                           F_FELT_PIC_CHAR11(E3S.FNR);           00003540
                                                                        00003550
 /*YS*/        /*----------------------------------------------------*/ 00003560
 /*YS*/        /* OVERFØRER DATA TIL MAP HVIS VENTETRANS-BEHANDLING  */ 00003570
 /*YS*/        /*----------------------------------------------------*/ 00003580
                                                                        00003590
 /*YS*/        IF FUNKSJONSKODE     = 'V'      THEN                     00003600
 /*YS*/           CALL OVERFØR_E3Y_MAP;                                 00003610
                                                                        00003620
 /*YS*/        EXEC CICS SEND MAP('S001201') MAPSET('S001203') ERASE;   00003630
                                                                        00003640
 /*YS*/        TRANSKODE     = 'RN85';                                  00003650
 /*YS*/        HENT_FRAM_MAP = '0'B;                                    00003660
                                                                        00003670
 /*YS*/        IF FRA_CICS                     THEN                     00003680
 /*YS*/           EXEC CICS RETURN TRANSID(TRANSKODE)                   00003690
 /*YS*/                            COMMAREA(KOM_OMR);                   00003700
 /*YS*/        ELSE                                                     00003710
 /*YS*/           GOTO RECEIVE_MAP;                                     00003720
 /*YS*/     END;                                                        00003730
                                                                        00003740
                                                                        00003750
         IF TRANSKODE       = 'RN80' THEN                               00003760
            TRANS_RETURKODE = 'RN81';                                   00003770
         ELSE                                                           00003780
            TRANS_RETURKODE = TRANSKODE;                                00003790
         IF  FRA_CICS  THEN                                             00003800
            DO;                                                         00003810
               BLANKETTYPE  = STYREKODE;                                00003820
               TRANSKODE    = 'R042';                                   00003830
            END;                                                        00003840
      END;                                                              00003850
  END;                                                                  00003860
                                                                        00003870
  CALL UTGANG;                                                          00003880
                                                                        00003890
  UTGANG: PROC;                                                         00003900
    IF FRA_CICS THEN                                                    00003910
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00003920
    ELSE                                                                00003930
       EXEC CICS RETURN;                                                00003940
  END UTGANG;                                                           00003950
                                                                        00003960
  FEILBEH:                                                              00003970
                                                                        00003980
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00003990
                                                                        00004000
     PROGRAM_ID = 'R0010801';                                           00004010
                                                                        00004020
     ALLOCATE S001N81O;                                                 00004030
     S001N81O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                    00004040
                                                                        00004050
     S001N81O.MELDING2O =                                               00004060
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00004070
                                                                        00004080
     S001N81O.MELDING3O =                                               00004090
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00004100
                                                                        00004110
     S001N81O.MELDING4O =                                               00004120
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00004130
                                         !! '. DATASETT : ' !! DSNAVN;  00004140
                                                                        00004150
     S001N81O.MELDING5O =                                               00004160
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00004170
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00004180
                                                                        00004190
     S001N81O.MELDING6O =                                               00004200
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00004210
                                                                        00004220
                                                                        00004230
     EXEC CICS SEND MAP('S001N81')                                      00004240
                                                 MAPSET('S001N83');     00004250
                                                                        00004260
     EXEC CICS RECEIVE MAP('S001N81')                                   00004270
                                    MAPSET('S001N83') SET(BMSMAPBR);    00004280
                                                                        00004290
                                                                        00004300
     EXEC CICS SYNCPOINT ROLLBACK;                                      00004310
                                                                        00004320
                                                                        00004330
     TERMINERINGS_IND = 'F';                                            00004340
                                                                        00004350
     TRANSKODE  = 'R041';                                               00004360
                                                                        00004370
     CALL UTGANG;                                                       00004380
                                                                        00004390
  ABEND:                                                                00004400
     EXEC CICS ABEND ABCODE(FEIL);                                      00004410
                                                                        00004420
  PF1:                                                                  00004430
                                                                        00004440
 /* LEGGER UNDERKJENT TRANS UT PÅ VENTEDATABASE HVIS GYLDIG     */      00004450
 /* FNR OG VIRKNINGSDATO,ELLERS FORKASTES TRANSAKSJONEN.        */      00004460
     IF ^(E3S.FNRNR = 1          !                                      00004470
          E3S.FNRNR = 200        !                                      00004480
          E3S.VIRK_DATO_MÅNR = 9 !                                      00004490
          E3S.VIRK_DATO_MÅNR = 200) THEN                                00004500
                                                                        00004510
        DO;                                                             00004520
                                                                        00004530
           IF FØDSNUMMER    = 0   THEN                                  00004540
                                                                        00004550
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER FORKASTET.           */      00004560
                                                                        00004570
              DO;                                                       00004580
                 FEIL_MELD_NR  = 0;                                     00004590
                 S001N81O.MELDING6O =                                   00004600
                         'REGISTERINGEN ER IKKE AVSLUTTET MED "ENTER"'!!00004610
                         '.TRANSAKSJONEN ER FORKASTET.';                00004620
                                                                        00004630
              END;                                                      00004640
           ELSE                                                         00004650
              DO;                                                       00004660
                                                                        00004670
                 SEARCH_FNR  = TRANS_OPPL_OMR.FØDSNUMMER;               00004680
                 IF FRA_CICS THEN                                       00004690
                    BLANKETTYPE = STYREKODE;                            00004700
                                                                        00004710
                                                                        00004720
                 IF FEIL_MELD_NR = 666 &      /*BLANKETTKONTROLLFEIL*/  00004730
                    ^FRA_MED_DIALOG     THEN  /*IKKE BASEKONTROLLFEIL*/ 00004740
                    FUNKSJONSKODE = 'B';                                00004750
                                                                        00004760
                 IF E3S.NORSK_BOSATT = 'N' THEN                         00004770
                    DO;                                                 00004780
                       CALL BLANK_E3_MELDNR;                            00004790
                       CALL OVERFØR_E3SPES_SØKER_MAP;                   00004800
                    END;                                                00004810
                                                                        00004820
                 IF E3S.NORSK_BOSATT_EK = 'N' THEN                      00004830
                    DO;                                                 00004840
                       CALL BLANK_E3_MELDNR;                            00004850
                       CALL OVERFØR_E3SPES_AVDØDE_MAP;                  00004860
                    END;                                                00004870
                                                                        00004880
                 EXEC CICS LINK PROGRAM('R0010490') COMMAREA(KOM_OMR);  00004890
                                                                        00004900
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER LAGT UT PÅ VENTEBASE.*/      00004910
                                                                        00004920
                 S001N81O.MELDING6O =                                   00004930
                         'TRANSAKSJONEN ER LAGT UT PÅ VENTEREGISTER.';  00004940
              END;                                                      00004950
                                                                        00004960
 /*YS*/    IF TRANSKODE ^= 'RN85' THEN                                  00004970
 /*YS*/       DO;                                                       00004980
                                                                        00004990
                 EXEC CICS SEND MAP('S001N81') MAPSET('S001N83')        00005000
                                               DATAONLY;                00005010
                 /* DUMMY SEND-KALL.                              */    00005020
                                                                        00005030
                 EXEC CICS SEND MAP('S001N81') MAPSET('S001N83');       00005040
 /*YS*/       END;                                                      00005050
 /*YS*/    ELSE                                                         00005060
 /*YS*/       DO;                                                       00005070
                                                                        00005080
 /*YS*/          S001201O.YMELDING6O  =  S001N81O.MELDING6O;            00005090
                                                                        00005100
 /*YS*/          EXEC CICS SEND MAP('S001201') MAPSET('S001203')        00005110
 /*YS*/                                        DATAONLY;                00005120
 /*YS*/          /* DUMMY SEND-KALL.                              */    00005130
                                                                        00005140
 /*YS*/          EXEC CICS SEND MAP('S001201') MAPSET('S001203');       00005150
 /*YS*/       END;                                                      00005160
                                                                        00005170
           EXEC CICS DELAY INTERVAL(005);                               00005180
                                                                        00005190
           TERMINERINGS_IND = 'F';                                      00005200
                                                                        00005210
           TRANSKODE  = 'R041';                                         00005220
                                                                        00005230
           CALL UTGANG;                                                 00005240
                                                                        00005250
        END;                                                            00005260
     ELSE                                                               00005270
        DO;                                                             00005280
           TERMINERINGS_IND = 'F';                                      00005290
                                                                        00005300
           TRANSKODE = 'R041';                                          00005310
                                                                        00005320
           S001N81O.MELDING6O =                                         00005330
   'NB** TRANSAKSJONEN ER FORKASTET P.G.A. UGYLDIG FNR EL. VDATO **NB'; 00005340
                                                                        00005350
                                                                        00005360
 /*YS*/    IF TRANSKODE ^= 'RN85'  THEN                                 00005370
 /*YS*/       DO;                                                       00005380
                 EXEC CICS SEND MAP('S001N81') MAPSET('S001N83')        00005390
                                                           DATAONLY;    00005400
                 /* DUMMY SEND-KALL.                            */      00005410
                                                                        00005420
                 EXEC CICS SEND MAP('S001N81')                          00005430
                                MAPSET('S001N83');                      00005440
 /*YS*/       END;                                                      00005450
 /*YS*/    ELSE                                                         00005460
 /*YS*/       DO;                                                       00005470
 /*YS*/          S001201O.YMELDING6O  =  S001N81O.MELDING6O;            00005480
                                                                        00005490
 /*YS*/          EXEC CICS SEND MAP('S001201') MAPSET('S001203')        00005500
 /*YS*/                                                    DATAONLY;    00005510
 /*YS*/          /* DUMMY SEND-KALL.                            */      00005520
                                                                        00005530
 /*YS*/          EXEC CICS SEND MAP('S001201')                          00005540
 /*YS*/                         MAPSET('S001203');                      00005550
 /*YS*/       END;                                                      00005560
                                                                        00005570
           EXEC CICS DELAY INTERVAL(005);                               00005580
           CALL UTGANG;                                                 00005590
        END;                                                            00005600
                                                                        00005610
                                                                        00005620
  PF2:                                                                  00005630
     TERMINERINGS_IND   = 'F';                                          00005640
                                                                        00005650
     S001N81O.MELDING6O =                                               00005660
      'NBNBNBNBNB***    TRANSAKSJONEN ER FORKASTET.    ***NBNBNBNBNB';  00005670
                                                                        00005680
 /*YS*/IF TRANSKODE ^= 'RN85' THEN                                      00005690
 /*YS*/  DO;                                                            00005700
           EXEC CICS SEND MAP('S001N81') MAPSET('S001N83')              00005710
                                                      DATAONLY ;        00005720
           /* DUMMY SEND-KALL.                              */          00005730
                                                                        00005740
           EXEC CICS SEND MAP('S001N81')                                00005750
                                    MAPSET('S001N83');                  00005760
 /*YS*/  END;                                                           00005770
 /*YS*/ELSE                                                             00005780
 /*YS*/  DO;                                                            00005790
 /*YS*/    S001201O.YMELDING6O  =  S001N81O.MELDING6O;                  00005800
                                                                        00005810
 /*YS*/    EXEC CICS SEND MAP('S001201') MAPSET('S001203')              00005820
 /*YS*/                                               DATAONLY ;        00005830
 /*YS*/    /* DUMMY SEND-KALL.                              */          00005840
                                                                        00005850
 /*YS*/    EXEC CICS SEND MAP('S001201')                                00005860
 /*YS*/                             MAPSET('S001203');                  00005870
 /*YS*/  END;                                                           00005880
                                                                        00005890
     EXEC CICS DELAY INTERVAL(005);                                     00005900
                                                                        00005910
                                                                        00005920
     TRANSKODE = 'R041';                                                00005930
                                                                        00005940
     CALL UTGANG;                                                       00005950
                                                                        00005960
                                                                        00005970
 %PAGE;                                                                 00005980
      %INCLUDE R001N802;               /* BLANK ARBEIDSOMRÅDE */        00005990
 %PAGE;                                                                 00006000
      %INCLUDE R001N803;               /* KONTROLL AV SØKERDELEN */     00006010
 %PAGE;                                                                 00006020
      %INCLUDE R001N805;               /* KONTROLL AV SPESIELLE         00006030
                                       OPPLYSNINGER SØKER OG AVDØDE */  00006040
 %PAGE;                                                                 00006050
      %INCLUDE R001N806;               /* ARBEIDSOMRÅDE -> MAP */       00006060
 %PAGE;                                                                 00006070
      %INCLUDE R001N807;               /* FORTEKTSTER OG ATTRIBUTTER    00006080
                                       BARN OG SPES.DEL */              00006090
 %PAGE;                                                                 00006100
      %INCLUDE R001N809;               /* MAP -> ARBEIDSOMRÅDE */       00006110
 %PAGE;                                                                 00006120
      %INCLUDE R0010608;               /* BEREGN TT UF */               00006130
 %PAGE;                                                                 00006140
      %INCLUDE R0019901;               /*  TESTER OM DATO ER GYLDIG */  00006150
 %PAGE;                                                                 00006160
      %INCLUDE R0019902;               /*  FINNE KJØNN     */           00006170
 %PAGE;                                                                 00006180
      %INCLUDE R0019903;               /* EKTEFELLES ALDER GYLDIG */    00006190
 %PAGE;                                                                 00006200
      %INCLUDE R0019904;               /* FØDSELSNUMMERKONTROLL */      00006210
 %PAGE;                                                                 00006220
      %INCLUDE R0019905;               /* BEREGNER ALDER */             00006230
 %PAGE;                                                                 00006240
      %INCLUDE R0019907;               /* TABELLSØKING */               00006250
 %PAGE;                                                                 00006260
      %INCLUDE R0019908;               /* DAGENS DATO PLUSS 1 */        00006270
 %PAGE;                                                                 00006280
      %INCLUDE R0019910;               /* NUMERISK KONTROLL */          00006290
 %PAGE;                                                                 00006300
      %INCLUDE R0019911;               /*  DATO KONTROLL  */            00006310
 %PAGE;                                                                 00006320
      %INCLUDE R0019912;  /* KONVERTERING CHAR ==> PIC / PIC ==> CHAR */00006330
 %PAGE;                                                                 00006340
      %INCLUDE R0019913;               /* F_SNU_DATO      */            00006350
 %PAGE;                                                                 00006360
      %INCLUDE R0019944;               /* SKRIV_FEIL      */            00006370
 %PAGE;                                                                 00006380
      %INCLUDE R0019953;               /* DAGENS DATO + 40 DAGER */     00006390
 %PAGE;                                                      /*YS*/     00006400
      %INCLUDE R0019963;               /* SKRIV_FEIL_YP   */ /*YS*/     00006410
   END R001N8;                                                          00006420
