 /*       SIST ENDRET 25/06-96 12.59.37 AV   JDA0310                  */00000000
 /*       SIST ENDRET 22/05-90 10.06.15 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 12/05-87 09.20.08 AV   DYBVIK                   */00000020
 R00117:                                                                00000030
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000040
 %PAGE;                                                                 00000050
 %INCLUDE S00117;    /*  OPPHØRSBLANKETT-2 MAPSETTET                  */00000060
 %PAGE;                                                                 00000070
 %INCLUDE P0011701;  /*  TRANS-OMR FOR OPPHØRSBLANKETT-2              */00000080
 %PAGE;                                                                 00000090
 %INCLUDE P0019906;  /*  TRANS-OPPL-OMRÅDE (BASED)                    */00000100
 %PAGE;                                                                 00000110
 %INCLUDE P0019908;  /*  KOM-OMRÅDE (BASED)                           */00000120
 %PAGE;                                                                 00000130
 %INCLUDE P0019910;  /*  STYRINGS-OMRÅDE (BASED)                      */00000140
 %PAGE;                                                                 00000150
 %INCLUDE P0019912;  /*  DIV_OMRÅDE (BASED)                           */00000160
 %PAGE;                                                                 00000170
 %INCLUDE DFHBMSCA;                                                     00000180
 %PAGE;                                                                 00000190
   DCL                                                                  00000200
      (BMSMAPBR,COMMAREA_PEKER)        PTR;                             00000210
   DCL                                                                  00000220
      (ADDR,UNSPEC,CSTG,ONCODE,VERIFY,SUBSTR) BUILTIN;                  00000230
   DCL                                                                  00000240
      FEIL_FUNNET                      BIT (1),                         00000250
      ONKODE                           PIC'9999',                       00000260
      CURSOR_POS                       FIXED BIN(15) INIT(-1),          00000270
      ONK DEF ONKODE                   CHAR(4),                         00000280
      FEILKODE                         CHAR(4),                         00000290
      DSNAVN                           CHAR(8),                         00000300
      ANT_FEIL_SKREVET                 FIXED DEC(3);                    00000310
 %SKIP(1);                                                              00000320
 %PAGE;                                                                 00000330
      ON ERROR SNAP BEGIN;                                              00000340
         ON ERROR SYSTEM;                                               00000350
         ONKODE=ONCODE;                                                 00000360
         FEILKODE = ONK         ;                                       00000370
         DSNAVN = EIBDS         ;                                       00000380
         GO TO FEILBEH          ;                                       00000390
      END;                                                              00000400
                                                                        00000410
 FEILKODE   = 'FEIL';                                                   00000420
 DSNAVN     = '        ';                                               00000430
                                                                        00000440
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00000450
                                                                        00000460
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00000470
                                                                        00000480
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000490
                                                                        00000500
 IF FRA_CICS THEN                                                       00000510
  DO;                                                                   00000520
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);00000530
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);     00000540
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);  00000550
  END;                                                                  00000560
                                                                        00000570
 IF HENT_FRAM_MAP  THEN                                                 00000580
    DO;                                                                 00000590
       EXEC CICS SEND MAP('S001171') MAPSET('S001173') MAPONLY          00000600
                                                         SET (BMSMAPBR);00000610
       ALLOCATE S001171O;                                               00000620
   END;                                                                 00000630
                                                                        00000640
 RECEIVE_MAP:                                                           00000650
 EXEC CICS ENTER TRACEID(17) FROM (TRANS_OPPL_OMR.TRANSKODE);           00000660
 EXEC CICS ENTER TRACEID(18) FROM (TRANS_OPPL_OMR.BLANKETTYPE);         00000670
                                                                        00000680
                                                                        00000690
 IF ^HENT_FRAM_MAP THEN                                                 00000700
    DO;                                                                 00000710
       EXEC CICS RECEIVE MAP('S001171')                                 00000720
                                    MAPSET('S001173') SET(BMSMAPBR);    00000730
       CALL BLANK_O2_MELDNR;                                            00000740
       FEIL_MELD_NR = 0;                                                00000750
    END;                                                                00000760
                                                                        00000770
 IF FUNKSJONSKODEL > 0 THEN                                             00000780
    DO;                                                                 00000790
       FUNKSJONSKODE = FUNKSJONSKODEI;                                  00000800
       EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);            00000810
    END;                                                                00000820
                                                                        00000830
 IF STYRE_KODEL > 0 THEN                                                00000840
    DO;                                                                 00000850
       STYREKODE = STYRE_KODEI;                                         00000860
       TRANSKODE = 'R041';                                              00000870
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00000880
    END;                                                                00000890
                                                                        00000900
                                                                        00000910
 IF STYREKODE ^= 'O2'  &  FRA_CICS THEN                                 00000920
    TRANSKODE  = 'R041';                                                00000930
 ELSE                                                                   00000940
    DO;                                                                 00000950
       TRANS_RETURKODE = TRANSKODE;                                     00000960
                                                                        00000970
   SELECT (TRANSKODE);                                                  00000980
    WHEN('R170')                                                        00000990
       DO;                                                              00001000
          CALL BLANK_O2_OPPHØR;                                         00001010
          CALL BLANK_O2_MELDNR;                                         00001020
          CALL OVERFØR_O2_OPPHØR;                                       00001030
          CALL KONTROLL_O2(FEIL_FUNNET);                                00001040
       END;                                                             00001050
    WHEN('R171')                                                        00001060
       DO;                                                              00001070
          CALL BLANK_O2_MELDNR;                                         00001080
          CALL OVERFØR_O2_OPPHØR;                                       00001090
          CALL KONTROLL_O2(FEIL_FUNNET);                                00001100
       END;                                                             00001110
    OTHERWISE                                                           00001120
        ;                                                               00001130
 /* INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER       */00001140
                                                                        00001150
   END;                                                                 00001160
                                                                        00001170
 IF FEIL_FUNNET ! HENT_FRAM_MAP ! FRA_UTEN_DIALOG !                     00001180
                                       TRANS_RETURKODE ^= TRANSKODE THEN00001190
    DO;                                                                 00001200
       IF TRANSKODE = 'R170' THEN                                       00001210
          TRANSKODE = 'R171';                                           00001220
       CALL BLANK_O2_MAP;                                               00001230
       CALL OVERFØR_O2_MAP;                                             00001240
                                                                        00001250
      IF HENT_FRAM_MAP THEN                                             00001260
         EXEC CICS SEND MAP('S001171') MAPSET('S001173') ERASE CURSOR;  00001270
      ELSE                                                              00001280
         EXEC CICS SEND MAP('S001171') MAPSET('S001173') ERASEAUP       00001290
                                                        DATAONLY CURSOR;00001300
      FEIL_MELD_NR  = 666;/* => FEIL_FUNNET ER SATT. */                 00001310
      HENT_FRAM_MAP = '0'B;                                             00001320
                                                                        00001330
      IF FRA_CICS THEN                                                  00001340
         EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);         00001350
      ELSE                                                              00001360
         GOTO RECEIVE_MAP;                                              00001370
    END;                                                                00001380
  ELSE                                                                  00001390
    DO;                                                                 00001400
       IF TRANSKODE       = 'R170' THEN                                 00001410
          TRANS_RETURKODE = 'R171';                                     00001420
       ELSE                                                             00001430
          TRANS_RETURKODE = TRANSKODE;                                  00001440
       IF FRA_CICS  THEN                                                00001450
          DO;                                                           00001460
             BLANKETTYPE  = STYREKODE;                                  00001470
             TRANSKODE    = 'R042';                                     00001480
          END;                                                          00001490
    END;                                                                00001500
  END;                                                                  00001510
                                                                        00001520
  CALL UTGANG;                                                          00001530
                                                                        00001540
  UTGANG: PROC;                                                         00001550
 EXEC CICS ENTER TRACEID(19) FROM (TRANS_OPPL_OMR.TRANSKODE);           00001560
 EXEC CICS ENTER TRACEID(20) FROM (TRANS_OPPL_OMR.BLANKETTYPE);         00001570
    IF FRA_CICS THEN                                                    00001580
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00001590
    ELSE                                                                00001600
      EXEC CICS RETURN;                                                 00001610
  END UTGANG;                                                           00001620
                                                                        00001630
                                                                        00001640
  FEILBEH:                                                              00001650
                                                                        00001660
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00001670
                                                                        00001680
     PROGRAM_ID = 'R0011701';                                           00001690
                                                                        00001700
     S001171O.MELDING2O =                                               00001710
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00001720
                                                                        00001730
     S001171O.MELDING3O =                                               00001740
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00001750
                                                                        00001760
     S001171O.MELDING4O =                                               00001770
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00001780
                                         !! '. DATASETT : ' !! DSNAVN;  00001790
                                                                        00001800
     S001171O.MELDING5O =                                               00001810
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00001820
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00001830
                                                                        00001840
     S001171O.MELDING6O =                                               00001850
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00001860
                                                                        00001870
                                                                        00001880
     EXEC CICS SEND MAP('S001171')                                      00001890
                                        MAPSET('S001173');              00001900
                                                                        00001910
     EXEC CICS RECEIVE MAP('S001171')                                   00001920
                                    MAPSET('S001173') SET(BMSMAPBR);    00001930
                                                                        00001940
                                                                        00001950
     EXEC CICS SYNCPOINT ROLLBACK;                                      00001960
                                                                        00001970
                                                                        00001980
     TERMINERINGS_IND = 'F';                                            00001990
                                                                        00002000
     TRANSKODE  = 'R041';                                               00002010
                                                                        00002020
     CALL UTGANG;                                                       00002030
                                                                        00002040
  ABEND:                                                                00002050
     EXEC CICS ABEND ABCODE(FEIL);                                      00002060
                                                                        00002070
  PF1:                                                                  00002080
                                                                        00002090
 /* LEGGER UNDERKJENT TRANS UT PÅ VENTEDATABASE HVIS GYLDIG     */      00002100
 /* FNR OG VIRKNINGSDATO,ELLERS FORKASTES TRANSAKSJONEN.        */      00002110
                                                                        00002120
     IF ^(O2.FNRNR = 1          !                                       00002130
          O2.FNRNR = 200        !                                       00002140
          O2.VIRK_DATO_MÅNR = 9 !                                       00002150
          O2.VIRK_DATO_MÅNR = 200) THEN                                 00002160
        DO;                                                             00002170
                                                                        00002180
           IF FØDSNUMMER    = 0   THEN                                  00002190
                                                                        00002200
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER FORKASTET.           */      00002210
                                                                        00002220
              DO;                                                       00002230
                 FEIL_MELD_NR  = 0;                                     00002240
                 S001171O.MELDING6O =                                   00002250
                         'REGISTERINGEN ER IKKE AVSLUTTET MED "ENTER"'!!00002260
                         '.TRANSAKSJONEN ER FORKASTET.';                00002270
                                                                        00002280
              END;                                                      00002290
           ELSE                                                         00002300
              DO;                                                       00002310
                                                                        00002320
                 SEARCH_FNR  = TRANS_OPPL_OMR.FØDSNUMMER;               00002330
                 IF FRA_CICS THEN                                       00002340
                    BLANKETTYPE = STYREKODE;                            00002350
                                                                        00002360
                                                                        00002370
                 IF FEIL_MELD_NR = 666 &      /*BLANKETTKONTROLLFEIL*/  00002380
                    ^FRA_MED_DIALOG     THEN  /*IKKE BASEKONTROLLFEIL*/ 00002390
                    FUNKSJONSKODE = 'B';                                00002400
                                                                        00002410
                 EXEC CICS LINK PROGRAM('R0010490') COMMAREA(KOM_OMR);  00002420
                                                                        00002430
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER LAGT UT PÅ VENTEBASE.*/      00002440
                                                                        00002450
                 S001171O.MELDING6O =                                   00002460
                         'TRANSAKSJONEN ER LAGT UT PÅ VENTEREGISTER.';  00002470
              END;                                                      00002480
                                                                        00002490
                                                                        00002500
           EXEC CICS SEND MAP('S001171') MAPSET('S001173')              00002510
                                                           DATAONLY;    00002520
     /* DUMMY SEND-KALL.                              */                00002530
                                                                        00002540
           EXEC CICS SEND MAP('S001171')                                00002550
                                                  MAPSET('S001173');    00002560
           EXEC CICS DELAY INTERVAL(005);                               00002570
                                                                        00002580
           TERMINERINGS_IND = 'F';                                      00002590
                                                                        00002600
           TRANSKODE  = 'R041';                                         00002610
                                                                        00002620
           CALL UTGANG;                                                 00002630
                                                                        00002640
        END;                                                            00002650
     ELSE                                                               00002660
        DO;                                                             00002670
           TERMINERINGS_IND = 'F';                                      00002680
                                                                        00002690
           TRANSKODE = 'R041';                                          00002700
                                                                        00002710
           S001171O.MELDING6O =                                         00002720
                                                                        00002730
   'NB** TRANSAKSJONEN ER FORKASTET P.G.A. UGYLDIG FNR EL. VDATO **NB'; 00002740
                                                                        00002750
           EXEC CICS SEND MAP('S001171') MAPSET('S001173')              00002760
                                                           DATAONLY;    00002770
     /* DUMMY SEND-KALL.                            */                  00002780
                                                                        00002790
           EXEC CICS SEND MAP('S001171')                                00002800
                                    MAPSET('S001173');                  00002810
                                                                        00002820
           EXEC CICS DELAY INTERVAL(005);                               00002830
           CALL UTGANG;                                                 00002840
        END;                                                            00002850
                                                                        00002860
                                                                        00002870
  PF2:                                                                  00002880
     TERMINERINGS_IND   = 'F';                                          00002890
                                                                        00002900
     S001171O.MELDING6O =                                               00002910
      'NBNBNBNBNB***    TRANSAKSJONEN ER FORKASTET.    ***NBNBNBNBNB';  00002920
                                                                        00002930
     EXEC CICS SEND MAP('S001171') MAPSET('S001173')                    00002940
                                                      DATAONLY ;        00002950
     /* DUMMY SEND-KALL.                                     */         00002960
                                                                        00002970
     EXEC CICS SEND MAP('S001171')                                      00002980
                                    MAPSET('S001173');                  00002990
     EXEC CICS DELAY INTERVAL(005);                                     00003000
                                                                        00003010
                                                                        00003020
     TRANSKODE = 'R041';                                                00003030
           CALL UTGANG;                                                 00003040
                                                                        00003050
 %PAGE;                                                                 00003060
 %INCLUDE R0011702;  /* BLANK  ARBEIDSOMRÅDE                          */00003070
 %PAGE;                                                                 00003080
 %INCLUDE R0011703;  /* KONTROLL AVSØKERDELEN                         */00003090
 %PAGE;                                                                 00003100
 %INCLUDE R0011706;  /* ARBEIDSOMRÅDE -> MAP                          */00003110
 %PAGE;                                                                 00003120
 %INCLUDE R0011709;  /* MAP -> ARBEIDSOMRÅDE                          */00003130
 %PAGE;                                                                 00003140
 %INCLUDE R0019901;  /* DATO_MÅ KONTROLL                              */00003150
 %PAGE;                                                                 00003160
 %INCLUDE R0019904;  /* FØDSELSNUMMERKONTROLL                         */00003170
 %PAGE;                                                                 00003180
 %INCLUDE R0019908;  /* DAGENS DATO PLUSS 1                           */00003190
 %PAGE;                                                                 00003200
 %INCLUDE R0019910;  /* NUMERISK KONTROLL                             */00003210
 %PAGE;                                                                 00003220
 %INCLUDE R0019912;  /* KONVERTERING CHAR ==> PIC / PIC ==> CHAR      */00003230
 %PAGE;                                                                 00003240
 %INCLUDE R0019964;  /* F_6MÅNEDER                                    */00003250
 %PAGE;                                                                 00003260
 %INCLUDE R0019944;  /* SKRIV_FEIL                                    */00003270
                                                                        00003280
  END R00117;                                                           00003290
