 /*       SIST ENDRET 21/06-93 10.52.36 AV   HERMAN                   */00000000
 /*       SIST ENDRET 17/07-92 13.47.41 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 13/12-91 12.34.06 AV   DYBVIK                   */00000020
 /*********************************************************************/00000030
 /* IDENTIFIKASJON:                                                   */00000040
 /*    R0016053 - INCLUDEMODUL                                        */00000050
 /*    LAGET:     BJØRG, DESEMBER 91                                  */00000060
 /* HENSIKT:                                                          */00000070
 /*    EKSTRA-TEST PÅ OM APOPPL-SEGMENT SKAL DANNES - PGA. AT RF-SYST.*/00000080
 /*    IKKE REGNER APD, MÅ VI I VISSE TILFELLER SAMMENLIGNE UTREGNET  */00000090
 /*    APD I B01 OG B02.                                              */00000100
 /* PROGRAMTILKNYTNING:                                               */00000110
 /*    LOKAL PROSEDYRE I R0016001                                     */00000120
 /*********************************************************************/00000130
                                                                        00000140
 F_REGN_APD_B01_B02: PROCEDURE  RETURNS (BIT (1)) ;                     00000150
                                                                        00000160
 DCL (B01_APD,                                                          00000170
      B02_APD)               DEC FIXED (3) ;                            00000180
 DCL  B01_BELØP              DEC FIXED (5) ;                            00000190
 DCL  B02_BELØP              DEC FIXED (5) ;                            00000200
 DCL  ABS                    BUILTIN ;                                  00000210
                                                                        00000220
    B01_BELØP =    B01.PERSON(I).ALDERSP.GP          +                  00000230
                   B01.PERSON(I).ALDERSP.TP          +                  00000240
                   B01.PERSON(I).ALDERSP.ST          +                  00000250
                   B01.PERSON(I).ETTEPENS.TP_BRUTTO  ;                  00000260
                                                                        00000270
    IF B01_BELØP  >  0  THEN                                            00000280
      B01_APD = (((B01.PERSON(I).ALDERSP.AP_GP_NETTO +                  00000290
                   B01.PERSON(I).ALDERSP.AP_TP_NETTO +                  00000300
                   B01.PERSON(I).ALDERSP.ST          +                  00000310
                   B01.PERSON(I).ETTEPENS.TP_NETTO ) /                  00000320
                   B01_BELØP                         ) * 100 ) + 0.5 ;  00000330
    ELSE                                                                00000340
      B01_APD =    0 ;                                                  00000350
                                                                        00000360
                                                                        00000370
    B02_BELØP =    B02.PERSON(I).ALDERSP.GP          +                  00000380
                   B02.PERSON(I).ALDERSP.TP          +                  00000390
                   B02.PERSON(I).ALDERSP.ST          +                  00000400
                   B02.PERSON(I).ETTEPENS.TP_BRUTTO  ;                  00000410
                                                                        00000420
    IF B02_BELØP  >  0  THEN                                            00000430
      B02_APD = (((B02.PERSON(I).ALDERSP.AP_GP_NETTO +                  00000440
                   B02.PERSON(I).ALDERSP.AP_TP_NETTO +                  00000450
                   B02.PERSON(I).ALDERSP.ST          +                  00000460
                   B02.PERSON(I).ETTEPENS.TP_NETTO ) /                  00000470
                   B02_BELØP                         ) * 100 ) + 0.5 ;  00000480
    ELSE                                                                00000490
      B02_APD =    0 ;                                                  00000500
                                                                        00000510
    RETURN (ABS (B01_APD - B02_APD) > 1) ;                              00000520
                                                                        00000530
 END F_REGN_APD_B01_B02 ;                                               00000540
                                                                        00000550
