 /*       SIST ENDRET 05/12-97 13.07.30 AV   JDA7339                  */00000000
 /*       SIST ENDRET 27/11-97 11.46.12 AV   JDA7339                  */00000010
 /*       SIST ENDRET 07/03-97 12.31.16 AV   JDA7339                  */00000020
 /*       SIST ENDRET 05/02-96 12.31.57 AV   JDA0310                  */00000030
 /*       SIST ENDRET 09/01-96 14.40.21 AV   JDA0310                  */00000040
 /*       SIST ENDRET 11/07-94 12.43.37 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 25/02-94 12.51.38 AV   HERMAN                   */00000060
 /* ***************************************************************** */00000070
 /*IDENTIFIKASJON:                                                    */00000080
 /* **********************                                            */00000090
 /*  PROGRAM-IDENT : R001B470 -                          HOVEDPROGRAM */00000100
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000110
 /*  PROGRAMMERER  : PATHAK                                           */00000120
 /*  PROGRAMMET BLE LAGET :      1994                                 */00000130
 /* ***************************************************************** */00000140
 /*HENSIKT:                                                           */00000150
 /* **********                                                        */00000160
 /*  PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETT-MAPENE    */00000170
 /*  DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT PÅ        */00000180
 /*  FORHÅND.                                                         */00000190
 /*                                                                   */00000200
 /* ***************************************************************** */00000210
 /*PROGRAMTILKNYTTING:                                                */00000220
 /* ********************                                              */00000230
 /*  PROGRAMMET ER EN LOGISK DEL AV 0470                              */00000240
 /*    EXEC CICS XCTL PROGRAM ('R001B470') COMMAREA(KOM_OMR);         */00000250
 /*  PROGRAMMET INKLUDERER:                                           */00000260
 /*    R001N506   -   FLYTTER GRBL-A1 FRA ARB.OMR TIL MAP             */00000270
 /*    R001N507   -   FLYTTER GRBL-A1 FORTEKSTER OG ATTRIBUTTER       */00000280
 /*    R001N606   -   FLYTTER GRBL-U2 FRA ARB.OMR TIL MAP             */00000290
 /*    R001N607   -   FLYTTER GRBL-U2 FORTEKSTER OG ATTRIBUTTER       */00000300
 /*    R001N806   -   FLYTTER GRBL-E3 FRA ARB.OMR TIL MAP             */00000310
 /*    R001N807   -   FLYTTER GRBL-E3 FORTEKSTER OG ATTRIBUTTER       */00000320
 /*    R001N906   -   FLYTTER GRBL-E4 FRA ARB.OMR TIL MAP             */00000330
 /*    R001N907   -   FLYTTER GRBL-E4 FORTEKSTER OG ATTRIBUTTER       */00000340
 /*    R001NB06   -   FLYTTER GRBL-B6 FRA ARB.OMR TIL MAP             */00000350
 /*    R001NC06   -   FLYTTER GRBL-F7 FRA ARB.OMR TIL MAP             */00000360
 /*    R001NC07   -   FLYTTER GRBL-F7 FORTEKSTER OG ATTRIBUTTER       */00000370
 /*  INTERNE PROCEDURER:                                              */00000380
 /*    LOW_VALUES_TIL_MAP - HEXA '00' INN I ET OMRÅDE                 */00000390
 /*    SELECT_BLANKETTYPE -                                           */00000400
 /*    A1_PROC            - SKRIVER A1-TRANS SOM BLANKETTRANS         */00000410
 /*    U2_PROC            - SKRIVER U2-TRANS SOM BLANKETTRANS         */00000420
 /*    E3_PROC            - SKRIVER E3-TRANS SOM BLANKETTRANS         */00000430
 /*    E4_PROC            - SKRIVER E4-TRANS SOM BLANKETTRANS         */00000440
 /*    FB_PROC            - SKRIVER FB-TRANS SOM BLANKETTRANS         */00000450
 /*    B6_PROC            - SKRIVER B6-TRANS SOM BLANKETTRANS         */00000460
 /*    F7_PROC            - SKRIVER F7-TRANS SOM BLANKETTRANS         */00000470
 /*  PROGRAMMET BRUKER FØLGENDE MAPSET:                               */00000480
 /*    S001F23:                                                       */00000490
 /*  RETUR TIL PROGRAMMET SOM AKTIVISERTE DETTE SLIK:                 */00000500
 /*    EXEC CICS RETURN;                                              */00000510
 /*                                                                   */00000520
 /* ***************************************************************** */00000530
 /*DATASETTOPPLYSNINGER:                                              */00000540
 /* ***********************                                           */00000550
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000560
 /*                                                                   */00000570
 /* ***************************************************************** */00000580
 /*FEILMELDINGER:                                                     */00000590
 /* *******************                                               */00000600
 /* DET BLIR IKKE SKREVET UT NOEN FEILMELDINGER I PROGRAMMET          */00000610
 /*                                                                   */00000620
 /* ***************************************************************** */00000630
                                                                        00000640
 R001047: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                          00000650
 %PAGE;                                                                 00000660
 %INCLUDE S001F2;    /* MAPPER FOR BLANKETTENE    */                    00000670
 %PAGE;                                                                 00000680
 %INCLUDE P0019906;  /* TRANS-OPPL-OMRÅDE (BASED) */                    00000690
 %PAGE;                                                                 00000700
 %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)        */                    00000710
 %PAGE;                                                                 00000720
 %INCLUDE P0019910;  /* STYRINGS - OMRÅDE (BASED) */                    00000730
 %PAGE;                                                                 00000740
 %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE(BASED)   */                    00000750
 %PAGE;                                                                 00000760
                                                                        00000770
                                                                        00000780
 DCL                                                                    00000790
    QUENAME                CHAR(8),                                     00000800
       QTERMID             CHAR(4) DEF QUENAME POS(1),                  00000810
       REST                CHAR(4) DEF QUENAME POS(5);                  00000820
                                                                        00000830
 DCL                                                                    00000840
    1 ROUTELIST,                                                        00000850
      2 PRINTER,                                                        00000860
        3 TERMID           CHAR(4),                                     00000870
        3 REST             CHAR(12),                                    00000880
      2 SISTE,                                                          00000890
        3 SLUTT            FIXED BIN(15),                               00000900
        3 REST             CHAR(14);                                    00000910
                                                                        00000920
 DCL                                                                    00000930
    CSTG                   BUILTIN,                                     00000940
    LOW                    BUILTIN,                                     00000950
    COMMAREA_PEKER         PTR,                                         00000960
    BMSMAPBR               PTR,                                         00000970
    MAPSET_PTR             PTR,                                         00000980
    I                      FIXED BIN(15),                               00000990
    START                  FIXED BIN(15) INIT(1),                       00001000
    LENGTH                 FIXED BIN(15),                               00001010
    LABEL_Y                LABEL,                                       00001020
    MELDING                CHAR(10) INIT('NOE ER GALT'),                00001030
    LOW_CHAR_BASED         CHAR(1000) BASED(BMSMAPBR),                  00001040
    ADDR                   BUILTIN;                                     00001050
                                                                        00001060
 /*----------------------------------------------------------------*/   00001070
 /* DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE                    */   00001080
 /*----------------------------------------------------------------*/   00001090
                                                                        00001100
 DCL                                                                    00001110
    CURSOR_POS     FIXED BIN  (15)   INIT (-1),                         00001120
    DFHBMUNP             CHAR (1)    INIT (' '),                        00001130
    DFHBMBRY             CHAR (1)    INIT ('H'),                        00001140
    DFHBMASK             CHAR (1)    INIT ('8'),/* H.INT + ASKIP  */    00001150
    FEIL_FUNNET          BIT  (1)    INIT ('1'B),                       00001160
    FORKASTES            BIT  (1)    INIT ('0'B),                       00001170
       W01_FAR_BEHANDLES BIT  (1)    INIT ('0'B),                       00001180
       W01_MOR_BEHANDLES BIT  (1)    INIT ('0'B),                       00001190
    MELDING6O            CHAR (78),                                     00001200
    YMELDING6O           CHAR (78);                                     00001210
                                                                        00001220
                                                                        00001230
         DCL  W01_YSKADE      BIT(1)         INIT  ('0'B);              00001240
         DCL  W01_NORSK_BOSATT     BIT(1)         INIT  ('0'B);         00001250
         DCL  W01_SIDE_ANTALL FIXED BIN(15)  INIT  ( 1  );              00001260
    QTERMID        = EIBTRMID;                                          00001270
    REST           = 'COMA';                                            00001280
    ROUTELIST      = '';                                                00001290
    PRINTER.TERMID = 'R41J';                                            00001300
    SISTE.SLUTT    = -1;                                                00001310
                                                                        00001320
                                                                        00001330
    EXEC CICS LOAD PROGRAM('S001F23') SET(MAPSET_PTR); /* TRANSMAPSET */00001340
    ALLOCATE  LOW_CHAR_BASED;                                           00001350
                                                                        00001360
    EXEC CICS HANDLE CONDITION OVERFLOW(OVERFLOW);                      00001370
                                                                        00001380
                                                                        00001390
    /*---------------------------------------------*/                   00001400
    /*  STYRING FOR OVERFØRINGSMODULENE            */                   00001410
    /*---------------------------------------------*/                   00001420
                                                                        00001430
    DIV_PARAM_OMR.FRA_CICS        = '0'B;                               00001440
    DIV_PARAM_OMR.HENT_FRAM_MAP   = '0'B;                               00001450
    DIV_PARAM_OMR.FRA_UTEN_DIALOG = '1'B;                               00001460
    DIV_PARAM_OMR.FRA_MED_DIALOG  = '0'B;                               00001470
                                                                        00001480
                                                                        00001490
    DO I = 1 TO 2;                                                      00001500
                                                                        00001510
       /*---------------------------------------------*/                00001520
       /* SETTER X'00' I HELE LOW_CHAR_BASED          */                00001530
       /*---------------------------------------------*/                00001540
       /* SKRIVER BLANKETT-TRANSEN PÅ SKJERMEN        */                00001550
       /* ELLER GJØR DEN KLAR TIL UTSKRIVING          */                00001560
       /*---------------------------------------------*/                00001570
                                                                        00001580
       LOW_CHAR_BASED = LOW(1000);                                      00001590
       CALL SELECT_BLANKETTYPE;                                         00001600
                                                                        00001610
       IF ^W01_YSKADE      THEN  DO;   I  =  3;                         00001620
          END;                                                          00001630
       EXEC CICS SEND PAGE RETAIN NOAUTOPAGE;                           00001640
    END;                                                                00001650
                                                                        00001660
    /*-------------------------------------------------------------*/   00001670
    /* AVSLUTTER MED RETURN TIL CICS.                              */   00001680
    /*-------------------------------------------------------------*/   00001690
                                                                        00001700
    EXEC CICS RETURN;                                                   00001710
                                                                        00001720
 OVERFLOW:                                                              00001730
    EXEC CICS SEND  TEXT  FROM (MELDING)ACCUM;                          00001740
    EXEC CICS SEND  PAGE;                                               00001750
    EXEC CICS PURGE MESSAGE;                                            00001760
                                                                        00001770
                                                                        00001780
                                                                        00001790
    /*---------------------------------------------*/                   00001800
    /* BEHANLER AKTUELL BLANKETT                   */                   00001810
    /*---------------------------------------------*/                   00001820
                                                                        00001830
    SELECT_BLANKETTYPE:                                                 00001840
      PROC;                                                             00001850
                                                                        00001860
                                                                        00001870
        SELECT(TRANS_OPPL_OMR.BLANKETTYPE);                             00001880
           WHEN('A1')                                                   00001890
              /* SKRIVER  NY AP-TRANS SOM BLANKETTRANS PÅ SKJERM */     00001900
              CALL A1_PROC;                                             00001910
                                                                        00001920
           WHEN('U2')                                                   00001930
              /* SKRIVER U2-TRANS SOM BLANKETTRANS PÅ SKJERM */         00001940
              CALL U2_PROC;                                             00001950
                                                                        00001960
           WHEN('E3')                                                   00001970
              /* SKRIVER E3-TRANS SOM BLANKETTRANS PÅ SKJERM */         00001980
              CALL E3_PROC;                                             00001990
                                                                        00002000
           WHEN('E4')                                                   00002010
              /* SKRIVER EF-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002020
              CALL E4_PROC;                                             00002030
                                                                        00002040
                                                                        00002050
           WHEN('B6')                                                   00002060
              /* SKRIVER B6-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002070
              CALL B6_PROC;                                             00002080
                                                                        00002090
                                                                        00002100
           WHEN('F7')                                                   00002110
              /* SKRIVER F7-TRANS SOM BLANKETTRANS PÅ SKJERM */         00002120
              CALL F7_PROC;                                             00002130
                                                                        00002140
           OTHERWISE;                                                   00002150
        END;       /*   SELECT     */                                   00002160
                                                                        00002170
                                                                        00002180
        A1_PROC:                                                        00002190
          PROC;                                                         00002200
          %INCLUDE P001N501;   /* TRANS_OMRÅDE AP  */                   00002210
          %INCLUDE R001N506;   /* AP_TRANS_TIL_MAP */                   00002220
          %INCLUDE R001N507;   /* OVERF. FORTEKSTER OG ATTRIBUTTER */   00002230
                                                                        00002240
                                                                        00002250
           /* INTERN PROC I R001N506: OVERFØRING AP-DELEN          */   00002260
                                                                        00002270
           CALL OVERFØR_A1SØKER_MAP;                                    00002280
                                                                        00002290
           IF A1S.BT_ANT > 0 THEN                                       00002300
              DO;                                                       00002310
                                                                        00002320
                 /* INTERN PROC I R001N507: FORTEKSTER OG          */   00002330
                 /*               ATTRIBUTTER I BARNE_DELEN        */   00002340
                                                                        00002350
                 CALL TEKST_BARN_A1;                                    00002360
                                                                        00002370
                 /* INTERN PROC I R001N506: OVERFØRING BARNE-DELEN */   00002380
                                                                        00002390
                 CALL OVERFØR_A1BARN_MAP;                               00002400
              END;                                                      00002410
           S001N51O.DUMMYA = 'Ø';     /* PROT,DARK  */                  00002420
           /*  FREE TRANS_OMR,TRANS_OPPL_OMR   ENDERET SP 13.6.93 */    00002430
                                                                        00002440
           /* SKRIVER SKJERMBILDE GRUNNBLANKETT-APTRANS */              00002450
                                                                        00002460
           EXEC CICS SEND MAP('S001N51') MAPSET('S001F23') ACCUM        00002470
                                                  PAGING   ERASE;       00002480
                                                                        00002490
        END A1_PROC;                                                    00002500
                                                                        00002510
                                                                        00002520
                                                                        00002530
        U2_PROC:                                                        00002540
          PROC;                                                         00002550
          %INCLUDE P001N601;                                            00002560
          %INCLUDE R001N606;                                            00002570
          %INCLUDE R001N607;                                            00002580
                                                                        00002590
           IF ^W01_YSKADE THEN                                          00002600
              DO;                                                       00002610
                 CALL OVERFØR_U2SØKER_MAP;          /* R001N606 */      00002620
                 IF U2S.NORSK_BOSATT = 'N'  THEN                        00002630
                    DO;                                                 00002640
                       CALL TEKST_SPES_U2;          /* R001N607 */      00002650
                       CALL OVERFØR_U2SPES_MAP;     /* R001N606 */      00002660
                    END;                                                00002670
                 IF U2S.BT_ANT > 0 THEN                                 00002680
                    DO;                                                 00002690
                       CALL TEKST_BARN_U2;          /* R001N607 */      00002700
                       CALL OVERFØR_U2BARN_MAP;     /* R001N606 */      00002710
                    END;                                                00002720
                                                                        00002730
                 IF U2S.YSKADE_TILLEGG = 'J' THEN                       00002740
                    DO;                                                 00002750
                       W01_YSKADE = '1'B;                               00002760
                       W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1;           00002770
                    END;                                                00002780
        /*       ELSE                                                   00002790
                 FREE TRANS_OMR,TRANS_OPPL_OMR   ENDERET SP 13.6.93 */  00002800
                                                                        00002810
                 S001N61O.DUMMYA = 'Ø';             /* PROT,DARK  */    00002820
                 EXEC CICS SEND MAP('S001N61') MAPSET('S001F23') ACCUM  00002830
                                                        PAGING ERASE;   00002840
              END;                                                      00002850
           ELSE                                                         00002860
              DO;                                                       00002870
                                                                        00002880
                 CALL OVERFØR_YP_MAP_U2;            /* R001N606 */      00002890
                                                                        00002900
                 W01_YSKADE = '0'B;                                     00002910
                                                                        00002920
                 S001201O.DUMMYA = 'Ø';             /* PROT,DARK  */    00002930
            /*  FREE TRANS_OMR,TRANS_OPPL_OMR   ENDERET SP 13.6.93 */   00002940
                 EXEC CICS SEND MAP('S001201') MAPSET('S001F23') ACCUM  00002950
                                                  PAGING   ERASE;       00002960
                                                                        00002970
              END;                                                      00002980
                                                                        00002990
        END U2_PROC;                                                    00003000
                                                                        00003010
                                                                        00003020
                                                                        00003030
                                                                        00003040
        E3_PROC:                                                        00003050
          PROC;                                                         00003060
          %INCLUDE P001N801;   /* TRANS_OMRÅDE EP  */                   00003070
          %INCLUDE R001N806;   /* EP_TRANS TIL MAP */                   00003080
          %INCLUDE R001N807;   /* OVERF. FORTEKSTER OG ATTRIBUTTER */   00003090
                                                                        00003100
           IF ^W01_YSKADE THEN                                          00003110
              DO;                                                       00003120
                                                                        00003130
                 /* INTERN PROC I R0010806: OVERFØRING E3-DELEN */      00003140
                                                                        00003150
                 CALL OVERFØR_E3SØKER_MAP;                              00003160
                 IF E3S.NORSK_BOSATT = 'N' THEN                         00003170
                    DO;                                                 00003180
                                                                        00003190
                       /* INTERN PROC I R001N807: FORTEKSTER OG    */   00003200
                       /*                   ATTRIBUTTER I SPES-DEL */   00003210
                                                                        00003220
                       CALL TEKST_SPES_SØKER;                           00003230
                                                                        00003240
                       /* INTERN PROC I R001N806: OVERFØRING SPES_DEL */00003250
                                                                        00003260
                       CALL OVERFØR_E3SPES_SØKER_MAP;                   00003270
                    END;                                                00003280
                 IF E3S.NORSK_BOSATT_EK = 'N' THEN                      00003290
                    DO;                                                 00003300
                                                                        00003310
                       /* INTERN PROC I R001N807: FORTEKSTER OG    */   00003320
                       /*  ATTRIBUTTER I SPESIELL DEL AVDØDE       */   00003330
                                                                        00003340
                       CALL TEKST_SPES_AVDØDE;                          00003350
                                                                        00003360
                       /* INTERN PROC I R001N806:                  */   00003370
                       /* OVERFØRING SPES-DEL AVD                  */   00003380
                                                                        00003390
                       CALL OVERFØR_E3SPES_AVDØDE_MAP;                  00003400
                    END;                                                00003410
                 IF E3S.YSKADE_TILLEGG = 'J' THEN                       00003420
                    DO;                                                 00003430
                                                                        00003440
                       W01_YSKADE = '1'B;                               00003450
                       W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1;           00003460
                    END;                                                00003470
                 ELSE                                                   00003480
                    /*  FREE TRANS_OMR,TRANS_OPPL_OMR ;  */             00003490
                                                                        00003500
                 S001N81O.DUMMYA = 'Ø'; /* PROT,DARK */                 00003510
                                                                        00003520
                 /* SKRIVER SKJERMBILDE GRUNNBLANKETT-EPTRANS */        00003530
                                                                        00003540
                 EXEC CICS SEND MAP('S001N81') MAPSET('S001F23') ACCUM  00003550
                                                  PAGING   ERASE;       00003560
              END;                                                      00003570
           ELSE                                                         00003580
              DO;                                                       00003590
                 CALL OVERFØR_E3Y_MAP;             /* R001N806 */       00003600
                                                                        00003610
                 W01_YSKADE     = '0'B;                                 00003620
                                                                        00003630
                 S001201O.DUMMYA = 'Ø';              /* PROT,DARK */    00003640
                 /*  FREE TRANS_OMR,TRANS_OPPL_OMR ;  */                00003650
                 EXEC CICS SEND MAP('S001201') MAPSET('S001F23') ACCUM  00003660
                                               PAGING ERASE;            00003670
              END;                                                      00003680
                                                                        00003690
        END E3_PROC;                                                    00003700
                                                                        00003710
                                                                        00003720
        E4_PROC:                                                        00003730
          PROC;                                                         00003740
          %INCLUDE P001N901;   /* TRANS_OMRÅDE EF  */                   00003750
          %INCLUDE R001N906;   /* EF_TRANS TIL MAP */                   00003760
          %INCLUDE R001N907;   /* OVERF. FORTEKSTER OG ATTRIBUTTER */   00003770
                                                                        00003780
                                                                        00003790
           /* INTERN PROC I R001N906: OVERFØRING EF-DELEN          */   00003800
                                                                        00003810
           CALL OVERFØR_E4SØKER_MAP;                                    00003820
           IF E4S.NORSK_BOSATT = 'N' THEN                               00003830
              DO;                                                       00003840
                                                                        00003850
                 /* INTERN PROC I R0010907: FORTEKSTER OG          */   00003860
                 /*                         ATTRIBUTTER I SPES-DEL */   00003870
                                                                        00003880
                 CALL TEKST_SPES;                                       00003890
                                                                        00003900
                 /* INTERN PROC I R001N906: OVERFØRING SPES_DEL    */   00003910
                                                                        00003920
                 CALL OVERFØR_E4SPES_MAP;                               00003930
              END;                                                      00003940
           S001N91O.DUMMYA = 'Ø';     /* PROT,DARK  */                  00003950
           /*  FREE TRANS_OMR,TRANS_OPPL_OMR ;  */                      00003960
                                                                        00003970
           /* SKRIVER SKJERMBILDE GRUNNBLANKETT-E4TRANS */              00003980
                                                                        00003990
           EXEC CICS SEND MAP('S001N91') MAPSET('S001F23') ACCUM        00004000
                                                  PAGING   ERASE;       00004010
                                                                        00004020
        END E4_PROC;                                                    00004030
                                                                        00004040
                                                                        00004050
        B6_PROC:                                                        00004060
          PROC;                                                         00004070
          %INCLUDE P001NB01;   /* TRANS_OMRÅDE B6-TRANS     */          00004080
                                                                        00004090
                               /* BP_TRANS TIL MAP, OVERF.  */          00004100
          %INCLUDE R001NB06;   /* FORTEKSTER OG ATTRIBUTTER */          00004110
                                                                        00004120
                                                                        00004130
           /* INTERN PROC I R001NB06: OVERFØRING BP_BARNE_DEL      */   00004140
                                                                        00004150
           CALL OVERFØR_B6_MAP;                                         00004160
           S001NB1O.DUMMYA = 'Ø';     /* PROT,DARK  */                  00004170
           /*  FREE TRANS_OMR,TRANS_OPPL_OMR ;  */                      00004180
                                                                        00004190
           /* SKRIVER SKJERMBILDE GRUNNBLANKETT-BPTRANS */              00004200
                                                                        00004210
           EXEC CICS SEND MAP('S001NB1') MAPSET('S001F23') ACCUM        00004220
                                                  PAGING   ERASE;       00004230
                                                                        00004240
        END B6_PROC;                                                    00004250
                                                                        00004260
                                                                        00004270
        F7_PROC:                                                        00004280
          PROC;                                                         00004290
          %INCLUDE P001NC01;/* TRANS_OMRÅDE TIL F7_TRANS */             00004300
          %INCLUDE R001NC06;/* F7_TRANS TIL MAP          */             00004310
          %INCLUDE R001NC07;/* OVERF.FORTEKSTER OG ATTR.B*/             00004320
                                                                        00004330
                                                                        00004340
           /* INTERN PROC I R0011206: OVERFØRING F7_SØKER_DEL      */   00004350
                                                                        00004360
           CALL OVERFØR_F7_SØKER_MAP;                                   00004370
           CALL TEKST_SØKER2;                                           00004380
           CALL OVERFØR_F7_SØKER2_MAP;                                  00004390
           S001NC1O.DUMMYA = 'Ø';     /* PROT,DARK  */                  00004400
           IF TRANS_OMR.F7S.BT_ANT > 0 THEN                             00004410
              DO;                                                       00004420
                                                                        00004430
                 /* INTERN PROC I R001NC07: FORTEKSTER OG          */   00004440
                 /*                         ATTRIBUTTER I BARNEDEL */   00004450
                                                                        00004460
                 CALL TEKST_BARN;                                       00004470
                                                                        00004480
                 /* INTERN PROC I R001NC06: OVERFØRING F7_BARNE_DEL*/   00004490
                                                                        00004500
                 CALL OVERFØR_F7_BARN_MAP;                              00004510
              END;                                                      00004520
                                                                        00004530
           /*  FREE TRANS_OMR,TRANS_OPPL_OMR    */                      00004540
                                                                        00004550
           /* SKRIVER SKJERMBILDE GRUNNBLANKETT-FTTRANS */              00004560
                                                                        00004570
           EXEC CICS SEND MAP('S001NC1') MAPSET('S001F23') ACCUM        00004580
                                                   PAGING  ERASE;       00004590
                                                                        00004600
        END F7_PROC;                                                    00004610
                                                                        00004620
                                                                        00004630
    END SELECT_BLANKETTYPE;                                             00004640
                                                                        00004650
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00004660
      PROC(FIXED_DEC_5);                                                00004670
                                                                        00004680
      DCL                                                               00004690
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00004700
                                                                        00004710
   END SKRIV_FEIL;                                                      00004720
                                                                        00004730
   SKRIV_FEIL_YP:                    /**   DUMMY PROC  **/              00004740
      PROC(FIXED_DEC_5);                                                00004750
                                                                        00004760
      DCL                                                               00004770
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00004780
                                                                        00004790
   END SKRIV_FEIL_YP;                                                   00004800
                                                                        00004810
                                                                        00004820
                                                                        00004830
   %INCLUDE R0019912;  /* PIC TIL CHAR OG MOTSATT */                    00004840
                                                                        00004850
                                                                        00004860
                                                                        00004870
                                                                        00004880
 END R001047;                                                           00004890
