 /*       SIST ENDRET 14/04-89 13.54.24 AV   HERMAN                   */00000000
 /*       SIST ENDRET 12/06-86 14.21.56 AV   HERMAN                   */00000010
 /*       SIST ENDRET 12/07-84 08.53.27 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 04/10-83 14.52.14 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 04/03-83 12.22.31 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 21/01-83 14.27.40 AV   OLSEN                    */00000050
 /* **************************************************************** */ 00000060
 /*IDENTIFIKASJON:                                                   */ 00000070
 /*    R0017049 - PROSEDYRE I PLI                                    */ 00000080
 /*    PROGRAMMERER: JAN DYBVIK JULI 1988                            */ 00000090
 /*HENSIKT:                                                          */ 00000100
 /*    RUTINEN SETTER INN KODER FOR TEKSTTYPE V I TEKSTTABELLEN FOR  */ 00000110
 /*    STØNADSBREV GJELDER KUN KAP.11                                */ 00000120
 /*PROGRAMTILKNYTNING:                                               */ 00000130
 /*    KALLES OPP AV PROGRAM R0017001                                */ 00000140
 /*    INCLUDES I R0017001;                                          */ 00000150
 /*BRUK:                                                             */ 00000160
 /*   CALL YRKE_TEKSTTYPE_V_KODE(IND)                                */ 00000170
 /* **************************************************************** */ 00000180
 %PAGE;                                                                 00000190
 YRKE_TEKSTTYPE_V_KODE:                                                 00000200
   PROC(IND);                                                           00000210
 %PAGE;                                                                 00000220
   DCL                                                                  00000230
      IND                     FIXED BIN (15);                           00000240
                                                                        00000250
   DCL                                                                  00000260
      W_HELP_MÅ               PIC '9999',         /*HL*/                00000270
      W_HELP_M  DEF W_HELP_MÅ POS (1) PIC '99',   /*HL*/                00000280
      W_HELP_Å  DEF W_HELP_MÅ POS (3) PIC '99',   /*HL*/                00000290
      W_VIRK_ÅM               PIC '9999',         /*HL*/                00000300
      W_VIRK_Å  DEF W_VIRK_ÅM POS (1) PIC '99',   /*HL*/                00000310
      W_VIRK_M  DEF W_VIRK_ÅM POS (3) PIC '99',   /*HL*/                00000320
      W_VIRK_ÅM_FIX           FIXED DEC (5);      /*HL*/                00000330
   DCL HUNDREDEL              FIXED DEC (7);                            00000340
                                                                        00000350
                                                                        00000360
 /* ***************************************************************** */00000370
 /* PROGRAMMET STARTER HER                                            */00000380
 /* ***************************************************************** */00000390
                                                                        00000400
   TEKSTTYPE_V_YRKE = '    ';                                           00000410
   W_VIRK_Å                  = W_HELP_Å;                                00000420
   W_VIRK_M                  = W_HELP_M;                                00000430
   W_VIRK_ÅM_FIX             = W_VIRK_ÅM;                               00000440
                                                                        00000450
   IF (B02.PENSJONSTYPE1(IND) = 'Y'           &                         00000460
       B02.PENSJONSTYPE3(IND) = 'A' )         &                         00000470
      (B02.YRKEPENS.YUG(IND) = B02.UFØRPENS.UFG(IND)) THEN              00000480
                                                                        00000490
                TEKSTTYPE_V_YRKE = 'V309';                              00000500
                                                                        00000510
   IF (B01.PENSJONSTYPE1(IND) = 'Y'           &                         00000520
       B02.PENSJONSTYPE1(IND) = 'Y' )         &                         00000530
      (B01.UFØRPENS.UFG(IND) ^= B02.UFØRPENS.UFG(IND)) THEN             00000540
                                                                        00000550
                TEKSTTYPE_V_YRKE = 'V344';                              00000560
                                                                        00000570
                                                                        00000580
                                                                        00000590
   END YRKE_TEKSTTYPE_V_KODE;                                           00000600
