 /*       SIST ENDRET 28/07-94 13.11.20 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 25/02-94 12.23.21 AV   HERMAN                   */00000010
 /*       SIST ENDRET 06/01-93 12.29.44 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 24/02-92 14.49.14 AV   HERMAN                   */00000030
 /*       SIST ENDRET 13/12-91 12.20.01 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 10/10-91 13.57.43 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 26/03-91 13.12.08 AV   HERMAN                   */00000060
 /*       SIST ENDRET 21/01-91 13.49.12 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 16/05-88 12.28.09 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 12/01-88 09.58.21 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 11/11-86 11.28.42 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 19/08-86 09.01.05 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 14/08-86 02.12.59 AV   TRUDE                    */00000120
 /*       SIST ENDRET 15/07-86 08.08.45 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 28/06-84 09.36.53 AV   OLAV                     */00000140
 /*       SIST ENDRET 20/06-84 10.15.22 AV   KARIN                    */00000150
 /*       SIST ENDRET 12/06-84 11.57.02 AV   FARVIK                   */00000160
 /*       SIST ENDRET 04/06-84 08.22.29 AV   FARVIK                   */00000170
 /*       SIST ENDRET 09/09-83 10.14.03 AV   DYBVIK                   */00000180
 /* ***************************************************************** */00000190
 /*IDENTIFIKASJON:                                                    */00000200
 /*    R0011203 - PROSEDYRE I PLI                                     */00000210
 /*    PROGRAMMERER: JAN, AUGUST 1981                                 */00000220
 /*HENSIKT:                                                           */00000230
 /*    PROSEDYREN FORETAR KONTROLL AV DATA FOR FT_SØKER FRA           */00000240
 /*       GRUNNBLANKETT FORSØRGINGSTILLEGG EKTEFELLE OG/ELLER BARN.   */00000250
 /*PROGRAMTILKNYTNING:                                                */00000260
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLING AV FORSØRGINGS-     */00000270
 /*       TILLEG EKTEFELLE OG/ELLER BARN.                             */00000280
 /*    INCLUDES I  R0011201.                                          */00000290
 /*BRUK:                                                              */00000300
 /* CALL KONRTOLL_FT_SØKER(FEIL_I_FT_SØKER);                          */00000310
 /* ***************************************************************** */00000320
 /*ENDRING:                                                           */00000330
 /* NAVN EKTEFELLE ER FJERNET FRA MAPEN, OG KONTROLLENE I FORBINDELSE */00000340
 /* MED FELTET ER FJERNET.                       161287 BRITT         */00000350
 /*                                                                   */00000360
 /*ENDRET: 13.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000370
 /* ******                                                            */00000380
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000390
 /*    OM FNR ER ENDRET (R0019906).                                   */00000400
 /* ***************************************************************** */00000410
 /*                                                                   */00000420
 /*   MODULEN KONTROLLERER FT_SØKER, OG RETURNERER                    */00000430
 /*   MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG              */00000440
 /*                                                                   */00000450
 /* ***************************************************************** */00000460
 %SKIP(2);                                                              00000470
 KONTROLL_FT_SØKER:                                                     00000480
   PROC (FEIL_FUNNET);                                                  00000490
   DCL                                                                  00000500
      FEIL_FUNNET BIT (1);                                              00000510
   DCL                                                                  00000520
      DAGENS_DATO_ÅMD                           PIC '999999',           00000530
      DAGENS_DATO_ÅM DEF DAGENS_DATO_ÅMD        PIC '9999',             00000540
      DAGENS_DATO_Å  DEF DAGENS_DATO_ÅMD        PIC '99',               00000550
      DAGENS_DATO_M  DEF DAGENS_DATO_ÅMD POS(3) PIC '99',               00000560
      DAGENS_DATO_D  DEF DAGENS_DATO_ÅMD POS(5) PIC '99';               00000570
 %SKIP;                                                                 00000580
   DCL                                                                  00000590
      HJ_DAGENS_DATO_ÅM                             PIC '9999',         00000600
      HJ_DAGENS_DATO_Å DEF HJ_DAGENS_DATO_ÅM        PIC '99',           00000610
      HJ_DAGENS_DATO_M DEF HJ_DAGENS_DATO_ÅM POS(3) PIC '99';           00000620
 %SKIP;                                                                 00000630
   DCL                                                                  00000640
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00000650
      KEY_PEKER                  POINTER,                               00000660
      TK_RECL                    CHAR (101);                            00000670
   DCL                                                                  00000680
      ALDER FIXED DEC (5),                                              00000690
      TYPE CHAR(1),                                                     00000700
      DATO PIC '9999';                                                  00000710
   DCL                                                                  00000720
      1 FNR_REG,                                                        00000730
        2 FNR1        FIXED DEC(11),                                    00000740
        2 FNR2        FIXED DEC(11),                                    00000750
        2 BRUKERID    CHAR     ( 4);                                    00000760
                                                                        00000770
 /*------------------------------------------------------------*/       00000780
 /*  HJELPE DCL FOR Å SNU DATO                                 */       00000790
 /*------------------------------------------------------------*/       00000800
                                                                        00000810
   DCL                                                                  00000820
      HJ_VIRK_DATO_ÅM PIC '9999',                                       00000830
      VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅM POS(1) PIC '99',                  00000840
      VIRK_DATO_M DEF HJ_VIRK_DATO_ÅM POS(3) PIC '99';                  00000850
 %SKIP;                                                                 00000860
   DCL                                                                  00000870
      HJ_VIRK_DATO_MÅ PIC '9999',                                       00000880
      HJ_VIRK_DATO_M DEF HJ_VIRK_DATO_MÅ POS(1) PIC '99',               00000890
      HJ_VIRK_DATO_Å DEF HJ_VIRK_DATO_MÅ POS(3) PIC '99';               00000900
 %PAGE;                                                                 00000910
      ANT_FEIL_SKREVET = 0;                                             00000920
      FEIL_FUNNET      = '0'B;                                          00000930
      KEY_PEKER        = ADDR(FTS.TKNR);                                00000940
                                                                        00000950
  /* ******************************************************* */         00000960
  /* DATE () ER EN BUILTIN-FUNKSJON I PLI SOM RETURNERER     */         00000970
  /* DAGENS DATO I FORMEN ÅR - MNDR - DAG                    */         00000980
  /* ******************************************************* */         00000990
                                                                        00001000
  FNR_REG.BRUKERID   = DIV_PARAM_OMR.CICS_IND;                          00001010
  DAGENS_DATO_ÅMD    = DATE ();                                         00001020
                                                                        00001030
                                                                        00001040
                                                                        00001050
 /* BLANKETTER MED VIRK FRAM I TID AVVISES FRA 01.92  SP 8.91 */        00001060
    HJ_VIRK_DATO_MÅ  = FTS.VIRK_DATO_MÅ;                                00001070
    VIRK_DATO_Å      = HJ_VIRK_DATO_Å;                                  00001080
    VIRK_DATO_M      = HJ_VIRK_DATO_M;                                  00001090
                                                                        00001100
                                                                        00001110
                                                                        00001120
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR11(FTS.FNR)) THEN                  00001130
         DO;                                                            00001140
            FEIL_FUNNET = '1'B;                                         00001150
            FTS.FNRNR =200;                                             00001160
         END;                                                           00001170
      ELSE                                                              00001180
      IF ^F_GYLDIG_FNR(FTS.FNR) THEN                                    00001190
         DO;                                                            00001200
            FEIL_FUNNET = '1'B;                                         00001210
            FTS.FNRNR = 1;                                              00001220
         END;                                                           00001230
      ELSE                                                              00001240
         DO;                                                            00001250
            FNR_REG.FNR1 = FTS.FNR;                                     00001260
            EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);       00001270
            IF FNR_REG.FNR2 > 0 THEN                                    00001280
               DO;                                                      00001290
                 FTS.FNRNR = 203;                                       00001300
                 FTS.FNR_GML = FTS.FNR;                                 00001310
                 FTS.FNR = FNR_REG.FNR2;                                00001320
               END;                                                     00001330
         END;                                                           00001340
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(FTS.TKNR)) THEN                  00001350
         DO;                                                            00001360
            FEIL_FUNNET = '1'B;                                         00001370
            FTS.TKNRNR = 200;                                           00001380
         END;                                                           00001390
      ELSE                                                              00001400
         DO;                                                            00001410
                  EXEC CICS HANDLE CONDITION NOTFND(NOTFND);            00001420
                  EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)    00001430
                                                     INTO(TK_RECL);     00001440
                  GOTO TKNR_UT;                                         00001450
              NOTFND:                                                   00001460
                  FEIL_FUNNET = '1'B;                                   00001470
                  FTS.TKNRNR  = 3;                                      00001480
                  LEAVE;                                                00001490
              TKNR_UT:                                                  00001500
               DIV_PARAM_OMR.DIV_TKNR = SUBSTR(TK_RECL,1,4);            00001510
         END;                                                           00001520
      IF ^(FTS.TILL_EK = 'J' ! FTS.TILL_EK = ' ') THEN                  00001530
         DO;                                                            00001540
            FEIL_FUNNET ='1'B;                                          00001550
            FTS.TILL_EKNR = 4;                                          00001560
         END;                                                           00001570
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR2(FTS.BT_ANT)) THEN                00001580
         DO;                                                            00001590
            FEIL_FUNNET = '1'B;                                         00001600
            FTS.BT_ANTNR = 200;                                         00001610
         END;                                                           00001620
      ELSE                                                              00001630
      IF FTS.BT_ANT > 8 THEN                                            00001640
         DO;                                                            00001650
            FEIL_FUNNET = '1'B;                                         00001660
            FTS.BT_ANTNR = 282;                                         00001670
         END;                                                           00001680
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(FTS.VIRK_DATO_MÅ)) THEN          00001690
         DO;                                                            00001700
            FEIL_FUNNET = '1'B;                                         00001710
            FTS.VIRK_DATO_MÅNR = 200;                                   00001720
         END;                                                           00001730
      ELSE                                                              00001740
      IF ^F_GYLDIG_DATO(FTS.VIRK_DATO_MÅ) THEN                          00001750
         DO;                                                            00001760
            FEIL_FUNNET = '1'B;                                         00001770
            FTS.VIRK_DATO_MÅNR = 9;                                     00001780
         END;                                                           00001790
  /* HER SETTES VERDIER INN I MENY_OMR */                               00001800
      FØDSNUMMER = FTS.FNR;                                             00001810
      VIRKNINGSDATO = FTS.VIRK_DATO_MÅ;                                 00001820
      IF ^(FTS.BOSATT_UTL = 'J'! FTS.BOSATT_UTL = ' ') THEN             00001830
         DO;                                                            00001840
            FEIL_FUNNET = '1'B;                                         00001850
            FTS.BOSATT_UTLNR = 25;                                      00001860
         END;                                                           00001870
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR11(FTS.FNR_EK)) THEN               00001880
         DO;                                                            00001890
            FEIL_FUNNET = '1'B;                                         00001900
            FTS.FNR_EKNR = 200;                                         00001910
         END;                                                           00001920
      ELSE                                                              00001930
      IF FTS.FNR_EK > 0 THEN                                            00001940
         DO;                                                            00001950
            IF ^F_GYLDIG_FNR(FTS.FNR_EK) THEN                           00001960
               DO;                                                      00001970
                  FEIL_FUNNET = '1'B;                                   00001980
                  FTS.FNR_EKNR = 15;                                    00001990
               END;                                                     00002000
            ELSE                                                        00002010
               DO;                                                      00002020
                  FNR_REG.FNR1 = FTS.FNR_EK;;                           00002030
                  EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG); 00002040
                  IF FNR_REG.FNR2 > 0 THEN                              00002050
                     DO;                                                00002060
                        FTS.FNR_EKNR = 203;                             00002070
                        FTS.FNR_GML_EK = FTS.FNR_EK;                    00002080
                        FTS.FNR_EK = FNR_REG.FNR2;                      00002090
                     END;                                               00002100
               END;                                                     00002110
            IF FTS.EK_INNT = 'J' THEN                                   00002120
               DO;                                                      00002130
                  IF F_SNU_DATO(FTS.VIRK_DATO_MÅ) < 8407 THEN           00002140
                     DO;                                                00002150
                        FEIL_FUNNET = '1'B;                             00002160
                        FTS.VIRK_DATO_MÅNR = 273;                       00002170
                     END;                                               00002180
               END;                                                     00002190
            ELSE                                                        00002200
               IF FTS.EK_INNT  ^= 'N' THEN                              00002210
                  DO;                                                   00002220
                     FEIL_FUNNET = '1'B;                                00002230
                     FTS.EK_INNTNR = 272;                               00002240
                  END;                                                  00002250
         END;                                                           00002260
 %SKIP(3);                             /*  */                           00002270
 /*   KRYSS KONTROLLER       */                                         00002280
 %SKIP;                                                                 00002290
      IF ^FEIL_FUNNET THEN                                              00002300
         DO;                                                            00002310
            ALDER = F_ALDER(FTS.FNR,FTS.VIRK_DATO_MÅ);                  00002320
            HJ_VIRK_DATO_MÅ = FTS.VIRK_DATO_MÅ;                         00002330
            VIRK_DATO_Å = HJ_VIRK_DATO_Å;                               00002340
            VIRK_DATO_M = HJ_VIRK_DATO_M;                               00002350
 /*MIDLERTIDIG STOPP AV ALLE FORSØRGINGSTILLEGG - HL 26.3.91 */         00002360
                                                                        00002370
   IF HJ_VIRK_DATO_ÅM > 9104 & (FTS.BT_ANT > 0)     THEN                00002380
      DO;                                                               00002390
         FEIL_FUNNET = '1'B;                                            00002400
         FTS.BT_ANTNR  = 999;                                           00002410
      END;                                                              00002420
   IF HJ_VIRK_DATO_ÅM > 9104 & (FTS.TILL_EK = 'J')   THEN               00002430
      DO;                                                               00002440
         FEIL_FUNNET = '1'B;                                            00002450
         FTS.TILL_EKNR = 999;                                           00002460
      END;                                                              00002470
                                                                        00002480
            IF ^ F_2MDR(HJ_VIRK_DATO_ÅM)              THEN              00002490
               DO;                                                      00002500
                  FEIL_FUNNET = '1'B;                                   00002510
                  FTS.VIRK_DATO_MÅNR = 207;                             00002520
               END;                                                     00002530
                                                                        00002540
               IF ALDER < 1800 & HJ_VIRK_DATO_ÅM < 0176 THEN            00002550
                  DO;                                                   00002560
                     FEIL_FUNNET = '1'B;                                00002570
                     FTS.FNRNR = 49;                                    00002580
                     FTS.VIRK_DATO_MÅNR = 999;                          00002590
                  END;                                                  00002600
               IF ALDER < 1600 & HJ_VIRK_DATO_ÅM >= 0176 THEN           00002610
                  DO;                                                   00002620
                     FEIL_FUNNET = '1'B;                                00002630
                     FTS.FNRNR = 50;                                    00002640
                     FTS.VIRK_DATO_MÅNR = 999;                          00002650
                  END;                                                  00002660
               IF FTS.TILL_EK ^= 'J' & FTS.BT_ANT = 0 THEN              00002670
                  DO;                                                   00002680
                     FEIL_FUNNET = '1'B;                                00002690
                     FTS.TILL_EKNR = 163;                               00002700
                     FTS.BT_ANTNR = 999;                                00002710
                  END;                                                  00002720
            IF FTS.TILL_EK = 'J' THEN                                   00002730
               DO;                                                      00002740
               IF FTS.FNR_EK = 0  THEN               /* 141287 BF */    00002750
                  DO;                                                   00002760
                     FEIL_FUNNET = '1'B;                                00002770
                     FTS.TILL_EKNR = 19;                                00002780
                     FTS.FNR_EKNR = 999;                                00002790
                  END;                                                  00002800
               IF FTS.FNR_EK > 0  THEN                                  00002810
                 DO;                                                    00002820
                  IF ^F_EK_ALDER_GYLDIG(FTS.FNR_EK,FTS.VIRK_DATO_MÅ)    00002830
                  THEN                                                  00002840
                     DO;      /*NY0191 ET KAN GIS TIL EK ELDRE ENN 67*/ 00002850
                       IF F_SNU_DATO(FTS.VIRK_DATO_MÅ) < 9101 THEN      00002860
                          DO;                                           00002870
                            FEIL_FUNNET = '1'B;                         00002880
                            FTS.FNR_EKNR = 17;                          00002890
                            FTS.VIRK_DATO_MÅNR = 999;                   00002900
                            FTS.TILL_EKNR = 999;                        00002910
                          END;                                          00002920
                     END;                                               00002930
                 END;                                                   00002940
               END;   /* TIIL_EK = 'J' */                               00002950
            IF FTS.BOSATT_UTL = 'J' THEN                                00002960
              DO;                                                       00002970
                 IF ^ (FTS.TT_F67_EK = '00' !                           00002980
                 FTS.TT_E66_Å_EK = '00' ! FTS.TT_E66_M_EK = '00')       00002990
                 THEN                                                   00003000
                   DO;                                                  00003010
                      TYPE = 'F';                                       00003020
                      DATO = 0;                                         00003030
                      IF                                                00003040
                      F_KONTROLL_TT(FTS.TT_F67_EK,FTS.TT_E66_Å_EK ,     00003050
                      FTS.TT_E66_M_EK,FTS.FNR_EK,DATO,TYPE) THEN        00003060
                        DO;                                             00003070
                           FEIL_FUNNET = '1'B;                          00003080
                           FTS.TT_F67_EKNR = 32;                        00003090
                           FTS.TT_E66_Å_EKNR = 999;                     00003100
                           FTS.TT_E66_M_EKNR = 999;                     00003110
                        END;                                            00003120
                      IF FTS.TILL_EK ^= 'J' THEN                        00003130
                        DO;                                             00003140
                           FEIL_FUNNET = '1'B;                          00003150
                           FTS.TILL_EKNR = 33;                          00003160
                        END;                                            00003170
                   END;                                                 00003180
              END;                                                      00003190
         END;                                                           00003200
   END KONTROLL_FT_SØKER;                                               00003210
