 /*       SIST ENDRET 16/10-98 14.53.08 AV   JDA7339                  */00000000
 /*       SIST ENDRET 16/10-98 14.52.17 AV   JDA7339                  */00000010
 /*       SIST ENDRET 13/03-98 13.36.27 AV   JDA7339                  */00000020
 /*       SIST ENDRET 13/03-98 13.21.09 AV   JDA7339                  */00000030
 /*       SIST ENDRET 05/12-97 12.42.36 AV   JDA7339                  */00000040
 /*       SIST ENDRET 27/11-97 11.49.05 AV   JDA7339                  */00000050
 /*       SIST ENDRET 15/07-96 14.04.15 AV   HLB0310                  */00000060
 /*       SIST ENDRET 11/04-94 08.56.44 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 25/02-94 13.11.13 AV   HERMAN                   */00000080
 /*       SIST ENDRET 14/09-93 13.20.22 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 22/07-92 10.12.24 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 15/11-91 08.36.56 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 11/07-91 14.24.31 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 17/06-91 14.50.39 AV   HERMAN                   */00000130
 /*       SIST ENDRET 14/06-91 13.27.03 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 22/05-91 13.50.53 AV   HERMAN                   */00000150
 /*       SIST ENDRET 26/04-91 12.26.33 AV   DYBVIK                   */00000160
 /* ***************************************************************** */00000170
 /*IDENTIFIKASJON:                                                    */00000180
 /*    R001NC20 - HOVED-PROSEDYRE I PLI                               */00000190
 /*    PROGRAMMERER: HERMAN         APRIL 91                          */00000200
 /*HENSIKT:                                                           */00000210
 /*    FORSØRGINGSTILLEGG EKTEFELLE / BARN  NY BLANKETT F7            */00000220
 /*    RUTINEN KONTROLLERER ALLE PERSONER I TRANSAKSJONEN MOT         */00000230
 /*    INFORMASJON I REGISTERET.  NÅR DET OPPDAGES UOVERENSSTEMMELSER */00000240
 /*    BLIR FEIL-MELD_NR SATT OG VI GÅR UT AV PGM.  FOR HVER FAMILIE- */00000250
 /*    PERSON SOM GÅR FEILFRI GJENNOM KONTROLLENE BLIR DET OPPRETTET  */00000260
 /*    NY STATUS FOR PERSONEN, OG SØKERENS STATUS OPPDATERES.         */00000270
 /* ****************************************************************  */00000280
 /*PROGRAMTILKNYTNING:                                                */00000290
 /*    KALLES OPP AV PROGRAM R0013520                                 */00000300
 /*BRUK:                                                              */00000310
 /*    EXEC CICS XCTL PROGRAM ('R001NC20') COMMAREA (KOM_OMR)         */00000320
 /*                                                                   */00000330
 /* ***************************************************************** */00000340
 %SKIP;                                                                 00000350
 KON_F7:                                                                00000360
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000370
 %SKIP;                                                                 00000380
      %INCLUDE P0019908;   /* KOM_OMR  BASED(COMMAREA_PEKER)        */  00000390
      %INCLUDE P0019906;   /* TRANS_OPPL_OMR BASED(TRANS_OPPL_PEKER)*/  00000400
      %INCLUDE P001NC01;                                                00000410
      %INCLUDE P0019910;   /* STYRINGS_OMR  BASED(STYRINGS_PEKER)   */  00000420
      %INCLUDE P0019912;   /* DIV_PARAM_OMR  BASED(DIV_PARAM_PEKER) */  00000430
                                                                        00000440
      DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                    00000450
      DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                    00000460
      DCL COMMAREA_PEKER PTR;                                           00000470
 /*------------------------------------------------------------*/       00000480
 /*  HJELPE DCL FOR Å SNU DATO                                 */       00000490
 /*------------------------------------------------------------*/       00000500
                                                                        00000510
   DCL                                                                  00000520
      HJ_VIRK_DATO_ÅM PIC '9999',                                       00000530
      VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅM POS(1) PIC '99',                  00000540
      VIRK_DATO_M DEF HJ_VIRK_DATO_ÅM POS(3) PIC '99';                  00000550
 %SKIP;                                                                 00000560
   DCL                                                                  00000570
      HJ_VIRK_DATO_MÅ PIC '9999',                                       00000580
      HJ_VIRK_DATO_M DEF HJ_VIRK_DATO_MÅ POS(1) PIC '99',               00000590
      HJ_VIRK_DATO_Å DEF HJ_VIRK_DATO_MÅ POS(3) PIC '99';               00000600
                                                                        00000610
   DCL ALDER          FIXED DEC (5) INIT (0);                           00000620
   DCL ALDER_EK       FIXED DEC (5) INIT (0);                           00000630
   DCL FNR_EK_FIX     FIXED DEC (11) INIT (0);                          00000640
   DCL                                                                  00000650
      BARN_IND        FIXED    BIN (15),                                00000660
      I               FIXED    BIN (15),                                00000670
      J               FIXED    BIN (15),                                00000680
      (                                                                 00000690
      ADDR,                                                             00000700
      CSTG                                                              00000710
      )               BUILTIN;                                          00000720
                                                                        00000730
 %PAGE;  /*    */                                                       00000740
 /* ************************************************************** */   00000750
 /* PROGRAMMET BEGYNNER HER                                        */   00000760
 /* ************************************************************** */   00000770
 %SKIP;                                                                 00000780
     PROGRAM_ID = 'R001NC20';                                           00000790
     BARN_IND   = 0;                                                    00000800
     TRANSTYPE  = '6';                                                  00000810
 %SKIP;                                                                 00000820
                                                                        00000830
         IF B01.STATUS_KODE_HIST(SØKER_IND) ^= ' '     THEN             00000840
            DO;                                                         00000850
 L090:                                                                  00000860
               FEIL_VED_LABEL = '090';                                  00000870
               FEIL_MELD_NR   = 1501;                                   00000880
               GO TO L999;                                              00000890
            END;                                                        00000900
                                                                        00000910
 /* ***************************************************************** */00000920
 /* SØKEREN STÅR REGISTRERT SOM ALDERS- ELLER UFØREPENSJONIST         */00000930
 /* ELLER AFP-PENSJONIST                                              */00000940
 /* ***************************************************************** */00000950
  /* TESTING AV FT VED PT2 = N TRUDE 0893  **************               00000960
      IF (B01.PENSJONSTYPE1(SØKER_IND) = 'A' !                          00000970
         (B01.PENSJONSTYPE1(SØKER_IND) = 'K' &                          00000980
          B01.PENSJONSTYPE2(SØKER_IND)^= 'N') !                         00000990
          B01.PENSJONSTYPE1(SØKER_IND) = 'U' !                          00001000
          B01.PENSJONSTYPE1(SØKER_IND) = 'Y') THEN                      00001010
     ****** */                                                          00001020
      IF (B01.PENSJONSTYPE1(SØKER_IND) = 'A' !                          00001030
          B01.PENSJONSTYPE1(SØKER_IND) = 'K' !                          00001040
          B01.PENSJONSTYPE1(SØKER_IND) = 'U' !                          00001050
          B01.PENSJONSTYPE1(SØKER_IND) = 'Y') THEN                      00001060
         DO;                                                            00001070
                                                                        00001080
         IF B01.TKNR(SØKER_IND) ^= F7S.TKNR THEN                        00001090
            DO;                                                         00001100
 L100:                                                                  00001110
               FEIL_VED_LABEL = '100';                                  00001120
               FEIL_MELD_NR   = 1702;                                   00001130
               GO TO L999;                                              00001140
            END;                                                        00001150
                                                                        00001160
  /* MÅ HA INN OPPL   (F7S.TILL_EK            = ' ' &                   00001170
     OM BARN !!!       F7S.BT_ANT             =  0 )  THEN              00001180
                      GO TO L999;    */                                 00001190
                                                                        00001200
 /* ***************************************************************** */00001210
 /* DERSOM DET ER EKTEFELLE I TRANSEN.                                */00001220
 /* ***************************************************************** */00001230
                                                                        00001240
            IF F7S.FNR_EK > 0 THEN                                      00001250
               DO;                                                      00001260
                                                                        00001270
                                                                        00001280
 /* ***************************************************************** */00001290
 /* DERSOM SØKERS SIVILSTAND ER UGIFT.                                */00001300
 /* ***************************************************************** */00001310
                                                                        00001320
                  SELECT (B01.SIVILSTAND(SØKER_IND));                   00001330
                     WHEN ('U')                                         00001340
                        DO;                                             00001350
 L120:                                                                  00001360
                           FEIL_VED_LABEL = '120';                      00001370
                           FEIL_MELD_NR   = 1001;                       00001380
                           GO TO L999;                                  00001390
                        END;                                            00001400
                                                                        00001410
 /* ***************************************************************** */00001420
 /* DERSOM SØKER ER SKILT.                                            */00001430
 /* ***************************************************************** */00001440
                                                                        00001450
                     WHEN ('S')                                         00001460
                        DO;                                             00001470
 L130:                                                                  00001480
                           FEIL_VED_LABEL = '130';                      00001490
                           FEIL_MELD_NR   = 1002;                       00001500
                           GO TO L999;                                  00001510
                        END;                                            00001520
                                                                        00001530
 /* ***************************************************************** */00001540
 /* DERSOM SØKER ER ETTERLATT.                                        */00001550
 /* ***************************************************************** */00001560
                                                                        00001570
                     WHEN ('E')                                         00001580
                        DO;                                             00001590
 L140:                                                                  00001600
                           FEIL_VED_LABEL = '140';                      00001610
                           FEIL_MELD_NR   = 1003;                       00001620
                           GO TO L999;                                  00001630
                        END;                                            00001640
                                                                        00001650
 /* ***************************************************************** */00001660
 /* ELLERS ER SØKEREN GIFT.                                           */00001670
 /* ***************************************************************** */00001680
                                                                        00001690
                     OTHERWISE                                          00001700
                        DO;                                             00001710
                                                                        00001720
 /* ***************************************************************** */00001730
 /* DERSOM DET ER SAMME EKTEFELLE SOM I SØKERENS PESTATUS.            */00001740
 /* ***************************************************************** */00001750
                                                                        00001760
                           IF B01.FNR(EKTEF_IND) = F7S.FNR_EK THEN      00001770
                              DO;                                       00001780
 /* 9926 */                      CALL FLYTT_B01_TIL_B02(SØKER_IND);     00001790
                                                                        00001800
                                 IF FEIL_MELD_NR > 0 THEN               00001810
                                    GO TO L999;                         00001820
                                 ELSE                                   00001830
                                    PROGRAM_ID = 'R001NC20';            00001840
                                                                        00001850
 /* 9926 */                      CALL FLYTT_B01_TIL_B02(EKTEF_IND);     00001860
                                                                        00001870
                                 IF FEIL_MELD_NR > 0 THEN               00001880
                                    GO TO L999;                         00001890
                                 ELSE                                   00001900
                                    PROGRAM_ID = 'R001NC20';            00001910
                                                                        00001920
 /* ***************************************************************** */00001930
 /* DERSOM DET SØKES OM TILLEGG FOR EKTEFELLE.                        */00001940
 /* ***************************************************************** */00001950
                                                                        00001960
                                 IF F7S.TILL_EK = 'J' THEN              00001970
                                                                        00001980
 /* ***************************************************************** */00001990
 /* DERSOM EKTEFELLE HAR PENSJON.                                     */00002000
 /* ***************************************************************** */00002010
                                                                        00002020
                               IF (B01.PENSJONSTYPE1(EKTEF_IND) = 'A' & 00002030
 /*TILLEGG 150796 HL */               B01.P67_KODE(EKTEF_IND) ^= '5') ! 00002040
                                       B01.PENSJONSTYPE1(EKTEF_IND) =   00002050
                                                              'U'     ! 00002060
                                       B01.PENSJONSTYPE1(EKTEF_IND) =   00002070
                                                              'K'     ! 00002080
                                       B01.PENSJONSTYPE1(EKTEF_IND) =   00002090
                                                              'Y' THEN  00002100
                                       DO;                              00002110
 L150:                                                                  00002120
                                          FEIL_VED_LABEL = '150';       00002130
                                          FEIL_MELD_NR   = 1011;        00002140
                                          GO TO L999;                   00002150
                                       END;                             00002160
                                                                        00002170
                                 CALL                                   00002180
 /* NC22 */                          AJOURFØR_B02_MED_F7_TRANS;         00002190
                                                                        00002200
                              END;                                      00002210
                                                                        00002220
 /* ***************************************************************** */00002230
 /* IKKE SAMME EKTEFELLE.                                             */00002240
 /* ***************************************************************** */00002250
                                                                        00002260
                           ELSE                                         00002270
                              DO;                                       00002280
 L160:                                                                  00002290
                                 FEIL_VED_LABEL = '160';                00002300
                                 FEIL_MELD_NR   = 1004;                 00002310
                                 GO TO L999;                            00002320
                              END;                                      00002330
                        END;                                            00002340
                  END;  /*SELECT SIVILSTAND */                          00002350
               END;     /*IF F7S.FNR_EK > 0*/                           00002360
                                                                        00002370
 /* ***************************************************************** */00002380
 /* INGEN EKTEFELLE I TRANS.                                          */00002390
 /* ***************************************************************** */00002400
                                                                        00002410
            ELSE                                                        00002420
               DO;                                                      00002430
                                                                        00002440
 /* ***************************************************************** */00002450
 /* DERSOM SØKEREN ER REGISTRERT SOM GIFT, PARTNER ELLER SAMBOER      */00002460
 /* ***************************************************************** */00002470
                                                                        00002480
                                                                        00002490
                  IF B01.SIVILSTAND(SØKER_IND) = 'G' !                  00002500
                     B01.SIVILSTAND(SØKER_IND) = 'A' !                  00002510
                     B01.SIVILSTAND(SØKER_IND) = 'P' !                  00002520
                     B01.SIVILSTAND(SØKER_IND) = 'V' !                  00002530
                     B01.SIVILSTAND(SØKER_IND) = 'W' THEN               00002540
                                                                        00002550
                     DO;                                                00002560
                                                                        00002570
                        IF B01.FNR(EKTEF_IND)  >  0  &                  00002580
                           F7S.TILL_EK        ^= 'J' THEN               00002590
                           DO;                                          00002600
                              F7S.FNR_EK = B01.FNR(EKTEF_IND);          00002610
 /* 9926 */                   CALL FLYTT_B01_TIL_B02(SØKER_IND);        00002620
                                                                        00002630
                              IF FEIL_MELD_NR > 0 THEN                  00002640
                                 GO TO L999;                            00002650
                              ELSE                                      00002660
                                 PROGRAM_ID = 'R001NC20';               00002670
                                                                        00002680
 /* 9926 */                   CALL FLYTT_B01_TIL_B02(EKTEF_IND);        00002690
                                                                        00002700
                              IF FEIL_MELD_NR > 0 THEN                  00002710
                                 GO TO L999;                            00002720
                              ELSE                                      00002730
                                 PROGRAM_ID = 'R001NC20';               00002740
                           END;                                         00002750
                        ELSE                                            00002760
                           DO;                                          00002770
 L165:                                                                  00002780
                             IF  B01.SIVILSTAND(SØKER_IND) = 'P' THEN   00002790
                               DO;                                      00002800
                                  FEIL_VED_LABEL = '165';               00002810
                                  FEIL_MELD_NR   = 1105;                00002820
                                  GO TO L999;                           00002830
                               END;                                     00002840
                                                                        00002850
 L167:                                                                  00002860
                             IF  B01.SIVILSTAND(SØKER_IND) = 'W'  !     00002870
                                 B01.SIVILSTAND(SØKER_IND) = 'V' THEN   00002880
                               DO;                                      00002890
                                  FEIL_VED_LABEL = '167';               00002900
                                  FEIL_MELD_NR   = 1106;                00002910
                                  GO TO L999;                           00002920
                               END;                                     00002930
                             ELSE                                       00002940
                               DO;                                      00002950
 L170:                                                                  00002960
                                 FEIL_VED_LABEL = '170';                00002970
                                 FEIL_MELD_NR = 1102;                   00002980
                                 GO TO L999;                            00002990
                               END;                                     00003000
                           END;                                         00003010
                     END;                                               00003020
                                                                        00003030
                                                                        00003040
                  ELSE                                                  00003050
                     DO;                                                00003060
                                                                        00003070
 /* 9926 */             CALL FLYTT_B01_TIL_B02(SØKER_IND);              00003080
                                                                        00003090
                        IF FEIL_MELD_NR > 0 THEN                        00003100
                           GO TO L999;                                  00003110
                        ELSE                                            00003120
                           PROGRAM_ID = 'R001NC20';                     00003130
                                                                        00003140
                        IF B01.PENSJONSTYPE2 (SØKER_IND) =  'E'    THEN 00003150
                         DO;                                            00003160
                           B02.PERSON(EKTEF_IND)= B01.PERSON(EKTEF_IND);00003170
 /* RULLERING AV FORVENTET            - 9802 HL */                      00003180
                    IF B02.ETTEPENS.FORVENTET(SØKER_IND) > 0   THEN     00003190
                       CALL RULL_FORVENTET(B02.G_DATO_ÅM(SØKER_IND),    00003200
                                B02.VIRK_DATO_ÅM(SØKER_IND),            00003210
                                B02.ETTEPENS.FORVENTET(SØKER_IND));     00003220
                                                                        00003230
                         END;                                           00003240
                                                                        00003250
                                                                        00003260
 /* 1222 */             CALL AJOURFØR_B02_MED_F7_TRANS;                 00003270
                                                                        00003280
                     END;                                               00003290
               END;                                                     00003300
         END;                                                           00003310
      ELSE                                                              00003320
         DO;                                                            00003330
 L175:                                                                  00003340
            FEIL_VED_LABEL = '175';                                     00003350
            FEIL_MELD_NR   = 1010;                                      00003360
            GO TO L999;                                                 00003370
         END;                                                           00003380
                                                                        00003390
 /* ***************************************************************** */00003400
 /* BARNEDELEN                                                        */00003410
 /* ***************************************************************** */00003420
                                                                        00003430
        IF F7S.BT_ANT > 0 &                                             00003440
           B01.PENSJONSTYPE1(SØKER_IND) = 'K'  THEN                     00003450
                                                                        00003460
 /* ***************************************************************** */00003470
 /* SØKER HAR AVTALEFESTET PENSJON - BARNETILLEGG KAN IKKE TILSTÅS    */00003480
 /* ***************************************************************** */00003490
                                                                        00003500
           DO;                                                          00003510
  L177:                                                                 00003520
              FEIL_VED_LABEL = '177';                                   00003530
              FEIL_MELD_NR   = 1010;                                    00003540
              GO TO L999;                                               00003550
           END;                                                         00003560
                                                                        00003570
      DO I = 1 TO F7S.BT_ANT;                                           00003580
         BARN_IND = 0;                                                  00003590
                                                                        00003600
         DO J = 3 TO 14 WHILE (B02.FNR(J) > 0);                         00003610
                                                                        00003620
            IF F7B.FNR_BARN(I) = B01.FNR(J) THEN                        00003630
               DO;                                                      00003640
                  BARN_IND = J;                                         00003650
                  J        = 14;                                        00003660
               END;                                                     00003670
         END;                                                           00003680
                                                                        00003690
 /* **************************************************************** */ 00003700
 /*  DERSOM PARTNERSKAP ER INNGÅTT IKKE FELLESBARN  JD. 2.94         */ 00003710
 /* **************************************************************** */ 00003720
                                                                        00003730
                                                                        00003740
 L179:                                                                  00003750
                             IF  B01.SIVILSTAND(SØKER_IND) = 'P' &      00003760
                                 F7B.FELLES_BARN(I)        = 'J' THEN   00003770
                               DO;                                      00003780
                                  FEIL_VED_LABEL = '179';               00003790
                                  FEIL_MELD_NR   = 1107;                00003800
                                  GO TO L999;                           00003810
                               END;                                     00003820
 /* **************************************************************** */ 00003830
 /*  DERSOM BARNET ER I B01(TILKNYTTET SØKERENS FAMILIE).            */ 00003840
 /* **************************************************************** */ 00003850
                                                                        00003860
         IF BARN_IND > 0 THEN                                           00003870
            DO;                                                         00003880
              IF F7B.FELLES_BARN(I) = 'J'  THEN                         00003890
                 B02.PENSJONSTYPE2(BARN_IND) = 'W';                     00003900
              ELSE                                                      00003910
                 B02.PENSJONSTYPE2(BARN_IND) = 'V';                     00003920
                                                                        00003930
 /* **************************************************************** */ 00003940
 /* DERSOM BARNET ER TILKNYTTET EKTEFELLE.                           */ 00003950
 /* **************************************************************** */ 00003960
                                                                        00003970
               IF B01.FNR_TILKN(BARN_IND,1) = B01.                      00003980
                                                  FNR(EKTEF_IND) THEN   00003990
                  DO;                                                   00004000
                     IF B01.PENSJONSTYPE1(BARN_IND) = 'L' THEN          00004010
                        DO;                                             00004020
 L180:                                                                  00004030
                           FEIL_VED_LABEL = '180';                      00004040
                           FEIL_MELD_NR   = 1201;                       00004050
                           GO TO L999;                                  00004060
                        END;                                            00004070
                     ELSE                                               00004080
                                                                        00004090
 /* **************************************************************** */ 00004100
 /* TILKNYTNINGSKODE = NOE ANNET.                                    */ 00004110
 /* **************************************************************** */ 00004120
                                                                        00004130
                        DO;                                             00004140
 L190:                                                                  00004150
                           FEIL_VED_LABEL = '190';                      00004160
                           FEIL_MELD_NR   = 1208;                       00004170
                           GO TO L999;                                  00004180
                        END;                                            00004190
                  END;                                                  00004200
               ELSE                                                     00004210
                                                                        00004220
 /* **************************************************************** */ 00004230
 /* BARNET ER TILKNYTTET SØKER.                                      */ 00004240
 /* **************************************************************** */ 00004250
                                                                        00004260
                  DO;                                                   00004270
                     IF B01.PENSJONSTYPE1(BARN_IND) ^= 'L'    THEN      00004280
                        DO;                                             00004290
 L200:                                                                  00004300
                           FEIL_VED_LABEL = '200';                      00004310
                           FEIL_MELD_NR   = 1207;                       00004320
                           GO TO L999;                                  00004330
                        END;                                            00004340
                  END;                                                  00004350
            END;                                                        00004360
         ELSE                                                           00004370
                                                                        00004380
 /* *************************************************************** */  00004390
 /* BARNET ER IKKE I B01.                                           */  00004400
 /* *************************************************************** */  00004410
                                                                        00004420
            DO;                                                         00004430
               BARN_IND        = J;                                     00004440
               SEARCH_FNR      = F7B.FNR_BARN(I);                       00004450
               POS_I_B01       = BARN_IND;                              00004460
                                                                        00004470
               EXEC CICS LINK PROGRAM ('R0019928') COMMAREA             00004480
                                                     (KOM_OMR);         00004490
                                      /* OPPRETT_STATUS_FOR_PERSON */   00004500
                                                                        00004510
               IF FEIL_MELD_NR > 0 THEN                                 00004520
                  GO TO L999;                                           00004530
               ELSE                                                     00004540
                  PROGRAM_ID = 'R001NC20';                              00004550
                                                                        00004560
 /* ************************************************************** */   00004570
 /* DERSOM BARNET ER I BASEN.                                      */   00004580
 /* ************************************************************** */   00004590
                                                                        00004600
               IF B01.FNR(BARN_IND) > 0 THEN                            00004610
                  DO;                                                   00004620
                                                                        00004630
 /* ************************************************************** */   00004640
 /* BARNET HAR IKKE PESTATUS.                                      */   00004650
 /* ************************************************************** */   00004660
                                                                        00004670
                     IF STATUS_TYPE = 'A' !                             00004680
                        STATUS_TYPE = 'C' !                             00004690
                        STATUS_TYPE = 'I' !     /* TILLEGGSTEST I,K */  00004700
                        STATUS_TYPE = 'K' THEN  /* 14.2.85  HL      */  00004710
                        DO;                                             00004720
                                                                        00004730
  /* 9926 */               CALL FLYTT_B01_TIL_B02(BARN_IND);            00004740
  /* KS 6/6-84   */                                                     00004750
                           IF F7B.FELLES_BARN (I) = 'J' THEN            00004760
                              B02.PENSJONSTYPE2(BARN_IND) = 'W';        00004770
                           ELSE                                         00004780
                              B02.PENSJONSTYPE2(BARN_IND) = 'V';        00004790
                                                                        00004800
                           CALL                                         00004810
  /* 9923 */                   OPPRETT_STATUS_FORS_BARN(BARN_IND,       00004820
                                                       SØKER_IND);      00004830
                                                                        00004840
                           CALL                                         00004850
  /* 9924 */                   KOBLE_TO_PERSONER(SØKER_IND,BARN_IND);   00004860
                        END;                                            00004870
                     ELSE                                               00004880
                                                                        00004890
 /* ************************************************************** */   00004900
 /* BARNET HAR PESTATUS.                                           */   00004910
 /* ************************************************************** */   00004920
                                                                        00004930
                        DO;                                             00004940
                           IF STATUS_TYPE ^= 'F'                        00004950
                                                           THEN         00004960
                              DO;                                       00004970
                                                                        00004980
 /* ************************************************************** */   00004990
 /* BARNET ER FORSØRGET AV ANDRE.                                  */   00005000
 /* ************************************************************** */   00005010
                                                                        00005020
                                 IF B01.                                00005030
                                    PENSJONSTYPE1(BARN_IND) = 'L' THEN  00005040
                                    DO;                                 00005050
  L210:                                                                 00005060
                                       FEIL_VED_LABEL = '210';          00005070
                                       FEIL_MELD_NR   = 1203;           00005080
                                       GO TO L999;                      00005090
                                    END;                                00005100
                                 ELSE                                   00005110
                                                                        00005120
 /* ************************************************************** */   00005130
 /* BARNET ER TILKNYTTET ANDRE PÅ EN ANNEN MÅTE.                   */   00005140
 /* ************************************************************** */   00005150
                                                                        00005160
                                    IF B01.                             00005170
                                       FNR_TILKN(BARN_IND,1) > 0 THEN   00005180
                                       DO;                              00005190
  L220:                                                                 00005200
                                          FEIL_VED_LABEL = '220';       00005210
                                          FEIL_MELD_NR   = 1206;        00005220
                                          GO TO L999;                   00005230
                                       END;                             00005240
                                    ELSE                                00005250
                                                                        00005260
 /* ************************************************************** */   00005270
 /* BARNET HAR PENSJON.                                            */   00005280
 /* ************************************************************** */   00005290
                                                                        00005300
                                       DO;                              00005310
  L240:                                                                 00005320
                                          FEIL_VED_LABEL = '240';       00005330
                                          FEIL_MELD_NR   = 1204;        00005340
                                          GO TO L999;                   00005350
                                       END;                             00005360
                              END;                                      00005370
                           ELSE                                         00005380
                              DO;                                       00005390
  L250:                                                                 00005400
                                 FEIL_VED_LABEL = '250';                00005410
                                 FEIL_MELD_NR   = 0601;                 00005420
                                 GO TO L999;                            00005430
                              END;                                      00005440
                        END;                                            00005450
                  END;                                                  00005460
               ELSE                                                     00005470
                                                                        00005480
 /* *********************************************************** */      00005490
 /* BARNET ER IKKE I BASEN.                                     */      00005500
 /* *********************************************************** */      00005510
                                                                        00005520
                  DO;                                                   00005530
                     B02.FNR   (BARN_IND) = F7B.FNR_BARN(I);            00005540
                     B02.NAVN  (BARN_IND) = (25)' ';                    00005550
                     B02.TKNR  (BARN_IND) = F7S.TKNR;                   00005560
  /* KS 6/6-84   */                                                     00005570
                     IF F7B.FELLES_BARN (I) = 'J' THEN                  00005580
                        B02.PENSJONSTYPE2(BARN_IND) = 'W';              00005590
                     ELSE                                               00005600
                        B02.PENSJONSTYPE2(BARN_IND) = 'V';              00005610
                                                                        00005620
                     CALL                                               00005630
                          OPPRETT_STATUS_FORS_BARN(BARN_IND,            00005640
                                                  SØKER_IND);           00005650
                          /* 9923 */                                    00005660
                                                                        00005670
  /* 9924 */         CALL KOBLE_TO_PERSONER(SØKER_IND,BARN_IND);        00005680
                                                                        00005690
                  END;                                                  00005700
            END;                                                        00005710
      END;                                                              00005720
                                                                        00005730
 /* *********************************************************** */      00005740
 /* BARN TILKNYTTET SØKER       (FORSØRGEDE BARN)               */      00005750
 /* *********************************************************** */      00005760
                                                                        00005770
      B02.ANTALL_BARN(SØKER_IND) = 0;                                   00005780
      DO I = 1 TO 13 WHILE                                              00005790
                       (B02.TILKN.FNR_TILKN(SØKER_IND,I) > 0);          00005800
         IF B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'V'  !            00005810
            B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'W'  !            00005820
            B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'L'   THEN        00005830
            DO;                                                         00005840
               B02.ANTALL_BARN(SØKER_IND) =                             00005850
                                   B02.ANTALL_BARN(SØKER_IND) + 1;      00005860
               DO J = 3 TO 14 UNTIL(B02.FNR(J) =                        00005870
                                       B02.FNR_TILKN(SØKER_IND,I));     00005880
                  IF B02.PENSJONSTYPE2(J) = 'V'      THEN               00005890
                     B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'V';     00005900
                  ELSE                                                  00005910
                     DO;                                                00005920
                        B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I)='W';    00005930
                        B02.PENSJONSTYPE2(J) = 'W';                     00005940
                     END;                                               00005950
               END;                                                     00005960
            END;                                                        00005970
      END;                                                              00005980
                                                                        00005990
 /* *********************************************************** */      00006000
 /* OPPDATERE TILKN-SEGMENTET, FT_FØR_91 :                      */      00006010
 /* *********************************************************** */      00006020
                                                                        00006030
   IF B01.FT_SKAL_BEREGNES(SØKER_IND) ^= 'J'      THEN                  00006040
      DO;                                                               00006050
         IF B01.PENSJONSTYPE1(EKTEF_IND) = 'F'    THEN                  00006060
            DO J = 1 TO 13 WHILE(B02.FNR_TILKN(SØKER_IND,J) > 0);       00006070
               IF B01.FNR(EKTEF_IND)= B02.FNR_TILKN(SØKER_IND,J) THEN   00006080
                  DO;                                                   00006090
                     B02.FT_FØR_91(SØKER_IND,J)   = 'F';                00006100
                     J=13;                                              00006110
                  END;                                                  00006120
            END;                                                        00006130
         DO I = 3 TO 14 WHILE(B01.FNR(I) > 0);                          00006140
            DO J = 1 TO 13 WHILE(B02.FNR_TILKN(SØKER_IND,J) > 0);       00006150
               IF B01.FNR(I) = B02.FNR_TILKN(SØKER_IND,J)     &         00006160
                  B01.STATUS_KODE_HIST(I) = ' '           THEN          00006170
                  DO;                                                   00006180
                     IF (B01.PENSJONSTYPE2(I)         = 'R'   !         00006190
                         B01.FT_FØR_91(SØKER_IND,J)   = 'R') &          00006200
                        B01.PENSJONSTYPE2(EKTEF_IND) = 'M'   THEN       00006210
                        B02.FT_FØR_91(SØKER_IND,J)   = 'R';             00006220
                     ELSE                                               00006230
                     IF B01.PENSJONSTYPE1(I)         = 'L'    &         00006240
                        B01.STATUS_KODE_HIST(I) = ' '           THEN    00006250
                        B02.FT_FØR_91(SØKER_IND,J)   = 'L';             00006260
                     J=13;                                              00006270
                  END;                                                  00006280
            END;                                                        00006290
         END;                                                           00006300
      END;                                                              00006310
 /* *********************************************************** */      00006320
 /* OPPDATERE FORSI-SEGMENTET :                                 */      00006330
 /* *********************************************************** */      00006340
                                                                        00006350
      IF F7S.PENSJONSINNTEKT   > 0   THEN                               00006360
         B02.PENSJONSINNTEKT(SØKER_IND) = F7S.PENSJONSINNTEKT/100;      00006370
      ELSE                                                              00006380
         B02.PENSJONSINNTEKT(SØKER_IND) = 0;                            00006390
                                                                        00006400
      IF F7S.ARBEIDSINNTEKT    > 0   THEN                               00006410
         B02.ARBEIDSINNTEKT(SØKER_IND) = F7S.ARBEIDSINNTEKT/100;        00006420
      ELSE                                                              00006430
         B02.ARBEIDSINNTEKT(SØKER_IND) = 0;                             00006440
      IF B02.PENSJONSTYPE1(SØKER_IND) = 'A'    !                        00006450
         B02.PENSJONSTYPE1(SØKER_IND) = 'K'      THEN                   00006460
         DO;                                                            00006470
            HJ_VIRK_DATO_ÅM = B02.VIRK_DATO_ÅM(SØKER_IND);              00006480
            HJ_VIRK_DATO_Å  = VIRK_DATO_Å;                              00006490
            HJ_VIRK_DATO_M  = VIRK_DATO_M;                              00006500
            ALDER = F_ALDER((B02.FNR(SØKER_IND)),HJ_VIRK_DATO_MÅ);      00006510
            IF ALDER < 7001                 THEN                        00006520
               DO;                                                      00006530
                  B02.FAI(SØKER_IND) = B02.ARBEIDSINNTEKT(SØKER_IND);   00006540
                  B02.FAI_DATO_ÅM(SØKER_IND) =                          00006550
                      B02.VIRK_DATO_ÅM(SØKER_IND);                      00006560
               END;                                                     00006570
         END;                                                           00006580
                                                                        00006590
      IF B02.PENSJONSTYPE2(SØKER_IND) ^= 'F'          THEN              00006600
         DO;                                                            00006610
            IF F7S.ARBEIDSINNTEKT_EK > 0   THEN                         00006620
               B02.ARBEIDSINNTEKT_EK(SØKER_IND) =                       00006630
                                    F7S.ARBEIDSINNTEKT_EK/100;          00006640
            ELSE                                                        00006650
               B02.ARBEIDSINNTEKT_EK(SØKER_IND) = 0;                    00006660
                                                                        00006670
 /*9803 HL : */                                                         00006680
                                                                        00006690
      IF B02.PENSJONSTYPE1(EKTEF_IND) = 'A'    !                        00006700
         B02.PENSJONSTYPE1(EKTEF_IND) = 'K'      THEN                   00006710
         DO;                                                            00006720
            HJ_VIRK_DATO_Å  = VIRK_DATO_Å;                              00006730
            HJ_VIRK_DATO_M  = VIRK_DATO_M;                              00006740
            ALDER_EK = F_ALDER(B02.FNR(EKTEF_IND),HJ_VIRK_DATO_MÅ);     00006750
            IF ALDER_EK < 7001                 THEN                     00006760
               DO;                                                      00006770
               B02.FAI(EKTEF_IND) = B02.ARBEIDSINNTEKT_EK(SØKER_IND);   00006780
                  B02.FAI_DATO_ÅM(EKTEF_IND) =                          00006790
                      B02.VIRK_DATO_ÅM(SØKER_IND);                      00006800
               END;                                                     00006810
         END;                                                           00006820
  /*HIT 9803*/                                                          00006830
                                                                        00006840
            IF F7S.PENSJONSINNTEKT_EK > 0   THEN                        00006850
               B02.PENSJONSINNTEKT_EK(SØKER_IND) =                      00006860
                                     F7S.PENSJONSINNTEKT_EK/100;        00006870
            ELSE                                                        00006880
               B02.PENSJONSINNTEKT_EK(SØKER_IND) = 0;                   00006890
         END;                                                           00006900
      /* FEILMELD 1108 L280 LAGT INN 04.94  JD */                       00006910
      IF B02.PENSJONSTYPE2(SØKER_IND) = 'F'          THEN               00006920
            IF F7S.ARBEIDSINNTEKT_EK > 0 !                              00006930
               F7S.PENSJONSINNTEKT_EK > 0            THEN               00006940
            DO;                                                         00006950
  L280:                                                                 00006960
                                 FEIL_VED_LABEL = '280';                00006970
                                 FEIL_MELD_NR   = 1108;                 00006980
                                 GO TO L999;                            00006990
            END;                                                        00007000
            ELSE                                                        00007010
               DO;           /*9810*/                                   00007020
                  B02.ARBEIDSINNTEKT_EK(SØKER_IND)  = 0;                00007030
                  B02.PENSJONSINNTEKT_EK(SØKER_IND) = 0;                00007040
               END;                                                     00007050
      B02.FORSI.FT_SKAL_BEREGNES(SØKER_IND) = 'J';                      00007060
                                                                        00007070
  L999:                                                                 00007080
      EXEC CICS RETURN;                                                 00007090
 %PAGE;                                                                 00007100
      %INCLUDE R001NC22;  /* AJOURFØR_B02_MED_F7_TRANS          */      00007110
 %PAGE;                                                                 00007120
      %INCLUDE R0019905;  /* F_ALDER                            */      00007130
 %PAGE;                                                                 00007140
      %INCLUDE R0019913;  /* F_SNU_DATO                         */      00007150
 %PAGE;                                                                 00007160
      %INCLUDE R0019923;  /* OPPRETT_STATUS_FORS_BARN           */      00007170
 %PAGE;                                                                 00007180
      %INCLUDE R0019924;  /* KOBLE_TO_PERSONER                  */      00007190
 %PAGE;                                                                 00007200
      %INCLUDE R0019926;  /* FLYTT_B01_TIL_B02                  */      00007210
      %INCLUDE R0019954;   /*RULL_FORVENTET*/                           00007220
   END KON_F7;                                                          00007230
