 /*       SIST ENDRET 13/12-91 12.44.42 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 22/03-91 11.25.51 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 12/05-87 09.15.20 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 22/10-85 16.23.04 AV   FARVIK                   */00000030
 /*       SIST ENDRET 23/11-84 07.18.22 AV   FARVIK                   */00000040
 /*       SIST ENDRET 05/10-84 13.57.25 AV   FARVIK                   */00000050
 /*       SIST ENDRET 17/09-84 09.26.59 AV   FARVIK                   */00000060
 /*       SIST ENDRET 11/09-84 14.13.44 AV   FARVIK                   */00000070
 R001NB:                                                                00000080
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000090
 %PAGE;                                                                 00000100
 %INCLUDE S001NB;    /*  ETTERLATTE BARN-MAPSETTET                    */00000110
 %PAGE;                                                                 00000120
 %INCLUDE P001NB01;  /*  TRANS_OMR FOR ETTERLATTE BARN                */00000130
 %PAGE;                                                                 00000140
 %INCLUDE P0019906;  /*  TRANS-OPPL-OMRÅDE (BASED)                    */00000150
 %PAGE;                                                                 00000160
 %INCLUDE P0019908;  /*  KOM-OMRÅDE (BASED)                           */00000170
 %PAGE;                                                                 00000180
 %INCLUDE P0019910;  /*  STYRINGS-OMRÅDE (BASED)                      */00000190
 %PAGE;                                                                 00000200
 %INCLUDE P0019912;  /*  DIV-PARAM-OMRÅDE (BASED)                     */00000210
 %PAGE;                                                                 00000220
 %INCLUDE DFHBMSCA;                                                     00000230
 %PAGE;                                                                 00000240
   DCL                                                                  00000250
      (BMSMAPBR,COMMAREA_PEKER)        PTR;                             00000260
   DCL                                                                  00000270
      (ADDR,UNSPEC,CSTG,ONCODE,VERIFY,SUBSTR) BUILTIN;                  00000280
   DCL                                                                  00000290
      FEIL_FUNNET      BIT (1),                                         00000300
      ONKODE           PIC'9999',                                       00000310
      CURSOR_POS       FIXED BIN(15) INIT(-1),                          00000320
      ONK DEF ONKODE   CHAR(4),                                         00000330
      FEILKODE         CHAR(4),                                         00000340
      DSNAVN           CHAR(8),                                         00000350
      ANT_FEIL_SKREVET FIXED DEC (3);                                   00000360
 %SKIP(1);                                                              00000370
 %PAGE;                                                                 00000380
      ON ERROR SNAP BEGIN       ;                                       00000390
         ON ERROR SYSTEM        ;                                       00000400
         ONKODE=ONCODE          ;                                       00000410
         FEILKODE = ONK         ;                                       00000420
         DSNAVN   = EIBDS       ;                                       00000430
         GO TO FEILBEH          ;                                       00000440
      END;                                                              00000450
                                                                        00000460
 FEILKODE   = 'FEIL'    ;                                               00000470
 DSNAVN     = '        ';                                               00000480
                                                                        00000490
 EXEC CICS HANDLE CONDITION   ERROR(FEILBEH);                           00000500
                                                                        00000510
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00000520
                                                                        00000530
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER     = ADDR(KOM_OMR.DIV_PARAM_OMR); 00000540
                                                                        00000550
 IF FRA_CICS THEN                                                       00000560
  DO;                                                                   00000570
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);00000580
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);     00000590
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);  00000600
  END;                                                                  00000610
                                                                        00000620
 IF HENT_FRAM_MAP  THEN                                                 00000630
    DO;                                                                 00000640
       EXEC CICS SEND MAP('S001NB1') MAPSET('S001NB3') MAPONLY          00000650
                                                         SET (BMSMAPBR);00000660
      ALLOCATE S001NB1O;                                                00000670
      S001NB1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                    00000680
    END;                                                                00000690
                                                                        00000700
 RECEIVE_MAP:                                                           00000710
                                                                        00000720
                                                                        00000730
 IF ^HENT_FRAM_MAP THEN                                                 00000740
    DO;                                                                 00000750
       EXEC CICS RECEIVE MAP('S001NB1')                                 00000760
                                    MAPSET('S001NB3') SET(BMSMAPBR);    00000770
       CALL BLANK_B6_MELDNR;                                            00000780
       FEIL_MELD_NR = 0;                                                00000790
    END;                                                                00000800
 IF FUNKSJONSKODEL > 0 THEN                                             00000810
    DO;                                                                 00000820
       FUNKSJONSKODE = FUNKSJONSKODEI;                                  00000830
       EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);            00000840
    END;                                                                00000850
                                                                        00000860
 IF STYRE_KODEL > 0 THEN                                                00000870
    DO;                                                                 00000880
       STYREKODE = STYRE_KODEI;                                         00000890
       TRANSKODE = 'R041';                                              00000900
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00000910
    END;                                                                00000920
                                                                        00000930
                                                                        00000940
 IF STYREKODE ^= 'B6'  &  FRA_CICS THEN                                 00000950
    TRANSKODE  = 'R041';                                                00000960
 ELSE                                                                   00000970
    DO;                                                                 00000980
       TRANS_RETURKODE = TRANSKODE;                                     00000990
       SELECT (TRANSKODE);                                              00001000
         WHEN('RNB0')                                                   00001010
            DO;                                                         00001020
               CALL BLANK_B6_BARN;                                      00001030
               CALL BLANK_B6_AVD;                                       00001040
               CALL BLANK_B6_GEN;                                       00001050
               CALL BLANK_B6_MELDNR;                                    00001060
               CALL OVERFØR_B6_BARN;                                    00001070
               CALL OVERFØR_B6_GEN;                                     00001080
               CALL OVERFØR_B6_AVD;                                     00001090
               CALL KONTROLL_ETTERLATTE_BARN_EN(FEIL_FUNNET);           00001100
            END;                                                        00001110
         WHEN('RNB1')                                                   00001120
            DO;                                                         00001130
               CALL BLANK_B6_MELDNR;                                    00001140
               CALL OVERFØR_B6_BARN;                                    00001150
               CALL OVERFØR_B6_GEN;                                     00001160
               CALL OVERFØR_B6_AVD;                                     00001170
               CALL KONTROLL_ETTERLATTE_BARN_EN(FEIL_FUNNET);           00001180
            END;                                                        00001190
         OTHERWISE;                                                     00001200
 /*       INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER */00001210
       END;    /*  SELECT  */                                           00001220
                                                                        00001230
 IF FEIL_FUNNET ! HENT_FRAM_MAP ! FRA_UTEN_DIALOG !                     00001240
                                    TRANS_RETURKODE ^= TRANSKODE THEN   00001250
    DO;                                                                 00001260
       IF TRANSKODE = 'RNB0' THEN                                       00001270
          TRANSKODE = 'RNB1';                                           00001280
          EXEC CICS SEND MAP('S001NB1') MAPSET('S001NB3') ERASEAUP      00001290
                                                       DATAONLY CURSOR; 00001300
       CALL BLANK_B6_MAP;                                               00001310
       CALL OVERFØR_B6_MAP;                                             00001320
                                                                        00001330
       IF HENT_FRAM_MAP THEN                                            00001340
          EXEC CICS SEND MAP('S001NB1') MAPSET('S001NB3') ERASE CURSOR; 00001350
       ELSE                                                             00001360
          EXEC CICS SEND MAP('S001NB1') MAPSET('S001NB3') ERASEAUP      00001370
                                                       DATAONLY CURSOR; 00001380
                                                                        00001390
       FEIL_MELD_NR  = 666;/* => FEIL_FUNNET ER SATT. */                00001400
                                                                        00001410
       HENT_FRAM_MAP = '0'B;                                            00001420
                                                                        00001430
       IF FRA_CICS THEN                                                 00001440
          EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);        00001450
       ELSE                                                             00001460
          GOTO RECEIVE_MAP;                                             00001470
    END;                                                                00001480
 ELSE                                                                   00001490
    DO;                                                                 00001500
       IF TRANSKODE       = 'RNB0' THEN                                 00001510
          TRANS_RETURKODE = 'RNB1';                                     00001520
       ELSE                                                             00001530
          TRANS_RETURKODE = TRANSKODE;                                  00001540
       IF FRA_CICS  THEN                                                00001550
          DO;                                                           00001560
             BLANKETTYPE  = STYREKODE;                                  00001570
             TRANSKODE    = 'R042';                                     00001580
          END;                                                          00001590
    END;                                                                00001600
 END;                                                                   00001610
                                                                        00001620
  CALL UTGANG;                                                          00001630
                                                                        00001640
  UTGANG: PROC;                                                         00001650
    IF FRA_CICS THEN                                                    00001660
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00001670
    ELSE                                                                00001680
       EXEC CICS RETURN;                                                00001690
  END UTGANG;                                                           00001700
                                                                        00001710
  FEILBEH:                                                              00001720
                                                                        00001730
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00001740
                                                                        00001750
     PROGRAM_ID = 'R001NB01';                                           00001760
                                                                        00001770
     ALLOCATE S001NB1O;                                                 00001780
      S001NB1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                    00001790
                                                                        00001800
     S001NB1O.MELDING2O =                                               00001810
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00001820
                                                                        00001830
     S001NB1O.MELDING3O =                                               00001840
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00001850
                                                                        00001860
     S001NB1O.MELDING4O =                                               00001870
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00001880
                                         !! '. DATASETT : ' !! DSNAVN;  00001890
                                                                        00001900
     S001NB1O.MELDING5O =                                               00001910
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00001920
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00001930
                                                                        00001940
     S001NB1O.MELDING6O =                                               00001950
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00001960
                                                                        00001970
                                                                        00001980
     EXEC CICS SEND MAP('S001NB1')                                      00001990
                                                 MAPSET('S001NB3');     00002000
                                                                        00002010
     EXEC CICS RECEIVE MAP('S001NB1')                                   00002020
                                    MAPSET('S001NB3') SET(BMSMAPBR);    00002030
                                                                        00002040
                                                                        00002050
     EXEC CICS SYNCPOINT ROLLBACK;                                      00002060
                                                                        00002070
                                                                        00002080
     TERMINERINGS_IND = 'F';                                            00002090
                                                                        00002100
     TRANSKODE  = 'R041';                                               00002110
                                                                        00002120
     CALL UTGANG;                                                       00002130
                                                                        00002140
  ABEND:                                                                00002150
     EXEC CICS ABEND ABCODE(FEIL);                                      00002160
                                                                        00002170
  PF1:                                                                  00002180
                                                                        00002190
 /* LEGGER UNDERKJENT TRANS UT PÅ VENTEDATABASE HVIS GYLDIG     */      00002200
 /* FNR OG VIRKNINGSDATO,ELLERS FORKASTES TRANSAKSJONEN.        */      00002210
                                                                        00002220
     IF ^(B6B.TAB.FNR_BARNNR(1) = 1   !                                 00002230
          B6B.TAB.FNR_BARNNR(1) = 200 !                                 00002240
          B6B.VIRK_DATO_MÅNR = 9      !                                 00002250
          B6B.VIRK_DATO_MÅNR = 10     !                                 00002260
          B6B.VIRK_DATO_MÅNR = 77     !                                 00002270
          B6B.VIRK_DATO_MÅNR = 200) THEN                                00002280
        DO;                                                             00002290
                                                                        00002300
           IF FØDSNUMMER    = 0   THEN                                  00002310
                                                                        00002320
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER FORKASTET.           */      00002330
                                                                        00002340
              DO;                                                       00002350
                 FEIL_MELD_NR  = 0;                                     00002360
                 S001NB1O.MELDING6O =                                   00002370
                         'REGISTERINGEN ER IKKE AVSLUTTET MED "ENTER"'!!00002380
                         '.TRANSAKSJONEN ER FORKASTET.';                00002390
                                                                        00002400
              END;                                                      00002410
           ELSE                                                         00002420
              DO;                                                       00002430
                                                                        00002440
                 SEARCH_FNR  = TRANS_OPPL_OMR.FØDSNUMMER;               00002450
                 IF FRA_CICS THEN                                       00002460
                    BLANKETTYPE = STYREKODE;                            00002470
                                                                        00002480
                                                                        00002490
                 IF FEIL_MELD_NR = 666 &      /*BLANKETTKONTROLLFEIL*/  00002500
                    ^FRA_MED_DIALOG     THEN  /*IKKE BASEKONTROLLFEIL*/ 00002510
                    FUNKSJONSKODE = 'B';                                00002520
                                                                        00002530
                 EXEC CICS LINK PROGRAM('R0010490') COMMAREA(KOM_OMR);  00002540
                                                                        00002550
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER LAGT UT PÅ VENTEBASE.*/      00002560
                                                                        00002570
                 S001NB1O.MELDING6O =                                   00002580
                         'TRANSAKSJONEN ER LAGT UT PÅ VENTEREGISTER.';  00002590
              END;                                                      00002600
                                                                        00002610
           EXEC CICS SEND MAP('S001NB1') MAPSET('S001NB3')              00002620
                                                           DATAONLY;    00002630
     /* DUMMY SEND-KALL.                              */                00002640
                                                                        00002650
           EXEC CICS SEND MAP('S001NB1')                                00002660
                                                  MAPSET('S001NB3');    00002670
           EXEC CICS DELAY INTERVAL(005);                               00002680
                                                                        00002690
           TERMINERINGS_IND = 'F';                                      00002700
                                                                        00002710
           TRANSKODE  = 'R041';                                         00002720
                                                                        00002730
           CALL UTGANG;                                                 00002740
                                                                        00002750
        END;                                                            00002760
     ELSE                                                               00002770
        DO;                                                             00002780
           TERMINERINGS_IND = 'F';                                      00002790
                                                                        00002800
           TRANSKODE = 'R041';                                          00002810
                                                                        00002820
           S001NB1O.MELDING6O =                                         00002830
                                                                        00002840
 'NB* TRANSAKSJONEN ER FORKASTET.FNR ELLLER VDATO ER IKKE GODKJENT.*NB';00002850
                                                                        00002860
           EXEC CICS SEND MAP('S001NB1') MAPSET('S001NB3')              00002870
                                                           DATAONLY;    00002880
     /* DUMMY SEND-KALL.                            */                  00002890
                                                                        00002900
           EXEC CICS SEND MAP('S001NB1')                                00002910
                                    MAPSET('S001NB3');                  00002920
                                                                        00002930
           EXEC CICS DELAY INTERVAL(005);                               00002940
           CALL UTGANG;                                                 00002950
        END;                                                            00002960
                                                                        00002970
                                                                        00002980
  PF2:                                                                  00002990
     TERMINERINGS_IND   = 'F';                                          00003000
                                                                        00003010
     S001NB1O.MELDING6O =                                               00003020
      'NBNBNBNBNB***    TRANSAKSJONEN ER FORKASTET.    ***NBNBNBNBNB';  00003030
                                                                        00003040
     EXEC CICS SEND MAP('S001NB1') MAPSET('S001NB3')                    00003050
                                                      DATAONLY ;        00003060
     /* DUMMY SEND-KALL.                                     */         00003070
                                                                        00003080
     EXEC CICS SEND MAP('S001NB1')                                      00003090
                                    MAPSET('S001NB3');                  00003100
     EXEC CICS DELAY INTERVAL(005);                                     00003110
                                                                        00003120
                                                                        00003130
     TRANSKODE = 'R041';                                                00003140
                                                                        00003150
     CALL UTGANG;                                                       00003160
                                                                        00003170
 %PAGE;                                                                 00003180
 %INCLUDE R001NB02;  /* BLANK  ARBEIDSOMRÅDE                          */00003190
 %PAGE;                                                                 00003200
 %INCLUDE R001NB03;  /* KONTROLL AV SØKERDELEN                        */00003210
 %PAGE;                                                                 00003220
 %INCLUDE R001NB06;  /* ARBEIDSOMRÅDE -> MAP                          */00003230
 %PAGE;                                                                 00003240
 %INCLUDE R001NB09;  /* MAP -> ARBEIDSOMRÅDE                          */00003250
 %PAGE;                                                                 00003260
 %INCLUDE R0019901;  /* TESTER OM DATO ER GYLDIG                      */00003270
 %PAGE;                                                                 00003280
 %INCLUDE R0019902;  /* FINNE KJØNN                                   */00003290
 %PAGE;                                                                 00003300
 %INCLUDE R0019904;  /* FØDSELSNUMMERKONTROLL                         */00003310
 %PAGE;                                                                 00003320
 %INCLUDE R0019905;  /* BEREGNER ALDER                                */00003330
 %PAGE;                                                                 00003340
 %INCLUDE R0019908;  /* DAGENS DATO PLUSS 1                           */00003350
 %PAGE;                                                                 00003360
 %INCLUDE R0019910;  /* NUMERISK KONTROLL                             */00003370
 %PAGE;                                                                 00003380
 %INCLUDE R0019911;  /*  DATO KONTROLL                                */00003390
 %PAGE;                                                                 00003400
 %INCLUDE R0019912;  /* KONVERTERING CHAR ==> PIC / PIC ==> CHAR      */00003410
 %PAGE;                                                                 00003420
 %INCLUDE R0019944;  /* SKRIV_FEIL                                    */00003430
                                                                        00003440
 END R001NB;                                                            00003450
