 /*       SIST ENDRET 12/05-87 08.35.34 AV   DYBVIK                   */00000000
 %PAGE;                                /*   */                          00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /*    R0011509  -                                                    */00000030
 /*    PROGRAMMERER: JAN, SEPTEMBER 81                                */00000040
 /*HENSIKT:                                                           */00000050
 /*    R0011509 INNEHOLDER:                                           */00000060
 /*      PROSEDYRE FOR BLANKING AV E2_MAP.                            */00000070
 /*      PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL        */00000080
 /*           E2_TRANS_OMR.                                           */00000090
 /*      PROSEDYRENE ER SKILT UT FRA R0011502      070587  BRITT      */00000100
 /*PROGRAMTILKNYTNING:                                                */00000110
 /*    PROSEDYRENE INCLUDES I BEHANDLING AV ENDRING AV TKNR           */00000120
 /*    TIL DET MASKINELLE FOLKETRYGDSYSTEMET.                         */00000130
 /*    ARBEIDSOMRÅDE: P0011501  (LIGGER I R001.TEST.COPYLIB)          */00000140
 /*BRUK:                                                              */00000150
 /*    %INCLUDE R0011509;                                             */00000160
 /*    BLANK_E2_MAP:      SETTER LOW VALUES I MAPEN, SAMT             */00000170
 /*                       BLANKER MELDINGSFELTENE.                    */00000180
 /*    OVERFØR_E2_SØKER:  OVERFØRER E2DELEN MAP->ARBEIDSOMRÅDE        */00000190
 %PAGE;                                                                 00000200
 /* ***************************************************************** */00000210
 /*                                                                   */00000220
 /*   PROSEDYRE FOR Å SETTE LOW VALUES I MAPEN OG BLANKE              */00000230
 /*   MELDINGSFELTENE.                                                */00000240
 /*                                                                   */00000250
 /* ***************************************************************** */00000260
 %SKIP;                                                                 00000270
   BLANK_E2_MAP:                                                        00000280
      PROC;                                                             00000290
   DCL                                                                  00000300
     LOW BUILTIN;                                                       00000310
     TKNR_FRAO = LOW(4);                                                00000320
     TKNR_TILO = LOW(4);                                                00000330
     MELDING1O = (78)' ';                                               00000340
     MELDING2O = (78)' ';                                               00000350
     MELDING3O = (78)' ';                                               00000360
     MELDING4O = (78)' ';                                               00000370
     MELDING5O = (78)' ';                                               00000380
     MELDING6O = (78)' ';                                               00000390
   END BLANK_E2_MAP;                                                    00000400
 %PAGE;                                /*   */                          00000410
 /* ***************************************************************** */00000420
 /*                                                                   */00000430
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,                    */00000440
 /*   EVENTUELT ENDRA PÅ SKJERMBILDET TIL E2_TRANS_OMR I              */00000450
 /*   KOM_OMR FOR E2_SØKER.                                           */00000460
 /*           MAPSET:  S001153   MAP S001151                          */00000470
 /*                                                                   */00000480
 /* ***************************************************************** */00000490
 %SKIP;                                                                 00000500
 OVERFØR_E2_SØKER:                                                      00000510
   PROC;                                                                00000520
      IF TKNR_FRAL > 0 THEN                                             00000530
           E2S.TKNR_FRA = F_FELT_CHAR_PIC4 (TKNR_FRAI);                 00000540
      IF FNRL > 0 THEN                                                  00000550
           E2S.FNR = F_FELT_CHAR_PIC11 (FNRI);                          00000560
      IF TKNR_TILL > 0 THEN                                             00000570
           E2S.TKNR_TIL = F_FELT_CHAR_PIC4 (TKNR_TILI);                 00000580
   END OVERFØR_E2_SØKER;                                                00000590
