 /*       SIST ENDRET 15/05-97 08.56.45 AV   JDA7339                  */00000000
 /*       SIST ENDRET 04/05-95 08.02.23 AV   HLB0310                  */00000010
 /*       SIST ENDRET 04/05-95 07.54.05 AV   HLB0310                  */00000020
 /*       SIST ENDRET 08/03-95 07.53.34 AV   HLB0310                  */00000030
 /*       SIST ENDRET 12/09-94 12.09.47 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 25/07-94 13.50.29 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 25/02-94 12.32.35 AV   HERMAN                   */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /*    R001UC04 - PROGRAM I PLI                                       */00000080
 /*    PROGRAMMERT AV HERMAN NOV 93                                   */00000090
 /*HENSIKT:                                                           */00000100
 /*    PROGRAMMET BEHANDLER BARNEDELEN.                               */00000110
 /*ENDRING:                                                           */00000120
 /*    PROGRAMMET OVERFØR_FO_BARN ER SKILT UT OG LAGT I R001UC10.     */00000130
 /*                                                                   */00000140
 /*BRUK:                                                              */00000150
 /*    KONTROLL_FO_BARN                                               */00000160
 /*       (FEIL_FUNNET)                                               */00000170
 /*                                                                   */00000180
 /* ***************************************************************** */00000190
 %SKIP(2);                                                              00000200
 KONTROLL_FO_BARN:                                                      00000210
   PROC (FEIL_FUNNET);                                                  00000220
 %SKIP;                                                                 00000230
   DCL                                                                  00000240
      FEIL_FUNNET BIT (1);                                              00000250
   DCL                                                                  00000260
      1 FNR_REG,                                                        00000270
        2 FNR1         FIXED DEC(11),                                   00000280
        2 FNR2         FIXED DEC(11),                                   00000290
        2 BRUKERID     CHAR     ( 4);                                   00000300
    DCL   FELLES_BARN_J  CHAR     ( 1),                                 00000310
          FELLES_BARN_N  CHAR     ( 1);                                 00000320
   DCL                                                                  00000330
      (FEIL19,                                                          00000340
      FEIL20,                                                           00000350
      FEIL21,                                                           00000360
      FEIL22) BIT (1);                                                  00000370
      FEIL19 = '0'B;                                                    00000380
      FEIL20 = '0'B;                                                    00000390
      FEIL21 = '0'B;                                                    00000400
      FEIL22 = '0'B;                                                    00000410
   DCL                                                                  00000420
      TELL                        FIXED BIN(15),                        00000430
      TELL_BARN                   FIXED BIN(15),                        00000440
      ANT_BARN                    FIXED BIN(15);                        00000450
   DCL                                                                  00000460
      ALDER FIXED(5);                                                   00000470
   DCL HJ_VIRK_DATO_ÅM            PIC '(4)9';                           00000480
   DCL FELLES_FØR                 CHAR (1)  INIT (' ');                 00000490
                                                                        00000500
 /*PROGRAMMET BEGYNNER HER:*/                                           00000510
                                                                        00000520
      HJ_VIRK_DATO_ÅM = F_SNU_DATO(FOS.VIRK_DATO_MÅ);                   00000530
      TELL_BARN = 0;                                                    00000540
      FELLES_BARN_N = ' ';                                              00000550
      FELLES_BARN_J = ' ';                                              00000560
      FNR_REG.BRUKERID =    DIV_PARAM_OMR.CICS_IND;                     00000570
                                                                        00000580
      CALL BLANK_FO_BARN_REST;                                          00000590
                                                                        00000600
      DO ANT_BARN = 1 TO FOS.BT_ANT;                                    00000610
         IF F_FELT_PIC_CHAR11(FOB.FNR_BARN(ANT_BARN)) ^= (11)'0' THEN   00000620
            DO;                                                         00000630
               IF ^F_NUMERISK(F_FELT_PIC_CHAR11(FOB.FNR_BARN(ANT_BARN)))00000640
               THEN                                                     00000650
                  DO;                                                   00000660
                     IF ^FEIL19 THEN                                    00000670
                        DO;                                             00000680
                           FEIL19 = '1'B;                               00000690
                           FOB.FNR_BARNNR(ANT_BARN) = 200;              00000700
                        END;                                            00000710
                     ELSE                                               00000720
                        FOB.FNR_BARNNR(ANT_BARN) = 200;                 00000730
                  END;                                                  00000740
               ELSE                                                     00000750
               IF ^ F_GYLDIG_FNR(FOB.FNR_BARN(ANT_BARN)) THEN           00000760
                  DO;                                                   00000770
                     IF ^FEIL20 THEN                                    00000780
                        DO;                                             00000790
                           FEIL20 = '1'B;                               00000800
                           FOB.FNR_BARNNR(ANT_BARN) = 20;               00000810
                        END;                                            00000820
                     ELSE                                               00000830
                        FOB.FNR_BARNNR(ANT_BARN) = 999;                 00000840
                  END;                                                  00000850
               ELSE                                                     00000860
                  DO;                                                   00000870
                    FNR_REG.FNR1 = FOB.FNR_BARN(ANT_BARN);              00000880
                    EXEC CICS LINK PROGRAM('R0019906')COMMAREA(FNR_REG);00000890
                    IF FNR_REG.FNR2 > 0 THEN                            00000900
                      DO;                                               00000910
                         FOB.FNR_BARNNR(ANT_BARN) = 203;                00000920
                         FOB.FNR_GML_BARN(ANT_BARN) =                   00000930
                         FOB.FNR_BARN(ANT_BARN);                        00000940
                         FOB.FNR_BARN(ANT_BARN) = FNR_REG.FNR2;         00000950
                      END;                                              00000960
                     ALDER =                                            00000970
                     F_ALDER(FOB.FNR_BARN(ANT_BARN),FOS.VIRK_DATO_MÅ);  00000980
                     IF ALDER > 1800 THEN                               00000990
                        DO;                                             00001000
                           IF ^FEIL21 THEN                              00001010
                              DO;                                       00001020
                                 FEIL21 = '1'B;                         00001030
                                 FOB.FNR_BARNNR(ANT_BARN) = 21;         00001040
                              END;                                      00001050
                           ELSE                                         00001060
                              FOB.FNR_BARNNR(ANT_BARN) = 999;           00001070
                        END;                                            00001080
                     ELSE                                               00001090
                     IF HJ_VIRK_DATO_ÅM > 9100 THEN                     00001100
                       DO;                                              00001110
                        IF ALDER < 1 THEN                               00001120
                           DO;                                          00001130
                              IF ^FEIL22 THEN                           00001140
                                 DO;                                    00001150
                                    FEIL22 = '1'B;                      00001160
                                    FOB.FNR_BARNNR( ANT_BARN) = 22;     00001170
                                 END;                                   00001180
                              ELSE                                      00001190
                                 FOB.FNR_BARNNR( ANT_BARN) = 999;       00001200
                           END;                                         00001210
                       END;                                             00001220
                     ELSE                                               00001230
                        IF ALDER < 0 THEN                               00001240
                           DO;                                          00001250
                              IF ^FEIL22 THEN                           00001260
                                 DO;                                    00001270
                                    FEIL22 = '1'B;                      00001280
                                    FOB.FNR_BARNNR( ANT_BARN) = 22;     00001290
                                 END;                                   00001300
                              ELSE                                      00001310
                                 FOB.FNR_BARNNR( ANT_BARN) = 999;       00001320
                           END;                                         00001330
                  END;                                                  00001340
               IF HJ_VIRK_DATO_ÅM > 9104                 THEN           00001350
                  DO;                                                   00001360
                     IF FOB.FELLES_ETTER0591(ANT_BARN) = 'J' !          00001370
                        FOB.FELLES_ETTER0591(ANT_BARN) = 'N' THEN       00001380
                           FOB.FELLES_FØR0591(ANT_BARN) = ' ';          00001390
                     ELSE                                               00001400
                        DO;                                             00001410
                           FEIL_FUNNET = '1'B;                          00001420
                           FOB.FELLES_ETTER0591NR(ANT_BARN) = 272;      00001430
                        END;                                            00001440
                     IF FOB.FELLES_ETTER0591(ANT_BARN) = 'J' THEN       00001450
                        FELLES_BARN_J = 'J';                            00001460
                                                                        00001470
                     IF FOB.FELLES_ETTER0591(ANT_BARN) = 'N' &          00001480
                        ARBEIDSINNTEKT_EK > 0               THEN        00001490
                           FELLES_BARN_N = 'J';                         00001500
                  END;                                                  00001510
               ELSE /*VIRKDATO ER DA FØR 9105*/                         00001520
                  DO;                                                   00001530
                     IF ^ (FELLES_FØR0591(ANT_BARN) = 'J'   !           00001540
                           FELLES_FØR0591(ANT_BARN) = 'N' )   THEN      00001550
                        DO;                                             00001560
                           FEIL_FUNNET = '1'B;                          00001570
                           FOB.FELLES_FØR0591NR(ANT_BARN) = 272;        00001580
                        END;                                            00001590
                     ELSE                                               00001600
                        DO;                                             00001610
                           FELLES_FØR = 'J';                            00001620
                           FOB.FELLES_ETTER0591(ANT_BARN) = ' ' ;       00001630
                        END;                                            00001640
                           IF FOS.FNR_EK = 0  THEN                      00001650
                              FELLES_FØR = ' ';                         00001660
                  END;                                                  00001670
                                                                        00001680
               TELL_BARN = TELL_BARN + 1;                               00001690
            END;                                                        00001700
         ELSE                                                           00001710
            LEAVE;                                                      00001720
      END;                                                              00001730
      IF FELLES_BARN_J = ' ' &                                          00001740
         FELLES_BARN_N = 'J' THEN                                       00001750
         DO;                                                            00001760
           FOB.FELLES_ETTER0591NR(1) = 384;                             00001770
           FEIL_FUNNET = '1'B;                                          00001780
         END;                                                           00001790
      IF FELLES_FØR = 'J'  &                                            00001800
         MINST_4G = ' '          THEN                                   00001810
           DO;                                                          00001820
              FEIL_FUNNET = '1'B;                                       00001830
              MINST_4GNR   = 493;                                       00001840
           END;                                                         00001850
                                                                        00001860
      IF ^ FEIL_FUNNET THEN                                             00001870
        IF FOS.BT_ANT ^= TELL_BARN THEN                                 00001880
           DO;                                                          00001890
              FEIL_FUNNET = '1'B;                                       00001900
              FOS.BT_ANTNR = 23;                                        00001910
           END;                                                         00001920
                                                                        00001930
      FEIL_FUNNET = FEIL_FUNNET ! FEIL19 ! FEIL20 ! FEIL21 ! FEIL22;    00001940
                                                                        00001950
  /*  HER SJEKKES OM ET FØDSELSNUMMER ER SKREVET MER ENN EN GANG    */  00001960
      IF ^FEIL_FUNNET THEN                                              00001970
        IF FOS.BT_ANT > 0 THEN                                          00001980
           DO ANT_BARN = 1 TO FOS.BT_ANT;                               00001990
              DO TELL = ANT_BARN TO FOS.BT_ANT;                         00002000
                 IF TELL ^= ANT_BARN THEN                               00002010
                    IF FOB.FNR_BARN(TELL) = FOB.FNR_BARN(ANT_BARN) THEN 00002020
                       DO;                                              00002030
                          FEIL_FUNNET = '1'B;                           00002040
                          FOB.FNR_BARNNR(ANT_BARN) = 124;               00002050
                          FOB.FNR_BARNNR(TELL) = 999;                   00002060
                       END;                                             00002070
              END;                                                      00002080
           END;                                                         00002090
                                                                        00002100
   END KONTROLL_FO_BARN;                                                00002110
                                                                        00002120
                                                                        00002130
