 /*       SIST ENDRET 15/04-83 08.21.48 AV   FARVIK                   */00000000
 /*       SIST ENDRET 11/10-82 11.32.24 AV   LUNDEBY                  */00000010
 /*       SIST ENDRET 23/08-82 09.58.09 AV   OLAV                     */00000020
 /* ***************************************************************** */00000030
 /* IDENTIFIKASJON:  R0017401                                         */00000040
 /* PROGRAMMERER:    HELEN,  JULI 1982 .                              */00000050
 /* HENSIKT:                                                          */00000060
 /*         PROGRAMMET UNDERSØKER PENSJONSTYPE TIL STØNADSBREV-       */00000070
 /*         MOTTAGER OG KALLER OPP RUTINEN SOM LEGGER INFORMASJON     */00000080
 /*         I HENDELSE_SEGMENTET I ST.BREV BASEN.                     */00000090
 /* PROGRAM-TILKNYTNING:                                              */00000100
 /*         INCLUDES I R0017001 (LAG_STØNADSBREV_TRANSER)             */00000110
 /*                                                                   */00000120
 /* ***************************************************************** */00000130
 LAG_SB_GRUNNLAG_IKKE_BARN:                                             00000140
     PROC (PERS_IND,EK_IND) ;                                           00000150
 DCL  PERS_IND         FIXED BIN (15);                                  00000160
 DCL  EK_IND           FIXED BIN (15);                                  00000170
 /* ***************************************************************** */00000180
 /* PROGRAMMET BEGYNNER HER.                                          */00000190
 /* ***************************************************************** */00000200
    SELECT (B02.PERSON.STATUS.PENSJONSTYPE1(PERS_IND));                 00000210
 /* ***************************************************************** */00000220
 /* PERSONEN ER ALDERSPENSJONIST.                                     */00000230
 /* ***************************************************************** */00000240
       WHEN   ('A')                                                     00000250
          DO;                                                           00000260
 /* ***************************************************************** */00000270
 /* PERSONEN HAR ETTERLATTE RETTIGHETER.                              */00000280
 /* ***************************************************************** */00000290
             IF B02.PERSON.PENSJONSTYPE2(PERS_IND) = 'E' &              00000300
                B02.PERSON.ETTEPENS.TP_BRUTTO(PERS_IND) > 0     THEN    00000310
                CALL LAG_ETTERL_ALDERSP_HEND(PERS_IND);                 00000320
             ELSE                                                       00000330
                CALL LAG_ALDERSP_HEND(PERS_IND,EK_IND);                 00000340
          END;                                                          00000350
 /* ***************************************************************** */00000360
 /* PERSONEN ER UFØREPENSJONIST.                                      */00000370
 /* ***************************************************************** */00000380
       WHEN   ('U')                                                     00000390
          DO;                                                           00000400
 /* ***************************************************************** */00000410
 /* PERSONEN HAR ETTERLATTE RETTIGHETER.                              */00000420
 /* ***************************************************************** */00000430
             IF B02.PERSON.PENSJONSTYPE2(PERS_IND) = 'E' &              00000440
                B02.PERSON.UFØRPENS.TP(PERS_IND) = 0   THEN             00000450
                CALL LAG_ETTERL_UFØRPENS_HEND(PERS_IND);                00000460
             ELSE                                                       00000470
                CALL LAG_UFØRPENS_HEND(PERS_IND,EK_IND);                00000480
          END;                                                          00000490
 /* ***************************************************************** */00000500
 /* PERSONEN ER ETTERLATT EKTEFELLE.                                  */00000510
 /* ***************************************************************** */00000520
       WHEN   ('E')                                                     00000530
           CALL LAG_ETTERLATT_HEND(PERS_IND);                           00000540
 /* ***************************************************************** */00000550
 /* PERSONEN ER ETTERLATT FAMILIE PERSON.(PENSJONSTYPE1 = 'J')        */00000560
 /* ***************************************************************** */00000570
       OTHERWISE                                                        00000580
           CALL LAG_ETTERL_FAM_HEND(PERS_IND);                          00000590
       END;                                                             00000600
 END LAG_SB_GRUNNLAG_IKKE_BARN;                                         00000610
