 /*       SIST ENDRET 13/05-98 11.09.38 AV   TSB7339                  */00000000
 /*       SIST ENDRET 13/05-98 11.05.45 AV   TSB7339                  */00000010
 /*       SIST ENDRET 05/12-97 12.39.15 AV   JDA7339                  */00000020
 /*       SIST ENDRET 27/11-97 11.46.57 AV   JDA7339                  */00000030
 /*       SIST ENDRET 31/10-97 12.19.09 AV   JDA7339                  */00000040
 /*       SIST ENDRET 16/10-97 09.26.04 AV   HLA7339                  */00000050
 /*       SIST ENDRET 28/11-96 08.59.43 AV   JDA0310                  */00000060
 /*       SIST ENDRET 17/08-95 13.11.20 AV   TSB0310                  */00000070
 /* ***************************************************************** */00000080
 /*IDENTIFIKASJON:                                                    */00000090
 /* **********************                                            */00000100
 /*  PROGRAM-IDENT : R001NO10  BEHANDLING AV GRUNNBLANKETTER          */00000110
 /*                            REGISTRERT I NORTRYGD-PENSJONER        */00000120
 /*                            ELLER INFOTRYGDS GRUNNBLANKETT-RUTINE. */00000130
 /*  PROGRAM-SPRÅK : PLI/CICS                     HOVEDPROGRAM        */00000140
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */00000150
 /*  PROGRAMMET BLE LAGET : 1986                                      */00000160
 /*  ENDRINGSDATO :  NOV 90                                           */00000170
 /*  ENDRINGEN GJELDER: NYE GRUNNBLANKETTER A1,U2,E3,B6,F7            */00000180
 /*  ENDRINGEN BLE UTFØRT AV :   TRUDE                                */00000190
 /*  ENDRINGSDATO :  FEB 94                                           */00000200
 /*  ENDRINGEN GJELDER: NYE GRUNNBLANKETTER U3                        */00000210
 /*  ENDRINGEN BLE UTFØRT AV :   HERMAN                               */00000220
 /*                                                                   */00000230
 /* ***************************************************************** */00000240
 /*HENSIKT:                                                           */00000250
 /* **********                                                        */00000260
 /*  PROGRAMMET LESER RECORDS SOM ER OVERFØRT FRA NORTRYGD ELLER      */00000270
 /*  INFOTRYGD.  DISSE INNEHOLDER GRUNNBLANKTETT-OPPLYSNINGER.        */00000280
 /*  PROGRAMMET KONTROLLERER OPPLYSNINGENE PÅ RECORDEN, OG SENDER     */00000290
 /*  TRANSAKSJONEN INN I DET VANLIGE REGISTRERINGSSYSTEMET, VIA       */00000300
 /*  R0013001.                                                        */00000310
 /*                                                                   */00000320
 /* ***************************************************************** */00000330
 /*PROGRAMTILKNYTTING:                                                */00000340
 /* ********************                                              */00000350
 /*  BLIR GITT KONTROLL V EXEC CICS XCTL FRA R0010426.                */00000360
 /*                                                                   */00000370
 /*  EXEC CICS LINK TIL :                                             */00000380
 /*                                                                   */00000390
 /*     R0013001   BEHANDLE TRANS                                     */00000400
 /*     R0012201   BEHANDLE EP,BP                                     */00000410
 /*     R0016501   STATISTIKK                                         */00000420
 /*     R0019921   HENT FEILMELD. FRA FEILMELD-BASEN                  */00000430
 /*                                                                   */00000440
 /*  EXEC CICS XCTL TIL :                                             */00000450
 /*                                                                   */00000460
 /*     R0010301   BEHANDLE TRANS                                     */00000470
 /*     R0010420   BEHANDLE EP,BP                                     */00000480
 /*                                                                   */00000490
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */00000500
 /*                                                                   */00000510
 /*     R001NO11   KONTROLL AP-BLANKETT                               */00000520
 /*     R001NN11   KONTROLL A1-BLANKETT                               */00000530
 /*     R001NO12   KONTROLL UP-BLANKETT                               */00000540
 /*     R001NN12   KONTROLL U2-BLANKETT                               */00000550
 /*     R001NU12   KONTROLL U3-BLANKETT                               */00000560
 /*     R001NO13   KONTROLL EP-BLANKETT                               */00000570
 /*     R001NN13   KONTROLL E3-BLANKETT                               */00000580
 /*     R001NO14   KONTROLL BP-BLANKETT                               */00000590
 /*     R001NN14   KONTROLL B6-BLANKETT                               */00000600
 /*     R001NO15   KONTROLL FT-BLANKETT                               */00000610
 /*     R001NN15   KONTROLL F7-BLANKETT                               */00000620
 /*     R001NO16   KONTROLL E1-BLANKETT                               */00000630
 /*     R001NU16   KONTROLL EN-BLANKETT                               */00000640
 /*     R001NO17   KONTROLL O1-BLANKETT                               */00000650
 /*     R001NO18   KONTROLL O2-BLANKETT                               */00000660
 /*     R001NO19   KONTROLL E2-BLANKETT                               */00000670
 /*     R001NO1A   KONTROLL AFP-BLANKETT                              */00000680
 /*     R001NU1A   KONTROLL KFP-BLANKETT                              */00000690
 /*     R001NO1B   KONTROLL AU-BLANKETT                               */00000700
 /*     R0010508   TT_AP                                              */00000710
 /*     R0010608   TT_UP_EP                                           */00000720
 /*     R0019901   F_GYLDIG_DATO                                      */00000730
 /*     R0019902   F_KJØNN                                            */00000740
 /*     R0019903   F_EK_ALDER                                         */00000750
 /*     R0019904   F_GYLDIG_FNR                                       */00000760
 /*     R0019905   F_ALDER                                            */00000770
 /*     R0019907   F_TABSØKC_FUNNET                                   */00000780
 /*     R0019908   F_DAGS_DATO_PLUSS1_MÅ                              */00000790
 /*     R0019909   F_KONTROLL_TT                                      */00000800
 /*     R0019910   F_NUMERISK                                         */00000810
 /*     R0019911   F_GYLDIG_DATO_DMÅ                                  */00000820
 /*     R0019912   F_FELT_CHAR_PICNN                                  */00000830
 /*     R0019913   F_SNU_DATO                                         */00000840
 /*     R0019942   F_SNU_DØDSDATO                                     */00000850
 /*     R0019953   F_AP_40DAGER                                       */00000860
 /*     R0019964   F_6MDR                                             */00000870
 /*     R0019956   P9956_BER_G_CICS                                   */00000880
 /*                                                                   */00000890
 /*  ARBEIDSOMRÅDER SOM BRUKES :                                      */00000900
 /*                                                                   */00000910
 /*          S001NO;                              MAP NOR_OVERF       */00000920
 /*          P001NO10;                            BLANKETT_RECORD     */00000930
 /*          P001NO30;                            STATISTIKK_REC      */00000940
 /*          P0010501;    INCL I UNDERPROGRAM     TRANS_OMR AP        */00000950
 /*          P001N501;    INCL I UNDERPROGRAM     TRANS_OMR A1        */00000960
 /*          P0010601;    INCL I UNDERPROGRAM     TRANS_OMR UP        */00000970
 /*          P001N601;    INCL I UNDERPROGRAM     TRANS_OMR U2        */00000980
 /*          P001U601;    INCL I UNDERPROGRAM     TRANS_OMR U3        */00000990
 /*          P0010801;    INCL I UNDERPROGRAM     TRANS_OMR EP        */00001000
 /*          P001N801;    INCL I UNDERPROGRAM     TRANS_OMR E3        */00001010
 /*          P0011101;    INCL I UNDERPROGRAM     TRANS_OMR BP        */00001020
 /*          P0011B01;    INCL I UNDERPROGRAM     TRANS_OMR B6        */00001030
 /*          P0011201;    INCL I UNDERPROGRAM     TRANS_OMR FT        */00001040
 /*          P001NC01;    INCL I UNDERPROGRAM     TRANS_OMR F7        */00001050
 /*          P0011401;    INCL I UNDERPROGRAM     TRANS_OMR E1        */00001060
 /*          P001UE01;    INCL I UNDERPROGRAM     TRANS_OMR EN        */00001070
 /*          P0011501;    INCL I UNDERPROGRAM     TRANS_OMR E2        */00001080
 /*          P0011601;    INCL I UNDERPROGRAM     TRANS_OMR O1        */00001090
 /*          P0011701;    INCL I UNDERPROGRAM     TRANS_OMR O2        */00001100
 /*          P0011801;    INCL I UNDERPROGRAM     TRANS_OMR AU        */00001110
 /*          P0011901;    INCL I UNDERPROGRAM     TRANS_OMR AFP       */00001120
 /*          P001UJ01;    INCL I UNDERPROGRAM     TRANS_OMR KFP       */00001130
 /*          P0012002;                            PCB_UIB_OMR         */00001140
 /*          P0014009;                            POTALL_OPPL         */00001150
 /*          P0019906;                            TRANS_OPPL_OMR      */00001160
 /*          P0019908;                            KOM_OMR             */00001170
 /*          P0019910;                            STYRINGS_OMR        */00001180
 /*          P0019912;                            DIV_OMR             */00001190
 /*          P0019924;                            G_V_TAB             */00001200
 /*          P0019925;                            G_TAB               */00001210
 /*          P0019953;                            TKNR_TAB            */00001220
 /*                                                                   */00001230
 /* ***************************************************************** */00001240
 /*DATASETTOPPLYSNINGER:                                              */00001250
 /* ***********************                                           */00001260
 /*  INPUT-DATSETTET ER EN VSAM-FILE SOM BLIR FYLT MED RECORDER       */00001270
 /*  OVERFØRT FRA NORTRYGD OG INFOTRYGD.                              */00001280
 /*  OUTPUT ER                                                        */00001290
 /*            OPPDATERT RF-BASE,                                     */00001300
 /*            TRANSAKSJONSBASE TIL STATISTIKK OG                     */00001310
 /*            STØNADSBREV-BASEN                                      */00001320
 /*            LOGG                                                   */00001330
 /*            STATISTIKK                                             */00001340
 /*            FEILMELDINGER                                          */00001350
 /*                                                                   */00001360
 /* ***************************************************************** */00001370
 /*FEILMELDINGER:                                                     */00001380
 /* *******************                                               */00001390
 /*  FEIL-MELDINGER SKRIVES TIL EN VSAM-FILE.  DISSE BLIR SENDT VIA   */00001400
 /*  NORTRYGD TRANSPORTSYSTEM/KD-NETTET TILBAKE TIL TRYGDEKONTORET.   */00001410
 /*                                                                   */00001420
 /* ***************************************************************** */00001430
 /*ENDRINGER:                                                         */00001440
 /* *******************                                               */00001450
 /*  LAGT INN MULIGHET FOR Å KJØRE STYRT AUTOHENDELSE.                */00001460
 /*                                                                   */00001470
 /*      OBS OBS OBS OBS                                              */00001480
 /*         DERSOM TRYGDEKONTORENE FÅR REGISTRERE STYRT AUTO,         */00001490
 /*         MÅ PROGRAMMET GJØRES OM SLIK AT STATISTIKK-RECORD         */00001500
 /*         BLIR SKREVET, SELV OM DET KOM EN 'AU'-TRANS INN.          */00001510
 /*                                                                   */00001520
 /*  210489 BRITT                                                     */00001530
 /*                                                                   */00001540
 /* ***************************************************************** */00001550
                                                                        00001560
 R001NO1:                                                               00001570
    PROC            (COMMAREA_PEKER)                                    00001580
           OPTIONS  (MAIN);                                             00001590
                                                                        00001600
    %PAGE;                                                              00001610
    %INCLUDE S001NO  ;                  /* MAP : OVERFØRING           */00001620
                                                                        00001630
    %PAGE;                                                              00001640
    %INCLUDE P001NO10;                  /* BLANKETT_REC               */00001650
                                                                        00001660
    %PAGE;                                                              00001670
 /* %INCLUDE P001NO30;                     STATISTIKK_REC             */00001680
    %INCLUDE P0012004;                  /* STATISTIKK_REC             */00001690
                                                                        00001700
    %PAGE;                                                              00001710
    %INCLUDE P0014009;                  /* POTALL_OPPL                */00001720
                                                                        00001730
    %PAGE;                                                              00001740
    %INCLUDE P0019906;                  /* TRANS_OPPL_OMR             */00001750
                                                                        00001760
    %PAGE;                                                              00001770
    %INCLUDE P0019908;                  /* KOM_OMR                    */00001780
                                                                        00001790
    %PAGE;                                                              00001800
    %INCLUDE P0019910;                  /* STYRINGS_OMR               */00001810
                                                                        00001820
    %PAGE;                                                              00001830
    %INCLUDE P0019912;                  /* DIV_OMR                    */00001840
                                                                        00001850
    %PAGE;                                                              00001860
    %INCLUDE P0019924;                  /* G_V_TAB                    */00001870
                                                                        00001880
    %PAGE;                                                              00001890
    %INCLUDE P0019925;                  /* G_TAB                      */00001900
                                                                        00001910
    %PAGE;                                                              00001920
    %INCLUDE P0019953;                  /* TKNRTAB                    */00001930
                                                                        00001940
                                                                        00001950
                                                                        00001960
    /* ************************************************************** */00001970
    /*   PCB- OG UIB-OMR.                                             */00001980
    /* ************************************************************** */00001990
                                                                        00002000
    %INCLUDE DLIUIB;                                                    00002010
                                                                        00002020
    DCL UIB_RC_OK             BIT  (8)     INIT ('00000000'B);          00002030
                                                                        00002040
    DCL COMMAREA_PEKER        POINTER;                                  00002050
                                                                        00002060
    %INCLUDE  P0012002;                 /* PCB-UIB-PEKER OMR  BASED   */00002070
                                                                        00002080
    %INCLUDE  DFHBMSCA;                                                 00002090
                                                                        00002100
                                                                        00002110
                                                                        00002120
    /* ************************************************************** */00002130
    /*   INPUT OMRÅDER FOR G_TAB OG G_V_TAB                           */00002140
    /* ************************************************************** */00002150
                                                                        00002160
    DCL GRUNN_OMR1            CHAR      (1202);                         00002170
    DCL GRUNN_OMR2            CHAR      (1202);                         00002180
    DCL GRUNN_IDENT           CHAR      ( 8);                           00002190
                                                                        00002200
                                                                        00002210
                                                                        00002220
    /* ************************************************************** */00002230
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00002240
    /* ************************************************************** */00002250
                                                                        00002260
    DCL (ADDR, VERIFY, DATE, TIME, LOW, SYSPRINT, CSTG, STG, SUBSTR )   00002270
                                                               BUILTIN; 00002280
                                                                        00002290
    DCL PLITDLI               ENTRY;                                    00002300
                                                                        00002310
                                                                        00002320
                                                                        00002330
    /* ************************************************************** */00002340
    /*   DATOBEHANDLING   TIDSBEHANDLING                              */00002350
    /* ************************************************************** */00002360
                                                                        00002370
    DCL TIDS_PEKER            POINTER                      ,            00002380
        TIDS_TEST             CHAR (4)   BASED (TIDS_PEKER),            00002390
        TID_UTE               CHAR (4)                     ;            00002400
                                                                        00002410
    DCL FORRIGE_TID           PIC'999B99B99'  INIT (0);                 00002420
    DCL FORRIGE_TID_MIN       PIC'99'         DEF  FORRIGE_TID POS(5);  00002430
    DCL FORRIGE_TID_TIM       PIC'999'        DEF  FORRIGE_TID;         00002440
    DCL START_TID             PIC'999B99B99'  INIT (0);                 00002450
                                                                        00002460
    DCL KJØRE_SLUTT_TID_CHAR  CHAR (4),                                 00002470
        KJØRE_SLUTT_MIN       PIC '99' DEF KJØRE_SLUTT_TID_CHAR POS(3), 00002480
                                                                        00002490
        KJØRE_SLUTT_TID_DEC   FIXED DEC ( 7);                           00002500
                                                                        00002510
    DCL TRANS_TID_CHAR        CHAR (4),                                 00002520
        TRANS_TID_MIN         PIC '99' DEF TRANS_TID_CHAR POS(3);       00002530
                                                                        00002540
    DCL DIFFERANSE            PIC'9999';                                00002550
    DCL NÅ_TID                PIC'999B99B99'  INIT (0);                 00002560
    DCL NÅ_TID_MIN            PIC'99'         DEF  NÅ_TID      POS(5);  00002570
    DCL NÅ_TID_TIM            PIC'999'        DEF  NÅ_TID;              00002580
                                                                        00002590
                                                                        00002600
                                                                        00002610
    /* ************************************************************** */00002620
    /*  BRYTERE                                                       */00002630
    /* ************************************************************** */00002640
                                                                        00002650
    DCL FEIL_FUNNET           BIT  (1) INIT('0'B),                      00002660
        FEIL_BLANKETT         BIT  (1) INIT('0'B),                      00002670
        FEIL_I_BOSATT         BIT  (1) INIT('0'B),                      00002680
        EOF_NORFILE           BIT  (1) INIT('0'B),                      00002690
        INGEN_FEIL            BIT  (1) INIT('1'B),                      00002700
        TRUE                  BIT  (1) INIT('1'B),                      00002710
        FALSE                 BIT  (1) INIT('0'B),                      00002720
        W_ANT_FERDIG_BEH_OPPD BIT  (1) INIT('0'B),                      00002730
        W_ERSTATT_FEILTEKST   BIT  (1) INIT('0'B),                      00002740
        AUTO_KJØRING          BIT  (1) INIT('0'B);                      00002750
                                                                        00002760
                                                                        00002770
                                                                        00002780
    /* ************************************************************** */00002790
    /*  TELLERE, INDEKSER                                             */00002800
    /* ************************************************************** */00002810
                                                                        00002820
    DCL ANT_BEH               FIXED BIN (15) INIT (0);                  00002830
    DCL INTERVALL_TELL        FIXED BIN (15) INIT (1);                  00002840
    DCL (I,J)                 FIXED BIN (15);                           00002850
    DCL FEIL_IND              FIXED BIN (15);                           00002860
    DCL ANT_FEIL_SKREVET      FIXED DEC (3);                            00002870
                                                                        00002880
    DCL SYSTEM_INDEX          FIXED BIN (15);                           00002890
                                                                        00002900
    DCL 01 STATISTIKK_TABELL(2),  /* INDEKS 1: INFOTRYGD, 2: NORTRYGD */00002910
           05 AP_MOTTATT      FIXED BIN (15) INIT (0),                  00002920
           05 A1_MOTTATT      FIXED BIN (15) INIT (0),                  00002930
           05 AP_AVVIST       FIXED BIN (15) INIT (0),                  00002940
           05 A1_AVVIST       FIXED BIN (15) INIT (0),                  00002950
           05 UP_MOTTATT      FIXED BIN (15) INIT (0),                  00002960
           05 U2_MOTTATT      FIXED BIN (15) INIT (0),                  00002970
           05 U3_MOTTATT      FIXED BIN (15) INIT (0),                  00002980
           05 UP_AVVIST       FIXED BIN (15) INIT (0),                  00002990
           05 U2_AVVIST       FIXED BIN (15) INIT (0),                  00003000
           05 U3_AVVIST       FIXED BIN (15) INIT (0),                  00003010
           05 EP_MOTTATT      FIXED BIN (15) INIT (0),                  00003020
           05 E3_MOTTATT      FIXED BIN (15) INIT (0),                  00003030
           05 EP_AVVIST       FIXED BIN (15) INIT (0),                  00003040
           05 E3_AVVIST       FIXED BIN (15) INIT (0),                  00003050
           05 BP_MOTTATT      FIXED BIN (15) INIT (0),                  00003060
           05 B6_MOTTATT      FIXED BIN (15) INIT (0),                  00003070
           05 BP_AVVIST       FIXED BIN (15) INIT (0),                  00003080
           05 B6_AVVIST       FIXED BIN (15) INIT (0),                  00003090
           05 FT_MOTTATT      FIXED BIN (15) INIT (0),                  00003100
           05 F7_MOTTATT      FIXED BIN (15) INIT (0),                  00003110
           05 FT_AVVIST       FIXED BIN (15) INIT (0),                  00003120
           05 F7_AVVIST       FIXED BIN (15) INIT (0),                  00003130
           05 E1_MOTTATT      FIXED BIN (15) INIT (0),                  00003140
           05 E1_AVVIST       FIXED BIN (15) INIT (0),                  00003150
           05 EN_MOTTATT      FIXED BIN (15) INIT (0),                  00003160
           05 EN_AVVIST       FIXED BIN (15) INIT (0),                  00003170
           05 E2_MOTTATT      FIXED BIN (15) INIT (0),                  00003180
           05 E2_AVVIST       FIXED BIN (15) INIT (0),                  00003190
           05 O1_MOTTATT      FIXED BIN (15) INIT (0),                  00003200
           05 O1_AVVIST       FIXED BIN (15) INIT (0),                  00003210
           05 O2_MOTTATT      FIXED BIN (15) INIT (0),                  00003220
           05 O2_AVVIST       FIXED BIN (15) INIT (0),                  00003230
           05 AFP_MOTTATT     FIXED BIN (15) INIT (0),                  00003240
           05 AFP_AVVIST      FIXED BIN (15) INIT (0),                  00003250
           05 KFP_MOTTATT     FIXED BIN (15) INIT (0),                  00003260
           05 KFP_AVVIST      FIXED BIN (15) INIT (0),                  00003270
           05 FEIL_BL_TYPE    FIXED BIN (15) INIT (0);                  00003280
                                                                        00003290
                                                                        00003300
                                                                        00003310
    /* ************************************************************** */00003320
    /*  FELTER FOR MAP-BEHANDLING OG FIL-BEHANDLING                   */00003330
    /* ************************************************************** */00003340
                                                                        00003350
    DCL MAP_CHAR              CHAR(250)  BASED (BMSMAPBR);              00003360
    DCL BRI_NUM_MDT           CHAR(1)    INIT  ('P');                   00003370
    DCL BRI_PROT_MDT          CHAR(1)    INIT  ('Z');                   00003380
                                                                        00003390
    DCL FEIL_RBA              POINTER;                                  00003400
    DCL LOGG_RBA              POINTER;                                  00003410
    DCL STAT_RBA              POINTER;                                  00003420
    DCL REST_RBA              POINTER;                                  00003430
    DCL BMSMAPBR              POINTER;                                  00003440
    DCL KEY_PEKER             POINTER;                                  00003450
                                                                        00003460
    DCL KEY_NORFIL            CHAR      (33) ;                          00003470
    DCL KEY_TKTAB             BIT       (32)   BASED (KEY_PEKER);       00003480
                                                                        00003490
                                                                        00003500
                                                                        00003510
    /* ************************************************************** */00003520
    /*  FEILBEHANDLING                                                */00003530
    /* ************************************************************** */00003540
                                                                        00003550
    DCL MELDING               CHAR      (78)         INIT(' ');         00003560
                                                                        00003570
    DCL W01_FEIL_NR (3)       FIXED DEC (5);                            00003580
    DCL W02_FEIL_NR_PIC       PIC      '(4)9';                          00003590
                                                                        00003600
    DCL 01 FEIL_REC  ,                                                  00003610
           05 HODE,                                                     00003620
              10 HODE_TKNR             PIC '( 4)9',                     00003630
              10 HODE_RECORD_TYPE      CHAR ( 2),                       00003640
              10 HODE_TRANS_TYPE       CHAR ( 2),                       00003650
              10 HODE_TRANS_DATO_ÅMD   PIC '( 6)9',                     00003660
              10 HODE_TRANS_TID        PIC '( 4)9',                     00003670
           05 FEILMELD,                                                 00003680
              10 TKNR                  PIC '( 4)9',                     00003690
              10 RECORD_TYPE           CHAR ( 2),                       00003700
              10 TRANS_TYPE            CHAR ( 2),                       00003710
              10 TRANS_DATO_ÅMD        PIC '( 6)9',                     00003720
              10 TRANS_TID             PIC '( 4)9',                     00003730
              10 FNR                   PIC '(11)9',                     00003740
              10 BL_TYPE               CHAR ( 2)  ,                     00003750
              10 NAVN                  CHAR (25),                       00003760
              10 VIRK_DATO_MÅ          PIC '( 4)9',                     00003770
              10 FEIL_MELD(3)          CHAR (78),                       00003780
           05 FILLER                   CHAR ( 8);                       00003790
                                                                        00003800
    DCL 01 FEIL_STRUC,                                                  00003810
           02 FEIL_NR         FIXED DEC ( 5)      INIT (0),             00003820
           02 FEIL_MELDING    CHAR      (78)      INIT ((78)' '),       00003830
           02 KOM_OMR_PEKER   POINTER;                                  00003840
                                                                        00003850
                                                                        00003860
                                                                        00003870
    /* ************************************************************** */00003880
    /*  RECORDBESKRIVELSE NORREST.                                    */00003890
    /*  RECORDENE SOM BEHANDLES LOGGES ETTERHVERT.  BRUKES VED        */00003900
    /*  RESTART ETTER UKONTROLLERT AVBRUDD.                           */00003910
    /* ************************************************************** */00003920
                                                                        00003930
    DCL 01 REST_REC  ,                                                  00003940
           05 REST_TKNR             PIC '( 4)9',                        00003950
           05 REST_TRANS_DATO_ÅMD   PIC '( 6)9',                        00003960
           05 REST_TRANS_TID        PIC '( 4)9',                        00003970
           05 REST_FNR              PIC '(11)9',                        00003980
           05 REST_BLANKETT_TYPE    CHAR ( 2),                          00003990
           05 REST_REC_NR           CHAR ( 2);                          00004000
                                                                        00004010
                                                                        00004020
                                                                        00004030
    /* ************************************************************** */00004040
    /*  HJELPEFELTER                                                  */00004050
    /* ************************************************************** */00004060
                                                                        00004070
    DCL W01_GMLT_TKNR         PIC '(4)9'     INIT (0);                  00004080
                                                                        00004090
                                                                        00004100
                                                                        00004110
    /* ************************************************************** */00004120
    /*   SLUTT PÅ DEKLARASJONENE .   EKSEKVERINGEN STARTER            */00004130
    /* ************************************************************** */00004140
                                                                        00004150
                                                                        00004160
          EXEC CICS HANDLE CONDITION ERROR   (CICS_ABEND);              00004170
                                                                        00004180
          ON ERROR SNAP                                                 00004190
             BEGIN;                                                     00004200
                ON ERROR SYSTEM;                                        00004210
                   MELDING = 'STOPP ! ABEND KEY:'            !!         00004220
                              BLANKETT_RECORD.TKNR           !! ' ' !!  00004230
                              BLANKETT_RECORD.FNR            !! ' ' !!  00004240
                              BLANKETT_RECORD.TRANS_DATO_ÅMD !! ' ' !!  00004250
                              BLANKETT_RECORD.TRANS_TID      !! ' ' !!  00004260
                              BLANKETT_RECORD.BLANKETT_TYPE  !! ' ' !!  00004270
                              BLANKETT_RECORD.REC_NR         !!         00004280
                             ' TA HARD-COPY! TRYKK ENTER!';             00004290
                GOTO L999            ;                                  00004300
             END;                                                       00004310
                                                                        00004320
          CALL P010_INITIERING;                                         00004330
                                                                        00004340
          EXEC CICS HANDLE CONDITION ERROR   (CICS_ABEND);              00004350
                                                                        00004360
          /* ******************************************************** */00004370
          /* KOMMER FRA R0010426 FØRSTE GANG VI KOMMER INN .          */00004380
          /* ******************************************************** */00004390
                                                                        00004400
                                                                        00004410
          IF PROGRAM_ID    = 'R0010426' THEN                            00004420
             DO;                                                        00004430
                PROGRAM_ID = 'R001NO10';                                00004440
                                                                        00004450
                CALL P020_LES_LOGG;                                     00004460
                                                                        00004470
                EXEC CICS LOAD   PROGRAM ('S001NO3');                   00004480
                S001NO1O.CICS_INFOO = CICS_NAVN;                        00004490
                EXEC CICS SEND   MAP     ('S001NO1') MAPSET ('S001NO3') 00004500
                                                        ERASE     ;     00004510
                EXEC CICS RETURN TRANSID ('RNO1'   ) COMMAREA(KOM_OMR) ;00004520
                                                                        00004530
             END;                                                       00004540
                                                                        00004550
                                                                        00004560
          /* ******************************************************** */00004570
          /* ANDRE GANG BLIR OPPLYSNINGENE PÅ MAPEN SJEKKET. TEST PÅ  */00004580
          /* FUNKSJONSKODE.                                           */00004590
          /* ******************************************************** */00004600
                                                                        00004610
                                                                        00004620
          EXEC CICS RECEIVE MAP ('S001NO1') MAPSET ('S001NO3')          00004630
                                            SET    (BMSMAPBR);          00004640
                                                                        00004650
          IF S001NO1I.FUNKSJONSKODEL        >  0   &                    00004660
             S001NO1I.FUNKSJONSKODEI        = 'X'  THEN                 00004670
             DO;                                                        00004680
                STYRINGS_OMR.FUNKSJONSKODE  = 'X';                      00004690
                EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR); 00004700
             END;                                                       00004710
                                                                        00004720
          CALL P060_INPUTKONTROLL_MAP;                                  00004730
                                                                        00004740
                                                                        00004750
          /* ******************************************************** */00004760
          /* HVIS FEIL SENDES UT MELDING OG RETURN TIL CICS           */00004770
          /* ******************************************************** */00004780
                                                                        00004790
                                                                        00004800
          IF MELDING       ^= (78) ' '  THEN                            00004810
             CALL P040_MAP_UT_OG_RETUR;                                 00004820
                                                                        00004830
                                                                        00004840
          /* ******************************************************** */00004850
          /* TAR STARTBROWSE MED LOW(27) ELLER OPPGITT NØKKEL         */00004860
          /* ******************************************************** */00004870
                                                                        00004880
                                                                        00004890
          IF S001NO1O.FNRO > 0                     THEN                 00004900
             DO;                                                        00004910
                BLANKETT_RECORD.TKNR = S001NO1O.TKNRO        ;          00004920
                BLANKETT_RECORD.FNR = S001NO1O.FNRO        ;            00004930
                BLANKETT_RECORD.BLANKETT_TYPE = S001NO1O.BLANKETT_TYPEO;00004940
                BLANKETT_RECORD.TRANS_DATO_ÅMD = S001NO1O.TRANS_DATOO  ;00004950
                BLANKETT_RECORD.TRANS_TID = S001NO1O.TRANS_TIDO        ;00004960
                BLANKETT_RECORD.REC_NR    = S001NO1O.REC_NRO           ;00004970
                                                                        00004980
                KEY_NORFIL =   BLANKETT_RECORD.TKNR           !!        00004990
                              'PE'                            !!        00005000
                              '01'                            !!        00005010
                               BLANKETT_RECORD.TRANS_DATO_ÅMD !!        00005020
                               BLANKETT_RECORD.TRANS_TID      !!        00005030
                               BLANKETT_RECORD.FNR            !!        00005040
                               BLANKETT_RECORD.BLANKETT_TYPE  !!        00005050
                               BLANKETT_RECORD.REC_NR         ;         00005060
             END;                                                       00005070
                                                                        00005080
          ELSE                                                          00005090
             KEY_NORFIL =  LOW(33)      ;                               00005100
                                                                        00005110
          BLANKETT_RECORD.TKNR           =  0         ;                 00005120
          BLANKETT_RECORD.FNR            =  0         ;                 00005130
          BLANKETT_RECORD.BLANKETT_TYPE  = '  '       ;                 00005140
          BLANKETT_RECORD.REC_NR         = '  '       ;                 00005150
          BLANKETT_RECORD.TRANS_DATO_ÅMD =  0         ;                 00005160
          BLANKETT_RECORD.TRANS_TID      =  0         ;                 00005170
                                                                        00005180
                                                                        00005190
          CALL P030_DATABASE    ('OPEN');                               00005200
                                                                        00005210
          IF MELDING ^= (78)' '          THEN                           00005220
             GOTO L999;                                                 00005230
                                                                        00005240
                                                                        00005250
          /* ******************************************************** */00005260
          /* 1) HVIS NØKKEL = LOW(27), LESER FRA BEGYNNELSEN AV INPUT-*/00005270
          /*    FILEN                                                 */00005280
          /* 2) HVIS NØKKEL HAR VERDI, LESER BARE DENNE REC NÅR       */00005290
          /*    ANTALL = 1                                            */00005300
          /* 3) HVIS NØKKEL HAR VERDI, OG ANTALL > 1 , LESER F.O.M.   */00005310
          /*    RECORDEN ETTER DEN OPPGITTE NØKKELEN                  */00005320
          /*                                                          */00005330
          /* LESER 1. RECORD                                          */00005340
          /* ******************************************************** */00005350
                                                                        00005360
                                                                        00005370
          EXEC CICS HANDLE   CONDITION ENDFILE   (ENDINP)           ;   00005380
                                                                        00005390
          EXEC CICS HANDLE   CONDITION NOTFND    (NOTFOUND2)        ;   00005400
                                                                        00005410
          EXEC CICS STARTBR  DATASET ('NORFREG') RIDFLD (KEY_NORFIL);   00005420
                                                                        00005430
          EXEC CICS READNEXT DATASET ('NORFREG') INTO  (BLANKETT_RECORD)00005440
                                                 RIDFLD(KEY_NORFIL)  ;  00005450
                                                                        00005460
                                                                        00005470
          /* ******************************************************** */00005480
          /* LESER NESTE RECORD HVIS ANTALL > 1                       */00005490
          /* ******************************************************** */00005500
                                                                        00005510
                                                                        00005520
          IF S001NO1O.ANT_Ø_BEHO  > 1        THEN                       00005530
             DO;                                                        00005540
                EXEC CICS READNEXT DATASET ('NORFREG')                  00005550
                                   INTO    (BLANKETT_RECORD)            00005560
                                   RIDFLD  ( KEY_NORFIL ) ;             00005570
             END;                                                       00005580
                                                                        00005590
                                                                        00005600
          /* ******************************************************** */00005610
          /* SENDER UT MAP MED BESKJED OM OPPSTART                    */00005620
          /* ******************************************************** */00005630
                                                                        00005640
                                                                        00005650
          S001NO1O.MELDINGO         = 'BEHANDLINGEN FOREGÅR   '        ;00005660
          S001NO1O.RECORD_TYPEO     = 'O'                              ;00005670
          S001NO1O.TKNRA            =  BRI_PROT_MDT                    ;00005680
          S001NO1O.FNRA             =  BRI_PROT_MDT                    ;00005690
          S001NO1O.BLANKETT_TYPEA   =  BRI_PROT_MDT                    ;00005700
          S001NO1O.REC_NRA          =  BRI_PROT_MDT                    ;00005710
          S001NO1O.TRANS_DATOA      =  BRI_PROT_MDT                    ;00005720
          S001NO1O.TRANS_TIDA       =  BRI_PROT_MDT                    ;00005730
          S001NO1O.ANT_Ø_BEHA       =  BRI_PROT_MDT                    ;00005740
          S001NO1O.STOPP_TIDA       =  BRI_PROT_MDT                    ;00005750
          S001NO1O.START_TIDO       =  EIBTIME / 100                   ;00005760
          S001NO1O.KLOKKE_LOGO      =  EIBTIME / 100                   ;00005770
          S001NO1I.DATO_LOGI        =  DATE()                          ;00005780
          S001NO1O.CICS_INFOO       =  CICS_NAVN;                       00005790
                                                                        00005800
          EXEC CICS SEND  MAP    ('S001NO1') MAPSET ('S001NO3')         00005810
                                             WAIT     DATAONLY;         00005820
          EXEC CICS WRITE DATASET('NORLOGG') FROM   ( MAP_CHAR )        00005830
                                             RIDFLD ( LOGG_RBA ) RBA;   00005840
                                                                        00005850
          S001NO1O.RECORD_TYPEO     = 'L'                              ;00005860
                                                                        00005870
                                                                        00005880
          /* ******************************************************** */00005890
          /* HOVEDPROSEDYRE.  ETTER LESING BLIR INPUTRECORDEN KONTROL-*/00005900
          /* LERT I KONTROLLPROGRAMMET FOR DEN BLANKETT-TYPEN OVER-   */00005910
          /* FØRINGEN GJELDER.  DERSOM KONTROLLEN GÅR BRA, BLIR       */00005920
          /* TRANSAKSJONEN SENDT INN I DET VANLIGE REGISTRERINGS-     */00005930
          /* SYSTEMET.  (PROGRAMMET SIMULERER R0012001.)              */00005940
          /* ******************************************************** */00005950
                                                                        00005960
                                                                        00005970
          DO ANT_BEH = 1 TO S001NO1O.ANT_Ø_BEHO                         00005980
                                         WHILE (^EOF_NORFILE &          00005990
                                                 INGEN_FEIL  &          00006000
                                                 TIDS_TEST = LOW (4) ); 00006010
                                                                        00006020
             W_ANT_FERDIG_BEH_OPPD    =  '0'B                         ; 00006030
                                                                        00006040
             S001NO1O.ANT_REC_INPUTO  =  ANT_BEH                      ; 00006050
                                                                        00006060
                                                                        00006070
             /* ***************************************************** */00006080
             /* RESTART-LOGGEN SKRIVES.                               */00006090
             /* ***************************************************** */00006100
                                                                        00006110
                                                                        00006120
             REST_TKNR                = BLANKETT_RECORD.TKNR;           00006130
             REST_TRANS_DATO_ÅMD      = BLANKETT_RECORD.TRANS_DATO_ÅMD; 00006140
             REST_TRANS_TID           = BLANKETT_RECORD.TRANS_TID;      00006150
             REST_FNR                 = BLANKETT_RECORD.FNR;            00006160
             REST_BLANKETT_TYPE       = BLANKETT_RECORD.BLANKETT_TYPE;  00006170
             REST_REC_NR              = BLANKETT_RECORD.REC_NR;         00006180
                                                                        00006190
             EXEC CICS WRITE DATASET ('NORREST')                        00006200
                             FROM    ( REST_REC ) RIDFLD (REST_RBA) RBA;00006210
                                                                        00006220
                                                                        00006230
             /* ***************************************************** */00006240
             /* ENDBROWSE. SYNCPOINT OG INIT PÅ BASENE TAS.           */00006250
             /* ***************************************************** */00006260
                                                                        00006270
                                                                        00006280
             EXEC CICS ENDBR DATASET   ('NORFREG');                     00006290
             EXEC CICS SYNCPOINT;                                       00006300
             CALL P030_DATABASE        ('OPEN');                        00006310
                                                                        00006320
                                                                        00006330
             /* ***************************************************** */00006340
             /* TRYGDEKONTOR-TABELLEN FINNES FOR Å FINNE EDB_SYSTEM   */00006350
             /* ***************************************************** */00006360
                                                                        00006370
                                                                        00006380
             IF BLANKETT_RECORD.TKNR     ^= W01_GMLT_TKNR      THEN     00006390
                DO;                                                     00006400
                   KEY_PEKER       = ADDR(BLANKETT_RECORD.TKNR);        00006410
                                                                        00006420
                   EXEC CICS READ DATASET ('TKNRTAB') RIDFLD (KEY_TKTAB)00006430
                                                      INTO   (TKNRTAB); 00006440
                   IF TKNRTAB.INFO_NOR   = 'I'    THEN                  00006450
                      SYSTEM_INDEX = 1;                                 00006460
                   ELSE                                                 00006470
                      SYSTEM_INDEX = 2;                                 00006480
                                                                        00006490
                   W01_GMLT_TKNR   = BLANKETT_RECORD.TKNR;              00006500
                END;                                                    00006510
                                                                        00006520
                                                                        00006530
             /* ***************************************************** */00006540
             /* INITIERING FØR BEHANDLINGEN.                          */00006550
             /* ***************************************************** */00006560
                                                                        00006570
                                                   /* TS 13.05.98 */    00006580
             TRANS_OPPL_OMR.TRANS_RETURKODE = 'RXXX';                   00006590
             TRANS_OPPL_OMR.FØDSNUMMER    = BLANKETT_RECORD.FNR;        00006600
             TRANS_OPPL_OMR.VIRKNINGSDATO = AP_BLANKETT.VIRK_DATO_MÅ;   00006610
             TRANS_OPPL_OMR.BLANKETTYPE   =                             00006620
                                          BLANKETT_RECORD.BLANKETT_TYPE;00006630
             IF BLANKETT_RECORD.BLANKETT_TYPE = 'U7'  THEN              00006640
                BLANKETT_RECORD.BLANKETT_TYPE = 'F7' ;                  00006650
                                                                        00006660
             STYREKODE                  = BLANKETT_RECORD.BLANKETT_TYPE;00006670
             DIV_PARAM_OMR. FEIL_MELD_NR  = 0       ;                   00006680
             DIV_PERIODE = '';                                          00006690
                                                                        00006700
 /* ENDRET 150688 BRITT: FEILRAPP 571  OMRÅDET BLE IKKE BLANKET       */00006710
 /*                                    NÅR PERSONEN IKKE HAR INNTEKT. */00006720
 /*                                    FØRTE TIL FEIL BEREGNING;      */00006730
 /*                                    FORRIGE PERSONS SLUTTPOENGTALL */00006740
 /*                                    BLE BRUKT                      */00006750
                                                                        00006760
             POTALL_OPPL              =  ''           ;                 00006770
             TRANS_OPPL_OMR.NY_GML_TRANS_IND = ' '   ;                  00006780
                                                                        00006790
 /* HIT    150688 BRITT                                               */00006800
                                                                        00006810
                                                                        00006820
             FEIL_FUNNET                  = '0'B;                       00006830
             FEIL_BLANKETT                = '0'B;                       00006840
             FEIL_I_BOSATT                = '0'B;                       00006850
                                                                        00006860
             DO I = 1 TO 3;                                             00006870
                W01_FEIL_NR(I)            = 0;                          00006880
                SYS_REC.MELDNR(I)         = 0;                          00006890
             END;                                                       00006900
                                                                        00006910
                                                                        00006920
             /* ***************************************************** */00006930
             /* STYREKODEN BESTEMMER HVILKET UNDERPROGRAM SOM SKAL    */00006940
             /* FORETA INPUTKONTROLL                                  */00006950
             /* ***************************************************** */00006960
                                                                        00006970
                                                                        00006980
             SELECT (STYREKODE);                                        00006990
                                                                        00007000
                WHEN ('AP')                                             00007010
                   DO;                                                  00007020
                      AP_MOTTATT(SYSTEM_INDEX) =                        00007030
                                          AP_MOTTATT(SYSTEM_INDEX) + 1; 00007040
                      CALL  P105_BEHANDLE_AP;            /* R001NO11 */ 00007050
                   END;                                                 00007060
                                                                        00007070
                WHEN ('A1')                                             00007080
                   DO;                                                  00007090
                      A1_MOTTATT(SYSTEM_INDEX) =                        00007100
                                          A1_MOTTATT(SYSTEM_INDEX) + 1; 00007110
                      CALL  P105_BEHANDLE_A1;            /* R001NN11 */ 00007120
                   END;                                                 00007130
                                                                        00007140
                WHEN ('UP')                                             00007150
                   DO;                                                  00007160
                      UP_MOTTATT(SYSTEM_INDEX) =                        00007170
                                          UP_MOTTATT(SYSTEM_INDEX) + 1; 00007180
                      CALL  P106_BEHANDLE_UP;            /* R001NO12 */ 00007190
                   END;                                                 00007200
                                                                        00007210
                WHEN ('U2')                                             00007220
                   DO;                                                  00007230
                      U2_MOTTATT(SYSTEM_INDEX) =                        00007240
                                          U2_MOTTATT(SYSTEM_INDEX) + 1; 00007250
                      CALL  P106_BEHANDLE_U2;        /*   R001NN12  */  00007260
                   END;                                                 00007270
                                                                        00007280
                WHEN ('U3')                                             00007290
                   DO;                                                  00007300
                      U3_MOTTATT(SYSTEM_INDEX) =                        00007310
                                          U3_MOTTATT(SYSTEM_INDEX) + 1; 00007320
                      CALL  P106_BEHANDLE_U3;        /*   R001NU12  */  00007330
                   END;                                                 00007340
                                                                        00007350
                WHEN ('EP')                                             00007360
                   DO;                                                  00007370
                      EP_MOTTATT(SYSTEM_INDEX) =                        00007380
                                          EP_MOTTATT(SYSTEM_INDEX) + 1; 00007390
                      CALL  P108_BEHANDLE_EP;            /* R001NO13 */ 00007400
                   END;                                                 00007410
                                                                        00007420
                WHEN ('E3')                                             00007430
                   DO;                                                  00007440
                      E3_MOTTATT(SYSTEM_INDEX) =                        00007450
                                          E3_MOTTATT(SYSTEM_INDEX) + 1; 00007460
                      CALL  P108_BEHANDLE_E3;           /* R001NN13 */  00007470
                   END;                                                 00007480
                                                                        00007490
                WHEN ('BP')                                             00007500
                   DO;                                                  00007510
                      BP_MOTTATT(SYSTEM_INDEX) =                        00007520
                                          BP_MOTTATT(SYSTEM_INDEX) + 1; 00007530
                      CALL  P111_BEHANDLE_BP;            /* R001NO14 */ 00007540
                   END;                                                 00007550
                                                                        00007560
                WHEN ('B6')                                             00007570
                   DO;                                                  00007580
                      B6_MOTTATT(SYSTEM_INDEX) =                        00007590
                                          B6_MOTTATT(SYSTEM_INDEX) + 1; 00007600
                      CALL  P111_BEHANDLE_B6;         /*  * R001NN14 */ 00007610
                   END;                                                 00007620
                                                                        00007630
                WHEN ('FT')                                             00007640
                   DO;                                                  00007650
                      FT_MOTTATT(SYSTEM_INDEX) =                        00007660
                                          FT_MOTTATT(SYSTEM_INDEX) + 1; 00007670
                      CALL  P112_BEHANDLE_FT;            /* R001NO15 */ 00007680
                   END;                                                 00007690
                                                                        00007700
                WHEN ('F7')                                             00007710
                   DO;                                                  00007720
                      F7_MOTTATT(SYSTEM_INDEX) =                        00007730
                                          F7_MOTTATT(SYSTEM_INDEX) + 1; 00007740
                      CALL  P112_BEHANDLE_F7;            /* R001NN15 */ 00007750
                   END;                                                 00007760
                                                                        00007770
                WHEN ('E1')                                             00007780
                   DO;                                                  00007790
                      E1_MOTTATT(SYSTEM_INDEX) =                        00007800
                                          E1_MOTTATT(SYSTEM_INDEX) + 1; 00007810
                      CALL  P114_BEHANDLE_E1;            /* R001NO16 */ 00007820
                   END;                                                 00007830
                                                                        00007840
                WHEN ('EN')                                             00007850
                   DO;                                                  00007860
                      EN_MOTTATT(SYSTEM_INDEX) =                        00007870
                                          EN_MOTTATT(SYSTEM_INDEX) + 1; 00007880
                      CALL  P114_BEHANDLE_EN;            /* R001NU16 */ 00007890
                   END;                                                 00007900
                                                                        00007910
                WHEN ('E2')                                             00007920
                   DO;                                                  00007930
                      E2_MOTTATT(SYSTEM_INDEX) =                        00007940
                                          E2_MOTTATT(SYSTEM_INDEX) + 1; 00007950
                      CALL  P115_BEHANDLE_E2;            /* R001NO19 */ 00007960
                   END;                                                 00007970
                                                                        00007980
                WHEN ('O1')                                             00007990
                   DO;                                                  00008000
                      O1_MOTTATT(SYSTEM_INDEX) =                        00008010
                                          O1_MOTTATT(SYSTEM_INDEX) + 1; 00008020
                      CALL  P116_BEHANDLE_O1;            /* R001NO17 */ 00008030
                   END;                                                 00008040
                                                                        00008050
                WHEN ('O2')                                             00008060
                   DO;                                                  00008070
                      O2_MOTTATT(SYSTEM_INDEX) =                        00008080
                                          O2_MOTTATT(SYSTEM_INDEX) + 1; 00008090
                      CALL  P117_BEHANDLE_O2;            /* R001NO18 */ 00008100
                   END;                                                 00008110
                                                                        00008120
                WHEN ('AF')                                             00008130
                   DO;                                                  00008140
                      AFP_MOTTATT(SYSTEM_INDEX) =                       00008150
                                         AFP_MOTTATT(SYSTEM_INDEX) + 1; 00008160
                      CALL  P119_BEHANDLE_AFP;           /* R001NO1A */ 00008170
                   END;                                                 00008180
                                                                        00008190
                WHEN ('KF')                                             00008200
                   DO;                                                  00008210
                      KFP_MOTTATT(SYSTEM_INDEX) =                       00008220
                                         KFP_MOTTATT(SYSTEM_INDEX) + 1; 00008230
                      CALL  P119_BEHANDLE_KFP;           /* R001NU1A */ 00008240
                   END;                                                 00008250
                                                                        00008260
                WHEN ('AU')                                             00008270
                   DO;                                                  00008280
                      AUTO_KJØRING = TRUE;                              00008290
                      CALL  P118_BEHANDLE_AU;            /* R001NO1B */ 00008300
                   END;                                                 00008310
                                                                        00008320
                OTHERWISE                                               00008330
                   DO;                                                  00008340
                      FEIL_FUNNET = TRUE;                               00008350
                      FEIL_BLANKETT = TRUE;                             00008360
                      FEIL_BL_TYPE(SYSTEM_INDEX) =                      00008370
                                        FEIL_BL_TYPE(SYSTEM_INDEX) + 1; 00008380
                   END;                                                 00008390
                                                                        00008400
             END;   /* SELECT */                                        00008410
                                                                        00008420
                                                                        00008430
             IF FEIL_FUNNET  THEN                                       00008440
                CALL P080_FEIL_I_BEH;                                   00008450
             ELSE                                                       00008460
                DO;                                                     00008470
                                                                        00008480
                                                                        00008490
                   /* *********************************************** */00008500
                   /* RUTINE SOM SIMULERER PROGRAM R0012001           */00008510
                   /* RUTINEN TAR UTGANGSPUNKT I STYRINGSKODEN        */00008520
                   /* (BLANKETT REGISTRERT) OG OVERLATER KONTROLL TIL */00008530
                   /* RUTINEN SOM BESTEMMER OM OG EVENTUELT HVORDAN   */00008540
                   /* "BEHANDLE-TRANS" SKAL ANVENDES.                 */00008550
                   /* *********************************************** */00008560
                                                                        00008570
                                                                        00008580
                   SEARCH_FNR = TRANS_OPPL_OMR.FØDSNUMMER;              00008590
                                                                        00008600
             SELECT(STYREKODE);                                         00008610
                                                                        00008620
                                                                        00008630
                      WHEN ( 'E2' )                                     00008640
                         DO;                                            00008650
                            EXEC CICS LINK PROGRAM  ('R0011520')        00008660
                                           COMMAREA ( KOM_OMR);         00008670
                         END;                                           00008680
                                                                        00008690
                      WHEN ( 'EP' , 'BP', 'B6', 'E3' )                  00008700
                         DO;                                            00008710
                            EXEC CICS LINK PROGRAM  ('R0012201')        00008720
                                           COMMAREA ( KOM_OMR);         00008730
                         END;                                           00008740
                                                                        00008750
       WHEN ('AP','A1','UP','U2','U3','E1','EN',                        00008760
            'O1','O2','FT','F7','AF','KF')                              00008770
                         DO;                                            00008780
                                                                        00008790
                                                                        00008800
                            /* ************************************** */00008810
                            /* OPPHØR GRUNNSTØNAD/HJELPESTØNAD SKAL   */00008820
                            /* BARE TIL STATISTIKK. DISSE HAR         */00008830
                            /* TRANSTYPE = 68                         */00008840
                            /* ************************************** */00008850
                                                                        00008860
                                                                        00008870
                            IF STYREKODE                = 'O2' &        00008880
                               TRANS_OPPL_OMR.TRANSTYPE =  68  THEN     00008890
                               DO;                                      00008900
                                  EXEC CICS LINK PROGRAM  ('R0016501')  00008910
                                                 COMMAREA ( KOM_OMR);   00008920
                               END;                                     00008930
                                                                        00008940
                            ELSE                                        00008950
                               DO;                                      00008960
                                  EXEC CICS LINK PROGRAM  ('R0013001')  00008970
                                                 COMMAREA ( KOM_OMR);   00008980
                               END;                                     00008990
                                                                        00009000
                         END;                                           00009010
                                                                        00009020
                      WHEN ( 'AU' )                                     00009030
                         DO;                                            00009040
                                                                        00009050
                            /* ************************************** */00009060
                            /* I PROGRAM R0011820 BLIR AUTO-TRANSENS  */00009070
                            /* VIRKNINGSDATO SATT TIL NESTE MÅNED, I  */00009080
                            /* MOTSETNING TIL NÅR AUTO REGISTRERES I  */00009090
                            /* DET VANLIGE REG.-SYSTEMET: DA BLIR     */00009100
                            /* VIRKNINGSDATO SATT TIL INNEVÆRENDE     */00009110
                            /* MÅNED.                                 */00009120
                            /* ************************************** */00009130
                                                                        00009140
                            EXEC CICS LINK PROGRAM  ('R0011820')        00009150
                                           COMMAREA ( KOM_OMR);         00009160
                         END;                                           00009170
                                                                        00009180
                      OTHERWISE;                                        00009190
                                                                        00009200
                                                                        00009210
                   END;     /* SLUTT PÅ 'SELECT (STYREKODE)' */         00009220
                                                                        00009230
                   IF FEIL_MELD_NR > 0     THEN                         00009240
                      CALL P080_FEIL_I_BEH;                             00009250
                                                                        00009260
                   ELSE                                                 00009270
                      DO;                                               00009280
                         PROGRAM_ID = 'R001NO10';                       00009290
                         S001NO1O.ANT_FERDIG_BEHO =                     00009300
                                      S001NO1O.ANT_FERDIG_BEHO     +  1;00009310
                                                                        00009320
                         W_ANT_FERDIG_BEH_OPPD = TRUE;                  00009330
                      END;                                              00009340
                                                                        00009350
                END;                                                    00009360
                                                                        00009370
             IF INTERVALL_TELL * 10000 <=  ANT_BEH    THEN              00009380
                CALL P070_SKRIV_LOGG;                                   00009390
                                                                        00009400
                                                                        00009410
  LES_NESTE:                                                            00009420
                                                                        00009430
             /* ***************************************************** */00009440
             /* STARTBROWSE MED SIST LESTE NØKKEL                     */00009450
             /* ***************************************************** */00009460
                                                                        00009470
                                                                        00009480
             KEY_NORFIL =   BLANKETT_RECORD.TKNR             !!         00009490
                           'PE'                              !!         00009500
                           '01'                              !!         00009510
                            BLANKETT_RECORD.TRANS_DATO_ÅMD   !!         00009520
                            BLANKETT_RECORD.TRANS_TID        !!         00009530
                            BLANKETT_RECORD.FNR              !!         00009540
                            BLANKETT_RECORD.BLANKETT_TYPE    !!         00009550
                            BLANKETT_RECORD.REC_NR        ;             00009560
                                                                        00009570
             EXEC CICS STARTBR DATASET ('NORFREG')                      00009580
                                RIDFLD ( KEY_NORFIL )              ;    00009590
                                                                        00009600
             EXEC CICS READNEXT DATASET ('NORFREG')                     00009610
                                INTO    ( BLANKETT_RECORD)              00009620
                                RIDFLD  ( KEY_NORFIL )     ;            00009630
                                                                        00009640
                                                                        00009650
             /* ***************************************************** */00009660
             /* HVIS ANTALL ER STØRRE ENN 1, BLIR NESTE RECORD LEST.  */00009670
             /* ***************************************************** */00009680
                                                                        00009690
                                                                        00009700
             IF S001NO1O.ANT_Ø_BEHO > 1                        THEN     00009710
                DO;                                                     00009720
                   EXEC CICS READNEXT DATASET ('NORFREG')               00009730
                                      INTO    ( BLANKETT_RECORD)        00009740
                                      RIDFLD  ( KEY_NORFIL) ;           00009750
                                                                        00009760
                END;                                                    00009770
                                                                        00009780
             GOTO READ_OK;                                              00009790
                                                                        00009800
                                                                        00009810
  NOTFOUND2:                                                            00009820
             MELDING             = 'OPPGITT NØKKEL FINNES IKKE';        00009830
             CALL P040_MAP_UT_OG_RETUR;                                 00009840
                                                                        00009850
                                                                        00009860
  ENDINP:                                                               00009870
             EOF_NORFILE         =  TRUE;                               00009880
                                                                        00009890
             IF ANT_BEH             =  0           THEN                 00009900
                                                                        00009910
                IF BLANKETT_RECORD.FNR = 00000000000 THEN               00009920
                   DO;                                                  00009930
                                                                        00009940
                                                                        00009950
                      /* ***************************************** */   00009960
                      /* INPUT-FILEN INNEHOLDT BARE DUMMY-RECORD   */   00009970
                      /* ***************************************** */   00009980
                                                                        00009990
                                                                        00010000
                      MELDING    = 'INPUT-FILEN ER TOM';                00010010
                      CALL P040_MAP_UT_OG_RETUR;                        00010020
                   END;                                                 00010030
                ELSE                                                    00010040
                   DO;                                                  00010050
                                                                        00010060
                                                                        00010070
                      /* ***************************************** */   00010080
                      /* INGEN RECORD BEHANDLET, DET OPPGITTE      */   00010090
                      /* STARTFNR VAR DEN SISTE RECORD PÅ FILEN    */   00010100
                      /* ***************************************** */   00010110
                                                                        00010120
                                                                        00010130
                      S001NO1O.ANT_Ø_BEHA = BRI_PROT_MDT              ; 00010140
                      S001NO1O.STOPP_TIDA = BRI_PROT_MDT              ; 00010150
                      S001NO1O.START_TIDO = EIBTIME / 100             ; 00010160
                                                                        00010170
                      MELDING     =  'SISTE FNR PÅ FILEN ER FNR : ' !!  00010180
                                    BLANKETT_RECORD.FNR !!              00010190
                                   '    TRYKK ENTER   !!';              00010200
                      CALL P040_MAP_UT_OG_RETUR;                        00010210
                   END;                                                 00010220
                                                                        00010230
  READ_OK:                                                              00010240
                                                                        00010250
          END;                                                          00010260
                                                                        00010270
  L999:                                                                 00010280
          CALL P999_SLUTT ;                                             00010290
                                                                        00010300
                                                                        00010310
 /* ***************************************************************** */00010320
 /*           I N T E R N E     P R O C E D U R E R                   */00010330
 /* ***************************************************************** */00010340
                                                                        00010350
                                                                        00010360
 /* ***************************************************************** */00010370
 /* INITIERER PEKERE OG FELTER.  LESER INN GRUNNBELØP VED CALL TIL    */00010380
 /* P9956_BER_B_CICS (R0019956)                                       */00010390
 /* ***************************************************************** */00010400
 P010_INITIERING:                                                       00010410
      PROC;                                                             00010420
                                                                        00010430
          KOM_OMR.STYRINGS_PEKER    = ADDR(KOM_OMR.STYRINGS_OMR);       00010440
          KOM_OMR.TRANS_PEKER       = ADDR(KOM_OMR.TRANS_OMR);          00010450
          KOM_OMR.TRANS_OPPL_PEKER  = ADDR(KOM_OMR.TRANS_OPPL_OMR);     00010460
          KOM_OMR.DIV_PARAM_PEKER   = ADDR(KOM_OMR.DIV_PARAM_OMR);      00010470
          KOM_OMR.TRANS_LISTE_PEKER = ADDR(KOM_OMR.TRANS_LISTE_OMR);    00010480
          BLANKETT_PEKER            = ADDR(BLANKETT_RECORD.BLANKETT);   00010490
                                                                        00010500
          ALLOCATE                   PCB_UIB_PEKER_OMR;                 00010510
          ALLOCATE                   GV_TAB_RE    ;                     00010520
          ALLOCATE                   G_TAB_RE     ;                     00010530
          ALLOCATE                   POTALL_OPPL  ;                     00010540
          KOM_OMR.GV_PEKER         = ADDR (GRUNN_OMR1 ) ;               00010550
          KOM_OMR.G_PEKER          = ADDR (GRUNN_OMR2 ) ;               00010560
          GV_TAB_RE                =  ''           ;                    00010570
          G_TAB_RE                 =  ''           ;                    00010580
          POTALL_OPPL              =  ''           ;                    00010590
                                                                        00010600
          START_TID           = EIBTIME                               ; 00010610
          FORRIGE_TID         = EIBTIME                               ; 00010620
          TID_UTE             = ' @  '             ;/* X'40008000'  */  00010630
                                                                        00010640
          TRANS_OPPL_OMR.NY_GML_TRANS_IND = ' '   ;                     00010650
          TRANS_OPPL_OMR.FØDSNUMMER       =  0    ;                     00010660
          TRANS_OPPL_OMR.BLANKETTYPE      = '  '  ;                     00010670
          DIV_PARAM_OMR. FEIL_MELD_NR     =  0    ;                     00010680
          DIV_PARAM_OMR. KJØRINGS_TYPE    = 'N'   ;                     00010690
                                                                        00010700
          GRUNN_IDENT                     = 'P0019924';                 00010710
                                                                        00010720
          CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                00010730
                                                                        00010740
          GRUNN_IDENT                     = 'P0019925';                 00010750
                                                                        00010760
          CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                00010770
                                                                        00010780
                                                                        00010790
    END P010_INITIERING;                                                00010800
                                                                        00010810
                                                                        00010820
 /* ***************************************************************** */00010830
 /* INITIERER PEKERE OG FELTER.  LESER INN GRUNNBELØP VED CALL TIL    */00010840
 /* P9956_BER_B_CICS (R0019956)                                       */00010850
 /* ***************************************************************** */00010860
 P020_LES_LOGG:                                                         00010870
      PROC;                                                             00010880
                                                                        00010890
          EXEC CICS HANDLE CONDITION NOTFND  (NOTFND)                   00010900
                                     ENDFILE (NOTFND);                  00010910
          EXEC CICS STARTBR  DATASET ('NORLOGG')                        00010920
                             RIDFLD  ( LOGG_RBA) RBA;                   00010930
                                                                        00010940
          DO WHILE ('A' = 'A');                                         00010950
             EXEC CICS READNEXT DATASET ('NORLOGG')                     00010960
                                RIDFLD  ( LOGG_RBA) RBA                 00010970
                                SET     ( BMSMAPBR);                    00010980
          END;                                                          00010990
                                                                        00011000
                                                                        00011010
  NOTFND:                                                               00011020
          IF S001NO1O.FNRO                    =  99999999999 THEN       00011030
             DO;                                                        00011040
                MAP_CHAR                      =  LOW (250);             00011050
                S001NO1O.TKNRO                =  0;                     00011060
                S001NO1O.FNRO                 =  0;                     00011070
                S001NO1O.BLANKETT_TYPEO       =  '  ';                  00011080
                S001NO1O.REC_NRO              =  '00';                  00011090
                S001NO1O.TRANS_DATOO          =  0;                     00011100
                S001NO1O.TRANS_TIDO           =  0;                     00011110
                S001NO1O.ANT_FERDIG_BEHO      =  0;                     00011120
                S001NO1O.ANT_AVVISTO          =  0;                     00011130
                S001NO1O.ANT_FEILM_TKO        =  0;                     00011140
                S001NO1O.MELDINGO             = 'HER ER ALT I ORDEN FOR'00011150
                             !!' OPPSTART FRA BEGYNNELSEN AV INN-FILEN';00011160
             END;                                                       00011170
                                                                        00011180
          ELSE IF S001NO1O.RECORD_TYPEO      ^= 'S' THEN                00011190
             DO;                                                        00011200
                                                                        00011210
                                                                        00011220
                /* ************************************************** */00011230
                /* RESTART-LOGGEN LESES FOR Å FINNE SISTE BEHANDLEDE  */00011240
                /* RECORD.  PÅ BILDET GIS DET BESKJED OM Å TA         */00011250
                /* HARDCOPY.  DERETTER STARTER BEHANDLINGEN PÅ NESTE  */00011260
                /* PERSON.                                            */00011270
                /* ************************************************** */00011280
                                                                        00011290
                                                                        00011300
                EXEC CICS HANDLE CONDITION NOTFND (NOTFND2)             00011310
                                           ENDFILE (NOTFND2);           00011320
                EXEC CICS STARTBR DATASET ('NORREST')                   00011330
                                   RIDFLD ( REST_RBA) RBA;              00011340
                                                                        00011350
                DO WHILE ('A' = 'A');                                   00011360
                   EXEC CICS READNEXT DATASET ('NORREST')               00011370
                                      RIDFLD  ( REST_RBA) RBA           00011380
                                      INTO    ( REST_REC);              00011390
                END;                                                    00011400
                                                                        00011410
                                                                        00011420
  NOTFND2:                                                              00011430
                S001NO1I.TKNRI                = REST_TKNR          ;    00011440
                S001NO1I.FNRI                 = REST_FNR           ;    00011450
                S001NO1I.BLANKETT_TYPEI       = REST_BLANKETT_TYPE ;    00011460
                S001NO1I.REC_NRI              = REST_REC_NR        ;    00011470
                S001NO1I.TRANS_DATOI          = REST_TRANS_DATO_ÅMD;    00011480
                S001NO1I.TRANS_TIDI           = REST_TRANS_TID     ;    00011490
                                                                        00011500
                S001NO1O.TKNRA                = BRI_NUM_MDT;            00011510
                S001NO1O.FNRA                 = BRI_NUM_MDT;            00011520
                S001NO1O.BLANKETT_TYPEA       = 'A'        ;            00011530
                S001NO1O.REC_NRA              = BRI_NUM_MDT;            00011540
                S001NO1O.TRANS_DATOA          = BRI_NUM_MDT;            00011550
                S001NO1O.TRANS_TIDA           = BRI_NUM_MDT;            00011560
                S001NO1O.STOPP_TIDA           = BRI_NUM_MDT;            00011570
                S001NO1I.STOPP_TIDI           = LOW (4)    ;            00011580
                S001NO1I.ANT_Ø_BEHI           = LOW (8)    ;            00011590
                S001NO1O.ANT_Ø_BEHA           = BRI_NUM_MDT;            00011600
                S001NO1I.ANT_Ø_BEHL           = -1         ;            00011610
                S001NO1I.ANT_REC_INPUTI       = LOW (7)    ;            00011620
                S001NO1I.ANT_FERDIG_BEHI      = LOW (7)    ;            00011630
                S001NO1I.ANT_AVVISTI          = LOW (7)    ;            00011640
                S001NO1I.ANT_FEILM_TKI        = LOW (7)    ;            00011650
                S001NO1O.ANT_FERDIG_BEHO      = 0          ;            00011660
                S001NO1O.ANT_AVVISTO          = 0          ;            00011670
                S001NO1O.ANT_FEILM_TKO        = 0          ;            00011680
                S001NO1O.MELDINGO             = 'OBS HER HAR DET VÆRT'!!00011690
                  ' UKONTROLLERT BRUDD !! TA HARD-COPY FØR NY START !!';00011700
             END;                                                       00011710
                                                                        00011720
          ELSE /* S001NO1O.RECORD_TYPEO = 'S' */                        00011730
             DO;                                                        00011740
                S001NO1O.TKNRA                = BRI_NUM_MDT;            00011750
                S001NO1O.FNRA                 = BRI_NUM_MDT;            00011760
                S001NO1O.BLANKETT_TYPEA       = 'A'        ;            00011770
                S001NO1O.REC_NRA              = BRI_NUM_MDT;            00011780
                S001NO1O.TRANS_DATOA          = BRI_NUM_MDT;            00011790
                S001NO1O.TRANS_TIDA           = BRI_NUM_MDT;            00011800
                S001NO1O.STOPP_TIDA           = BRI_NUM_MDT;            00011810
                S001NO1I.STOPP_TIDI           = LOW (4)    ;            00011820
                S001NO1I.ANT_Ø_BEHL           = -1         ;            00011830
                S001NO1I.ANT_Ø_BEHI           = LOW (8)    ;            00011840
                S001NO1O.ANT_Ø_BEHA           = BRI_NUM_MDT;            00011850
                S001NO1I.ANT_REC_INPUTI       = LOW (7)    ;            00011860
                S001NO1I.ANT_FERDIG_BEHI      = LOW (7)    ;            00011870
                S001NO1I.ANT_AVVISTI          = LOW (7)    ;            00011880
                S001NO1I.ANT_FEILM_TKI        = LOW (7)    ;            00011890
                S001NO1O.MELDINGO             =                         00011900
                                'HER ER ALT I ORDEN FOR OPPSTART';      00011910
             END;                                                       00011920
                                                                        00011930
                                                                        00011940
    END P020_LES_LOGG;                                                  00011950
                                                                        00011960
                                                                        00011970
 /* ***************************************************************** */00011980
 /* ÅPNER OG LUKKER BASER.                                            */00011990
 /* ***************************************************************** */00012000
 P030_DATABASE:                                                         00012010
    PROC         (STYRING);                                             00012020
                                                                        00012030
    DCL STYRING                   CHAR (5),                             00012040
        NULL                      BUILTIN,                              00012050
        UNSPEC                    BUILTIN;                              00012060
                                                                        00012070
                                                                        00012080
    /* ************************************************************** */00012090
    /*   DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTNINGS-    */00012100
    /*   KALL                                                         */00012110
    /**************************************************************** */00012120
                                                                        00012130
                                                                        00012140
    DCL W01_PSB_NAVN          CHAR (8)       INIT('B001R001'),          00012150
        W01_PCB_FUNCTION      CHAR (4)       INIT('PCB '),              00012160
        W01_TERM_FUNCTION     CHAR (4)       INIT('TERM');              00012170
                                                                        00012180
                                                                        00012190
    /* ************************************************************** */00012200
    /*   DL1 CALL-PARAMETRE                                           */00012210
    /**************************************************************** */00012220
                                                                        00012230
                                                                        00012240
    DCL 1 W01_DLI_PARAM,                                                00012250
          2  W02_GU           CHAR (4)       INIT('GU  '),              00012260
          2  W02_PARM_CT_1    FIXED BIN(31)  INIT(1),                   00012270
          2  W02_PARM_CT_3    FIXED BIN(31)  INIT(3),                   00012280
          2  W02_PARM_CT_4    FIXED BIN(31)  INIT(4);                   00012290
                                                                        00012300
                                                                        00012310
                                                                        00012320
          IF STYRING = 'OPEN'  THEN                                     00012330
             DO;                                                        00012340
                CALL PLITDLI                    (W02_PARM_CT_3,         00012350
                                                 W01_PCB_FUNCTION,      00012360
                                                 W01_PSB_NAVN,          00012370
                                                 UIBPTR);               00012380
                                                                        00012390
                IF DLIUIB.UIBFCTR           =    UIB_RC_OK       THEN   00012400
                   DO;                                                  00012410
                      PCB_UIB_PEKER_OMR.UIB_PEKER = UIBPTR  ;           00012420
                      PCB_UIB_PEKER_OMR.PCB_PEKER = UIBPCBAL;           00012430
                   END;                                                 00012440
                ELSE                                                    00012450
                   DO;                                                  00012460
                      MELDING = 'NOE ER GALT MED ' !!                   00012470
                                'DATABASEN PÅ ÅPNINGSKALLET, KODE: '!!  00012480
                                 UNSPEC(UIBFCTR) !! UNSPEC(UIBDLTR);    00012490
                   END;                                                 00012500
             END;                                                       00012510
                                                                        00012520
          ELSE                                                          00012530
             DO;                                                        00012540
                CALL PLITDLI                    (W02_PARM_CT_1,         00012550
                                                 W01_TERM_FUNCTION);    00012560
                KOM_OMR.PCB_UIB_PEKER    =    NULL  ;                   00012570
             END;                                                       00012580
                                                                        00012590
 RETUR:                                                                 00012600
                                                                        00012610
    END P030_DATABASE;                                                  00012620
                                                                        00012630
                                                                        00012640
 /* ***************************************************************** */00012650
 /* SENDER UT MAPEN OG RETURNERER TIL R001NO10                        */00012660
 /* ***************************************************************** */00012670
 P040_MAP_UT_OG_RETUR:                                                  00012680
      PROC;                                                             00012690
                                                                        00012700
          S001NO1O.MELDINGO     =   MELDING;                            00012710
          S001NO1O.CICS_INFOO       =  CICS_NAVN;                       00012720
          EXEC CICS SEND  MAP      ('S001NO1') MAPSET   ('S001NO3')     00012730
                                               DATAONLY   CURSOR  ;     00012740
          EXEC CICS RETURN TRANSID ('RNO1' )   COMMAREA ( KOM_OMR ) ;   00012750
                                                                        00012760
                                                                        00012770
    END P040_MAP_UT_OG_RETUR;                                           00012780
                                                                        00012790
                                                                        00012800
 /* ***************************************************************** */00012810
 /* SKRIVER FEILRECORDEN UT PÅ VSAM-FILEN NORFEIL.  DENNE BLIR SENERE */00012820
 /* SENDT OVER LINJE TIL TRYGDEKONTORET SOM HAR REGISTRERT TRANSAK-   */00012830
 /* SJONEN MED FEIL.                                                  */00012840
 /* ***************************************************************** */00012850
 P050_SKRIV_NORFEIL:                                                    00012860
      PROC;                                                             00012870
                                                                        00012880
          EXEC CICS WRITE DATASET ('NORFEIL')                           00012890
                          FROM    ( FEIL_REC ) RIDFLD (FEIL_RBA) RBA;   00012900
          S001NO1O.ANT_FEILM_TKO = S001NO1O.ANT_FEILM_TKO + 1;          00012910
                                                                        00012920
          CALL SKRIV_SYS_REG;                                           00012930
                                                                        00012940
    END P050_SKRIV_NORFEIL;                                             00012950
                                                                        00012960
                                                                        00012970
 /* ***************************************************************** */00012980
 /* KONTROLLERER OM START-OPPLYSNINGENE PÅ MAPEN ER RIKTIG UTFYLT.    */00012990
 /* ***************************************************************** */00013000
 P060_INPUTKONTROLL_MAP:                                                00013010
      PROC;                                                             00013020
                                                                        00013030
          KJØRE_SLUTT_TID_CHAR   = S001NO1I.STOPP_TIDI;                 00013040
          TRANS_TID_CHAR         = S001NO1I.TRANS_TIDI;                 00013050
                                                                        00013060
                                                                        00013070
          IF S001NO1O.FNRO > 0 THEN                                     00013080
             DO;                                                        00013090
                                                                        00013100
                IF ^ F_NUMERISK((S001NO1I.FNRI)) THEN                   00013110
                   DO;                                                  00013120
                      S001NO1I.FNRL = -1;                               00013130
                      MELDING =                                         00013140
                         'TEGN SOM IKKE ER TALL I FØDSELSNUMMER - FELT';00013150
                   END;                                                 00013160
                                                                        00013170
                ELSE IF                                                 00013180
                     ^ F_GYLDIG_FNR(S001NO1O.FNRO)  &                   00013190
                          S001NO1O.FNRO > 0           THEN              00013200
                   DO;                                                  00013210
                      S001NO1I.FNRL = -1;                               00013220
                      MELDING = 'UGYLDIG FØDSELSNUMMER ';               00013230
                   END;                                                 00013240
                                                                        00013250
                ELSE IF ^ F_NUMERISK((S001NO1I.TKNRI)) THEN             00013260
                   DO;                                                  00013270
                      S001NO1I.TKNRL = -1;                              00013280
                      MELDING =                                         00013290
                             'TEGN SOM IKKE ER TALL I TKNUMMER - FELT'; 00013300
                   END;                                                 00013310
                                                                        00013320
                ELSE IF ^ (S001NO1I.BLANKETT_TYPEI = 'AP' !             00013330
                           S001NO1I.BLANKETT_TYPEI = 'A1' !             00013340
                           S001NO1I.BLANKETT_TYPEI = 'UP' !             00013350
                           S001NO1I.BLANKETT_TYPEI = 'U2' !             00013360
                           S001NO1I.BLANKETT_TYPEI = 'U3' !             00013370
                           S001NO1I.BLANKETT_TYPEI = 'EP' !             00013380
                           S001NO1I.BLANKETT_TYPEI = 'E3' !             00013390
                           S001NO1I.BLANKETT_TYPEI = 'BP' !             00013400
                           S001NO1I.BLANKETT_TYPEI = 'B6' !             00013410
                           S001NO1I.BLANKETT_TYPEI = 'FT' !             00013420
                           S001NO1I.BLANKETT_TYPEI = 'F7' !             00013430
                           S001NO1I.BLANKETT_TYPEI = 'E1' !             00013440
                           S001NO1I.BLANKETT_TYPEI = 'EN' !             00013450
                           S001NO1I.BLANKETT_TYPEI = 'E2' !             00013460
                           S001NO1I.BLANKETT_TYPEI = 'O1' !             00013470
                           S001NO1I.BLANKETT_TYPEI = 'O2' !             00013480
                           S001NO1I.BLANKETT_TYPEI = 'AF' !             00013490
                           S001NO1I.BLANKETT_TYPEI = 'KF' !             00013500
                           S001NO1I.BLANKETT_TYPEI = 'AU' ) THEN        00013510
                   DO;                                                  00013520
                      S001NO1I.BLANKETT_TYPEL = -1;                     00013530
                      MELDING ='UGYLDIG KODE FOR BLANKETT - TYPE';      00013540
                   END;                                                 00013550
                                                                        00013560
                ELSE IF ^ F_NUMERISK((S001NO1I.TRANS_DATOI)) THEN       00013570
                   DO;                                                  00013580
                      S001NO1I.TRANS_DATOL = -1;                        00013590
                      MELDING =                                         00013600
                           'TEGN SOM IKKE ER TALL I TRANS-DATO - FELT'; 00013610
                   END;                                                 00013620
                                                                        00013630
                ELSE IF ^ F_NUMERISK((S001NO1I.REC_NRI)) THEN           00013640
                   DO;                                                  00013650
                      S001NO1I.REC_NRL = -1;                            00013660
                      MELDING =                                         00013670
                           'TEGN SOM IKKE ER TALL I REC-NR - FELT';     00013680
                   END;                                                 00013690
                                                                        00013700
                ELSE IF ^ F_GYLDIG_DATO_DMÅ(F_SNU_DØDSDATO(             00013710
                          F_FELT_CHAR_PIC6(S001NO1I.TRANS_DATOI))) THEN 00013720
                   DO;                                                  00013730
                      S001NO1I.TRANS_DATOL = -1;                        00013740
                      MELDING = 'UGYLDIG DATO  -  TRANS - DATO';        00013750
                   END;                                                 00013760
                                                                        00013770
                ELSE IF ^ F_NUMERISK((S001NO1I.TRANS_TIDI)) THEN        00013780
                   DO;                                                  00013790
                      S001NO1I.TRANS_TIDL = -1;                         00013800
                      MELDING = 'TEGN SOM IKKE ER TALL I TIDS - FELT';  00013810
                   END;                                                 00013820
                                                                        00013830
        /*      ELSE IF TRANS_TID_MIN > 59 THEN                         00013840
         *         DO;                                                  00013850
         *            S001NO1I.TRANS_TIDL = -1;                         00013860
         *            MELDING = 'URIKTIG TIDSANGIVELSE';                00013870
         *         END;                                                 00013880
         */                                                             00013890
             END;                                                       00013900
                                                                        00013910
          IF ^ F_NUMERISK((S001NO1I.ANT_Ø_BEHI)) THEN                   00013920
             DO;                                                        00013930
                S001NO1I.ANT_Ø_BEHL = -1;                               00013940
                MELDING = 'TEGN SOM IKKE ER TALL I ANTALL - FELT';      00013950
             END;                                                       00013960
                                                                        00013970
          ELSE IF S001NO1O.ANT_Ø_BEHO = 1 & S001NO1I.FNRI = 0 THEN      00013980
             DO;                                                        00013990
                S001NO1I.ANT_Ø_BEHL = -1;                               00014000
                MELDING      = 'FEIL KOMBINASJON - KJØRE-ANTALL ='!!    00014010
                                     ' 1 OG FNR = 0';                   00014020
             END;                                                       00014030
                                                                        00014040
          ELSE IF ^ F_NUMERISK((S001NO1I.STOPP_TIDI)) THEN              00014050
             DO;                                                        00014060
                S001NO1I.STOPP_TIDL = -1;                               00014070
                MELDING = 'TEGN SOM IKKE ER TALL I TIDS - FELT';        00014080
             END;                                                       00014090
                                                                        00014100
          ELSE IF KJØRE_SLUTT_MIN > 59 THEN                             00014110
             DO;                                                        00014120
                S001NO1I.STOPP_TIDL = -1;                               00014130
                MELDING       = 'URIKTIG TIDSANGIVELSE';                00014140
             END;                                                       00014150
                                                                        00014160
          ELSE                                                          00014170
             DO;                                                        00014180
                KJØRE_SLUTT_TID_DEC = S001NO1O.STOPP_TIDO * 100;        00014190
                EXEC CICS POST   TIME (KJØRE_SLUTT_TID_DEC)             00014200
                                 SET  (TIDS_PEKER);                     00014210
                EXEC CICS HANDLE CONDITION EXPIRED(EXPIRED);            00014220
                EXEC CICS POST   TIME (KJØRE_SLUTT_TID_DEC)             00014230
                                 SET  (TIDS_PEKER);                     00014240
                LEAVE;                                                  00014250
  EXPIRED:                                                              00014260
                S001NO1I.STOPP_TIDL = -1;                               00014270
                MELDING = 'TIDSANGIVELSEN STOPPER TASKEN, '   !!        00014280
                               'DEN ER MULIGENS FØR NÅ - TIDSPUNKT' ;   00014290
             END;                                                       00014300
                                                                        00014310
                                                                        00014320
    END P060_INPUTKONTROLL_MAP;                                         00014330
                                                                        00014340
                                                                        00014350
 /* ***************************************************************** */00014360
 /* PROCEDYRE SOM SKRIVER PÅ LOGGEN FOR HVER 10000 RECORD.  DENNE VIL */00014370
 /* I PRAKSIS ALDRI BLI KALT FORDI SÅ MANGE RECORDER IKKE VIL BLI     */00014380
 /* OVERFØRT PÅ EN DAG.                                               */00014390
 /* ***************************************************************** */00014400
 P070_SKRIV_LOGG:                                                       00014410
      PROC;                                                             00014420
                                                                        00014430
                                                                        00014440
          EXEC CICS ASKTIME;                                            00014450
          NÅ_TID                        = EIBTIME;                      00014460
          S001NO1O.KLOKKE_LOGO          = EIBTIME / 100;                00014470
          S001NO1I.DATO_LOGI            = DATE();                       00014480
                                                                        00014490
          DIFFERANSE                    = NÅ_TID_TIM * 60 + NÅ_TID_MIN -00014500
                                FORRIGE_TID_TIM * 60 - FORRIGE_TID_MIN ;00014510
                                                                        00014520
          S001NO1O.CICS_INFOO       =  CICS_NAVN;                       00014530
          S001NO1O.MELDINGO             =                               00014540
                                       'MIN SISTE 10000 ER KJØRT PÅ: '  00014550
                                    !! DIFFERANSE !! ',ANT:'!! ANT_BEH  00014560
                                    !! ' ' !! BLANKETT_RECORD.FNR ;     00014570
                                                                        00014580
          EXEC CICS SEND  MAP     ('S001NO1') MAPSET ('S001NO3')        00014590
                                              WAIT     DATAONLY;        00014600
          EXEC CICS WRITE DATASET ('NORLOGG') FROM   ( MAP_CHAR)        00014610
                                              RIDFLD ( LOGG_RBA) RBA;   00014620
                                                                        00014630
          S001NO1O.ANT_REC_INPUTO            = 0;                       00014640
          S001NO1O.ANT_FERDIG_BEHO           = 0;                       00014650
          S001NO1O.ANT_AVVISTO               = 0;                       00014660
          S001NO1O.ANT_FEILM_TKO             = 0;                       00014670
          INTERVALL_TELL                     = INTERVALL_TELL + 1;      00014680
          FORRIGE_TID                        = NÅ_TID;                  00014690
                                                                        00014700
                                                                        00014710
    END P070_SKRIV_LOGG;                                                00014720
                                                                        00014730
                                                                        00014740
 /* ***************************************************************** */00014750
 /* FEILBEHANDLING.                                                   */00014760
 /* VED FEIL I BEHANDLINGEN BLIR FØRST EVENTUELLE OPPDATERINGER       */00014770
 /* SLETTET.  DERETTER BLIR DET BYGD OPP EN FEIL-MELDING.             */00014780
 /* ***************************************************************** */00014790
 P080_FEIL_I_BEH:                                                       00014800
      PROC;                                                             00014810
                                                                        00014820
                                                                        00014830
          /* ******************************************************* */ 00014840
          /* TELLERE FOR ANTALL AVVISTE OPPDATERES                   */ 00014850
          /* *********************************************************/ 00014860
                                                                        00014870
                                                                        00014880
          S001NO1O.ANT_AVVISTO = S001NO1O.ANT_AVVISTO + 1;              00014890
                                                                        00014900
          SELECT (STYREKODE);                                           00014910
             WHEN ('AP')                                                00014920
                AP_AVVIST(SYSTEM_INDEX) = AP_AVVIST(SYSTEM_INDEX) + 1;  00014930
             WHEN ('A1')                                                00014940
                A1_AVVIST(SYSTEM_INDEX) = A1_AVVIST(SYSTEM_INDEX) + 1;  00014950
             WHEN ('UP')                                                00014960
                UP_AVVIST(SYSTEM_INDEX) = UP_AVVIST(SYSTEM_INDEX) + 1;  00014970
             WHEN ('U2')                                                00014980
                U2_AVVIST(SYSTEM_INDEX) = U2_AVVIST(SYSTEM_INDEX) + 1;  00014990
                                                                        00015000
             WHEN ('U3')                                                00015010
                U3_AVVIST(SYSTEM_INDEX) = U3_AVVIST(SYSTEM_INDEX) + 1;  00015020
                                                                        00015030
             WHEN ('EP')                                                00015040
                EP_AVVIST(SYSTEM_INDEX) = EP_AVVIST(SYSTEM_INDEX) + 1;  00015050
             WHEN ('E3')                                                00015060
                E3_AVVIST(SYSTEM_INDEX) = E3_AVVIST(SYSTEM_INDEX) + 1;  00015070
                                                                        00015080
             WHEN ('BP')                                                00015090
                BP_AVVIST(SYSTEM_INDEX) = BP_AVVIST(SYSTEM_INDEX) + 1;  00015100
             WHEN ('B6')                                                00015110
                B6_AVVIST(SYSTEM_INDEX) = B6_AVVIST(SYSTEM_INDEX) + 1;  00015120
             WHEN ('FT')                                                00015130
                FT_AVVIST(SYSTEM_INDEX) = FT_AVVIST(SYSTEM_INDEX) + 1;  00015140
             WHEN ('F7')                                                00015150
                F7_AVVIST(SYSTEM_INDEX) = F7_AVVIST(SYSTEM_INDEX) + 1;  00015160
             WHEN ('E1')                                                00015170
                E1_AVVIST(SYSTEM_INDEX) = E1_AVVIST(SYSTEM_INDEX) + 1;  00015180
             WHEN ('EN')                                                00015190
                EN_AVVIST(SYSTEM_INDEX) = EN_AVVIST(SYSTEM_INDEX) + 1;  00015200
             WHEN ('E2')                                                00015210
                E2_AVVIST(SYSTEM_INDEX) = E2_AVVIST(SYSTEM_INDEX) + 1;  00015220
             WHEN ('O1')                                                00015230
                O1_AVVIST(SYSTEM_INDEX) = O1_AVVIST(SYSTEM_INDEX) + 1;  00015240
             WHEN ('O2')                                                00015250
                O2_AVVIST(SYSTEM_INDEX) = O2_AVVIST(SYSTEM_INDEX) + 1;  00015260
             WHEN ('AF')                                                00015270
                AFP_AVVIST(SYSTEM_INDEX) = AFP_AVVIST(SYSTEM_INDEX) + 1;00015280
             WHEN ('KF')                                                00015290
                KFP_AVVIST(SYSTEM_INDEX) = KFP_AVVIST(SYSTEM_INDEX) + 1;00015300
             OTHERWISE;                                                 00015310
                                                                        00015320
          END;      /* SELECT */                                        00015330
                                                                        00015340
                                                                        00015350
          EXEC CICS SYNCPOINT ROLLBACK;                                 00015360
                                                                        00015370
                                                                        00015380
          /* ******************************************************* */ 00015390
          /* DERSOM FEIL-MELD-NR = 9999 KAN DET SKYLDES EN ABEND I   */ 00015400
          /* R0013001 ELLER FATAL FEIL I R0011820.                   */ 00015410
          /* *********************************************************/ 00015420
                                                                        00015430
                                                                        00015440
          IF FEIL_MELD_NR = 9999      THEN                              00015450
             DO;                                                        00015460
                INGEN_FEIL = FALSE;                                     00015470
                FEIL_MELD_NR = 0;                                       00015480
                MELDING = 'STOPP ! ABEND KEY:'            !!            00015490
                           BLANKETT_RECORD.TKNR           !! ' ' !!     00015500
                           BLANKETT_RECORD.FNR            !! ' ' !!     00015510
                           BLANKETT_RECORD.TRANS_DATO_ÅMD !! ' ' !!     00015520
                           BLANKETT_RECORD.TRANS_TID      !! ' ' !!     00015530
                           BLANKETT_RECORD.BLANKETT_TYPE  !! ' ' !!     00015540
                           BLANKETT_RECORD.REC_NR         !!            00015550
                          ' TA HARD-COPY! TRYKK ENTER!';                00015560
                                                                        00015570
      /*  BY STOPPING P999_SLUTT    PROGRAM WILL GO IN LOOP AND         00015580
          WILL COMPLETE THE TOTAL PROCCESS FOR ALL THE PERSON   */      00015590
           /*   CALL P999_SLUTT ; */                                    00015600
                                                                        00015610
             END;                                                       00015620
                                                                        00015630
                                                                        00015640
          /* ******************************************************* */ 00015650
          /* FEILRECORDEN BLANKES, OG FYLLES UT.                     */ 00015660
          /* *********************************************************/ 00015670
                                                                        00015680
                                                                        00015690
          EXEC CICS ASKTIME;                                            00015700
                                                                        00015710
          FEIL_REC                     =  '';                           00015720
          FEIL_REC.HODE_TKNR           =  BLANKETT_RECORD.TKNR;         00015730
          FEIL_REC.HODE_RECORD_TYPE    = 'PE';                          00015740
          FEIL_REC.HODE_TRANS_TYPE     = '04';                          00015750
          FEIL_REC.HODE_TRANS_DATO_ÅMD =  DATE;                         00015760
          FEIL_REC.HODE_TRANS_TID      =  EIBTIME / 100;                00015770
          FEIL_REC.TKNR                = BLANKETT_RECORD.TKNR;          00015780
          FEIL_REC.RECORD_TYPE         = BLANKETT_RECORD.RECORD_TYPE;   00015790
          FEIL_REC.TRANS_TYPE          = BLANKETT_RECORD.TRANS_TYPE;    00015800
          FEIL_REC.TRANS_DATO_ÅMD      = BLANKETT_RECORD.TRANS_DATO_ÅMD;00015810
          FEIL_REC.TRANS_TID           = BLANKETT_RECORD.TRANS_TID;     00015820
          FEIL_REC.FNR                 = BLANKETT_RECORD.FNR;           00015830
          FEIL_REC.BL_TYPE             = BLANKETT_RECORD.BLANKETT_TYPE; 00015840
          FEIL_REC.NAVN                = BLANKETT_RECORD.NAVN;          00015850
                                                                        00015860
          SELECT(BLANKETT_RECORD.BLANKETT_TYPE);                        00015870
             WHEN ('AP')                                                00015880
                FEIL_REC.VIRK_DATO_MÅ = AP_BLANKETT.VIRK_DATO_MÅ;       00015890
             WHEN ('A1')                                                00015900
                FEIL_REC.VIRK_DATO_MÅ = A1_BLANKETT.VIRK_DATO_MÅ;       00015910
             WHEN ('UP')                                                00015920
                FEIL_REC.VIRK_DATO_MÅ = UP_BLANKETT.VIRK_DATO_MÅ;       00015930
             WHEN ('U2')                                                00015940
                FEIL_REC.VIRK_DATO_MÅ = U2_BLANKETT.VIRK_DATO_MÅ;       00015950
                                                                        00015960
             WHEN ('U3')                                                00015970
                FEIL_REC.VIRK_DATO_MÅ = U3_BLANKETT.VIRK_DATO_MÅ;       00015980
                                                                        00015990
             WHEN ('EP')                                                00016000
                FEIL_REC.VIRK_DATO_MÅ = EP_BLANKETT.VIRK_DATO_MÅ;       00016010
             WHEN ('E3')                                                00016020
                FEIL_REC.VIRK_DATO_MÅ = E3_BLANKETT.VIRK_DATO_MÅ;       00016030
                                                                        00016040
             WHEN ('BP')                                                00016050
                FEIL_REC.VIRK_DATO_MÅ = BP_BLANKETT.VIRK_DATO_MÅ;       00016060
             WHEN ('B6')                                                00016070
                FEIL_REC.VIRK_DATO_MÅ = B6_BLANKETT.VIRK_DATO_MÅ;       00016080
                                                                        00016090
             WHEN ('FT')                                                00016100
                FEIL_REC.VIRK_DATO_MÅ = FT_BLANKETT.VIRK_DATO_MÅ;       00016110
             WHEN ('F7')                                                00016120
                FEIL_REC.VIRK_DATO_MÅ = F7_BLANKETT.VIRK_DATO_MÅ;       00016130
             WHEN ('E1')                                                00016140
                FEIL_REC.VIRK_DATO_MÅ = E1_BLANKETT.VIRK_DATO_MÅ;       00016150
             WHEN ('EN')                                                00016160
                FEIL_REC.VIRK_DATO_MÅ = EN_BLANKETT.VIRK_DATO_MÅ;       00016170
             WHEN ('O2')                                                00016180
                FEIL_REC.VIRK_DATO_MÅ = O2_BLANKETT.VIRK_DATO_MÅ;       00016190
             WHEN ('AF')                                                00016200
                FEIL_REC.VIRK_DATO_MÅ = AFP_BLANKETT.VIRK_DATO_MÅ;      00016210
             WHEN ('KF')                                                00016220
                FEIL_REC.VIRK_DATO_MÅ = KFP_BLANKETT.VIRK_DATO_MÅ;      00016230
             OTHERWISE;                                                 00016240
          END;                                                          00016250
                                                                        00016260
          CALL P030_DATABASE ('OPEN');                                  00016270
                                                                        00016280
                                                                        00016290
          /* ******************************************************* */ 00016300
          /* HVIS FEIL_BLANKETT, ELLER FEIL_I_BOSATT, ER FEILEN      */ 00016310
          /* FUNNET AV DETTE PROGRAMMET.  EGEN FEILMELDINGSTEKST     */ 00016320
          /* SKRIVES.                                                */ 00016330
          /* *********************************************************/ 00016340
                                                                        00016350
                                                                        00016360
          IF FEIL_BLANKETT THEN                                         00016370
             DO;                                                        00016380
                FEIL_REC.FEIL_MELD(1) = '     FEIL BLANKETT_TYPE : ' !! 00016390
                                         FEIL_REC.BL_TYPE            !! 00016400
                                         '.'  ;                         00016410
                FEIL_BLANKETT         = '0'B;                           00016420
             END;                                                       00016430
                                                                        00016440
          ELSE                                                          00016450
             IF FEIL_I_BOSATT THEN                                      00016460
                DO;                                                     00016470
                   FEIL_REC.FEIL_MELD(1) = '     IKKE NORSK BOSATT -' !!00016480
                                           ' SEND GRUNN-BLANKETT'     !!00016490
                                           ' TIL RTV.';                 00016500
                   FEIL_I_BOSATT = '0'B;                                00016510
                END;                                                    00016520
                                                                        00016530
             ELSE                                                       00016540
                DO;                                                     00016550
                                                                        00016560
                  FEIL_STRUC.KOM_OMR_PEKER = COMMAREA_PEKER;            00016570
                                                                        00016580
                                                                        00016590
                  /* *********************************************** */ 00016600
                  /* DERSOM FEIL_FUNNET ER SATT, ER FEILEN FUNNET    */ 00016610
                  /* I ET AV BLANKETT-KONTROLL-PROGRAMMENE, OG       */ 00016620
                  /* FEIL_NR HENTES FRA EN HJELPETABELL.             */ 00016630
                  /* HVIS IKKE SETTES FEIL_NR LIK FEIL_MELD_NR.      */ 00016640
                  /* PROGRAM R0019921 LINKES FOR Å FINNE FEIL-       */ 00016650
                  /* MELDINGS-TEKSTEN.                               */ 00016660
                  /* *********************************************** */ 00016670
                                                                        00016680
                                                                        00016690
                  IF DIV_PARAM_OMR.FEIL_MELD_NR ^= 0   THEN             00016700
                     W01_FEIL_NR(1) = DIV_PARAM_OMR.FEIL_MELD_NR;       00016710
                                                                        00016720
                                                                        00016730
                   DO I = 1 TO 3 WHILE (W01_FEIL_NR(I) ^= 0);           00016740
                                                                        00016750
                       SYS_REC.MELDNR (I)  = W01_FEIL_NR(I);            00016760
                       /* OPPDATE FEILMELDNR FOR SYS_REG      */        00016770
                      /* ******************************************* */ 00016780
                      /* NOEN AV TEKSTENE I VÅRE FEILMELDINGER SKAL  */ 00016790
                      /* ERSTATTES MED ANDRE TEKSTER.  FEILMELDINGS- */ 00016800
                      /* NUMMERET SKAL BEHOLDES.  ANDRE MELDINGER    */ 00016810
                      /* SKAL HA EN TILLEGGS-TEKST, SOM LEGGES PÅ    */ 00016820
                      /* PLASS NR. 2 I FEIL-TABELLEN.                */ 00016830
                      /* *********************************************/ 00016840
                                                                        00016850
                      SELECT (W01_FEIL_NR(I));                          00016860
                                                                        00016870
                         WHEN (210,495,497,498,500,501,1710,1802,1901,  00016880
                                                            1902,1903)  00016890
                            DO;                                         00016900
                                                                        00016910
                               /* ********************************** */ 00016920
                               /* MELDING:                           */ 00016930
                               /* SYSTEMFEIL, SEND GRUNNBLANKETT TIL */ 00016940
                               /* RTV.                               */ 00016950
                               /* ************************************/ 00016960
                                                                        00016970
                               FEIL_STRUC.FEIL_NR = 1990;               00016980
                               W_ERSTATT_FEILTEKST = TRUE;              00016990
                            END;                                        00017000
                                                                        00017010
                         WHEN (211,212,217,499,503,504,505,1904)        00017020
                            DO;                                         00017030
                                                                        00017040
                               /* ********************************** */ 00017050
                               /* MELDING:                           */ 00017060
                               /* SYSTEMFEIL, PRØV PÅ NYTT ELLER     */ 00017070
                               /* SEND GRUNNBLANKETT TIL RTV.        */ 00017080
                               /* ************************************/ 00017090
                                                                        00017100
                               FEIL_STRUC.FEIL_NR = 1991;               00017110
                               W_ERSTATT_FEILTEKST = TRUE;              00017120
                            END;                                        00017130
                                                                        00017140
                         WHEN (213,215,216,225,226,227,502,601,602,1202,00017150
                                                              1609,1703)00017160
                            DO;                                         00017170
                                                                        00017180
                               /* ********************************** */ 00017190
                               /* MELDING:                           */ 00017200
                               /* SEND GRUNNBLANKETT TIL RTV.        */ 00017210
                               /* ************************************/ 00017220
                                                                        00017230
                               FEIL_STRUC.FEIL_NR = 1992;               00017240
                               W_ERSTATT_FEILTEKST = TRUE;              00017250
                            END;                                        00017260
                                                                        00017270
                         WHEN (1008)                                    00017280
                            DO;                                         00017290
                                                                        00017300
                               /* ********************************** */ 00017310
                               /* ERSTATTES MED                      */ 00017320
                               /* GIFTEMÅLSMELDING FOR EKTEFELLE MÅ  */ 00017330
                               /* REGISTRERES.                       */ 00017340
                               /* ************************************/ 00017350
                                                                        00017360
                               FEIL_STRUC.FEIL_NR = 1995;               00017370
                               W_ERSTATT_FEILTEKST = TRUE;              00017380
                            END;                                        00017390
                                                                        00017400
                         WHEN (270,1704,1719)                           00017410
                            DO;                                         00017420
                                                                        00017430
                               /* ********************************** */ 00017440
                               /* TILLEGGS-TEKST:                    */ 00017450
                               /* TA KONTAKT MED REG.SEKSJ., RTV.    */ 00017460
                               /* ************************************/ 00017470
                                                                        00017480
                               W01_FEIL_NR(2)     = 1994;               00017490
                               FEIL_STRUC.FEIL_NR = W01_FEIL_NR(I);     00017500
                            END;                                        00017510
                                                                        00017520
                         WHEN (1711)                                    00017530
                            DO;                                         00017540
                                                                        00017550
                               /* ********************************** */ 00017560
                               /* TILLEGGS-TEKST:                    */ 00017570
                               /* SEND GRUNNBLANKETT TIL RTV.        */ 00017580
                               /* ************************************/ 00017590
                                                                        00017600
                               W01_FEIL_NR(2)     = 1992;               00017610
                               FEIL_STRUC.FEIL_NR = W01_FEIL_NR(I);     00017620
                            END;                                        00017630
                                                                        00017640
                         OTHERWISE                                      00017650
                            FEIL_STRUC.FEIL_NR = W01_FEIL_NR(I);        00017660
                                                                        00017670
                      END; /* SELECT */                                 00017680
                                                                        00017690
                      EXEC CICS LINK PROGRAM ('R0019921')               00017700
                                     COMMAREA(FEIL_STRUC);              00017710
                                                                        00017720
                      IF W_ERSTATT_FEILTEKST            THEN            00017730
                         DO;                                            00017740
                            W02_FEIL_NR_PIC = W01_FEIL_NR(I);           00017750
                            FEIL_REC.FEIL_MELD(I) =                     00017760
                                    W02_FEIL_NR_PIC   !!                00017770
                                    SUBSTR(FEIL_STRUC.FEIL_MELDING,5);  00017780
                            W_ERSTATT_FEILTEKST = FALSE;                00017790
                         END;                                           00017800
                      ELSE                                              00017810
                         FEIL_REC.FEIL_MELD(I) =                        00017820
                                              FEIL_STRUC.FEIL_MELDING;  00017830
                                                                        00017840
                      CALL P081_REDIGER_FEIL_MELDING;                   00017850
                   END;                                                 00017860
                                                                        00017870
                                                                        00017880
                END;                                                    00017890
                                                                        00017900
                                                                        00017910
          CALL P050_SKRIV_NORFEIL;                                      00017920
                                                                        00017930
          KOM_OMR.TRANS_OPPL_PEKER  = ADDR(KOM_OMR.TRANS_OPPL_OMR);     00017940
          KOM_OMR.TRANS_PEKER       = ADDR(KOM_OMR.TRANS_OMR);          00017950
                                                                        00017960
                                                                        00017970
    END P080_FEIL_I_BEH;                                                00017980
                                                                        00017990
                                                                        00018000
 /* ***************************************************************** */00018010
 /* DENNE SETTER PÅ NULLER FORAN FEIL-MELDINGSNUMMER SOM ER KORTERE   */00018020
 /* ENN 4 POS. (ØNSKE FRA KARI ØSTDAHL/THOR BJERKE 14/10-87)          */00018030
 /* ***************************************************************** */00018040
 P081_REDIGER_FEIL_MELDING:PROC;                                        00018050
                                                                        00018060
                                                                        00018070
          IF SUBSTR(FEIL_REC.FEIL_MELD(I),2,1) = ' '       THEN         00018080
             FEIL_REC.FEIL_MELD(I) =       '000'       !!               00018090
                                            FEIL_REC.FEIL_MELD(I);      00018100
          ELSE                                                          00018110
             IF SUBSTR(FEIL_REC.FEIL_MELD(I),3,1) = ' '    THEN         00018120
                FEIL_REC.FEIL_MELD(I) =    '00'        !!               00018130
                                            FEIL_REC.FEIL_MELD(I);      00018140
             ELSE                                                       00018150
                IF SUBSTR(FEIL_REC.FEIL_MELD(I),4,1) = ' ' THEN         00018160
                   FEIL_REC.FEIL_MELD(I) = '0'         !!               00018170
                                            FEIL_REC.FEIL_MELD(I);      00018180
                                                                        00018190
                                                                        00018200
    END P081_REDIGER_FEIL_MELDING;                                      00018210
                                                                        00018220
                                                                        00018230
 /* ***************************************************************** */00018240
 /* DENNE KALLES VED NORMAL OG UNORMAL AVSLUTNING PÅ KJØRINGEN .      */00018250
 /* ***************************************************************** */00018260
 P090_DANN_STATISTIKK_REC:PROC;                                         00018270
                                                                        00018280
                                                                        00018290
          STATISTIKK_REC = '';                                          00018300
          STATISTIKK_DATO_ÅMD = DATE;                                   00018310
                                                                        00018320
          DO SYSTEM_INDEX = 1 TO 2;                                     00018330
                                                                        00018340
             IF SYSTEM_INDEX = 1   THEN                                 00018350
                EDB_SYSTEM   = 'I';                                     00018360
             ELSE                                                       00018370
                EDB_SYSTEM   = 'N';                                     00018380
                                                                        00018390
             BLANK_MOTTATT_I.GRUNNBL_AP     = AP_MOTTATT(SYSTEM_INDEX)  00018400
                                        +  A1_MOTTATT(SYSTEM_INDEX);    00018410
             BLANK_MOTTATT_I.GRUNNBL_UP      = UP_MOTTATT(SYSTEM_INDEX) 00018420
                                         + U2_MOTTATT(SYSTEM_INDEX)     00018430
                                         + U3_MOTTATT(SYSTEM_INDEX);    00018440
             BLANK_MOTTATT_I.GRUNNBL_EP      = EP_MOTTATT(SYSTEM_INDEX) 00018450
                                         + E3_MOTTATT(SYSTEM_INDEX);    00018460
             BLANK_MOTTATT_I.GRUNNBL_BP      = BP_MOTTATT(SYSTEM_INDEX) 00018470
                                         + B6_MOTTATT(SYSTEM_INDEX);    00018480
             BLANK_MOTTATT_I.GRUNNBL_FT      = FT_MOTTATT(SYSTEM_INDEX) 00018490
                              +   F7_MOTTATT(SYSTEM_INDEX);             00018500
             BLANK_MOTTATT_I .GRUNNBL_E1 = E1_MOTTATT(SYSTEM_INDEX)     00018510
                                       +  EN_MOTTATT(SYSTEM_INDEX);     00018520
             BLANK_MOTTATT_I .GRUNNBL_E2 = E2_MOTTATT(SYSTEM_INDEX);    00018530
             BLANK_MOTTATT_I .GRUNNBL_O1 = O1_MOTTATT(SYSTEM_INDEX);    00018540
             BLANK_MOTTATT_I .GRUNNBL_O2 = O2_MOTTATT(SYSTEM_INDEX);    00018550
             BLANK_MOTTATT_I.GRUNNBL_AF     = AFP_MOTTATT(SYSTEM_INDEX) 00018560
                                          +   KFP_MOTTATT(SYSTEM_INDEX);00018570
                                                                        00018580
             BLANK_AVVIST.GRUNNBL_AP         = AP_AVVIST(SYSTEM_INDEX)  00018590
                                         + A1_AVVIST(SYSTEM_INDEX);     00018600
             BLANK_AVVIST.GRUNNBL_UP         = UP_AVVIST(SYSTEM_INDEX)  00018610
                                          + U2_AVVIST(SYSTEM_INDEX)     00018620
                                          + U3_AVVIST(SYSTEM_INDEX);    00018630
             BLANK_AVVIST.GRUNNBL_EP         = EP_AVVIST(SYSTEM_INDEX)  00018640
                                         + E3_AVVIST(SYSTEM_INDEX);     00018650
             BLANK_AVVIST.GRUNNBL_BP         = BP_AVVIST(SYSTEM_INDEX)  00018660
                                         + B6_AVVIST(SYSTEM_INDEX);     00018670
             BLANK_AVVIST.GRUNNBL_FT         = FT_AVVIST(SYSTEM_INDEX)  00018680
                                         + F7_AVVIST(SYSTEM_INDEX);     00018690
             BLANK_AVVIST .GRUNNBL_E1 = E1_AVVIST(SYSTEM_INDEX)         00018700
                                      + EN_AVVIST(SYSTEM_INDEX);        00018710
             BLANK_AVVIST .GRUNNBL_E2 = E2_AVVIST(SYSTEM_INDEX);        00018720
             BLANK_AVVIST .GRUNNBL_O1 = O1_AVVIST(SYSTEM_INDEX);        00018730
             BLANK_AVVIST .GRUNNBL_O2 = O2_AVVIST(SYSTEM_INDEX);        00018740
             BLANK_AVVIST.GRUNNBL_AF        = AFP_AVVIST(SYSTEM_INDEX)  00018750
                                           +  KFP_AVVIST(SYSTEM_INDEX); 00018760
                                                                        00018770
             FEIL_BLANKETTYPE              = FEIL_BL_TYPE(SYSTEM_INDEX);00018780
                                                                        00018790
             EXEC CICS WRITE DATASET ('NORSTAT')                        00018800
                             FROM ( STATISTIKK_REC)                     00018810
                             RIDFLD ( STAT_RBA) RBA;                    00018820
          END;                                                          00018830
                                                                        00018840
                                                                        00018850
    END P090_DANN_STATISTIKK_REC;                                       00018860
                                                                        00018870
 /*********************************************************************/00018880
 /*                                                                   */00018890
 /*    RECORD-FOR FEIL BLANKETT ER SKRIVES HERE                       */00018900
 /*                                                                   */00018910
 /*********************************************************************/00018920
                                                                        00018930
    DCL 01 SYS_REC,                                                     00018940
           05 KJØRING_DATO       PIC '(6)9',                            00018950
           05 MELDNR (3)         PIC '(4)9',                            00018960
           05 HODE,                                                     00018970
              10 TKNR            PIC '(4)9',                            00018980
              10 RECORD_TYPE     CHAR (2),                              00018990
              10 TRANS_TYPE      CHAR (2),                              00019000
              10 TRANS_DATO_ÅMD  PIC '(6)9',                            00019010
              10 TRANS_TID       PIC '(4)9',                            00019020
           05 BLANKETT_HODE,                                            00019030
              10 FNR             PIC '(11)9',                           00019040
              10 BLANKETT_TYPE   CHAR (2),                              00019050
              10 REC_NR          CHAR (2),                              00019060
              10 NAVN            CHAR (25),                             00019070
              10 BLANKETT        CHAR (264);                            00019080
                                                                        00019090
  DCL       SYS_RBA               POINTER;                              00019100
                                                                        00019110
  SKRIV_SYS_REG: PROC;                                                  00019120
     SYS_REC.KJØRING_DATO   = DATE;                                     00019130
     SYS_REC.HODE           = BLANKETT_RECORD.HODE;                     00019140
     SYS_REC.BLANKETT_HODE  = BLANKETT_RECORD.BLANKETT_HODE;            00019150
                                                                        00019160
     EXEC CICS WRITE  DATASET ('SYSREG')                                00019170
                      FROM    (SYS_REC)                                 00019180
                      RIDFLD  (SYS_RBA)                                 00019190
                      RBA;                                              00019200
  END SKRIV_SYS_REG;                                                    00019210
                                                                        00019220
 /* ***************************************************************** */00019230
 /* DENNE KALLES VED NORMAL OG UNORMAL AVSLUTNING PÅ KJØRINGEN .      */00019240
 /* ***************************************************************** */00019250
 P999_SLUTT:                                                            00019260
      PROC;                                                             00019270
                                                                        00019280
                                                                        00019290
    DCL UNORMAL_AVSLUTNING     BIT (1)     INIT ('0'B)               ;  00019300
                                                                        00019310
                                                                        00019320
          EXEC CICS HANDLE CONDITION ERROR (ABEND)                   ;  00019330
                                                                        00019340
                                                                        00019350
          IF (S001NO1O.ANT_Ø_BEHO = ANT_BEH !                           00019360
              TIDS_TEST     =  TID_UTE      )   &                       00019370
                                                                        00019380
              MELDING       =  (78)' '              THEN                00019390
                                                                        00019400
              DO;                                                       00019410
                 MELDING    =  'NORMALT AVSLUTTET PÅ FNR : ' !!         00019420
                       BLANKETT_RECORD.FNR !! '    TRYKK ENTER  !! ' ;  00019430
              END;                                                      00019440
                                                                        00019450
          ELSE                                                          00019460
            IF MELDING                  =   (78)' '      &              00019470
               TIDS_TEST               ^=   TID_UTE               THEN  00019480
                                                                        00019490
                                                                        00019500
               DO;                                                      00019510
                  MELDING         =  'NORMALT AVSLUTTET PÅ FNR : ' !!   00019520
                                      BLANKETT_RECORD.FNR !!            00019530
                                     '   TRYKK ENTER   !!';             00019540
               END;                                                     00019550
                                                                        00019560
                                                                        00019570
            ELSE                                                        00019580
               DO;                                                      00019590
                                                                        00019600
                                                                        00019610
                  /* ************************************************ */00019620
                  /* FEIL I BEH. OPPDATERINGENE FJERNES OG TELLERE    */00019630
                  /* RESTILLES.                                       */00019640
                  /* ************************************************ */00019650
                                                                        00019660
                                                                        00019670
                  EXEC CICS SYNCPOINT ROLLBACK                         ;00019680
                                                                        00019690
                  S001NO1O.ANT_REC_INPUTO =                             00019700
                                          S001NO1O.ANT_REC_INPUTO  -  1;00019710
                                                                        00019720
                  IF W_ANT_FERDIG_BEH_OPPD                          THEN00019730
                     S001NO1O.ANT_FERDIG_BEHO =                         00019740
                                      S001NO1O.ANT_FERDIG_BEHO     -  1;00019750
                                                                        00019760
                  UNORMAL_AVSLUTNING   =  TRUE                         ;00019770
               END;                                                     00019780
                                                                        00019790
                                                                        00019800
          /* ******************************************************** */00019810
          /* TERMINERER PSB'EN                                        */00019820
          /* SENDER UT MAP'EN OG SKRIVER PÅ LOGGEN .                  */00019830
          /* SIMULERER NY INNGANG FRA R0010426 HVIS ABEND             */00019840
          /* ******************************************************** */00019850
                                                                        00019860
                                                                        00019870
          CALL P030_DATABASE ('TERM')                             ;     00019880
                                                                        00019890
                                                                        00019900
          EXEC CICS ASKTIME                                           ; 00019910
          S001NO1O.KLOKKE_LOGO = EIBTIME / 100                        ; 00019920
          S001NO1I.DATO_LOGI =  DATE()                                ; 00019930
                                                                        00019940
          S001NO1O.MELDINGO  =   MELDING;                               00019950
          S001NO1O.CICS_INFOO       =  CICS_NAVN;                       00019960
                                                                        00019970
          EXEC CICS SEND MAP ('S001NO1') MAPSET ('S001NO3') WAIT        00019980
                                                 DATAONLY;              00019990
          S001NO1O.RECORD_TYPEO    = 'S';                               00020000
          S001NO1O.TKNRO           =  BLANKETT_RECORD.TKNR;             00020010
          S001NO1O.FNRO            =  BLANKETT_RECORD.FNR;              00020020
          S001NO1O.BLANKETT_TYPEO  =  BLANKETT_RECORD.BLANKETT_TYPE;    00020030
          S001NO1O.REC_NRO         =  BLANKETT_RECORD.REC_NR;           00020040
          S001NO1O.TRANS_DATOO     =  BLANKETT_RECORD.TRANS_DATO_ÅMD;   00020050
          S001NO1O.TRANS_TIDO      =  BLANKETT_RECORD.TRANS_TID;        00020060
                                                                        00020070
                                                                        00020080
          IF ANT_BEH        >  0                      THEN              00020090
             DO;                                                        00020100
                EXEC CICS WRITE DATASET ('NORLOGG') FROM   ( MAP_CHAR)  00020110
                                                    RIDFLD ( LOGG_RBA)  00020120
                                                    RBA;                00020130
                IF ^AUTO_KJØRING THEN                                   00020140
                   CALL P090_DANN_STATISTIKK_REC;                       00020150
                                                                        00020160
             END;                                                       00020170
                                                                        00020180
                                                                        00020190
          IF UNORMAL_AVSLUTNING                                THEN     00020200
             DO;                                                        00020210
                DIV_PARAM_OMR.PROGRAM_ID = 'R0010426'              ;    00020220
                EXEC CICS RETURN TRANSID ('RNO1') COMMAREA ( KOM_OMR ); 00020230
             END;                                                       00020240
          ELSE                                                          00020250
             DO;                                                        00020260
                EXEC CICS RECEIVE MAP ('S001NO1') MAPSET ('S001NO3')    00020270
                                                  SET (BMSMAPBR);       00020280
                                                                        00020290
                /* ************************************************** */00020300
                /* SIMULERER INGANG FRA R0010301                      */00020310
                /* ************************************************** */00020320
                                                                        00020330
                DIV_PARAM_OMR.PROGRAM_ID = 'R0010301'              ;    00020340
                TRANS_OPPL_OMR.TRANSKODE = 'RA20'                  ;    00020350
                EXEC CICS XCTL PROGRAM ('R0010420')                     00020360
                              COMMAREA ( KOM_OMR ) ;                    00020370
             END;                                                       00020380
                                                                        00020390
                                                                        00020400
  END P999_SLUTT;                                                       00020410
                                                                        00020420
                                                                        00020430
  /* ********************************************************** */      00020440
  /* LABLER VED ABEND-SITUASJONER                               */      00020450
  /* ********************************************************** */      00020460
                                                                        00020470
                                                                        00020480
  CICS_ABEND:                                                           00020490
          ON ERROR SYSTEM;                                              00020500
          MELDING = 'STOPP ! ABEND KEY:'            !!                  00020510
                     BLANKETT_RECORD.TKNR           !! ' ' !!           00020520
                     BLANKETT_RECORD.FNR            !! ' ' !!           00020530
                     BLANKETT_RECORD.TRANS_DATO_ÅMD !! ' ' !!           00020540
                     BLANKETT_RECORD.TRANS_TID      !! ' ' !!           00020550
                     BLANKETT_RECORD.BLANKETT_TYPE  !! ' ' !!           00020560
                     BLANKETT_RECORD.REC_NR         !!                  00020570
                    ' TA HARD-COPY! TRYKK ENTER!';                      00020580
                                                                        00020590
          CALL P999_SLUTT ;                                             00020600
                                                                        00020610
                                                                        00020620
  ABEND:                                                                00020630
          EXEC CICS ABEND ABCODE ('FEIL')                          ;    00020640
                                                                        00020650
                                                                        00020660
                                                                        00020670
                                                                        00020680
                                                                        00020690
 %PAGE;                                                                 00020700
  /* ********************************************************** */      00020710
  /*          E K S T E R N E   P R O C E D U R E R             */      00020720
  /* ********************************************************** */      00020730
                                                                        00020740
                                                                        00020750
                                                                        00020760
 %INCLUDE R001NO11;          /*     KONTROLL AP_BLANKETT */             00020770
                                                                        00020780
 %INCLUDE R001NN11;          /*     KONTROLL A1_BLANKETT */             00020790
                                                                        00020800
 %INCLUDE R001NO12;          /*     KONTROLL UP_BLANKETT */             00020810
                                                                        00020820
 %INCLUDE R001NN12;           /*   KONTROLL U2_BLANKETT */              00020830
 %INCLUDE R001NU12;           /*   KONTROLL U3_BLANKETT */              00020840
                                                                        00020850
 %INCLUDE R001NO13;          /*     KONTROLL EP_BLANKETT */             00020860
                                                                        00020870
 %INCLUDE R001NN13;          /*     KONTROLL E3_BLANKETT */             00020880
                                                                        00020890
 %INCLUDE R001NO14;          /*     KONTROLL BP_BLANKETT */             00020900
                                                                        00020910
  %INCLUDE R001NN14;        /*   KONTROLL B6_BLANKETT */                00020920
                                                                        00020930
 %INCLUDE R001NO15;          /*     KONTROLL FT_BLANKETT */             00020940
                                                                        00020950
 %INCLUDE R001NN15;          /*     KONTROLL F7_BLANKETT */             00020960
                                                                        00020970
 %INCLUDE R001NO16;          /*     KONTROLL E1_BLANKETT */             00020980
 %INCLUDE R001NU16;          /*     KONTROLL EN_BLANKETT */             00020990
                                                                        00021000
 %INCLUDE R001NO17;          /*     KONTROLL O1_BLANKETT */             00021010
                                                                        00021020
 %INCLUDE R001NO18;          /*     KONTROLL O2_BLANKETT */             00021030
                                                                        00021040
 %INCLUDE R001NO19;          /*     KONTROLL E2_BLANKETT */             00021050
                                                                        00021060
 %INCLUDE R001NO1A;          /*     KONTROLL AFP_BLANKETT */            00021070
 %INCLUDE R001NU1A;          /*     KONTROLL KFP_BLANKETT */            00021080
                                                                        00021090
 %INCLUDE R001NO1B;          /*     KONTROLL AU_BLANKETT */             00021100
                                                                        00021110
 %INCLUDE R0010508;          /*     TT_AP                */             00021120
                                                                        00021130
 %INCLUDE R0010608;          /*     TT_UP_EP             */             00021140
                                                                        00021150
 %INCLUDE R0019901;          /*     F_GYLDIG_DATO        */             00021160
                                                                        00021170
 %INCLUDE R0019902;          /*     F_KJØNN              */             00021180
                                                                        00021190
 %INCLUDE R0019903;          /*     F_EK_ALDER           */             00021200
                                                                        00021210
 %INCLUDE R0019904;          /*     F_GYLDIG_FNR         */             00021220
                                                                        00021230
 %INCLUDE R0019905;          /*     F_ALDER              */             00021240
                                                                        00021250
 %INCLUDE R0019907;          /*     F_TABSØKC_FUNNET     */             00021260
                                                                        00021270
 %INCLUDE R0019908;          /*     F_DAGS_DATO_PLUSS1_MÅ*/             00021280
                                                                        00021290
 %INCLUDE R0019909;          /*     F_KONTROLL_TT        */             00021300
                                                                        00021310
 %INCLUDE R0019910;          /*     F_NUMERISK           */             00021320
                                                                        00021330
 %INCLUDE R0019911;          /*     F_GYLDIG_DATO_DMÅ    */             00021340
                                                                        00021350
 %INCLUDE R0019912;          /*     F_FELT_CHAR_PICNN    */             00021360
                                                                        00021370
 %INCLUDE R0019913;          /*     F_SNU_DATO           */             00021380
                                                                        00021390
 %INCLUDE R0019942;          /*     F_SNU_DØDSDATO       */             00021400
                                                                        00021410
 %INCLUDE R0019953;          /*     F_40DAGER            */             00021420
                                                                        00021430
 %INCLUDE R0019956;          /*     P9956_BER_G_CICS     */             00021440
                                                                        00021450
 %INCLUDE R0019959;          /*     F_2MDR               */             00021460
 %INCLUDE R0019964;          /*     F_6MDR               */             00021470
                                                                        00021480
                                                                        00021490
 END R001NO1;                                                           00021500
