 /* ***************************************************************** */R0000010
 /*IDENTIFIKASJON:                                                    */R0000020
 /*    R0019911 - F_GYLDIG_DATO_DMÅ - FUNKSJON I PLI.                 */R0000030
 /*    PROGRAMMERER: JAN-H. KRISTENSEN JUNI 1981.                     */R0000040
 /*HENSIKT:                                                           */R0000050
 /*    FUNKSJONEN KONTROLLERER OM ET NUMERISK FELT PÅ SEKS            */R0000060
 /*    KARAKTERER REPRESENTERER EN RIKTIG DATO I DETTE ÅRHUNDRET.     */R0000070
 /*    DERSOM DATOEN ER KORREKT RETURNERES '1'B, DERSOM               */R0000080
 /*    DATOEN IKKE ER KORREKT RETURNERES '0'B.                        */R0000090
 /*PARAMETER INN:                                                     */R0000100
 /*    DATO_DMÅ.                                                      */R0000110
 /*PARAMETER UT:                                                      */R0000120
 /*    RETUR.                                                         */R0000130
 /*BRUK:                                                              */R0000140
 /*    IF ^ F_GYLDIG_DATO_DMÅ(DATO_DMÅ) THEN (SKRIV FEILMELDING)      */R0000150
 /* ***************************************************************** */R0000160
 %PAGE;                                                                 R0000170
 F_GYLDIG_DATO_DMÅ: PROC(DATO_DMÅ) RETURNS(BIT(1));                     R0000180
 DCL                                                                    R0000190
    DATO_DMÅ PIC '999999',                                              R0000200
    DAG DEF DATO_DMÅ POS(1) PIC '99',                                   R0000210
    MND DEF DATO_DMÅ POS(3) PIC '99',                                   R0000220
    ÅR DEF DATO_DMÅ POS(5) PIC '99',                                    R0000230
    MNDTAB(12) DEC FIXED(2) INIT(31,28,31,30,31,30,31,31,30,31,30,31),  R0000240
    RETUR BIT(1) INIT('1'B),                                            R0000250
    MOD BUILTIN;                                                        R0000260
    IF DAG = 29 & MND = 2 THEN                                          R0000270
      DO;                                                               R0000280
         IF MOD(ÅR + 1900,400) = 0 THEN                                 R0000290
            MNDTAB(2) = 29;                                             R0000300
         ELSE                                                           R0000310
         IF MOD(ÅR + 1900,100) = 0 THEN                                 R0000320
            ;                                                           R0000330
         ELSE                                                           R0000340
         IF MOD(ÅR + 1900,4) = 0 THEN                                   R0000350
            MNDTAB(2) = 29;                                             R0000360
      END;                                                              R0000370
    IF (MND < 1 ! MND > 12 )THEN                                        R0000380
       RETUR = '0'B;                                                    R0000390
    ELSE                                                                R0000400
    IF ÅR < 0 THEN                                                      R0000410
       RETUR = '0'B;                                                    R0000420
    ELSE                                                                R0000430
    IF (DAG < 1 ! DAG > MNDTAB(MND)) THEN                               R0000440
       RETUR = '0'B;                                                    R0000450
    RETURN(RETUR);                                                      R0000460
 END F_GYLDIG_DATO_DMÅ;                                                 R0000470
