 /*       SIST ENDRET 25/02-97 12.48.24 AV   JDA7339                  */00000000
 /*       SIST ENDRET 06/02-96 13.17.36 AV   JDA0310                  */00000010
 /*       SIST ENDRET 13/06-95 10.55.15 AV   TSB0310                  */00000020
 /* ***************************************************************** */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /* **********************                                            */00000050
 /*  PROGRAM-IDENT : R00104EE  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000060
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000070
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000080
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000090
 /*                                                                   */00000100
 /* ***************************************************************** */00000110
 /*HENSIKT:                                                           */00000120
 /* **********                                                        */00000130
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000140
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000150
 /*    FORHÅND.                                                       */00000160
 /*    MAPS HØRER INN UNDER MAPSET 'S001F3'.                         */ 00000170
 /*                                                                   */00000180
 /* ***************************************************************** */00000190
 /*PROGRAMTILKNYTTING:                                                */00000200
 /* ********************                                              */00000210
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000220
 /*                                                                   */00000230
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000240
 /*    BRUK :                                                         */00000250
 /*    EXEC CICS XCTL PROGRAM ('R00104EE') COMMAREA(KOM_OMR);         */00000260
 /*    PROGRAMMET INCLUDER :                                          */00000270
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    EE       */00000280
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       EE       */00000290
 /* ***************************************************************** */00000300
 /*DATASETTOPPLYSNINGER:                                              */00000310
 /* ***********************                                           */00000320
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000330
 /*                                                                   */00000340
 /* ***************************************************************** */00000350
 /*FEILMELDINGER:                                                     */00000360
 /* *******************                                               */00000370
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000380
 /*                                                                   */00000390
 /* ***************************************************************** */00000400
                                                                        00000410
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000420
                                                                        00000430
          %INCLUDE P0019906; /* TRANS_OPPL_OMR */                       00000440
          %INCLUDE P0019908; /* KOM_OMR        */                       00000450
          %INCLUDE P0019910; /* STYRINGS_OMR   */                       00000460
          %INCLUDE P0019912; /* DIV_PARAM_OMR  */                       00000470
          %INCLUDE P0019913; /* LOKAL_KOM_OMR  */                       00000480
                                                                        00000490
 DCL                                                                    00000500
      (CSTG, ADDR)                   BUILTIN;                           00000510
 DCL  COMMAREA_PEKER         PTR,                                       00000520
      LOKAL_KOM_PTR          PTR;                                       00000530
                                                                        00000540
                                                                        00000550
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000560
 DCL                                                                    00000570
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000580
    DFHBMUNP             CHAR(1) INIT(' '),                             00000590
    DFHBMBRY             CHAR(1) INIT('H'),                             00000600
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000610
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000620
    MELDING6O            CHAR(10),                                      00000630
    YMELDING6O           CHAR(10);                                      00000640
                                                                        00000650
          %INCLUDE S001F3  ;                                            00000660
          %INCLUDE P001U801;                                            00000670
                                                                        00000680
                                                                        00000690
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000700
                                                                        00000710
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000720
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000730
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000740
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000750
                                                                        00000760
                                                                        00000770
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000780
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000790
                                                                        00000800
                                                                        00000810
           IF ^W01_YSKADE       &                                       00000820
              ^W01_NORSK_BOSATT  THEN                                   00000830
              DO;                                                       00000840
                  CALL OVERFØR_EE_SØKER_MAP;          /* R001U806 */    00000850
                                                                        00000860
                                                                        00000870
                  S001U81O.DUMMYA = 'Ø';             /* PROT,DARK  */   00000880
                  W01_MAP = 'S001U81' ;                                 00000890
                                                                        00000900
      /*          W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1; */             00000910
                                                                        00000920
                  IF EES.NORSK_BOSATT   = 'N'   &                       00000930
                     EES.YSKADE_TILLEGG = 'J' THEN                      00000940
                     DO;                                                00000950
                        W01_NORSK_BOSATT = '1'B;                        00000960
                        W01_YSKADE = '1'B;                              00000970
                        W01_SIDE_ANTALL = W01_SIDE_ANTALL + 2;          00000980
                     END;                                               00000990
                ELSE                                                    00001000
                  IF EES.NORSK_BOSATT  = 'N'   THEN                     00001010
                     DO;                                                00001020
                       W01_NORSK_BOSATT = '1'B;                         00001030
                        W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1;          00001040
                                                                        00001050
                     END;                                               00001060
                ELSE                                                    00001070
                  IF EES.YSKADE_TILLEGG = 'J' THEN                      00001080
                     DO;                                                00001090
                        W01_YSKADE = '1'B;                              00001100
                        W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1;          00001110
                                                                        00001120
                     END;                                               00001130
                                                                        00001140
              END;                                                      00001150
           ELSE                                                         00001160
              IF W01_NORSK_BOSATT  THEN                                 00001170
                 DO;                                                    00001180
                        W01_NORSK_BOSATT = '0'B;                        00001190
                        CALL OVERFØR_EE_SP_MAP;                         00001200
                        S001U82O.DUMMYA = 'Ø';     /* PROT,DARK  */     00001210
                        W01_MAP = 'S001U82' ;                           00001220
                                                                        00001230
                 END;                                                   00001240
           ELSE                                                         00001250
              IF W01_YSKADE       THEN                                  00001260
                 DO;                                                    00001270
                    CALL OVERFØR_EE_YP_MAP;            /* R001U806 */   00001280
                    W01_YSKADE = '0'B;                                  00001290
                                                                        00001300
                    S001201O.DUMMYA = 'Ø';             /* PROT,DARK  */ 00001310
                    W01_MAP = 'S001201' ;                               00001320
                                                                        00001330
                 END;                                                   00001340
                                                                        00001350
                                                                        00001360
      EXEC CICS RETURN;                                                 00001370
                                                                        00001380
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00001390
      PROC(FIXED_DEC_5);                                                00001400
                                                                        00001410
      DCL                                                               00001420
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00001430
                                                                        00001440
   END SKRIV_FEIL;                                                      00001450
                                                                        00001460
        SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001470
                                                                        00001480
           DCL                                                          00001490
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001500
                                                                        00001510
        END SKRIV_FEIL_YP;                                              00001520
                                                                        00001530
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001540
                                                                        00001550
           DCL                                                          00001560
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001570
                                                                        00001580
        END SKRIV_FEIL_SP;                                              00001590
                                                                        00001600
          %INCLUDE R0019912;                                            00001610
          %INCLUDE R001U806;                                            00001620
                                                                        00001630
 END R001041;                                                           00001640
