 /*       SIST ENDRET 06/05-93 14.28.11 AV   DYBVIK                   */00000000
 F_XTP92 :                                                              00000010
  PROC(FÅ,G,SPT,OPT,PÅ,PÅ_ETTER91,UFG,TP_PROSENT,FORHØY_IND)            00000020
        RETURNS(DEC FIXED(5));                                          00000030
  DCL                                                                   00000040
     FÅ                 PIC '99',                                       00000050
     G                  FIXED DEC(5),                                   00000060
     SPT                FIXED DEC(3,2),                                 00000070
     OPT                FIXED DEC(3,2),                                 00000080
     PÅ                 FIXED DEC(3),                                   00000090
     PÅ_FØR92           FIXED DEC(3),                                   00000100
     PÅ_ETTER91         FIXED DEC(3),                                   00000110
     UFG                FIXED DEC(5,2),                                 00000120
     TP_PROSENT         FIXED DEC(3),                                   00000130
     OÅ                 FIXED DEC(3),                                   00000140
     FORHØY_IND         CHAR(1),                                        00000150
     TP_WORK            FIXED DEC(11,4),                                00000160
     TP_WORK_2          FIXED DEC(11,4),                                00000170
     TP2_WORK           FIXED DEC(11,4),                                00000180
     TP_WORK_92         FIXED DEC(11,4),                                00000190
     GAMMEL             FIXED DEC(11,4),                                00000200
     NY                 FIXED DEC(11,4),                                00000210
     TP                 FIXED DEC(5);                                   00000220
                                                                        00000230
   DCL PGNAVN         CHAR (8);                                         00000240
   PGNAVN = 'R001X142';                                                 00000250
                                                                        00000260
   IF PÅ_ETTER91 = 0           THEN                                     00000270
      DO;                                                               00000280
         CALL GAMLE_REGLER;                                             00000290
         GOTO SLUTT;                                                    00000300
      END;                                                              00000310
                                                                        00000320
   PÅ_FØR92 = PÅ - PÅ_ETTER91;                                          00000330
   GAMMEL = G * 45 /100;                                                00000340
   NY     = G * 42 /100;                                                00000350
                                                                        00000360
  IF  PÅ > 2              !                                             00000370
     (FÅ = 99 & PÅ = 2)   !                                             00000380
     (FÅ = 98 & PÅ = 1)  THEN                                           00000390
     DO;                                                                00000400
        IF FÅ > 36 & FÅ < 98        THEN                                00000410
           DO;                                                          00000420
                                                                        00000430
              TP_WORK = GAMMEL * PÅ_FØR92 / 40;                         00000440
              TP_WORK_92 = NY * PÅ_ETTER91 / 40;                        00000450
              TP_WORK = (TP_WORK + TP_WORK_92) * SPT;                   00000460
              TP_WORK = TP_WORK * UFG /100;                             00000470
              TP_WORK = TP_WORK * TP_PROSENT / 100;                     00000480
              TP_WORK = TP_WORK / 12;                                   00000490
           END;                                                         00000500
        ELSE                                                            00000510
           DO;                                                          00000520
              IF FÅ > 17 & FÅ < 98     THEN                             00000530
                 OÅ = 20 + FÅ - 17;                                     00000540
              ELSE                                                      00000550
                 OÅ = 20;                                               00000560
              IF SPT > OPT THEN                                         00000570
                 DO;                                                    00000580
                                                                        00000590
                    TP_WORK = GAMMEL * PÅ_FØR92 / OÅ;                   00000600
                    TP_WORK_92 = NY * PÅ_ETTER91 / OÅ;                  00000610
                    TP_WORK = (TP_WORK + TP_WORK_92) * OPT;             00000620
                                                                        00000630
                    TP2_WORK = GAMMEL * PÅ_FØR92 / 40;                  00000640
                    TP_WORK_92 = NY * PÅ_ETTER91 / 40;                  00000650
                    TP2_WORK = (TP2_WORK + TP_WORK_92) * (SPT - OPT);   00000660
                    TP_WORK = (TP_WORK + TP2_WORK) * UFG /100;          00000670
                    TP_WORK = TP_WORK * TP_PROSENT / 100;               00000680
                    TP_WORK = TP_WORK / 12;                             00000690
                 END;                                                   00000700
              ELSE                                                      00000710
                 DO;                                                    00000720
                                                                        00000730
                    TP_WORK = GAMMEL * PÅ_FØR92 / OÅ;                   00000740
                    TP_WORK_92 = NY * PÅ_ETTER91 / OÅ;                  00000750
                    TP_WORK = (TP_WORK + TP_WORK_92) * SPT;             00000760
                    TP_WORK = TP_WORK * UFG /100;                       00000770
                    TP_WORK = TP_WORK * TP_PROSENT / 100;               00000780
                    TP_WORK = TP_WORK / 12;                             00000790
                 END;                                                   00000800
           END;                                                         00000810
        IF FORHØY_IND ^= 'N' THEN                                       00000820
           TP_WORK = TP_WORK + 0.5;                                     00000830
     END;                                                               00000840
  ELSE                                                                  00000850
     TP_WORK = 0;                                                       00000860
  TP = TP_WORK;                                                         00000870
                                                                        00000880
 GAMLE_REGLER: PROC;                                                    00000890
                                                                        00000900
  IF   PÅ > 2               !                                           00000910
     (FÅ = 99 & PÅ = 2)     !                                           00000920
     (FÅ = 98 & PÅ = 1)     THEN                                        00000930
     DO;                                                                00000940
        IF FÅ > 36 & FÅ < 98        THEN                                00000950
           DO;                                                          00000960
            /* TP_WORK = G * 0.45 * SPT * (PÅ / 40) * (UFG / 100)       00000970
                           * (TP_PROSENT / 100) / 12              */    00000980
              TP_WORK = G * 45 /100;                                    00000990
              TP_WORK = TP_WORK * SPT;                                  00001000
              TP_WORK = TP_WORK * PÅ / 40;                              00001010
              TP_WORK = TP_WORK * UFG /100;                             00001020
              TP_WORK = TP_WORK * TP_PROSENT / 100;                     00001030
              TP_WORK = TP_WORK / 12;                                   00001040
           END;                                                         00001050
        ELSE                                                            00001060
           DO;                                                          00001070
              IF FÅ > 17 & FÅ < 98     THEN                             00001080
                 OÅ = 20 + FÅ - 17;                                     00001090
              ELSE                                                      00001100
                 OÅ = 20;                                               00001110
              IF SPT > OPT THEN                                         00001120
                 DO;                                                    00001130
                /* TP_WORK = ((G * 0.45 * OPT * (PÅ / OÅ)) +            00001140
                              (G * 0.45 * (SPT - OPT) * (PÅ / 40))) *   00001150
                               (UFG / 100) *                            00001160
                               (TP_PROSENT / 100) / 12                */00001170
                    TP_WORK = G * 45 /100;                              00001180
                    TP_WORK = TP_WORK * OPT;                            00001190
                    TP_WORK = TP_WORK * PÅ / OÅ;                        00001200
                    TP_WORK_2 = G * 45 / 100;                           00001210
                    TP_WORK_2 = TP_WORK_2 * (SPT - OPT);                00001220
                    TP_WORK_2 = TP_WORK_2 * PÅ / 40;                    00001230
                    TP_WORK = (TP_WORK + TP_WORK_2) * UFG /100;         00001240
                    TP_WORK = TP_WORK * TP_PROSENT / 100;               00001250
                    TP_WORK = TP_WORK / 12;                             00001260
                 END;                                                   00001270
              ELSE                                                      00001280
                 DO;                                                    00001290
                 /* TP_WORK = G * 0.45 * SPT * (PÅ / OÅ) * (UFG / 100)  00001300
                               * (TP_PROSENT / 100) / 12              */00001310
                    TP_WORK = G * 45 / 100;                             00001320
                    TP_WORK = TP_WORK * SPT;                            00001330
                    TP_WORK = TP_WORK * PÅ / OÅ;                        00001340
                    TP_WORK = TP_WORK * UFG /100;                       00001350
                    TP_WORK = TP_WORK * TP_PROSENT / 100;               00001360
                    TP_WORK = TP_WORK / 12;                             00001370
                 END;                                                   00001380
           END;                                                         00001390
        IF FORHØY_IND ^= 'N' THEN                                       00001400
           TP_WORK = TP_WORK + 0.5;                                     00001410
     END;                                                               00001420
  ELSE                                                                  00001430
     TP_WORK = 0;                                                       00001440
  TP = TP_WORK;                                                         00001450
                                                                        00001460
                                                                        00001470
 END GAMLE_REGLER;                                                      00001480
                                                                        00001490
 SLUTT :                                                                00001500
                                                                        00001510
  RETURN(TP);                                                           00001520
                                                                        00001530
 END F_XTP92;                                                           00001540
