 /*       SIST ENDRET 16/09-97 10.24.23 AV   JDA7339                  */00000000
 /*       SIST ENDRET 15/09-97 13.31.14 AV   JDA7339                  */00000010
 /*       SIST ENDRET 29/08-97 12.28.18 AV   JDA7339                  */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0014159 - PROSEDYRE I PLI                                     */00000040
 /*    PROGRAMMERER:    HERMAN - AUGUST 1997                          */00000050
 /* *****************************************                         */00000060
 /*HENSIKT:                                                           */00000070
 /*    PROSEDYREN BEHANDLER . DØD FØR 2601 ÅR                         */00000080
 /*                         . UFØR FØR 2601 ÅR, MEN SOM VENTET PÅ     */00000090
 /*                           RETT TIL GARANTERT SPT                  */00000100
 /* ****************************************************************  */00000110
 /*PROGRAMTILKNYTNING:                                                */00000120
 /*    PROSEDYREN INCLUDES I R0014141 (CALL I 4152)                   */00000130
 /*BRUK:                                                              */00000140
 /*    CALL UNGE_DØDE_B_E                                             */00000150
 /*    VIRK_ÅM                                                        */00000160
 /*    FNR_ÅR                                                         */00000170
 /*    ALDER (ENTEN ALDER VED DØD, ELLER ALDER VED UFØRHET)           */00000180
 /*    RETUR_POENG : RETURNERES FOR TYPE 'B'                          */00000190
 /*    RETUR_KODE  : KODE = 'E' RETURNERES FOR TYPE 'E'               */00000200
 /* ***************************************************************** */00000210
                                                                        00000220
 %SKIP(2);                                                              00000230
 UNGE_DØDE_B_E:                                                         00000240
   PROC(VIRK_ÅM,FNR_ÅR,ALDER,RETUR_POENG,RETUR_KODE);                   00000250
                                                                        00000260
   DCL VIRK_ÅM                         PIC      '(4)9';                 00000270
   DCL FNR_ÅR                          PIC        '99';                 00000280
   DCL ALDER                           PIC    'S99999';                 00000290
   DCL RETUR_POENG                     FIXED DEC (3,2);                 00000300
   DCL RETUR_KODE                      CHAR        (1);                 00000310
                                                                        00000320
   RETUR_POENG = 0;                                                     00000330
   IF VIRK_ÅM > 9706                 THEN                               00000340
      DO;                                                               00000350
         IF FNR_ÅR < 41                     THEN                        00000360
            DO;                                                         00000370
               IF ALDER < 2601                   THEN                   00000380
                  IF FNR_ÅR > 30                     THEN               00000390
                     RETUR_KODE  = 'E';                                 00000400
                  ELSE                                                  00000410
                  IF ALDER < 2401                  THEN                 00000420
                     IF FNR_ÅR > 25                  THEN               00000430
                        RETUR_KODE  = 'E';                              00000440
                     ELSE                                               00000450
                     IF ALDER < 2201                  THEN              00000460
                        IF FNR_ÅR > 22                  THEN            00000470
                           RETUR_KODE  = 'E';                           00000480
            END;                                                        00000490
         ELSE      /*FNR_ÅR > 40*/                                      00000500
            DO;                                                         00000510
               IF ALDER < 2601                   THEN                   00000520
                  RETUR_POENG = 3.30;                                   00000530
            END;                                                        00000540
      END;                                                              00000550
   ELSE  /*VIRKDATO 9705 ELLER 9706 :*/                                 00000560
   IF VIRK_ÅM > 9704                 THEN                               00000570
      DO;                                                               00000580
         IF FNR_ÅR < 43                   THEN                          00000590
            DO;                                                         00000600
               IF ALDER < 2401                THEN                      00000610
                  DO;                                                   00000620
                     IF FNR_ÅR > 25                  THEN               00000630
                        RETUR_KODE  = 'E';                              00000640
                     ELSE                                               00000650
                     IF ALDER < 2201                      THEN          00000660
                        IF FNR_ÅR > 22                  THEN            00000670
                           RETUR_KODE = 'E';                            00000680
                  END;                                                  00000690
            END;                                                        00000700
         ELSE                                                           00000710
            DO;                                                         00000720
               IF ALDER < 2401                THEN                      00000730
                  RETUR_POENG = 3.30;                                   00000740
                                                                        00000750
            END;                                                        00000760
      END;                                                              00000770
   ELSE  /*VIRKDATO ER 9205-9704*/                                      00000780
   IF VIRK_ÅM > 9204                 THEN                               00000790
      DO;                                                               00000800
         IF FNR_ÅR < 43                   THEN                          00000810
            DO;                                                         00000820
               IF ALDER < 2401                THEN                      00000830
                  DO;                                                   00000840
                     IF FNR_ÅR > 25                     THEN            00000850
                        RETUR_KODE  = 'E';                              00000860
                     ELSE                                               00000870
                     IF ALDER < 2201                      THEN          00000880
                        IF FNR_ÅR > 22                  THEN            00000890
                           RETUR_KODE  = 'E';                           00000900
                  END;                                                  00000910
            END;                                                        00000920
         ELSE                                                           00000930
            DO;                                                         00000940
               IF ALDER < 2401                THEN                      00000950
                  RETUR_POENG = 3.30;                                   00000960
            END;                                                        00000970
      END;                                                              00000980
   ELSE  /*VIRKDATO ER 9201-9204*/                                      00000990
   IF VIRK_ÅM > 9200                 THEN                               00001000
      DO;                                                               00001010
         IF FNR_ÅR < 45                   THEN                          00001020
            DO;                                                         00001030
               IF ALDER < 2201                THEN                      00001040
                  DO;                                                   00001050
                     IF FNR_ÅR > 22                     THEN            00001060
                        RETUR_KODE  = 'E';                              00001070
                  END;                                                  00001080
            END;                                                        00001090
         ELSE                                                           00001100
            DO;                                                         00001110
               IF ALDER < 2201                THEN                      00001120
                  RETUR_POENG = 3.30;                                   00001130
            END;                                                        00001140
      END;                                                              00001150
   ELSE  /*VIRKDATO ER 9101-9112*/                                      00001160
   IF VIRK_ÅM > 9100                 THEN                               00001170
      DO;                                                               00001180
         IF FNR_ÅR < 45                   THEN                          00001190
            DO;                                                         00001200
               IF ALDER < 2201                 THEN                     00001210
                  DO;                                                   00001220
                     IF FNR_ÅR > 22                     THEN            00001230
                        RETUR_KODE  = 'E';                              00001240
                  END;                                                  00001250
            END;                                                        00001260
         ELSE                                                           00001270
            DO;                                                         00001280
               IF ALDER < 2201                 THEN                     00001290
                  IF VIRK_ÅM > 9104                THEN                 00001300
                     RETUR_POENG = 3.30;                                00001310
                  ELSE                                                  00001320
                     RETUR_POENG = 3.00;                                00001330
            END;                                                        00001340
      END;                                                              00001350
   ELSE  /*VIRKDATO 8907-9012 :*/                                       00001360
   IF VIRK_ÅM > 8906                 THEN                               00001370
      DO;                                                               00001380
         IF FNR_ÅR < 45                   THEN                          00001390
            DO;                                                         00001400
               IF ALDER < 2201                 THEN                     00001410
                  DO;                                                   00001420
                     IF FNR_ÅR > 22                     THEN            00001430
                        RETUR_KODE  = 'E';                              00001440
                  END;                                                  00001450
            END;                                                        00001460
         ELSE                                                           00001470
            DO;                                                         00001480
               IF ALDER < 2201                 THEN                     00001490
                  RETUR_POENG = 3.00;                                   00001500
            END;                                                        00001510
      END;                                                              00001520
   ELSE /*VIRKDATO FRA 8901 TIL 8906*/                                  00001530
   IF VIRK_ÅM > 8900                  THEN                              00001540
      DO;                                                               00001550
         IF FNR_ÅR > 44       &                                         00001560
            ALDER < 2201                       THEN                     00001570
               RETUR_POENG = 3.00;                                      00001580
      END;                                                              00001590
   ELSE /*VIRKDATO FRA 8805 TIL 8812*/                                  00001600
   IF VIRK_ÅM > 8804                  THEN                              00001610
      DO;                                                               00001620
         IF FNR_ÅR > 45       &                                         00001630
            ALDER < 2101                       THEN                     00001640
               RETUR_POENG = 3.00;                                      00001650
      END;                                                              00001660
   ELSE /*VIRKDATO FRA 8705 TIL 8804*/                                  00001670
   IF VIRK_ÅM > 8704                  THEN                              00001680
      DO;                                                               00001690
         IF FNR_ÅR > 45       &                                         00001700
            ALDER < 2101                       THEN                     00001710
               RETUR_POENG = 2.50;                                      00001720
      END;                                                              00001730
   ELSE /*VIRKDATO FRA 8401 TIL 8704*/                                  00001740
   IF VIRK_ÅM > 8400                  THEN                              00001750
      DO;                                                               00001760
         IF FNR_ÅR > 45       &                                         00001770
            ALDER < 2101                       THEN                     00001780
               RETUR_POENG = 2.00;                                      00001790
      END;                                                              00001800
   ELSE /*VIRKDATO FRA 8105 TIL 8312*/                                  00001810
   IF VIRK_ÅM > 8104                  THEN                              00001820
      DO;                                                               00001830
         IF FNR_ÅR > 46       &                                         00001840
            ALDER < 2001                       THEN                     00001850
               RETUR_POENG = 2.00;                                      00001860
      END;                                                              00001870
      RETUR_POENG_HL = RETUR_POENG;                                     00001880
 END UNGE_DØDE_B_E;                                                     00001890
