 /*       SIST ENDRET 13/12-91 12.33.35 AV   DYBVIK                   */00000000
 /*********************************************************************/00000010
 /* IDENTIFIKASJON:                                                   */00000020
 /*    R0016051 - R0016021 (PROC-SAMLING) DELT OPP. BØ9112            */00000030
 /* HENSIKT:                                                          */00000040
 /*    EN PROGRAMMERT FUNKSJON SOM REGNER UT EN PERSONS ALDER         */00000050
 /* PROGRAMTILKNYTNING:                                               */00000060
 /*    LOKAL PROSEDYRE I R0016001                                     */00000070
 /* BRUK:                                                             */00000080
 /*    W_FELT = ALDER (FNR, TIDSPUNKT_AAMM)                           */00000090
 /*********************************************************************/00000100
                                                                        00000110
 ALDER: PROC (FNR,PR_TIDSPKT) RETURNS (PIC '999') OPTIONS(REENTRANT);   00000120
                                                                        00000130
    /*----------------------------------------------------------------*/00000140
    /*                                                                */00000150
    /* FUNKSJONEN TAR FØDSELSNUMMER OG EN AKTUELL MÅNED ANGITT PÅ     */00000160
    /* FORMEN ÅÅMM (F.EKS: MAI 1982 = 8205) OG PRODUSERER PERSONENS   */00000170
    /* ALDER VED TIDSPUNKT PR_MÅNED.                                  */00000180
    /*                                                                */00000190
    /*----------------------------------------------------------------*/00000200
                                                                        00000210
    DCL FNR                  PIC '(11)9',                               00000220
        MND                  PIC '99'  DEF FNR POS(3),                  00000230
        ÅR                   PIC '99'  DEF FNR POS(5),                  00000240
        LØPENR               PIC '999' DEF FNR POS(7);                  00000250
    DCL PR_TIDSPKT           PIC '9999',                                00000260
        PR_ÅR                PIC '99'  DEF PR_TIDSPKT POS(1),           00000270
        PR_MND               PIC '99'  DEF PR_TIDSPKT POS(3);           00000280
    DCL HJELP                PIC 'S(6)9' STATIC;                        00000290
    DCL SVAR                 PIC '999' STATIC;                          00000300
                                                                        00000310
    HJELP = ÅR * 12 + MND;                                              00000320
    HJELP = PR_ÅR * 12 + PR_MND - HJELP;                                00000330
                                                                        00000340
 /* TEST OM NOEN ER OVER 100 ÅR */                                      00000350
                                                                        00000360
    IF LØPENR >= 500 & LØPENR <= 749 THEN                               00000370
       HJELP = HJELP + 1200;  /* 100 ÅR A 12 MÅNEDER */                 00000380
                                                                        00000390
    IF HJELP < 0 THEN HJELP = HJELP + 100 * 12;                         00000400
    SVAR = HJELP / 12;        /* SKAL VÆRE HELTALLSDIVISJON */          00000410
    RETURN(SVAR);                                                       00000420
 END ALDER;                                                             00000430
                                                                        00000440
