 /*       SIST ENDRET 27/04-97 11.30.19 AV   TSB7339                  */00000000
 /*       SIST ENDRET 12/10-95 14.24.28 AV   JDA0310                  */00000010
 /*       SIST ENDRET 24/05-94 14.22.40 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 25/02-94 13.03.04 AV   HERMAN                   */00000030
 /*       SIST ENDRET 25/09-92 12.18.16 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 17/10-83 10.43.28 AV   LUNDEBY                  */00000050
                                                                        00000060
                                                                        00000070
  /* **************************************************************** */00000080
  /*IDENTIFIKASJON:                                                   */00000090
  /*    R0013110 - HOVEDPROGRAM I PLI                                 */00000100
  /*                                                                  */00000110
  /*    PROGRAMMERER: S. LUNDEBY , SFK , FEBRUAR  1982                */00000120
  /*                                                                  */00000130
  /*HENSIKT:                                                          */00000140
  /*    LESER INNTEKT , PENSJONSHISTORIKK                             */00000150
  /*    OG STATUS RECORD FRA DATABASEN OG INN I B01 .                 */00000160
  /*                                                                  */00000170
  /*    PERSON-STATUSENE  A,B,C,D,F,G,H ELLER  I  SETTES .            */00000180
  /*                                                                  */00000190
  /*PROGRAMTILKNYTNING:                                               */00000200
  /*                                                                  */00000210
  /*BRUKER                                                            */00000220
  /*                                                                  */00000230
  /* N B !!                                                           */00000240
  /*    VED UTVIDELSE AV TABELLEN VENTØVR MÅ EN UNDER LESING AV       */00000250
  /*    ALDERSP LEGGE INN DET NYE ANTALL VENTØVR I B01/B02 .          */00000260
  /*                                                                  */00000270
  /* **************************************************************** */00000280
                                                                        00000290
  R001311 :                                                             00000300
    PROC            (COMMAREA_PEKER)                                    00000310
           OPTIONS  (MAIN);                                             00000320
                                                                        00000330
    %PAGE;                                                              00000340
    %INCLUDE P0019906;                              /* TRANS_OPPL_OMR */00000350
                                                                        00000360
    %PAGE;                                                              00000370
    %INCLUDE P0019908;                              /* KOM_OMR        */00000380
                                                                        00000390
    %PAGE;                                                              00000400
    %INCLUDE P0019910;                              /* STYRINGS_OMR   */00000410
                                                                        00000420
    %PAGE;                                                              00000430
    %INCLUDE P0019912;                              /* DIV_PARAM_OMR  */00000440
                                                                        00000450
    %PAGE;                                                              00000460
       DCL 1 B01              BASED (B01_PEKER),                        00000470
    %INCLUDE P0019921;                              /* B01            */00000480
                                                                        00000490
    %PAGE;                                                              00000500
    /* ************************************************************** */00000510
    /*                                                                */00000520
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00000530
    /*                                                                */00000540
    /* ************************************************************** */00000550
                                                                        00000560
       DCL                                                              00000570
         ( ADDR , CSTG , LOW , STG , SUBSTR )  BUILTIN;                 00000580
       DCL                                                              00000590
         PLITDLI ENTRY;                                                 00000600
                                                                        00000610
    /* ************************************************************** */00000620
    /*                                                                */00000630
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000640
    /*                                                                */00000650
    /* ************************************************************** */00000660
                                                                        00000670
    %INCLUDE DLIUIB;                                                    00000680
                                                                        00000690
       DCL                                                              00000700
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00000710
       DCL                                                              00000720
           COMMAREA_PEKER            POINTER;                           00000730
       DCL                                                              00000740
           W01_HJELPE_PTR            POINTER;                           00000750
                                                                        00000760
    /* ************************************************************** */00000770
    /*                                                                */00000780
    /*   OPPTELLINGS- OG LOOP-PARAMETRE M.M                           */00000790
    /*                                                                */00000800
    /* ************************************************************** */00000810
                                                                        00000820
       DCL 1  W01_OMR                   UNALIGNED,                      00000830
              2   W02_I                 FIXED  BIN  (15),               00000840
              2   W02_UFHIST_TELLER     FIXED  BIN  (15)     INIT ( 0 ),00000850
              2   W02_UFGRAD_TELLER     FIXED  BIN  (15)     INIT ( 0 ),00000860
 /*YS*/       2   W02_YSHIST_TELLER     FIXED  BIN  (15)     INIT ( 0 ),00000870
 /*YS*/       2   W02_YSGRAD_TELLER     FIXED  BIN  (15)     INIT ( 0 ),00000880
              2   W02_TILKNY_TELLER     FIXED  BIN  (15)     INIT ( 0 ),00000890
              2   W02_VENTØV_TELLER     FIXED  BIN  (15)     INIT ( 0 ),00000900
              2   W02_ANT_GANGER_I_WAIT FIXED  BIN  (15)     INIT ( 0 ),00000910
              2   B                            CHAR (1);                00000920
                                                                        00000930
    /* ************************************************************** */00000940
    /*                                                                */00000950
    /*   INNTEKTS-SEGMENTET                                           */00000960
    /*                                                                */00000970
    /* ************************************************************** */00000980
                                                                        00000990
       DCL 1 W01_PINT                UNALIGNED,                         00001000
    %INCLUDE P0019928;                              /* INNTEKTS-SEGM. */00001010
                                                                        00001020
                                                                        00001030
    /* ************************************************************** */00001040
    /*                                                                */00001050
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00001060
    /*                                                                */00001070
    /* ************************************************************** */00001080
                                                                        00001090
       DCL 1  W01_DLI_PARAM,                                            00001100
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),     00001110
              2   W02_GHU                 CHAR (4)   INIT ('GHU '),     00001120
              2   W02_REPL                CHAR (4)   INIT ('REPL'),     00001130
              2   W02_ISRT                CHAR (4)   INIT ('ISRT'),     00001140
              2   W02_PARM_CT_1     FIXED BIN  (31)  INIT (1),          00001150
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00001160
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00001170
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),          00001180
              2   W02_PERSONEN_ER_SPERRET BIT  (1)   INIT ('1'B),       00001190
              2   W02_MER_DATA            BIT  (1)   INIT ('1'B),       00001200
              2   W02_SS_ER_DØD           BIT  (1)   INIT ('0'B),       00001210
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');  00001220
                                                                        00001230
       DCL    W01_IO                 CHAR (150)      INIT ( '' );       00001240
       DCL    W01_HJELPE_IO          CHAR (150) BASED (W01_HJELPE_PTR); 00001250
                                                                        00001260
       DCL 1  W01_STATUS      UNALIGNED,                                00001270
       %INCLUDE P0019930;                            /* STATUS_SEGM */  00001280
                                                                        00001290
    /* ************************************************************** */00001300
    /*                                                                */00001310
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00001320
    /*                                                                */00001330
    /* ************************************************************** */00001340
                                                                        00001350
       DCL    SSA_UQUAL                          CHAR (9) INIT ((9)' ');00001360
                                                                        00001370
       DCL 1  SSA1_RF0PERSN                ,                            00001380
              2    HDEL                          CHAR (17)  INIT        00001390
                   ('RF0PERSN(FNR     '),                               00001400
              2    REL_OP                        CHAR (2)   INIT (' ='),00001410
              2    PKEY               FIXED      DEC  (11)  INIT ( 0  ),00001420
              2    HP                            CHAR (1)   INIT (')' );00001430
                                                                        00001440
       DCL 1  SSA1_STATUS                  ,                            00001450
              2    HDEL                          CHAR (17)  INIT        00001460
                   ('STATUS  (STATKODE'),                               00001470
              2    REL_OP                        CHAR (2)   INIT (' ='),00001480
              2    KODE                          CHAR (1)   INIT (' ' ),00001490
              2    HP                            CHAR (1)   INIT (')' );00001500
                                                                        00001510
       DCL 1  SSA2_STATUS                  ,                            00001520
              2    HDEL                          CHAR (19)  INIT        00001530
                   ('STATUS  *F(STATKODE'),                             00001540
              2    REL_OP                        CHAR (2)   INIT (' ='),00001550
              2    KODE                          CHAR (1)   INIT ('N' ),00001560
              2    HP                            CHAR (1)   INIT (')' );00001570
                                                                        00001580
       DCL 1  SSA1_TRANHIST                ,                            00001590
              2    HDEL                          CHAR (17)  INIT        00001600
                   ('TRANHIST(VIRKDATO'),                               00001610
              2    REL_OP                        CHAR (2)   INIT ('=>'),00001620
              2    VTP               FIXED       DEC  (4)   INIT (0),   00001630
              2    HP                            CHAR (1)   INIT (')'); 00001640
                                                                        00001650
    /* ************************************************************** */00001660
    /*                                                                */00001670
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00001680
    /*                                                                */00001690
    /* ************************************************************** */00001700
                                                                        00001710
    %PAGE;                                                              00001720
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00001730
                                                                        00001740
    %PAGE;                                                              00001750
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                   00001760
    %INCLUDE P0012003;                         /* PCB                 */00001770
                                                                        00001780
 /*      DCL YPEK              POINTER                                  00001790
         DCL Y_ENGANGSBELØP      CHAR(4) BASED(YPEK)            */      00001800
                                                                        00001810
                                                                        00001820
                                                                        00001830
                                                                        00001840
    /* ************************************************************** */00001850
    /*                                                                */00001860
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00001870
    /*     ---------------------------------------------------        */00001880
    /*                                                                */00001890
    /*                                                                */00001900
    /*      INITIERING AV PARAMETRE TIL DIV_PARAM_OMR.                */00001910
    /*                                                                */00001920
    /*      SETTER UIBPTR = UIB_PEKER   SOM OVERFØRES ETTER           */00001930
    /*      INITIERINGS-KALL   I     R0012001 .                       */00001940
    /*                                                                */00001950
    /* ************************************************************** */00001960
                                                                        00001970
    DB_STATUS_KODE                          =   '  ';                   00001980
    PROGRAM_ID                              =   'R0013110';             00001990
    UIBPTR                                  =    UIB_PEKER;             00002000
                                                                        00002010
    /* ********************************************************** */    00002020
    /*        SJEKKER ROT-SEGM FINNES FRA FØR.                    */    00002030
    /* ********************************************************** */    00002040
                                                                        00002050
    IF    SEARCH_FNR                     =    0                 THEN    00002060
      DO;                                                               00002070
        IF  TRANS_OPPL_OMR.BLANKETTYPE  ^=    'EP'                      00002080
          & TRANS_OPPL_OMR.BLANKETTYPE  ^=    'E3'                      00002090
          & TRANS_OPPL_OMR.BLANKETTYPE  ^=    'EE'   /*0195 HL*/        00002100
          & TRANS_OPPL_OMR.BLANKETTYPE  ^=    'BP'                      00002110
          & TRANS_OPPL_OMR.BLANKETTYPE  ^=    'B6'                      00002120
          & TRANS_OPPL_OMR.BLANKETTYPE  ^=    'FB'                      00002130
          & TRANS_OPPL_OMR.BLANKETTYPE  ^=    'F5'              THEN    00002140
          DO;                                                           00002150
            /* ********************************************** */        00002160
            /* NULL I FNR . KJØRING AVBRYTES                  */        00002170
            /* ********************************************** */        00002180
  L100:                                                                 00002190
            FEIL_MELD_NR                 =   498;                       00002200
            FEIL_VED_LABEL               =  '100';                      00002210
          END;                                                          00002220
        GO TO L999;                                                     00002230
      END;                                                              00002240
                                                                        00002250
    /* ********************************************************** */    00002260
    /* KALLER PROGRAMMET FOR Å SJEKKE OG EVT. SPERRE ROT-SEGM.    */    00002270
    /* ********************************************************** */    00002280
                                                                        00002290
    EXEC CICS LINK PROGRAM ('R0015601')  COMMAREA (KOM_OMR);            00002300
                                                                        00002310
                                                                        00002320
    IF FEIL_MELD_NR      >  0            THEN                           00002330
       DO;                                                              00002340
          /* **************************************** */                00002350
          /*  FEIL VED SPERRE-BEHANDLING              */                00002360
          /* **************************************** */                00002370
                                                                        00002380
          GO TO L999;                                                   00002390
       END;                                                             00002400
    ELSE                                                                00002410
                                                                        00002420
       PROGRAM_ID   =   'R0013110';                                     00002430
                                                                        00002440
                                                                        00002450
    /* ********************************************************** */    00002460
    /* BEHANDLING AV ROT OK. SJEKKER I B01 OM PERSONEN FINNES I DB*/    00002470
    /* ********************************************************** */    00002480
                                                                        00002490
    IF B01.RF0PERSN.FNR (POS_I_B01)   >  0            THEN              00002500
       DO;                                                              00002510
                                                                        00002520
          SSA1_RF0PERSN.PKEY                  =    SEARCH_FNR;          00002530
                                                                        00002540
          /* *********************************************** */         00002550
          /*  LESER SEGMENTENE UNDER ROT   -->    B01        */         00002560
          /* *********************************************** */         00002570
                                                                        00002580
          CALL P10_LES_SEGM;                                            00002590
                                                                        00002600
          DO WHILE ( W02_MER_DATA );                                    00002610
                                                                        00002620
            IF FEIL_MELD_NR      >  0            THEN                   00002630
               GO TO L999;                                              00002640
                                                                        00002650
            SELECT ( RF1.SEGM_NAVN );                                   00002660
              WHEN ('PINNTEKT')                                         00002670
                /* ***************************************** */         00002680
                /*   LEGGER  INNTEKTS-OPPLYSNINGENE I  B 0 1 */         00002690
                /*   ENDRET 19.02.91 AV O.G._X_INNT_SEGMENT  */         00002700
                /*   VED 'X': INNTEKT AKKUMULERES I 'POS+12' */         00002710
                /*            MEN 'POS < 3' PGA. POS_MAX=14  */         00002720
                /* ***************************************** */         00002730
                DO;                                                     00002740
                  SUBSTR ( ADDR          ( W01_PINT )                   00002750
                  -> W01_HJELPE_IO,1,STG ( W01_PINT )) =  W01_IO;       00002760
                                                                        00002770
 /*FRYS_GARANTI PR. 30.4.91 - HL : */                                   00002780
                                                                        00002790
                  IF W01_PINT.W02_PI_TYPE  = 'X'                   THEN 00002800
                     IF POS_I_B01 <  3                    THEN          00002810
                       DO;                                              00002820
                        B01.PI ((POS_I_B01 + 12), W02_PI_ÅR) = W02_PI;  00002830
                        B01.TP_GAR_KODE(POS_I_B01 + 12) = 'I';          00002840
                       END;                                             00002850
                     ELSE;                                              00002860
                  ELSE                                                  00002870
                     DO;                                                00002880
                        B01.PI      (POS_I_B01 , W02_PI_ÅR)  =          00002890
                          B01.PI  (POS_I_B01 , W02_PI_ÅR)  +  W02_PI;   00002900
                        B01.PI_KODE (POS_I_B01 , W02_PI_ÅR)  = 'O';     00002910
                     END;                                               00002920
                                                                        00002930
                  /* OMSORGSPOENG FRA 1992.            TRUDE 11.93 */   00002940
                  IF W01_PINT.W02_PI_TYPE  = 'J' !                      00002950
                     W01_PINT.W02_PI_TYPE  = 'K' !                      00002960
                     W01_PINT.W02_PI_TYPE  = 'L'          THEN          00002970
                     IF POS_I_B01 <  3                    THEN          00002980
                       DO;                                              00002990
                        B01.PI_KODE(POS_I_B01,W02_PI_ÅR) =              00003000
                                                 W02_PI_TYPE;           00003010
                    /*  B01.PI_KODE((POS_I_B01 + 12), W02_PI_ÅR) =      00003020
                                            W02_PI_TYPE  TS 240594*/    00003030
                       END;                            /*HIT 11.93 */   00003040
                                                                        00003050
                                                                        00003060
                  IF  W02_PI_TYPE                          = 'A ' THEN  00003070
                      B01.PI_KODE (POS_I_B01 , W02_PI_ÅR)  = 'F' ;      00003080
                                                                        00003090
                  CALL    P10_LES_SEGM;                                 00003100
                END;                                                    00003110
                                                                        00003120
              WHEN ('TILBERPO')                                         00003130
                /* ****************************************** */        00003140
                /*   TILLEGGSOPPLYSNINGER FOR                 */        00003150
                /*   POENGBEREGNINGEN         ->   B 0 1      */        00003160
                /* ****************************************** */        00003170
                DO;                                                     00003180
                  SUBSTR (ADDR (B01.TILBERPO   ( POS_I_B01))            00003190
                       -> W01_HJELPE_IO,1,STG  ( B01.TILBERPO (         00003200
                              POS_I_B01 ))) =    W01_IO;                00003210
                                                                        00003220
                  CALL    P10_LES_SEGM;                                 00003230
                END;                                                    00003240
                                                                        00003250
              WHEN ('STATUS  ')                                         00003260
                /* ***************************************** */         00003270
                /* HVIS FORESP. ELLER ØNSKET_STATUS ER SATT  */         00003280
                /* ----------------------------------------- */         00003290
                /*                                           */         00003300
                /*     KALLES EN PROC SOM LESER INN ØNSKET   */         00003310
                /*     STATUS-SEGM. MED UNDERLIGGENDE SEGM.  */         00003320
                /*                                           */         00003330
                /*                                           */         00003340
                /* HVIS IKKE :                               */         00003350
                /* -----------                               */         00003360
                /*                                           */         00003370
                /*     KALLES EN PROC SOM LESER INN STATUS   */         00003380
                /*     I RELASJON TIL VIRKDATO I TRANSEN     */         00003390
                /*     OG SETTER :                           */         00003400
                /*                                           */         00003410
                /*         STATUS_TYPE =  A,B,C,D,F,G,H,I    */         00003420
                /*                                           */         00003430
                /* ***************************************** */         00003440
                DO;                                                     00003450
                  IF  FUNKSJONSKODE    =      'F'   !                   00003460
                      ØNSKET_STATUS   ^=      ' '   THEN                00003470
                      CALL P50_BEHANDLE_STATUS_FORESPØRSEL;             00003480
                  ELSE                                                  00003490
                      CALL P30_BEHANDLE_STATUS;                         00003500
                END;                                                    00003510
                                                                        00003520
              OTHERWISE                                                 00003530
                /* ****************************************** */        00003540
                /*   SLUTT PÅ AKTUELLE DATA                   */        00003550
                /* ****************************************** */        00003560
                DO;                                                     00003570
                  W02_MER_DATA                  =   '0'B;               00003580
                END;                                                    00003590
                                                                        00003600
            END;   /* SELECT :     SEGM-NAVN             */             00003610
                                                                        00003620
          END;     /* DO WHILE (MER_DATA)                */             00003630
                                                                        00003640
       END;        /* IF B01.RF0PERSN.FNR (POS_I_B01)    */             00003650
                                                                        00003660
       /* ********************************************** */             00003670
       /*      SJEKKER OM STATUS_TYPE ER SATT .          */             00003680
       /* ********************************************** */             00003690
                                                                        00003700
       IF STATUS_TYPE         =    ' '     THEN                         00003710
          STATUS_TYPE         =    'A';                                 00003720
                                                                        00003730
                                                                        00003740
                                                                        00003750
                                                                        00003760
    /* ************************************************************** */00003770
    /* ************************************************************** */00003780
    /* **********                                       ************* */00003790
    /* ******        INTERNE    PROCEDURER                  ********* */00003800
    /* **********                                       ************* */00003810
    /* ************************************************************** */00003820
    /* ************************************************************** */00003830
                                                                        00003840
                                                                        00003850
                                                                        00003860
                                                                        00003870
                                                                        00003880
                                                                        00003890
     %PAGE;                                                             00003900
    /* ************************************************************** */00003910
    /*                                                                */00003920
    /* PROCEDURE FOR LESE NESTE SEGMENT ( GN    UKVALIFISERT  )       */00003930
    /*                                                                */00003940
    /* ************************************************************** */00003950
                                                                        00003960
    P10_LES_SEGM :                                                      00003970
      PROC;                                                             00003980
                                                                        00003990
      CALL PLITDLI                              (W02_PARM_CT_3,         00004000
                                                 W02_GNP,               00004010
                                                 RF1,                   00004020
                                                 W01_IO);               00004030
                                                                        00004040
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00004050
        DO;                                                             00004060
          SELECT ( RF1.STATUS_KODE );                                   00004070
            WHEN ( '  ' , 'GA' , 'GK' )                                 00004080
              W02_MER_DATA                 =    '1'B;                   00004090
            WHEN ( 'GE' , 'GB' )                                        00004100
              W02_MER_DATA                 =    '0'B;                   00004110
            OTHERWISE                                                   00004120
              DO;                                                       00004130
                /* ************************************************** */00004140
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00004150
                /* ************************************************** */00004160
  L150:                                                                 00004170
                FEIL_MELD_NR               =     500;                   00004180
                FEIL_VED_LABEL             =    '150';                  00004190
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00004200
              END;                                                      00004210
          END;                                                          00004220
        END;                                                            00004230
      ELSE                                                              00004240
        DO;                                                             00004250
          /* ************************************************** */      00004260
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00004270
          /* ************************************************** */      00004280
  L160:                                                                 00004290
          FEIL_MELD_NR               =     500;                         00004300
          FEIL_VED_LABEL             =    '160';                        00004310
        END;                                                            00004320
    END P10_LES_SEGM;                                                   00004330
                                                                        00004340
                                                                        00004350
                                                                        00004360
    %PAGE;                                                              00004370
    /* ************************************************************** */00004380
    /*                                                                */00004390
    /* PROCEDURE FOR LESE NESTE SEGMENT (GN  KVAL. PÅ ROT UKVAL.NESTE */00004400
    /*                                                                */00004410
    /* ************************************************************** */00004420
                                                                        00004430
    P20_LES_SEGM_KVAL :                                                 00004440
      PROC ;                                                            00004450
                                                                        00004460
      CALL PLITDLI                              (W02_PARM_CT_5,         00004470
                                                 W02_GNP,               00004480
                                                 RF1,                   00004490
                                                 W01_IO,                00004500
                                                 SSA1_RF0PERSN,         00004510
                                                 SSA_UQUAL);            00004520
                                                                        00004530
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00004540
        DO;                                                             00004550
          SELECT ( RF1.STATUS_KODE );                                   00004560
            WHEN ( '  ' )                                               00004570
              W02_MER_DATA                 =    '1'B;                   00004580
            WHEN ( 'GA' , 'GB' , 'GE' , 'GK' )                          00004590
              W02_MER_DATA                 =    '0'B;                   00004600
            OTHERWISE                                                   00004610
              DO;                                                       00004620
                /* ************************************************** */00004630
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00004640
                /* ************************************************** */00004650
  L170:                                                                 00004660
                FEIL_MELD_NR               =     500;                   00004670
                FEIL_VED_LABEL             =    '170';                  00004680
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00004690
              END;                                                      00004700
          END;                                                          00004710
        END;                                                            00004720
      ELSE                                                              00004730
        DO;                                                             00004740
          /* ************************************************** */      00004750
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00004760
          /* ************************************************** */      00004770
  L180:                                                                 00004780
          FEIL_MELD_NR               =     500;                         00004790
          FEIL_VED_LABEL             =    '180';                        00004800
        END;                                                            00004810
    END P20_LES_SEGM_KVAL;                                              00004820
                                                                        00004830
                                                                        00004840
                                                                        00004850
    %PAGE;                                                              00004860
    /* ************************************************************** */00004870
    /*                                                                */00004880
    /* PROCEDURE FOR Å BEHANDLE :                                     */00004890
    /* ---------------------------                                    */00004900
    /*                                                                */00004910
    /*        STATUS   OPPLYSNINGENE        ->  B 0 1 .               */00004920
    /*        SYSTEM - STATUS'EN SETTES LIK :   A,B,C,D,F,G,H,I       */00004930
    /*                                                                */00004940
    /* ************************************************************** */00004950
                                                                        00004960
    P30_BEHANDLE_STATUS :                                               00004970
      PROC;                                                             00004980
                                                                        00004990
      SUBSTR (ADDR ( W01_STATUS )                                       00005000
              ->     W01_HJELPE_IO,1,STG ( W01_STATUS ))  =  W01_IO ;   00005010
                                                                        00005020
                                                                        00005030
      /* ******************************************************  */     00005040
      /* FOR BEHANDLING AV BLANKETTYPE = 'AU'  SATISH  27.03.91  */     00005050
                                                                        00005060
      IF TRANS_OPPL_OMR.BLANKETTYPE = 'AU'  THEN                        00005070
                                                                        00005080
          DIV_PARAM_OMR.TRANS_VIRKDATO_ÅM   =                           00005090
                                         W01_STATUS.VIRK_DATO_ÅM;       00005100
                                                                        00005110
      /* ***HIT TIL *******************************************  */     00005120
                                                                        00005130
      IF DIV_PARAM_OMR.TRANS_VIRKDATO_ÅM   >=                           00005140
                                         W01_STATUS.VIRK_DATO_ÅM THEN   00005150
         DO;                                                            00005160
            /* ****************************************************** */00005170
            /*     NY VIRK.DATO  >=  VIRK.DATO TIL    :               */00005180
            /*                                                        */00005190
            /*         SISTE STATUS  /  NEST SISTE STATUS             */00005200
            /* ****************************************************** */00005210
                                                                        00005220
            IF W01_STATUS.STATUS_KODE          =   'S'      THEN        00005230
                                                                        00005240
               /* ************************************************* */  00005250
               /*  NY VTP   >=   VTP    SISTE STATUS                */  00005260
               /* ************************************************* */  00005270
                                                                        00005280
               IF W01_STATUS.STATUS_KODE_HIST     =   'X'      THEN     00005290
                  DO;                                                   00005300
                     /* ******************************************* */  00005310
                     /* NY VTP   >=   VTP  SISTE STATUS             */  00005320
                     /*                                             */  00005330
                     /*  HISTORISK TILFELLE :  SJEKKER OM     D Ø D */  00005340
                     /*  --------------------  OG OPPGITT SOM D Ø D */  00005350
                     /* ******************************************* */  00005360
                                                                        00005370
                     IF W01_STATUS.DØDSDATO_ÅMD     >    0        THEN  00005380
                                                                        00005390
                        IF DIV_PARAM_OMR.DØD                      THEN  00005400
                           DO;                                          00005410
                              /* *********************************** */ 00005420
                              /* PERSONEN ER: DØD OG OPPGITT SOM DØD */ 00005430
                              /* *********************************** */ 00005440
                                                                        00005450
                              STATUS_TYPE            =    'I';          00005460
                              CALL P40_LES_STATUS_OMR_TIL_B01;          00005470
                           END;                                         00005480
                        ELSE                                            00005490
                           DO;                                          00005500
                              /* *********************************** */ 00005510
                              /*  PERSONEN ER:  DØD  OG              */ 00005520
                              /*                IKKE OPPGITT SOM DØD */ 00005530
                              /* *********************************** */ 00005540
                                                                        00005550
                              STATUS_TYPE    =     'H' ;                00005560
                              W02_MER_DATA   =     '0'B;                00005570
                           END;                                         00005580
                     ELSE                                               00005590
                        DO;                                             00005600
                           /* ************************************ */   00005610
                           /* PERSONEN ER : ET AVSLUTTET UFØRE-    */   00005620
                           /*               TILFELLE               */   00005630
                           /*                                      */   00005640
                           /* HVIS GIFT   : PT1 = 'A' ! 'G' ! 'F'  */   00005650
                           /*               STATUS_TYPE = B.       */   00005660
                           /* ************************************ */   00005670
                                                                        00005680
                           IF W01_STATUS.PENSJONSTYPE1 =  'A'           00005690
                            ! W01_STATUS.PENSJONSTYPE1 =  'G'           00005700
                            ! W01_STATUS.PENSJONSTYPE1 =  'F'    THEN   00005710
                                                                        00005720
                              STATUS_TYPE              =  'B'       ;   00005730
                           ELSE                                         00005740
                              STATUS_TYPE              =  'I'       ;   00005750
                                                                        00005760
                           CALL  P40_LES_STATUS_OMR_TIL_B01         ;   00005770
                        END;                                            00005780
                  END;                                                  00005790
               ELSE                                                     00005800
                  IF W01_STATUS.STATUS_KODE_HIST   =  'O'       THEN    00005810
                     DO;                                                00005820
                        /* ************************************* */     00005830
                        /* NY VTP   >=   VTP   SISTE STATUS      */     00005840
                        /*                                       */     00005850
                        /*  HISTORISK TILFELLE .                 */     00005860
                        /* ************************************* */     00005870
                                                                        00005880
                        STATUS_TYPE         =       'A';                00005890
                        CALL  P40_LES_STATUS_OMR_TIL_B01;               00005900
                     END;                                               00005910
                  ELSE                                                  00005920
                     DO;                                                00005930
                        /* ************************************* */     00005940
                        /* NY VTP   >=   VTP   SISTE STATUS      */     00005950
                        /*                                       */     00005960
                        /* IKKE HISTORISK TILFELLE .             */     00005970
                        /* -------------------------             */     00005980
                        /* ************************************* */     00005990
                                                                        00006000
                        STATUS_TYPE         =       'B';                00006010
                        CALL  P40_LES_STATUS_OMR_TIL_B01;               00006020
                     END;                                               00006030
            ELSE                                                        00006040
               DO;                                                      00006050
                  /* ********************************************* */   00006060
                  /*  NY VTP  >=   VTP        NEST SISTE STATUS    */   00006070
                  /*    ):   DET FINNES INGEN      SISTE STATUS    */   00006080
                  /*                                               */   00006090
                  /*   UNDERSØKER OM :  NY VTP  >=   GML.TRANS VTP */   00006100
                  /* ********************************************* */   00006110
                                                                        00006120
                  CALL  P35_SJEKK_VTP_TRANS;                            00006130
                                                                        00006140
                  IF FEIL_MELD_NR         >   0          THEN           00006150
                     DO;                                                00006160
                       /* ************************************** */     00006170
                       /*  FEIL VED  P35_SJEKK_VTP_TRANS         */     00006180
                       /* ************************************** */     00006190
                                                                        00006200
                       GO TO RETUR;                                     00006210
                     END;                                               00006220
               END;                                                     00006230
                                                                        00006240
         END;       /*  DO   NY VIRK.DATO  =>  VIRKDATO       */        00006250
      ELSE                                                              00006260
         /* **************************************************** */     00006270
         /* NY  VTP   <   VTP   LEST STATUS                      */     00006280
         /* **************************************************** */     00006290
                                                                        00006300
         IF W01_STATUS.STATUS_KODE          =   'S'      THEN           00006310
                                                                        00006320
            /* ************************************************ */      00006330
            /*   NY VTP  <   VTP  SISTE STATUS                  */      00006340
            /* ************************************************ */      00006350
                                                                        00006360
            IF W01_STATUS.FØRSTE_GANG_REG      =   'J'      THEN        00006370
               DO;                                                      00006380
                  /* ******************************************** */    00006390
                  /*   NY VTP  <   VTP  SISTE STATUS              */    00006400
                  /*   SISTE STATUS ER  1. GANGS REG.             */    00006410
                  /* ******************************************** */    00006420
                                                                        00006430
                  STATUS_TYPE                     =   'C';              00006440
                  W02_MER_DATA                    =   '0'B;             00006450
               END;                                                     00006460
         ELSE                                                           00006470
            DO;                                                         00006480
               /* ******************************************** */       00006490
               /*                                              */       00006500
               /*  NY VTP  <   VTP  SISTE STATUS               */       00006510
               /*  SISTE STATUS ER : IKKE REGISTRERT 1. GANG   */       00006520
               /*  MÅ SJEKKE VIRKN.DATO PÅ  NEST SISTE STATUS. */       00006530
               /*            ----------     ------------------ */       00006540
               /*                                              */       00006550
               /* UNDERSØKER OM SISTE STATUS ER ET DØDSTILFELLE*/       00006560
               /*                                              */       00006570
               /* ******************************************** */       00006580
                                                                        00006590
               IF W01_STATUS.DØDSDATO_ÅMD >    0           THEN         00006600
                  W02_SS_ER_DØD           =   '1'B;                     00006610
                                                                        00006620
               SSA_UQUAL                  =   'STATUS   ';              00006630
               CALL P20_LES_SEGM_KVAL;                                  00006640
                                                                        00006650
               IF FEIL_MELD_NR            >    0           THEN         00006660
                  DO;                                                   00006670
                     /* **************************************** */     00006680
                     /*   FEIL VED LES AV STATUS                 */     00006690
                     /* **************************************** */     00006700
                                                                        00006710
                     GO TO RETUR;                                       00006720
                  END;                                                  00006730
                                                                        00006740
               SELECT   ( RF1.STATUS_KODE );                            00006750
                  WHEN  ( '  ' )                                        00006760
                     DO;                                                00006770
                        /* ************************************** */    00006780
                        /* NY VTP   <    VTP  SISTE STATUS        */    00006790
                        /* DET FINNES EN NEST SISTE STATUS        */    00006800
                        /* ************************************** */    00006810
                                                                        00006820
                        SUBSTR (ADDR            (W01_STATUS)            00006830
                         -> W01_HJELPE_IO,1,STG (W01_STATUS)) = W01_IO; 00006840
                                                                        00006850
                        IF DIV_PARAM_OMR.TRANS_VIRKDATO_ÅM   >=         00006860
                                   W01_STATUS.VIRK_DATO_ÅM      THEN    00006870
                           DO;                                          00006880
                              /* ********************************* */   00006890
                              /* NYTT VTP  < VTP      SISTE STATUS */   00006900
                              /* NYTT VTP >= VTP NEST SISTE STATUS */   00006910
                              /* NEST SISTE ER OPPHØRT MED KODE X  */   00006920
                              /* OG NEST SISTE ER IKKE DØD .       */   00006930
                              /* ********************************* */   00006940
                                                                        00006950
                              IF W01_STATUS.STATUS_KODE_HIST ='X'&      00006960
                                 W01_STATUS.DØDSDATO_ÅMD     = 0 THEN   00006970
                                 DO;                                    00006980
                                    STATUS_TYPE              =   'K';   00006990
                                    CALL  P40_LES_STATUS_OMR_TIL_B01;   00007000
                                 END;                                   00007010
                              ELSE                                      00007020
                                 /* ********************************* */00007030
                                 /* NYTT VTP  < VTP      SISTE STATUS */00007040
                                 /* NYTT VTP >= VTP NEST SISTE STATUS */00007050
                                 /* NEST SISTE ER IKKE OPPHØRT MED X  */00007060
                                 /* ELLER NEST SISTE ER DØD .         */00007070
                                 /* SISTE STATUS :  DØD               */00007080
                                 /* ********************************* */00007090
                                                                        00007100
                                 IF W02_SS_ER_DØD                   THEN00007110
                                    DO;                                 00007120
                                       STATUS_TYPE             =    'G';00007130
                                       CALL  P40_LES_STATUS_OMR_TIL_B01;00007140
                                    END;                                00007150
                                                                        00007160
                                 /* ********************************* */00007170
                                 /* NYTT VTP  < VTP      SISTE STATUS */00007180
                                 /* NYTT VTP >= VTP NEST SISTE STATUS */00007190
                                 /* NEST SISTE ER IKKE OPPHØRT MED X  */00007200
                                 /* ELLER NEST SISTE ER DØD .         */00007210
                                 /* SISTE STATUS :  IKKE DØD          */00007220
                                 /* ********************************* */00007230
                                                                        00007240
                                 ELSE                                   00007250
                                    DO;                                 00007260
                                       STATUS_TYPE              =   'D';00007270
                                       CALL  P40_LES_STATUS_OMR_TIL_B01;00007280
                                    END;                                00007290
                           END;                                         00007300
                        ELSE                                            00007310
                           DO;                                          00007320
                              /* ********************************** */  00007330
                              /* NYTT VTP  < VTP      SISTE STATUS  */  00007340
                              /* NYTT VTP  < VTP NEST SISTE STATUS  */  00007350
                              /* ********************************** */  00007360
                                                                        00007370
                              DIV_PARAM_OMR.STATUS_TYPE  =  'F';        00007380
                              W02_MER_DATA               =  '0'B;       00007390
                            END;                                        00007400
                     END;                                               00007410
                                                                        00007420
                  WHEN  ( 'GE' , 'GB' )                                 00007430
                     DO;                                                00007440
                        /* ************************************** */    00007450
                        /* NYTT VTP  < VTP         SISTE STATUS   */    00007460
                        /* DET FINNES INGEN   NEST SISTE STATUS   */    00007470
                        /* OG SISTE STATUS ER IKKE 1.GANGS REG.   */    00007480
                        /* ************************************** */    00007490
                                                                        00007500
                        DIV_PARAM_OMR.STATUS_TYPE  =  'F';              00007510
                        W02_MER_DATA               =  '0'B;             00007520
                     END;                                               00007530
                  OTHERWISE                                             00007540
                     DO;                                                00007550
                        /* ************************************** */    00007560
                        /* UGYLDIG STATUS KODER FRA DL1           */    00007570
                        /* ************************************** */    00007580
  L190:                                                                 00007590
                        DB_STATUS_KODE            =   RF1.STATUS_KODE;  00007600
                        FEIL_MELD_NR              =   500;              00007610
                        FEIL_VED_LABEL            =  '190';             00007620
                        GO TO RETUR;                                    00007630
                     END;                                               00007640
                                                                        00007650
               END;    /*    SELECT  :   RF1.STATUS_KODE              */00007660
                                                                        00007670
            END;       /*    DO      :   IKKE 1.GANGS REG.           */ 00007680
         ELSE                                                           00007690
            DO;                                                         00007700
               /* ************************************************ */   00007710
               /*  VIRKDATO  <  VIRKDATO   NEST SISTE STATUS       */   00007720
               /* ************************************************ */   00007730
                                                                        00007740
               STATUS_TYPE             =    'F' ;                       00007750
               W02_MER_DATA            =    '0'B;                       00007760
            END;                                                        00007770
  RETUR:                                                                00007780
    END P30_BEHANDLE_STATUS ;                                           00007790
                                                                        00007800
                                                                        00007810
                                                                        00007820
    /* ************************************************************** */00007830
    /*                                                                */00007840
    /* NY  VTP  >=   VTP    NEST SISTE STATUS                         */00007850
    /*               INGEN       SISTE STATUS                         */00007860
    /*                                                                */00007870
    /* PROCEDUREN SJEKKER :      VTP   GAMMEL TRANS                   */00007880
    /* -----------------------                                        */00007890
    /*                                                                */00007900
    /* ************************************************************** */00007910
                                                                        00007920
    P35_SJEKK_VTP_TRANS:                                                00007930
      PROC;                                                             00007940
                                                                        00007950
      /* ************************************************************ */00007960
      /*  UNDERSØKER OM DET FINNES EN TRANS MED :   VTP  >=  NY VTP   */00007970
      /* ************************************************************ */00007980
                                                                        00007990
      SSA1_TRANHIST.VTP                     =    TRANS_VIRKDATO_ÅM;     00008000
      CALL PLITDLI                              (W02_PARM_CT_5,         00008010
                                                 W02_GNP,               00008020
                                                 RF1,                   00008030
                                                 W01_IO,                00008040
                                                 SSA1_RF0PERSN,         00008050
                                                 SSA1_TRANHIST);        00008060
                                                                        00008070
      IF UIBFCTR                          ^=     UIB_RC_OK    THEN      00008080
         DO;                                                            00008090
            /* ************************************************** */    00008100
            /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */    00008110
            /* ************************************************** */    00008120
  L200:                                                                 00008130
            FEIL_MELD_NR               =     500;                       00008140
            FEIL_VED_LABEL             =    '200';                      00008150
            GO   TO  RETUR;                                             00008160
         END;                                                           00008170
                                                                        00008180
                                                                        00008190
      SELECT   ( RF1.STATUS_KODE );                                     00008200
         WHEN  ( '  ' , 'GA' , 'GK' )                                   00008210
            DO;                                                         00008220
               /* ************************************** */             00008230
               /*  INGEN                  SISTE STATUS   */             00008240
               /*  NY VTP   >=   VTP NEST SISTE STATUS   */             00008250
               /*  NY VTP    <   VTP GML. TRANS          */             00008260
               /* ************************************** */             00008270
                                                                        00008280
               STATUS_TYPE                 =    'D';                    00008290
               CALL PLITDLI                     (W02_PARM_CT_5,         00008300
                                                 W02_GNP,               00008310
                                                 RF1,                   00008320
                                                 W01_IO,                00008330
                                                 SSA1_RF0PERSN,         00008340
                                                 SSA2_STATUS);          00008350
                                                                        00008360
               IF   UIBFCTR               ^=     UIB_RC_OK    THEN      00008370
                  DO;                                                   00008380
                     /* ****************************************** */   00008390
                     /*   UIB'S RETUR-CODE ER UAKSEPTABEL          */   00008400
                     /* ****************************************** */   00008410
  L210:                                                                 00008420
                     FEIL_MELD_NR               =     500;              00008430
                     FEIL_VED_LABEL             =    '210';             00008440
                     GO   TO  RETUR;                                    00008450
                  END;                                                  00008460
                                                                        00008470
               IF RF1.STATUS_KODE            =    '  '                  00008480
                ! RF1.STATUS_KODE            =    'GA'                  00008490
                ! RF1.STATUS_KODE            =    'GK'          THEN    00008500
                  DO;                                                   00008510
                     /* ****************************************** */   00008520
                     /*   PCB'EN PEKER PÅ NEST SISTE STATUS        */   00008530
                     /* ****************************************** */   00008540
                                                                        00008550
                     CALL  P40_LES_STATUS_OMR_TIL_B01;                  00008560
                  END;                                                  00008570
               ELSE                                                     00008580
                  DO;                                                   00008590
                     /* ****************************************** */   00008600
                     /*   PCB'EN SKULLE PEKT PÅ NEST SISTE STATUS  */   00008610
                     /* ****************************************** */   00008620
  L220:                                                                 00008630
                     FEIL_MELD_NR               =     500;              00008640
                     FEIL_VED_LABEL             =    '220';             00008650
                     GO   TO  RETUR;                                    00008660
                  END;                                                  00008670
            END;                                                        00008680
                                                                        00008690
         WHEN  ( 'GE' , 'GB' )                                          00008700
            DO;                                                         00008710
               /* ************************************** */             00008720
               /*  INGEN                  SISTE STATUS   */             00008730
               /*  NY VTP   >=   VTP NEST SISTE STATUS   */             00008740
               /*  NY VTP   >=   VTP GML. TRANS          */             00008750
               /* ************************************** */             00008760
                                                                        00008770
               STATUS_TYPE          =   'A' ;                           00008780
               W02_MER_DATA         =   '0'B;                           00008790
            END;                                                        00008800
                                                                        00008810
         OTHERWISE                                                      00008820
            DO;                                                         00008830
               /* ************************************************** */ 00008840
               /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */ 00008850
               /* ************************************************** */ 00008860
  L230:                                                                 00008870
               FEIL_MELD_NR               =     500;                    00008880
               FEIL_VED_LABEL             =    '230';                   00008890
            END;                                                        00008900
      END;  /*      SELECT  (RF1.STATUS_KODE)                      */   00008910
                                                                        00008920
  RETUR:                                                                00008930
    END P35_SJEKK_VTP_TRANS;                                            00008940
                                                                        00008950
                                                                        00008960
                                                                        00008970
    /* ************************************************************** */00008980
    /*                                                                */00008990
    /* PROCEDURE FOR LESE STATUS-SEGMENTENE TIL B01                   */00009000
    /*                                                                */00009010
    /* ************************************************************** */00009020
                                                                        00009030
    P40_LES_STATUS_OMR_TIL_B01:                                         00009040
      PROC;                                                             00009050
                                                                        00009060
      /* ************************************************************ */00009070
      /*  STATUS - SEGMENTET       ------>      B01                   */00009080
      /* ************************************************************ */00009090
                                                                        00009100
      SUBSTR (ADDR (B01.STATUS        ( POS_I_B01 ))                    00009110
           -> W01_HJELPE_IO,1 ,STG    ( B01.STATUS ( POS_I_B01 )))      00009120
                              =         W01_IO ;                        00009130
                                                                        00009140
                                                                        00009150
   /*     YPEK= ADDR(B01.ENGANGSBELØP_11_7(POS_I_B01))                  00009160
          IF Y_ENGANGSBELØP = '    '  THEN                              00009170
             DO                                                         00009180
                B01.STATUS.ENGANGSBELØP_11_7(POS_I_B01) = 0             00009190
             END                                            HIT.TRUDE*/ 00009200
                                                                        00009210
      /* ************************************************************ */00009220
      /*  LESER  UNDERLIGENDE SEGM TIL STATUS     ------->  B01       */00009230
      /* ************************************************************ */00009240
                                                                        00009250
      CALL    P10_LES_SEGM;                                             00009260
                                                                        00009270
      DO      WHILE    ( W02_MER_DATA ) ;                               00009280
                                                                        00009290
        IF    FEIL_MELD_NR      >  0            THEN                    00009300
          DO;                                                           00009310
             /* **************************************** */             00009320
             /*  FEIL VED LES                            */             00009330
             /* **************************************** */             00009340
                                                                        00009350
             GO TO RETUR;                                               00009360
          END;                                                          00009370
                                                                        00009380
                                                                        00009390
        SELECT         ( RF1.SEGM_NAVN ) ;                              00009400
                                                                        00009410
          WHEN         ('TILKN    ')                                    00009420
            /* ****************************************************** */00009430
            /*    TILKNYTTNINGS - OPPLYSNINGENE   ->   B 0 1 .        */00009440
            /* ****************************************************** */00009450
            DO;                                                         00009460
              W02_TILKNY_TELLER            =      W02_TILKNY_TELLER + 1;00009470
                                                                        00009480
              SUBSTR (ADDR (B01.TILKN    ( POS_I_B01,                   00009490
                                           W02_TILKNY_TELLER ))         00009500
               -> W01_HJELPE_IO,1,STG    ( B01.TILKN (                  00009510
                      POS_I_B01   ,        W02_TILKNY_TELLER )))        00009520
                                    =      W01_IO;                      00009530
              CALL P10_LES_SEGM;                                        00009540
            END;                                                        00009550
                                                                        00009560
          WHEN         ('ALDERSP  ')                                    00009570
            /* ****************************************************** */00009580
            /*    TILKNYTNINGS - OPPLYSNINGENE   ->   B 0 1 .         */00009590
            /* ****************************************************** */00009600
            DO;                                                         00009610
              SUBSTR (ADDR (B01.ALDERSP        ( POS_I_B01 ))           00009620
                ->    W01_HJELPE_IO,1,                                  00009630
                          STG   (B01.ALDERSP   (1  ))  -                00009640
                         (STG   (B01.VENTØVR   (1,1))) * 5 )            00009650
                                    =          W01_IO;                  00009660
              CALL P10_LES_SEGM;                                        00009670
            END;                                                        00009680
                                                                        00009690
          WHEN         ('VENTØVR  ')                                    00009700
            /* ****************************************************** */00009710
            /*    VENTØVTTNINGS - OPPLYSNINGENE   ->   B 0 1 .        */00009720
            /* ****************************************************** */00009730
            DO;                                                         00009740
              W02_VENTØV_TELLER           =      W02_VENTØV_TELLER + 1; 00009750
                                                                        00009760
              SUBSTR (ADDR (B01.VENTØVR  ( POS_I_B01,                   00009770
                                           W02_VENTØV_TELLER ))         00009780
                -> W01_HJELPE_IO,1,STG   ( B01.VENTØVR (                00009790
                   POS_I_B01    ,          W02_VENTØV_TELLER )))        00009800
                                   =       W01_IO;                      00009810
              CALL P10_LES_SEGM;                                        00009820
            END;                                                        00009830
                                                                        00009840
          WHEN         ('UFØRPENS ')                                    00009850
            /* ****************************************************** */00009860
            /*    UFØREPENSJONS - OPPLYSNINGENE   ->   B 0 1 .        */00009870
            /* ****************************************************** */00009880
            DO;                                                         00009890
              SUBSTR (ADDR (B01.UFØRPENS    ( POS_I_B01 ))              00009900
                ->    W01_HJELPE_IO,1,STG   ( B01.UFØRPENS (            00009910
                      POS_I_B01 )))    =      W01_IO;                   00009920
                                                                        00009930
              CALL P10_LES_SEGM;                                        00009940
            END;                                                        00009950
                                                                        00009960
          WHEN ('UFØRHIST')                                             00009970
            /* ****************************************** */            00009980
            /*   UFØREHISTORIKK-OPPLYSNINGENE   ->  B 0 1 */            00009990
            /* ****************************************** */            00010000
            DO;                                                         00010010
              W02_UFHIST_TELLER = W02_UFHIST_TELLER + 1;                00010020
                                                                        00010030
 /*ENDRET 2.12.87 HL SE FRAPP 548 - UFGRAD-TELLER MÅ NULLES */          00010040
                                                                        00010050
              W02_UFGRAD_TELLER = 0;                                    00010060
                                                                        00010070
                                                                        00010080
              SUBSTR (ADDR (B01.UFØRHIST (POS_I_B01,                    00010090
                            W02_UFHIST_TELLER ))                        00010100
              -> W01_HJELPE_IO ,1,                                      00010110
                     STG   (B01.UFØRHIST (1,1) )  -                     00010120
                    (STG   (B01.UFØRGRAD (1,1,1))) * 7 ) = W01_IO;      00010130
              CALL P10_LES_SEGM;                                        00010140
            END;                                                        00010150
                                                                        00010160
          WHEN ('UFØRGRAD')                                             00010170
            /* ****************************************** */            00010180
            /*   UFØREGRAD-OPPLYSNINGENE   ->   B 0 1 .   */            00010190
            /* ****************************************** */            00010200
            DO;                                                         00010210
              W02_UFGRAD_TELLER = W02_UFGRAD_TELLER + 1;                00010220
                                                                        00010230
              SUBSTR   (ADDR        (B01.UFØRGRAD (POS_I_B01,           00010240
                    W02_UFHIST_TELLER , W02_UFGRAD_TELLER ))            00010250
                 -> W01_HJELPE_IO,1,STG (B01.UFØRGRAD (                 00010260
                        POS_I_B01 , W02_UFHIST_TELLER ,                 00010270
                                    W02_UFGRAD_TELLER ))) =  W01_IO;    00010280
                                                                        00010290
              CALL  P10_LES_SEGM;                                       00010300
            END;                                                        00010310
                                                                        00010320
 /*YS*/   WHEN         ('YRKEPENS ')                                    00010330
 /*YS*/     /* ****************************************************** */00010340
 /*YS*/     /* YRKESSKADEPENSJONS - OPPLYSNINGENE   ->   B 0 1 .      */00010350
 /*YS*/     /* ****************************************************** */00010360
 /*YS*/     DO;                                                         00010370
 /*YS*/       SUBSTR (ADDR (B01.YRKEPENS    ( POS_I_B01 ))              00010380
 /*YS*/         ->    W01_HJELPE_IO,1,STG   ( B01.YRKEPENS (            00010390
 /*YS*/               POS_I_B01 )))    =      W01_IO;                   00010400
 /*YS*/                                                                 00010410
 /*YS*/       CALL P10_LES_SEGM;                                        00010420
 /*YS*/     END;                                                        00010430
                                                                        00010440
 /*YS*/   WHEN ('YRKEHIST')                                             00010450
 /*YS*/     /* ************************************************ */      00010460
 /*YS*/     /*   YRKESSKADE-HISTORIKK-OPPLYSNINGENE   ->  B 0 1 */      00010470
 /*YS*/     /* ************************************************ */      00010480
 /*YS*/     DO;                                                         00010490
 /*YS*/       W02_YSHIST_TELLER = W02_YSHIST_TELLER + 1;                00010500
 /*YS*/       W02_YSGRAD_TELLER = 0;                                    00010510
 /*YS*/                                                                 00010520
 /*YS*/       SUBSTR (ADDR (B01.YRKEHIST (POS_I_B01,                    00010530
 /*YS*/                     W02_YSHIST_TELLER ))                        00010540
 /*YS*/       -> W01_HJELPE_IO ,1,                                      00010550
 /*YS*/              STG   (B01.YRKEHIST (1,1) )  -                     00010560
 /*YS*/             (STG   (B01.YRKEGRAD (1,1,1))) * 5 ) = W01_IO;      00010570
 /*YS*/       CALL P10_LES_SEGM;                                        00010580
 /*YS*/     END;                                                        00010590
                                                                        00010600
 /*YS*/   WHEN ('YRKEGRAD')                                             00010610
 /*YS*/     /* ************************************************ */      00010620
 /*YS*/     /*   YRKESSKADE-GRAD-OPPLYSNINGENE   ->   B 0 1 .   */      00010630
 /*YS*/     /* ************************************************ */      00010640
 /*YS*/     DO;                                                         00010650
 /*YS*/       W02_YSGRAD_TELLER = W02_YSGRAD_TELLER + 1;                00010660
 /*YS*/                                                                 00010670
 /*YS*/       SUBSTR   (ADDR        (B01.YRKEGRAD (POS_I_B01,           00010680
 /*YS*/             W02_YSHIST_TELLER , W02_YSGRAD_TELLER ))            00010690
 /*YS*/          -> W01_HJELPE_IO,1,STG (B01.YRKEGRAD (                 00010700
 /*YS*/                 POS_I_B01 , W02_YSHIST_TELLER ,                 00010710
 /*YS*/                             W02_YSGRAD_TELLER ))) =  W01_IO;    00010720
 /*YS*/                                                                 00010730
 /*YS*/       CALL  P10_LES_SEGM;                                       00010740
 /*YS*/     END;                                                        00010750
                                                                        00010760
          WHEN         ('ETTEPENS ')                                    00010770
            /* ****************************************************** */00010780
            /*    ETTERLATTE  -   OPPLYSNINGENE   ->   B 0 1 .        */00010790
            /* ****************************************************** */00010800
            DO;                                                         00010810
              SUBSTR (ADDR  (B01.ETTEPENS   ( POS_I_B01 ))              00010820
                ->    W01_HJELPE_IO,1,STG   ( B01.ETTEPENS (            00010830
                      POS_I_B01 )))    =      W01_IO;                   00010840
                                                                        00010850
              CALL P10_LES_SEGM;                                        00010860
            END;                                                        00010870
                                                                        00010880
            /* ****************************************************** */00010890
            /*    FORSØRGINGSTILLEGG OPPLYSNINGENE   ->   B 0 1 .     */00010900
            /* ****************************************************** */00010910
          WHEN         ('FORSI    ')                                    00010920
            DO;                                                         00010930
              SUBSTR (ADDR (B01.FORSI       ( POS_I_B01 ))              00010940
                ->    W01_HJELPE_IO,1,STG   ( B01.FORSI    (            00010950
                      POS_I_B01 )))    =      W01_IO;                   00010960
                                                                        00010970
              CALL P10_LES_SEGM;                                        00010980
            END;                                                        00010990
                                                                        00011000
          WHEN         ('ETTEBARN ')                                    00011010
            /* ****************************************************** */00011020
            /*    ETTERLATTE BARN-OPPLYSNINGENE   ->   B 0 1          */00011030
            /* ****************************************************** */00011040
            DO;                                                         00011050
              SUBSTR (ADDR (B01.ETTEBARN    ( POS_I_B01 ))              00011060
                ->    W01_HJELPE_IO,1,STG   ( B01.ETTEBARN (            00011070
                      POS_I_B01     )))  =    W01_IO;                   00011080
                                                                        00011090
              CALL P10_LES_SEGM;                                        00011100
            END;                                                        00011110
                                                                        00011120
          WHEN         ('EØSINFO  ')                                    00011130
            /* ****************************************************** */00011140
            /*    SPESIAL    -    OPPLYSNINGENE   ->   B 0 1 .        */00011150
            /* ****************************************************** */00011160
            DO;                                                         00011170
              SUBSTR (ADDR (B01.EØSINFO     ( POS_I_B01 ))              00011180
                ->    W01_HJELPE_IO,1,STG   ( B01.EØSINFO  (            00011190
                      POS_I_B01 )))    =      W01_IO;                   00011200
                                                                        00011210
              CALL P10_LES_SEGM;                                        00011220
            END;                                                        00011230
                                                                        00011240
          WHEN         ('SPESOPPL ')                                    00011250
            /* ****************************************************** */00011260
            /*    SPESIAL    -    OPPLYSNINGENE   ->   B 0 1 .        */00011270
            /* ****************************************************** */00011280
            DO;                                                         00011290
              SUBSTR (ADDR (B01.SPESOPPL    ( POS_I_B01 ))              00011300
                ->    W01_HJELPE_IO,1,STG   ( B01.SPESOPPL (            00011310
                      POS_I_B01 )))    =      W01_IO;                   00011320
                                                                        00011330
              CALL P10_LES_SEGM;                                        00011340
            END;                                                        00011350
                                                                        00011360
          OTHERWISE                                                     00011370
            /* **************************************************** */  00011380
            /*    FÅTT INN ET SEGMENT-NAVN SOM IKKE ER BRUKBART.    */  00011390
            /* **************************************************** */  00011400
            DO;                                                         00011410
              W02_MER_DATA                  =   '0'B;                   00011420
            END;                                                        00011430
                                                                        00011440
        END;      /*       END PÅ SELECT-GRENEN                     */  00011450
                                                                        00011460
      END;        /* SLUTT PÅ DO LØKKE  ): INGEN FLERE STATUS-SEGM. */  00011470
  RETUR:                                                                00011480
    END  P40_LES_STATUS_OMR_TIL_B01;                                    00011490
                                                                        00011500
                                                                        00011510
                                                                        00011520
    %PAGE;                                                              00011530
    /* ************************************************************** */00011540
    /*                                                                */00011550
    /* PROCEDURE FOR Å BEHANDLE :                                     */00011560
    /* ---------------------------                                    */00011570
    /*                                                                */00011580
    /*        SISTE STATUS                                            */00011590
    /*                               ==>     B01   VED FORESPØRSEL    */00011600
    /*   NEST SISTE STATUS                                            */00011610
    /*                                                                */00011620
    /* ************************************************************** */00011630
                                                                        00011640
    P50_BEHANDLE_STATUS_FORESPØRSEL:                                    00011650
      PROC;                                                             00011660
                                                                        00011670
      SUBSTR (ADDR ( W01_STATUS )                                       00011680
              ->     W01_HJELPE_IO,1,STG ( W01_STATUS ))  =  W01_IO ;   00011690
                                                                        00011700
                                                                        00011710
      IF  W01_STATUS.STATUS_KODE         =    ØNSKET_STATUS       THEN  00011720
        DO;                                                             00011730
          /* ****************************************************** */  00011740
          /*     LEST STATUS    =   ØNSKET STATUS                   */  00011750
          /* ****************************************************** */  00011760
                                                                        00011770
          CALL  P40_LES_STATUS_OMR_TIL_B01;                             00011780
        END;                                                            00011790
      ELSE                                                              00011800
        DO;                                                             00011810
          /* ****************************************************** */  00011820
          /*     LEST STATUS       ^=   ØNSKET STATUS               */  00011830
          /*                                                        */  00011840
          /*     HVIS LEST STATUS  ^=  'N'  (NEST SISTE STATUS)     */  00011850
          /*     SJEKKES NESTE STATUS-SEGM.                         */  00011860
          /* ****************************************************** */  00011870
                                                                        00011880
          IF  W01_STATUS.STATUS_KODE    ^=   'N'                THEN    00011890
            DO;                                                         00011900
              SSA_UQUAL                  =   'STATUS   ';               00011910
              CALL  P20_LES_SEGM_KVAL;                                  00011920
                                                                        00011930
              IF   FEIL_MELD_NR          >     0                THEN    00011940
                DO;                                                     00011950
                  /* *********************************************** */ 00011960
                  /*   FEIL VED LES                                  */ 00011970
                  /* *********************************************** */ 00011980
                                                                        00011990
                  GO   TO  RETUR;                                       00012000
                END;                                                    00012010
                                                                        00012020
              IF   W02_MER_DATA                                 THEN    00012030
                DO;                                                     00012040
                  /* *********************************************** */ 00012050
                  /*   LEST INN ET NYTT STATUS-SEGMENT.              */ 00012060
                  /*   SIDEN DET FORRIGE LESTE SEGM. IKKE VAR DET    */ 00012070
                  /*   ØNSKEDE , MÅ DETTE VÆRE DET.                  */ 00012080
                  /* *********************************************** */ 00012090
                                                                        00012100
                  CALL  P40_LES_STATUS_OMR_TIL_B01;                     00012110
                END;                                                    00012120
            END;                                                        00012130
          ELSE                                                          00012140
            DO;                                                         00012150
              /* *************************************************** */ 00012160
              /* LEST STATUS  ^=   ØNSKET STATUS                     */ 00012170
              /* LEST STATUS   =  'N'  ): FINNES INGEN ØNSKET STATUS */ 00012180
              /*                                                     */ 00012190
              /* *************************************************** */ 00012200
                                                                        00012210
              W02_MER_DATA                =   '0'B;                     00012220
                                                                        00012230
              IF FUNKSJONSKODE           ^=   'F'       THEN            00012240
  L240:          DO;                                                    00012250
                     FEIL_VED_LABEL       =   '240';                    00012260
                     FEIL_MELD_NR         =    495 ;                    00012270
                     GO   TO   RETUR;                                   00012280
                 END;                                                   00012290
            END;                                                        00012300
        END;                                                            00012310
  RETUR:                                                                00012320
    END P50_BEHANDLE_STATUS_FORESPØRSEL;                                00012330
                                                                        00012340
                                                                        00012350
                                                                        00012360
  L999:                                                                 00012370
                                                                        00012380
    EXEC CICS RETURN;                                                   00012390
  END    R001311;                                                       00012400
