 /*       SIST ENDRET 18/12-91 14.56.25 AV   HERMAN                   */00000000
 R01TK92: PROC (RF1_PCB_PEKER) OPTIONS (MAIN);                          00000010
                                                                        00000020
                                                                        00000030
 /*       SIST ENDRET 12/08-91 10.06.02 AV   DYBVIK                   */00000040
 /* LEGG INN I BASEN DATA FRA P002.TKNRDATA.ANTALL */                   00000050
                                                                        00000060
 /* ENDRET 18.12.91 P.G.A DET IKKE TRENGER SPESIELT BEHANDLING        */00000070
 /* FOR 2001 OG AT P002.TKNRDATA.ANTALL INNHOLDER UGYLDIG DATA.       */00000080
                                                                        00000090
                                                                        00000100
                                                                        00000110
    DCL RF1_PCB_PEKER POINTER;                                          00000120
                                                                        00000130
    %INCLUDE P001TK53;             /* INNBYGG-SEGMENT                 */00000140
    %INCLUDE P001TK56;             /* KOMMUNE-SEGMENT                 */00000150
                                                                        00000160
    DCL PLITDLI              EXTERNAL  ENTRY;                           00000170
                                                                        00000180
    DCL                                                                 00000190
        GHN                  CHAR      ( 4)   INIT ('GHN '     )       ,00000200
        GHNP                 CHAR      ( 4)   INIT ('GHNP'     )       ,00000210
        GHU                  CHAR      ( 4)   INIT ('GHU '     )       ,00000220
        GET                  CHAR      ( 4)   INIT ('    '     )       ,00000230
        REPL                 CHAR      ( 4)   INIT ('REPL'     )       ,00000240
        ISRT                 CHAR      ( 4)   INIT ('ISRT'     )       ,00000250
        TRE                  FIXED BIN (31)   INIT ( 3         )       ,00000260
        FIRE                 FIXED BIN (31)   INIT ( 4         )       ,00000270
        FEM                  FIXED BIN (31)   INIT ( 5         )       ,00000280
        SSA_INNBYGG_UQUAL    CHAR      ( 9)   INIT ('INNBYGG  ')       ,00000290
        SSA_KOMMUNE_UQUAL    CHAR      ( 9)   INIT ('KOMMUNE  ')       ;00000300
                                                                        00000310
    DCL 1 SSA_TK               STATIC,                                  00000320
          2    HDEL                        CHAR (17)    INIT            00000330
             ('TK      (TKNR    '),                                     00000340
          2    REL_OP                      CHAR (2)     INIT (' ='),    00000350
          2    PKEY                        PIC '( 4)9'  INIT ( 0  ),    00000360
          2    HP                          CHAR (1)     INIT (')' );    00000370
                                                                        00000380
 /*-------------------------------------------------------------------*/00000390
 /*                                                                   */00000400
 /* PCB-OMRÅDE                                                        */00000410
 /*                                                                   */00000420
 /*-------------------------------------------------------------------*/00000430
                                                                        00000440
    DCL 1  RF1     BASED    (RF1_PCB_PEKER),                            00000450
    %INCLUDE P0012003;                                 /* PCB-OMRÅDE  */00000460
                                                                        00000470
 /*-------------------------------------------------------------------*/00000480
 /*                                                                   */00000490
 /*   HJELPE-VARIABLE                                                 */00000500
 /*                                                                   */00000510
 /*-------------------------------------------------------------------*/00000520
                                                                        00000530
    DCL END_OF_BASE          BIT          ( 1) INIT ('0'B)             ,00000540
        FUNNET               BIT          ( 1) INIT ('0'B)             ,00000550
        ANT_LES              PIC '( 5)9'       INIT (0)                ,00000560
        ANT_INNB_SKRIV       PIC '( 5)9'       INIT (0)                ,00000570
        ANT_KOMM_SKRIV       PIC '( 5)9'       INIT (0)                ;00000580
                                                                        00000590
    DCL (VERIFY , SUBSTR , MAX , INDEX , ADDR , DATE, UNSPEC) BUILTIN;  00000600
                                                                        00000610
 /*-------------------------------------------------------------------*/00000620
 /*                                                                   */00000630
 /*   FILER                                                           */00000640
 /*                                                                   */00000650
 /*-------------------------------------------------------------------*/00000660
    DCL INFILE FILE RECORD INPUT;                                       00000670
                                                                        00000680
    DCL 1 IN_REC,                                                       00000690
          5 TKNR            PIC '( 4)9',                                00000700
          5 KOMMNR          PIC '( 4)9',                                00000710
          5 KJØNN           PIC '( 1)9',                                00000720
          5 ANTALL(1:100)   PIC '( 6)9';                                00000730
                                                                        00000740
    DCL EOF                 BIT  ( 1) INIT ('0'B);                      00000750
                                                                        00000760
 /*-------------------------------------------------------------------*/00000770
 /*                                                                   */00000780
 /*   START PROGRAM                                                   */00000790
 /*                                                                   */00000800
 /*-------------------------------------------------------------------*/00000810
                                                                        00000820
    ON ERROR BEGIN;                                                     00000830
       ON ERROR SYSTEM;                                                 00000840
          PUT SKIP LIST('FEIL I BEHANDLING TK: ', IN_REC.TKNR);         00000850
       END;                                                             00000860
                                                                        00000870
    ON ENDFILE (INFILE)                                                 00000880
       EOF = '1'B;                                                      00000890
                                                                        00000900
    OPEN FILE (INFILE);                                                 00000910
                                                                        00000920
    IN_REC  = '';                                                       00000930
                                                                        00000940
    READ FILE (INFILE) INTO (IN_REC);                                   00000950
                                                                        00000960
    DO WHILE (^EOF);                                                    00000970
                                                                        00000980
       IF (IN_REC.TKNR >= 0101) & (IN_REC.TKNR <= 2030) &               00000990
          (IN_REC.TKNR ^= 0317)                         THEN            00001000
          DO;                                                           00001010
             ANT_LES      = ANT_LES + 1;                                00001020
                                                                        00001030
             INNBYGG_DATO = DATE;                                       00001040
                                                                        00001050
             CALL GI_MANN_DATA;                                         00001060
                                                                        00001070
             IN_REC = '';                                               00001080
             READ FILE (INFILE) INTO (IN_REC);                          00001090
                                                                        00001100
             CALL GI_KVINNE_DATA;                                       00001110
                                                                        00001120
             PKEY         = IN_REC.TKNR;                                00001130
                                                                        00001140
             CALL PLITDLI           (FEM,                               00001150
                                     GHU,                               00001160
                                     RF1,                               00001170
                                     INNBYGG,                           00001180
                                     SSA_TK,                            00001190
                                     SSA_INNBYGG_UQUAL);                00001200
                                                                        00001210
             IF RF1.STATUS_KODE ^= '  ' THEN                            00001220
                DO;                                                     00001230
                   IF RF1.STATUS_KODE ^= 'GE' THEN                      00001240
                      DO;                                               00001250
                         PUT SKIP LIST ('FEIL LES INNBYGG , RF1 ',      00001260
                                         PKEY, RF1.STATUS_KODE);        00001270
                                                                        00001280
                         GOTO SLUTT;                                    00001290
                      END;                                              00001300
                                                                        00001310
                   ELSE                                                 00001320
                      DO;                                               00001330
                         PKEY         = IN_REC.TKNR;                    00001340
                                                                        00001350
                         CALL PLITDLI           (FEM,                   00001360
                                                 ISRT,                  00001370
                                                 RF1,                   00001380
                                                 INNBYGG,               00001390
                                                 SSA_TK,                00001400
                                                 SSA_INNBYGG_UQUAL);    00001410
                                                                        00001420
                         IF RF1.STATUS_KODE ^= '  ' THEN                00001430
                            DO;                                         00001440
                               PUT SKIP LIST ('FEIL INSERT INNBYGG ,    00001450
                                               RF1 ',                   00001460
                                               PKEY, RF1.STATUS_KODE);  00001470
                               GOTO SLUTT;                              00001480
                            END;                                        00001490
                                                                        00001500
                         ELSE                                           00001510
                            ANT_INNB_SKRIV = ANT_INNB_SKRIV + 1;        00001520
                      END;                                              00001530
                END;                                                    00001540
                                                                        00001550
             ELSE                                                       00001560
                DO;                                                     00001570
                   CALL PLITDLI           (TRE,                         00001580
                                           REPL,                        00001590
                                           RF1,                         00001600
                                           INNBYGG);                    00001610
                                                                        00001620
                   IF RF1.STATUS_KODE ^= '  ' THEN                      00001630
                      DO;                                               00001640
                         PUT SKIP LIST ('FEIL REPLACE INNBYGG ,         00001650
                                         RF1 ',                         00001660
                                         PKEY, RF1.STATUS_KODE);        00001670
                                                                        00001680
                         GOTO SLUTT;                                    00001690
                      END;                                              00001700
                                                                        00001710
                   ELSE                                                 00001720
                      ANT_INNB_SKRIV = ANT_INNB_SKRIV + 1;              00001730
                END;                                                    00001740
                                                                        00001750
 /*          IF PKEY ^= 2001 THEN                                       00001760
                DO; */                                                  00001770
                   CALL PLITDLI           (FEM,                         00001780
                                           GHU,                         00001790
                                           RF1,                         00001800
                                           KOMMUNE,                     00001810
                                           SSA_TK,                      00001820
                                           SSA_KOMMUNE_UQUAL);          00001830
                                                                        00001840
                   IF RF1.STATUS_KODE ^= '  ' THEN                      00001850
                      DO;                                               00001860
                         PUT SKIP LIST ('FEIL LES KOMMUNE ,             00001870
                                         RF1 ',                         00001880
                                         PKEY, RF1.STATUS_KODE);        00001890
                                                                        00001900
                         GOTO SLUTT;                                    00001910
                      END;                                              00001920
                   ELSE                                                 00001930
                      DO;                                               00001940
                         KOMMUNE.KOMMNR = IN_REC.KOMMNR;                00001950
                                                                        00001960
                         CALL PLITDLI       (TRE,                       00001970
                                             REPL,                      00001980
                                             RF1,                       00001990
                                             KOMMUNE);                  00002000
                                                                        00002010
                         IF RF1.STATUS_KODE ^= '  ' THEN                00002020
                            DO;                                         00002030
                               PUT SKIP LIST ('FEIL REPL KOMMUNE ,      00002040
                                               RF1 ', PKEY,             00002050
                                               RF1.STATUS_KODE);        00002060
                                                                        00002070
                               GOTO SLUTT;                              00002080
                            END;                                        00002090
                         ELSE                                           00002100
                            ANT_KOMM_SKRIV = ANT_KOMM_SKRIV + 1;        00002110
                      END;                                              00002120
 /*             END; */                                                 00002130
                                                                        00002140
             IN_REC = '';                                               00002150
                                                                        00002160
             READ FILE (INFILE) INTO (IN_REC);                          00002170
          END;                                                          00002180
                                                                        00002190
       ELSE                                                             00002200
          DO;                                                           00002210
             IN_REC = '';                                               00002220
                                                                        00002230
             READ FILE (INFILE) INTO (IN_REC);                          00002240
          END;                                                          00002250
    END; /* WHILE ^EOF */                                               00002260
                                                                        00002270
 /*                                                                     00002280
    PKEY           = 2001;                                              00002290
                                                                        00002300
    CALL PLITDLI           (FEM,                                        00002310
                            GHU,                                        00002320
                            RF1,                                        00002330
                            KOMMUNE,                                    00002340
                            SSA_TK,                                     00002350
                            SSA_KOMMUNE_UQUAL);                         00002360
                                                                        00002370
    IF RF1.STATUS_KODE ^= '  ' THEN                                     00002380
       DO;                                                              00002390
          PUT SKIP LIST ('FEIL LES KOMMUNE , RF1 ',                     00002400
                          PKEY, RF1.STATUS_KODE);                       00002410
                                                                        00002420
          GOTO SLUTT;                                                   00002430
       END;                                                             00002440
    ELSE                                                                00002450
       DO;                                                              00002460
          KOMMUNE.KOMMNR = 2001;                                        00002470
                                                                        00002480
          CALL PLITDLI           (TRE,                                  00002490
                                  REPL,                                 00002500
                                  RF1,                                  00002510
                                  KOMMUNE);                             00002520
                                                                        00002530
          IF RF1.STATUS_KODE ^= '  ' THEN                               00002540
             DO;                                                        00002550
                PUT SKIP LIST ('FEIL REPL KOMMUNE , RF1 ',              00002560
                                PKEY, RF1.STATUS_KODE);                 00002570
                                                                        00002580
                GOTO SLUTT;                                             00002590
             END;                                                       00002600
          ELSE                                                          00002610
             ANT_KOMM_SKRIV = ANT_KOMM_SKRIV + 1;                       00002620
       END;                                                             00002630
                                                                        00002640
    PKEY           = 2001;                                              00002650
                                                                        00002660
    CALL PLITDLI           (FEM,                                        00002670
                            GHN,                                        00002680
                            RF1,                                        00002690
                            KOMMUNE,                                    00002700
                            SSA_TK,                                     00002710
                            SSA_KOMMUNE_UQUAL);                         00002720
                                                                        00002730
    IF RF1.STATUS_KODE ^= '  ' THEN                                     00002740
       DO;                                                              00002750
          PUT SKIP LIST ('FEIL LES KOMMUNE , RF1 ',                     00002760
                          PKEY, RF1.STATUS_KODE);                       00002770
                                                                        00002780
          GOTO SLUTT;                                                   00002790
       END;                                                             00002800
    ELSE                                                                00002810
       DO;                                                              00002820
          KOMMUNE.KOMMNR = 2016;                                        00002830
                                                                        00002840
          CALL PLITDLI           (TRE,                                  00002850
                                  REPL,                                 00002860
                                  RF1,                                  00002870
                                  KOMMUNE);                             00002880
                                                                        00002890
          IF RF1.STATUS_KODE ^= '  ' THEN                               00002900
             DO;                                                        00002910
                PUT SKIP LIST ('FEIL REPL KOMMUNE , RF1 ',              00002920
                                PKEY, RF1.STATUS_KODE);                 00002930
                                                                        00002940
                GOTO SLUTT;                                             00002950
             END;                                                       00002960
          ELSE                                                          00002970
             ANT_KOMM_SKRIV = ANT_KOMM_SKRIV + 1;                       00002980
       END;                                                             00002990
 */                                                                     00003000
    SLUTT:                                                              00003010
       CLOSE FILE (INFILE);                                             00003020
                                                                        00003030
       PUT SKIP LIST ('ANT LES ', ANT_LES);                             00003040
       PUT SKIP LIST ('ANT INNB SKRIV ', ANT_INNB_SKRIV);               00003050
       PUT SKIP LIST ('ANT KOMM SKRIV ', ANT_KOMM_SKRIV);               00003060
                                                                        00003070
 /*------------------------------------------------------------------*/ 00003080
                                                                        00003090
 GI_MANN_DATA: PROC;                                                    00003100
                                                                        00003110
             MANN_1  = ANTALL( 1);                                      00003120
             MANN_2  = ANTALL( 2);                                      00003130
             MANN_3  = ANTALL( 3);                                      00003140
             MANN_4  = ANTALL( 4);                                      00003150
             MANN_5  = ANTALL( 5);                                      00003160
             MANN_6  = ANTALL( 6);                                      00003170
             MANN_7  = ANTALL( 7);                                      00003180
             MANN_8  = ANTALL( 8);                                      00003190
             MANN_9  = ANTALL( 9);                                      00003200
             MANN_10 = ANTALL(10);                                      00003210
             MANN_11 = ANTALL(11);                                      00003220
             MANN_12 = ANTALL(12);                                      00003230
             MANN_13 = ANTALL(13);                                      00003240
             MANN_14 = ANTALL(14);                                      00003250
             MANN_15 = ANTALL(15);                                      00003260
             MANN_16 = ANTALL(16);                                      00003270
             MANN_17 = ANTALL(17);                                      00003280
             MANN_18 = ANTALL(18);                                      00003290
             MANN_19 = ANTALL(19);                                      00003300
             MANN_20 = ANTALL(20);                                      00003310
             MANN_21 = ANTALL(21);                                      00003320
             MANN_22 = ANTALL(22);                                      00003330
             MANN_23 = ANTALL(23);                                      00003340
             MANN_24 = ANTALL(24);                                      00003350
             MANN_25 = ANTALL(25);                                      00003360
             MANN_26 = ANTALL(26);                                      00003370
             MANN_27 = ANTALL(27);                                      00003380
             MANN_28 = ANTALL(28);                                      00003390
             MANN_29 = ANTALL(29);                                      00003400
             MANN_30 = ANTALL(30);                                      00003410
             MANN_31 = ANTALL(31);                                      00003420
             MANN_32 = ANTALL(32);                                      00003430
             MANN_33 = ANTALL(33);                                      00003440
             MANN_34 = ANTALL(34);                                      00003450
             MANN_35 = ANTALL(35);                                      00003460
             MANN_36 = ANTALL(36);                                      00003470
             MANN_37 = ANTALL(37);                                      00003480
             MANN_38 = ANTALL(38);                                      00003490
             MANN_39 = ANTALL(39);                                      00003500
             MANN_40 = ANTALL(40);                                      00003510
             MANN_41 = ANTALL(41);                                      00003520
             MANN_42 = ANTALL(42);                                      00003530
             MANN_43 = ANTALL(43);                                      00003540
             MANN_44 = ANTALL(44);                                      00003550
             MANN_45 = ANTALL(45);                                      00003560
             MANN_46 = ANTALL(46);                                      00003570
             MANN_47 = ANTALL(47);                                      00003580
             MANN_48 = ANTALL(48);                                      00003590
             MANN_49 = ANTALL(49);                                      00003600
             MANN_50 = ANTALL(50);                                      00003610
             MANN_51 = ANTALL(51);                                      00003620
             MANN_52 = ANTALL(52);                                      00003630
             MANN_53 = ANTALL(53);                                      00003640
             MANN_54 = ANTALL(54);                                      00003650
             MANN_55 = ANTALL(55);                                      00003660
             MANN_56 = ANTALL(56);                                      00003670
             MANN_57 = ANTALL(57);                                      00003680
             MANN_58 = ANTALL(58);                                      00003690
             MANN_59 = ANTALL(59);                                      00003700
             MANN_60 = ANTALL(60);                                      00003710
             MANN_61 = ANTALL(61);                                      00003720
             MANN_62 = ANTALL(62);                                      00003730
             MANN_63 = ANTALL(63);                                      00003740
             MANN_64 = ANTALL(64);                                      00003750
             MANN_65 = ANTALL(65);                                      00003760
             MANN_66 = ANTALL(66);                                      00003770
             MANN_67 = ANTALL(67);                                      00003780
             MANN_68 = ANTALL(68);                                      00003790
             MANN_69 = ANTALL(69);                                      00003800
             MANN_70 = ANTALL(70);                                      00003810
             MANN_71 = ANTALL(71);                                      00003820
             MANN_72 = ANTALL(72);                                      00003830
             MANN_73 = ANTALL(73);                                      00003840
             MANN_74 = ANTALL(74);                                      00003850
             MANN_75 = ANTALL(75);                                      00003860
             MANN_76 = ANTALL(76);                                      00003870
             MANN_77 = ANTALL(77);                                      00003880
             MANN_78 = ANTALL(78);                                      00003890
             MANN_79 = ANTALL(79);                                      00003900
             MANN_80 = ANTALL(80);                                      00003910
             MANN_81 = ANTALL(81);                                      00003920
             MANN_82 = ANTALL(82);                                      00003930
             MANN_83 = ANTALL(83);                                      00003940
             MANN_84 = ANTALL(84);                                      00003950
             MANN_85 = ANTALL(85);                                      00003960
             MANN_86 = ANTALL(86);                                      00003970
             MANN_87 = ANTALL(87);                                      00003980
             MANN_88 = ANTALL(88);                                      00003990
             MANN_89 = ANTALL(89);                                      00004000
             MANN_90 = ANTALL(90);                                      00004010
             MANN_91 = ANTALL(91);                                      00004020
             MANN_92 = ANTALL(92);                                      00004030
             MANN_93 = ANTALL(93);                                      00004040
             MANN_94 = ANTALL(94);                                      00004050
             MANN_95 = ANTALL(95);                                      00004060
             MANN_96 = ANTALL(96);                                      00004070
             MANN_97 = ANTALL(97);                                      00004080
             MANN_98 = ANTALL(98);                                      00004090
             MANN_99 = ANTALL(99);                                      00004100
             MANN_100= ANTALL(100);                                     00004110
                                                                        00004120
 END;                                                                   00004130
                                                                        00004140
                                                                        00004150
 GI_KVINNE_DATA: PROC;                                                  00004160
             KVINNE_1  = ANTALL( 1);                                    00004170
             KVINNE_2  = ANTALL( 2);                                    00004180
             KVINNE_3  = ANTALL( 3);                                    00004190
             KVINNE_4  = ANTALL( 4);                                    00004200
             KVINNE_5  = ANTALL( 5);                                    00004210
             KVINNE_6  = ANTALL( 6);                                    00004220
             KVINNE_7  = ANTALL( 7);                                    00004230
             KVINNE_8  = ANTALL( 8);                                    00004240
             KVINNE_9  = ANTALL( 9);                                    00004250
             KVINNE_10 = ANTALL(10);                                    00004260
             KVINNE_11 = ANTALL(11);                                    00004270
             KVINNE_12 = ANTALL(12);                                    00004280
             KVINNE_13 = ANTALL(13);                                    00004290
             KVINNE_14 = ANTALL(14);                                    00004300
             KVINNE_15 = ANTALL(15);                                    00004310
             KVINNE_16 = ANTALL(16);                                    00004320
             KVINNE_17 = ANTALL(17);                                    00004330
             KVINNE_18 = ANTALL(18);                                    00004340
             KVINNE_19 = ANTALL(19);                                    00004350
             KVINNE_20 = ANTALL(20);                                    00004360
             KVINNE_21 = ANTALL(21);                                    00004370
             KVINNE_22 = ANTALL(22);                                    00004380
             KVINNE_23 = ANTALL(23);                                    00004390
             KVINNE_24 = ANTALL(24);                                    00004400
             KVINNE_25 = ANTALL(25);                                    00004410
             KVINNE_26 = ANTALL(26);                                    00004420
             KVINNE_27 = ANTALL(27);                                    00004430
             KVINNE_28 = ANTALL(28);                                    00004440
             KVINNE_29 = ANTALL(29);                                    00004450
             KVINNE_30 = ANTALL(30);                                    00004460
             KVINNE_31 = ANTALL(31);                                    00004470
             KVINNE_32 = ANTALL(32);                                    00004480
             KVINNE_33 = ANTALL(33);                                    00004490
             KVINNE_34 = ANTALL(34);                                    00004500
             KVINNE_35 = ANTALL(35);                                    00004510
             KVINNE_36 = ANTALL(36);                                    00004520
             KVINNE_37 = ANTALL(37);                                    00004530
             KVINNE_38 = ANTALL(38);                                    00004540
             KVINNE_39 = ANTALL(39);                                    00004550
             KVINNE_40 = ANTALL(40);                                    00004560
             KVINNE_41 = ANTALL(41);                                    00004570
             KVINNE_42 = ANTALL(42);                                    00004580
             KVINNE_43 = ANTALL(43);                                    00004590
             KVINNE_44 = ANTALL(44);                                    00004600
             KVINNE_45 = ANTALL(45);                                    00004610
             KVINNE_46 = ANTALL(46);                                    00004620
             KVINNE_47 = ANTALL(47);                                    00004630
             KVINNE_48 = ANTALL(48);                                    00004640
             KVINNE_49 = ANTALL(49);                                    00004650
             KVINNE_50 = ANTALL(50);                                    00004660
             KVINNE_51 = ANTALL(51);                                    00004670
             KVINNE_52 = ANTALL(52);                                    00004680
             KVINNE_53 = ANTALL(53);                                    00004690
             KVINNE_54 = ANTALL(54);                                    00004700
             KVINNE_55 = ANTALL(55);                                    00004710
             KVINNE_56 = ANTALL(56);                                    00004720
             KVINNE_57 = ANTALL(57);                                    00004730
             KVINNE_58 = ANTALL(58);                                    00004740
             KVINNE_59 = ANTALL(59);                                    00004750
             KVINNE_60 = ANTALL(60);                                    00004760
             KVINNE_61 = ANTALL(61);                                    00004770
             KVINNE_62 = ANTALL(62);                                    00004780
             KVINNE_63 = ANTALL(63);                                    00004790
             KVINNE_64 = ANTALL(64);                                    00004800
             KVINNE_65 = ANTALL(65);                                    00004810
             KVINNE_66 = ANTALL(66);                                    00004820
             KVINNE_67 = ANTALL(67);                                    00004830
             KVINNE_68 = ANTALL(68);                                    00004840
             KVINNE_69 = ANTALL(69);                                    00004850
             KVINNE_70 = ANTALL(70);                                    00004860
             KVINNE_71 = ANTALL(71);                                    00004870
             KVINNE_72 = ANTALL(72);                                    00004880
             KVINNE_73 = ANTALL(73);                                    00004890
             KVINNE_74 = ANTALL(74);                                    00004900
             KVINNE_75 = ANTALL(75);                                    00004910
             KVINNE_76 = ANTALL(76);                                    00004920
             KVINNE_77 = ANTALL(77);                                    00004930
             KVINNE_78 = ANTALL(78);                                    00004940
             KVINNE_79 = ANTALL(79);                                    00004950
             KVINNE_80 = ANTALL(80);                                    00004960
             KVINNE_81 = ANTALL(81);                                    00004970
             KVINNE_82 = ANTALL(82);                                    00004980
             KVINNE_83 = ANTALL(83);                                    00004990
             KVINNE_84 = ANTALL(84);                                    00005000
             KVINNE_85 = ANTALL(85);                                    00005010
             KVINNE_86 = ANTALL(86);                                    00005020
             KVINNE_87 = ANTALL(87);                                    00005030
             KVINNE_88 = ANTALL(88);                                    00005040
             KVINNE_89 = ANTALL(89);                                    00005050
             KVINNE_90 = ANTALL(90);                                    00005060
             KVINNE_91 = ANTALL(91);                                    00005070
             KVINNE_92 = ANTALL(92);                                    00005080
             KVINNE_93 = ANTALL(93);                                    00005090
             KVINNE_94 = ANTALL(94);                                    00005100
             KVINNE_95 = ANTALL(95);                                    00005110
             KVINNE_96 = ANTALL(96);                                    00005120
             KVINNE_97 = ANTALL(97);                                    00005130
             KVINNE_98 = ANTALL(98);                                    00005140
             KVINNE_99 = ANTALL(99);                                    00005150
             KVINNE_100= ANTALL(100);                                   00005160
                                                                        00005170
 END; /* GI_INNBYGG_DATA */                                             00005180
                                                                        00005190
 END;  /* OF PROGRAM R01TK92 */                                         00005200
