 /*       SIST ENDRET 24/04-97 08.56.38 AV   JDA7339                  */00000000
 /*       SIST ENDRET 05/02-96 12.41.21 AV   JDA0310                  */00000010
 /*       SIST ENDRET 24/01-96 13.15.38 AV   JDA0310                  */00000020
 /*       SIST ENDRET 30/10-95 12.39.19 AV   JDA0310                  */00000030
 /*       SIST ENDRET 07/10-94 10.19.59 AV   TSB0310                  */00000040
 /*       SIST ENDRET 26/08-94 15.01.38 AV   HERMAN                   */00000050
 /*       SIST ENDRET 25/02-94 12.49.09 AV   HERMAN                   */00000060
 /*       SIST ENDRET 15/11-91 11.07.28 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 13/11-91 13.46.15 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 26/04-91 13.10.58 AV   DYBVIK                   */00000090
 R00104:                                                                00000100
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000110
 %SKIP;                                /*  */                           00000120
 /*****************PROGRAM ER DEL AV R0010401  ********************** */00000130
 /*IDENTIFIKASJON:                                                    */00000140
 /************************                                            */00000150
 /*  PROGRAM-IDENT : R001A401-REGISTRERING NYE BLANKETTER-HOVEDPROGR. */00000160
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000170
 /*  PROGRAMMERER  :                                                  */00000180
 /*  PROGRAMMET BLE DEL AV:  PATHAK                                   */00000190
 /*  ENDRINGERSDATO :                                                 */00000200
 /*  ENDRINGEN GJELDER:                                               */00000210
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000220
 /*                                                                   */00000230
 /******************************************************************* */00000240
 /*HENSIKT:*/                                                           00000250
 /************                                                        */00000260
 /*  PROGRAMMET ER FøRST DEL AV R0010401                              */00000270
 /*  PROGRAMMET LESER INN STYRINGSKODEN, KONTROLLERER DEN             */00000280
 /*  OG SENDER UT DET FØRSTE BILDET AV DEN BLANKETTEN SOM SKAL        */00000290
 /*  REGISTRERES:                                                     */00000300
 /*    AP ---> MAP S001051 MAPSET S001053 - GRBL. ALDERSPENSJON       */00000310
 /*    UP ---> MAP S001061 MAPSET S001063 - GRBL. UFØREPENSJON        */00000320
 /*    US ---> MAP S001071 MAPSET S001073 - GRBL. UF/GR STØNAD        */00000330
 /*    EP ---> MAP S001081 MAPSET S001083 - GRBL. ETTERL. EKTEFELLE   */00000340
 /*    EF ---> MAP S001091 MAPSET S001093 - GRBL. ETTERL. FAM.PLEIER  */00000350
 /*    FB ---> MAP S001101 MAPSET S001103 - GRBL. FORELDREL. BARN     */00000360
 /*    BP ---> MAP S001111 MAPSET S001113 - GRBL. ETTERLATTE BARN     */00000370
 /*    FT ---> MAP S001121 MAPSET S001123 - GRBL. FORSØRGINGSTILLEGG  */00000380
 /*    TG ---> MAP S001131 MAPSET S001133 - TILLEGGSBLANKETTEN        */00000390
 /*    E1 ---> MAP S001141 MAPSET S001143 - ENDRINGSBLANKETT-1        */00000400
 /*    E2 ---> MAP S001151 MAPSET S001153 - ENDRINGSBLANKETT-2        */00000410
 /*    O1 ---> MAP S001161 MAPSET S001163 - OPPHØRSBLANKETT-1         */00000420
 /*    O2 ---> MAP S001171 MAPSET S001173 - OPPHØRSBLANKETT-2         */00000430
 /*    AU ---> MAP S001181 MAPSET S001183 - STYRT AUTOHENDELSE        */00000440
 /*    NI ---> MAP S001I04 MAPSET S001I43 - NYE INNTEKTER             */00000450
 /*    MK ---> MAP S001B01 MAPSET S001B03 - MEDISINSK KODE            */00000460
 /*    AF ---> MAP S001901 MAPSET S001193 - AVTALEFESTET FØRTIDSPENS. */00000470
 /*    UF ---> MAP S001831 MAPSET S001833 - UNGE UFØRE FØR 1967     . */00000480
 /*    XX ---> MAP S001013 MAPSET S001013 - INNHENTING FUNKSJONSKODE  */00000490
 /*                                                                   */00000500
 /******************************************************************* */00000510
 /*PROGRAMTILKNYTTING:*/                                                00000520
 /**********************                                              */00000530
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSID = R040 OG R041.  */00000540
 /*  R040: KONTROLLEN KOMMER FRA R0010301                             */00000550
 /*  R041: KONTROLLEN KOMMER FRA                                      */00000560
 /*  PROGRAMMET GÅR VIA CICS TIL FORSKJELLIGE PROGRAMMER AVHENGIG     */00000570
 /*  HVILKEN STYRINGSKODE SOM BLIR SATT AV OPERATØREN ELLER           */00000580
 /*  ETTER BLANKETTKONTROLLEN TRANSKODE SATT AV PROGRAMMENE:          */00000590
 /*  AP - ALDERSPENSJON    - R050 - R0010501                          */00000600
 /*  UP - UFØREPENSJON     - R060 - R0010601                          */00000610
 /*  US - GR/HJ STØNAD     - R070 - R0010701                          */00000620
 /*  EP - ETTERLATT EK     - R080 - R0010801                          */00000630
 /*  EF - ETTERLATT FP     - R090 - R0010901                          */00000640
 /*  FB - FORELDRELØSE BARN- R100 - R0011001                          */00000650
 /*  BP - ETTERLATTE  BARN - R110 - R0011101                          */00000660
 /*  FT - FORSØRGINGSTILL. - R120 - R0011201                          */00000670
 /*  TG - TILLEGGSBLANKETT - R130 - R0011301                          */00000680
 /*  E1 - ENDRINGSBLANK-1  - R140 - R0011401                          */00000690
 /*  E2 - ENDRINGSBLANK-2  - R150 - R0011501                          */00000700
 /*  O1 - OPPHØRSBLANK-1   - R160 - R0011601                          */00000710
 /*  O2 - OPPHØRSBLANK-2   - R170 - R0011701                          */00000720
 /*  AU - STYRT AUTOHEND   - R180 - R0011801                          */00000730
 /*  NI - NYE INNTEKTER    - R0I4 - R001????                          */00000740
 /*  MK - MEDISINSK KODE   - RB00 - R001B001                          */00000750
 /*  AF -AFP               - R190 - R0011901                          */00000760
 /*  UF -UNGE UFØRE FØR 1967 R183 - R0011831                          */00000770
 /*  UF - UNGE UF   FØR 1967 R183 - R0011831                          */00000780
 /*                          R042 - R0012001 -FEILFRI BLANKETT        */00000790
 /*                                                                   */00000800
 /******************************************************************* */00000810
 /*DATASETTOPPLYSNINGER:                                              */00000820
 /*************************                                           */00000830
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000840
 /*                                                                   */00000850
 /******************************************************************* */00000860
 /*FEILMELDINGER:*/                                                     00000870
 /*********************                                               */00000880
 /* 'UGYLDIG STYREKODE' BLIR SKREVET PÅ SKJERMBILDET NÅR STYRINGSKODE */00000890
 /*  IKKE HAR GYLDIG VERDI                                            */00000900
 /*                                                                   */00000910
 /* ***************************************************************** */00000920
      %INCLUDE S00101;     /*  MENY            */                       00000930
 %PAGE;                                                                 00000940
      %INCLUDE S00105;     /*  ALDER MAPSETTET */                       00000950
 %PAGE;                                                                 00000960
      %INCLUDE S00106;     /*  UFØRE MAPSETTET */                       00000970
 %PAGE;                                                                 00000980
      %INCLUDE S00107;     /*  GR.ST./HJ.ST. MAPSETTET        */        00000990
 %PAGE;                                                                 00001000
      %INCLUDE S00108;     /*  ETTERLATT EKTEFELLE MAPSETTET  */        00001010
 %PAGE;                                                                 00001020
      %INCLUDE S00109;     /*  ETTERLATT FAMILIEPLEIER MAPSETTET   */   00001030
 %PAGE;                                                                 00001040
      %INCLUDE S00110;     /*  FORELDRELØSE BARN MAPSETTET    */        00001050
 %PAGE;                                                                 00001060
      %INCLUDE S00111;     /*  ETTERLATTE BARN MAPSETTET      */        00001070
 %PAGE;                                                                 00001080
      %INCLUDE S00112;     /*  FORSØRGINGSTILLEGG EKTF/BARN MAPSETTET */00001090
 %PAGE;                                                                 00001100
      %INCLUDE S00113;     /*  TILLEGG TIL GRUNNBLANKETT MAPSETTET   */ 00001110
 %PAGE;                                                                 00001120
      %INCLUDE S00114;     /*  ENDRINGSBLANKETT-1 MAPSETTET   */        00001130
 %PAGE;                                                                 00001140
      %INCLUDE S00115;     /*  ENDRINGSBLANKETT-2 MAPSETTET   */        00001150
 %PAGE;                                                                 00001160
      %INCLUDE S00116;     /*  OPPHØRSBLANKETT-1 MAPSETTET   */         00001170
 %PAGE;                                                                 00001180
      %INCLUDE S00117;     /*  OPPHØRSBLANKETT-2 MAPSETTET   */         00001190
 %PAGE;                                                                 00001200
      %INCLUDE S00118;     /*  STYRT AUTOHENDELSE - MAPSETTET   */      00001210
 %PAGE;                                                                 00001220
      %INCLUDE S00119;     /*  STYRT AFP          - MAPSETTET   */      00001230
 %PAGE;                                                                 00001240
      %INCLUDE S00183;     /*  UNGE UFØRE FØR 1967- MAPSETTET   */      00001250
 %PAGE;                                                                 00001260
      %INCLUDE S001I4;     /*  REG-INNTEKT    MAPSETTET   */            00001270
 %PAGE;                                                                 00001280
      %INCLUDE S001B0;     /*  MEDISINSK KODE  MAPSETTET  */            00001290
 %PAGE;                                                                 00001300
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */            00001310
 %PAGE;                                                                 00001320
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                    00001330
 %PAGE;                                                                 00001340
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */               00001350
 %PAGE;                                                                 00001360
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */              00001370
 %PAGE;                                                                 00001380
      %INCLUDE P0019959;   /*  OMRAADE FOR FUNKTAB      */              00001390
 %PAGE;                                                                 00001400
      %INCLUDE DFHBMSCA;   /*  MAP HJELPEFELT           */              00001410
 %PAGE;                                                                 00001420
   DCL                                                                  00001430
      (COMMAREA_PEKER,IDENT_PEKER,                                      00001440
      BMSMAPBR)      PTR;                                               00001450
   DCL                                                                  00001460
      IDENT_BIT BIT(32) BASED (IDENT_PEKER);                            00001470
   DCL                                                                  00001480
       W01_IDENT          CHAR(05),                                     00001490
       W01_CICSINFO       CHAR(16);                                     00001500
                                                                        00001510
   DCL                                                                  00001520
      (DATE,NULL,CSTG,ADDR,SUBSTR,STG) BUILTIN;                         00001530
   DCL W_TERMINAL   CHAR (4)       ;                                    00001540
   DCL DATO     PIC '(6)9' INIT (0);                                    00001550
   DCL                                                                  00001560
      HJ2_DATO_ÅMD   PIC '(6)9',                                        00001570
                                                                        00001580
      HJ2_ÅR DEF HJ2_DATO_ÅMD  POS (1) PIC '(2)9',                      00001590
                                                                        00001600
      HJ1_DATO_MÅ    PIC '(6)9',                                        00001610
                                                                        00001620
      HJ1_ÅR DEF HJ1_DATO_MÅ   POS (3) PIC '(2)9';                      00001630
                                                                        00001640
      DATO   = DATE;                                                    00001650
      W_TERMINAL    =  EIBTRMID;                                        00001660
                                                                        00001670
      SELECT(STYREKODE);                                                00001680
         WHEN('AP')                                                     00001690
            DO;                                                         00001700
               TRANSKODE = 'R050';                                      00001710
               ALLOCATE S001051O ;                                      00001720
               S001051O.REGDATOO   = DATO;                              00001730
               S001051O.TERMIDO    = W_TERMINAL;                        00001740
               S001051O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00001750
                                                                        00001760
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00001770
               /* ALDERSPENSJON                                */       00001780
               EXEC CICS SEND MAP('S001051') MAPSET('S001053')          00001790
                                             ERASE;                     00001800
            END;                                                        00001810
         WHEN('UP')                                                     00001820
            DO;                                                         00001830
               TRANSKODE = 'R060';                                      00001840
               ALLOCATE S001061O ;                                      00001850
               S001061O.REGDATOO   = DATO;                              00001860
               S001061O.TERMIDO    = W_TERMINAL;                        00001870
               S001061O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00001880
                                                                        00001890
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00001900
               /* UFØREPENSJON                                 */       00001910
               EXEC CICS SEND MAP('S001061') MAPSET('S001063')          00001920
                                             ERASE;                     00001930
            END;                                                        00001940
         WHEN('US')                                                     00001950
            DO;                                                         00001960
               IF SUBSTR(DIV_PARAM_OMR.CICS_NAVN,1,4) = 'HELP'  THEN    00001970
                  DO;                                                   00001980
                      TRANSKODE = 'R070';                               00001990
                      ALLOCATE S001071O ;                               00002000
                      S001071O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;   00002010
                                                                        00002020
                     /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */ 00002030
                     /* GRUNNSTØNAD / HJELPESTØNAD   */                 00002040
                       EXEC CICS SEND MAP('S001071') MAPSET('S001073')  00002050
                                             ERASE ;                    00002060
                  END;                                                  00002070
               ELSE                                                     00002080
                 DO;                                                    00002090
                     ALLOCATE S001014O;                                 00002100
                     S001014O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;    00002110
                     S001014O.MELDINGO =                                00002120
                        '"US" BLLANKET MÅ REGISTERE MED "HELP" KODE ';  00002130
                                                                        00002140
                     S001014O.STYRE_KODEO = STYREKODE;                  00002150
                     EXEC CICS SEND MAP('S001014')                      00002160
                                                 MAPSET('S001013')      00002170
                                                           ERASE;       00002180
                     TRANSKODE = 'R040';                                00002190
                                                                        00002200
                 END;                                                   00002210
            END;                                                        00002220
         WHEN('EP')                                                     00002230
            DO;                                                         00002240
               TRANSKODE = 'R080';                                      00002250
               ALLOCATE S001081O ;                                      00002260
               S001081O.REGDATOO   = DATO;                              00002270
               S001081O.TERMIDO    = W_TERMINAL;                        00002280
               S001081O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00002290
                                                                        00002300
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00002310
               /* ETTERLATT EKTEFELLE                                */ 00002320
               EXEC CICS SEND MAP('S001081') MAPSET('S001083')          00002330
                                             ERASE ;                    00002340
            END;                                                        00002350
         WHEN('EF')                                                     00002360
            DO;                                                         00002370
               TRANSKODE = 'R090';                                      00002380
               ALLOCATE S001091O ;                                      00002390
               S001091O.TERMIDO    = W_TERMINAL;                        00002400
               S001091O.REGDATOO   = DATO;                              00002410
               S001091O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00002420
                                                                        00002430
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00002440
               /* ETTERLATT FAMILIEPLEIER                            */ 00002450
               EXEC CICS SEND MAP('S001091') MAPSET('S001093')          00002460
                                             ERASE ;                    00002470
            END;                                                        00002480
         WHEN('FB')                                                     00002490
            DO;                                                         00002500
               TRANSKODE = 'R100';                                      00002510
               ALLOCATE S001101O ;                                      00002520
               S001101O.TERMIDO    = W_TERMINAL;                        00002530
               S001101O.REGDATOO   = DATO;                              00002540
               S001101O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00002550
                                                                        00002560
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00002570
               /* FORELDRELØSE BARN                                  */ 00002580
               EXEC CICS SEND MAP('S001101') MAPSET('S001103')          00002590
                                             ERASE ;                    00002600
            END;                                                        00002610
         WHEN('BP')                                                     00002620
            DO;                                                         00002630
               TRANSKODE = 'R110';                                      00002640
               ALLOCATE S001111O ;                                      00002650
               S001111O.TERMIDO    = W_TERMINAL;                        00002660
               S001111O.REGDATOO   = DATO;                              00002670
               S001111O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00002680
                                                                        00002690
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00002700
               /* ETTERLATTE BARN, EN AV FORELDRENE ER DØDE          */ 00002710
               EXEC CICS SEND MAP('S001111') MAPSET('S001113')          00002720
                                             ERASE ;                    00002730
            END;                                                        00002740
         WHEN('FT')                                                     00002750
            DO;                                                         00002760
               TRANSKODE = 'R120';                                      00002770
               ALLOCATE S001121O ;                                      00002780
               S001121O.TERMIDO    = W_TERMINAL;                        00002790
               S001121O.REGDATOO   = DATO;                              00002800
               S001121O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00002810
                                                                        00002820
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00002830
               /* FORSØRGNINGSTILLEGG                                */ 00002840
               EXEC CICS SEND MAP('S001121') MAPSET('S001123')          00002850
                                             ERASE ;                    00002860
            END;                                                        00002870
         WHEN('TG')                                                     00002880
            DO;                                                         00002890
               TRANSKODE = 'R130';                                      00002900
               ALLOCATE S001131O ;                                      00002910
               S001131O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00002920
                                                                        00002930
               /* SKRIVER REGISTRERINGSBILDE FOR TILLEGGS-           */ 00002940
               /* BLANKETTEN                                         */ 00002950
               EXEC CICS SEND MAP('S001131') MAPSET('S001133')          00002960
                                             ERASE ;                    00002970
            END;                                                        00002980
         WHEN('E1')                                                     00002990
            DO;                                                         00003000
               TRANSKODE = 'R140';                                      00003010
               ALLOCATE S001141O ;                                      00003020
               S001141O.TERMIDO    = W_TERMINAL;                        00003030
               S001141O.REGDATOO   = DATO;                              00003040
               S001141O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00003050
                                                                        00003060
               /* SKRIVER REGISTRERINGSBILDE FOR ENDRINGS-           */ 00003070
               /* BLANKETT-1                                         */ 00003080
               EXEC CICS SEND MAP('S001141') MAPSET('S001143')          00003090
                                             ERASE ;                    00003100
            END;                                                        00003110
         WHEN('E2')                                                     00003120
            DO;                                                         00003130
               TRANSKODE = 'R150';                                      00003140
               ALLOCATE S001151O ;                                      00003150
               S001151O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00003160
                                                                        00003170
               /* SKRIVER REGISTRERINGSBILDE FOR ENDRINGS-           */ 00003180
               /* BLANKETT-2                                         */ 00003190
               EXEC CICS SEND MAP('S001151') MAPSET('S001153')          00003200
                                             ERASE ;                    00003210
            END;                                                        00003220
         WHEN('O1')                                                     00003230
            DO;                                                         00003240
               TRANSKODE = 'R160';                                      00003250
               ALLOCATE S001161O ;                                      00003260
               S001161O.TERMIDO    = W_TERMINAL;                        00003270
               S001161O.REGDATOO   = DATO;                              00003280
               S001161O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00003290
                                                                        00003300
               /* SKRIVER REGISTRERINGSBILDE FOR OPPHØRS-            */ 00003310
               /* BLANKETT-1                                         */ 00003320
               EXEC CICS SEND MAP('S001161') MAPSET('S001163')          00003330
                                             ERASE ;                    00003340
            END;                                                        00003350
         WHEN('O2')                                                     00003360
            DO;                                                         00003370
               TRANSKODE = 'R170';                                      00003380
               ALLOCATE S001171O ;                                      00003390
               S001171O.TERMIDO    = W_TERMINAL;                        00003400
               S001171O.REGDATOO   = DATO;                              00003410
               S001171O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00003420
                                                                        00003430
               /* SKRIVER REGISTRERINGSBILDE FOR OPPHØRS-            */ 00003440
               /* BLANKETT-2                                         */ 00003450
               EXEC CICS SEND MAP('S001171') MAPSET('S001173')          00003460
                                             ERASE ;                    00003470
            END;                                                        00003480
         WHEN('AU')                                                     00003490
            DO;                                                         00003500
               TRANSKODE = 'R180';                                      00003510
               ALLOCATE S001181O ;                                      00003520
               S001181O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00003530
                                                                        00003540
               /* SKRIVER SKJERMBILDET FOR STYRT AUTOHENDELSE        */ 00003550
               EXEC CICS SEND MAP('S001181') MAPSET('S001183')          00003560
                                             ERASE ;                    00003570
            END;                                                        00003580
         WHEN('NI')                                                     00003590
            DO;                                                         00003600
               IF BRUKERID ^= 'T001' THEN                               00003610
                  DO;                                                   00003620
                     SUBSTR(W01_IDENT,5,1)     = ' ';                   00003630
                     SUBSTR(W01_IDENT,1,4)     = BRUKERID;              00003640
                     IF SUBSTR(DIV_PARAM_OMR.CICS_NAVN,1,4) =           00003650
                                                           'HELP'  THEN 00003660
                        SUBSTR(W01_IDENT,5,1)     = 'H';                00003670
                                                                        00003680
                     IDENT_PEKER        = ADDR(W01_IDENT);              00003690
                     EXEC CICS READ DATASET ('FUNKTAD')                 00003700
                                    INTO          ( FUNKTAD )           00003710
                                    RIDFLD        (IDENT_BIT);          00003720
                  END;                                                  00003730
               IF (BRUKERID                  = 'T001'  !                00003740
                   SUBSTR(STYRING,1,2) = 'NI'             )      &      00003750
                   SUBSTR(DIV_PARAM_OMR.CICS_IND,2) ^= 'A' THEN         00003760
                  DO;                                                   00003770
                                                                        00003780
               /* SKRIVER SKJERMBILDET FOR REGISTRERING AV NYE */       00003790
               /* INNTEKTER                                          */ 00003800
                                                                        00003810
                     TRANSKODE = 'R0I4';                                00003820
                     ALLOCATE S001I04O ;                                00003830
                     S001I04O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;    00003840
                                                                        00003850
                     EXEC CICS SEND MAP('S001I04')                      00003860
                                             MAPSET('S001I43')          00003870
                                             ERASE;                     00003880
                  END;                                                  00003890
               ELSE                                                     00003900
                  DO;                                                   00003910
                                                                        00003920
                                                                        00003930
                     IF TRANSKODE > 'R040' THEN                         00003940
                        DO;                                             00003950
                           EXEC CICS SEND MAP ('S001014') MAPSET        00003960
                              ('S001013') MAPONLY SET(BMSMAPBR);        00003970
                        END;                                            00003980
                     ALLOCATE S001014O;                                 00003990
                     S001014O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;    00004000
                     S001014O.MELDINGO = 'BRUKERID IKKE ' !!            00004010
                                     'AUTORISERT FOR "NI".';            00004020
                     S001014O.STYRE_KODEO = STYREKODE;                  00004030
                     EXEC CICS SEND MAP('S001014')                      00004040
                                                 MAPSET('S001013')      00004050
                                                           ERASE;       00004060
                     TRANSKODE = 'R040';                                00004070
                  END;                                                  00004080
            END;                                                        00004090
         WHEN('MK')                                                     00004100
            DO;                                                         00004110
               TRANSKODE                 =  'RB00'        ;             00004120
               ALLOCATE S001B01O                          ;             00004130
               S001B01O.CICS_INFOO =         DIV_PARAM_OMR.CICS_NAVN ;  00004140
                                                                        00004150
               /*----------------------------------------------*/       00004160
               /* SKRIVER REGISTRERINGSBILDE FOR                     */ 00004170
               /* MEDISINSK KODE                                     */ 00004180
               /*----------------------------------------------*/       00004190
                                                                        00004200
               EXEC CICS SEND MAP('S001B01') MAPSET('S001B03')          00004210
                                             ERASE ;                    00004220
            END;                                                        00004230
         WHEN('AF')                                                     00004240
            DO;                                                         00004250
               TRANSKODE                 =  'R190'        ;             00004260
               EXEC CICS LOAD PROGRAM('S001193');                       00004270
               ALLOCATE S001191O                          ;             00004280
               S001191O.TERMIDO    = W_TERMINAL;                        00004290
               S001191O.REGDATOO   = DATO;                              00004300
               S001191O.CICS_INFOO =         DIV_PARAM_OMR.CICS_NAVN ;  00004310
                                                                        00004320
               /*----------------------------------------------*/       00004330
               /* SKRIVER REGISTRERINGSBILDE FOR                     */ 00004340
               /* AFP                                                */ 00004350
               /*----------------------------------------------*/       00004360
               S001191O.TT_F67A             = DFHBMPRO;                 00004370
               S001191O.TT_E66_ÅA           = DFHBMPRO;                 00004380
               S001191O.TT_E66_MA           = DFHBMPRO;                 00004390
               S001191O.STATSBORGERA        = DFHBMPRO;                 00004400
               S001191O.BOSATTA             = DFHBMPRO;                 00004410
               S001191O.FRAVIK_FLYKTA = DFHBMPRO;                       00004420
               S001191O.OVERKOMP_UTLA = DFHBMPRO;                       00004430
               S001191O.FRAVIK_19_3A        = DFHBMPRO;                 00004440
                                                                        00004450
               EXEC CICS SEND MAP('S001191') MAPSET('S001193')          00004460
                                             ERASE ;                    00004470
            END;                                                        00004480
 /*UF*/        WHEN('UF')                                               00004490
            DO;                                                         00004500
               TRANSKODE                 =  'R183'        ;             00004510
               EXEC CICS LOAD PROGRAM('S001833');                       00004520
               ALLOCATE S001831O                          ;             00004530
               S001831O.TERMIDO    = W_TERMINAL;                        00004540
               S001831O.REGDATOO   = DATO;                              00004550
               S001831O.CICS_INFOO =         DIV_PARAM_OMR.CICS_NAVN ;  00004560
               S001831O.REGDATOO         =   DATO;                      00004570
               S001831O.TERMIDO          =   EIBTRMID;                  00004580
                                                                        00004590
               /*----------------------------------------------*/       00004600
               /* SKRIVER REGISTRERINGSBILDE FOR                     */ 00004610
               /* UNGE UFØRE FØR 1967                                */ 00004620
               /*----------------------------------------------*/       00004630
               EXEC CICS SEND MAP('S001831') MAPSET('S001833')          00004640
                                             ERASE ;                    00004650
            END;                                                        00004660
         OTHERWISE                                                      00004670
            DO;                                                         00004680
               TRANSKODE = 'R040';                                      00004690
               RETURN                  ;                                00004700
            END;                                                        00004710
      END;                                                              00004720
                                                                        00004730
      EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);            00004740
                                                                        00004750
                                                                        00004760
 END R00104;                                                            00004770
