 /*       SIST ENDRET 30/08-90 08.54.40 AV   DYBVIK                   */00000000
  /* **************************************************************** */00000010
  /*IDENTIFIKASJON:                                                   */00000020
  /*    R0015411 - HOVEDPROGRAM I PLI                                 */00000030
  /*    PROGRAMMERER: LUNDEBY FEBRUAR  1982                           */00000040
  /*                                                                  */00000050
  /*HENSIKT:                                                          */00000060
  /*    REPLACE ROOT  ,                                               */00000070
  /*              RECORD TIL DATABASEN                                */00000080
  /*                                                                  */00000090
  /*PROGRAMTILKNYTNING:                                               */00000100
  /*                                                                  */00000110
  /*BRUK:                                                             */00000120
  /*                                                                  */00000130
  /* **************************************************************** */00000140
                                                                        00000150
  R001540 :                                                             00000160
    PROC            (COMMAREA_PEKER)                                    00000170
           OPTIONS  (MAIN);                                             00000180
                                                                        00000190
                                                                        00000200
    %PAGE;                                                              00000210
    %INCLUDE P0019908;                            /* KOM_OMR        */  00000220
                                                                        00000230
    %PAGE;                                                              00000240
    %INCLUDE P0019910;                            /* STYRINGS_OMR   */  00000250
                                                                        00000260
    %PAGE;                                                              00000270
    %INCLUDE P0019912;                            /* DIV_PARAM_OMR  */  00000280
                                                                        00000290
                                                                        00000300
    %PAGE;                                                              00000310
       DCL 1  B02              BASED (B02_PEKER),                       00000320
    %INCLUDE P0019921;                            /* B02            */  00000330
                                                                        00000340
                                                                        00000350
    /* ************************************************************ */  00000360
    /*     INNEBYGDE PLI-FUNKSJONER                                 */  00000370
    /* ************************************************************ */  00000380
                                                                        00000390
     DCL                                                                00000400
        ( ADDR , LOW , CSTG , DATE )  BUILTIN;                          00000410
     DCL                                                                00000420
          PLITDLI ENTRY;                                                00000430
     DCL                                                                00000440
         COMMAREA_PEKER            POINTER;                             00000450
     DCL                                                                00000460
         W01_HJELPE_PTR            POINTER;                             00000470
                                                                        00000480
    /* ************************************************************ */  00000490
    /* HJELPE-OMR. FOR BUILTIN-FUNC.     :    DATE                  */  00000500
    /* ************************************************************ */  00000510
                                                                        00000520
     DCL    W01_DATE                         CHAR (6) INIT ('');        00000530
                                                                        00000540
     DCL    W01_ÅR  DEF     W01_DATE         PIC '99' ;                 00000550
                                                                        00000560
    /* ************************************************************ */  00000570
    /* OPPTELINGS- OG LOOP-PARAMETRE M.M                            */  00000580
    /* ************************************************************ */  00000590
                                                                        00000600
     DCL 1  W01_OPPTELL_OMR,                                            00000610
            2   W02_I              FIXED    BIN   (15)   INIT ( 0 ),    00000620
            2   W02_ÅR             FIXED    BIN   (15)   INIT ( 0 ),    00000630
            2   I                  FIXED    BIN   (15)   INIT ( 0 ),    00000640
            2   J                  FIXED    BIN   (15)   INIT ( 0 ),    00000650
            2   B                           CHAR  (1)    INIT (' ');    00000660
                                                                        00000670
    %PAGE;                                                              00000680
    /* ************************************************************ */  00000690
    /*                                                              */  00000700
    /* DLI CALL-PARAMETRE                                           */  00000710
    /*                                                              */  00000720
    /* ************************************************************ */  00000730
                                                                        00000740
     DCL 1  W01_DLI_PARAM,                                              00000750
            2   W02_DLI_FUNC       CHAR (4)       INIT ('    '),        00000760
            2   W02_GN             CHAR (4)       INIT ('GN  '),        00000770
            2   W02_GU             CHAR (4)       INIT ('GU  '),        00000780
            2   W02_GNP            CHAR (4)       INIT ('GNP '),        00000790
            2   W02_GHU            CHAR (4)       INIT ('GHU '),        00000800
            2   W02_DLET           CHAR (4)       INIT ('DLET'),        00000810
            2   W02_REPL           CHAR (4)       INIT ('REPL'),        00000820
            2   W02_ISRT           CHAR (4)       INIT ('ISRT'),        00000830
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT (3),             00000840
            2   W02_PARM_CT_4      FIXED BIN(31)  INIT (4),             00000850
            2   W02_PARM_CT_5      FIXED BIN(31)  INIT (5),             00000860
            2   W02_PARM_CT_6      FIXED BIN(31)  INIT (6),             00000870
            2   W02_PARM_CT_7      FIXED BIN(31)  INIT (7),             00000880
            2   W02_OUT_FELT       PIC '(11)9'    INIT (''),            00000890
            2   W02_DATO           PIC '(4)9'     INIT (''),            00000900
            2   W02_ST_OK          BIT (1)        INIT (''),            00000910
            2   NEI                BIT (1)        INIT ('0'B),          00000920
            2   PERSON_IKKE_DØD    BIT (1)        INIT ('0'B),          00000930
            2   W02_OUT2           CHAR (20)      INIT ('');            00000940
                                                                        00000950
     DCL    W01_IO                 CHAR (150)    INIT  ('');            00000960
     DCL    W01_HJELPE_IO          CHAR (150)    BASED (W01_HJELPE_PTR);00000970
                                                                        00000980
    %PAGE;                                                              00000990
    /* ************************************************************ */  00001000
    /*                                                              */  00001010
    /* DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */  00001020
    /*                                                              */  00001030
    /* ************************************************************ */  00001040
                                                                        00001050
     DCL    SSA_UQUAL                            CHAR (9) INIT ((9)' ');00001060
                                                                        00001070
     DCL 1  SSA1_RF0PERSN          UNALIGNED,                           00001080
            2    HDEL                            CHAR (17)  INIT        00001090
                 ('RF0PERSN(FNR     '),                                 00001100
            2    REL_OP                          CHAR (2)   INIT (' ='),00001110
            2    PKEY               FIXED        DEC  (11)  INIT ( 0 ), 00001120
            2    HP                              CHAR (1)   INIT (')'); 00001130
                                                                        00001140
                                                                        00001150
    /* ************************************************************ */  00001160
    /*                                                              */  00001170
    /* ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */  00001180
    /*                                                              */  00001190
    /* ************************************************************ */  00001200
                                                                        00001210
    %INCLUDE DLIUIB;                                                    00001220
                                                                        00001230
     DCL                                                                00001240
         UIB_RC_OK                 BIT (8)       INIT( 0 );             00001250
                                                                        00001260
                                                                        00001270
    /* ************************************************************ */  00001280
    /*                                                              */  00001290
    /* PCB- OG UIB-OMR .                                          */    00001300
    /*                                                              */  00001310
    /* ************************************************************ */  00001320
                                                                        00001330
     %INCLUDE   P0012002;                /* PCB_UIB_PEKER_OMR BASED */  00001340
                                                                        00001350
     DCL 1  RF1                     BASED (RF1_PCB_PEKER),              00001360
     %INCLUDE   P0012003;                /*    PCB                 */   00001370
                                                                        00001380
    %PAGE;                                                              00001390
    /* ************************************************************ */  00001400
    /*                                                              */  00001410
    /*        SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .     */  00001420
    /*       ---------------------------------------------------    */  00001430
    /*                                                              */  00001440
    /*                                                              */  00001450
    /*        INITIERER FORSKJELLIGE PARAMETRE .                    */  00001460
    /*                                                              */  00001470
    /* ************************************************************ */  00001480
                                                                        00001490
    W01_DATE                             =       DATE             ;     00001500
    PROGRAM_ID                           =      'R0015411'        ;     00001510
    UIBPTR                               =       UIB_PEKER        ;     00001520
                                                                        00001530
                                                                        00001540
    /* ************************************************************* */ 00001550
    /* OPPRYDDING AV ROOT                 .                          */ 00001560
    /* ************************************************************* */ 00001570
                                                                        00001580
                                                                        00001590
    DO   W02_I  =  1  TO  14;                                           00001600
                                                                        00001610
      IF B02.FNR  (W02_I)             >    0                       THEN 00001620
         DO;                                                            00001630
                                                                        00001640
            IF DIV_PARAM_OMR.KJØRINGS_TYPE  ^=   'S'      &             00001650
               STYRINGS_OMR .FUNKSJONSKODE  ^=   'E'               THEN 00001660
                                                                        00001670
               /* ************************************************** */ 00001680
               /*  NYE OPPL. INN I :  RF0PERSN  PINNTEKT  TILBERPO   */ 00001690
               /*  HVIS IKKE       : 'SATVIS KJØRING' ELLER FJERNING */ 00001700
               /* ************************************************** */ 00001710
               DO;                                                      00001720
                  SSA1_RF0PERSN.PKEY  =  B02.FNR(W02_I);                00001730
                                                                        00001740
                  CALL PLITDLI          (W02_PARM_CT_4,                 00001750
                                         W02_GHU,                       00001760
                                         RF1,                           00001770
                                         W01_IO,                        00001780
                                         SSA1_RF0PERSN);                00001790
                                                                        00001800
                  IF UIBFCTR        ^=   UIB_RC_OK         THEN         00001810
                     DO;                                                00001820
                        /* *************************************** */   00001830
                        /*   UAKSEPTABEL KODE FRA :    UIB         */   00001840
                        /* *************************************** */   00001850
  L100:                                                                 00001860
                        FEIL_MELD_NR   =   500;                         00001870
                        FEIL_VED_LABEL =  '100';                        00001880
                        GO TO    L999;                                  00001890
                     END;                                               00001900
                                                                        00001910
                                                                        00001920
                  W01_HJELPE_PTR    =   ADDR (B02.RF0PERSN (W02_I)) ;   00001930
                  W01_IO            =   W01_HJELPE_IO               ;   00001940
                                                                        00001950
                                                                        00001960
                  SELECT  (RF1.STATUS_KODE);                            00001970
                                                                        00001980
                     WHEN ('  ')                                        00001990
                        DO;                                             00002000
                           CALL PLITDLI           (W02_PARM_CT_3,       00002010
                                                   W02_REPL,            00002020
                                                   RF1,                 00002030
                                                   W01_IO);             00002040
                                                                        00002050
                           IF UIBFCTR          ^=  UIB_RC_OK     !      00002060
                              RF1.STATUS_KODE  ^=  '  '             THEN00002070
                              DO;                                       00002080
                                 /* ********************************* */00002090
                                 /* UAKSEPTABEL KODE FRA :  UIB       */00002100
                                 /*                 RF1.STATUS_KODE   */00002110
                                 /* ********************************* */00002120
  L110:                                                                 00002130
                                 FEIL_MELD_NR   =   500;                00002140
                                 FEIL_VED_LABEL =  '110';               00002150
                                 DB_STATUS_KODE =   RF1.STATUS_KODE;    00002160
                                 GO TO     L999;                        00002170
                              END;                                      00002180
                        END;                                            00002190
                                                                        00002200
                     WHEN ('GE')                                        00002210
                        DO;                                             00002220
                           /* ************************************** */ 00002230
                           /* DUMMY-ROT SKULLE VERT LAGET I R0013110 */ 00002240
                           /* ************************************** */ 00002250
  L120:                                                                 00002260
                           FEIL_MELD_NR         =    501;               00002270
                           FEIL_VED_LABEL       =   '120';              00002280
                           DB_STATUS_KODE       =    RF1.STATUS_KODE;   00002290
                           GO TO     L999;                              00002300
                        END;                                            00002310
                                                                        00002320
                     OTHERWISE                                          00002330
                        DO;                                             00002340
                           /* ************************************* */  00002350
                           /*  UGYLDIG STATUSKODE FRA DLI           */  00002360
                           /* ************************************* */  00002370
  L130:                                                                 00002380
                           FEIL_MELD_NR         =    500;               00002390
                           FEIL_VED_LABEL       =   '130';              00002400
                           DB_STATUS_KODE       =    RF1.STATUS_KODE;   00002410
                           GO TO     L999;                              00002420
                        END;                                            00002430
                  END;     /*     SELECT  :   RF1.STATUS_KODE     */    00002440
                                                                        00002450
                                                                        00002460
               END;   /* DIV_PARAM.KJØRIN                         */    00002470
                                                                        00002480
         END;               /*         B02.FNR  (W02_I)  > 0      */    00002490
                                                                        00002500
    END;               /*     DO 1 TO 14                          */    00002510
                                                                        00002520
  L999:                                                                 00002530
                                                                        00002540
    EXEC CICS RETURN;                                                   00002550
  END  R001540;                                                         00002560
