 /*       SIST ENDRET 28/07-98 12.50.21 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/07-98 12.27.12 AV   JDA7339                  */00000010
 /*       SIST ENDRET 10/03-98 12.42.25 AV   JDA7339                  */00000020
 /*       SIST ENDRET 10/03-98 12.39.00 AV   JDA7339                  */00000030
 /*       SIST ENDRET 16/09-97 10.24.17 AV   JDA7339                  */00000040
 /*       SIST ENDRET 15/09-97 13.31.08 AV   JDA7339                  */00000050
 /*       SIST ENDRET 29/08-97 12.28.13 AV   JDA7339                  */00000060
 /*       SIST ENDRET 28/08-97 08.52.50 AV   SPA7339                  */00000070
 /*       SIST ENDRET 02/12-96 15.12.10 AV   TSB0310                  */00000080
 /*       SIST ENDRET 18/07-96 09.20.46 AV   HLB0310                  */00000090
 /*       SIST ENDRET 14/05-96 15.13.49 AV   HLB0310                  */00000100
 /*       SIST ENDRET 18/04-96 09.41.40 AV   HLB0310                  */00000110
 /*       SIST ENDRET 01/04-96 14.50.29 AV   HLB0310                  */00000120
 /*       SIST ENDRET 14/11-95 13.38.47 AV   JDA0310                  */00000130
 /*       SIST ENDRET 12/10-95 14.02.55 AV   JDA0310                  */00000140
 /*       SIST ENDRET 21/06-95 14.24.29 AV   JDA0310                  */00000150
 /*       SIST ENDRET 24/03-95 11.09.58 AV   HLB0310                  */00000160
 /*       SIST ENDRET 10/03-95 14.34.37 AV   HLB0310                  */00000170
 /*       SIST ENDRET 21/09-94 15.20.51 AV   TRUDE                    */00000180
 /*       SIST ENDRET 09/09-94 11.15.26 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 02/09-94 11.34.33 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 25/08-94 10.11.37 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 08/08-94 13.26.26 AV   DYBVIK                   */00000220
 /*       SIST ENDRET 08/07-94 09.42.37 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 24/05-94 14.22.09 AV   DYBVIK                   */00000240
 /*       SIST ENDRET 26/04-94 15.08.37 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 06/04-94 14.54.12 AV   DYBVIK                   */00000260
 /*       SIST ENDRET 28/02-94 14.45.58 AV   DYBVIK                   */00000270
 /*       SIST ENDRET 28/02-94 12.19.43 AV   DYBVIK                   */00000280
 /*       SIST ENDRET 25/02-94 12.26.09 AV   HERMAN                   */00000290
 /*       SIST ENDRET 08/12-92 14.52.47 AV   DYBVIK                   */00000300
 /*       SIST ENDRET 21/10-92 09.25.27 AV   TRUDE                    */00000310
 /*       SIST ENDRET 20/10-92 15.27.32 AV   TRUDE                    */00000320
 /*       SIST ENDRET 02/10-92 13.30.46 AV   DYBVIK                   */00000330
 /*       SIST ENDRET 28/07-92 10.06.59 AV   DYBVIK                   */00000340
 /*       SIST ENDRET 12/06-92 13.53.09 AV   TRUDE                    */00000350
 /*       SIST ENDRET 10/04-92 12.51.44 AV   DYBVIK                   */00000360
 /*       SIST ENDRET 04/03-92 16.00.33 AV   HERMAN                   */00000370
 /*       SIST ENDRET 03/03-92 09.52.37 AV   DYBVIK                   */00000380
 /*       SIST ENDRET 05/02-92 14.39.37 AV   HERMAN                   */00000390
 /*       SIST ENDRET 13/12-91 12.22.33 AV   DYBVIK                   */00000400
 /*       SIST ENDRET 24/06-91 13.24.57 AV   DYBVIK                   */00000410
 /*       SIST ENDRET 23/04-91 10.55.58 AV   DYBVIK                   */00000420
 /*       SIST ENDRET 03/04-91 17.32.40 AV   HERMAN                   */00000430
 /*       SIST ENDRET 06/03-91 11.52.26 AV   DYBVIK                   */00000440
 /*       SIST ENDRET 11/12-90 13.22.15 AV   DYBVIK                   */00000450
 /*       SIST ENDRET 16/10-90 12.42.27 AV   DYBVIK                   */00000460
 /*       SIST ENDRET 06/09-90 14.30.45 AV   DYBVIK                   */00000470
 /*       SIST ENDRET 20/07-90 13.30.00 AV   HERMAN                   */00000480
 /*       SIST ENDRET 19/07-90 13.20.29 AV   HERMAN                   */00000490
 /*       SIST ENDRET 11/07-90 14.52.38 AV   DYBVIK                   */00000500
 /*       SIST ENDRET 05/07-90 10.20.52 AV   DYBVIK                   */00000510
 /*       SIST ENDRET 05/07-90 09.24.43 AV   DYBVIK                   */00000520
 /*       SIST ENDRET 14/03-90 09.49.10 AV   DYBVIK                   */00000530
 /*       SIST ENDRET 25/01-90 14.07.47 AV   DYBVIK                   */00000540
 /*       SIST ENDRET 25/01-90 13.02.31 AV   DYBVIK                   */00000550
 /*       SIST ENDRET 08/01-90 09.46.39 AV   DYBVIK                   */00000560
 /*-------------------------------------------------------------------*/00000570
 /*       SIST ENDRET 04/01-90          AV   TUYEN                    */00000580
 /* ENDRINGER GJELDER FOR DE PERSONNER SOM HAR AVTJENT VERNEPLIKT     */00000590
 /* I 2 ÅR (ELLER MER) I REKKEFØLGE.                                  */00000600
 /* FOR DISSE PERSONNER ER GARANTI I VERNEPLIKTSÅR STØRST AV:         */00000610
 /*       -  2 POENG (VERNEPLIKTSPOENGGARANTI)                        */00000620
 /*       -  STØRST AV INNT_POENG FØR VERNEPL_ÅR OG                   */00000630
 /*                 VERNEPL_POENG FØR VERNEPL_ÅR                      */00000640
 /*       -  INNT_POENG I VERNEPL_ÅR                                  */00000650
 /*-------------------------------------------------------------------*/00000660
 /*                                                                   */00000670
 /*IDENTIFIKASJON:                                                    */00000680
 /*    R0014152 - SUBRUTINE I PLI                                     */00000690
 /*    PROGRAMMERER: PER F. BERGESTAD, JUNI 1982                      */00000700
 /*HENSIKT:                                                           */00000710
 /*    RUTINEN STYRER BEHANDLINGEN FOR UTVELGING AV POENG FOR HVERT   */00000720
 /*    ENKELT ÅR SOM SKAL VÆRE GRUNNLAG FOR BEREGNING AV SPT, OPT     */00000730
 /*    OG PÅ.                                                         */00000740
 /*                                                                   */00000750
 /*    OPPDATERER UFØRHIST.BUP  (FRA TAB.BUP_FPP(UFØR_ÅR))            */00000760
 /* ENDRET I OKTOBER 92 - HL : NY POENGBEREGNING                      */00000770
 /*                                                                   */00000780
 /* INKLUDERES I 4141 BE_SPT                                          */00000790
 /*              B003 BESPT                                           */00000800
 /* ***************************************************************** */00000810
                                                                        00000820
  BEREGN_POENGREKKE:                                                    00000830
    PROC(IND,W_FNR);                                                    00000840
                                                                        00000850
    DCL                                                                 00000860
      (I,                                                               00000870
       X,                                                               00000880
       UFØR_ÅR,                                                         00000890
       FØRST_REG,                                                       00000900
       SIST_REG,                                                        00000910
       IND,                                                             00000920
       IND_EK                                                           00000930
      )             FIXED BIN(15),                                      00000940
       MAX          BUILTIN      ;                                      00000950
                                                                        00000960
    DCL W_FNR            PIC'(11)9';                                    00000970
    DCL 1 W_FNR_R DEF W_FNR,                                            00000980
          2 DAG         PIC'99',                                        00000990
          2 MND         PIC'99',                                        00001000
          2 ÅR          PIC'99',                                        00001010
          2 ÅRHUNDRE    PIC'9',                                         00001020
          2 RESTEN      PIC'9999';                                      00001030
                                                                        00001040
    DCL                                                                 00001050
       UTTAKSDATO_Å  FIXED DEC(3) INIT(0),                              00001060
       TILLEGGS_ÅR  FIXED DEC(3) INIT(0),                               00001070
       STOPP_ÅR     FIXED DEC(3) INIT(0),                               00001080
       SLUTT_ÅR     FIXED DEC(3) INIT(0),                               00001090
       FYLLER_67_ÅR FIXED DEC(3) INIT(0),                               00001100
       FYLLER_69_ÅR FIXED DEC(3) INIT(0),                               00001110
       TEST_F2      PIC '999999',                                       00001120
       W_PI         FIXED DEC(9) INIT(0),                               00001130
       VERNEPL_ÅR   FIXED DEC(3) INIT(0),                               00001140
       ALDER_PÅ_VIRK_DATO                         PIC'(4)9' INIT(0),    00001150
       ALDER_ÅR DEF ALDER_PÅ_VIRK_DATO POS(1)     PIC'(2)9';            00001160
  DCL ALDER_VED_DØD          PIC       'S99999';                        00001170
  DCL ALDER_UF               PIC       'S99999';                        00001180
  DCL UFØR_DATO_ÅM           PIC       '9999'   INIT(0);                00001190
  DCL DØDSDATO_ÅM            PIC       '9999'   INIT(0);                00001200
  DCL FIXED_DEC5             FIXED DEC  (5)     INIT(0);                00001210
  DCL HJELPEDATO_ÅM          PIC       '9999'   INIT(0);                00001220
  DCL GARANTI_FOR_DØD        FIXED DEC (3,2)    INIT(0);                00001230
                                                                        00001240
  DCL SØTTI                  FIXED DEC  (5)     INIT(7000);             00001250
  DCL BUP_MAX                FIXED DEC  (3)     INIT(0);                00001260
  DCL START_UFPERIODE        FIXED DEC  (3)     INIT(0);  /*HL*/        00001270
  DCL SUM                    FIXED DEC (7,4)    INIT(0);                00001280
  DCL SUM92                  FIXED DEC (7,4)    INIT(0);                00001290
  DCL ANTALL                 FIXED DEC (3)      INIT(0);                00001300
  DCL TS           FIXED DEC (3,2) INIT (0);                            00001310
     DCL HLTEST3   FIXED DEC (5,4) INIT (0);                            00001320
     DCL HLTEST4   FIXED DEC (3);                                       00001330
  DCL GARANTI_KODE           CHAR (1) INIT (' ');  /*9708 HL*/          00001340
                                                                        00001350
 %PAGE;                                                                 00001360
                                                                        00001370
  FØRST_REG = 1;                                                        00001380
  SIST_REG  = 1;                                                        00001390
                                                                        00001400
 /*FLYTTET HIT 8.12.89 HL : */                                          00001410
 /*ENDRET 2.3.89 HL*/                                                   00001420
                                                                        00001430
  HJELPEDATO_ÅM = B02.VIRK_DATO_ÅM(IND);                                00001440
  FIXED_DEC5 = F_ALDER(W_FNR,F_SNU_DATO(HJELPEDATO_ÅM));                00001450
  ALDER_PÅ_VIRK_DATO = FIXED_DEC5;                                      00001460
                                                                        00001470
  IF HJELPEDATO_ÅM > 9100       THEN                                    00001480
     SØTTI = 7001;  /*ENDRET ALDERSGRENSE - HL */                       00001490
                                                                        00001500
 /*  ALDER_PÅ_VIRK_DATO = B02.VIRK_DATO_ÅM(IND) - ((                    00001510
                          W_FNR_R.ÅR * 100) + W_FNR_R.MND);    */       00001520
                                                                        00001530
 /*8.12.89 HL*/                                                         00001540
                                                                        00001550
                                                                        00001560
  DO I = 1 TO 7 WHILE(B02.UFT_ÅM(IND,I) > 0);                           00001570
                                                                        00001580
     SIST_REG = I;                                                      00001590
                                                                        00001600
  END;                                                                  00001610
                                                                        00001620
  IF B02.UFT_ÅM(IND,FØRST_REG) > 0 THEN                                 00001630
                                                                        00001640
      /*CALL LEGG_UFØREHIST_I_TAB(IND,W_FNR_R.ÅR,TAB);   4161 */        00001650
     CALL LEGG_UFØREHIST_I_TAB(IND,W_FNR_R.ÅR);  /* 4161  SP 21.4.91 */ 00001660
                                                                        00001670
  IF B02.YUFT_ÅM(IND,1) > 0 THEN                    /*YS*/              00001680
                                                                        00001690
   /* ENDERET AV SATISH  21.9.91 TAB                            */      00001700
   /*CALL LEGG_YRKEHIST_I_TAB(IND,W_FNR_R.ÅR,TAB);     YS* 4166 */      00001710
     CALL LEGG_YRKEHIST_I_TAB(IND,W_FNR_R.ÅR);   /* YS* 4166  */        00001720
                                                                        00001730
  IF  B02.PENSJONSTYPE1(IND)     = 'K'        !       /*AFP*/           00001740
                                                                        00001750
 /*TILLEGG 8.12.89 HL :*/                                               00001760
                                                                        00001770
 /*   (ALDER_ÅR <  70       &     HL : */                               00001780
 /*   (ALDER_PÅ_VIRK_DATO <  SØTTI    & **** TAS BORT 100492 TS  */     00001790
                                                                        00001800
 /*HIT 8.12.89 HL */                                                    00001810
                                                                        00001820
       B02.KONV_P_KODE  (IND)     = 'K'    !                            00001830
       B02.KONV_P_KODE  (IND)     = 'O'      THEN                       00001840
                                                                        00001850
  DO;                                                    /*AFP*/        00001860
     FYLLER_67_ÅR = W_FNR_R.ÅR + 67;                     /*AFP*/        00001870
     UTTAKSDATO_Å = B02.UTTAKSDATO_ÅM(IND) / 100;        /*AFP*/        00001880
                                                                        00001890
                                                                        00001900
 /*  IF UTTAKSDATO_Å < FYLLER_67_ÅR   THEN          */                  00001910
 /*     CALL LEGG_AFPHIST_I_TAB(IND,W_FNR_R.ÅR,TAB);  4168-AFP*/        00001920
        CALL LEGG_AFPHIST_I_TAB(IND,W_FNR_R.ÅR);    /*4168-AFP*/        00001930
 /*    ENDRET AV SATISH     21.9.91 TAB                       */        00001940
  END;                                                                  00001950
                                                                        00001960
          /* --------------------------------------------------------*/ 00001970
          /* TAB SKAL OPPDATERES MED OMSORGSKODE, REGEL FRA 92       */ 00001980
          /* 'J' FOR BARN 'K', 'L' FOR ANDRE . TRUDE 010394          */ 00001990
          /* --------------------------------------------------------*/ 00002000
                                                                        00002010
   DO  I = 92 TO (DAGENS_DATO.ÅR - 1);                                  00002020
     IF  B01.PI_KODE(IND,I) ^= ' '  THEN  /* TATT BORT IND + 12*/       00002030
        DO;                                                             00002040
         TAB.OMSORG_KODE(I)       = B01.PI_KODE(IND,I);                 00002050
        END;                                                            00002060
   END;                                                                 00002070
          /*OMSORGSKODE HIT */                                          00002080
                                                                        00002090
  IF B02.DØDSDATO_ÅMD(IND) > 0 &                                        00002100
     B02.PENSJONSTYPE1(IND) = 'D' THEN                                  00002110
                                                                        00002120
 /* ENDRET 17.3.86 HL - DIVERSE FEILRAPPORTER        */                 00002130
                                                                        00002140
                                                                        00002150
 /* STOPP_ÅR ER DET SISTE ÅR FOR EN UFØREPERIODE, FØR PERSONEN */       00002160
 /*          GÅR OVER PÅ ALDERSPENSJON (OM HAN HADDE LEVET)    */       00002170
                                                                        00002180
   DO;                                                                  00002190
                                                                        00002200
        IF W_FNR_R.ÅRHUNDRE > 4                    THEN                 00002210
                                                                        00002220
           DO;                                                          00002230
                                                                        00002240
              FYLLER_67_ÅR      =  W_FNR_R.ÅR + 67 - 100;               00002250
              FYLLER_69_ÅR      =  W_FNR_R.ÅR + 69 - 100;               00002260
                                                                        00002270
           END;                                                         00002280
                                                                        00002290
        ELSE                                                            00002300
                                                                        00002310
           DO;                                                          00002320
                                                                        00002330
              FYLLER_67_ÅR      =  W_FNR_R.ÅR + 67;                     00002340
              FYLLER_69_ÅR      =  W_FNR_R.ÅR + 69;                     00002350
                                                                        00002360
           END;                                                         00002370
                                                                        00002380
        IF DØDSDATO.ÅR       <  73                 THEN                 00002390
                                                                        00002400
           STOPP_ÅR          =  FYLLER_69_ÅR;                           00002410
                                                                        00002420
        ELSE                                                            00002430
                                                                        00002440
           IF W_FNR_R.ÅR     =  00            !                         00002450
              W_FNR_R.ÅR     =  01            !                         00002460
              W_FNR_R.ÅR     =  02                 THEN                 00002470
                                                                        00002480
              STOPP_ÅR       =  FYLLER_69_ÅR;                           00002490
                                                                        00002500
        ELSE                                                            00002510
                                                                        00002520
              IF W_FNR_R.ÅR     =  03            !                      00002530
                 W_FNR_R.ÅR     =  04            !                      00002540
                 W_FNR_R.ÅR     =  05                 THEN              00002550
                                                                        00002560
                 STOPP_ÅR       =  72;                                  00002570
                                                                        00002580
        ELSE                                                            00002590
                                                                        00002600
                 IF W_FNR_R.ÅRHUNDRE > 4      THEN                      00002610
                                                                        00002620
                    STOPP_ÅR    =  FYLLER_69_ÅR;                        00002630
                                                                        00002640
        ELSE                                                            00002650
                                                                        00002660
                    STOPP_ÅR    =  FYLLER_67_ÅR - 1;                    00002670
                                                                        00002680
                                                                        00002690
 /* HIT 17.3.86 HL                                           */         00002700
                                                                        00002710
        IF DØDSDATO.ÅR   <= STOPP_ÅR   THEN                             00002720
                                                                        00002730
           DO;                                                          00002740
              TAB.UFØR_START_MND(DØDSDATO.ÅR) = DØDSDATO.MND;           00002750
              TAB.UFØR_PERIODE(DØDSDATO.ÅR)   = 'D';                    00002760
                                                                        00002770
              IF B02.STATUS.VILKÅR_8_4_3A(IND) = 'J'      THEN          00002780
                 TAB.UFØR_KRIT(DØDSDATO.ÅR)   = 3;                      00002790
                                                                        00002800
 /*LOVENDRING 1.1.91 HL : */                                            00002810
 /*FJERNET KOMMENTAR PÅ - 1 TRUDE, 020192. STM. UNDER KOMM. BORT*/      00002820
                                                                        00002830
              IF DØDSDATO.ÅR > 90     THEN                              00002840
                DO;                                                     00002850
                 IF B02.BOSATT(IND) = 0  THEN                           00002860
                  DO;                                                   00002870
                     BUP_MAX = DØDSDATO.ÅR +                            00002880
                              ((B02.TT_FRAMT(IND) + 6) / 12);           00002890
                                                        /* 4/5 REGEL*/  00002900
                     IF  BUP_MAX <  FYLLER_67_ÅR -1 THEN /*DVS TT_RED*/ 00002910
                         BUP_MAX = BUP_MAX - 1;         /*TS 050894*/   00002920
                                                /*67_ÅR-1 TS 210994*/   00002930
                     TAB.SISTE_BUP_ÅR(BUP_MAX) = 'J';                   00002940
                  END;                                                  00002950
                 ELSE   /*BLE FEIL FOR NORSK BOSATT. 201092 TRUDE*/     00002960
                  DO;                                                   00002970
                     BUP_MAX = DØDSDATO.ÅR +                            00002980
                              ((B02.TT_FRAMT(IND) + 6) / 12) - 1;       00002990
                     TAB.SISTE_BUP_ÅR(BUP_MAX) = 'J';                   00003000
                  END;                                                  00003010
                  IF BUP_MAX < STOPP_ÅR   THEN      /*0395 HL*/         00003020
                     STOPP_ÅR = BUP_MAX;                                00003030
                END;                                                    00003040
                                                                        00003050
           END;                                                         00003060
                                                                        00003070
        ELSE                                                            00003080
                                                                        00003090
           TAB.UFØR_PERIODE(STOPP_ÅR + 1)   = 'A';                      00003100
                                                                        00003110
        IF DØDSDATO.ÅR < STOPP_ÅR THEN                                  00003120
                                                                        00003130
           DO I = DØDSDATO.ÅR + 1 TO STOPP_ÅR;                          00003140
                                                                        00003150
              TAB.UFØR_PERIODE(I) = 'F';                                00003160
                                                                        00003170
           END;                                                         00003180
                                                                        00003190
 /*TILLEGG 2.3.90 HL - GARANTI TIL UNGE UFØRES ETTERLATTE */            00003200
                                                                        00003210
  IF B02.BUP_GAR_KODE(IND,1) = 'D'  THEN /*VENTER PÅ RETT*/             00003220
     DO;                                                                00003230
        UFØR_DATO_ÅM = B02.UFØRHIST.UFT_ÅM(IND,1);                      00003240
        FIXED_DEC5   = F_ALDER(W_FNR,F_SNU_DATO(UFØR_DATO_ÅM));         00003250
        ALDER_UF     = FIXED_DEC5;                                      00003260
        CALL UNGE_DØDE_B_E(VIRK_LOV92_ÅM,W_FNR_R.ÅR,ALDER_UF,           00003270
                      GARANTI_FOR_DØD,GARANTI_KODE); /*4159*/           00003280
        IF GARANTI_KODE ^= ' '           THEN                           00003290
           DO K = 1 TO 7 WHILE(B02.UFØRHIST.UFT_ÅM(IND,K) > 0);         00003300
              B02.BUP_GAR_KODE(IND,K) = GARANTI_KODE;                   00003310
           END;                                                         00003320
     END;                                                               00003330
  ELSE                                                                  00003340
     DO;                                                                00003350
        DØDSDATO_ÅM   = B02.DØDSDATO_ÅMD(IND) / 100;                    00003360
        FIXED_DEC5    = F_ALDER(W_FNR,F_SNU_DATO(DØDSDATO_ÅM));         00003370
        ALDER_VED_DØD = FIXED_DEC5;                                     00003380
                                                                        00003390
        IF ALDER_VED_DØD < 2601         THEN                            00003400
           CALL UNGE_DØDE_B_E(VIRK_LOV92_ÅM,W_FNR_R.ÅR,ALDER_VED_DØD,   00003410
                      GARANTI_FOR_DØD,GARANTI_KODE); /*4159*/           00003420
     END;                                                               00003430
                                                                        00003440
  /*      ERSTATTES AV CALL TIL UNGE_DØDE_E :                           00003450
  IF B02.VIRK_DATO_ÅM(IND_EK) > 8104           THEN                     00003460
     DO;                                                                00003470
        IF ALDER_VED_DØD  < 2001             !                          00003480
           B02.BUP_GAR_KODE(IND,1) = 'B'      THEN                      00003490
           DO;                                                          00003500
              IF VIRK_LOV92_ÅM        < 8805        THEN                00003510
                 IF VIRK_LOV92_ÅM       < 8705     THEN                 00003520
                    GARANTI_FOR_DØD = 2.00;                             00003530
                                                                        00003540
                 ELSE                                                   00003550
                    GARANTI_FOR_DØD = 2.50;                             00003560
                                                                        00003570
              ELSE                                                      00003580
                 IF VIRK_LOV92_ÅM     <   9105     THEN                 00003590
                    GARANTI_FOR_DØD = 3.00;                             00003600
                 ELSE                                                   00003610
                    GARANTI_FOR_DØD = 3.30;                             00003620
           END;                                                         00003630
        ELSE                                                            00003640
        IF ALDER_VED_DØD  < 2101            THEN                        00003650
           DO;                                                          00003660
              IF VIRK_LOV92_ÅM      < 8805     THEN                     00003670
                 IF VIRK_LOV92_ÅM      < 8705  THEN                     00003680
                    IF VIRK_LOV92_ÅM      < 8401  THEN;                 00003690
                    ELSE                                                00003700
                       GARANTI_FOR_DØD = 2.00;                          00003710
                                                                        00003720
                 ELSE                                                   00003730
                    GARANTI_FOR_DØD = 2.50;                             00003740
                                                                        00003750
              ELSE                                                      00003760
                 IF VIRK_LOV92_ÅM      < 9105     THEN                  00003770
                    GARANTI_FOR_DØD = 3.00;                             00003780
                 ELSE                                                   00003790
                    GARANTI_FOR_DØD = 3.30;                             00003800
                                                                        00003810
           END;                                                         00003820
        ELSE                                                            00003830
        IF ALDER_VED_DØD  < 2201             THEN                       00003840
          DO;                                                           00003850
           IF VIRK_LOV92_ÅM      > 8812  THEN                           00003860
             IF VIRK_LOV92_ÅM      < 9105  THEN                         00003870
                    GARANTI_FOR_DØD = 3.00;                             00003880
             ELSE                                                       00003890
                    GARANTI_FOR_DØD = 3.30;                             00003900
          END;                                                          00003910
                                                                        00003920
        ELSE                                                            00003930
        IF ALDER_VED_DØD  < 2401    &                                   00003940
           VIRK_LOV92_ÅM  > 9204  THEN                                  00003950
          DO;                                                           00003960
           GARANTI_FOR_DØD = 3.30;                                      00003970
                                                                        00003980
          END;                                                          00003990
 ************************** JF. CALL TIL UNGE_DØDE_E 9708 HL*/          00004000
                                                                        00004010
        /* IFLG. HAARSTAD SKAL IKKE UTL. BOSATT I UTL. HA GARANTI*/     00004020
        /* TRUDE, 08.12.92 */                                           00004030
        IF B02.BOSATT(IND)  > 0 &                                       00004040
           B02.STATSBORGER(IND) > 0 THEN                                00004050
           DO;                                                          00004060
              GARANTI_FOR_DØD  = 0;                                     00004070
              GARANTI_KODE = ' ';                                       00004080
           END;                                                         00004090
                                                                        00004100
        IF GARANTI_FOR_DØD > 0               THEN                       00004110
              DO I = DØDSDATO.ÅR TO STOPP_ÅR;                           00004120
                 TAB.POENGGARANTI(I)      = GARANTI_FOR_DØD;            00004130
                 TAB.POENGGARANTI_KODE(I) = 'B';                        00004140
              END;                                                      00004150
        IF GARANTI_KODE = 'E'                  THEN                     00004160
           B02.TP_GAR_KODE(IND)        = 'E';                           00004170
                                                                        00004180
 /*  END;     END VIRK_DATO > 8104 */                                   00004190
                                                                        00004200
                                                                        00004210
 /*HIT 2.3.90 HL */                                                     00004220
                                                                        00004230
     END;  /*END PT1 = 'D' */                                           00004240
                                                                        00004250
 /*                                                                   */00004260
 /*  INNTEKTER I ÅRENE FØR 1967 ER BARE AKTUELLE NÅR UFØRETIDSPUNKTET */00004270
 /*  ELLER DØDSTIDSPUNKTET ER FØR 1971.                               */00004280
 /*                                                                   */00004290
                                                                        00004300
 /* 6.3.86 HL : LINJENE NEDENFOR ER FJERNET. SE FEILRAPP 40/88    */    00004310
                                                                        00004320
 /* IF (B02.UFT_ÅM(IND,SIST_REG)             >  0     &           */    00004330
 /*                B02.UFT_ÅM(IND,FØRST_REG)  <  7101) !          */    00004340
 /*                (B02.DØDSDATO_ÅMD(IND)     >  0     &          */    00004350
 /*                B02.DØDSDATO_ÅMD(IND)      <  710101) THEN     */    00004360
 /*                CALL LEGG_INNT_FØR_67_I_TAB(IND,TAB);          */    00004370
 /*                                                               */    00004380
 /*                                                               */    00004390
 /*  IF FEIL_MELD_NR > 0  THEN                                    */    00004400
 /*                                                               */    00004410
 /*     GO TO RETUR;                                              */    00004420
 /*                                                               */    00004430
 /*  ELSE                                                         */    00004440
 /*                                                               */    00004450
 /*     PROGRAM_ID = 'R0014141';                                  */    00004460
 /*                                                               */    00004470
 /* HIT 6.3.86 HL                                                 */    00004480
                                                                        00004490
  IF W_FNR_R.ÅR                <  04       !                            00004500
     W_FNR_R.ÅRHUNDRE          >  4        !                            00004510
     (B02.UFT_ÅM(IND,SIST_REG) >  0     &                               00004520
      B02.UFT_ÅM(IND,SIST_REG) <  7301)    !                            00004530
     (B02.DØDSDATO_ÅMD(IND)    >  0     &                               00004540
     B02.DØDSDATO_ÅMD(IND)     <  730101)        THEN                   00004550
                                                                        00004560
     SLUTT_ÅR = W_FNR_R.ÅR + 69;                                        00004570
                                                                        00004580
  ELSE                                                                  00004590
                                                                        00004600
     IF W_FNR_R.ÅR = 04 THEN                                            00004610
        SLUTT_ÅR = W_FNR_R.ÅR + 68;                                     00004620
                                                                        00004630
     ELSE                                                               00004640
                                                                        00004650
        IF W_FNR_R.ÅR = 05 THEN                                         00004660
           SLUTT_ÅR = W_FNR_R.ÅR + 67;                                  00004670
                                                                        00004680
        ELSE                                                            00004690
                                                                        00004700
           SLUTT_ÅR = W_FNR_R.ÅR + 66;                                  00004710
                                                                        00004720
                                                                        00004730
  IF W_FNR_R.ÅRHUNDRE > 4      THEN                                     00004740
     SLUTT_ÅR = SLUTT_ÅR - 100;                                         00004750
                                                                        00004760
  DO I = 67 TO (DAGENS_DATO.ÅR - 1);                                    00004770
                                                                        00004780
     IF B02.PI(IND,I) > 0                &                              00004790
        ^(TAB.UFØR_PERIODE(I) = 'L' ! TAB.UFØR_PERIODE(I) = 'F') THEN   00004800
                                                                        00004810
  /* 'L' = LØPENDE UFØREÅR.  'F' = FREMTIDIG PENSJONSPOENG      */      00004820
                                                                        00004830
        DO;                                                             00004840
           W_PI              = B02.PI(IND,I) * 100;                     00004850
                                                                        00004860
           IF TAB.UFØR_PERIODE(I) = 'M'         THEN                    00004870
                                                                        00004880
  /* 'M' = MELLOMLIGGENDE UFØREÅR                               */      00004890
                                                                        00004900
              DO;                                                       00004910
                 TAB.INNT_POENG(I) =                                    00004920
 /* 4163 */                    F_INNTEKT_POENG(W_PI,I,GV(I),            00004930
                                               TAB.UFØR_GRAD(I));       00004940
                 TAB.INNT_POENG_LOV92(I) =                              00004950
 /* 4172 */                    F_INNTEKT_POENG_LOV92(W_PI,I,GV(I),      00004960
                                               TAB.UFØR_GRAD(I));       00004970
                 IF TAB.INNT_POENG(I) > 0 &                             00004980
                                      TAB.UFØR_GRAD(I) > 0 THEN         00004990
 /*                                                                   */00005000
 /*       (VED UTREGNING AV POENGET ER DET TATT HENSYN TIL UFØREGRAD) */00005010
 /*                                                                   */00005020
 /*TILBAKE 0596 HL*/   IF TAB.UFØR_KRIT(I)  = 6          THEN           00005030
 /*JD 7.92             IF B02.PENSJONSTYPE1(IND) = 'K'   THEN */        00005040
                          TAB.POENG_KODE(I) = 'U57';     /*KODE 'D' */  00005050
                       ELSE                                             00005060
                          TAB.POENG_KODE(I) = 'U59';       /*'F'*/      00005070
                                                                        00005080
              END;                                                      00005090
                                                                        00005100
           ELSE                                                         00005110
                                                                        00005120
              DO;                                                       00005130
                 TAB.INNT_POENG(I) =                                    00005140
 /* 4163 */                       F_INNTEKT_POENG(W_PI,I,GV(I),0);      00005150
                 TAB.INNT_POENG_LOV92(I) =                              00005160
 /* 4172 */                    F_INNTEKT_POENG_LOV92(W_PI,I,GV(I),0);   00005170
              END;                                                      00005180
                                                                        00005190
        END;                                                            00005200
  END;                                                                  00005210
                                                                        00005220
  IF B02.PENSJONSTYPE1(IND) = 'K'    !                                  00005230
    ((B02.KONV_P_KODE  (IND) = 'K' !                                    00005240
      B02.KONV_P_KODE  (IND) = 'O' ) &        /*9804*/                  00005250
     B02.PENSJONSTYPE1(IND) ^= 'D' &          /*290396 HL*/             00005260
    ALDER_PÅ_VIRK_DATO     < SØTTI )   THEN                             00005270
                                                                        00005280
    DO;                                                                 00005290
 /*AFP  FAKTISK INNTEKT SKAL BARE NYTTES TOM ÅRET FØR UTTAK AV AFP*/    00005300
                                                                        00005310
       TAB.INNT_POENG(UTTAKSDATO_Å) = 0;                                00005320
       TAB.INNT_POENG_LOV92(UTTAKSDATO_Å) = 0;                          00005330
       TAB.INNT_POENG(UTTAKSDATO_Å + 1) = 0;                            00005340
       TAB.INNT_POENG_LOV92(UTTAKSDATO_Å + 1) = 0;                      00005350
                                                                        00005360
 /*AFP  FAKTISK INNTEKT MÅ LEGGES INN FOR ÅRET FØR UTTAKSÅRET */        00005370
                                                                        00005380
       IF DAGENS_DATO.ÅR < UTTAKSDATO_Å    THEN                         00005390
                                                                        00005400
          DO;                                                           00005410
             I = DAGENS_DATO.ÅR;                                        00005420
             IF TAB.INNT_POENG(I)        = 0    THEN                    00005430
                                                                        00005440
             DO;                                                        00005450
                W_PI           = B02.PI(IND,I) * 100;                   00005460
                TAB.INNT_POENG(I) = F_INNTEKT_POENG(W_PI,I,GV(I),       00005470
  /*4163*/                                       TAB.UFØR_GRAD(I));     00005480
                TAB.INNT_POENG_LOV92(I) =                               00005490
                            F_INNTEKT_POENG_LOV92(W_PI,I,GV(I),         00005500
  /*4172*/                                       TAB.UFØR_GRAD(I));     00005510
                TAB.POENG_KODE(I) = 'U57';                              00005520
             END;                                                       00005530
          END;                                                          00005540
       ELSE  /*TRUDE 0893*/                                             00005550
   /*------------PROBLEMER MED KODE FOR FORELØPIG INNTEKT PÅ SB. */     00005560
       IF TAB.INNT_POENG(UTTAKSDATO_Å - 1) > 0 &                        00005570
          B02.PINNTEKT.PI_KODE(IND,UTTAKSDATO_Å - 1) = 'F'  THEN        00005580
          TAB.POENG_KODE(UTTAKSDATO_Å -1)  = 'U57';                     00005590
    /*---------HIT TRUDE -------------*/                                00005600
    END;                                                                00005610
                                                                        00005620
                                                                        00005630
 /* EØS-BEREGNING : */                                                  00005640
                                                                        00005650
  IF DIV_PARAM_OMR.REGN_PRO_RATA(IND) = 'J'    THEN                     00005660
  DO;                                                                   00005670
     DIV_PARAM_OMR.PÅ_NORSK_FAKTISK(IND) = 0;                           00005680
     DIV_PARAM_OMR.PÅ_EØS_FAKTISK  (IND) = 0;                           00005690
                                                                        00005700
     DO I = 67 TO (DAGENS_DATO.ÅR - 1);                                 00005710
        IF TAB.INNT_POENG(I) > 0        &                               00005720
           TAB.UFØR_GRAD (I) = 0  THEN                                  00005730
           DIV_PARAM_OMR.PÅ_NORSK_FAKTISK(IND) =                        00005740
           DIV_PARAM_OMR.PÅ_NORSK_FAKTISK(IND) + 1;                     00005750
        IF B02.INNTEKTSÅR_EØS(IND,I) &                                  00005760
           TAB.INNT_POENG(I) = 0         THEN                           00005770
           DO;                                                          00005780
              TAB.POENG_KODE(I) = 'U02';                                00005790
              DIV_PARAM_OMR.PÅ_EØS_FAKTISK(IND) =                       00005800
              DIV_PARAM_OMR.PÅ_EØS_FAKTISK(IND) + 1;                    00005810
           END;                                                         00005820
     END;                                                               00005830
                                                                        00005840
  END; /*END EØS-BEREGNING*/                                            00005850
                                                                        00005860
 /*EØS HIT */                                                           00005870
                                                                        00005880
  IF B02.VERNEPLIKTÅR(IND,FØRST_REG) > 0 THEN                           00005890
                                                                        00005900
     DO I = 1 TO 4;                                                     00005910
                                                                        00005920
        IF B02.VERNEPLIKTÅR(IND,I) > 0 THEN                             00005930
                                                                        00005940
           DO;                                                          00005950
              VERNEPL_ÅR = B02.VERNEPLIKTÅR(IND,I);                     00005960
                                                                        00005970
 /*           IF TAB.INNT_POENG(VERNEPL_ÅR - 1) > 2.00 THEN           */00005980
 /*                                                                   */00005990
 /*              INNTEKTEN I ÅRET FØR VERNEPLIKTSÅRET ER STØRRE ENN   */00006000
 /*              VERNEPLIKTSGARANTIEN PÅ 2,00 POENG.                  */00006010
 /*                                                                   */00006020
 /*             TAB.VERNEPL_POENG(VERNEPL_ÅR) =                       */00006030
 /*                            TAB.INNT_POENG(VERNEPL_ÅR - 1) + 0.005;*/00006040
 /*                                                                   */00006050
 /*           ELSE                                                    */00006060
 /*                                                                   */00006070
 /*                                                                   */00006080
 /*              VERNEPLIKTS POENG I FOREGÅENDE ÅR STØRRE ENN 2.00    */00006090
 /*                                                                   */00006100
 /*                                                                   */00006110
 /*              IF TAB.VERNEPL_POENG(VERNEPL_ÅR - 1) > 2.00 THEN     */00006120
 /*                                                                   */00006130
 /*                 TAB.VERNEPL_POENG(VERNEPL_ÅR) =                   */00006140
 /*                                TAB.VERNEPL_POENG(VERNEPL_ÅR - 1); */00006150
 /*                                                                   */00006160
 /*                                                                   */00006170
 /*              VERNEPLIKTSPOENGGARANTI                              */00006180
 /*                                                                   */00006190
 /*                                                                   */00006200
 /*              ELSE                                                 */00006210
 /*                                                                   */00006220
 /*                 TAB.VERNEPL_POENG(VERNEPL_ÅR) = 2.00;             */00006230
 /*                                                                   */00006240
                                                                        00006250
                                                                        00006260
 /* ENDRING 4/1-90 AV TUYEN                                           */00006270
                                                                        00006280
              TAB.VERNEPL_POENG(VERNEPL_ÅR) =                           00006290
                    MAX(2,                                              00006300
                        (TAB.INNT_POENG(VERNEPL_ÅR - 1) + 0.005),       00006310
                        TAB.VERNEPL_POENG(VERNEPL_ÅR - 1),              00006320
                        (TAB.INNT_POENG(VERNEPL_ÅR) + 0.005)) ;         00006330
                                                                        00006340
              TAB.VERNEPL_POENG_LOV92(VERNEPL_ÅR) =                     00006350
                    MAX(2,                                              00006360
                        (TAB.INNT_POENG_LOV92(VERNEPL_ÅR - 1) + 0.005), 00006370
                        TAB.VERNEPL_POENG_LOV92(VERNEPL_ÅR - 1),        00006380
                        (TAB.INNT_POENG_LOV92(VERNEPL_ÅR) + 0.005)) ;   00006390
               DCL VPO  FIXED DEC (3,2) INIT (0);                       00006400
               VPO =   TAB.VERNEPL_POENG_LOV92(VERNEPL_ÅR);             00006410
           END;                                                         00006420
                                                                        00006430
        ELSE                                                            00006440
                                                                        00006450
           I = 4;                                                       00006460
                                                                        00006470
     END;                                                               00006480
                                                                        00006490
                                                                        00006500
 IF B02.UFT_ÅM(IND,FØRST_REG) > 0          !           /*AFP*/          00006510
    B02.PENSJONSTYPE1(IND)    = 'K'        !           /*AFP*/          00006520
    B02.KONV_P_KODE  (IND)    = 'K'        !           /*AFP*/          00006530
    B02.KONV_P_KODE  (IND)    = 'O'       THEN    /*9804*/              00006540
 /*                                                                   */00006550
 /*     UTREGNING AV BUP FOR EN UFØREPENSJONIST                       */00006560
 /*     UTREGNING AV FPP FOR EN AFP  PENSJONIST                       */00006570
 /*     TRUDE 0492: VED OVERGANG TIL 70 ÅR, SKAL TP OMREGNES          */00006580
    DO;                                                                 00006590
                                                                        00006600
 /*UTLAND*/                                                             00006610
       DCL HLTEST1     CHAR (1) INIT (' ');                             00006620
       DCL HLTEST2     CHAR (1) INIT (' ');                             00006630
       HLTEST1 =   DIV_PARAM_OMR.REGN_PRO_RATA(IND);                    00006640
       HLTEST2 =   B02.EØS_8_4_3A(IND);                                 00006650
                                                                        00006660
       IF B02.SPESOPPL.BOSATT(IND) = 0       !                          00006670
          B02.UFØRPENS.VILKÅR_8_4_3A(IND) = 'J'    !                    00006680
          B02.STATUS.VILKÅR_8_4_3A(IND) = 'J'      !                    00006690
          ((DIV_PARAM_OMR.REGN_PRO_RATA(IND) = 'J') &                   00006700
           (B02.EØS_8_4_3A(IND) = 'J')           )  !                   00006710
          ( B02.BOSATT(IND) > 0              &                          00006720
           (B02.PENSJONSTYPE1(IND)    = 'K'  !                          00006730
            B02.KONV_P_KODE  (IND)    = 'K'  !                          00006740
            B02.KONV_P_KODE  (IND)    = 'O'   ))  THEN   /*9804*/       00006750
                                                                        00006760
 /*UTLAND HIT*/                                                         00006770
                                                                        00006780
             CALL BEREGN_BUP_FPP(W_FNR_R.ÅR,IND); /* 4164 */            00006790
                                                                        00006800
       ELSE                                                             00006810
          DO;                                                           00006820
             DO I = (DAGENS_DATO.ÅR + 1) TO 63 BY - 1;      /*HL*/      00006830
                IF TAB.UFØR_PERIODE(I) = 'S' !                          00006840
                   TAB.UFØR_PERIODE(I) = 'D' !                          00006850
                   TAB.UFØR_PERIODE(I) = 'A'         THEN               00006860
                   DO;                                                  00006870
                      START_UFPERIODE = I - 1;                          00006880
                      I               = 63;                             00006890
                   END;                                                 00006900
             END;                                                       00006910
             IF START_UFPERIODE = 0     THEN                            00006920
                START_UFPERIODE = SLUTT_ÅR;                             00006930
             DO I = 67 TO START_UFPERIODE;                /*HIT HL */   00006940
                TAB.POENG_ANVENDT(I) = TAB.INNT_POENG(I) + 0.005;       00006950
                TAB.POENG_ANVENDT_LOV92(I) =                            00006960
                                    TAB.INNT_POENG_LOV92(I) + 0.005;    00006970
             END;                                                       00006980
          END;                                                          00006990
                                                                        00007000
       IF B02.DØDSDATO_ÅMD(IND)  >  0        &                          00007010
          B02.PENSJONSTYPE1(IND) = 'D'      &                           00007020
          DØDSDATO.ÅR            > STOPP_ÅR    THEN                     00007030
                                                                        00007040
          DO;                                                           00007050
                                                                        00007060
             IF DØDSDATO.ÅR <= FYLLER_69_ÅR    THEN                     00007070
                TILLEGGS_ÅR = DØDSDATO.ÅR - 1;                          00007080
                                                                        00007090
             ELSE                                                       00007100
                                                                        00007110
                TILLEGGS_ÅR = FYLLER_69_ÅR;                             00007120
                                                                        00007130
             DO I = (STOPP_ÅR + 1) TO TILLEGGS_ÅR;                      00007140
                                                                        00007150
                TAB.POENG_ANVENDT(I) = TAB.INNT_POENG(I) + 0.005;       00007160
                TAB.POENG_ANVENDT_LOV92(I) =                            00007170
                              TAB.INNT_POENG_LOV92(I) + 0.005;          00007180
                                                                        00007190
             END;                                                       00007200
                                                                        00007210
          END;                                                          00007220
                                                                        00007230
     END;                                                               00007240
                                                                        00007250
  ELSE                                                                  00007260
                                                                        00007270
     IF B02.DØDSDATO_ÅMD(IND) > 0 &                                     00007280
        B02.PENSJONSTYPE1(IND) = 'D' THEN                               00007290
                                                                        00007300
        DO;                                                             00007310
 /*                                                                   */00007320
 /*     UTREGNING AV BUP/FPP FOR AVDØD                                */00007330
 /*                                                                   */00007340
                                                                        00007350
           IF DØDSDATO.ÅR <= STOPP_ÅR &                                 00007360
                                                                        00007370
  /*UTLAND */                                                           00007380
                                                                        00007390
 /*FJERNET     B02.SPESOPPL.BOSATT(IND) = 0     &    11.7.90 */         00007400
                                                                        00007410
 /*060990 HL : SATT INN PARENTESER : */                                 00007420
                                                                        00007430
              (B02.SPESOPPL.BOSATT(IND) = 0     !                       00007440
               B02.STATUS.VILKÅR_8_4_3A(IND) = 'J')  THEN               00007450
                                                                        00007460
 /*UTLAND HIT*/                                                         00007470
                                                                        00007480
              CALL BEREGN_BUP_FPP(W_FNR_R.ÅR,IND); /* 4164 */           00007490
                                                                        00007500
           ELSE                                                         00007510
                                                                        00007520
              DO;                                                       00007530
                 IF DØDSDATO.ÅR <= FYLLER_69_ÅR    THEN                 00007540
                    STOPP_ÅR = DØDSDATO.ÅR - 1;                         00007550
                                                                        00007560
                ELSE                                                    00007570
                                                                        00007580
                    STOPP_ÅR = FYLLER_69_ÅR;                            00007590
                                                                        00007600
                 DO I = 67 TO STOPP_ÅR;                                 00007610
                                                                        00007620
                    TAB.POENG_ANVENDT(I) = TAB.INNT_POENG(I) + 0.005;   00007630
                    TAB.POENG_ANVENDT_LOV92(I) =                        00007640
                                   TAB.INNT_POENG_LOV92(I) + 0.005;     00007650
                                                                        00007660
                END;                                                    00007670
                                                                        00007680
             END;                                                       00007690
                                                                        00007700
        END;                                                            00007710
                                                                        00007720
     ELSE                                                               00007730
                                                                        00007740
        DO I = 67 TO SLUTT_ÅR;                                          00007750
                                                                        00007760
           TAB.POENG_ANVENDT(I) = TAB.INNT_POENG(I) + 0.005;            00007770
           TAB.POENG_ANVENDT_LOV92(I) = TAB.INNT_POENG_LOV92(I) + 0.005;00007780
                                                                        00007790
        END;                                                            00007800
                                                                        00007810
  IF B02.PENSJONSTYPE1(IND) = 'A'            !                          00007820
     (  B02.PENSJONSTYPE1(IND)  = 'D'   &         /*290396 HL*/         00007830
       (B02.KONV_P_KODE(IND) = 'K' !                                    00007840
        B02.KONV_P_KODE(IND) = 'O'    )   )   THEN  /*9804*/            00007850
                                                                        00007860
 /*ENDRING 8.12.89 HL : */                                              00007870
                                                                        00007880
     IF ALDER_PÅ_VIRK_DATO < SØTTI      &                               00007890
        B02.PENSJONSTYPE1(IND) ^= 'D'   &         /*290396 HL*/         00007900
       (B02.KONV_P_KODE(IND) = 'K'  !                                   00007910
        B02.KONV_P_KODE(IND) = '0'    )       THEN  /*9804*/            00007920
     ;                                                                  00007930
     ELSE                                                               00007940
                                                                        00007950
 /*HIT 8.12.89 HL */                                                    00007960
                                                                        00007970
     IF (TAB.INNT_POENG(SLUTT_ÅR)                = 0    &               00007980
                                                                        00007990
  /* HL             B02.PI_KODE(IND,SLUTT_ÅR)   ^= 'O') &     */        00008000
                    B02.PI_KODE(IND,SLUTT_ÅR)    = ' ') &               00008010
                    TAB.INNT_POENG(SLUTT_ÅR - 1) > 0 THEN               00008020
        DO;                                                             00008030
                                                                        00008040
 /*          ALDERSPENSJONISTER SOM IKKE HAR FÅTT RAPPORTERT SIN      */00008050
 /*      PENSJONSGIVENDE INNTEKT I ÅRET FØR RETT TIL ALDERSPENSJON,   */00008060
 /*      FÅR BENYTTET SIN INNTEKT I DET 65. ÅRET OGSÅ I DET 66. ÅRET  */00008070
                                                                        00008080
                                                                        00008090
 /* 7.11.89 HL : TESTEN NEDENFOR ER KOMMENTERT BORT ETTER */            00008100
 /*              KONFERANSE MED SLETNER                   */            00008110
 /* 25.1.90 HL : TATT INN IGJEN MED ET TILLEGG            */            00008120
                                                                        00008130
            IF TAB.POENG_ANVENDT(SLUTT_ÅR - 1) >=                       00008140
               TAB.BUP_FPP      (SLUTT_ÅR)           THEN               00008150
                                                                        00008160
               DO;                                                      00008170
                                                                        00008180
 /*TILLEGG 26.4.90 HL*/                                                 00008190
                                                                        00008200
                   IF SLUTT_ÅR           = 89          &                00008210
                      TAB.UFØR_GRAD(89)  >  0        THEN               00008220
                      CALL BEGRENSET_OPPTJENING_89;                     00008230
                                                                        00008240
                   ELSE                                                 00008250
                   IF SLUTT_ÅR = 92         &                           00008260
                      VIRK_LOV92_ÅM > 9200            THEN              00008270
                      DO;                                               00008280
                                                                        00008290
                         IF  TAB.POENG_ANVENDT_LOV92(SLUTT_ÅR - 1)>=    00008300
                             TAB.BUP_FPP      (SLUTT_ÅR)      THEN      00008310
                                                                        00008320
                         DO;                                            00008330
                            TAB.POENG_ANVENDT(SLUTT_ÅR) =               00008340
                            TAB.POENG_ANVENDT_LOV92(SLUTT_ÅR - 1);      00008350
                            TAB.POENG_KODE(SLUTT_ÅR) = 'U58';           00008360
                         END;                                           00008370
                         ELSE                                           00008380
                         DO;                                            00008390
                            TAB.POENG_ANVENDT(SLUTT_ÅR) =               00008400
                            TAB.BUP_FPP(SLUTT_ÅR);                      00008410
                            TAB.POENG_KODE(SLUTT_ÅR) = 'U57';           00008420
                         END;                                           00008430
                      END;                                              00008440
                   ELSE                                                 00008450
                      DO;                                               00008460
                                                                        00008470
                         TAB.POENG_ANVENDT(SLUTT_ÅR) =                  00008480
                                       TAB.POENG_ANVENDT(SLUTT_ÅR - 1); 00008490
                         TAB.POENG_KODE(SLUTT_ÅR) = 'U58';              00008500
                      END;                                              00008510
                                                                        00008520
               END;                                                     00008530
                                                                        00008540
            ELSE                                                        00008550
               DO;                                                      00008560
                                                                        00008570
                  TAB.POENG_ANVENDT(SLUTT_ÅR) = TAB.BUP_FPP(SLUTT_ÅR);  00008580
                  TAB.POENG_KODE(SLUTT_ÅR) = 'U57';                     00008590
                                                                        00008600
               END;                                                     00008610
                                                                        00008620
 /*HIT 25.1.90 HL */                                                    00008630
                                                                        00008640
                                                                        00008650
        END;                                                            00008660
                                                                        00008670
                                                                        00008680
                                                                        00008690
 BEGRENSET_OPPTJENING_89: PROC;                                         00008700
                                                                        00008710
 /*FRA OG MED 1989 ER DET BEGRENSNING I HVOR MYE EN UFØR KAN FÅ    */   00008720
 /*GODSKREVET AV POENG I TILLEGG TIL BUP                           */   00008730
                                                                        00008740
 DCL MAX_INNT         FIXED DEC (3,2) INIT (0),                         00008750
     MAX              FIXED DEC (3,2) INIT (0),                         00008760
     BUP_GRAD         FIXED DEC (3,2) INIT (0);                         00008770
                                                                        00008780
 /*DEN SOM ER 100 % UFØR KAN MAX TJENE OPP 0.5 POENG I TILLEGG : */     00008790
                                                                        00008800
   MAX_INNT                 = TAB.INNT_POENG(88) + 0.005;               00008810
                                                                        00008820
   IF TAB.UFØR_GRAD(89)  = 100       &                                  00008830
      MAX_INNT           > 0.5            THEN                          00008840
      MAX_INNT           = 0.5;                                         00008850
                                                                        00008860
   IF TAB.BUP_FPP(89)    > 4              THEN                          00008870
      MAX       = TAB.BUP_FPP(89) + 0.005;                              00008880
   ELSE                                                                 00008890
      MAX       = 4;                                                    00008900
                                                                        00008910
   BUP_GRAD = TAB.BUP_FPP(89) * TAB.UFØR_GRAD(89) / 100 + 0.005;        00008920
                                                                        00008930
   IF BUP_GRAD              > 4           THEN                          00008940
      TAB.POENG_ANVENDT(89) = BUP_GRAD;                                 00008950
   ELSE                                                                 00008960
                                                                        00008970
 /*LOVENDRING PR. 1.1.92 - HL : */                                      00008980
                                                                        00008990
   DO;                                                                  00009000
      IF BUP_GRAD + MAX_INNT   > MAX         THEN                       00009010
         TAB.POENG_ANVENDT(89) = MAX;                                   00009020
      ELSE                                                              00009030
         TAB.POENG_ANVENDT(89) = BUP_GRAD + MAX_INNT;                   00009040
                                                                        00009050
      IF BUP_GRAD + TAB.INNT_POENG_LOV92(88) > MAX          THEN        00009060
         TAB.POENG_ANVENDT_LOV92(89) = MAX;                             00009070
      ELSE                                                              00009080
         TAB.POENG_ANVENDT_LOV92(89) = BUP_GRAD +                       00009090
                                TAB.INNT_POENG_LOV92(88) + 0.005;       00009100
                                                                        00009110
  /*   TAB.POENG_ANVENDT_LOV92(89) = TAB.INNT_POENG_LOV92(89); */       00009120
                                                                        00009130
   END;                                                                 00009140
                                                                        00009150
 END BEGRENSET_OPPTJENING_89;                                           00009160
                                                                        00009170
                                                                        00009180
                                                                        00009190
  IF W_FNR_R.ÅRHUNDRE < 5         THEN                                  00009200
                                                                        00009210
     DO;                                                                00009220
                                                                        00009230
 /*     IF ALDER_ÅR >= 70       THEN           HL : */                  00009240
        IF ALDER_PÅ_VIRK_DATO >= SØTTI   &                              00009250
           B02.PENSJONSTYPE1(IND) ^= 'D'   THEN      /*9802 HL*/        00009260
                                                                        00009270
           DO;                                                          00009280
                                                                        00009290
              FYLLER_67_ÅR = W_FNR_R.ÅR + 67;                           00009300
                                                                        00009310
              IF FYLLER_67_ÅR < 73      THEN                            00009320
                 FYLLER_67_ÅR = 73;                                     00009330
                                                                        00009340
              FYLLER_69_ÅR = W_FNR_R.ÅR + 69;                           00009350
                                                                        00009360
              IF TAB.INNT_POENG(FYLLER_69_ÅR)       =  0    &           00009370
   /* HL         B02.PI_KODE(IND,FYLLER_69_ÅR)     ^= 'O'   &  */       00009380
                 B02.PI_KODE(IND,FYLLER_69_ÅR)      = ' '   &           00009390
                 TAB.INNT_POENG(FYLLER_69_ÅR - 1)   >  0        THEN    00009400
                 DO;                                                    00009410
                                                                        00009420
 /*          ALDERSPENSJONISTER SOM IKKE HAR FÅTT RAPPORTERT SIN      */00009430
 /*      PENSJONSGIVENDE INNTEKT I ÅRET FØR RETT TIL ALDERSPENSJON,   */00009440
 /*      FÅR BENYTTET SIN INNTEKT I DET 68. ÅRET OGSÅ I DET 69. ÅRET  */00009450
                                                                        00009460
                   IF FYLLER_69_ÅR = 92         &                       00009470
                      VIRK_LOV92_ÅM > 9200            THEN              00009480
                      DO;                                               00009490
                         TAB.INNT_POENG(FYLLER_69_ÅR) =                 00009500
                             TAB.INNT_POENG_LOV92(FYLLER_69_ÅR - 1);    00009510
                         TAB.POENG_KODE(FYLLER_69_ÅR) = 'U58';          00009520
                      END;                                              00009530
                   ELSE                                                 00009540
                      DO;                                               00009550
                         TAB.INNT_POENG(FYLLER_69_ÅR) =                 00009560
                             TAB.INNT_POENG(FYLLER_69_ÅR - 1);          00009570
                         TAB.POENG_KODE(FYLLER_69_ÅR) = 'U58';          00009580
                      END;                                              00009590
                 END;                                                   00009600
                                                                        00009610
              DO I = FYLLER_67_ÅR TO FYLLER_69_ÅR;                      00009620
                                                                        00009630
                 TAB.POENG_ANVENDT(I) = TAB.INNT_POENG(I) + 0.005;      00009640
                                                                        00009650
              END;                                                      00009660
                                                                        00009670
               /*OMSORGSPOENG FOR DENNE GRUPPE VAR GLEMT, TRUDE 0794*/  00009680
                                                                        00009690
               DO I = 92 TO FYLLER_69_ÅR;                               00009700
                 IF (TAB.OMSORG_KODE(I) = 'J' !                         00009710
                     TAB.OMSORG_KODE(I) = 'K' !                         00009720
                     TAB.OMSORG_KODE(I) = 'L' ) &                       00009730
                                                                        00009740
 /*OMSORGSPOENG SKAL TAS MED I DET 67. ÅR - SKAL DET OGSÅ */            00009750
 /*TAS MED I ANDRE UFØREÅR ? 0395 HL : */                               00009760
                                                                        00009770
                   ( I = FYLLER_67_ÅR !                                 00009780
                     TAB.UFØR_GRAD (I) = 0 )  THEN /* ???*/             00009790
                                                                        00009800
                    DO;                                                 00009810
                      IF TAB.POENG_ANVENDT(I) < 3 THEN                  00009820
                        DO;                                             00009830
                           TAB.POENG_ANVENDT(I) = 3;                    00009840
                           TAB.POENG_KODE(I) = 'U03';                   00009850
                        END;                                            00009860
                                                                        00009870
                    END;                                                00009880
               END;                                                     00009890
                  /* HIT TRUDE 0794*/                                   00009900
           END;                                                         00009910
                                                                        00009920
     END;                                                               00009930
                                                                        00009940
  DO I = 1 TO 7 WHILE (B02.UFT_ÅM(IND,I) > 0);                          00009950
     UFØR_ÅR = B02.UFT_ÅM(IND,I) / 100;  /*SISTE UFØR_ÅR*/              00009960
     IF UFØR_ÅR < 66 THEN               /*180796 HL*/                   00009970
        B02.UFØRHIST.BUP(IND,I) = 0;                                    00009980
     ELSE                                                               00009990
        B02.UFØRHIST.BUP(IND,I) = TAB.BUP_FPP(UFØR_ÅR);                 00010000
  END;                                                                  00010010
                                                                        00010020
  /*OMSORGSPOENG . TRUDE 020394*/                                       00010030
  /*MÅ VI HA MED UFG = 0 ?? */                                          00010040
  /*ENDRET 090994 AV TRUDE. SKAL IKKE OMREGNES FØR EVNT NYTT UFT,ALDER*/00010050
  /*ELLER NYTT UFT ETTER -92.                                         */00010060
                                                                        00010070
   DO  I = 92 TO SLUTT_ÅR;                                              00010080
     IF (TAB.OMSORG_KODE(I)      = 'J' !                                00010090
         TAB.OMSORG_KODE(I)      = 'K' !                                00010100
         TAB.OMSORG_KODE(I)      = 'L' )  &                             00010110
      (((TAB.UFØR_PERIODE(I)     = 'M' !                                00010120
         TAB.UFØR_PERIODE(I)     = 'J' ) !   /* TS 021296 */            00010130
         (TAB.UFØR_PERIODE(I)    = 'S' &                                00010140
          I                      > 92  &                                00010150
          TAB.UFØR_PERIODE(I-1)  = 'M'))  !                             00010160
         TAB.UFØR_GRAD (I)       =  0 )   THEN                          00010170
                                                                        00010180
        DO;                                                             00010190
          IF  TAB.POENG_ANVENDT(I) < 3 THEN                             00010200
            DO;                                                         00010210
               TAB.POENG_ANVENDT(I) = 3;                                00010220
               /* MÅ STOPPE POENGREKKEN PÅ PENSJONSBREVET. TS 190894*/  00010230
               IF  TAB.POENG_KODE(I)    = 'U54'   THEN                  00010240
                   TAB.POENG_KODE(I+1)  = 'U54';                        00010250
                                                                        00010260
               TAB.POENG_KODE(I)    = 'U03';                            00010270
            END;                                                        00010280
                                                                        00010290
        END;                                                            00010300
   END;                                                                 00010310
          /*OMSORGSKODE HIT */                                          00010320
  /*NB! FØRSTE ÅRET MED OMSORGSPOENG ER 92. TRUDE 020394           */   00010330
  IF B02.YNGSTE_BARN_FÅR(IND) > 0           THEN                        00010340
     DO I = B02.YNGSTE_BARN_FÅR(IND) TO                                 00010350
           (B02.YNGSTE_BARN_FÅR(IND) + 6);                              00010360
                                                                        00010370
        IF  I > 91 THEN            /* 92 ER FØRSTE ÅR MED OMSORGSPOENG*/00010380
          DO;                                                           00010390
        /* IF  (UFØR_ÅR ^> I)  & (I ^> SEKSTISEKSÅR) THEN** TS 190894*/ 00010400
           IF  I <=  SEKSTISEKSÅR         &                             00010410
               TAB.POENG_ANVENDT(I) < 3             THEN                00010420
                 DO;                                                    00010430
                    TAB.POENG_ANVENDT(I) = 3;                           00010440
                    TAB.POENG_KODE(I)    = 'U03';                       00010450
                 END;                                                   00010460
                                                                        00010470
           IF  I  = (B02.YNGSTE_BARN_FÅR(IND) + 6) &         /*9404TS*/ 00010480
      /*       (B02.UFØRPENS.VILKÅR_8_4_3A(IND) = 'J'    !              00010490
                B02.STATUS.VILKÅR_8_4_3A(IND) = 'J'         ) &  */     00010500
               TAB.POENG_KODE(I)    = 'U03'       THEN                  00010510
               TAB.POENG_KODE(I+1)  = 'U54';                            00010520
                                                                        00010530
           IF  B02.REDUSERT_ANT_BUP_ÅR(IND,1) > 0 THEN       /*9404TS*/ 00010540
             DO;                                             /*9404TS*/ 00010550
                                                                        00010560
               IF  I + 1  =  UFØR_ÅR + B02.REDUSERT_ANT_BUP_ÅR(IND,1)   00010570
                                                   THEN                 00010580
                   TAB.POENG_KODE(I+1)  = '   ';                        00010590
             END;                                                       00010600
          END;                                                          00010610
     END;                                                               00010620
                                                                        00010630
  RETUR:                                                                00010640
                                                                        00010650
  DCL TEST77_KODE   CHAR (5);                                           00010660
  DCL TEST78_KODE   CHAR (5);                                           00010670
      TEST77_KODE = TAB.POENG_KODE(77);                                 00010680
      TEST78_KODE = TAB.POENG_KODE(78);                                 00010690
                                                                        00010700
  END BEREGN_POENGREKKE;                                                00010710
