 /*       SIST ENDRET 28/07-98 12.50.40 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/07-98 12.28.41 AV   JDA7339                  */00000010
 /*       SIST ENDRET 05/12-97 12.31.09 AV   JDA7339                  */00000020
 /*       SIST ENDRET 27/11-97 11.00.25 AV   JDA7339                  */00000030
 /*       SIST ENDRET 28/07-97 12.35.24 AV   HLA7339                  */00000040
 /*       SIST ENDRET 11/10-96 12.15.08 AV   JDA0310                  */00000050
 /*       SIST ENDRET 20/09-94 09.50.46 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 20/09-91 08.14.37 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 26/04-91 12.16.14 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 12/11-90 13.15.53 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 16/10-89 12.47.03 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 14/04-89 13.59.05 AV   HERMAN                   */00000110
 /*       SIST ENDRET 12/07-85 14.48.40 AV   HERMAN                   */00000120
 /*       SIST ENDRET 27/02-85 14.33.38 AV   HERMAN                   */00000130
 /*       SIST ENDRET 13/11-84 09.16.34 AV   HERMAN                   */00000140
 /*       SIST ENDRET 22/08-84 10.37.26 AV   HERMAN                   */00000150
 /* ***************************************************************** */00000160
 /* IDENTIFIKASJON:                                                   */00000170
 /*     R0019940 - PROSEDYRE I PLI                                    */00000180
 /*     PROGRAMMERER: JAN, APRIL 1982                                 */00000190
 /* HENSIKT:                                                          */00000200
 /*     DENNE RUTINEN OPPHØRER UFØREPENSJON.                          */00000210
 /*     DERSOM SØKER HAR EKTEFELLE SKJER FØLGENDE:                    */00000220
 /*     A) EKTEFELLEN HAR EN OPPHØRT UFØREPENSJON                     */00000230
 /*      SØKERS STATUS AVSLUTTES                                      */00000240
 /*      EKTEFELLEN FÅR STATUS_KODE_HIST = 'X' OG                     */00000250
 /*                     PENSJONSTYPE1    = 'U' OG                     */00000260
 /*                     PENSJONSTYPE2    = ' '                        */00000270
 /*     B) EKTEFELLEN HAR PENSJONSKODE1 = G/F OG IKKE UFØREHISTORIKK  */00000280
 /*      SØKERS OG EKTEFELLENS STATUS AVSLUTTES.                      */00000290
 /*     C) EKTEFELLEN HAR EGEN PENSJON:                               */00000300
 /*      SØKER BEHOLDER STATUS SEGMENT MED NYE PENSJONSKODER,         */00000310
 /*      EKTEFELLEN FÅR NY PENSJONSKODE2 OG NY TILKNYTNINGSKODE.      */00000320
 /*     DERSOM SØKER IKKE HAR EKTEFELLE:                              */00000330
 /*      SØKERS STATUS AVSLUTTES.                                     */00000340
 /*     DET BLIR SPESIELL BEHANDLING FOR:                             */00000350
 /*      UFØR ETTERLATT EKTEFELLE OG UFØR ETTERLATT BARN              */00000360
 /*     DERSOM SøKER FORSØRGER BARN BLIR OGSÅ DISSE SLETTET           */00000370
 /*      FRA STATUS.                                                  */00000380
 /* PROGRAMTILKNYTNING:                                               */00000390
 /*     KALLES OPP AV PROGRAM R0011720,R001N620,R001U620              */00000400
 /* BRUK:                                                             */00000410
 /*     UFØREPENSJON OPPHØRER                                         */00000420
 /* ***************************************************************** */00000430
 %SKIP;                                                                 00000440
 UFØREPENSJON_OPPHØRER:                                                 00000450
   PROC;                                                                00000460
 %SKIP;                                                                 00000470
   DCL                                                                  00000480
      I         FIXED BIN(15),                                          00000490
      J         FIXED BIN(15);                                          00000500
   DCL OPPHØR_ÅM              PIC '(4)9';                               00000510
   DCL OPPHØR_ÅR DEF OPPHØR_ÅM   PIC '99',                              00000520
       OPPHØR_MN DEF OPPHØR_ÅM POS(3)  PIC '99';                        00000530
 %SKIP;                                                                 00000540
                                                                        00000550
  OPPHØR_ÅM = HJ_VIRK_DATO_ÅM;                                          00000560
  IF OPPHØR_ÅR > 98    &              /*9807*/                          00000570
     OPPHØR_MN = 01 THEN                                                00000580
     DO;                                                                00000590
        OPPHØR_MN = 12;                                                 00000600
        OPPHØR_ÅR = OPPHØR_ÅR - 1;                                      00000610
     END;                                                               00000620
  B02.PENSJONSRETT_FØR_91(SØKER_IND) = ' ';                             00000630
  B02.GT_TILLEGG_LOV92   (SØKER_IND) = 0;       /*0496 HL*/             00000640
  B02.GT_LOV92           (SØKER_IND) = 0;       /*0496 HL*/             00000650
  B02.PENSJON_FØR_9802   (SØKER_IND) = ' ';     /*9710 HL*/             00000660
  B02.EK_INNT_OVER_2G    (SØKER_IND) = ' ';     /*9710 HL*/             00000670
                                                                        00000680
 /* ***************************************************************** */00000690
 /* DERSOM SØKEREN ER EN VOKSEN.                                      */00000700
 /* ***************************************************************** */00000710
                                                                        00000720
      IF SØKER_IND < 3 THEN                                             00000730
         DO;                                                            00000740
                                                                        00000750
 /* ***************************************************************** */00000760
 /* DERSOM SØKEREN FORSØRGER BARN.                                    */00000770
 /* ***************************************************************** */00000780
                                                                        00000790
            DO I = 1 TO 13 WHILE (B01.FNR_TILKN(SØKER_IND,I) > 0);      00000800
               IF B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'L'  !      00000810
  /*HL*/          B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'V'  !      00000820
                  B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'W'         00000830
                                                              THEN      00000840
                DO;                                                     00000850
 /*0991-HL*/      B01.TILKN.FT_FØR_91       (SØKER_IND,I) = ' ';        00000860
                  DO J = 3 TO 14 WHILE (B01.FNR(J) > 0);                00000870
 /* 9934 */          CALL OPPHØR_KOBLING_TO_PERSONER(SØKER_IND,J);      00000880
                     B02.VIRK_DATO_ÅM(J)             =                  00000890
                                                       HJ_VIRK_DATO_ÅM; 00000900
 /*0991-HL*/         B02.PENSJONSRETT_FØR_91(J)      = ' ';             00000910
 /*                  B02.ANTALL_BARN(J)              = 0  ;             00000920
   0991-HL           B02.PENSJONSTYPE1(J)            = ' ';             00000930
   0991-HL           B02.PENSJONSTYPE2(J)            = ' ';             00000940
 */                                                                     00000950
                     B02.STATUS_KODE_HIST(J)         = 'O';             00000960
                  END;                                                  00000970
                END;                                                    00000980
            END;                                                        00000990
            B02.ANTALL_BARN(SØKER_IND)               = 0  ;             00001000
                                                                        00001010
 /* ***************************************************************** */00001020
 /* DERSOM UFØR ETTERLATT EKTEFELLE.                                  */00001030
 /* ***************************************************************** */00001040
                                                                        00001050
            IF B01.PENSJONSTYPE2(SØKER_IND) = 'E' THEN                  00001060
               DO;                                                      00001070
                                                                        00001080
 /* ***************************************************************** */00001090
 /* NÅ SKAL ETTERLATTEPENSJON LØPE VIDERE                             */00001100
 /* ***************************************************************** */00001110
                                                                        00001120
                  B02.PENSJONSTYPE1(SØKER_IND) = 'E';                   00001130
                  B02.PENSJONSTYPE2(SØKER_IND) = 'P';                   00001140
                                                                        00001150
 /* ***************************************************************** */00001160
 /* ENDRINGER I SPESIELLE OPPLYSNINGER.                               */00001170
 /* ***************************************************************** */00001180
                                                                        00001190
                  B02.SPESOPPL.UFØR_UNDER_BOTID(SØKER_IND) = ' ';       00001200
                  B02.SPESOPPL.TT_FRAMT_UFT(SØKER_IND)     = 0;         00001210
                  B02.SPESOPPL.FRAVIK_8_1(SØKER_IND)       = ' ';       00001220
                  TRANSTYPE                                = 21;        00001230
               END;                                                     00001240
            ELSE                                                        00001250
                                                                        00001260
 /* ***************************************************************** */00001270
 /* DERSOM SØKER ER UGIFT, SKILT ELLER ETTERLATT.                     */00001280
 /* ***************************************************************** */00001290
                                                                        00001300
               IF B01.SIVILSTAND       (SØKER_IND) = 'U' !              00001310
                                                                        00001320
 /* TILLEGG 12.7.85 HL : TAR MED SIVILSTAND = A NÅR EKTEF IKKE ER     */00001330
 /*                      KNYTTET TIL PENSJONISTEN     :               */00001340
                                                                        00001350
                  (B01.SIVILSTAND       (SØKER_IND) = 'A' &             00001360
                   B01.FNR              (EKTEF_IND) = 0 ) !             00001370
                                                                        00001380
 /* HIT 12.7.85  HL                                                   */00001390
                                                                        00001400
                  B01.SIVILSTAND       (SØKER_IND) = 'E' !              00001410
                  B01.SIVILSTAND       (SØKER_IND) = 'S' THEN           00001420
                  DO;                                                   00001430
                     B02.VIRK_DATO_ÅM    (SØKER_IND) = HJ_VIRK_DATO_ÅM; 00001440
                     B02.STATUS_KODE_HIST(SØKER_IND) = 'X';             00001450
                     TRANSTYPE                       = 55;              00001460
                  END;                                                  00001470
               ELSE                                                     00001480
                                                                        00001490
 /* ***************************************************************** */00001500
 /* DERSOM SØKER HAR EKTEFELLE,EKTEFELLEN IKKE HAR EGEN YTELSE.       */00001510
 /* ***************************************************************** */00001520
                                                                        00001530
                  IF B01.PENSJONSTYPE1(EKTEF_IND) = 'G' ! B01.          00001540
                                    PENSJONSTYPE1(EKTEF_IND) = 'F' THEN 00001550
                     DO;                                                00001560
                                                                        00001570
 /* ***************************************************************** */00001580
 /* B02.STATUS SETTES TIL HISTORISK.                                  */00001590
 /* ***************************************************************** */00001600
                                                                        00001610
                        B02.VIRK_DATO_ÅM(SØKER_IND)     =               00001620
                                                       HJ_VIRK_DATO_ÅM; 00001630
                        B02.STATUS_KODE_HIST(SØKER_IND) = 'X';          00001640
                        B02.VIRK_DATO_ÅM(EKTEF_IND)     =               00001650
                                                       HJ_VIRK_DATO_ÅM; 00001660
                                                                        00001670
 /* ENDRET 27.2.85  HL : EKTEFELLEN SKAL HA STATUS_KODE_HIST = 'X' OG */00001680
 /*                      PT1='U',PT2 =' ' NÅR DET ER EN UFØREHISTORIKK*/00001690
                                                                        00001700
                        IF B01.UFT_ÅM(EKTEF_IND,1)      > 0      THEN   00001710
                                                                        00001720
                           DO;                                          00001730
                              B02.STATUS_KODE_HIST(EKTEF_IND) = 'X';    00001740
                              B02.PENSJONSTYPE1(EKTEF_IND) = 'U';       00001750
                              B02.PENSJONSTYPE2(EKTEF_IND) = ' ';       00001760
                           END;                                         00001770
                                                                        00001780
                        ELSE                                            00001790
                                                                        00001800
                           B02.STATUS_KODE_HIST(EKTEF_IND) = 'O';       00001810
                                                                        00001820
 /* HIT 27.2.85  HL                                                   */00001830
                                                                        00001840
                        TRANSTYPE                       = 55;           00001850
 /* 9934 */             CALL OPPHØR_KOBLING_TO_PERSONER                 00001860
                                                (SØKER_IND,EKTEF_IND);  00001870
                     END;                                               00001880
                  ELSE                                                  00001890
                     DO;                                                00001900
                                                                        00001910
 /* ***************************************************************** */00001920
 /* EKTEFELLEN HAR EGEN PENSJON.                                      */00001930
 /* ***************************************************************** */00001940
        /*AFP*/         IF B01.PENSJONSTYPE2(EKTEF_IND)   ^= 'N' THEN   00001950
                           B02.PENSJONSTYPE2(EKTEF_IND)    = 'P';       00001960
                        TRANSTYPE                       = 36;           00001970
                                                                        00001980
                        B02.PENSJONSTYPE1(SØKER_IND) = 'G';             00001990
                        B02.PENSJONSTYPE2(SØKER_IND) = ' ';             00002000
                        B02.TT_FØR_1967(SØKER_IND)   = 0;               00002010
                        B02.TT_ETTER_1966(SØKER_IND) = 0;               00002020
                        B02.TT_ANV(SØKER_IND)        = 0;               00002030
                        B02.TT_FRAMT(SØKER_IND)      = 0;               00002040
 /*20.9.89 HL*/         B02.TP_GAR_KODE(SØKER_IND)   = ' ';             00002050
 /*20.9.89 HL*/         B02.GAMMEL_SAMMENSTØTS_REGEL(SØKER_IND)= ' ';   00002060
                        B02.SUM_YTELSE(SØKER_IND)    = 0;               00002070
                        B02.VIRK_DATO_ÅM(SØKER_IND)  =                  00002080
                                                       HJ_VIRK_DATO_ÅM; 00002090
 /*20.9.89 HL*/         B02.GAMMEL_SAMMENSTØTS_REGEL(EKTEF_IND)= ' ';   00002100
                                                                        00002110
 /* FJERNET 18.2.85 HL. B02.STATUS_KODE_HIST(SØKER_IND) = 'X';       */ 00002120
                                                                        00002130
 /* ***************************************************************** */00002140
 /* B02.SPESOPPL-SEGMENTET SLETTES                                 */   00002150
 /* ***************************************************************** */00002160
                                                                        00002170
                        B02.SPESOPPL(SØKER_IND)   = '';                 00002180
                                                                        00002190
 /* ***************************************************************** */00002200
 /* FINNER SØKERS FNR I EKTEFELLENS TILKNYTNINGSSEGMENT               */00002210
 /* ***************************************************************** */00002220
                                                                        00002230
                        DO I = 1 TO 13 WHILE (                          00002240
                                 B02.FNR_TILKN(EKTEF_IND,I) > 0);       00002250
                           IF    B02.FNR_TILKN(EKTEF_IND,I) =           00002260
                                       B02.FNR(SØKER_IND)       THEN    00002270
                              DO;                                       00002280
                                 B02.TILKNYTNINGSKODE(                  00002290
                                                    EKTEF_IND,I) = 'G'; 00002300
                              END;                                      00002310
                        END;                                            00002320
                     END;                                               00002330
         END;                                                           00002340
      ELSE                                                              00002350
         DO;                                                            00002360
                                                                        00002370
 /* ***************************************************************** */00002380
 /* VI VET NÅ AT DETTE ER ET BARN (LIGGER PÅ PLASS 3-14 I B01).       */00002390
 /* DERMED ER DET ET BARN  MED BARNEPENSJON OG UFØREPENSJON.          */00002400
 /* UFØREPENSJONEN OPPHØRER, MENS BARNEPENSJONEN LØPER VIDERE         */00002410
 /* ***************************************************************** */00002420
                                                                        00002430
                     B02.PENSJONSTYPE3(SØKER_IND)    = ' ';             00002440
 /* FJERNET 18.2.85  B02.STATUS_KODE_HIST(SØKER_IND) = 'X';  HL       */00002450
                                                                        00002460
 /* ***************************************************************** */00002470
 /* ENDRINGER I SPESIELLE OPPLYSNINGER                                */00002480
 /* ***************************************************************** */00002490
                                                                        00002500
            B02.SPESOPPL.UFØR_UNDER_BOTID(SØKER_IND) = ' ';             00002510
            B02.SPESOPPL.TT_FRAMT_UFT(SØKER_IND)     = 0;               00002520
            B02.SPESOPPL.FRAVIK_8_1(SØKER_IND)       = ' ';             00002530
            TRANSTYPE                                = 21;              00002540
         END;                                                           00002550
                                                                        00002560
 /* ***************************************************************** */00002570
 /* UFØRPENS OG YRKEPENS SKAL BLANKES                                 */00002580
 /* ***************************************************************** */00002590
                                                                        00002600
 /*YS*/  B02.UFØRPENS(SØKER_IND) = '';                                  00002610
 /*YS*/  B02.YRKEPENS(SØKER_IND) = '';                                  00002620
         B02.FORSI   (SØKER_IND) = '';   /* TRUDE 300894*/              00002630
                                                                        00002640
 /* ***************************************************************** */00002650
 /* OPPHØRSDATO OG KODE SETTES I UFØRHIST-SEGMENTET                   */00002660
 /* ***************************************************************** */00002670
                                                                        00002680
      DO I = 1 TO 7;            /*0697 HL*/                             00002690
         IF B01.UFØRHIST.OPPHØRSDATO_ÅM( SØKER_IND,I)   = 0 THEN        00002700
            DO;                                                         00002710
               B02.UFØRHIST.OPPHØRSDATO_ÅM(SØKER_IND,I) =               00002720
        /*                              HJ_VIRK_DATO_ÅM;*/              00002730
                                     OPPHØR_ÅM;     /*9807*/            00002740
               B02.UFØRHIST.OPPHØRSKODE(SØKER_IND,I)    = 'J';          00002750
               I                  = 7;         /*0697 HL*/              00002760
            END;                                                        00002770
      END;                                                              00002780
                                                                        00002790
 /* ***************************************************************** */00002800
 /*YS   OPPHØRSDATO OG KODE SETTES I YRKEHIST-SEGMENTET               */00002810
 /* ***************************************************************** */00002820
                                                                        00002830
 /*YS*/     DO I = 1 TO 5;                                              00002840
 /*YS*/        IF B01.YRKEHIST.YUFT_ÅM     ( SØKER_IND,I)   > 0  &      00002850
 /*YS*/           B01.YRKEHIST.OPPH_DATO_ÅM( SØKER_IND,I)   = 0 THEN    00002860
 /*YS*/           DO;                                                   00002870
 /*YS*/              B02.YRKEHIST.OPPH_DATO_ÅM(SØKER_IND,I) =           00002880
        /*                              HJ_VIRK_DATO_ÅM;*/              00002890
                                     OPPHØR_ÅM;     /*9807*/            00002900
 /*YS*/              B02.YRKEHIST.OPPH_KODE(SØKER_IND,I)    = 'J';      00002910
 /*YS*/              I                                        = 5;      00002920
 /*YS*/           END;                                                  00002930
 /*YS*/     END;                                                        00002940
   END UFØREPENSJON_OPPHØRER;                                           00002950
