 /*       SIST ENDRET 13/12-91 12.21.41 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 24/08-90 09.04.50 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 29/03-88 13.13.50 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 17/03-87 12.49.26 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 09/03-83 14.53.08 AV   OLAV                     */00000040
 /*       SIST ENDRET 08/03-83 13.17.00 AV   KARIN                    */00000050
 /*       SIST ENDRET 08/03-83 12.59.38 AV   OLAV                     */00000060
 /*       SIST ENDRET 02/03-83 14.48.17 AV   OLAV                     */00000070
 /*       SIST ENDRET 27/10-82 08.14.54 AV   FARVIK                   */00000080
 /*       SIST ENDRET 01/10-82 13.40.46 AV   FARVIK                   */00000090
 /* ***************************************************************** */00000100
 /*IDENTIFIKASJON:                                                    */00000110
 /*    R0014136 - ÅTTI_PROSENT_REGELEN - INTERN PROC I PLI.           */00000120
 /*    PROGRAMMERER: KRISTENSEN, MAI 1982.                            */00000130
 /*    ENDRET JULI 82 AV KARIN                                        */00000140
 /*HENSIKT:                                                           */00000150
 /*    PROGRAMMET BEREGNER W_APD_80.                                  */00000160
 /*PROGRAMTILKNYTNING:                                                */00000170
 /*    PROGRAMMET BLIR INKLUDERT I R0014122 - BEREGN_APD.             */00000180
 /*BRUK:                                                              */00000190
 /*    CALL ÅTTI_PROSENT_REGELEN(W_TAI,W_APD_ØNSKET,*/                  00000200
 /*                              W_APD_80,W_FRAVIK)               */    00000210
 /*    RUTINEN FÅR OVERFØRT TAI(TIDLIGERE ARBEIDSINNTEKT) OG EVENTUELL*/00000220
 /*    ØNSKET APD, RETURNERER APD REGNET ETTER 80_PROSENT-REGELEN.    */00000230
 /* ***************************************************************** */00000240
 ÅTTI_PROSENT_REGELEN: PROC(W_TAI,W_APD_ØNSKET,W_APD_80,W_FRAVIK);      00000250
                                                                        00000260
 DCL                                                                    00000270
    W_TAI               FIXED DEC (7),                                  00000280
    W_DIVISOR           FIXED DEC (7),                                  00000290
    W_DIVIDEND          FIXED DEC (9,2),                                00000300
    W_RESULTAT          FIXED DEC (9,3),                                00000310
    W_APD_ØNSKET        FIXED DEC(3),                                   00000320
    W_APD_80            FIXED DEC (7,3),                                00000330
    W_FRAVIK            CHAR(1),                                        00000340
    W_APD_FRAVIK        FIXED DEC(7,3),                                 00000350
    W_KOMPFAKTOR        FIXED DEC(3,1),                                 00000360
    W_HALV_KT           FIXED DEC(3),                                   00000370
    W_FAI_MAX           FIXED DEC (7);                                  00000380
                                                                        00000390
                                                                        00000400
                                                                        00000410
 W_APD_80 = (0.8000*W_TAI*1000 - (B02.ALDERSP.FAI(BER_SØ_IND) * 100))   00000420
                         / (B02.ALDERSP.GP (BER_SØ_IND) * 12            00000430
                         +  B02.ALDERSP.TP (BER_SØ_IND) * 12            00000440
                         +  B02.ALDERSP.ET (BER_SØ_IND) * 12            00000450
                         +  B02.ALDERSP.ST (BER_SØ_IND) * 12            00000460
                         +  B02.ALDERSP.KT (BER_SØ_IND) * 12            00000470
                         +  B02.TP_BRUTTO  (BER_SØ_IND) * 12);          00000480
                                                                        00000490
                                                                        00000500
                                                                        00000510
 IF W_APD_80 < 0.25 THEN                                                00000520
   DO;                                                                  00000530
      W_KOMPFAKTOR = 0.5;                                               00000540
   /*    ENDRET   17.03.88    SATISH                                 */ 00000550
   /*                                                                 */00000560
   /* W_HALV_KT = F_BEREGN_KOMPENSASJONSTILLEGG                       */00000570
   /*             (B02.PENSJONSTYPE2 (BER_SØ_IND),                    */00000580
   /*              B02.TT_ANV (BER_SØ_IND),0,                         */00000590
   /*              W_KOMPFAKTOR,'J');                                 */00000600
   /*     HITTIL                                                      */00000610
      W_HALV_KT = F_BEREGN_KOMPENSASJONSTILLEGG                         00000620
                  (B02.PENSJONSTYPE1 (BER_SØ_IND),                      00000630
                   B02.PENSJONSTYPE2 (BER_SØ_IND),                      00000640
                   B02.TT_ANV (BER_SØ_IND),0,                           00000650
                   W_KOMPFAKTOR,'J');                                   00000660
                                                                        00000670
      W_DIVIDEND=0.8*W_TAI*1000-B02.ALDERSP.FAI(BER_SØ_IND) * 100;      00000680
      W_DIVISOR = B02.ALDERSP.GP (BER_SØ_IND) * 12 +                    00000690
                  B02.ALDERSP.TP (BER_SØ_IND) * 12 +                    00000700
                  B02.ALDERSP.ET (BER_SØ_IND) * 12 +                    00000710
                  B02.ALDERSP.ST (BER_SØ_IND) * 12 +                    00000720
                  B02.TP_BRUTTO  (BER_SØ_IND) * 12 +                    00000730
                  W_HALV_KT * 12 ;                                      00000740
      W_RESULTAT = W_DIVIDEND / W_DIVISOR;                              00000750
      IF W_RESULTAT < 0.25 THEN                                         00000760
             /* VI MÅ REGNE MED HALVT KOMPTILLEGG NÅR APD = 25 */       00000770
        W_APD_80 = 0;                                                   00000780
      ELSE                                                              00000790
        W_APD_80 = 25;                                                  00000800
   END;                                                                 00000810
                                                                        00000820
 ELSE IF W_APD_80 < 0.50 THEN                                           00000830
    W_APD_80 = 25;                                                      00000840
                                                                        00000850
 ELSE IF W_APD_80 < 0.75 THEN                                           00000860
    W_APD_80 = 50;                                                      00000870
                                                                        00000880
 ELSE IF W_APD_80 < 1.00 THEN                                           00000890
    W_APD_80 = 75;                                                      00000900
                                                                        00000910
 ELSE                                                                   00000920
    W_APD_80 = 100;                                                     00000930
                                                                        00000940
 IF W_APD_80 < 100 THEN                                                 00000950
    DO;                                                                 00000960
      CALL FRAVIK_80_PROSENT(W_APD_FRAVIK);                             00000970
      /* UNDERSØKER OM DET SKAL GIS FRAVIK ETTER 80-%-REGELEN */        00000980
      /* R0014147 */                                                    00000990
  /*  IF W_APD_80 > W_APD_FRAVIK THEN   */                              00001000
      IF W_APD_80 >= W_APD_FRAVIK THEN  /*ENDRET TIL = OGSÅ.TRUDE */    00001010
        DO;                                                             00001020
           CALL FAI_GRENSER(W_APD_80,W_TAI,W_FAI_MAX);                  00001030
           /* R0014146 */                                               00001040
           W_FRAVIK = 'N';                                              00001050
        END;                                                            00001060
      ELSE                                                              00001070
        DO;                                                             00001080
          W_APD_80 = W_APD_FRAVIK;                                      00001090
          IF W_APD_80 > 0 THEN                                          00001100
             DO;                                                        00001110
                CALL FAI_GRENSER_FRAVIK(W_APD_80,W_FAI_MAX);            00001120
                /* R0014155 */                                          00001130
                W_FRAVIK = 'J';                                         00001140
             END;                                                       00001150
          ELSE                                                          00001160
             W_FRAVIK = 'N';                                            00001170
        END;                                                            00001180
    END;                                                                00001190
                                                                        00001200
 ELSE                                                                   00001210
    DO;                                                                 00001220
       CALL FAI_GRENSER(W_APD_80,W_TAI,W_FAI_MAX);                      00001230
       /* R0014146 */                                                   00001240
       W_FRAVIK = 'N';                                                  00001250
    END;                                                                00001260
                                                                        00001270
 END ÅTTI_PROSENT_REGELEN;                                              00001280
