 /*       SIST ENDRET 08/05-98 12.38.05 AV   JDA7339                  */00000000
 /*       SIST ENDRET 30/03-98 12.57.39 AV   JDA7339                  */00000010
 /*       SIST ENDRET 15/07-97 12.46.14 AV   HLA7339                  */00000020
 /*       SIST ENDRET 27/09-96 13.22.53 AV   JDA0310                  */00000030
 /*       SIST ENDRET 12/10-95 14.12.16 AV   JDA0310                  */00000040
 /*       SIST ENDRET 25/07-94 13.55.14 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 24/05-94 14.07.57 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 15/03-94 14.02.12 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 22/01-92 15.24.48 AV   HERMAN                   */00000080
 /*       SIST ENDRET 13/12-91 13.06.58 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 10/10-91 13.58.49 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 31/07-91 13.07.34 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 11/07-91 14.25.19 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 26/04-91 12.22.55 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 08/04-91 12.10.11 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 14/12-90 09.57.37 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 12/11-90 13.20.02 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 16/10-90 12.42.46 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 16/10-89 13.26.01 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 14/04-89 14.56.35 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 30/09-85 10.18.57 AV   LUNDEBY                  */00000200
 /*       SIST ENDRET 14/06-85 17.03.17 AV   LUNDEBY                  */00000210
 /*       SIST ENDRET 18/02-85 08.16.35 AV   LUNDEBY                  */00000220
 /*       SIST ENDRET 30/11-83 12.38.08 AV   LUNDEBY                  */00000230
 /*       SIST ENDRET 21/11-83 08.39.16 AV   LUNDEBY                  */00000240
 /*       SIST ENDRET 19/10-83 09.33.33 AV   LUNDEBY                  */00000250
 /*       SIST ENDRET 06/09-83 07.38.03 AV   FARVIK                   */00000260
                                                                        00000270
                                                                        00000280
  /* **************************************************************** */00000290
  /*IDENTIFIKASJON:                                                   */00000300
  /*    R0015401 - HOVEDPROGRAM I PLI                                 */00000310
  /*    PROGRAMMERER: LUNDEBY FEBRUAR  1982                           */00000320
  /*                                                                  */00000330
  /*HENSIKT:                                                          */00000340
  /*    SKRIVE INNTEKT, PENSJONSHISTORIKK                             */00000350
  /*    OG STATUS RECORD TIL DATABASEN                                */00000360
  /*                                                                  */00000370
  /*PROGRAMTILKNYTNING:                                               */00000380
  /*    R005430  -->  SKRIVER       SISTE STATUS                      */00000390
  /*    R005470  -->  SKRIVER  NEST SISTE STATUS                      */00000400
  /*                                                                  */00000410
  /*BRUK:                                                             */00000420
  /*                                                                  */00000430
  /* **************************************************************** */00000440
                                                                        00000450
  R001540 :                                                             00000460
    PROC            (COMMAREA_PEKER)                                    00000470
           OPTIONS  (MAIN);                                             00000480
                                                                        00000490
                                                                        00000500
    %PAGE;                                                              00000510
    %INCLUDE P0019908;                            /* KOM_OMR        */  00000520
                                                                        00000530
    %PAGE;                                                              00000540
    %INCLUDE P0019910;                            /* STYRINGS_OMR   */  00000550
                                                                        00000560
    %PAGE;                                                              00000570
    %INCLUDE P0019912;                            /* DIV_PARAM_OMR  */  00000580
                                                                        00000590
    %PAGE;                                                              00000600
       DCL 1  B00              BASED (B00_PEKER),                       00000610
    %INCLUDE P0019921;                            /* B00            */  00000620
                                                                        00000630
    %PAGE;                                                              00000640
       DCL 1  B02              BASED (B02_PEKER),                       00000650
    %INCLUDE P0019921;                            /* B02            */  00000660
                                                                        00000670
     DCL 1  W01_PINT               UNALIGNED,                           00000680
     %INCLUDE   P0019928                    ;  /* INTEKTS-SEGM      */  00000690
                                                                        00000700
                                                                        00000710
    /* ************************************************************ */  00000720
    /* TILKNYTTNINGS-SEGM .  BRUKES I 1. RF-PCB.   (RF1)            */  00000730
    /* ************************************************************ */  00000740
                                                                        00000750
     DCL 1  W01_TILKN1             UNALIGNED,                           00000760
     %INCLUDE   P0019931                    ;  /* TILKN-SEGM        */  00000770
                                                                        00000780
    /* ************************************************************ */  00000790
    /* TILKNYTTNINGS-SEGM .  BRUKES I 2. RF-PCB.  (RF2)             */  00000800
    /* ************************************************************ */  00000810
                                                                        00000820
     DCL 1  W01_TILKN2             UNALIGNED,                           00000830
     %INCLUDE   P0019931                    ;  /* TILKN-SEGM        */  00000840
                                                                        00000850
                                                                        00000860
    /* ************************************************************ */  00000870
    /*     INNEBYGDE PLI-FUNKSJONER                                 */  00000880
    /* ************************************************************ */  00000890
                                                                        00000900
     DCL                                                                00000910
        ( ADDR , LOW , CSTG , DATE,SUBSTR )  BUILTIN;                   00000920
     DCL                                                                00000930
          PLITDLI ENTRY;                                                00000940
     DCL                                                                00000950
         COMMAREA_PEKER            POINTER;                             00000960
     DCL                                                                00000970
         W01_HJELPE_PTR            POINTER;                             00000980
                                                                        00000990
    /* ************************************************************ */  00001000
    /* HJELPE-OMR. FOR BUILTIN-FUNC.     :    DATE                  */  00001010
    /* ************************************************************ */  00001020
                                                                        00001030
     DCL    W01_DATE                         CHAR (6) INIT ('');        00001040
                                                                        00001050
     DCL    W01_ÅR  DEF     W01_DATE         PIC '99' ;                 00001060
                                                                        00001070
    /* ************************************************************ */  00001080
    /* OPPTELINGS- OG LOOP-PARAMETRE M.M                            */  00001090
    /* ************************************************************ */  00001100
                                                                        00001110
     DCL 1  W01_OPPTELL_OMR,                                            00001120
            2   W02_I              FIXED    BIN   (15)   INIT ( 0 ),    00001130
            2   W02_ÅR             FIXED    BIN   (15)   INIT ( 0 ),    00001140
            2   I                  FIXED    BIN   (15)   INIT ( 0 ),    00001150
            2   J                  FIXED    BIN   (15)   INIT ( 0 ),    00001160
            2   B                           CHAR  (1)    INIT (' ');    00001170
                                                                        00001180
    %PAGE;                                                              00001190
    /* ************************************************************ */  00001200
    /*                                                              */  00001210
    /* DLI CALL-PARAMETRE                                           */  00001220
    /*                                                              */  00001230
    /* ************************************************************ */  00001240
                                                                        00001250
     DCL 1  W01_DLI_PARAM,                                              00001260
            2   W02_DLI_FUNC       CHAR (4)       INIT ('    '),        00001270
            2   W02_GN             CHAR (4)       INIT ('GN  '),        00001280
            2   W02_GU             CHAR (4)       INIT ('GU  '),        00001290
            2   W02_GNP            CHAR (4)       INIT ('GNP '),        00001300
            2   W02_GHU            CHAR (4)       INIT ('GHU '),        00001310
            2   W02_DLET           CHAR (4)       INIT ('DLET'),        00001320
            2   W02_REPL           CHAR (4)       INIT ('REPL'),        00001330
            2   W02_ISRT           CHAR (4)       INIT ('ISRT'),        00001340
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT (3),             00001350
            2   W02_PARM_CT_4      FIXED BIN(31)  INIT (4),             00001360
            2   W02_PARM_CT_5      FIXED BIN(31)  INIT (5),             00001370
            2   W02_PARM_CT_6      FIXED BIN(31)  INIT (6),             00001380
            2   W02_PARM_CT_7      FIXED BIN(31)  INIT (7),             00001390
            2   W02_OUT_FELT       PIC '(11)9'    INIT (''),            00001400
            2   W02_DATO           PIC '(4)9'     INIT (''),            00001410
            2   W02_ST_OK          BIT (1)        INIT (''),            00001420
            2   NEI                BIT (1)        INIT ('0'B),          00001430
            2   PERSON_IKKE_DØD    BIT (1)        INIT ('0'B),          00001440
            2   W02_OUT2           CHAR (20)      INIT ('');            00001450
                                                                        00001460
     DCL    W01_IO                 CHAR (150)    INIT  ('');            00001470
     DCL    W01_HJELPE_IO          CHAR (150)    BASED (W01_HJELPE_PTR);00001480
                                                                        00001490
    %PAGE;                                                              00001500
    /* ************************************************************ */  00001510
    /*                                                              */  00001520
    /* DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */  00001530
    /*                                                              */  00001540
    /* ************************************************************ */  00001550
                                                                        00001560
     DCL    SSA_UQUAL                            CHAR (9) INIT ((9)' ');00001570
                                                                        00001580
     DCL 1  SSA1_RF0PERSN          UNALIGNED,                           00001590
            2    HDEL                            CHAR (17)  INIT        00001600
                 ('RF0PERSN(FNR     '),                                 00001610
            2    REL_OP                          CHAR (2)   INIT (' ='),00001620
            2    PKEY               FIXED        DEC  (11)  INIT ( 0 ), 00001630
            2    HP                              CHAR (1)   INIT (')'); 00001640
                                                                        00001650
     DCL 1  SSA2_RF0PERSN          UNALIGNED,                           00001660
            2    HDEL                            CHAR (17)  INIT        00001670
                 ('RF0PERSN(FNR     '),                                 00001680
            2    REL_OP                          CHAR (2)   INIT (' ='),00001690
            2    PKEY               FIXED        DEC  (11)  INIT ( 0 ), 00001700
            2    HP                              CHAR (1)   INIT (')'); 00001710
                                                                        00001720
     DCL 1  SSA3_RF0PERSN          UNALIGNED,                           00001730
            2    HDEL                            CHAR (17)  INIT        00001740
                 ('RF0PERSN(FNR     '),                                 00001750
            2    REL_OP                          CHAR (2)   INIT (' ='),00001760
            2    PKEY               FIXED        DEC  (11)  INIT ( 0 ), 00001770
            2    HP                              CHAR (1)   INIT (')'); 00001780
                                                                        00001790
     DCL 1  SSA1_PINNTEKT          UNALIGNED,                           00001800
            2    HDEL                            CHAR (17)  INIT        00001810
                 ('PINNTEKT(INNTÅRTY'),                                 00001820
            2    REL_OP1                         CHAR (2)   INIT (' ='),00001830
            2    ÅR1                FIXED        DEC  (3)   INIT ( 0 ) ,00001840
            2    TYPE1                           CHAR (1)   INIT (' '), 00001850
            2    HP                              CHAR (1)   INIT (')') ;00001860
                                                                        00001870
     DCL 1  SSA2_PINNTEKT          UNALIGNED,                           00001880
            2    HDEL                            CHAR (17)  INIT        00001890
                 ('PINNTEKT(INNTÅR  '),                                 00001900
            2    REL_OP1                         CHAR (2)   INIT (' ='),00001910
            2    ÅR                 FIXED        DEC  (3)   INIT ( 0 ) ,00001920
            2    HP                              CHAR (1)   INIT (')') ;00001930
                                                                        00001940
     DCL 1  SSA1_UFØRHIST          UNALIGNED,                           00001950
            2    HDEL                            CHAR (17)  INIT        00001960
                 ('UFØRHIST(UFT     '),                                 00001970
            2    REL_OP                          CHAR (2)   INIT (' ='),00001980
            2    UFT_ÅM               FIXED      DEC  (4)   INIT ( 0 ), 00001990
            2    HP                              CHAR (1)   INIT (')'); 00002000
                                                                        00002010
 /*YS*/DCL 1  SSA1_YRKEHIST          UNALIGNED,                         00002020
 /*YS*/     2    HDEL                            CHAR (17)  INIT        00002030
 /*YS*/          ('YRKEHIST(YUFT    '),                                 00002040
 /*YS*/     2    REL_OP                          CHAR (2)   INIT (' ='),00002050
 /*YS*/     2    YUFT_ÅM              FIXED      DEC  (4)   INIT ( 0 ), 00002060
 /*YS*/     2    HP                              CHAR (1)   INIT (')'); 00002070
                                                                        00002080
     DCL 1  SSA1_STATUS            UNALIGNED,                           00002090
            2    HDEL                            CHAR (17)  INIT        00002100
                 ('STATUS  (STATKODE'),                                 00002110
            2    REL_OP                          CHAR (2)   INIT (' ='),00002120
            2    KODE                            CHAR (1)   INIT (' '), 00002130
            2    HP                              CHAR (1)   INIT (')'); 00002140
                                                                        00002150
     DCL 1  SSA1_TILKN             UNALIGNED,                           00002160
            2    HDEL                            CHAR (17)  INIT        00002170
                 ('TILKN   (FNRANDRE'),                                 00002180
            2    REL_OP                          CHAR (2)   INIT (' ='),00002190
            2    PKEY            FIXED           DEC  (11)  INIT ( 0 ), 00002200
            2    HP                              CHAR (1)   INIT (')'); 00002210
                                                                        00002220
     DCL 1  SSA2_TILKN             UNALIGNED,                           00002230
            2    HDEL                            CHAR (17)  INIT        00002240
                 ('TILKN   (FNRANDRE'),                                 00002250
            2    REL_OP                          CHAR (2)   INIT (' ='),00002260
            2    PKEY            FIXED           DEC  (11)  INIT ( 0 ), 00002270
            2    HP                              CHAR (1)   INIT (')'); 00002280
                                                                        00002290
                                                                        00002300
    /* ************************************************************ */  00002310
    /*                                                              */  00002320
    /* ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */  00002330
    /*                                                              */  00002340
    /* ************************************************************ */  00002350
                                                                        00002360
    %INCLUDE DLIUIB;                                                    00002370
                                                                        00002380
     DCL                                                                00002390
         UIB_RC_OK                 BIT (8)       INIT( 0 );             00002400
                                                                        00002410
                                                                        00002420
    /* ************************************************************ */  00002430
    /*                                                              */  00002440
    /* PCB- OG UIB-OMR .                                          */    00002450
    /*                                                              */  00002460
    /* ************************************************************ */  00002470
                                                                        00002480
     %INCLUDE   P0012002;                /* PCB_UIB_PEKER_OMR BASED */  00002490
                                                                        00002500
     DCL 1  RF1                     BASED (RF1_PCB_PEKER),              00002510
     %INCLUDE   P0012003;                /*    PCB                 */   00002520
                                                                        00002530
     DCL 1  RF2                     BASED (RF2_PCB_PEKER),              00002540
     %INCLUDE   P0012003;                /*    PCB                 */   00002550
                                                                        00002560
     DCL 1  RF3                     BASED (RF3_PCB_PEKER),              00002570
     %INCLUDE   P0012003;                /*    PCB                 */   00002580
                                                                        00002590
    %PAGE;                                                              00002600
    /* ************************************************************ */  00002610
    /*                                                              */  00002620
    /*        SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .     */  00002630
    /*       ---------------------------------------------------    */  00002640
    /*                                                              */  00002650
    /*                                                              */  00002660
    /*        INITIERER FORSKJELLIGE PARAMETRE .                    */  00002670
    /*                                                              */  00002680
    /* ************************************************************ */  00002690
                                                                        00002700
    W01_DATE                             =       DATE             ;     00002710
    PROGRAM_ID                           =      'R0015401'        ;     00002720
    UIBPTR                               =       UIB_PEKER        ;     00002730
    W01_PINT                             =       ''               ;     00002740
                                                                        00002750
                                                                        00002760
    IF SUBSTR(DIV_PARAM_OMR.CICS_NAVN,1,4) = 'HELP'  THEN               00002770
         GO TO L999;        /* 'US' BLANKETTYPE BERØRER IKKE STATUS  */ 00002780
                                                                        00002790
                                                                        00002800
    DO   W02_I  =  1  TO  14;                                           00002810
                                                                        00002820
      IF B02.PENSJONSTYPE2(W02_I) = 'A'    THEN  /*DAGPENGER*/          00002830
         GO TO L999;                                                    00002840
                                                                        00002850
      IF  B00.FNR        (W02_I)     >    0              THEN           00002860
        DO;                                                             00002870
          /* **************************************************** */    00002880
          /*  GÅR IGJENNOM FNR TIL  M F  FOR Å RYDDE OPP I        */    00002890
          /*  DEM OG DERES TILKNYTTINGERS :  NEST SISTE STATUS    */    00002900
          /* **************************************************** */    00002910
                                                                        00002920
          IF B00.STATUS.PENSJONSTYPE1 (W02_I)  =   'D'      THEN        00002930
             PERSON_IKKE_DØD                   =   '0'B           ;     00002940
          ELSE                                                          00002950
             PERSON_IKKE_DØD                   =   '1'B           ;     00002960
                                                                        00002970
          SSA1_STATUS.KODE                     =   'N'            ;     00002980
          SSA1_RF0PERSN.PKEY                   =    B00.FNR(W02_I);     00002990
          CALL P_LEST_TILKN_FJERNET_STATUS;                             00003000
                                                                        00003010
          IF FEIL_MELD_NR                      >    0         THEN      00003020
             GO TO L999;                                                00003030
        END;                                                            00003040
                                                                        00003050
                                                                        00003060
      IF B02.FNR  (W02_I)           >    0              THEN            00003070
        DO;                                                             00003080
          /* **************************************************** */    00003090
          /*  GÅR IGJENNOM FNR TIL  M F  FOR Å RYDDE OPP I        */    00003100
          /*  DEM OG DERES TILKNYTTINGERS :       SISTE STATUS    */    00003110
          /* **************************************************** */    00003120
                                                                        00003130
          IF B02.STATUS.PENSJONSTYPE1 (W02_I)  =   'D'      THEN        00003140
             PERSON_IKKE_DØD                   =   '0'B           ;     00003150
          ELSE                                                          00003160
             PERSON_IKKE_DØD                   =   '1'B           ;     00003170
                                                                        00003180
          SSA1_STATUS.KODE                     =   'S'            ;     00003190
          SSA1_RF0PERSN.PKEY                   =    B02.FNR(W02_I);     00003200
          CALL P_LEST_TILKN_FJERNET_STATUS;                             00003210
                                                                        00003220
          IF FEIL_MELD_NR                      >    0         THEN      00003230
             GO TO L999;                                                00003240
        END;                                                            00003250
    END;                                                                00003260
                                                                        00003270
    /* ************************************************************* */ 00003280
    /* OPPRYDDING AV TILKNYTTINGER FERDIG .                          */ 00003290
    /* ************************************************************* */ 00003300
                                                                        00003310
                                                                        00003320
    DO   W02_I  =  1  TO  14;                                           00003330
                                                                        00003340
      IF B02.FNR  (W02_I)             >    0                       THEN 00003350
         DO;                                                            00003360
                                                                        00003370
            IF DIV_PARAM_OMR.KJØRINGS_TYPE  ^=   'S'      &             00003380
               STYRINGS_OMR .FUNKSJONSKODE  ^=   'E'               THEN 00003390
                                                                        00003400
               /* ************************************************** */ 00003410
               /*  NYE OPPL. INN I :  RF0PERSN  PINNTEKT  TILBERPO   */ 00003420
               /*  HVIS IKKE       : 'SATVIS KJØRING' ELLER FJERNING */ 00003430
               /* ************************************************** */ 00003440
               DO;                                                      00003450
                  SSA1_RF0PERSN.PKEY  =  B02.FNR(W02_I);                00003460
                                                                        00003470
                  CALL PLITDLI          (W02_PARM_CT_4,                 00003480
                                         W02_GHU,                       00003490
                                         RF1,                           00003500
                                         W01_IO,                        00003510
                                         SSA1_RF0PERSN);                00003520
                                                                        00003530
                  IF UIBFCTR        ^=   UIB_RC_OK         THEN         00003540
                     DO;                                                00003550
                        /* *************************************** */   00003560
                        /*   UAKSEPTABEL KODE FRA :    UIB         */   00003570
                        /* *************************************** */   00003580
  L100:                                                                 00003590
                        FEIL_MELD_NR   =   500;                         00003600
                        FEIL_VED_LABEL =  '100';                        00003610
                        GO TO    L999;                                  00003620
                     END;                                               00003630
                                                                        00003640
                                                                        00003650
                  W01_HJELPE_PTR    =   ADDR (B02.RF0PERSN (W02_I)) ;   00003660
                  W01_IO            =   W01_HJELPE_IO               ;   00003670
                                                                        00003680
                                                                        00003690
                  SELECT  (RF1.STATUS_KODE);                            00003700
                                                                        00003710
                     WHEN ('  ')                                        00003720
                        DO;                                             00003730
                           CALL PLITDLI           (W02_PARM_CT_3,       00003740
                                                   W02_REPL,            00003750
                                                   RF1,                 00003760
                                                   W01_IO);             00003770
                                                                        00003780
                           IF UIBFCTR          ^=  UIB_RC_OK     !      00003790
                              RF1.STATUS_KODE  ^=  '  '             THEN00003800
                              DO;                                       00003810
                                 /* ********************************* */00003820
                                 /* UAKSEPTABEL KODE FRA :  UIB       */00003830
                                 /*                 RF1.STATUS_KODE   */00003840
                                 /* ********************************* */00003850
  L110:                                                                 00003860
                                 FEIL_MELD_NR   =   500;                00003870
                                 FEIL_VED_LABEL =  '110';               00003880
                                 DB_STATUS_KODE =   RF1.STATUS_KODE;    00003890
                                 GO TO     L999;                        00003900
                              END;                                      00003910
                        END;                                            00003920
                                                                        00003930
                     WHEN ('GE')                                        00003940
                        DO;                                             00003950
                           /* ************************************** */ 00003960
                           /* DUMMY-ROT SKULLE VERT LAGET I R0013110 */ 00003970
                           /* ************************************** */ 00003980
  L120:                                                                 00003990
                           FEIL_MELD_NR         =    501;               00004000
                           FEIL_VED_LABEL       =   '120';              00004010
                           DB_STATUS_KODE       =    RF1.STATUS_KODE;   00004020
                           GO TO     L999;                              00004030
                        END;                                            00004040
                                                                        00004050
                     OTHERWISE                                          00004060
                        DO;                                             00004070
                           /* ************************************* */  00004080
                           /*  UGYLDIG STATUSKODE FRA DLI           */  00004090
                           /* ************************************* */  00004100
  L130:                                                                 00004110
                           FEIL_MELD_NR         =    500;               00004120
                           FEIL_VED_LABEL       =   '130';              00004130
                           DB_STATUS_KODE       =    RF1.STATUS_KODE;   00004140
                           GO TO     L999;                              00004150
                        END;                                            00004160
                  END;     /*     SELECT  :   RF1.STATUS_KODE     */    00004170
                                                                        00004180
                                                                        00004190
                  /* ********************************************* */   00004200
                  /* PINNTEKT SKRIVES                              */   00004210
                  /* ********************************************* */   00004220
                                                                        00004230
                  SSA_UQUAL             =  'PINNTEKT ';                 00004240
                                                                        00004250
                  DO W02_ÅR = 67 TO 99  WHILE (W02_ÅR  <=  W01_ÅR );    00004260
                                                                        00004270
                     IF B02.PI_KODE     (W02_I,W02_ÅR)  =  'F'  THEN    00004280
                        DO;                                             00004290
                        DCL TEST_B01   CHAR (1) INIT (' ');             00004300
                            TEST_B01   = B00.PI_KODE(W02_I,W02_ÅR);     00004310
                           SSA1_PINNTEKT.TYPE1          =  'A'     ;    00004320
                           SSA1_PINNTEKT.ÅR1            =   W02_ÅR ;    00004330
                           SSA2_PINNTEKT.ÅR             =   W02_ÅR ;    00004340
                           CALL  P_SJEKK_INNTEKT;                       00004350
                                                                        00004360
                                                                        00004370
                           IF FEIL_MELD_NR  >  0                THEN    00004380
                              GO TO L999;                               00004390
                                                                        00004400
      /*                   IF B02.PI(W02_I,W02_ÅR)  >  0     THEN  */   00004410
      /*                      DO                                   */   00004420
                                 W02_PI_ÅR    =   W02_ÅR;               00004430
                                 W02_PI       =   B02.PI (W02_I,W02_ÅR);00004440
                                                                        00004450
                                 W02_PI_TYPE  =   'A'                  ;00004460
                                 CALL  P_SKRIV_INNTEKT_TIL_BASEN       ;00004470
                                                                        00004480
                                 IF FEIL_MELD_NR   >   0        THEN    00004490
                                    GO TO L999;                         00004500
      /*                      END                               */      00004510
                                                                        00004520
                        END;  /*    IF B02.PI_TYPE    = 'F'           */00004530
                                                                        00004540
                  END;        /*    BEHANDLING AV INNTEKTENE          */00004550
                                                                        00004560
                                                                        00004570
                  /* ************************************************ */00004580
                  /* TILLEGGS-OPPLYSNINGENE FOR POENGBEREGNINGEN      */00004590
                  /* ************************************************ */00004600
                                                                        00004610
                  IF B02 (W02_I).TILBERPO.VERNEPLIKTÅR (1) >  0   !     00004620
                     B02 (W02_I).TILBERPO.VERNEPLIKTÅR (2) >  0   !     00004630
                     B02 (W02_I).TILBERPO.VERNEPLIKTÅR (3) >  0   !     00004640
                     B02 (W02_I).TILBERPO.VERNEPLIKTÅR (4) >  0   !     00004650
                     B02 (W02_I).TILBERPO.AI63             >  0   !     00004660
                     B02 (W02_I).TILBERPO.AI64             >  0   !     00004670
                     B02 (W02_I).TILBERPO.AI65             >  0   !     00004680
                     B02 (W02_I).TILBERPO.AI66             >  0   !     00004690
                     B02 (W02_I).TILBERPO.PI66             >  0     THEN00004700
                                                                        00004710
                     DO;                                                00004720
                        W01_HJELPE_PTR  =  ADDR ( B02.TILBERPO (W02_I));00004730
                        CALL  P_SKRIV_TILBERPO;                         00004740
                                                                        00004750
                        IF FEIL_MELD_NR       >   0                 THEN00004760
                        GO TO L999;                                     00004770
                     END;                                               00004780
                                                                        00004790
               END;  /*IF KJØRINGS_TYPE ^= 'S' & FUNKSJONSKODE ^= 'E'*/ 00004800
                                                                        00004810
                                                                        00004820
            /* **************************************************** */  00004830
            /*  SKRIVER BARE NEST SISTE STATUS HVIS :               */  00004840
            /*          STATUS_KODE_HIST   ^=  O                    */  00004850
            /* **************************************************** */  00004860
                                                                        00004870
            IF B00.FNR                (W02_I)  >    0     &             00004880
               B00.STATUS_KODE_HIST   (W02_I) ^=   'O'                  00004890
 /*09.10.90 SL FAMILIE_SPLITTET_IND            =    NEI */         THEN 00004900
               DO;                                                      00004910
                  SSA1_RF0PERSN.PKEY           =    B00.FNR (W02_I);    00004920
                  SSA1_STATUS.KODE             =   'N';                 00004930
                  B00.STATUS_KODE     (W02_I)  =   'N';                 00004940
                                                                        00004950
 /*18.9.89 HL - UNGE UFØRE                                              00004960
                                                                        00004970
                  DO J = 1 TO 5 WHILE                                   00004980
                     (B02.UFØRHIST.BUP_GAR_KODE(W02_I,J) = 'E')         00004990
                     B00.UFØRHIST.BUP_GAR_KODE(W02_I,J) = 'E'           00005000
                     B00.UFØRHIST.BUP_GARANTI(W02_I,J) = 1.60           00005010
                  END                                                   00005020
   HIT 18.9.89 HL*/                                                     00005030
                                                                        00005040
                  IF B00.VIRK_DATO_ÅM (W02_I)  >    0              THEN 00005050
                     DO;                                                00005060
                        CALL P_SKRIV_NEST_SISTE_STATUS;                 00005070
                                                                        00005080
                        IF FEIL_MELD_NR        >    0              THEN 00005090
                           GO TO L999;                                  00005100
                     END;                                               00005110
               END;      /*  BEHANDLING AV NEST SISTE STATUS    */      00005120
                                                                        00005130
                                                                        00005140
            /* ************************************************ */      00005150
            /* SKRIVER UT :    S I S T E   S T A T U S          */      00005160
            /* **************************************************/      00005170
                                                                        00005180
            SSA1_RF0PERSN.PKEY                =    B02.FNR (W02_I);     00005190
            SSA1_STATUS.KODE                  =   'S';                  00005200
            B02.STATUS_KODE     (W02_I)       =   'S';                  00005210
                                                                        00005220
            IF B02.VIRK_DATO_ÅM (W02_I)        >    0          THEN     00005230
               DO;                                                      00005240
                  CALL   P_SKRIV_SISTE_STATUS;                          00005250
                                                                        00005260
                  IF FEIL_MELD_NR             >    0          THEN      00005270
                     GO TO L999;                                        00005280
               END;                                                     00005290
                                                                        00005300
         END;     /*    IF B02.FNR  (W02_I)   >    0                  */00005310
                                                                        00005320
    END;          /*    DO W02_I = 1  TO   14                         */00005330
                                                                        00005340
                                                                        00005350
                                                                        00005360
                                                                        00005370
    /* ************************************************************** */00005380
    /* ************************************************************** */00005390
    /* ********                                      **************** */00005400
    /* ********     INTERNE    PROCEDURER            **************** */00005410
    /* ********                                      **************** */00005420
    /* ************************************************************** */00005430
    /* ************************************************************** */00005440
                                                                        00005450
                                                                        00005460
    %PAGE;                                                              00005470
    /* ************************************************************** */00005480
    /*                                                                */00005490
    /* PROCEDURE FOR Å LEGGE INN UNDERLIGGENDE SEGM. TIL ROT-SEGM.    */00005500
    /*                                                                */00005510
    /* ************************************************************** */00005520
                                                                        00005530
    P_SKRIV_BARN_AV_ROT :                                               00005540
      PROC;                                                             00005550
                                                                        00005560
      W01_IO                                =    W01_HJELPE_IO;         00005570
      CALL PLITDLI                              (W02_PARM_CT_5,         00005580
                                                 W02_ISRT,              00005590
                                                 RF1,                   00005600
                                                 W01_IO,                00005610
                                                 SSA1_RF0PERSN,         00005620
                                                 SSA_UQUAL);            00005630
                                                                        00005640
      IF RF1.STATUS_KODE                   ^=    '  '                   00005650
        ! UIBFCTR                          ^=    UIB_RC_OK  THEN        00005660
        DO;                                                             00005670
          /* ******************************************************** */00005680
          /*  UAKSEPTABEL KODE FRA  :   UIB                           */00005690
          /*                            RF1.STATUS_KODE               */00005700
          /* ******************************************************** */00005710
  L160:                                                                 00005720
          FEIL_MELD_NR              =   500;                            00005730
          FEIL_VED_LABEL            =  '160';                           00005740
          DB_STATUS_KODE            =   RF1.STATUS_KODE;                00005750
        END;                                                            00005760
    END P_SKRIV_BARN_AV_ROT;                                            00005770
                                                                        00005780
                                                                        00005790
                                                                        00005800
    %PAGE;                                                              00005810
    /* ************************************************************** */00005820
    /*                                                                */00005830
    /* PROCEDURE FOR Å FJERNE   PINNTEKT                              */00005840
    /*                                                                */00005850
    /* ************************************************************** */00005860
                                                                        00005870
    P_SJEKK_INNTEKT:                                                    00005880
      PROC;                                                             00005890
                                                                        00005900
      CALL PLITDLI                         (W02_PARM_CT_5,              00005910
                                            W02_GHU,                    00005920
                                            RF1,                        00005930
                                            W01_IO,                     00005940
                                            SSA1_RF0PERSN,              00005950
                                            SSA1_PINNTEKT);             00005960
                                                                        00005970
      IF UIBFCTR                     ^=     UIB_RC_OK        THEN       00005980
         DO;                                                            00005990
  L170:                                                                 00006000
            FEIL_MELD_NR              =     500;                        00006010
            FEIL_VED_LABEL            =    '170';                       00006020
            DB_STATUS_KODE            =     RF1.STATUS_KODE;            00006030
            GO TO RETUR;                                                00006040
         END;                                                           00006050
                                                                        00006060
      IF RF1.STATUS_KODE              =    '  '              THEN       00006070
         DO;                                                            00006080
            CALL PLITDLI                   (W02_PARM_CT_3,              00006090
                                            W02_DLET,                   00006100
                                            RF1,                        00006110
                                            W01_IO);                    00006120
                                                                        00006130
            IF RF1.STATUS_KODE       ^=     '  '        !               00006140
               UIBFCTR               ^=     UIB_RC_OK        THEN       00006150
               DO;                                                      00006160
  L180:                                                                 00006170
                  FEIL_MELD_NR        =     500;                        00006180
                  FEIL_VED_LABEL      =    '180';                       00006190
                  DB_STATUS_KODE      =     RF1.STATUS_KODE;            00006200
                  GO TO RETUR;                                          00006210
               END;                                                     00006220
         END;                                                           00006230
      ELSE                                                              00006240
         IF RF1.STATUS_KODE          ^=    'GE'              THEN       00006250
            DO;                                                         00006260
  L190:                                                                 00006270
               FEIL_MELD_NR           =     500;                        00006280
               FEIL_VED_LABEL         =    '190';                       00006290
               DB_STATUS_KODE         =     RF1.STATUS_KODE;            00006300
               GO TO RETUR;                                             00006310
            END;                                                        00006320
                                                                        00006330
      /*------------------------------------------------------------- */00006340
      /* SJEKKER OM DET LIGGER EN ORDINÆR INNTEKT PÅ DET SAMME ÅRET   */00006350
      /* SOM DEN FÅRELØPIGE. HVIS SÅ ER TILFELLET, ER BEH. I BEREGNING*/00006360
      /* UTFØRT MED FEIL INNTEKT. BLANKETTEN FORKASTES MED MELDING.   */00006370
      /* ------------------------------------------------------------ */00006380
                                                                        00006390
      CALL PLITDLI                         (W02_PARM_CT_5,              00006400
                                            W02_GU,                     00006410
                                            RF1,                        00006420
                                            W01_IO,                     00006430
                                            SSA1_RF0PERSN,              00006440
                                            SSA2_PINNTEKT);             00006450
                                                                        00006460
      IF UIBFCTR                     ^=     UIB_RC_OK        THEN       00006470
         DO;                                                            00006480
  L192:                                                                 00006490
            FEIL_MELD_NR              =     500;                        00006500
            FEIL_VED_LABEL            =    '192';                       00006510
            DB_STATUS_KODE            =     RF1.STATUS_KODE;            00006520
            GO TO RETUR;                                                00006530
         END;                                                           00006540
                                                                        00006550
      IF RF1.STATUS_KODE              =    '  '              THEN       00006560
         DO;                                                            00006570
  L194:                                                                 00006580
                                                                        00006590
    /*    IF W02_PI_TYPE     = 'J' !                                    00006600
             W02_PI_TYPE     = 'K' !                                    00006610
             W02_PI_TYPE     = 'L'      THEN */                         00006620
             /*TRUDE 150707 PGA OMSORG OG AFP FOREL. INNT*/             00006630
                                                                        00006640
          TEST_B01   = B00.PI_KODE(W02_I,W02_ÅR);                       00006650
          IF  B00.PI_KODE(W02_I,W02_ÅR) = 'J' !                         00006660
              B00.PI_KODE(W02_I,W02_ÅR) = 'K' !                         00006670
              B00.PI_KODE(W02_I,W02_ÅR) = 'L' THEN                      00006680
            GO TO RETUR;                                                00006690
                                                                        00006700
            FEIL_MELD_NR              =     506;                        00006710
            FEIL_VED_LABEL            =    '194';                       00006720
            DB_STATUS_KODE            =     RF1.STATUS_KODE;            00006730
            GO TO RETUR;                                                00006740
         END;                                                           00006750
      ELSE                                                              00006760
         IF RF1.STATUS_KODE          ^=     'GE'             THEN       00006770
            DO;                                                         00006780
  L196:                                                                 00006790
               FEIL_MELD_NR           =      500;                       00006800
               FEIL_VED_LABEL         =     '196';                      00006810
               DB_STATUS_KODE         =      RF1.STATUS_KODE;           00006820
               GO TO RETUR;                                             00006830
            END;                                                        00006840
                                                                        00006850
                                                                        00006860
   RETUR:                                                               00006870
    END P_SJEKK_INNTEKT;                                                00006880
                                                                        00006890
                                                                        00006900
                                                                        00006910
    %PAGE;                                                              00006920
    /* ************************************************************** */00006930
    /*                                                                */00006940
    /* PROCEDURE FOR Å LEGGE INN INNTEKTS-SEGMENTENE.                 */00006950
    /*                                                                */00006960
    /* ************************************************************** */00006970
                                                                        00006980
    P_SKRIV_INNTEKT_TIL_BASEN :                                         00006990
      PROC;                                                             00007000
                                                                        00007010
      CALL PLITDLI                              (W02_PARM_CT_5,         00007020
                                                 W02_ISRT,              00007030
                                                 RF1,                   00007040
                                                 W01_PINT,              00007050
                                                 SSA1_RF0PERSN,         00007060
                                                 SSA_UQUAL);            00007070
                                                                        00007080
      IF RF1.STATUS_KODE                    ^=   '  '                   00007090
        ! UIBFCTR                           ^=   UIB_RC_OK  THEN        00007100
        DO;                                                             00007110
          /* ******************************************************** */00007120
          /*  UAKSEPTABEL KODE FRA  :   UIB                           */00007130
          /*                            RF1.STATUS_KODE               */00007140
          /* ******************************************************** */00007150
  L200:                                                                 00007160
          FEIL_MELD_NR              =   500;                            00007170
          FEIL_VED_LABEL            =  '200';                           00007180
          DB_STATUS_KODE            =   RF1.STATUS_KODE;                00007190
        END;                                                            00007200
    END P_SKRIV_INNTEKT_TIL_BASEN;                                      00007210
                                                                        00007220
                                                                        00007230
                                                                        00007240
    %PAGE;                                                              00007250
    /* ************************************************************** */00007260
    /*                                                                */00007270
    /* PROCEDURE FOR Å INSERTE /  REPLACE  :  TILBERPO                */00007280
    /*                                                                */00007290
    /* ************************************************************** */00007300
                                                                        00007310
    P_SKRIV_TILBERPO:                                                   00007320
      PROC;                                                             00007330
                                                                        00007340
      SSA_UQUAL                             =   'TILBERPO ';            00007350
      CALL PLITDLI                              (W02_PARM_CT_5,         00007360
                                                 W02_GHU,               00007370
                                                 RF1,                   00007380
                                                 W01_IO,                00007390
                                                 SSA1_RF0PERSN,         00007400
                                                 SSA_UQUAL);            00007410
                                                                        00007420
      IF  UIBFCTR                          ^=   UIB_RC_OK  THEN         00007430
        DO;                                                             00007440
          /* ******************************************************** */00007450
          /*  UAKSEPTABEL KODE FRA  :   UIB                           */00007460
          /* ******************************************************** */00007470
  L210:                                                                 00007480
          FEIL_MELD_NR                      =   500;                    00007490
          FEIL_VED_LABEL                    =  '210';                   00007500
          GO   TO  RETUR;                                               00007510
        END;                                                            00007520
                                                                        00007530
      W01_IO                                =    W01_HJELPE_IO;         00007540
                                                                        00007550
      IF RF1.STATUS_KODE                    =    '  '             THEN  00007560
        DO;                                                             00007570
          CALL PLITDLI                          (W02_PARM_CT_3,         00007580
                                                 W02_REPL,              00007590
                                                 RF1,                   00007600
                                                 W01_IO);               00007610
                                                                        00007620
          IF  RF1.STATUS_KODE              ^=    '  '                   00007630
            ! UIBFCTR                      ^=   UIB_RC_OK  THEN         00007640
            DO;                                                         00007650
            /* **************************************************** */  00007660
            /*  UAKSEPTABEL KODE FRA  :   UIB                       */  00007670
            /*                            RF1.STATUS_KODE           */  00007680
            /* **************************************************** */  00007690
  L220:                                                                 00007700
            FEIL_MELD_NR              =   500;                          00007710
            FEIL_VED_LABEL            =  '220';                         00007720
            DB_STATUS_KODE            =   RF1.STATUS_KODE;              00007730
            GO TO     RETUR;                                            00007740
            END;                                                        00007750
        END;                                                            00007760
      ELSE                                                              00007770
        IF RF1.STATUS_KODE            =    'GE'             THEN        00007780
          DO;                                                           00007790
            /* **************************************************** */  00007800
            /*  TILBERPO LÅ IKKE INNE FRA FØR .                     */  00007810
            /* **************************************************** */  00007820
                                                                        00007830
            CALL P_SKRIV_BARN_AV_ROT;                                   00007840
                                                                        00007850
            IF   FEIL_MELD_NR         >   0                  THEN       00007860
                 GO   TO   RETUR;                                       00007870
          END;                                                          00007880
        ELSE                                                            00007890
          DO;                                                           00007900
            /* **************************************************** */  00007910
            /*  FEIL KODE VED GHU PÅ TILBERPO                       */  00007920
            /* **************************************************** */  00007930
  L230:                                                                 00007940
            FEIL_MELD_NR              =   500;                          00007950
            FEIL_VED_LABEL            =  '230';                         00007960
            DB_STATUS_KODE            =   RF1.STATUS_KODE;              00007970
            GO TO     RETUR;                                            00007980
          END;                                                          00007990
                                                                        00008000
  RETUR:                                                                00008010
    END P_SKRIV_TILBERPO;                                               00008020
                                                                        00008030
                                                                        00008040
                                                                        00008050
    %PAGE;                                                              00008060
    /* ************************************************************** */00008070
    /*                                                                */00008080
    /* PROCEDURE FOR Å FJERNE    :   STATUS                           */00008090
    /*                                                                */00008100
    /* ************************************************************** */00008110
                                                                        00008120
    P_FJERN_STATUS:                                                     00008130
      PROC;                                                             00008140
                                                                        00008150
      CALL PLITDLI                              (W02_PARM_CT_5,         00008160
                                                 W02_GHU,               00008170
                                                 RF3,                   00008180
                                                 W01_IO,                00008190
                                                 SSA3_RF0PERSN,         00008200
                                                 SSA1_STATUS);          00008210
                                                                        00008220
      IF  UIBFCTR                          ^=   UIB_RC_OK  THEN         00008230
        DO;                                                             00008240
          /* ******************************************************** */00008250
          /*  UAKSEPTABEL KODE FRA  :   UIB                           */00008260
          /* ******************************************************** */00008270
  L240:                                                                 00008280
          FEIL_MELD_NR                      =   500;                    00008290
          FEIL_VED_LABEL                    =  '240';                   00008300
          GO   TO  RETUR;                                               00008310
        END;                                                            00008320
                                                                        00008330
      IF RF3.STATUS_KODE                    =    '  '             THEN  00008340
        DO;                                                             00008350
          CALL PLITDLI                          (W02_PARM_CT_3,         00008360
                                                 W02_DLET,              00008370
                                                 RF3,                   00008380
                                                 W01_IO);               00008390
                                                                        00008400
          IF  RF3.STATUS_KODE              ^=    '  '                   00008410
            ! UIBFCTR                      ^=   UIB_RC_OK  THEN         00008420
            DO;                                                         00008430
            /* **************************************************** */  00008440
            /*  UAKSEPTABEL KODE FRA  :   UIB                       */  00008450
            /*                            RF3.STATUS_KODE           */  00008460
            /* **************************************************** */  00008470
  L250:                                                                 00008480
            FEIL_MELD_NR              =   500;                          00008490
            FEIL_VED_LABEL            =  '250';                         00008500
            DB_STATUS_KODE            =   RF3.STATUS_KODE;              00008510
            GO TO     RETUR;                                            00008520
            END;                                                        00008530
        END;                                                            00008540
                                                                        00008550
      ELSE                                                              00008560
        IF RF3.STATUS_KODE                 ^=    'GE'             THEN  00008570
          DO;                                                           00008580
            /* **************************************************** */  00008590
            /*  UAKSEPTABEL KODE FRA  :   RF3.STATUS_KODE           */  00008600
            /* **************************************************** */  00008610
  L260:                                                                 00008620
            FEIL_MELD_NR              =   500;                          00008630
            FEIL_VED_LABEL            =  '260';                         00008640
            DB_STATUS_KODE            =   RF3.STATUS_KODE;              00008650
            GO TO     RETUR;                                            00008660
          END;                                                          00008670
                                                                        00008680
  RETUR:                                                                00008690
    END P_FJERN_STATUS;                                                 00008700
                                                                        00008710
                                                                        00008720
                                                                        00008730
    %PAGE;                                                              00008740
    /* ************************************************************** */00008750
    /*                                                                */00008760
    /* PROCEDURE FOR Å FJERNE    SISTE / NEST SISTE   STATUS FOR :    */00008770
    /*                                                                */00008780
    /*       SØKER                                                    */00008790
    /*       SØKERS TILKNYTTNINGER                                    */00008800
    /*       TILKNYTTNINGENE  TIL SØKERS TILKNYTTNINGER               */00008810
    /*                                                                */00008820
    /* ************************************************************** */00008830
                                                                        00008840
    P_LEST_TILKN_FJERNET_STATUS :                                       00008850
      PROC;                                                             00008860
                                                                        00008870
      W02_DLI_FUNC                    =   'GU  '     ;                  00008880
      SSA_UQUAL                       =   'TILKN    ';                  00008890
                                                                        00008900
      /************************************************************** */00008910
      /*  LESER TILKNYTTNINGENE TIL AKT. PERSON HVIS HAN IKKE ER DØD  */00008920
      /************************************************************** */00008930
                                                                        00008940
      IF PERSON_IKKE_DØD                                      THEN      00008950
                                                                        00008960
         DO WHILE   ( P_LEST_TILKN_PCB1 );                              00008970
                                                                        00008980
            SSA2_RF0PERSN.PKEY           =    W01_TILKN1.FNR_TILKN;     00008990
            W02_DLI_FUNC                 =   'GU  '         ;           00009000
                                                                        00009010
            /* *************************************************** */   00009020
            /* LESER TILKNYTTNINGENE TIL SØKER'S TILKNYTTNINGER.   */   00009030
            /* FJERNER DERES STATUS_SEGM. HVIS DE ER FORSKJELLIG   */   00009040
            /* FRA SØKER.                                          */   00009050
            /* *************************************************** */   00009060
                                                                        00009070
            IF W01_TILKN1.TILKNYTNINGSKODE  ^=  'D'       THEN          00009080
                                                                        00009090
               DO WHILE   ( P_LEST_TILKN_PCB2 );                        00009100
                                                                        00009110
                  IF W01_TILKN2.FNR_TILKN ^=  SSA1_RF0PERSN.PKEY THEN   00009120
                     DO;                                                00009130
                        SSA3_RF0PERSN.PKEY =  W01_TILKN2.FNR_TILKN;     00009140
                        CALL P_FJERN_STATUS;                            00009150
                                                                        00009160
                        IF FEIL_MELD_NR    >  0                  THEN   00009170
                           GO TO  RETUR;                                00009180
                     END;                                               00009190
                                                                        00009200
                  W02_DLI_FUNC           =   'GN  ';                    00009210
                                                                        00009220
               END;  /*    DO WHILE  (  P_LEST_TILKN_PCB2 )     */      00009230
                                                                        00009240
                                                                        00009250
            IF FEIL_MELD_NR          >  0      THEN                     00009260
               DO;                                                      00009270
                  /* ****************************************** */      00009280
                  /* FEIL VED LESING AV    :      TILKN         */      00009290
                  /* ****************************************** */      00009300
                                                                        00009310
                  GO TO  RETUR;                                         00009320
               END;                                                     00009330
                                                                        00009340
            SSA3_RF0PERSN.PKEY          =  W01_TILKN1.FNR_TILKN;        00009350
            CALL P_FJERN_STATUS;                                        00009360
                                                                        00009370
            IF FEIL_MELD_NR             >  0         THEN               00009380
               GO TO  RETUR;                                            00009390
                                                                        00009400
            W02_DLI_FUNC           =   'GN  ';                          00009410
                                                                        00009420
         END;       /*   DO  WHILE          ( P_LEST_TILKN_PCB1 ) */    00009430
                                                                        00009440
                                                                        00009450
      IF FEIL_MELD_NR          >  0      THEN                           00009460
         DO;                                                            00009470
            /* ****************************************** */            00009480
            /* FEIL VED LESING AV    :      TILKN         */            00009490
            /* ****************************************** */            00009500
                                                                        00009510
            GO TO  RETUR;                                               00009520
         END;                                                           00009530
                                                                        00009540
      SSA3_RF0PERSN.PKEY       =     SSA1_RF0PERSN.PKEY;                00009550
      CALL P_FJERN_STATUS;                                              00009560
                                                                        00009570
      IF FEIL_MELD_NR          >     0         THEN                     00009580
         GO TO  RETUR;                                                  00009590
                                                                        00009600
  RETUR:                                                                00009610
    END P_LEST_TILKN_FJERNET_STATUS;                                    00009620
                                                                        00009630
                                                                        00009640
                                                                        00009650
    %PAGE;                                                              00009660
    /* ************************************************************** */00009670
    /*                                                                */00009680
    /* PROCEDURE FOR Å LESE TILKNYTTNINGENE TIL STATUS-SEGM.          */00009690
    /*                                                                */00009700
    /* PROCEDUREN RETURNERER MED VERDIEN SANN (1) / USANN (0) .       */00009710
    /*                                                                */00009720
    /* ************************************************************** */00009730
                                                                        00009740
    P_LEST_TILKN_PCB1 :                                                 00009750
      PROC           RETURNS (BIT(1));                                  00009760
                                                                        00009770
      DCL   W01_RETUR                            BIT   (1) INIT ('0'B); 00009780
                                                                        00009790
      CALL PLITDLI                              (W02_PARM_CT_6,         00009800
                                                 W02_DLI_FUNC,          00009810
                                                 RF1,                   00009820
                                                 W01_TILKN1,            00009830
                                                 SSA1_RF0PERSN,         00009840
                                                 SSA1_STATUS,           00009850
                                                 SSA_UQUAL);            00009860
                                                                        00009870
      IF UIBFCTR                           ^=    UIB_RC_OK        THEN  00009880
         DO;                                                            00009890
            /* ************************************************** */    00009900
            /* UAKSEPTABEL KODE FRA   :      UIB                  */    00009910
            /* ************************************************** */    00009920
  L270:                                                                 00009930
            FEIL_MELD_NR                     =     500;                 00009940
            FEIL_VED_LABEL                   =    '270';                00009950
         END;                                                           00009960
                                                                        00009970
      SELECT  ( RF1.STATUS_KODE   );                                    00009980
                                                                        00009990
         WHEN ('  ' , 'GA' , 'GK' )                                     00010000
            DO;                                                         00010010
             /* ************************************************ */     00010020
             /* LEST INN EN   :   TILKN                          */     00010030
            /* ************************************************* */     00010040
                                                                        00010050
            W01_RETUR                        =    '1'B;                 00010060
         END;                                                           00010070
                                                                        00010080
         WHEN ('GE' , 'GB')                                             00010090
            DO;                                                         00010100
              /* ********************************************* */       00010110
              /* LOVLIG KODE MEN IKKE FUNNET NOEN   : TILKN    */       00010120
              /* ********************************************* */       00010130
                                                                        00010140
              W01_RETUR                        =    '0'B;               00010150
         END;                                                           00010160
                                                                        00010170
         OTHERWISE                                                      00010180
            DO;                                                         00010190
               /* ************************************************* */  00010200
               /* LEST INN EN   :   TILKN                           */  00010210
               /* ************************************************* */  00010220
                                                                        00010230
  L280:                                                                 00010240
               FEIL_MELD_NR                     =     500;              00010250
               FEIL_VED_LABEL                   =    '280';             00010260
               DB_STATUS_KODE                   =     RF1.STATUS_KODE;  00010270
               W01_RETUR                        =     '0'B;             00010280
            END;                                                        00010290
      END;     /*   SELECT (RF1.STATUS_KODE )                   */      00010300
                                                                        00010310
  RETUR:                                                                00010320
      RETURN (W01_RETUR);                                               00010330
    END P_LEST_TILKN_PCB1;                                              00010340
                                                                        00010350
                                                                        00010360
                                                                        00010370
    %PAGE;                                                              00010380
    /* ************************************************************** */00010390
    /*                                                                */00010400
    /* PROCEDURE FOR Å LESE TILKNYTTNINGENE TIL STATUS-SEGM.          */00010410
    /*                                                                */00010420
    /* PROCEDUREN RETURNERER MED VERDIEN SANN (1) / USANN (0) .       */00010430
    /*                                                                */00010440
    /* ************************************************************** */00010450
                                                                        00010460
    P_LEST_TILKN_PCB2 :                                                 00010470
      PROC           RETURNS (BIT(1));                                  00010480
                                                                        00010490
      DCL   W01_RETUR                            BIT   (1) INIT ('0'B); 00010500
                                                                        00010510
      CALL PLITDLI                              (W02_PARM_CT_6,         00010520
                                                 W02_DLI_FUNC,          00010530
                                                 RF2,                   00010540
                                                 W01_TILKN2,            00010550
                                                 SSA2_RF0PERSN,         00010560
                                                 SSA1_STATUS,           00010570
                                                 SSA_UQUAL);            00010580
                                                                        00010590
      IF   UIBFCTR                         ^=    UIB_RC_OK        THEN  00010600
        DO;                                                             00010610
           /* ******************************************************* */00010620
           /* UAKSEPTABEL KODE FRA   :      UIB                       */00010630
           /* ******************************************************* */00010640
  L320:                                                                 00010650
           FEIL_MELD_NR                     =     500;                  00010660
           FEIL_VED_LABEL                   =    '320';                 00010670
        END;                                                            00010680
                                                                        00010690
      SELECT   ( RF2.STATUS_KODE );                                     00010700
         WHEN  ( '  ' , 'GA' , 'GK' )                                   00010710
            DO;                                                         00010720
               /* ************************************************** */ 00010730
               /* LEST INN EN  :    TILKN                            */ 00010740
               /* ************************************************** */ 00010750
                                                                        00010760
               W01_RETUR                        =    '1'B;              00010770
            END;                                                        00010780
                                                                        00010790
         WHEN  ( 'GE' , 'GB' )                                          00010800
            DO;                                                         00010810
               /* ************************************************** */ 00010820
               /* FINNES IKKE  :    TILKN                            */ 00010830
               /* ************************************************** */ 00010840
                                                                        00010850
               W01_RETUR                        =    '0'B;              00010860
            END;                                                        00010870
                                                                        00010880
         OTHERWISE                                                      00010890
            DO;                                                         00010900
               /* ************************************************* */  00010910
               /* UAKSEPTABEL KODE FRA   :      RF1.STATUS_KODE     */  00010920
               /* ************************************************* */  00010930
  L330:                                                                 00010940
               FEIL_MELD_NR                     =     500;              00010950
               FEIL_VED_LABEL                   =    '330';             00010960
               DB_STATUS_KODE                   =     RF2.STATUS_KODE;  00010970
               W01_RETUR                        =     '0'B;             00010980
            END;                                                        00010990
      END;                                                              00011000
                                                                        00011010
  RETUR:                                                                00011020
      RETURN (W01_RETUR);                                               00011030
    END P_LEST_TILKN_PCB2;                                              00011040
                                                                        00011050
                                                                        00011060
                                                                        00011070
    %PAGE;                                                              00011080
    /* ************************************************************ */  00011090
    /*                                                              */  00011100
    /* PROCEDURE FOR A SKRIVE UNDERLIGGENDE SEGMENTER TIL           */  00011110
    /*                                                              */  00011120
    /* STATUS-SEGM.                                                 */  00011130
    /*                                                              */  00011140
    /* ************************************************************ */  00011150
                                                                        00011160
    P_SKRIV_BARN_AV_STATUS :                                            00011170
      PROC;                                                             00011180
                                                                        00011190
      W01_IO                           =    W01_HJELPE_IO;              00011200
      CALL PLITDLI                         (W02_PARM_CT_6,              00011210
                                            W02_ISRT,                   00011220
                                            RF1,                        00011230
                                            W01_IO,                     00011240
                                            SSA1_RF0PERSN,              00011250
                                            SSA1_STATUS,                00011260
                                            SSA_UQUAL);                 00011270
                                                                        00011280
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=    UIB_RC_OK                   00011290
        !  RF1.STATUS_KODE            ^=   '  '    THEN                 00011300
        DO;                                                             00011310
           /* ******************************************************* */00011320
           /* UAKSEPTABEL KODE FRA   :      UIB                       */00011330
           /*                               RF1.STATUS_KODE           */00011340
           /* ******************************************************* */00011350
  L340:                                                                 00011360
           FEIL_MELD_NR                     =     500;                  00011370
           FEIL_VED_LABEL                   =    '340';                 00011380
           DB_STATUS_KODE                   =     RF1.STATUS_KODE;      00011390
        END;                                                            00011400
    END P_SKRIV_BARN_AV_STATUS;                                         00011410
                                                                        00011420
                                                                        00011430
                                                                        00011440
    %PAGE;                                                              00011450
    /* ************************************************************ */  00011460
    /*                                                              */  00011470
    /* PROCEDURE FOR A SKRIVE UNDERLIGGENDE SEGMENTER TIL           */  00011480
    /*                                                              */  00011490
    /* STATUS-SEGM. FOR UFØRE-HISTORIKKEN.                          */  00011500
    /*                                                              */  00011510
    /* ************************************************************ */  00011520
                                                                        00011530
    P_SKRIV_BARN_AV_UFØRHIST:                                           00011540
      PROC;                                                             00011550
                                                                        00011560
      W01_IO                           =    W01_HJELPE_IO;              00011570
      CALL PLITDLI                         (W02_PARM_CT_7,              00011580
                                            W02_ISRT,                   00011590
                                            RF1,                        00011600
                                            W01_IO,                     00011610
                                            SSA1_RF0PERSN,              00011620
                                            SSA1_STATUS,                00011630
                                            SSA1_UFØRHIST,              00011640
                                            SSA_UQUAL);                 00011650
                                                                        00011660
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=    UIB_RC_OK                   00011670
        !  RF1.STATUS_KODE            ^=    '  '    THEN                00011680
        DO;                                                             00011690
          /* ******************************************************** */00011700
          /*  UAKSEPTABEL KODE FRA  :   UIB                           */00011710
          /*                            RF1.STATUS_KODE               */00011720
          /* ******************************************************** */00011730
  L350:                                                                 00011740
          FEIL_MELD_NR              =   500;                            00011750
          FEIL_VED_LABEL            =  '350';                           00011760
          DB_STATUS_KODE            =   RF1.STATUS_KODE;                00011770
        END;                                                            00011780
    END P_SKRIV_BARN_AV_UFØRHIST;                                       00011790
                                                                        00011800
                                                                        00011810
         P_SKRIV_BARN_AV_YRKEHIST:                                      00011820
           PROC;                                                        00011830
                                                                        00011840
           W01_IO                      =    W01_HJELPE_IO;              00011850
           CALL PLITDLI                    (W02_PARM_CT_7,              00011860
                                                 W02_ISRT,              00011870
                                                 RF1,                   00011880
                                                 W01_IO,                00011890
                                                 SSA1_RF0PERSN,         00011900
                                                 SSA1_STATUS,           00011910
                                                 SSA1_YRKEHIST,         00011920
                                                 SSA_UQUAL);            00011930
                                                                        00011940
           IF DLIUIB.UIBRCODE.UIBFCTR ^=    UIB_RC_OK                   00011950
             ! RF1.STATUS_KODE        ^=    '  '    THEN                00011960
             DO;                                                        00011970
               /* *************************************************** */00011980
               /* UAKSEPTABEL KODE FRA : UIB                          */00011990
               /*                       RF1.STATUS_KODE               */00012000
               /* *************************************************** */00012010
       L360:                                                            00012020
               FEIL_MELD_NR         =   500;                            00012030
               FEIL_VED_LABEL       =  '360';                           00012040
               DB_STATUS_KODE       =   RF1.STATUS_KODE;                00012050
             END;                                                       00012060
         END P_SKRIV_BARN_AV_YRKEHIST;                                  00012070
                                                                        00012080
                                                                        00012090
                                                                        00012100
    %PAGE;                                                              00012110
    /* ************************************************************** */00012120
    /*                                                                */00012130
    /* PROCEDURE SJEKKE OM DET FINNES SPESIALOPPLYSNINGER             */00012140
    /*                                                                */00012150
    /* PROCEDUREN RETURNERER MED VERDIEN SANN (1) / USANN (0) .       */00012160
    /*                                                                */00012170
    /* ************************************************************** */00012180
                                                                        00012190
    P_SPESIALOPPLYSNINGER :                                             00012200
      PROC                   (SPESOPPL)                                 00012210
                     RETURNS (BIT(1));                                  00012220
                                                                        00012230
      DCL   W01_RETUR                         BIT   (1) INIT ('0'B);    00012240
                                                                        00012250
      /* ************************************************************ */00012260
      /*   OMRÅDET FOR  :    SPESIALOPPLYSNINGER                      */00012270
      /* ************************************************************ */00012280
                                                                        00012290
      DCL 1 SPESOPPL,                                                   00012300
      %INCLUDE P0019939;               /* SPESOPPL                   */ 00012310
                                                                        00012320
      /* ************************************************************ */00012330
      /*    FERDIG MED DEKLARASJONENE .                               */00012340
      /*                                                              */00012350
      /*    EKSEKVERINGEN STARTER.                                    */00012360
      /* ************************************************************ */00012370
                                                                        00012380
      SELECT;                                                           00012390
        WHEN (SPESOPPL.STATSBORGER              ^= 0 )                  00012400
              W01_RETUR            = '1'B;                              00012410
        WHEN (SPESOPPL.FRAVIK_FLYKTN            ^= ' ' )                00012420
              W01_RETUR            = '1'B;                              00012430
        WHEN (SPESOPPL.OVERKOMP_UTL             ^= ' ' )                00012440
              W01_RETUR            = '1'B;                              00012450
        WHEN (SPESOPPL.BOSATT                   ^= 0 )                  00012460
              W01_RETUR            = '1'B;                              00012470
        WHEN (SPESOPPL.FRAVIK_BOSATT            ^= ' ' )                00012480
              W01_RETUR            = '1'B;                              00012490
        WHEN (SPESOPPL.FRAVIK_TRYGDET_3ÅR       ^= ' ' )                00012500
              W01_RETUR            = '1'B;                              00012510
        WHEN (SPESOPPL.FRAVIK_19_3              ^= ' ' )                00012520
              W01_RETUR            = '1'B;                              00012530
        WHEN (SPESOPPL.FRAVIK_8_1               ^= ' ' )                00012540
              W01_RETUR            = '1'B;                              00012550
        WHEN (SPESOPPL.FRAVIK_10_1              ^= ' ' )                00012560
              W01_RETUR            = '1'B;                              00012570
        WHEN (SPESOPPL.KONVENSJON               ^= ' ' )                00012580
              W01_RETUR            = '1'B;                              00012590
        WHEN (SPESOPPL.IKKE_GP                  ^= ' ' )                00012600
              W01_RETUR            = '1'B;                              00012610
        WHEN (SPESOPPL.TRYGDET_DØD              ^= ' ' )                00012620
              W01_RETUR            = '1'B;                              00012630
        WHEN (SPESOPPL.TRYGDET_3ÅR_DØD          ^= ' ' )                00012640
              W01_RETUR            = '1'B;                              00012650
        WHEN (SPESOPPL.UFØR_UNDER_BOTID         ^= ' ' )                00012660
              W01_RETUR            = '1'B;                              00012670
        WHEN (SPESOPPL.TT_FRAMT_UFT             ^= 0 )                  00012680
              W01_RETUR            = '1'B;                              00012690
        WHEN (SPESOPPL.TT_FRAMT_VED_FRAVIK_8_1  ^= 0 )                  00012700
              W01_RETUR            = '1'B;                              00012710
        WHEN (SPESOPPL.TT_FRAMT_DØD             ^= 0 )                  00012720
              W01_RETUR            = '1'B;                              00012730
        WHEN (SPESOPPL.TT_FRAMT_VED_FRAVIK_10_1 ^= 0 )                  00012740
              W01_RETUR            = '1'B;                              00012750
        WHEN (SPESOPPL.TT_VENT_UTL              ^= 0 )                  00012760
              W01_RETUR            = '1'B;                              00012770
        WHEN (SPESOPPL.IKKE_TT_FRAMT_DØD        ^= ' ' )                00012780
              W01_RETUR            = '1'B;                              00012790
        WHEN (SPESOPPL.PENSJONSTRYGDET          ^= ' ' )                00012800
              W01_RETUR            = '1'B;                              00012810
        WHEN (SPESOPPL.MINST_20ÅR_BOTID         ^= ' ' )                00012820
              W01_RETUR            = '1'B;                              00012830
        WHEN (SPESOPPL.FRAVIK_BOSATT_KONVENSJON ^= ' ' )                00012840
              W01_RETUR            = '1'B;                              00012850
        WHEN (SPESOPPL.KONVENSJON_LAND          ^= 0   )                00012860
              W01_RETUR            = '1'B;                              00012870
        WHEN (SPESOPPL.FRAVIK_BOSATT_EØS        ^= ' ' )                00012880
              W01_RETUR            = '1'B;                              00012890
        WHEN (SPESOPPL.TP_NORDISK               ^= 0   )                00012900
              W01_RETUR            = '1'B;                              00012910
        WHEN (SPESOPPL.TP_NORDISK_LAND          ^= 0   )                00012920
              W01_RETUR            = '1'B;                              00012930
        WHEN (SPESOPPL.TT_KONVENSJON_ÅR         ^= 0   )                00012940
              W01_RETUR            = '1'B;                              00012950
        WHEN (SPESOPPL.UNNTAK_12_2        ^= ' ' )    /*9802*/          00012960
              W01_RETUR            = '1'B;                              00012970
        WHEN (SPESOPPL.TT_PÅ                    ^= ' ' )                00012980
              W01_RETUR            = '1'B;                              00012990
        WHEN (SPESOPPL.TT_FRAMTIDIG             ^= ' ' )                00013000
              W01_RETUR            = '1'B;                              00013010
        WHEN (SPESOPPL.TT_FAKTISK               ^= ' ' )                00013020
              W01_RETUR            = '1'B;                              00013030
        WHEN (SPESOPPL.FRAVIK_5_1               ^= ' ' )                00013040
              W01_RETUR            = '1'B;                              00013050
        WHEN (SPESOPPL.UNG_UFØR                 ^= ' ' )                00013060
              W01_RETUR            = '1'B;                              00013070
        OTHERWISE                                                       00013080
              W01_RETUR            = '0'B;                              00013090
      END;                                                              00013100
      RETURN (W01_RETUR);                                               00013110
    END P_SPESIALOPPLYSNINGER;                                          00013120
                                                                        00013130
                                                                        00013140
                                                                        00013150
    %PAGE;                                                              00013160
    %INCLUDE R0015430; /* PROC. FOR Å SKRIVE :        SISTE STATUS   */ 00013170
                                                                        00013180
    %PAGE;                                                              00013190
    %INCLUDE R0015470; /* PROC. FOR Å SKRIVE :   NEST SISTE STATUS   */ 00013200
                                                                        00013210
                                                                        00013220
  L999:                                                                 00013230
                                                                        00013240
 /*HL 0794 : ********** */                                              00013250
                                                                        00013260
    DIV_PERIODE = '';                                                   00013270
                                                                        00013280
 /* **********************************                                  00013290
                                                                        00013300
    DIV_PARAM_OMR.FULLT_SÆRTILLEGG      = 0                             00013310
    DIV_PARAM_OMR.ENGANGSBELØP_11_7 (1) = 0                             00013320
    DIV_PARAM_OMR.ENGANGSBELØP_11_7 (2) = 0                             00013330
    DIV_PARAM_OMR.GARANTITILLEGG_TP (1) = 0                             00013340
    DIV_PARAM_OMR.GARANTITILLEGG_TP (2) = 0                             00013350
    DIV_PARAM_OMR.FOLKETRYGD        (1) = 0                             00013360
    DIV_PARAM_OMR.FOLKETRYGD        (2) = 0                             00013370
    DIV_PARAM_OMR.FRIBELØP_MINSTE   (1) = 0                             00013380
    DIV_PARAM_OMR.FRIBELØP_MINSTE   (2) = 0                             00013390
    DIV_PARAM_OMR.FRIBELØP_SÆRBARN  (1) = 0                             00013400
    DIV_PARAM_OMR.FRIBELØP_SÆRBARN  (2) = 0                             00013410
    DIV_PARAM_OMR.FRIBELØP_FELLESBARN(1) = 0                            00013420
    DIV_PARAM_OMR.FRIBELØP_FELLESBARN(2) = 0                            00013430
    DIV_PARAM_OMR.FULLT_BT_V            = ' '                           00013440
    DIV_PARAM_OMR.FULLT_BT_W            = ' '                           00013450
    DIV_PARAM_OMR.FULLT_ET              = ' '                           00013460
    DIV_PARAM_OMR.RETT_TIL_ÅFT      (1) = ' '                           00013470
    DIV_PARAM_OMR.RETT_TIL_ÅFT      (2) = ' '                           00013480
    DIV_PARAM_OMR.AP_KODE_AEY       (1) = ' '                           00013490
    DIV_PARAM_OMR.AP_KODE_AEY       (2) = ' '                           00013500
    DIV_PARAM_OMR.TAI               (1) = 0                             00013510
    DIV_PARAM_OMR.TAI               (2) = 0                             00013520
    DIV_PARAM_OMR.REGN_1291             = ' '                           00013530
                                                                        00013540
 ********************************************* */                       00013550
                                                                        00013560
    EXEC CICS RETURN;                                                   00013570
  END  R001540;                                                         00013580
