 /*       SIST ENDRET 12/11-86 07.57.43 AV   LUNDEBY                  */00000000
 /*       SIST ENDRET 25/03-85 13.23.28 AV   HERMAN                   */00000010
 /*       SIST ENDRET 15/02-83 15.50.59 AV   JANKR                    */00000020
 /*       SIST ENDRET 06/10-82 10.14.50 AV   JANKR                    */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /*    R0011306 - PROSEDYRE I PLI                SUBRUTINE            */00000050
 /*    PROGRAMMERER:  JAN, SEPTEMBER 1981                             */00000060
 /*HENSIKT:                                                           */00000070
 /*    PROGRAMMET INNEHOLDER:                                         */00000080
 /*        PROSEDYRER FOR Å OVERFØRE DATA FRA TG_TRANS_OMR TIL        */00000090
 /*            SKJERMBILDE (MAP S001131 MAPSET S001133).              */00000100
 /*    PROSEDYRE FOR SKRIVING AV FEILMELDINGER.                       */00000110
 /*BRUK:                                                              */00000120
 /*    OVERFØR_TGUFØRE_MAP:    OVERFØRING AV UFØREDELEN               */00000130
 /*    OVERFØR_TGETTERL_MAP:   OVERFØRING AV ETTERLATTEDELEN          */00000140
 /*    OVERFØR_TGBARN_MAP:     OVERFØRING FORELDRELØSE BARN           */00000150
 /*    OVERFØR_TGAI67_MAP:     OVERFØRING AV AI67-DELEN               */00000160
 /*    SKRIV_FEIL(FEILMNR):    SKRIVING AV FEILMELDINGER              */00000170
 /*                                                                   */00000180
 /*                                                                   */00000190
 %PAGE;                                /*   */                          00000200
 OVERFØR_TGUFØRE_MAP:                                                   00000210
   PROC;                                                                00000220
 /* ***************************************************************** */00000230
 /*                                                                   */00000240
 /*   PROSEDYRA OVERFØRER DATA FRA TG_TRANS_OMR.TGUF TIL              */00000250
 /*   SKJERMBILDE TG_UFØREDELEN.                                      */00000260
 /*   MAP: S001132                                                    */00000270
 /*   MAPSET: S00113                                                  */00000280
 /*                                                                   */00000290
 /* ***************************************************************** */00000300
 %SKIP(2);                                                              00000310
   DCL                                                                  00000320
      NORMAL  CHAR (1),                                                 00000330
      NOR_NUM CHAR (1),                                                 00000340
      BRI_NUM CHAR (1);                                                 00000350
      NORMAL = ' ';                                                     00000360
      NOR_NUM = '&';                                                    00000370
      BRI_NUM = 'Q';                                                    00000380
 %SKIP(2);                                                              00000390
      S001132O.FNRO = F_FELT_PIC_CHAR11 (TGUF.FNR);                     00000400
      S001132O.NAVNO = TGUF.NAVN;                                       00000410
      S001132O.TKNRO = F_FELT_PIC_CHAR4 (TGUF.TKNR);                    00000420
      IF F_FELT_PIC_CHAR5(TGUF.AI63) ^= (5)'0' THEN                     00000430
        AI63O = F_FELT_PIC_CHAR7 (TGUF.AI63 * 100);                     00000440
      IF F_FELT_PIC_CHAR5(TGUF.AI64) ^= (5)'0' THEN                     00000450
        AI64O = F_FELT_PIC_CHAR7 (TGUF.AI64 * 100);                     00000460
      IF F_FELT_PIC_CHAR5(TGUF.AI65) ^= (5)'0' THEN                     00000470
        AI65O = F_FELT_PIC_CHAR7 (TGUF.AI65 * 100);                     00000480
      IF F_FELT_PIC_CHAR5(TGUF.AI66) ^= (5)'0' THEN                     00000490
        AI66O = F_FELT_PIC_CHAR7 (TGUF.AI66 * 100);                     00000500
      IF F_FELT_PIC_CHAR5(TGUF.PI_66) ^= (5)'0' THEN                    00000510
        PI_66O = F_FELT_PIC_CHAR7 (TGUF.PI_66 * 100);                   00000520
 %SKIP(3);                             /*    */                         00000530
 /* FEILMELDINGER MARKERING AV  FELT (ATTRIBUTTENE) */                  00000540
 %SKIP(2);                                                              00000550
      S001132O.DUMMYA = '_';                                            00000560
      IF TGUF.FNRNR = 0 THEN                                            00000570
         S001132O.FNRA = NOR_NUM;                                       00000580
      ELSE                                                              00000590
         DO;                                                            00000600
            S001132O.FNRA = BRI_NUM;                                    00000610
            S001132I.FNRL = CURSOR_POS;                                 00000620
            IF TGUF.FNRNR ^= 999 THEN                                   00000630
               CALL SKRIV_FEIL_UF(TGUF.FNRNR);                          00000640
         END;                                                           00000650
      IF TGUF.NAVNNR = 0 THEN                                           00000660
         S001132O.NAVNA = NORMAL;                                       00000670
      ELSE                                                              00000680
         DO;                                                            00000690
            S001132O.NAVNA = DFHBMBRY;                                  00000700
            S001132I.NAVNL = CURSOR_POS;                                00000710
            IF TGUF.NAVNNR ^= 999 THEN                                  00000720
               CALL SKRIV_FEIL_UF(TGUF.NAVNNR);                         00000730
         END;                                                           00000740
      IF TGUF.TKNRNR = 0 THEN                                           00000750
         S001132O.TKNRA = NOR_NUM;                                      00000760
      ELSE                                                              00000770
         DO;                                                            00000780
            S001132O.TKNRA = BRI_NUM;                                   00000790
            S001132I.TKNRL = CURSOR_POS;                                00000800
            IF TGUF.TKNRNR ^= 999 THEN                                  00000810
               CALL SKRIV_FEIL_UF(TGUF.TKNRNR);                         00000820
         END;                                                           00000830
      IF TGUF.AI63NR = 0 THEN                                           00000840
         AI63A = NOR_NUM;                                               00000850
      ELSE                                                              00000860
         DO;                                                            00000870
            AI63A = BRI_NUM;                                            00000880
            AI63L = CURSOR_POS;                                         00000890
            IF TGUF.AI63NR ^= 999 THEN                                  00000900
               CALL SKRIV_FEIL_UF(TGUF.AI63NR);                         00000910
         END;                                                           00000920
      IF TGUF.AI64NR = 0 THEN                                           00000930
         AI64A = NOR_NUM;                                               00000940
      ELSE                                                              00000950
         DO;                                                            00000960
            AI64A = BRI_NUM;                                            00000970
            AI64L = CURSOR_POS;                                         00000980
            IF TGUF.AI64NR ^= 999 THEN                                  00000990
               CALL SKRIV_FEIL_UF(TGUF.AI64NR);                         00001000
         END;                                                           00001010
      IF TGUF.AI65NR = 0 THEN                                           00001020
         AI65A = NOR_NUM;                                               00001030
      ELSE                                                              00001040
         DO;                                                            00001050
            AI65A = BRI_NUM;                                            00001060
            AI65L = CURSOR_POS;                                         00001070
            IF TGUF.AI65NR ^= 999 THEN                                  00001080
               CALL SKRIV_FEIL_UF(TGUF.AI65NR);                         00001090
         END;                                                           00001100
      IF TGUF.AI66NR = 0 THEN                                           00001110
         AI66A = NOR_NUM;                                               00001120
      ELSE                                                              00001130
         DO;                                                            00001140
            AI66A = BRI_NUM;                                            00001150
            AI66L = CURSOR_POS;                                         00001160
            IF TGUF.AI66NR ^= 999 THEN                                  00001170
               CALL SKRIV_FEIL_UF(TGUF.AI66NR);                         00001180
         END;                                                           00001190
      IF TGUF.PI_66NR = 0 THEN                                          00001200
         PI_66A = NOR_NUM;                                              00001210
      ELSE                                                              00001220
         DO;                                                            00001230
            PI_66A = BRI_NUM;                                           00001240
            PI_66L = CURSOR_POS;                                        00001250
            IF TGUF.PI_66NR ^= 999 THEN                                 00001260
               CALL SKRIV_FEIL_UF(TGUF.PI_66NR);                        00001270
         END;                                                           00001280
   END OVERFØR_TGUFØRE_MAP;                                             00001290
 %PAGE;                                /*    */                         00001300
 /* ***************************************************************** */00001310
 /*                                                                   */00001320
 /*   PROSEDYRA OVERFØRER DATA FRA TG_TRANS_OMR.TGEP TIL              */00001330
 /*   SKJERMBILDE TG_ETTERLATT_EKTEFELLE.                             */00001340
 /*   MAP: S001131                                                    */00001350
 /*   MAPSET: S001133                                                 */00001360
 /*                                                                   */00001370
 /* ***************************************************************** */00001380
 %SKIP(2);                                                              00001390
 OVERFØR_TGETTERL_MAP:                                                  00001400
   PROC;                                                                00001410
 %SKIP(2);                                                              00001420
   DCL                                                                  00001430
      NORMAL  CHAR (1),                                                 00001440
      NOR_NUM CHAR (1),                                                 00001450
      BRI_NUM CHAR (1);                                                 00001460
      NORMAL = ' ';                                                     00001470
      NOR_NUM = '&';                                                    00001480
      BRI_NUM = 'Q';                                                    00001490
 %SKIP;                                                                 00001500
      S001133O.FNRO = F_FELT_PIC_CHAR11 (TGEP.FNR_EK);                  00001510
      S001133O.NAVNO = TGEP.NAVN_EK;                                    00001520
      S001133O.TKNRO = F_FELT_PIC_CHAR4 (TGEP.TKNR_EK);                 00001530
      IF F_FELT_PIC_CHAR5(TGEP.AI63_EK) ^= (5)'0' THEN                  00001540
        AI63_EKO = F_FELT_PIC_CHAR7 (TGEP.AI63_EK * 100);               00001550
      IF F_FELT_PIC_CHAR5(TGEP.AI64_EK) ^= (5)'0' THEN                  00001560
        AI64_EKO = F_FELT_PIC_CHAR7 (TGEP.AI64_EK * 100);               00001570
      IF F_FELT_PIC_CHAR5(TGEP.AI65_EK) ^= (5)'0' THEN                  00001580
        AI65_EKO = F_FELT_PIC_CHAR7 (TGEP.AI65_EK * 100);               00001590
      IF F_FELT_PIC_CHAR5(TGEP.AI66_EK) ^= (5)'0' THEN                  00001600
        AI66_EKO = F_FELT_PIC_CHAR7 (TGEP.AI66_EK * 100);               00001610
      IF F_FELT_PIC_CHAR5(TGEP.PI_66_EK) ^= (5)'0' THEN                 00001620
        PI_66_EKO = F_FELT_PIC_CHAR7 (TGEP.PI_66_EK * 100);             00001630
 %SKIP(3);                             /*  */                           00001640
 /*  MARKERING AV ATTRIBUTTER   */                                      00001650
 %SKIP;                                                                 00001660
      S001133O.DUMMYA = '_';                                            00001670
      IF TGEP.FNR_EKNR = 0 THEN                                         00001680
         S001133O.FNRA = NOR_NUM;                                       00001690
      ELSE                                                              00001700
         DO;                                                            00001710
            S001133O.FNRA = BRI_NUM;                                    00001720
            S001133I.FNRL = CURSOR_POS;                                 00001730
            IF TGEP.FNR_EKNR ^= 999 THEN                                00001740
               CALL SKRIV_FEIL_EP(TGEP.FNR_EKNR);                       00001750
         END;                                                           00001760
      IF TGEP.NAVN_EKNR = 0 THEN                                        00001770
         S001133O.NAVNA = NORMAL;                                       00001780
      ELSE                                                              00001790
         DO;                                                            00001800
            S001133O.NAVNA = DFHBMBRY;                                  00001810
            S001133I.NAVNL = CURSOR_POS;                                00001820
            IF TGEP.NAVN_EKNR ^= 999 THEN                               00001830
               CALL SKRIV_FEIL_EP(TGEP.NAVN_EKNR);                      00001840
         END;                                                           00001850
      IF TGEP.TKNR_EKNR = 0 THEN                                        00001860
         S001133O.TKNRA = NOR_NUM;                                      00001870
      ELSE                                                              00001880
         DO;                                                            00001890
            S001133O.TKNRA = BRI_NUM;                                   00001900
            S001133I.TKNRL = CURSOR_POS;                                00001910
            IF TGEP.TKNR_EKNR ^= 999 THEN                               00001920
               CALL SKRIV_FEIL_EP(TGEP.TKNR_EKNR);                      00001930
         END;                                                           00001940
      IF TGEP.AI63_EKNR = 0 THEN                                        00001950
         AI63_EKA = NOR_NUM;                                            00001960
      ELSE                                                              00001970
         DO;                                                            00001980
         EXEC CICS ENTER TRACEID(61) FROM(TGEP.AI63_EKNR) ;             00001990
            AI63_EKA = BRI_NUM;                                         00002000
            AI63_EKL = CURSOR_POS;                                      00002010
            IF TGEP.AI63_EKNR ^= 999 THEN                               00002020
               CALL SKRIV_FEIL_EP(TGEP.AI63_EKNR);                      00002030
         END;                                                           00002040
      IF TGEP.AI64_EKNR = 0 THEN                                        00002050
         AI64_EKA = NOR_NUM;                                            00002060
      ELSE                                                              00002070
         DO;                                                            00002080
            AI64_EKA = BRI_NUM;                                         00002090
            AI64_EKL = CURSOR_POS;                                      00002100
            IF TGEP.AI64_EKNR ^= 999 THEN                               00002110
               CALL SKRIV_FEIL_EP(TGEP.AI64_EKNR);                      00002120
         END;                                                           00002130
      IF TGEP.AI65_EKNR = 0 THEN                                        00002140
         AI65_EKA = NOR_NUM;                                            00002150
      ELSE                                                              00002160
         DO;                                                            00002170
            AI65_EKA = BRI_NUM;                                         00002180
            AI65_EKL = CURSOR_POS;                                      00002190
            IF TGEP.AI65_EKNR ^= 999 THEN                               00002200
               CALL SKRIV_FEIL_EP(TGEP.AI65_EKNR);                      00002210
         END;                                                           00002220
      IF TGEP.AI66_EKNR = 0 THEN                                        00002230
         AI66_EKA = NOR_NUM;                                            00002240
      ELSE                                                              00002250
         DO;                                                            00002260
            AI66_EKA = BRI_NUM;                                         00002270
            AI66_EKL = CURSOR_POS;                                      00002280
            IF TGEP.AI66_EKNR ^= 999 THEN                               00002290
               CALL SKRIV_FEIL_EP(TGEP.AI66_EKNR);                      00002300
         END;                                                           00002310
      IF TGEP.PI_66_EKNR = 0 THEN                                       00002320
         PI_66_EKA = NOR_NUM;                                           00002330
      ELSE                                                              00002340
         DO;                                                            00002350
            PI_66_EKA = BRI_NUM;                                        00002360
            PI_66_EKL = CURSOR_POS;                                     00002370
            IF TGEP.PI_66_EKNR ^= 999 THEN                              00002380
               CALL SKRIV_FEIL_EP(TGEP.PI_66_EKNR);                     00002390
         END;                                                           00002400
   END OVERFØR_TGETTERL_MAP;                                            00002410
 %PAGE;                                /*    */                         00002420
 /* ***************************************************************** */00002430
 /*                                                                   */00002440
 /*   PROSEDYRA OVERFØRER DATA FRA TG_TRANS_OMR.TGB TIL               */00002450
 /*   SKJERMBILDE TG_FORELDRELØSE BARN.                               */00002460
 /*   MAP: S001131                                                    */00002470
 /*   MAPSET: S001133                                                 */00002480
 /*                                                                   */00002490
 /* ***************************************************************** */00002500
 %SKIP(2);                                                              00002510
 OVERFØR_TGBARN_MAP:                                                    00002520
   PROC;                                                                00002530
 %SKIP(2);                                                              00002540
   DCL                                                                  00002550
      NORMAL  CHAR (1),                                                 00002560
      NOR_NUM CHAR (1),                                                 00002570
      BRI_NUM CHAR (1);                                                 00002580
      NORMAL = ' ';                                                     00002590
      NOR_NUM = '&';                                                    00002600
      BRI_NUM = 'Q';                                                    00002610
 %SKIP;                                                                 00002620
      S001134O.FNR_MORO = F_FELT_PIC_CHAR11 (TGB.FNR_MOR);              00002630
      S001134O.NAVN_MORO = TGB.NAVN_MOR;                                00002640
      S001134O.TKNRO = F_FELT_PIC_CHAR4 (TGB.TKNR);                     00002650
      IF F_FELT_PIC_CHAR5(TGB.AI63_MOR) ^= (5)'0' THEN                  00002660
        AI63_MORO = F_FELT_PIC_CHAR7 (TGB.AI63_MOR * 100);              00002670
      IF F_FELT_PIC_CHAR5(TGB.AI64_MOR) ^= (5)'0' THEN                  00002680
        AI64_MORO = F_FELT_PIC_CHAR7 (TGB.AI64_MOR * 100);              00002690
      IF F_FELT_PIC_CHAR5(TGB.AI65_MOR) ^= (5)'0' THEN                  00002700
        AI65_MORO = F_FELT_PIC_CHAR7 (TGB.AI65_MOR * 100);              00002710
      IF F_FELT_PIC_CHAR5(TGB.AI66_MOR) ^= (5)'0' THEN                  00002720
        AI66_MORO = F_FELT_PIC_CHAR7 (TGB.AI66_MOR * 100);              00002730
      IF F_FELT_PIC_CHAR5(TGB.PI_66_MOR) ^= (5)'0' THEN                 00002740
        PI_66_MORO = F_FELT_PIC_CHAR7 (TGB.PI_66_MOR * 100);            00002750
      S001134O.FNR_FARO = F_FELT_PIC_CHAR11 (TGB.FNR_FAR);              00002760
      S001134O.NAVN_FARO = TGB.NAVN_FAR;                                00002770
      IF F_FELT_PIC_CHAR5(TGB.AI63_FAR) ^= (5)'0' THEN                  00002780
        AI63_FARO = F_FELT_PIC_CHAR7 (TGB.AI63_FAR * 100);              00002790
      IF F_FELT_PIC_CHAR5(TGB.AI64_FAR) ^= (5)'0' THEN                  00002800
        AI64_FARO = F_FELT_PIC_CHAR7 (TGB.AI64_FAR * 100);              00002810
      IF F_FELT_PIC_CHAR5(TGB.AI65_FAR) ^= (5)'0' THEN                  00002820
        AI65_FARO = F_FELT_PIC_CHAR7 (TGB.AI65_FAR * 100);              00002830
      IF F_FELT_PIC_CHAR5(TGB.AI66_FAR) ^= (5)'0' THEN                  00002840
        AI66_FARO = F_FELT_PIC_CHAR7 (TGB.AI66_FAR * 100);              00002850
      IF F_FELT_PIC_CHAR5(TGB.PI_66_FAR) ^= (5)'0' THEN                 00002860
        PI_66_FARO = F_FELT_PIC_CHAR7 (TGB.PI_66_FAR * 100);            00002870
 %SKIP(3);                             /*  */                           00002880
 /*  MARKERING AV ATTRIBUTTER   */                                      00002890
 %SKIP;                                                                 00002900
      S001134O.DUMMYA = '_';                                            00002910
      IF TGB.FNR_MORNR = 0 THEN                                         00002920
         S001134O.FNR_MORA = NOR_NUM;                                   00002930
      ELSE                                                              00002940
         DO;                                                            00002950
            S001134O.FNR_MORA = BRI_NUM;                                00002960
            S001134I.FNR_MORL = CURSOR_POS;                             00002970
            IF TGB.FNR_MORNR ^= 999 THEN                                00002980
               CALL SKRIV_FEIL_FB(TGB.FNR_MORNR);                       00002990
         END;                                                           00003000
      IF TGB.NAVN_MORNR = 0 THEN                                        00003010
         S001134O.NAVN_MORA = NORMAL;                                   00003020
      ELSE                                                              00003030
         DO;                                                            00003040
            S001134O.NAVN_MORA = DFHBMBRY;                              00003050
            S001134I.NAVN_MORL = CURSOR_POS;                            00003060
            IF TGB.NAVN_MORNR ^= 999 THEN                               00003070
               CALL SKRIV_FEIL_FB(TGB.NAVN_MORNR);                      00003080
         END;                                                           00003090
      IF TGB.TKNRNR = 0 THEN                                            00003100
         S001134O.TKNRA = NOR_NUM;                                      00003110
      ELSE                                                              00003120
         DO;                                                            00003130
            S001134O.TKNRA = BRI_NUM;                                   00003140
            S001134I.TKNRL = CURSOR_POS;                                00003150
            IF TGB.TKNRNR ^= 999 THEN                                   00003160
               CALL SKRIV_FEIL_FB(TGB.TKNRNR);                          00003170
         END;                                                           00003180
      IF TGB.AI63_MORNR = 0 THEN                                        00003190
         AI63_MORA = NOR_NUM;                                           00003200
      ELSE                                                              00003210
         DO;                                                            00003220
         EXEC CICS ENTER TRACEID(62) FROM(TGB.AI63_MORNR) ;             00003230
            AI63_MORA = BRI_NUM;                                        00003240
            AI63_MORL = CURSOR_POS;                                     00003250
            IF TGB.AI63_MORNR ^= 999 THEN                               00003260
               CALL SKRIV_FEIL_FB(TGB.AI63_MORNR);                      00003270
         END;                                                           00003280
      IF TGB.AI64_MORNR = 0 THEN                                        00003290
         AI64_MORA = NOR_NUM;                                           00003300
      ELSE                                                              00003310
         DO;                                                            00003320
            AI64_MORA = BRI_NUM;                                        00003330
            AI64_MORL = CURSOR_POS;                                     00003340
            IF TGB.AI64_MORNR ^= 999 THEN                               00003350
               CALL SKRIV_FEIL_FB(TGB.AI64_MORNR);                      00003360
         END;                                                           00003370
      IF TGB.AI65_MORNR = 0 THEN                                        00003380
         AI65_MORA = NOR_NUM;                                           00003390
      ELSE                                                              00003400
         DO;                                                            00003410
            AI65_MORA = BRI_NUM;                                        00003420
            AI65_MORL = CURSOR_POS;                                     00003430
            IF TGB.AI65_MORNR ^= 999 THEN                               00003440
               CALL SKRIV_FEIL_FB(TGB.AI65_MORNR);                      00003450
         END;                                                           00003460
      IF TGB.AI66_MORNR = 0 THEN                                        00003470
         AI66_MORA = NOR_NUM;                                           00003480
      ELSE                                                              00003490
         DO;                                                            00003500
            AI66_MORA = BRI_NUM;                                        00003510
            AI66_MORL = CURSOR_POS;                                     00003520
            IF TGB.AI66_MORNR ^= 999 THEN                               00003530
               CALL SKRIV_FEIL_FB(TGB.AI66_MORNR);                      00003540
         END;                                                           00003550
      IF TGB.PI_66_MORNR = 0 THEN                                       00003560
         PI_66_MORA = NOR_NUM;                                          00003570
      ELSE                                                              00003580
         DO;                                                            00003590
            PI_66_MORA = BRI_NUM;                                       00003600
            PI_66_MORL = CURSOR_POS;                                    00003610
            IF TGB.PI_66_MORNR ^= 999 THEN                              00003620
               CALL SKRIV_FEIL_FB(TGB.PI_66_MORNR);                     00003630
         END;                                                           00003640
      IF TGB.FNR_FARNR = 0 THEN                                         00003650
         S001134O.FNR_FARA = NOR_NUM;                                   00003660
      ELSE                                                              00003670
         DO;                                                            00003680
            S001134O.FNR_FARA = BRI_NUM;                                00003690
            S001134I.FNR_FARL = CURSOR_POS;                             00003700
            IF TGB.FNR_FARNR ^= 999 THEN                                00003710
               CALL SKRIV_FEIL_FB(TGB.FNR_FARNR);                       00003720
         END;                                                           00003730
      IF TGB.NAVN_FARNR = 0 THEN                                        00003740
         S001134O.NAVN_FARA = NORMAL;                                   00003750
      ELSE                                                              00003760
         DO;                                                            00003770
            S001134O.NAVN_FARA = DFHBMBRY;                              00003780
            S001134I.NAVN_FARL = CURSOR_POS;                            00003790
            IF TGB.NAVN_FARNR ^= 999 THEN                               00003800
               CALL SKRIV_FEIL_FB(TGB.NAVN_FARNR);                      00003810
         END;                                                           00003820
      IF TGB.AI63_FARNR = 0 THEN                                        00003830
         AI63_FARA = NOR_NUM;                                           00003840
      ELSE                                                              00003850
         DO;                                                            00003860
            AI63_FARA = BRI_NUM;                                        00003870
            AI63_FARL = CURSOR_POS;                                     00003880
            IF TGB.AI63_FARNR ^= 999 THEN                               00003890
               CALL SKRIV_FEIL_FB(TGB.AI63_FARNR);                      00003900
         END;                                                           00003910
      IF TGB.AI64_FARNR = 0 THEN                                        00003920
         AI64_FARA = NOR_NUM;                                           00003930
      ELSE                                                              00003940
         DO;                                                            00003950
            AI64_FARA = BRI_NUM;                                        00003960
            AI64_FARL = CURSOR_POS;                                     00003970
            IF TGB.AI64_FARNR ^= 999 THEN                               00003980
               CALL SKRIV_FEIL_FB(TGB.AI64_FARNR);                      00003990
         END;                                                           00004000
      IF TGB.AI65_FARNR = 0 THEN                                        00004010
         AI65_FARA = NOR_NUM;                                           00004020
      ELSE                                                              00004030
         DO;                                                            00004040
            AI65_FARA = BRI_NUM;                                        00004050
            AI65_FARL = CURSOR_POS;                                     00004060
            IF TGB.AI65_FARNR ^= 999 THEN                               00004070
               CALL SKRIV_FEIL_FB(TGB.AI65_FARNR);                      00004080
         END;                                                           00004090
      IF TGB.AI66_FARNR = 0 THEN                                        00004100
         AI66_FARA = NOR_NUM;                                           00004110
      ELSE                                                              00004120
         DO;                                                            00004130
            AI66_FARA = BRI_NUM;                                        00004140
            AI66_FARL = CURSOR_POS;                                     00004150
            IF TGB.AI66_FARNR ^= 999 THEN                               00004160
               CALL SKRIV_FEIL_FB(TGB.AI66_FARNR);                      00004170
         END;                                                           00004180
      IF TGB.PI_66_FARNR = 0 THEN                                       00004190
         PI_66_FARA = NOR_NUM;                                          00004200
      ELSE                                                              00004210
         DO;                                                            00004220
            PI_66_FARA = BRI_NUM;                                       00004230
            PI_66_FARL = CURSOR_POS;                                    00004240
            IF TGB.PI_66_FARNR ^= 999 THEN                              00004250
               CALL SKRIV_FEIL_FB(TGB.PI_66_FARNR);                     00004260
         END;                                                           00004270
   END OVERFØR_TGBARN_MAP;                                              00004280
 %PAGE;                                /*   */                          00004290
 OVERFØR_TGAI67_MAP:                                                    00004300
   PROC;                                                                00004310
 /* ***************************************************************** */00004320
 /*                                                                   */00004330
 /*   PROSEDYRA OVERFØRER DATA FRA TG_TRANS_OMR.TGAI TIL              */00004340
 /*   SKJERMBILDE TG_AI67-DELEN.                                      */00004350
 /*   MAP: S001135                                                    */00004360
 /*   MAPSET: S00113                                                  */00004370
 /*                                                                   */00004380
 /* ***************************************************************** */00004390
 %SKIP(2);                                                              00004400
   DCL                                                                  00004410
      NORMAL  CHAR (1),                                                 00004420
      NOR_NUM CHAR (1),                                                 00004430
      BRI_NUM CHAR (1);                                                 00004440
      NORMAL = ' ';                                                     00004450
      NOR_NUM = '&';                                                    00004460
      BRI_NUM = 'Q';                                                    00004470
 %SKIP(2);                                                              00004480
      S001135O.FNRO = F_FELT_PIC_CHAR11 (TGAI.FNR);                     00004490
      S001135O.NAVNO = TGAI.NAVN;                                       00004500
      S001135O.TKNRO = F_FELT_PIC_CHAR4 (TGAI.TKNR);                    00004510
      IF F_FELT_PIC_CHAR5(TGAI.AI67) ^= (5)'0' THEN                     00004520
        AI67O = F_FELT_PIC_CHAR7 (TGAI.AI67 * 100);                     00004530
 %SKIP(3);                             /*    */                         00004540
 /* FEILMELDINGER MARKERING AV  FELT (ATTRIBUTTENE) */                  00004550
 %SKIP(2);                                                              00004560
      S001135O.DUMMYA = '_';                                            00004570
      IF TGAI.FNRNR = 0 THEN                                            00004580
         S001135O.FNRA = NOR_NUM;                                       00004590
      ELSE                                                              00004600
         DO;                                                            00004610
            S001135O.FNRA = BRI_NUM;                                    00004620
            S001135I.FNRL = CURSOR_POS;                                 00004630
            IF TGAI.FNRNR ^= 999 THEN                                   00004640
               CALL SKRIV_FEIL_AI(TGAI.FNRNR);                          00004650
         END;                                                           00004660
      IF TGAI.NAVNNR = 0 THEN                                           00004670
         S001135O.NAVNA = NORMAL;                                       00004680
      ELSE                                                              00004690
         DO;                                                            00004700
            S001135O.NAVNA = DFHBMBRY;                                  00004710
            S001135I.NAVNL = CURSOR_POS;                                00004720
            IF TGAI.NAVNNR ^= 999 THEN                                  00004730
               CALL SKRIV_FEIL_AI(TGAI.NAVNNR);                         00004740
         END;                                                           00004750
      IF TGAI.TKNRNR = 0 THEN                                           00004760
         S001135O.TKNRA = NOR_NUM;                                      00004770
      ELSE                                                              00004780
         DO;                                                            00004790
            S001135O.TKNRA = BRI_NUM;                                   00004800
            S001135I.TKNRL = CURSOR_POS;                                00004810
            IF TGAI.TKNRNR ^= 999 THEN                                  00004820
               CALL SKRIV_FEIL_AI(TGAI.TKNRNR);                         00004830
         END;                                                           00004840
      IF TGAI.AI67NR = 0 THEN                                           00004850
         AI67A = NOR_NUM;                                               00004860
      ELSE                                                              00004870
         DO;                                                            00004880
            AI67A = BRI_NUM;                                            00004890
            AI67L = CURSOR_POS;                                         00004900
            IF TGAI.AI67NR ^= 999 THEN                                  00004910
               CALL SKRIV_FEIL_AI(TGAI.AI67NR);                         00004920
         END;                                                           00004930
   END OVERFØR_TGAI67_MAP;                                              00004940
 %PAGE;                                /*  */                           00004950
 /* ***************************************************************** */00004960
 /*                                                                   */00004970
 /*   UTSKRIFT AV FEILMELDINGER PÅ MAP                                */00004980
 /*   MAPNAVN: S001131                                                */00004990
 /*                                                                   */00005000
 /*                                                                   */00005010
 /* ***************************************************************** */00005020
 %SKIP(2);                                                              00005030
 SKRIV_FEIL_UF:                                                         00005040
   PROC (FEILNR);                                                       00005050
   DCL                                                                  00005060
      FEILNR UNAL FIXED DEC (3);                                        00005070
 %SKIP(1);                                                              00005080
       DCL                                                              00005090
          1 FEIL_STRUC,                                                 00005100
            2 FEIL_NR          FIXED DEC(5),                            00005110
            2 FEIL_MELDING     CHAR(78),                                00005120
            2 KOM_OMR_PEKER    POINTER;                                 00005130
                                                                        00005140
        IF ANT_FEIL_SKREVET < 7 THEN                                    00005150
          DO;                                                           00005160
            KOM_OMR_PEKER = COMMAREA_PEKER;                             00005170
            FEIL_NR       = FEILNR;                                     00005180
            EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC);    00005190
            ANT_FEIL_SKREVET = ANT_FEIL_SKREVET + 1;                    00005200
            IF ANT_FEIL_SKREVET = 1 THEN                                00005210
               S001132O.MELDING1O = FEIL_STRUC.FEIL_MELDING;            00005220
            ELSE                                                        00005230
               IF ANT_FEIL_SKREVET = 2 THEN                             00005240
                  S001132O.MELDING2O = FEIL_STRUC.FEIL_MELDING;         00005250
               ELSE                                                     00005260
                  IF ANT_FEIL_SKREVET = 3 THEN                          00005270
                     S001132O.MELDING3O = FEIL_STRUC.FEIL_MELDING;      00005280
                  ELSE                                                  00005290
                     IF ANT_FEIL_SKREVET = 4 THEN                       00005300
                        S001132O.MELDING4O = FEIL_STRUC.FEIL_MELDING;   00005310
                     ELSE                                               00005320
                        IF ANT_FEIL_SKREVET = 5 THEN                    00005330
                           S001132O.MELDING5O = FEIL_STRUC.FEIL_MELDING;00005340
                        ELSE                                            00005350
                           IF ANT_FEIL_SKREVET = 6 THEN                 00005360
                           S001132O.MELDING6O = FEIL_STRUC.FEIL_MELDING;00005370
         END;                                                           00005380
   END SKRIV_FEIL_UF;                                                   00005390
                                                                        00005400
                                                                        00005410
 SKRIV_FEIL_EP:                                                         00005420
   PROC (FEILNR);                                                       00005430
   DCL                                                                  00005440
      FEILNR UNAL FIXED DEC (3);                                        00005450
 %SKIP(1);                                                              00005460
       DCL                                                              00005470
          1 FEIL_STRUC,                                                 00005480
            2 FEIL_NR          FIXED DEC(5),                            00005490
            2 FEIL_MELDING     CHAR(78),                                00005500
            2 KOM_OMR_PEKER    POINTER;                                 00005510
                                                                        00005520
        IF ANT_FEIL_SKREVET < 7 THEN                                    00005530
          DO;                                                           00005540
            KOM_OMR_PEKER = COMMAREA_PEKER;                             00005550
            FEIL_NR       = FEILNR;                                     00005560
            EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC);    00005570
            ANT_FEIL_SKREVET = ANT_FEIL_SKREVET + 1;                    00005580
            IF ANT_FEIL_SKREVET = 1 THEN                                00005590
               S001133O.MELDING1O = FEIL_STRUC.FEIL_MELDING;            00005600
            ELSE                                                        00005610
               IF ANT_FEIL_SKREVET = 2 THEN                             00005620
                  S001133O.MELDING2O = FEIL_STRUC.FEIL_MELDING;         00005630
               ELSE                                                     00005640
                  IF ANT_FEIL_SKREVET = 3 THEN                          00005650
                     S001133O.MELDING3O = FEIL_STRUC.FEIL_MELDING;      00005660
                  ELSE                                                  00005670
                     IF ANT_FEIL_SKREVET = 4 THEN                       00005680
                        S001133O.MELDING4O = FEIL_STRUC.FEIL_MELDING;   00005690
                     ELSE                                               00005700
                        IF ANT_FEIL_SKREVET = 5 THEN                    00005710
                           S001133O.MELDING5O = FEIL_STRUC.FEIL_MELDING;00005720
                        ELSE                                            00005730
                           IF ANT_FEIL_SKREVET = 6 THEN                 00005740
                           S001133O.MELDING6O = FEIL_STRUC.FEIL_MELDING;00005750
         END;                                                           00005760
   END SKRIV_FEIL_EP;                                                   00005770
                                                                        00005780
                                                                        00005790
 SKRIV_FEIL_FB:                                                         00005800
   PROC (FEILNR);                                                       00005810
   DCL                                                                  00005820
      FEILNR UNAL FIXED DEC (3);                                        00005830
 %SKIP(1);                                                              00005840
       DCL                                                              00005850
          1 FEIL_STRUC,                                                 00005860
            2 FEIL_NR          FIXED DEC(5),                            00005870
            2 FEIL_MELDING     CHAR(78),                                00005880
            2 KOM_OMR_PEKER    POINTER;                                 00005890
                                                                        00005900
        IF ANT_FEIL_SKREVET < 7 THEN                                    00005910
          DO;                                                           00005920
            KOM_OMR_PEKER = COMMAREA_PEKER;                             00005930
            FEIL_NR       = FEILNR;                                     00005940
            EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC);    00005950
            ANT_FEIL_SKREVET = ANT_FEIL_SKREVET + 1;                    00005960
            IF ANT_FEIL_SKREVET = 1 THEN                                00005970
               S001134O.MELDING1O = FEIL_STRUC.FEIL_MELDING;            00005980
            ELSE                                                        00005990
               IF ANT_FEIL_SKREVET = 2 THEN                             00006000
                  S001134O.MELDING2O = FEIL_STRUC.FEIL_MELDING;         00006010
               ELSE                                                     00006020
                  IF ANT_FEIL_SKREVET = 3 THEN                          00006030
                     S001134O.MELDING3O = FEIL_STRUC.FEIL_MELDING;      00006040
                  ELSE                                                  00006050
                     IF ANT_FEIL_SKREVET = 4 THEN                       00006060
                        S001134O.MELDING4O = FEIL_STRUC.FEIL_MELDING;   00006070
                     ELSE                                               00006080
                        IF ANT_FEIL_SKREVET = 5 THEN                    00006090
                           S001134O.MELDING5O = FEIL_STRUC.FEIL_MELDING;00006100
                        ELSE                                            00006110
                           IF ANT_FEIL_SKREVET = 6 THEN                 00006120
                           S001134O.MELDING6O = FEIL_STRUC.FEIL_MELDING;00006130
         END;                                                           00006140
   END SKRIV_FEIL_FB;                                                   00006150
 SKRIV_FEIL_AI:                                                         00006160
   PROC (FEILNR);                                                       00006170
   DCL                                                                  00006180
      FEILNR UNAL FIXED DEC (3);                                        00006190
 %SKIP(1);                                                              00006200
       DCL                                                              00006210
          1 FEIL_STRUC,                                                 00006220
            2 FEIL_NR          FIXED DEC(5),                            00006230
            2 FEIL_MELDING     CHAR(78),                                00006240
            2 KOM_OMR_PEKER    POINTER;                                 00006250
                                                                        00006260
        IF ANT_FEIL_SKREVET < 7 THEN                                    00006270
          DO;                                                           00006280
            KOM_OMR_PEKER = COMMAREA_PEKER;                             00006290
            FEIL_NR       = FEILNR;                                     00006300
            EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC);    00006310
            ANT_FEIL_SKREVET = ANT_FEIL_SKREVET + 1;                    00006320
            IF ANT_FEIL_SKREVET = 1 THEN                                00006330
               S001135O.MELDING1O = FEIL_STRUC.FEIL_MELDING;            00006340
            ELSE                                                        00006350
               IF ANT_FEIL_SKREVET = 2 THEN                             00006360
                  S001135O.MELDING2O = FEIL_STRUC.FEIL_MELDING;         00006370
               ELSE                                                     00006380
                  IF ANT_FEIL_SKREVET = 3 THEN                          00006390
                     S001135O.MELDING3O = FEIL_STRUC.FEIL_MELDING;      00006400
                  ELSE                                                  00006410
                     IF ANT_FEIL_SKREVET = 4 THEN                       00006420
                        S001135O.MELDING4O = FEIL_STRUC.FEIL_MELDING;   00006430
                     ELSE                                               00006440
                        IF ANT_FEIL_SKREVET = 5 THEN                    00006450
                           S001135O.MELDING5O = FEIL_STRUC.FEIL_MELDING;00006460
                        ELSE                                            00006470
                           IF ANT_FEIL_SKREVET = 6 THEN                 00006480
                           S001135O.MELDING6O = FEIL_STRUC.FEIL_MELDING;00006490
         END;                                                           00006500
   END SKRIV_FEIL_AI;                                                   00006510
