 /*       SIST ENDRET 28/07-97 12.34.08 AV   HLA7339                  */00000000
 /*       SIST ENDRET 18/01-96 16.22.48 AV   HLB0310                  */00000010
 /*       SIST ENDRET 02/06-94 14.57.33 AV   HERMAN                   */00000020
 /*       SIST ENDRET 21/01-91 13.51.20 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 11/12-90 13.22.28 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 02/10-90 14.00.06 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 05/07-90 09.22.50 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 14/12-88 13.19.21 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 26/01-84 14.00.38 AV   OLAV                     */00000080
 /*       SIST ENDRET 09/01-84 11.29.56 AV   OLAV                     */00000090
 /*       SIST ENDRET 06/09-83 08.23.49 AV   OLAV                     */00000100
 /*       SIST ENDRET 05/07-83 08.46.31 AV   OLAV                     */00000110
 /*       SIST ENDRET 25/05-83 11.43.30 AV   OLAV                     */00000120
 /*                                                                   */00000130
 /*IDENTIFIKASJON:                                                    */00000140
 /*    R0014153 - SUBRUTINE I PLI                                     */00000150
 /*    PROGRAMMERER: PER F. BERGESTAD, JUNI 1982                      */00000160
 /*HENSIKT:                                                           */00000170
 /*    RUTINEN REGNER PÅ GRUNNLAG AV POENGREKKEN UT SPT, OPT OG PÅ.   */00000180
 /*BRUK:                                                              */00000190
 /*    CALL BEREGN_SPT_OPT_PÅ;                                        */00000200
 /*                                                                   */00000210
 /*                                                                   */00000220
 /*ENDRING:                                                           */00000230
 /*        B02.FRAVIK_FLYKTN(IND)  ^= 'J' &                           */00000240
 /*        OVERNEVNTE SETNING ER LAGT INN I TESTEM OM IKKE            */00000250
 /*        OVERKOMP TIL UTLENDING            26.1.84   OLAV           */00000260
 /*                                                                   */00000270
 /*                                                                   */00000280
 /* ***************************************************************** */00000290
  BEREGN_SPT_OPT_PÅ:                                                    00000300
    PROC(IND,POREKKE,W_FNR);                                            00000310
 %SKIP(2);                                                              00000320
 %INCLUDE P0014001;                                                     00000330
    DCL                                                                 00000340
       I                  FIXED BIN(15),                                00000350
       W                  FIXED BIN(15),  /*TEST*/                      00000360
       IND                FIXED BIN(15);                                00000370
    DCL                                                                 00000380
       START_ÅR           FIXED DEC(3) INIT(0),                         00000390
       SLUTT_ÅR           FIXED DEC(3) INIT(0);                         00000400
    DCL                                                                 00000410
       SIST_REG           FIXED DEC(1) INIT(0),                         00000420
       TYVE_BESTE         FIXED DEC(3) INIT(0);                         00000430
    DCL                                                                 00000440
       ÅR_FYLLER_67       FIXED DEC(3) INIT(0),                         00000450
       ÅR_FYLLER_69       FIXED DEC(3) INIT(0),                         00000460
       W_PÅ               FIXED DEC(3) INIT(0);                         00000470
    DCL                                                                 00000480
       ALDER_PÅ_VIRK_DATO                      PIC'(4)9' INIT(0),       00000490
       ALDER_ÅR DEF ALDER_PÅ_VIRK_DATO POS(1)  PIC'(2)9';               00000500
    DCL                                                                 00000510
       W_FNR              PIC'(11)9';                                   00000520
    DCL                                                                 00000530
       1 W_FNR_R DEF W_FNR,                                             00000540
         2 DAG            PIC'99',                                      00000550
         2 MND            PIC'99',                                      00000560
         2 ÅR             PIC'99',                                      00000570
         2 ÅRHUNDRE       PIC'9',                                       00000580
         2 REST           PIC'(4)9';                                    00000590
                                                                        00000600
    DCL                                                                 00000610
       W_DØDSTIDSP        PIC'(6)9';                                    00000620
    DCL                                                                 00000630
       1 W_DØDSDATO DEF W_DØDSTIDSP,                                    00000640
         2 ÅR             PIC'99',                                      00000650
         2 MND            PIC'99',                                      00000660
         2 DAG            PIC'99';                                      00000670
                                                                        00000680
    DCL SEKSTISJU         FIXED DEC (5) INIT(6700);                     00000690
    DCL SØTTI             FIXED DEC (5) INIT(7000);                     00000700
                                                                        00000710
  IF (W_FNR_R.ÅR > 97 & W_FNR_R.ÅRHUNDRE > 4) !                         00000720
      W_FNR_R.ÅRHUNDRE < 5                      THEN                    00000730
                                                                        00000740
     DO;                                                                00000750
        IF W_FNR_R.ÅRHUNDRE < 5                 THEN                    00000760
           DO;                                                          00000770
              START_ÅR           = W_FNR_R.ÅR + 17;                     00000780
              ALDER_PÅ_VIRK_DATO = B02.VIRK_DATO_ÅM(IND) - ((           00000790
                                   W_FNR_R.ÅR * 100) + W_FNR_R.MND);    00000800
 /*HL*/       IF B02.VIRK_DATO_ÅM(IND) > 9100      THEN                 00000810
                 DO;                                                    00000820
                     SEKSTISJU = 6701;                                  00000830
                     SØTTI     = 7001;                                  00000840
                 END;                                                   00000850
           END;                                                         00000860
        ELSE                                                            00000870
           START_ÅR           = W_FNR_R.ÅR + 17 - 100;                  00000880
 %SKIP(2);                                                              00000890
        SIST_REG = 1;                                                   00000900
        IF START_ÅR < 67 THEN                                           00000910
           START_ÅR = 67;                                               00000920
        DO I = 1 TO 7 WHILE(B02.UFT_ÅM(IND,I) > 0);  /*0697 HL*/        00000930
           SIST_REG = I;                                                00000940
        END;                                                            00000950
        IF W_FNR_R.ÅR                          < 04      !              00000960
           W_FNR_R.ÅRHUNDRE                    > 4       !              00000970
           (B02.UFT_ÅM        (IND,SIST_REG)   > 0       &              00000980
            B02.UFT_ÅM        (IND,SIST_REG)   < 7301    &              00000990
            B02.OPPHØRSDATO_ÅM(IND,SIST_REG)   = 0)      !              00001000
           (B02.DØDSDATO_ÅMD  (IND)            > 0       &              00001010
            B02.DØDSDATO_ÅMD  (IND)            < 730101)      THEN      00001020
                                                                        00001030
           SLUTT_ÅR = W_FNR_R.ÅR + 69;                                  00001040
        ELSE                                                            00001050
           IF W_FNR_R.ÅR = 04 THEN                                      00001060
              SLUTT_ÅR = W_FNR_R.ÅR + 68;                               00001070
           ELSE                                                         00001080
              IF W_FNR_R.ÅR = 05 THEN                                   00001090
                 SLUTT_ÅR = W_FNR_R.ÅR + 67;                            00001100
              ELSE                                                      00001110
                 SLUTT_ÅR = W_FNR_R.ÅR + 66;                            00001120
        IF W_FNR_R.ÅRHUNDRE > 4 THEN                                    00001130
           SLUTT_ÅR = SLUTT_ÅR - 100;                                   00001140
        TYVE_BESTE = SLUTT_ÅR - START_ÅR + 1;                           00001150
                                                                        00001160
 %PAGE;                                                                 00001170
                                                                        00001180
        IF W_FNR_R.ÅR > 3 & W_FNR_R.ÅRHUNDRE < 5 &                      00001190
           (ALDER_ÅR  >= 70 !                                           00001200
  /*       (ALDER_ÅR  >= SØTTI !            */                          00001210
           (ALDER_ÅR >= 67 & B02.DØDSDATO_ÅMD(IND) > 0)) THEN           00001220
  /*       (ALDER_ÅR >= SEKSTISJU & B02.DØDSDATO_ÅMD(IND) > 0)) THEN*/  00001230
                                                                        00001240
           DO;                                                          00001250
              W_DØDSTIDSP  = B02.DØDSDATO_ÅMD(IND);                     00001260
              ÅR_FYLLER_67 = W_FNR_R.ÅR + 67;                           00001270
              ÅR_FYLLER_69 = W_FNR_R.ÅR + 69;                           00001280
                                                                        00001290
              IF ÅR_FYLLER_67 < 73                THEN                  00001300
                 ÅR_FYLLER_67 = 73;                                     00001310
                                                                        00001320
              IF (W_DØDSDATO.ÅR  < ÅR_FYLLER_69  &                      00001330
                  W_DØDSDATO.ÅR  > 0)                 THEN              00001340
                 ÅR_FYLLER_69   = W_DØDSDATO.ÅR;                        00001350
                                                                        00001360
              DO I = ÅR_FYLLER_67  TO ÅR_FYLLER_69;                     00001370
                                                                        00001380
                 IF POREKKE.POENG(I) > 0 THEN                           00001390
                    TYVE_BESTE = TYVE_BESTE + 1;                        00001400
                                                                        00001410
                 IF SLUTT_ÅR < ÅR_FYLLER_69       THEN                  00001420
                    SLUTT_ÅR = SLUTT_ÅR + 1;                            00001430
                                                                        00001440
              END;                                                      00001450
                                                                        00001460
           END;                                                         00001470
                                                                        00001480
        IF TYVE_BESTE > 20 THEN                                         00001490
           TYVE_BESTE = 20;                                             00001500
                                                                        00001510
        W_PÅ = 0;                                                       00001520
        DO I = START_ÅR TO SLUTT_ÅR;                                    00001530
           IF POREKKE.POENG(I) > 0 THEN                                 00001540
              W_PÅ = W_PÅ + 1;                                          00001550
           ELSE                                                         00001560
              W   = I;   /* KUN FOR TEST. TRUDE */                      00001570
        END;                                                            00001580
        IF W_PÅ > 40 THEN                                               00001590
           W_PÅ = 40;                                                   00001600
        POREKKE.PÅ = W_PÅ;                                              00001610
                                                                        00001620
        CALL PLUKK_UT_BESTE_POENG(START_ÅR,SLUTT_ÅR,TYVE_BESTE,         00001630
                                            POREKKE,W_FNR_R.ÅR);        00001640
                                                                        00001650
                                                                        00001660
 /* ***************************************************************** */00001670
 /* IKKE OVERKOMP TIL UTLENDNINGER HVIS DET IKKE ER SVAR JA.          */00001680
 /* ***************************************************************** */00001690
                                                                        00001700
 /**    IF B02.STATSBORGER (IND)   >   0  &                             00001710
           B02.FRAVIK_FLYKTN(IND)  ^= 'J' &                             00001720
           B02.OVERKOMP_UTL(IND)   ^= 'J'   THEN                        00001730
           POREKKE.OPT              = 0;                                00001740
  **/                                                                   00001750
 /* ***************************************************************** */00001760
 /* PENSJON UTLAND. VIRKNING AV STATSBOGERSKAP OG BOSTEDSLAND. TRUDE  */00001770
 /* ***************************************************************** */00001780
                                                                        00001790
    IF ( B02.STATSBORGER (IND)   >  0  &                                00001800
         B02.FRAVIK_FLYKTN(IND)  = 'J' ) !                              00001810
         B02.OVERKOMP_UTL(IND)   = 'J'   THEN                           00001820
         GO TO L500;                                                    00001830
    ELSE                                                                00001840
       DO;                                                              00001850
        SELECT (B02.STATSBORGER(IND));                                  00001860
          WHEN(000)                                                     00001870
                                             /* NORSKE STATSBORGERE  */ 00001880
             DO;                                                        00001890
                GO TO L500;                                             00001900
             END;                                                       00001910
                                                                        00001920
          WHEN(101,102,103,104,105,106)    /* NORDISKE STATSBORGERE  */ 00001930
             DO;                                                        00001940
                GO TO L500;                                             00001950
             END;                                                       00001960
          WHEN(139)                       /* BRITISKE STATSBORGERE  */  00001970
             DO;                                                        00001980
                IF B02.BOSATT(IND) ^= 0 THEN                            00001990
                   POREKKE.OPT      = 0;                                00002000
                ELSE                                                    00002010
                   GO TO L500;                                          00002020
             END;                                                       00002030
          WHEN(684)                       /* US BORGERE             */  00002040
             DO;                                                        00002050
                IF B02.BOSATT(IND)   = 0 !                              00002060
                   B02.BOSATT(IND)   = 684 THEN                         00002070
                    DO;                                                 00002080
                      IF B02.TT_FØR_1967(IND) >= 10 !  /* 7-5 3.LEDD  */00002090
                       ((B02.TT_ETTER_1966(IND) +      /* PARAGRAF 1  */00002100
                                       11) / 12) > 20  THEN             00002110
                        GO TO L500;                                     00002120
                      ELSE                                              00002130
                        POREKKE.OPT       = 0;                          00002140
                    END;                                                00002150
                ELSE                                                    00002160
                  POREKKE.OPT       = 0;                                00002170
             END;                                                       00002180
          WHEN(610)                       /* CANADISKE BORGERE      */  00002190
             DO;                                                        00002200
                IF B02.BOSATT(IND)   = 0 !                              00002210
                   B02.BOSATT(IND)   = 610 THEN                         00002220
                    DO;                                                 00002230
                      IF B02.TT_FØR_1967(IND) >= 10 !  /* 7-5 3.LEDD  */00002240
                       ((B02.TT_ETTER_1966(IND) +      /* PARAGRAF 1  */00002250
                                       11) / 12) > 20 THEN              00002260
                         GO TO L500;                                    00002270
                      ELSE                                              00002280
                         POREKKE.OPT       = 0;                         00002290
                    END;                                                00002300
                ELSE                                                    00002310
                  POREKKE.OPT       = 0;                                00002320
             END;                                                       00002330
          WHEN(611)                       /* QUEBEC BORGERE      */     00002340
             DO;                                                        00002350
                IF B02.BOSATT(IND)   = 0 !                              00002360
                   B02.BOSATT(IND)   = 611 THEN                         00002370
                    DO;                                                 00002380
                      IF B02.TT_FØR_1967(IND) >= 10 !  /* 7-5 3.LEDD  */00002390
                       ((B02.TT_ETTER_1966(IND) +      /* PARAGRAF 1  */00002400
                                       11) / 12) > 20 THEN              00002410
                         GO TO L500;                                    00002420
                      ELSE                                              00002430
                         POREKKE.OPT       = 0;                         00002440
                    END;                                                00002450
                ELSE                                                    00002460
                  POREKKE.OPT       = 0;                                00002470
             END;                                                       00002480
          WHEN(153)                       /* ØSTERRIKE BORGERE      */  00002490
             DO;                                                        00002500
                IF B02.BOSATT(IND)   = 0 !                              00002510
                   B02.BOSATT(IND)   = 153 THEN                         00002520
                    DO;                                                 00002530
                      IF B02.TT_FØR_1967(IND) >= 10 !  /* 7-5 3.LEDD  */00002540
                       ((B02.TT_ETTER_1966(IND) +      /* PARAGRAF 1  */00002550
                                       11) / 12) > 20 THEN              00002560
                         GO TO L500;                                    00002570
                      ELSE                                              00002580
                         POREKKE.OPT       = 0;                         00002590
                    END;                                                00002600
                ELSE                                                    00002610
                  POREKKE.OPT       = 0;                                00002620
             END;                                                       00002630
          WHEN(141)                       /* SVEITS    BORGERE      */  00002640
             DO;                                                        00002650
                IF B02.BOSATT(IND)   = 0  THEN                          00002660
                    DO;                                                 00002670
                      IF B02.TT_FØR_1967(IND) >= 10 !  /* 7-5 3.LEDD  */00002680
                       ((B02.TT_ETTER_1966(IND) +      /* PARAGRAF 1  */00002690
                                       11) / 12) > 20 THEN              00002700
                         GO TO L500;                                    00002710
                      ELSE                                              00002720
                         POREKKE.OPT       = 0;                         00002730
                    END;                                                00002740
                ELSE                                                    00002750
                  DO;                                                   00002760
                   IF   (B02.BOSATT(IND)    = 141  &                    00002770
                         B01.ALDERSP.OPT(IND) > 0  &                    00002780
                         B01.ALDERSP.TP (IND) > 0 )   THEN              00002790
                       GO TO L500;                                      00002800
                                                                        00002810
                    ELSE                                                00002820
                       POREKKE.OPT       = 0;                           00002830
                  END;                                                  00002840
             END;                                                       00002850
          WHEN(125)                       /* JUGOSLAVIA BORGERE     */  00002860
             DO;                                                        00002870
                IF B02.BOSATT(IND)   = 0  THEN                          00002880
                    DO;                                                 00002890
                      IF B02.TT_FØR_1967(IND) >= 10 !  /* 7-5 3.LEDD  */00002900
                       ((B02.TT_ETTER_1966(IND) +      /* PARAGRAF 1  */00002910
                                       11) / 12) > 20 THEN              00002920
                         GO TO L500;                                    00002930
                      ELSE                                              00002940
                         POREKKE.OPT       = 0;                         00002950
                    END;                                                00002960
                ELSE                                                    00002970
                  DO;                                                   00002980
                     IF   (B02.BOSATT(IND)    = 125  &                  00002990
                          B01.ALDERSP.OPT(IND) > 0 &                    00003000
                          B01.ALDERSP.TP (IND) > 0 )   THEN             00003010
                       GO TO L500;                                      00003020
                                                                        00003030
                    ELSE                                                00003040
                       POREKKE.OPT       = 0;                           00003050
                  END;                                                  00003060
             END;                                                       00003070
          WHEN(143)                       /* TYRKIA     BORGERE     */  00003080
             DO;                                                        00003090
                IF B02.BOSATT(IND)   = 0  THEN                          00003100
                    DO;                                                 00003110
                      IF B02.TT_FØR_1967(IND) >= 10 !  /* 7-5 3.LEDD  */00003120
                       ((B02.TT_ETTER_1966(IND) +      /* PARAGRAF 1  */00003130
                                       11) / 12) > 20 THEN              00003140
                         GO TO L500;                                    00003150
                      ELSE                                              00003160
                         POREKKE.OPT       = 0;                         00003170
                    END;                                                00003180
                ELSE                                                    00003190
                  DO;                                                   00003200
                     IF   (B02.BOSATT(IND)    = 143  &                  00003210
                          B01.ALDERSP.OPT(IND) > 0 &                    00003220
                          B01.ALDERSP.TP (IND) > 0 )   THEN             00003230
                       GO TO L500;                                      00003240
                                                                        00003250
                     ELSE                                               00003260
                       POREKKE.OPT       = 0;                           00003270
                  END;                                                  00003280
             END;                                                       00003290
          WHEN(119)                       /* HELLAS     BORGERE     */  00003300
             DO;                                                        00003310
                IF B02.BOSATT(IND)   = 0  THEN                          00003320
                    DO;                                                 00003330
                      IF B02.TT_FØR_1967(IND) >= 10 !  /* 7-5 3.LEDD  */00003340
                       ((B02.TT_ETTER_1966(IND) +      /* PARAGRAF 1  */00003350
                                       11) / 12) > 20 THEN              00003360
                         GO TO L500;                                    00003370
                      ELSE                                              00003380
                         POREKKE.OPT       = 0;                         00003390
                    END;                                                00003400
                ELSE                                                    00003410
                  DO;                                                   00003420
                     IF   (B02.BOSATT(IND)    = 119  &                  00003430
                          B01.ALDERSP.OPT(IND) > 0 &                    00003440
                          B01.ALDERSP.TP (IND) > 0 )   THEN             00003450
                       GO TO L500;                                      00003460
                     ELSE                                               00003470
                       POREKKE.OPT       = 0;                           00003480
                  END;                                                  00003490
             END;                                                       00003500
          WHEN(132)                       /* PORTUGISISKE BORGERE   */  00003510
             DO;                                                        00003520
                IF B02.BOSATT(IND)   = 0  THEN                          00003530
                    DO;                                                 00003540
                      IF B02.TT_FØR_1967(IND) >= 10 !  /* 7-5 3.LEDD  */00003550
                       ((B02.TT_ETTER_1966(IND) +      /* PARAGRAF 1  */00003560
                                       11) / 12) > 20 THEN              00003570
                         GO TO L500;                                    00003580
                      ELSE                                              00003590
                         POREKKE.OPT       = 0;                         00003600
                    END;                                                00003610
                ELSE                                                    00003620
                  DO;                                                   00003630
                     IF   (B02.BOSATT(IND)    = 132  &                  00003640
                          B01.ALDERSP.OPT(IND) > 0 &                    00003650
                          B01.ALDERSP.TP (IND) > 0 )   THEN             00003660
                       GO TO L500;                                      00003670
                     ELSE                                               00003680
                       POREKKE.OPT       = 0;                           00003690
                  END;                                                  00003700
             END;                                                       00003710
                                                                        00003720
        OTHERWISE                                                       00003730
           DO;                                                          00003740
             IF B02.STATSBORGER (IND)   >   0  &                        00003750
                B02.FRAVIK_FLYKTN(IND)  ^= 'J' &                        00003760
                B02.OVERKOMP_UTL(IND)   ^= 'J'   THEN                   00003770
                POREKKE.OPT              = 0;                           00003780
                                                                        00003790
           END;                                                         00003800
                                                                        00003810
        END; /*SELECT*/                                                 00003820
       END;                                                             00003830
 /* ***************************************************************** */00003840
 /* PENSJON UTLAND. TIL HIT. TRUDE                                    */00003850
 /* ***************************************************************** */00003860
                                                                        00003870
                                                                        00003880
 /* ***************************************************************** */00003890
 /* IKKE OVERKOMP TIL PERSONER FØDT ETTER 1936.                       */00003900
 /* ***************************************************************** */00003910
 L500:                                                                  00003920
                                                                        00003930
        IF W_FNR_R.ÅR > 36 & W_FNR_R.ÅR < 98     THEN                   00003940
                                                                        00003950
           POREKKE.OPT              = 0;                                00003960
                                                                        00003970
  /*0196 HL : */                                                        00003980
                                                                        00003990
        IF B02.OVERKOMP_UTL(IND) = 'N'      &                           00004000
           B02.PENSJONSTYPE1(IND) = 'K'    THEN                         00004010
           POREKKE.OPT              = 0;                                00004020
                                                                        00004030
                                     /* PENSJON UTLAND ,KONVENSJON  */  00004040
  /*   IF POREKKE.PÅ < 3 & B02.KONVENSJON(IND) = 'J'   THEN        */   00004050
       IF POREKKE.PÅ > 2           !                                    00004060
          B02.KONVENSJON(IND) = 'J'   !                                 00004070
          B02.FRAVIK_BOSATT_KONVENSJON(IND) = 'J'   THEN                00004080
         GOTO L600;                                                     00004090
                                                                        00004100
        IF (POREKKE.PÅ < 3 & W_FNR_R.ÅR < 99 & W_FNR_R.ÅRHUNDRE < 5) !  00004110
           (POREKKE.PÅ < 2 & W_FNR_R.ÅR = 99 ) THEN                     00004120
           DO;                                                          00004130
             POREKKE.SPT = 0;                                           00004140
             POREKKE.OPT = 0;                                           00004150
           END;                                                         00004160
 L600:                                                                  00004170
     END;                                                               00004180
                                                                        00004190
 /*LOVENDRING FRA 1.1.91 - HL : */                                      00004200
                                                                        00004210
  IF B02.VIRK_DATO_ÅM(IND) > 9100 & B02.OVERKOMP_UTL(IND) = 'N' THEN    00004220
     POREKKE.OPT = 0;                                                   00004230
                                                                        00004240
 %INCLUDE R0014165;     /* PLUKK_UT_BESTE_POENG  */                     00004250
  END BEREGN_SPT_OPT_PÅ;                                                00004260
