 /*       SIST ENDRET 16/09-97 10.24.39 AV   JDA7339                  */00000000
 /*       SIST ENDRET 15/09-97 13.31.28 AV   JDA7339                  */00000010
 /*       SIST ENDRET 29/08-97 12.28.32 AV   JDA7339                  */00000020
 /*       SIST ENDRET 28/08-97 08.53.03 AV   SPA7339                  */00000030
 /*       SIST ENDRET 28/07-97 12.34.19 AV   HLA7339                  */00000040
 /*       SIST ENDRET 28/02-96 08.38.42 AV   JDA0310                  */00000050
 /*       SIST ENDRET 20/02-96 13.10.17 AV   JDA0310                  */00000060
 /*       SIST ENDRET 30/01-96 16.30.20 AV   HLB0310                  */00000070
 /*       SIST ENDRET 18/01-96 08.42.23 AV   HLB0310                  */00000080
 /*       SIST ENDRET 14/02-95 15.48.33 AV   TSB0310                  */00000090
 /*       SIST ENDRET 11/02-94 15.25.14 AV   TRUDE                    */00000100
 /*       SIST ENDRET 10/02-94 13.28.56 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 25/11-93 09.15.40 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 26/10-93 11.11.01 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 25/08-93 10.25.13 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 21/12-92 11.57.07 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 12/06-92 13.52.35 AV   TRUDE                    */00000160
 /*       SIST ENDRET 23/04-92 13.20.24 AV   HERMAN                   */00000170
 /*       SIST ENDRET 28/01-92 12.26.44 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 13/12-91 12.24.31 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 21/01-91 13.52.28 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 11/01-90 09.04.14 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 31/03-87 08.54.38 AV   DYBVIK                   */00000220
 /*       SIST ENDRET 02/12-86 13.23.09 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 08/02-85 12.38.04 AV   OLAV                     */00000240
 /*       SIST ENDRET 31/01-85 08.23.13 AV   OLAV                     */00000250
 /*       SIST ENDRET 08/02-84 10.57.12 AV   OLAV                     */00000260
 /*       SIST ENDRET 18/01-84 11.04.40 AV   OLAV                     */00000270
 /*       SIST ENDRET 26/05-83 09.21.06 AV   OLAV                     */00000280
 /*       SIST ENDRET 18/05-83 11.54.27 AV   OLAV                     */00000290
 /* *************************************************************** */  00000300
 /*IDENTIFIKASJON:                                                  */  00000310
 /*    R0014231 - PROSEDYRE I PLI                                   */  00000320
 /*    PROGRAMMERER: EDB-ING. ROLF FARVIK,SFK,MARS -82.             */  00000330
 /*HENSIKT:                                                         */  00000340
 /*    BEREGNE TILLEGGSPENSJON-ALDER                                */  00000350
 /*PROGRAMTILKNYTNING:                                              */  00000360
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV ALDERSPENSJON-*/  00000370
 /*    SBEREGNINGEN.                                                */  00000380
 /*    INCLUDES I R0014201                                          */  00000390
 /*BRUK:                                                            */  00000400
 /*    CALL BEREGN_TP_AP;                                           */  00000410
 /*                                                                 */  00000420
 /*ENDRINGER                                                        */  00000430
 /*    SAVEING AV POENGREKKENE FØR EVENTUELT POENGTILLEGG OG        */  00000440
 /*    NULLSTILLING AV POENGTILLEGGSOPPLYSNINGENE NÅR DET IKKE      */  00000450
 /*    GIS POENGTILLEGG LENGER.                6/2-84      OLAV     */  00000460
 /*ENDRING 28.11.86 - HL                                            */  00000470
 /*    VALG AV POENGREKKE SKAL FORETAS ETTER EN SAMMENLIGNING       */  00000480
 /*    AV PENSJON MED EVT. POENGTILLEGG. ALTERNATIV POREKKE ER      */  00000490
 /*    LAGT UT PÅ PLASS 12(KVINNE) ELLER 13(MANN).                  */  00000500
 /* *************************************************************** */  00000510
 /*   */                                                                00000520
 BEREGN_TP_AP:                                                          00000530
   PROC;                                                                00000540
 /*   */                                                                00000550
   DCL       W_TP         FIXED DEC (7)   INIT (0),                     00000560
             W_TP_ALT     FIXED DEC (7)   INIT (0),                     00000570
             TP_GARANTI   FIXED DEC (11,4)   INIT (0),                  00000580
             TP_GARANTI1  FIXED DEC (7)   INIT (0);                     00000590
   DCL SPT_GARANTI        FIXED DEC (3,2) INIT(0);                      00000600
   DCL SISTE_UFØRHIST     FIXED DEC (5)   INIT(0);                      00000610
   DCL HL_GT              FIXED DEC (7)   INIT(0);                      00000620
   DCL SISTE_KODE         PIC '9';                                      00000630
   DCL J                  FIXED BIN (15);                               00000640
   DCL PÅ_ETTER91_SØKER   CHAR(1) INIT (' ');          /*92*/           00000650
   DCL FYLLER_67_ÅR      FIXED DEC (3) INIT (0);                        00000660
   DCL TEST_E91          FIXED DEC (3) INIT (0);                        00000670
   DCL W_PÅ_E91          FIXED DEC (3) INIT (0);                        00000680
   DCL FRADRAG           FIXED DEC (3) INIT (0);                        00000690
   DCL ALDER_DATO_MÅ     PIC     '(4)9';                                00000700
                                                                        00000710
 /* ***************************************************************** */00000720
 /* KALL PROGRAM SOM BEREGNER POENGREKKEN.                       */     00000730
 /* ***************************************************************** */00000740
                                                                        00000750
    ALDER_DATO_MÅ = F_SNU_DATO(B02.VIRK_DATO_ÅM(BER_SØ_IND));           00000760
    ALDER_ÅM = F_ALDER(W_FNR,ALDER_DATO_MÅ);                            00000770
    B01_B02_IND          = 2;                                           00000780
    POTALL_OPPL.IND      = BER_SØ_IND;                                  00000790
                                                        /*TEST*/        00000800
    DCL POENGÅR    PIC '999';                           /*TEST*/        00000810
    DCL UFT_ÅM     PIC '9999',                          /*TEST*/        00000820
        UFG        PIC '999';                           /*TEST*/        00000830
    POENGÅR =    POREKKE.PÅ(BER_SØ_IND);                /*TEST*/        00000840
    UFT_ÅM     = B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,1);     /*TEST*/        00000850
    UFG        = B02.UFØRHIST.UFG(BER_SØ_IND,1);        /*TEST*/        00000860
    EXEC CICS LINK PROGRAM ('R0014141')  COMMAREA (KOM_OMR);            00000870
    POENGÅR =    POREKKE.PÅ(BER_SØ_IND);                                00000880
    W_PÅ_E91  = 0;                                                      00000890
                                                                        00000900
    IF FEIL_MELD_NR > 0  THEN                                           00000910
       GO TO RETUR;                                                     00000920
    ELSE                                                                00000930
       PROGRAM_ID = 'R0014201';                                         00000940
                                                                        00000950
   /* TILLEGG 150196 TRUDE */                                           00000960
  IF  FNR_R.ÅR > 24 & FNR_R.ÅRHUNDRE < 5 THEN                           00000970
     DO;                                                                00000980
       FYLLER_67_ÅR = FNR_R.ÅR + 67;                                    00000990
     END;                                                               00001000
   /* HIT TRUDE 170895 */                                               00001010
    /*----------------------------------------------------------------*/00001020
    /* OVERGANGSREGLER FRA 0192. DE SOM HAR UFØRE- ELLER AFP-PENSJON  */00001030
    /* PR 31.12.92 SKAL BEHOLDE BEREGNING MED 45 PROSENT OGSÅ NÅR DET */00001040
    /* GJELDER ÅR ETTER 1991. TRUDE 12.92                             */00001050
    /*----------------------------------------------------------------*/00001060
                                                                        00001070
    /* FINNE SISTE UFØRHIST . TRUDE  261093*/                           00001080
    /*0697 HL:*/                                                        00001090
    DO J = 7 TO 1 BY - 1 UNTIL(B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,J) > 0);  00001100
       SISTE_UFØRHIST  = J;                                             00001110
    END;                                                          /*93*/00001120
                                                                  /*93*/00001130
   DCL AAMM  PIC '9999';                                                00001140
   AAMM = W_FNR_ÅM;  /*TESTEN NEDENFOR 22/25 ISTEDET FOR 2200/2500?*/   00001150
                                                                        00001160
   /*TEST PÅ 70 ÅR . FEIL FOR DENNE GRUPPE  */                          00001170
   /*W_FNR_ÅR TESTET KUN 25 /22 IKKE 2500 OSV*/                         00001180
   IF ALDER_ÅM   > 7000  &                                              00001190
      W_FNR_ÅM   > 2200  THEN                                           00001200
        B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND) =                            00001210
                                 POREKKE.PÅ_ETTER91(BER_SØ_IND);        00001220
  /*   ELSE                                                             00001230
    DO     TA BORT ELSE,END  0196 ??                                    00001240
    IF (B02.KONV_P_KODE(BER_SØ_IND)    = 'K'   &                        00001250
        B02.UTTAKSDATO_ÅM(BER_SØ_IND)  < 9200 ) !                       00001260
                                                                        00001270
      ((B02.KONV_P_KODE(BER_SØ_IND)    = 'U'   !                        00001280
        B02.KONV_P_KODE(BER_SØ_IND)    = 'Y' ) &          TILLEGG0893   00001290
        B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,SISTE_UFØRHIST) < 9200 ) THEN    00001300
                                                                        00001310
        PÅ_ETTER91_SØKER               = 'N';                           00001320
    ELSE                                                                00001330
       IF B02.UTTAKSDATO_ÅM(BER_SØ_IND)  > 9200  &                      00001340
          W_FNR_ÅM                       > 2500  THEN                   00001350
          B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND) =                          00001360
                                 POREKKE.PÅ_ETTER91(BER_SØ_IND);        00001370
                                                                        00001380
           TILLEGGSTEST 0150196TRUDE                                    00001390
           DET SKAL BRUKES 42 % I 67.,68.69. ÅRET                       00001400
                                                                        00001410
     IF (B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,SISTE_UFØRHIST) < 9200 &        00001420
         B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,SISTE_UFØRHIST)   > 7300 ) &    00001430
         B02.OPPHØRSKODE(BER_SØ_IND,SISTE_UFØRHIST)      ^= 'J'  THEN   00001440
        DO;                                                             00001450
          IF (ALDER_ÅM   > 7000)  &      TILLEGG 0296 HL                00001460
             (FYLLER_67_ÅR  > 91) THEN                                  00001470
            DO;                                                         00001480
               IF (POREKKE.POENG(BER_SØ_IND,FYLLER_67_ÅR)    +          00001490
                   POREKKE.POENG(BER_SØ_IND,(FYLLER_67_ÅR + 1)) +       00001500
                   POREKKE.POENG(BER_SØ_IND,(FYLLER_67_ÅR + 2)) > 0)    00001510
                                                             THEN       00001520
                 DO;                                                    00001530
               W_PÅ_E91  = 0;                                           00001540
               IF  POREKKE.POENG(BER_SØ_IND,FYLLER_67_ÅR) > 0 THEN      00001550
                    W_PÅ_E91  = W_PÅ_E91 + 1;                           00001560
                                                                        00001570
               IF  POREKKE.POENG(BER_SØ_IND,(FYLLER_67_ÅR + 1)) > 0 THEN00001580
                    W_PÅ_E91  = W_PÅ_E91 + 1;                           00001590
                                                                        00001600
               IF  POREKKE.POENG(BER_SØ_IND,(FYLLER_67_ÅR + 2)) > 0 THEN00001610
                    W_PÅ_E91  = W_PÅ_E91 + 1;                           00001620
                                                                        00001630
               B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND) =   W_PÅ_E91;         00001640
               PÅ_ETTER91_SØKER = 'J';                                  00001650
                                                                        00001660
                 END;                                                   00001670
             END;                                                       00001680
        END;    0196                                                    00001690
                                                                        00001700
                                                                        00001710
    SPØRSMÅL TIL PENSJONSKONTORET : SKAL DET VÆRE TEST PÅ FÅR?          00001720
    ANNA SIER I TLF 30.1.96 AT DET SKAL DET IKKE : (HL 0196)            00001730
                                                                        00001740
    IF (W_FNR_ÅM                   < 2600  &       2500 --> 2600        00001750
    IF                                                                  00001760
       (B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,SISTE_UFØRHIST) < 7300)  &       00001770
       (B02.KONV_P_KODE(BER_SØ_IND)    = 'U'   !                        00001780
        B02.KONV_P_KODE(BER_SØ_IND)    = 'Y' )  THEN                    00001790
            PÅ_ETTER91_SØKER               = 'N';                       00001800
                                                                        00001810
       TEST_E91 =  POREKKE.PÅ_ETTER91(BER_SØ_IND);                      00001820
                                                                        00001830
    IF   PÅ_ETTER91_SØKER        = 'N'  THEN                            00001840
      DO;                                                               00001850
         POREKKE.PÅ_ETTER91(BER_SØ_IND)     = 0;                        00001860
         B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND) = 0;                        00001870
         POREKKE_P67.PÅ_ETTER91(BER_SØ_IND) = 0;                        00001880
      END;                                                 HIT HL */    00001890
    /* 45/42 PROSENT HIT*/                                              00001900
 /* ***************************************************************** */00001910
 /* NY BEREGNING 42/45 :                                              */00001920
 /* ******************** ******************************************** */00001930
       TEST_E91 =  POREKKE.PÅ_ETTER91(BER_SØ_IND);                      00001940
     B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND) =                               00001950
                                 POREKKE.PÅ_ETTER91(BER_SØ_IND);        00001960
                                                                        00001970
     IF (B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,SISTE_UFØRHIST) < 7300)  &      00001980
        (B02.OPPHØRSKODE(BER_SØ_IND,SISTE_UFØRHIST)     = 'A') THEN     00001990
         B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND) = 0;                        00002000
     ELSE                                                               00002010
  /* IF (ALDER_ÅM   > 7000  &   FJERNET 27.2.96*/                       00002020
     IF (W_FNR_ÅM   > 2500     )       &                                00002030
        ((B02.KONV_P_KODE(BER_SØ_IND)    = 'K'   &                      00002040
          B02.UTTAKSDATO_ÅM(BER_SØ_IND)  < 9200 )    !                  00002050
                                                                        00002060
        ((B02.KONV_P_KODE(BER_SØ_IND)    = 'U'   !                      00002070
          B02.KONV_P_KODE(BER_SØ_IND)    = 'Y' ) &                      00002080
          B02.UFØRHIST.UFT_ÅM(BER_SØ_IND,SISTE_UFØRHIST) < 9200 ))      00002090
                    THEN                                                00002100
        DO;                                                             00002110
           FRADRAG = FNR_R.ÅR - 25;                                     00002120
           IF FRADRAG > POREKKE.PÅ_ETTER91(BER_SØ_IND)    THEN          00002130
              B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND)  = 0;                  00002140
           ELSE                                                         00002150
              B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND)  =                     00002160
              POREKKE.PÅ_ETTER91(BER_SØ_IND) - FRADRAG;                 00002170
        END;                                                            00002180
     IF B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND) = 0   THEN                   00002190
        DO;                                                             00002200
           POREKKE.PÅ_ETTER91(BER_SØ_IND)     = 0;                      00002210
           POREKKE_P67.PÅ_ETTER91(BER_SØ_IND) = 0;                      00002220
           PÅ_ETTER91_SØKER = 'N';                                      00002230
        END;                                                            00002240
     ELSE                                                               00002250
        PÅ_ETTER91_SØKER = 'J';                                         00002260
                                                                        00002270
     TEST_E91 =  B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND);                    00002280
 /* ***************************************************************** */00002290
 /* 42/45 HIT. HL 130296                                              */00002300
 /* ***************************************************************** */00002310
 /*   */                                                                00002320
    IF (B02.PENSJONSTYPE2(BER_SØ_IND) = 'S') THEN                       00002330
       DO;                                                              00002340
          B01_B02_IND = 2;                                              00002350
          POTALL_OPPL.IND = BER_EK_IND;                                 00002360
          EXEC CICS LINK PROGRAM ('R0014141')  COMMAREA (KOM_OMR);      00002370
                                                                        00002380
          IF FEIL_MELD_NR > 0  THEN                                     00002390
             GO TO RETUR;                                               00002400
          ELSE                                                          00002410
             PROGRAM_ID = 'R0014201';                                   00002420
                                                                        00002430
          POREKKE(14)            = POREKKE    (BER_SØ_IND);             00002440
                                                                        00002450
          /* OMRÅDE 14 BRUKES TIL OPPBEVARINGSOMRÅDE DA DETTE      */   00002460
          /* OMRÅDE ALLTID ER LEDIG PLASS FOR ALDERSPENSONISTER    */   00002470
                                                                        00002480
          W_POREKKE              = POREKKE_P67(BER_SØ_IND);             00002490
                                                                        00002500
          IF POREKKE.SPT(BER_SØ_IND) > 0 &                              00002510
             POREKKE.SPT(BER_EK_IND) > 0      THEN                      00002520
                                                                        00002530
 /*4143*/    CALL POENG_TILLEGG;                                        00002540
                                                                        00002550
                                                                        00002560
 /* ENDRET 28.11.86 HL - HVIS ALTERNATIV POREKKE, SOM ER EVT. ER  */    00002570
 /*   FRAPP 270          LAGT UT På PLASS 'IND + 11', HAR 'U' I   */    00002580
 /*                      TYPE, Så SKAL ALTERNATIV BEREGNING PRøVES*/    00002590
                                                                        00002600
          IF POREKKE.TYPE(BER_SØ_IND) = 'O' &                           00002610
             POREKKE.TYPE(BER_SØ_IND + 11) ^= 'U'   THEN                00002620
                                       /* O = ORDINÆR */                00002630
             DO;                                                        00002640
 /*4153*/       CALL BEREGN_SPT_OPT_PÅ    (                             00002650
                                BER_SØ_IND,POREKKE(BER_SØ_IND),W_FNR);  00002660
 /*4153*/       CALL BEREGN_SPT_OPT_PÅ    (                             00002670
                                BER_SØ_IND,POREKKE_P67(BER_SØ_IND),     00002680
                                                               W_FNR);  00002690
                                                                        00002700
                IF  PÅ_ETTER91_SØKER    = 'N'    THEN       /*42-45*/   00002710
                    B02.ALDERSP.TP(BER_SØ_IND)=                         00002720
                                    F_TILLEGGSPENSJON(FNR_R.ÅR,G,       00002730
                                    POREKKE.SPT(BER_SØ_IND),            00002740
                                    POREKKE.OPT(BER_SØ_IND),            00002750
                                    POREKKE.PÅ(BER_SØ_IND),             00002760
                                    100,100,'J');                       00002770
                ELSE                                      /*42-45*/     00002780
                   B02.ALDERSP.TP(BER_SØ_IND) =                         00002790
                                    F_TP92(FNR_R.ÅR,G,                  00002800
                                    POREKKE.SPT(BER_SØ_IND),            00002810
                                    POREKKE.OPT(BER_SØ_IND),            00002820
                                    POREKKE.PÅ(BER_SØ_IND),             00002830
                                    B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND), 00002840
                                    100,100,'J');                       00002850
                                                                        00002860
             END;                                                       00002870
                                                                        00002880
          ELSE     /* TYPE ER DA U = AP SOM VAR UP FØR 1973 */          00002890
                                                                        00002900
             DO;                                                        00002910
 /*4156*/       CALL BEREGN_SPT_OPT_PÅ_ALT(                             00002920
                                BER_SØ_IND,POREKKE(BER_SØ_IND),W_FNR);  00002930
 /*4156*/       CALL BEREGN_SPT_OPT_PÅ_ALT(                             00002940
                                BER_SØ_IND,POREKKE_P67(BER_SØ_IND),     00002950
                                                               W_FNR);  00002960
                                                                        00002970
                                                                        00002980
 /*28.11.86 HL- FRAPP 270 - PENSJON ETTER ALTERNATIVE POENGREKKER, */   00002990
 /*              OG MED POENGTILLEGG, SKAL SAMMENLIGNES.           */   00003000
                                                                        00003010
                IF  PÅ_ETTER91_SØKER    = 'N'    THEN       /*42-45*/   00003020
                    W_TP            = F_TILLEGGSPENSJON(FNR_R.ÅR,G,     00003030
                                    POREKKE.SPT(BER_SØ_IND),            00003040
                                    POREKKE.OPT(BER_SØ_IND),            00003050
                                    POREKKE.PÅ(BER_SØ_IND),             00003060
                                    100,100,'J');                       00003070
                                                                        00003080
                ELSE                                      /*42-45*/     00003090
                   W_TP  =          F_TP92(FNR_R.ÅR,G,                  00003100
                                    POREKKE.SPT(BER_SØ_IND),            00003110
                                    POREKKE.OPT(BER_SØ_IND),            00003120
                                    POREKKE.PÅ(BER_SØ_IND),             00003130
                                    B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND), 00003140
                                    100,100,'J');                       00003150
                                                                        00003160
                                                                        00003170
 /*4156*/       CALL BEREGN_SPT_OPT_PÅ_ALT(                             00003180
                                BER_SØ_IND,POREKKE(BER_SØ_IND + 11),    00003190
                                                             W_FNR);    00003200
                                                                        00003210
 /*4156*/       CALL BEREGN_SPT_OPT_PÅ_ALT(                             00003220
                            BER_SØ_IND,POREKKE_P67(BER_SØ_IND + 11),    00003230
                                                             W_FNR);    00003240
                                                                        00003250
                                                                        00003260
                IF  PÅ_ETTER91_SØKER    = 'N'    THEN       /*42-45*/   00003270
                    W_TP_ALT        = F_TILLEGGSPENSJON(FNR_R.ÅR,G,     00003280
                                    POREKKE.SPT(BER_SØ_IND + 11),       00003290
                                    POREKKE.OPT(BER_SØ_IND + 11),       00003300
                                    POREKKE.PÅ(BER_SØ_IND + 11),        00003310
                                    100,100,'J');                       00003320
                ELSE                                      /*42-45*/     00003330
                   W_TP_ALT =       F_TP92(FNR_R.ÅR,G,                  00003340
                                    POREKKE.SPT(BER_SØ_IND + 11),       00003350
                                    POREKKE.OPT(BER_SØ_IND + 11),       00003360
                                    POREKKE.PÅ(BER_SØ_IND + 11),        00003370
                                    B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND), 00003380
                                    100,100,'J');                       00003390
                                                                        00003400
                IF W_TP_ALT > W_TP                   THEN               00003410
                                                                        00003420
                   DO;                                                  00003430
                                                                        00003440
                      POREKKE(BER_SØ_IND) =                             00003450
                                     POREKKE(BER_SØ_IND + 11);          00003460
                                                                        00003470
                      POREKKE_P67(BER_SØ_IND) =                         00003480
                                     POREKKE_P67(BER_SØ_IND + 11);      00003490
                                                                        00003500
                      B02.ALDERSP.TP(BER_SØ_IND) = W_TP_ALT;            00003510
                                                                        00003520
                   END;                                                 00003530
                                                                        00003540
                ELSE                                                    00003550
                                                                        00003560
                      B02.ALDERSP.TP(BER_SØ_IND) = W_TP;                00003570
                                                                        00003580
             END;                                                       00003590
                                                                        00003600
       END;                                                             00003610
                                                                        00003620
    ELSE                                                                00003630
                                                                        00003640
       DO;                                                              00003650
          B02.POENGTILLEGG_DATO_ÅM(BER_SØ_IND) =  0;                    00003660
 /*0387*/ B02.POENGTILLEGG_KODE   (BER_SØ_IND) = ' ';                   00003670
          B02.POENGTILLEGG_DATO_ÅM(BER_EK_IND) =  0;                    00003680
 /* HL */ B02.POENGTILLEGG_KODE   (BER_EK_IND) = ' ';                   00003690
                                                                        00003700
       IF  PÅ_ETTER91_SØKER    = 'N'    THEN       /*42-45*/            00003710
          B02.ALDERSP.TP(BER_SØ_IND)= F_TILLEGGSPENSJON(FNR_R.ÅR,G,     00003720
                                    POREKKE.SPT(BER_SØ_IND),            00003730
                                    POREKKE.OPT(BER_SØ_IND),            00003740
                                    POREKKE.PÅ(BER_SØ_IND),             00003750
                                    100,100,'J');                       00003760
        ELSE                                           /*42-45*/        00003770
           B02.ALDERSP.TP(BER_SØ_IND) = F_TP92(FNR_R.ÅR,G,              00003780
                                    POREKKE.SPT(BER_SØ_IND),            00003790
                                    POREKKE.OPT(BER_SØ_IND),            00003800
                                    POREKKE.PÅ(BER_SØ_IND),             00003810
                                    B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND), 00003820
                                    100,100,'J');                       00003830
                                                                        00003840
       END;                                                             00003850
                                                                        00003860
    TEST_PÅ =    B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND);              /*92*/00003870
   /*0697 HL:                                                           00003880
     DO J = 7 TO 1 BY -1 UNTIL(B02.UFØRHIST.BUP_GAR_KODE(BER_SØ_IND,J)  00003890
                                     ^= ' ');                           00003900
        SISTE_KODE = J;                                                 00003910
     END;      ******************************** */                      00003920
                                                                        00003930
  /*HER HAR DET VÆRT FEIL EN STUND - ENDRET 9708 HL : */                00003940
                                                                        00003950
                                                                        00003960
     IF B02.BUP_GAR_KODE(BER_SØ_IND,1) = 'E'   THEN                     00003970
        DO;                                                             00003980
           IF  FNR_R.ÅR   = 23   !                                      00003990
               FNR_R.ÅR   = 24    THEN                                  00004000
                SPT_GARANTI   = 1.6;                                    00004010
           ELSE                                                         00004020
           IF FNR_R.ÅR      = 25 THEN                                   00004030
              DO;                                                       00004040
                 IF B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9101 THEN            00004050
                    SPT_GARANTI   = 1.60;                               00004060
                 ELSE                                                   00004070
                    SPT_GARANTI   = 2.00;                               00004080
              END;                                                      00004090
           ELSE                                                         00004100
           IF FNR_R.ÅR  < 31     THEN                                   00004110
              DO;                                                       00004120
                 IF B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9101 THEN            00004130
                    SPT_GARANTI   = 1.60;                               00004140
                 ELSE                                                   00004150
                 IF B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9201 THEN            00004160
                    SPT_GARANTI   = 2.00;                               00004170
                 ELSE                                                   00004180
                 IF B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9205 THEN            00004190
                    SPT_GARANTI   = 2.50;                               00004200
                 ELSE                                                   00004210
                    SPT_GARANTI   = 3.00;                               00004220
              END;                                                      00004230
           ELSE                                                         00004240
              DO;                                                       00004250
                 IF B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9101 THEN            00004260
                    SPT_GARANTI   = 1.60;                               00004270
                 ELSE                                                   00004280
                 IF B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9201 THEN            00004290
                    SPT_GARANTI   = 2.00;                               00004300
                 ELSE                                                   00004310
                 IF B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9205 THEN            00004320
                    SPT_GARANTI   = 2.50;                               00004330
                 ELSE                                                   00004340
                 IF B02.VIRK_DATO_ÅM(BER_SØ_IND) < 9705 THEN            00004350
                    SPT_GARANTI   = 3.00;                               00004360
                 ELSE                                                   00004370
                    SPT_GARANTI   = 3.30;                               00004380
              END;                                                      00004390
                                                                        00004400
  /*UF*/         TP_GARANTI  = ( SPT_GARANTI * 0.45 * G );              00004410
  /*UF*/         TP_GARANTI  = TP_GARANTI * B02.TT_ANV(BER_SØ_IND);     00004420
  /*UF*/         TP_GARANTI  = TP_GARANTI / ( 40 * 12) ;                00004430
  /*UF*/         TP_GARANTI1 = TP_GARANTI + 0.5;                        00004440
  /*UF*/                                                                00004450
  /*UF*/         IF TP_GARANTI1 > B02.ALDERSP.TP(BER_SØ_IND)  THEN      00004460
  /*UF*/            DO;                                                 00004470
  /*UF*/               B02.ALDERSP.TP(BER_SØ_IND)   = TP_GARANTI1;      00004480
  /*UF*/               B02.STATUS.TP_GAR_KODE(BER_SØ_IND)  = 'E';       00004490
  /*UF*/            END;                                                00004500
  /*UF*/    END;                                                        00004510
  /*UNG UFØR BLE IKKE RIKTIG VED OVERGANG TIL ALDER  8.1.90. TRUDE */   00004520
                                          /*TIL HIT, 8.1.90. TRUDE */   00004530
 /* FJERNET - HL 28.11.86  */                                           00004540
                                                                        00004550
 /******  B02.ALDERSP.TP(BER_SØ_IND)= F_TILLEGGSPENSJON(FNR_R.ÅR,G,     00004560
                                    POREKKE.SPT(BER_SØ_IND),            00004570
                                    POREKKE.OPT(BER_SØ_IND),            00004580
                                    POREKKE.PÅ(BER_SØ_IND),             00004590
                                    100,100,'J');    ************/      00004600
                                                                        00004610
 /* HIT HL *****************************/                               00004620
                                                                        00004630
    B02.ALDERSP.SPT (BER_SØ_IND) = POREKKE.SPT    (BER_SØ_IND);         00004640
    B02.ALDERSP.OPT (BER_SØ_IND) = POREKKE.OPT    (BER_SØ_IND);         00004650
    B02.ALDERSP.PÅ  (BER_SØ_IND) = POREKKE.PÅ     (BER_SØ_IND);         00004660
    B02.VT_SPT      (BER_SØ_IND) = POREKKE_P67.SPT(BER_SØ_IND);         00004670
    B02.VT_OPT      (BER_SØ_IND) = POREKKE_P67.OPT(BER_SØ_IND);         00004680
    B02.VT_PÅ       (BER_SØ_IND) = POREKKE_P67.PÅ (BER_SØ_IND);         00004690
                                                                        00004700
 /*STATSBORGER I STORBRITANNIA OG BOSATT UTENFOR NORDEN FÅR */          00004710
 /*IKKE TP MED MINDRE ENN 3 PÅ - NOTAT FRA RANDI OHNA 1194  */          00004720
                                                                        00004730
  IF B02.STATSBORGER(BER_SØ_IND) = 139        &                         00004740
     B02.BOSATT     (BER_SØ_IND) > 107        &                         00004750
     B02.ALDERSP.PÅ (BER_SØ_IND) < 3          THEN                      00004760
     DO;                                                                00004770
        B02.ALDERSP.TP (BER_SØ_IND) = 0;                                00004780
        GO TO RETUR;                                 /*HL*/             00004790
     END;                                                               00004800
                                                                        00004810
 /*LOVENDRING PR. 1.1.92 - HL : */                                      00004820
  HL_GT = B02.GT_LOV92(BER_SØ_IND);                                     00004830
  HL_GT = B02.GT_TILLEGG_LOV92(BER_SØ_IND);                             00004840
                                                                        00004850
  IF B02.ALDERSP.SPT_1291(BER_SØ_IND) > 0 THEN                          00004860
     B02.GT_LOV92(BER_SØ_IND) = F_TILLEGGSPENSJON(FNR_R.ÅR,35500,       00004870
                                B02.ALDERSP.SPT_1291(BER_SØ_IND),       00004880
                                B02.ALDERSP.OPT_1291(BER_SØ_IND),       00004890
                                B02.ALDERSP.PÅ_1291(BER_SØ_IND),        00004900
                                100,100,'J');                           00004910
  ELSE                                                                  00004920
     B02.GT_LOV92(BER_SØ_IND) = 0;                                      00004930
                                                                        00004940
  IF B02.GT_LOV92(BER_SØ_IND) > B02.ALDERSP.TP(BER_SØ_IND) THEN         00004950
     B02.GT_TILLEGG_LOV92(BER_SØ_IND) = B02.GT_LOV92(BER_SØ_IND)        00004960
                                   - B02.ALDERSP.TP(BER_SØ_IND);        00004970
  ELSE                                                                  00004980
     B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                              00004990
                                                                        00005000
    RETUR:                                                              00005010
                                                                        00005020
   END BEREGN_TP_AP;                                                    00005030
