 /*       SIST ENDRET 04/04-97 10.39.07 AV   JDA7339                  */00000000
 /*********************************************************************/00000010
 /* IDENTIFIKASJON:                                                   */00000020
 /*    R0016039  - TILLEGG TIL R0016032/33 SOB9704                    */00000030
 /* HENSIKT:                                                          */00000040
 /*    EN PROSEDYRE SOM HENTER FELTER FRA BLANKETT-OMR. V/U3-TRANS.   */00000050
 /* PROGRAMTILKNYTNING:                                               */00000060
 /*    LOKAL PROSEDYRE I R0016001                                     */00000070
 /*********************************************************************/00000080
                                                                        00000090
    /*----------------------------------------------------------------*/00000100
    /* YRKE, PRIMÆR- OG SEKUNDÆR-DIAGNOSE LEGGES IKKE UT I B01/B02.   */00000110
    /* DISSE OPPLYSNINGENE MÅ HENTES DIREKTE PÅ TRANSAKSJONEN.        */00000120
    /* 3 TYPER UP-BL. FRA 1994 MEDFØRER 3 PROC'ER: UP_OPPDAT/U2_OPPDAT*/00000130
    /*                                            /U3_OPPDAT          */00000140
    /*----------------------------------------------------------------*/00000150
                                                                        00000160
 U3_OPPDAT: PROC;                                                       00000170
                                                                        00000180
 %INCLUDE P001U601;     /* TRANS_OMR UP-BLANKETT U3 NY EØS-ENDRINGER */ 00000190
                                                                        00000200
    IF VERIFY(TRANS_OMR.U3S.FNR,'0123456789') = 0 THEN                  00000210
      IF TRANS_OMR.U3S.FNR = B02.PERSON(I).RF0PERSN.FNR THEN            00000220
      DO;                                                               00000230
        IF TRANS_OMR.U3S.YRKE > 0 THEN                                  00000240
           REGTPKT.YRKE = TRANS_OMR.U3S.YRKE;                           00000250
                                                                        00000260
        IF TRANS_OMR.U3S.PRIMDIAG > '      ' THEN                       00000270
          DO;                                                           00000280
            IF TRANS_OMR.U3S.YSKADE_TILLEGG = 'J' THEN                  00000290
               DIAGNOSE.PRIMDIAG_YRKE  = TRANS_OMR.U3S.PRIMDIAG;        00000300
            ELSE                                                        00000310
               DIAGNOSE.PRIMDIAG       = TRANS_OMR.U3S.PRIMDIAG;        00000320
            SEGMENT_TABELL.DIAGNOSE = TRUE;                             00000330
          END;                                                          00000340
                                                                        00000350
        IF TRANS_OMR.U3S.SEKUDIAG > '      ' THEN                       00000360
          DO;                                                           00000370
            IF TRANS_OMR.U3S.YSKADE_TILLEGG = 'J' THEN                  00000380
               DIAGNOSE.SEKUDIAG_YRKE  = TRANS_OMR.U3S.SEKUDIAG;        00000390
            ELSE                                                        00000400
               DIAGNOSE.SEKUDIAG       = TRANS_OMR.U3S.SEKUDIAG;        00000410
            SEGMENT_TABELL.DIAGNOSE = TRUE;                             00000420
          END;                                                          00000430
      END;                                                              00000440
                                                                        00000450
 END U3_OPPDAT;                                                         00000460
