 /*       SIST ENDRET 17/12-97 08.17.53 AV   HLA7339                  */00000000
 /*       SIST ENDRET 17/12-97 08.16.22 AV   HLA7339                  */00000010
 /*       SIST ENDRET 16/09-97 10.24.28 AV   JDA7339                  */00000020
 /*       SIST ENDRET 15/09-97 13.31.19 AV   JDA7339                  */00000030
 /*       SIST ENDRET 29/08-97 12.28.22 AV   JDA7339                  */00000040
 /*       SIST ENDRET 28/08-97 08.52.57 AV   SPA7339                  */00000050
 /*       SIST ENDRET 28/07-97 12.34.13 AV   HLA7339                  */00000060
 /*       SIST ENDRET 30/01-96 16.30.27 AV   HLB0310                  */00000070
 /*       SIST ENDRET 12/06-92 13.53.18 AV   TRUDE                    */00000080
 /*       SIST ENDRET 12/02-92 14.20.06 AV   HERMAN                   */00000090
 /*       SIST ENDRET 02/05-91 13.50.20 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 23/04-91 10.56.17 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 06/03-91 11.52.36 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 31/03-87 09.41.50 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 30/08-84 10.27.59 AV   OLAV                     */00000140
 /*       SIST ENDRET 04/01-84 14.14.13 AV   OLAV                     */00000150
 /*       SIST ENDRET 11/05-83 11.27.37 AV   OLAV                     */00000160
 /*       SIST ENDRET 03/02-83 14.08.35 AV   OLAV                     */00000170
 /*       SIST ENDRET 22/11-82 11.11.21 AV   FARVIK                   */00000180
 /*                                                                   */00000190
 /*IDENTIFIKASJON:                                                    */00000200
 /*    R0014161 - SUBRUTINE I PLI                                     */00000210
 /*    PROGRAMMERER: PER F. BERGESTAD, JUNI 1982                      */00000220
 /*HENSIKT:                                                           */00000230
 /*                                                                   */00000240
 /*                                                                   */00000250
 /*                                                                   */00000260
 /* ***************************************************************** */00000270
  LEGG_UFØREHIST_I_TAB:                                                 00000280
    PROC(IND,FØDSELSÅR);                                                00000290
  /* PROC(IND,FØDSELSÅR,TAB);     ENDERET  AVSATISH  21.4.91        */  00000300
  /*   %INCLUDE P0014003;          ENDERET AV SATISH  21.4.91       */  00000310
 %SKIP(2);                                                              00000320
   DCL I                 FIXED BIN(15) INIT(0);                         00000330
   DCL TABIND            FIXED BIN(15) INIT(0);                         00000340
   DCL  W_IND            FIXED BIN(15) INIT(0);                         00000350
   DCL INDEKS            FIXED BIN(15);                                 00000360
   DCL IND               FIXED BIN(15);                                 00000370
   DCL FØDSELSÅR         PIC '99';                                      00000380
   DCL OPPH_DATO         PIC'(4)9' INIT(0),                             00000390
       UFTPKT            PIC'(4)9' INIT(0),                             00000400
       UF_GRAD_ÅM        PIC'(4)9' INIT(0);                             00000410
    DCL                                                                 00000420
       1 UF_ÅM DEF UFTPKT,                                              00000430
         2 UF_ÅR         PIC'99',                                       00000440
         2 UF_MND        PIC'99';                                       00000450
    DCL                                                                 00000460
       1 OPPHØRSDATO     DEF OPPH_DATO,                                 00000470
         2 UF_OPPH_ÅR    PIC'99',                                       00000480
         2 UF_OPPH_MND   PIC'99';                                       00000490
    DCL                                                                 00000500
       1 UFG_DATO        DEF UF_GRAD_ÅM,                                00000510
         2 UFG_DATO_ÅR   PIC'99',                                       00000520
         2 UFG_DATO_MND  PIC'99';                                       00000530
    DCL                                                                 00000540
       UFG_STOPP         PIC'(4)9' INIT(0);                             00000550
    DCL                                                                 00000560
       W_TIDLIGERE_GRAD  FIXED(3)  INIT(0);                             00000570
    DCL W_POENG_GARANTI  FIXED DEC (3,2)  INIT (0);                     00000580
 %PAGE;                                                                 00000590
                                                                        00000600
 /*18.5.92 HL : FINNER RIKTIG GARANTI*/                                 00000610
 /* IF B02.BUP_GARANTI(IND,1) > 0         THEN     */                   00000620
 IF B02.BUP_GAR_KODE(IND,1) = 'B'      THEN     /*9708 HL*/             00000630
    IF VIRK_LOV92_ÅM                < 8805           THEN               00000640
       IF VIRK_LOV92_ÅM             < 8705           THEN               00000650
          IF VIRK_LOV92_ÅM          < 8401           THEN;              00000660
          ELSE                                                          00000670
             W_POENG_GARANTI = 2.00;                                    00000680
       ELSE                                                             00000690
          W_POENG_GARANTI = 2.50;                                       00000700
    ELSE                                                                00000710
       IF VIRK_LOV92_ÅM             < 9105           THEN               00000720
          W_POENG_GARANTI = 3.00;                                       00000730
       ELSE                                                             00000740
          W_POENG_GARANTI = 3.30;                                       00000750
 /*                                                                   */00000760
 /*  LOOPER 7 GANGER, DA DET KAN VÆRE 7 UFØREPERIODER :               */00000770
 /*                                                                   */00000780
  DO INDEKS = 1 TO 7;          /*0697 HL*/                              00000790
     IF B02.UFT_ÅM(IND,INDEKS) > 0 THEN                                 00000800
        DO;                                                             00000810
           UFTPKT    = B02.UFØRHIST.UFT_ÅM(IND,INDEKS);                 00000820
           OPPH_DATO = B02.OPPHØRSDATO_ÅM(IND,INDEKS);                  00000830
                                                                        00000840
 /* OPPHØRSDATO ER FRA JAN 91 MÅNEDEN ETTER 67 ÅR FYLLES (0196 HL)*/    00000850
                                                                        00000860
           IF FØDSELSÅR > 23            &                               00000870
              UF_OPPH_ÅR > (FØDSELSÅR + 67)   THEN                      00000880
              DO;                                                       00000890
                 UF_OPPH_ÅR = UF_OPPH_ÅR - 1;                           00000900
                 UF_OPPH_MND = 12;                                      00000910
              END;                                                      00000920
                                                                        00000930
 /*                                                                   */00000940
 /*        FOR HVER UFØREPERIODE UTFØRES FØLGENDE :                   */00000950
 /*                                                                   */00000960
           IF UF_ÅR < 67                THEN                            00000970
              DO;                                                       00000980
       /*        UF_ÅR    = 67;                                         00000990
                 UF_MND   = 01;              */                         00001000
       /*9712 HL : */                                                   00001010
                 UF_ÅR    = 66;                                         00001020
                 UF_MND   = 12;                                         00001030
                 TAB.POENGGARANTI(67)    = W_POENG_GARANTI;             00001040
                 TAB.POENGGARANTI_KODE(67) =                            00001050
                      B02.BUP_GAR_KODE(IND,INDEKS);                     00001060
              END;                                                      00001070
           TAB.UFØR_START_MND(UF_ÅR)   = UF_MND;                        00001080
           IF TAB.UFØR_GRAD(UF_ÅR) < B02.UFØRHIST.UFG(IND,INDEKS)       00001090
                                                                  THEN  00001100
 /*                                                                   */00001110
 /*              I DE TILFELLER HVOR VI HAR LAGT UT EN UFØREPERIODE   */00001120
 /*              OG HOLDER PÅ MED NESTE, LEGGER VI DEN NYE UFØRE-     */00001130
 /*              GRADEN OVER DEN SOM LIGGER I TABELLEN FRA FØR.       */00001140
 /*              VI SKAL BRUKE HØYESTE UFØREGRAD FOR HVERT ENKELT ÅR  */00001150
 /*                                                                   */00001160
              TAB.UFØR_GRAD(UF_ÅR) = B02.UFØRHIST.UFG(IND,INDEKS);      00001170
           ELSE                                                         00001180
 /*                                                                   */00001190
 /*     I DE TILFELLER HVOR VI HAR LAGT UT EN UFØREPERIODE OG HOLDER  */00001200
 /*     PÅ MED NESTE, LEGGER VI DEN NYE UFØREGRADEN UT I TABELLEN     */00001210
 /*     PÅ NESTE ÅR NÅR UFØREGRADEN ER MINDRE                         */00001220
 /*     VI SKAL BRUKE HØYESTE UFØREGRAD FOR HVERT ENKELT ÅR.          */00001230
 /*                                                                   */00001240
              TAB.UFØR_GRAD(UF_ÅR + 1)    =                             00001250
                                        B02.UFØRHIST.UFG(IND,INDEKS);   00001260
           TAB.UFØR_KRIT(UF_ÅR)        =                                00001270
                                        B02.UFKRITERIER(IND,INDEKS);    00001280
           TAB.UFØR_PERIODE(UF_ÅR)     =                                00001290
                                        'S';                            00001300
           TAB.POENGGARANTI(UF_ÅR)     = W_POENG_GARANTI;               00001310
     /*                                 B02.BUP_GARANTI(IND,INDEKS) */  00001320
           TAB.POENGGARANTI_KODE(UF_ÅR) =                               00001330
                                        B02.BUP_GAR_KODE(IND,INDEKS);   00001340
           IF B02.OPPHØRSDATO_ÅM(IND,INDEKS) > 0 THEN                   00001350
              DO;                                                       00001360
                 TAB.UFØR_SLUTT_MND(UF_OPPH_ÅR) = UF_OPPH_MND;          00001370
                 TAB.UFØR_SLUTT_KODE(UF_OPPH_ÅR)=                       00001380
                                         B02.OPPHØRSKODE(IND,INDEKS);   00001390
                 TAB.UFØR_PERIODE(UF_OPPH_ÅR)   =                       00001400
                                         B02.OPPHØRSKODE(IND,INDEKS);   00001410
                 TAB.UFØR_GRAD(UF_OPPH_ÅR + 1)  = 0;                    00001420
                                                                        00001430
 /*HER HAR DET VÆRT FEIL LENGE - HL 0196  : */                          00001440
                                                                        00001450
                                                                        00001460
                                                                        00001470
              END;                                                      00001480
                                                                        00001490
           W_TIDLIGERE_GRAD = B02.UFØRHIST.UFG(IND,INDEKS);             00001500
                                                                        00001510
           IF B02.UFØRHIST.REDUSERT_ANT_BUP_ÅR(IND,INDEKS) > 0 THEN     00001520
              DO;                                                       00001530
                 TABIND = UF_ÅR +                                       00001540
                    B02.UFØRHIST.REDUSERT_ANT_BUP_ÅR(IND,INDEKS) - 1;   00001550
                 IF UF_OPPH_ÅR > TABIND           !                     00001560
                    UF_OPPH_ÅR = 0                THEN                  00001570
                    DO W_IND = TABIND TO 150;                           00001580
                       TAB.SISTE_BUP_ÅR(W_IND) = 'J';                   00001590
                    END;                                                00001600
              END;                                                      00001610
                                                                        00001620
           DO I = 1 TO 7;        /*0697 HL*/                            00001630
 /*                                                                   */00001640
 /*        LOOPER 7 GANGER FORDI DET KAN VÆRE 7 UFØREGRADPERIODER     */00001650
 /*        UNDER HVER UFØREPERIODE                                    */00001660
 /*                                                                   */00001670
              IF B02.UFG_DATO_ÅM(IND,INDEKS,I) > 0 THEN                 00001680
                 DO;                                                    00001690
                    UF_GRAD_ÅM = B02.UFG_DATO_ÅM(IND,INDEKS,I);         00001700
                    IF W_TIDLIGERE_GRAD < B02.UFG_ØVRIGE(               00001710
                                                      IND,INDEKS,I) !   00001720
                       UFG_DATO_MND = 01                      THEN      00001730
 /*                                                                   */00001740
 /*                    SAMME REGEL SOM FOR NY UFØREPERIODE. HØYESTE   */00001750
 /*                    UFØREGRAD FOR HVERT ÅR SKAL BENYTTES.          */00001760
 /*                                                                   */00001770
                       TAB.UFØR_GRAD(UFG_DATO_ÅR) = B02.UFG_ØVRIGE(     00001780
                                                          IND,INDEKS,I);00001790
                    ELSE                                                00001800
                      IF TAB.UFØR_SLUTT_MND(UFG_DATO_ÅR + 1) ^= 01 THEN 00001810
 /*                                                                   */00001820
 /*                      SAMME REGEL SOM FOR NY UFØREPERIODE. HØYESTE */00001830
 /*                      UFØREGRAD FOR HVERT ÅR SKAL BENYTTES. DETTE  */00001840
 /*                      GJØRES BARE HVIS NESTE ÅR IKKE ER ET OPPHØRS-*/00001850
 /*                      ÅR.                                          */00001860
 /*                                                                   */00001870
                         TAB.UFØR_GRAD(UFG_DATO_ÅR + 1) =               00001880
                                        B02.UFG_ØVRIGE(IND,INDEKS,I);   00001890
                                                                        00001900
                    W_TIDLIGERE_GRAD = B02.UFG_ØVRIGE(IND,INDEKS,I);    00001910
                 END;                                                   00001920
              ELSE                                                      00001930
                 I = 7;           /*0697 HL*/                           00001940
           END;                                                         00001950
 %PAGE;                                                                 00001960
           IF UF_OPPH_ÅR > 0 THEN                                       00001970
 /*                                                                   */00001980
 /*          HER SETTER VI STOPPÅR FOR DENNE UFØREPERIODEN NÅR UFØRE- */00001990
 /*          PERIODEN HAR ET OPPHØR. HVIS OPPHØRET ET ÅR ER I JANUAR, */00002000
 /*          SETTES STOPPÅR TIL ÅRET FØR.                             */00002010
 /*                                                                   */00002020
              DO;                                                       00002030
                UFG_STOPP = UF_OPPH_ÅR;                                 00002040
                IF TAB.UFØR_SLUTT_MND(UF_OPPH_ÅR) = 01 THEN             00002050
                   DO;                                                  00002060
                      TAB.UFØR_GRAD(UF_OPPH_ÅR) = 0;                    00002070
                      UFG_STOPP                 = UFG_STOPP - 1;        00002080
                   END;                                                 00002090
              END;                                                      00002100
           ELSE                                                         00002110
 /*                                                                   */00002120
 /*           STOPPÅR FOR DENNE UFØREPERIODEN SETTES TIL DET ÅRET     */00002130
 /*           PERSONEN FYLLER 66 ÅR NÅR UFØREPERIODEN IKKE ER OPPHØRT.*/00002140
 /*                                                                   */00002150
              DO;                                                       00002160
                IF UF_ÅR < 73 THEN                                      00002170
                   UFG_STOPP = FØDSELSÅR + 69;                          00002180
                ELSE                                                    00002190
                   UFG_STOPP = FØDSELSÅR + 66;                          00002200
                                                                        00002210
                IF W_FNR_R.ÅRHUNDRE > 4        THEN                     00002220
                   UFG_STOPP = UFG_STOPP - 100;                         00002230
                                                                        00002240
              END;                                                      00002250
 %PAGE;                                                                 00002260
           IF UF_ÅR < UFG_STOPP THEN                                    00002270
              DO I = UF_ÅR + 1 TO UFG_STOPP;                            00002280
                 IF TAB.UFØR_GRAD(I) = 0 THEN                           00002290
 /*                                                                   */00002300
 /*               HER FYLLER VI UT MELLOMLIGGENDE ÅR MED UFØREGRADEN  */00002310
 /*               FOR ÅRET FØR HVIS DET IKKE LÅ EN GRAD DER FRA FØR.  */00002320
 /*                                                                   */00002330
                    TAB.UFØR_GRAD(I) = TAB.UFØR_GRAD(I - 1);            00002340
                 IF TAB.UFØR_PERIODE(I) = ' ' THEN                      00002350
                    IF UF_OPPH_ÅR > 0 THEN                              00002360
 /*                                                                   */00002370
 /*                    MELLOMLIGGENDE ÅR MERKES MED 'M' NÅR PERIODEN  */00002380
 /*                    HAR EN STARTDATO OG OPPHØRSDATO.               */00002390
 /*                                                                   */00002400
                       TAB.UFØR_PERIODE(I) = 'M';                       00002410
                    ELSE                                                00002420
 /*                                                                   */00002430
 /*                 ÅR SOM TILHØRER EN LØPENDE UFØREPERIODE MERKES 'L'*/00002440
 /*                                                                   */00002450
                       TAB.UFØR_PERIODE(I) = 'L';                       00002460
              END;                                                      00002470
    END;                                                                00002480
  ELSE                                                                  00002490
     INDEKS = 7;     /*0697 HL*/                                        00002500
 END;                                                                   00002510
 %SKIP(2);                                                              00002520
  END LEGG_UFØREHIST_I_TAB;                                             00002530
