 /*       SIST ENDRET 12/05-87 08.36.38 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 04/03-86 10.04.59 AV   FARVIK                   */00000010
 /*       SIST ENDRET 11/10-85 08.35.30 AV   FARVIK                   */00000020
 /*       SIST ENDRET 27/08-85 15.06.40 AV   FARVIK                   */00000030
 /*       SIST ENDRET 27/03-84 09.35.10 AV   FARVIK                   */00000040
 /*       SIST ENDRET 25/10-82 07.49.54 AV   PERB                     */00000050
 /* ***************************************************************** */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /*    R0011709                                                       */00000080
 /*    PROGRAMMERER: GEIR, SEPTEMBER 81                               */00000090
 /*HENSIKT:                                                           */00000100
 /*    R0011709 INNEHOLDER:                                           */00000110
 /*      PROSEDYRE FOR BLANKING AV O2_MAP.                            */00000120
 /*      PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL        */00000130
 /*           O2_TRANS_OMR.                                           */00000140
 /*      PROSEDYRENE ER SKILT UT FRA R0011702.   070587  BRITT        */00000150
 /*PROGRAMTILKNYTNING:                                                */00000160
 /*    PROSEDYRENE INCLUDES I ALDERSBEHANDLINGA TIL DET MASKINELLE    */00000170
 /*    FOLKETRYGDSYSTEMET.                                            */00000180
 /*    ARBEIDSOMRÅDE: P0011701  (LIGGER I R001.TEST.COPYLIB)          */00000190
 /*BRUK:                                                              */00000200
 /*    %INCLUDE R0011709;                                             */00000210
 /*    BLANK_O2_MAP:              SETTER LOW VALUES I MAPEN OG        */00000220
 /*                               BLANKER MELDINGSFELTENE.            */00000230
 /*    OVERFØR_O2_OPPHØR:         OVERFØRER OPPHØRSBL.MAP->ARBEIDSO M */00000240
 /*                                                                   */00000250
 /* ***************************************************************** */00000260
 /* ***************************************************************** */00000270
 /*                                                                   */00000280
 /*   PROSEDYRE FOR Å SETTE LOW VALUES I MAPEN, SAMT OG BLANKE        */00000290
 /*   MELDINGSFELTENE.                                                */00000300
 /*                                                                   */00000310
 /* ***************************************************************** */00000320
 %SKIP;                                                                 00000330
   BLANK_O2_MAP:                                                        00000340
      PROC;                                                             00000350
   DCL                                                                  00000360
     LOW BUILTIN;                                                       00000370
     FNR_BARN1O  = LOW(11);                                             00000380
     FNR_BARN2O  = LOW(11);                                             00000390
     FNR_BARN3O  = LOW(11);                                             00000400
     FNR_BARN4O  = LOW(11);                                             00000410
     FNR_BARN5O  = LOW(11);                                             00000420
     MELDING1O   = (78)' ';                                             00000430
     MELDING2O   = (78)' ';                                             00000440
     MELDING3O   = (78)' ';                                             00000450
     MELDING4O   = (78)' ';                                             00000460
     MELDING5O   = (78)' ';                                             00000470
     MELDING6O   = (78)' ';                                             00000480
   END BLANK_O2_MAP;                                                    00000490
 %PAGE;         /*  */                                                  00000500
 /* ***************************************************************** */00000510
 /*                                                                   */00000520
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT, EVENTUELT          */00000530
 /*   ENDRA PÅ SKJERMBILDET TIL O2.TRANS_OMR I KOM_OMR FOR            */00000540
 /*   OPPHØRSBLANKETT 2.                                              */00000550
 /*         MAPSET:  S001073    MAP:  S001071                         */00000560
 /*                                                                   */00000570
 /* ***************************************************************** */00000580
 %SKIP(2);                                                              00000590
  OVERFØR_O2_OPPHØR:                                                    00000600
    PROC;                                                               00000610
       IF REGDATOL           > 0 THEN                                   00000620
          O2.REGDATO         = F_FELT_CHAR_PIC6  (REGDATOI);            00000630
       IF TERMIDL            > 0 THEN                                   00000640
          O2.TERMID          = TERMIDI;                                 00000650
       IF FNRL               > 0 THEN                                   00000660
          O2.FNR             = F_FELT_CHAR_PIC11 (FNRI);                00000670
       IF TKNRL              > 0 THEN                                   00000680
          O2.TKNR            = F_FELT_CHAR_PIC4 (TKNRI);                00000690
       IF VIRK_DATO_MÅL      > 0 THEN                                   00000700
          O2.VIRK_DATO_MÅ    = F_FELT_CHAR_PIC4 (VIRK_DATO_MÅI);        00000710
       IF EK_TILLL           > 0 THEN                                   00000720
          O2.EK_TILL         = EK_TILLI;                                00000730
       IF FNR_BARN1L         > 0 THEN                                   00000740
          O2.FNR_BARN(1)     = F_FELT_CHAR_PIC11 (FNR_BARN1I);          00000750
       IF FNR_BARN2L         > 0 THEN                                   00000760
          O2.FNR_BARN(2)     = F_FELT_CHAR_PIC11 (FNR_BARN2I);          00000770
       IF FNR_BARN3L         > 0 THEN                                   00000780
          O2.FNR_BARN(3)     = F_FELT_CHAR_PIC11 (FNR_BARN3I);          00000790
       IF FNR_BARN4L         > 0 THEN                                   00000800
          O2.FNR_BARN(4)     = F_FELT_CHAR_PIC11 (FNR_BARN4I);          00000810
       IF FNR_BARN5L         > 0 THEN                                   00000820
          O2.FNR_BARN(5)     = F_FELT_CHAR_PIC11 (FNR_BARN5I);          00000830
       IF OPPHØRS_KODEL      > 0 THEN                                   00000840
          O2.OPPHØR_KODE     = OPPHØRS_KODEI;                           00000850
  END OVERFØR_O2_OPPHØR;                                                00000860
