 /*       SIST ENDRET 24/03-87 11.45.52 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 30/08-84 08.46.25 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 04/01-83 09.39.53 AV   OLAV                     */00000020
 /*       SIST ENDRET 08/11-82 11.46.54 AV   FARVIK                   */00000030
 /*       SIST ENDRET 01/10-82 13.48.04 AV   FARVIK                   */00000040
 /* ***************************************************************** */00000050
 /*IDENTIFIKASJON:                                                    */00000060
 /*    R0014125 - APD_70ÅR - INTERN PROC I PLI.                       */00000070
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982.                          */00000080
 /*    ENDRET AV KARIN I JULI                                         */00000090
 /*HENSIKT:                                                           */00000100
 /*    PROGRAMMET SETTER APD = 100 FOR PERSONER OVER 70 ÅR SOM        */00000110
 /*    TIDLIGERE IKKE HAR TATT UT FULL AP.                            */00000120
 /*PROGRAMTILKNYTNING:                                                */00000130
 /*    PROGRAMMET BLIR INKLUDERT I R0014101 - BEREGN_ETTERLATT_AP.    */00000140
 /*BRUK:                                                              */00000150
 /*    CALL APD_70ÅR;                                                 */00000160
 /* ***************************************************************** */00000170
 APD_70ÅR: PROC;                                                        00000180
                                                                        00000190
  DCL                                                                   00000200
    I                    FIXED BIN(15);                                 00000210
                                                                        00000220
                                                                        00000230
   PROGRAM_ID = 'R0014125';                                             00000240
   IF B02.ALDERSP.APD(BER_SØ_IND) < 100 THEN                            00000250
                                                                        00000260
     DO;                                                                00000270
       B02.ALDERSP.APD(BER_SØ_IND) = 100;                               00000280
                                                                        00000290
   /* ENDRET 151286 BF: FAI OG EVT. ETTEPENS.FORVENTET SETTES TIL 0. */ 00000300
                                                                        00000310
       B02.ALDERSP.FAI(BER_SØ_IND) = 0;                                 00000320
       IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'E' THEN                      00000330
          B02.ETTEPENS.FORVENTET(BER_SØ_IND) = 0;                       00000340
                                                                        00000350
   /* HIT    151286 BF                                               */ 00000360
                                                                        00000370
       IF B02.ALDERSP.UTTAKSDATO_ÅM(BER_SØ_IND) > 0 THEN                00000380
                                                                        00000390
         /* PERSONEN HAR TATT UT GRADERT AP TIDLIGERE    */             00000400
         DO I = 1 TO 5;                                                 00000410
           IF B02.ALDERSP.UTTAKSDATO_ÅM_ØVRIGE(BER_SØ_IND,I) = 0 THEN   00000420
                                                                        00000430
             DO;                                                        00000440
               B02.ALDERSP.UTTAKSDATO_ÅM_ØVRIGE(BER_SØ_IND,I) =         00000450
               B02.STATUS.VIRK_DATO_ÅM         (BER_SØ_IND);            00000460
               B02.ALDERSP.APD_ØVRIGE          (BER_SØ_IND,I) = 100;    00000470
               I = 5;                                                   00000480
             END;                                                       00000490
                                                                        00000500
           ELSE IF I = 5 THEN                                           00000510
                                                                        00000520
             DO;                                                        00000530
 L100:                                                                  00000540
                FEIL_MELD_NR = 218;   /*ANTALL VENTEPERIODER OPPBRUKT*/ 00000550
                FEIL_VED_LABEL = 'L100';                                00000560
                GOTO L999;                                              00000570
             END;                                                       00000580
         END;                                                           00000590
                                                                        00000600
       ELSE                                                             00000610
                                                                        00000620
         DO;                                                            00000630
           B02.ALDERSP.UTTAKS_APD(BER_SØ_IND) = 100;                    00000640
           B02.ALDERSP.UTTAKSDATO_ÅM(BER_SØ_IND) =                      00000650
                  B02.STATUS.VIRK_DATO_ÅM(BER_SØ_IND);                  00000660
         END;                                                           00000670
     END;                                                               00000680
                                                                        00000690
   ELSE                                                                 00000700
      IF B02.ALDERSP.UTTAKSDATO_ÅM(BER_SØ_IND) = 0 THEN                 00000710
         DO;                                                            00000720
            B02.ALDERSP.UTTAKS_APD(BER_SØ_IND) = 100;                   00000730
            B02.ALDERSP.UTTAKSDATO_ÅM(BER_SØ_IND) =                     00000740
                  B02.STATUS.VIRK_DATO_ÅM(BER_SØ_IND);                  00000750
         END;                                                           00000760
                                                                        00000770
 L999:                                                                  00000780
     END APD_70ÅR;                                                      00000790
