 /*       SIST ENDRET 27/10-88 09.00.28 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 27/06-88 11.05.43 AV   HERMAN                   */00000010
 /*       SIST ENDRET 16/05-88 12.30.24 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 19/01-88 08.22.57 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 28/10-87 14.52.51 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 01/09-87 08.45.34 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 19/05-87 11.08.29 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 11/11-86 11.50.02 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 16/12-85 07.43.35 AV   FARVIK                   */00000080
 /*       SIST ENDRET 20/09-85 08.06.23 AV   FARVIK                   */00000090
 /*       SIST ENDRET 02/08-85 15.20.06 AV   FARVIK                   */00000100
 /*       SIST ENDRET 10/07-85 08.05.55 AV   LUNDEBY                  */00000110
                                                                        00000120
                                                                        00000130
 /* ***************************************************************** */00000140
 /*                                                                   */00000150
 /*  PROGRAMMET FORTAR OVERFØRINGER AV INNTEKTER FRA ETT FNR TIL      */00000160
 /*  ETT ANNET OG FJERNER INNTEKTENE TIL FRA-FNR.                     */00000170
 /*  PROGRAMMET KALLES OPP FRA R001I101.                              */00000180
 /*                                                                   */00000190
 /*  PROGRAMMERER ROLF FARVIK, DATA-UTVIKLING A/S ,     JUNI  1983    */00000200
 /* ***************************************************************** */00000210
 /* ENDRET 29.01.85 AV SVERRE LUNDEBY FRA DATA-UTVIKLING A/S.         */00000220
 /* ---------------                                                   */00000230
 /*    LEGGER UT DATA TIL NORTRYGD. TKNR FINNES VED 1. OG SJEKKE OM   */00000240
 /*    DET FINNES I ROT-SEGM. ER RF0PERSN.TKNR = 0 BRUKES KOMMNR. I   */00000250
 /*    SISTE INNTEKTS-SEGM.                                           */00000260
 /*                                                                   */00000270
 /* ENDRET 06.01.88 AV SVERRE LUNDEBY FRA DATA-UTVIKLING A/S.         */00000280
 /* ---------------                                                   */00000290
 /*    FEILRAPPORT : 540 OG 564                                       */00000300
 /*    OPPRETTER TIL PERSON VED OVERFØRING AV INNTEKTET.              */00000310
 /*    ROT OPPLYSNINGENE ER LIK FRA-FNR'S ROT-OPPLYSNINGER.           */00000320
 /*                                                                   */00000330
 /*ENDRET: 06.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000340
 /* ******                                                            */00000350
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000360
 /*    OM FNR ER ENDRET (R0019906).                                   */00000370
 /*                                                                   */00000380
 /*ENDRET: 13.09.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000390
 /* ******                                                            */00000400
 /*    LEGGER INN STYRING AV CICS-OPPL. I MAP.                        */00000410
 /* ***************************************************************** */00000420
                                                                        00000430
 R001I20:                                                               00000440
   PROC (INTERN_KOM_PTR) OPTIONS(MAIN);                                 00000450
                                                                        00000460
                                                                        00000470
 %PAGE;                                                                 00000480
      %INCLUDE S001I1;     /*  INNTEKTMAPSET1    (BASED) */             00000490
                                                                        00000500
 %PAGE;                                                                 00000510
      %INCLUDE S001I2;     /*  INNTEKTMAPSET2    (BASED) */             00000520
                                                                        00000530
 %PAGE;                                                                 00000540
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */            00000550
 %PAGE;                                                                 00000560
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                    00000570
 %PAGE;                                                                 00000580
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */               00000590
 %PAGE;                                                                 00000600
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */              00000610
 %PAGE;                                                                 00000620
 %SKIP(1);                                                              00000630
   DCL                                                                  00000640
       MAP_MELDING              CHAR(78)      INIT((78)' '),            00000650
       1  FEIL_STRUC,                                                   00000660
          2  FEIL_NR               FIXED DEC(5),                        00000670
          2  FEIL_MELDING          CHAR     (78),                       00000680
          2  KOM_OMR_PEKER         POINTER;                             00000690
    %PAGE;                                                              00000700
    /* ************************************************************** */00000710
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00000720
    /* ************************************************************** */00000730
                                                                        00000740
       DCL                                                              00000750
         ( ADDR , CSTG , LOW , STG , SUBSTR , ONCODE , NULL )  BUILTIN; 00000760
       DCL                                                              00000770
         PLITDLI ENTRY,                                                 00000780
              BMSMAPBR  PTR;                                            00000790
                                                                        00000800
    /* ************************************************************** */00000810
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000820
    /* ************************************************************** */00000830
                                                                        00000840
    %INCLUDE DLIUIB;                                                    00000850
                                                                        00000860
       DCL                                                              00000870
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00000880
                                                                        00000890
       DCL                                                              00000900
         ( COMMAREA_PEKER , W01_HJELPE_PEKER , TRANS_SEGM_PEKER )       00000910
                                               POINTER;                 00000920
                                                                        00000930
       DCL GAMMEL_AKSJONSKODE        CHAR (2)     ;                     00000940
                                                                        00000950
       DCL INNT_ALDER_FRA            PIC '(2)9'   ;                     00000960
                                                                        00000970
       DCL INNT_ALDER_TIL            PIC '(2)9'   ;                     00000980
                                                                        00000990
       DCL FNR_PIC                   PIC '(11)9'  ;                     00001000
                                                                        00001010
       DCL FNR_CHAR   DEF FNR_PIC    CHAR (11)    ;                     00001020
                                                                        00001030
       DCL ANTALL_FRA_LEST           FIXED DEC (3);                     00001040
                                                                        00001050
       DCL ANTALL_TIL_LEST           FIXED DEC (3);                     00001060
                                                                        00001070
       DCL W02_INNT_MÅ               PIC '(4)9'   ;                     00001080
                                                                        00001090
       DCL ANTALL_LEST               FIXED DEC (3);                     00001100
                                                                        00001110
       DCL LOW_VALUES            CHAR(6)          ;                     00001120
                                                                        00001130
       DCL LOW_VALUES_1500       CHAR(1500)       ;                     00001140
                                                                        00001150
       DCL MAP_OMR               CHAR(1500) BASED (BMSMAPBR);           00001160
                                                                        00001170
       DCL FATAL_FEIL            CHAR (1) INIT ('S');                   00001180
                                                                        00001190
       DCL 1 FNR_REG,                                                   00001200
             2 FNR1              FIXED DEC(11),                         00001210
             2 FNR2              FIXED DEC(11),                         00001220
             2 BRUKERID          CHAR     ( 4);                         00001230
                                                                        00001240
       DCL HUSK_PI_ÅR_FRA        FIXED    DEC   (3)    ,                00001250
           HUSK_PI_ÅR_TIL        FIXED    DEC   (3)    ,                00001260
           HUSK_PI_TYPE_FRA               CHAR  (1)    ,                00001270
           HUSK_PI_TYPE_TIL               CHAR  (1)    ;                00001280
                                                                        00001290
                                                                        00001300
    /*----------------------------------------------------------------*/00001310
    /*   RF0PERSN                                                     */00001320
    /*----------------------------------------------------------------*/00001330
                                                                        00001340
       DCL 1  RF0PERSN               UNALIGNED,                         00001350
       %INCLUDE P0019927;                                               00001360
                                                                        00001370
    /*----------------------------------------------------------------*/00001380
    /*   INNTEKT-SEGMENTET                                            */00001390
    /*----------------------------------------------------------------*/00001400
                                                                        00001410
       DCL 1  W01_PINT               UNALIGNED,                         00001420
       %INCLUDE P0019928;                                               00001430
                                                                        00001440
                                                                        00001450
                                                                        00001460
    /* ************************************************************** */00001470
    /*   INNTEKTSTABELL.                                              */00001480
    /* ************************************************************** */00001490
                                                                        00001500
       DCL 1  W03                    UNALIGNED,                         00001510
              2  W02(24),                                               00001520
                 3   TAB_PI_ÅR          FIXED    DEC   (3) ,            00001530
                 3   TAB_PI_KODE,                                       00001540
                     4   TAB_PI_TYPE             CHAR  (1) ,            00001550
                     4   TAB_PI_MERKE            PIC  '9'  ,            00001560
                 3   TAB_PI             FIXED    DEC   (7) ,            00001570
                 3   TAB_PI_KOMMNR      FIXED    DEC   (5) ,            00001580
                 3   TAB_PI_RAPPDATO    FIXED    DEC   (5) ;            00001590
                                                                        00001600
                                                                        00001610
       DCL INTERN_KOM_PTR        POINTER;                               00001620
                                                                        00001630
       DCL 1 INTERN_KOM_OMR  BASED (INTERN_KOM_PTR),                    00001640
             2 HOVED_KOM_PTR        POINTER,                            00001650
             2 FRA_FNR              PIC '(11)9',                        00001660
             2 TIL_FNR              PIC '(11)9';                        00001670
                                                                        00001680
    /* ************************************************************** */00001690
    /*   OPPTELINGS- OG LOOP-PARAMETRE M.M                            */00001700
    /* ************************************************************** */00001710
                                                                        00001720
       DCL 1  W01                       UNALIGNED,                      00001730
              2   MER_DATA                    BIT  (1)   INIT ('1'B),   00001740
              2   FEILMELDING_SATT            BIT  (1)   INIT ('0'B),   00001750
              2   AKSJON_IKKE_SATT            BIT  (1)   INIT ('0'B),   00001760
              2   AKSJONSKODE                 CHAR (2),                 00001770
              2   PERSON_IKKE_FUNNET          BIT  (1)   INIT ('1'B),   00001780
              2   NAVN                        CHAR (25)  INIT ((25)' '),00001790
              2   VIRK_DATO_ÅM                PIC '9999' INIT ( 0  ),   00001800
              2   I                    FIXED  BIN  (15)  INIT (1),      00001810
              2   J                    FIXED  BIN  (15)  INIT (1);      00001820
                                                                        00001830
    /* ************************************************************** */00001840
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00001850
    /* ************************************************************** */00001860
                                                                        00001870
       DCL 1  W01_DLI_PARAM,                                            00001880
              2   W02_GET                 CHAR (4)   INIT('    '),      00001890
              2   W02_GHU                 CHAR (4)   INIT('GHU '),      00001900
              2   W02_DLET                CHAR (4)   INIT('DLET'),      00001910
              2   W02_ISRT                CHAR (4)   INIT('ISRT'),      00001920
              2   W02_GU                  CHAR (4)   INIT ('GU  '),     00001930
              2   W02_GN                  CHAR (4)   INIT ('GN  '),     00001940
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),     00001950
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00001960
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00001970
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),          00001980
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');  00001990
                                                                        00002000
       DCL    W01_IO                CHAR (150)       INIT ( (150) ' ' );00002010
       DCL    CICSINFO              CHAR (16);                          00002020
                                                                        00002030
    /* ************************************************************** */00002040
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00002050
    /* ************************************************************** */00002060
                                                                        00002070
       DCL    SSA_UQUAL_ROT        STATIC CHAR ( 9) INIT('RF0PERSN ')  ;00002080
       DCL 1  SSA_UQUAL_PINNTEKT   STATIC CHAR ( 9) INIT('PINNTEKT ')  ;00002090
       DCL 1  SSA_UQUAL_PINNTEKT_L STATIC CHAR (11) INIT('PINNTEKT*L ');00002100
                                                                        00002110
       DCL 1  SSA1_RF0PERSN          UNALIGNED,                         00002120
              2    HDEL                       CHAR (17)  INIT           00002130
                   ('RF0PERSN(FNR     '),                               00002140
              2    REL_OP                     CHAR (2)   INIT (' ='),   00002150
              2    PKEY               FIXED   DEC  (11),                00002160
              2    HP                         CHAR (1)   INIT (')');    00002170
                                                                        00002180
       DCL 1  SSA1_PINNTEKT          UNALIGNED,                         00002190
              2    HDEL                       CHAR (17)  INIT           00002200
                   ('PINNTEKT(INNTÅRTY'),                               00002210
              2    REL_OP                     CHAR (2)   INIT (' ='),   00002220
              2    ÅR                 FIXED   DEC  (2),                 00002230
              2    TYPE                       CHAR (1),                 00002240
              2    HP                         CHAR (1)   INIT (')');    00002250
                                                                        00002260
                                                                        00002270
    /* ************************************************************** */00002280
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00002290
    /* ************************************************************** */00002300
                                                                        00002310
    %PAGE;                                                              00002320
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00002330
    %PAGE;                                                              00002340
                                                                        00002350
       DCL 1  B01              BASED (B01_PEKER),                       00002360
    %INCLUDE P0019921;                         /* B01_OMR (BASED)     */00002370
                                                                        00002380
                                                                        00002390
    %PAGE;                                                              00002400
       DCL 1  B02              BASED (B02_PEKER),                       00002410
    %INCLUDE P0019921;                         /* B02_OMR (BASED)     */00002420
                                                                        00002430
    %PAGE;                                                              00002440
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                   00002450
    %INCLUDE P0012003;                         /* PCB                 */00002460
                                                                        00002470
                                                                        00002480
    %PAGE;                                                              00002490
                                                                        00002500
    /* ************************************************************** */00002510
    /*                                                                */00002520
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00002530
    /*     ---------------------------------------------------        */00002540
    /*                                                                */00002550
    /*                                                                */00002560
    /*      INITIERING AV PARAMETRE TIL DIV OMR.     .                */00002570
    /*                                                                */00002580
    /*                                                                */00002590
    /* ************************************************************** */00002600
                                                                        00002610
                                                                        00002620
  COMMAREA_PEKER                        = HOVED_KOM_PTR;                00002630
                                                                        00002640
 %PAGE;                                                                 00002650
      ON ERROR SNAP BEGIN;                                              00002660
      ON ERROR SYSTEM;                                                  00002670
         ONKODE=ONCODE;                                                 00002680
         EXEC CICS ABEND ABCODE(ONK);                                   00002690
      END;                                                              00002700
                                                                        00002710
  EXEC CICS HANDLE CONDITION ERROR(ERRBEH);                             00002720
                                                                        00002730
  EXEC CICS HANDLE AID PF2(PF2);                                        00002740
                                                                        00002750
                                                                        00002760
  PROGRAM_ID            =  'R001I201'                   ;               00002770
  DB_STATUS_KODE        =  '  '                         ;               00002780
  FEIL_MELD_NR          =   0                           ;               00002790
  FNR_REG.BRUKERID      =   DIV_PARAM_OMR.CICS_IND      ;               00002800
  CICSINFO              =   F_CICSINFO (DIV_PARAM_OMR.CICS_IND);        00002810
                                                                        00002820
  LOW_VALUES        = (6)' '                       ;/* HEXA LOW-VALUES*/00002830
  LOW_VALUES_1500   = (1500)' '                    ;/* HEXA LOW-VALUES*/00002840
  %PAGE;                                                                00002850
                                                                        00002860
                                                                        00002870
  /**********    H O V E D S T Y R I N G   S T A R T   *************/   00002880
                                                                        00002890
  IF TRANSKODE = 'R0I2' !                                               00002900
     TRANSKODE = 'RI2A' THEN                                            00002910
     DO;                                                                00002920
                                                                        00002930
  /***  ÅPNER RF_BASEN                            *********/            00002940
                                                                        00002950
        IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                           00002960
            CALL DATABASE('OPEN');                                      00002970
                                                                        00002980
        ELSE                                                            00002990
            UIBPTR     = PCB_UIB_PEKER_OMR.UIB_PEKER;                   00003000
                                                                        00003010
                                                                        00003020
        IF FEIL_MELD_NR > 0   THEN                                      00003030
           DO;                                                          00003040
              TERMINERINGS_IND = FATAL_FEIL;                            00003050
              GO TO L999;                                               00003060
           END;                                                         00003070
     END;                                                               00003080
                                                                        00003090
                                                                        00003100
  IF FEIL_MELD_NR > 0 THEN                                              00003110
     CALL SKRIV_FEILMELDING;                                            00003120
  ELSE                                                                  00003130
     PROGRAM_ID = 'R001I201'     ;                                      00003140
                                                                        00003150
                                                                        00003160
  FEILMELDING_SATT       = '1'B    ;                                    00003170
  AKSJON_IKKE_SATT       = '1'B    ;                                    00003180
  W01.MER_DATA           = '1'B    ;                                    00003190
  ANTALL_FRA_LEST        = 0       ;                                    00003200
  ANTALL_TIL_LEST        = 0       ;                                    00003210
  ANTALL_LEST            = 0       ;                                    00003220
                                                                        00003230
                                                                        00003240
                                                                        00003250
  GAMMEL_AKSJONSKODE = 'DU';  /* GIS DUMMY-INIT-VERDI*/                 00003260
                                                                        00003270
  DO WHILE (GAMMEL_AKSJONSKODE ^= '  ');                                00003280
                                                                        00003290
     EXEC CICS ENTER TRACEID(01) FROM(GAMMEL_AKSJONSKODE);              00003300
     CALL BYGG_OVERFØRINGSBILDE;                                        00003310
                                                                        00003320
     EXEC CICS ENTER TRACEID(02) FROM(FEIL_MELD_NR);                    00003330
     IF FEIL_MELD_NR > 0 THEN                                           00003340
        DO;                                                             00003350
           TERMINERINGS_IND = FATAL_FEIL;                               00003360
           GO TO L999;                                                  00003370
        END;                                                            00003380
                                                                        00003390
     EXEC CICS ENTER TRACEID(03) FROM(GAMMEL_AKSJONSKODE);              00003400
                                                                        00003410
     IF GAMMEL_AKSJONSKODE = 'BE' THEN                                  00003420
        DO;                                                             00003430
           /*--------------------------------------------------------*/ 00003440
           /* SKRIVER UT OVERFØRINGSBILDET MED  DATA.                */ 00003450
           /*--------------------------------------------------------*/ 00003460
                                                                        00003470
           MAP_MELDING           = 'INNTEKT(ER) OVERFØRT.TRYKK ENTER.'; 00003480
           S001I02O.MELDING6O    = MAP_MELDING;                         00003490
           S001I02I.AKSJONL      = -1; /* CURSOR POS */                 00003500
           S001I02O.CICS_INFOO   = CICSINFO         ;                   00003510
                                                                        00003520
           EXEC CICS SEND MAP('S001I02')                                00003530
                               MAPSET('S001I23')  CURSOR ERASE;         00003540
           EXEC CICS RECEIVE MAP('S001I02')                             00003550
                               MAPSET('S001I23');                       00003560
           GAMMEL_AKSJONSKODE = '  ';                                   00003570
                                                                        00003580
           GO TO FERDIG;                                                00003590
        END;                                                            00003600
     ELSE                                                               00003610
        DO;                                                             00003620
           /*--------------------------------------------------------*/ 00003630
           /* SKRIVER UT OVERFØRINGSBILDET MED  DATA.                */ 00003640
           /*--------------------------------------------------------*/ 00003650
                                                                        00003660
           S001I02I.MRK1L        = -1; /* CURSOR POS */                 00003670
           S001I02O.CICS_INFOO   = CICSINFO         ;                   00003680
                                                                        00003690
           EXEC CICS SEND MAP('S001I02')                                00003700
                               MAPSET('S001I23')  CURSOR ERASE;         00003710
                                                                        00003720
        END;                                                            00003730
                                                                        00003740
     IF GAMMEL_AKSJONSKODE     = 'ME'                          THEN     00003750
        AKSJON_IKKE_SATT       = '1'B    ;                              00003760
                                                                        00003770
                                                                        00003780
     DO WHILE (AKSJON_IKKE_SATT);                                       00003790
        CALL   AKSJON_BEHANDLING;                                       00003800
     END;                                                               00003810
                                                                        00003820
                                                                        00003830
   FERDIG:                                                              00003840
  END;                                                                  00003850
                                                                        00003860
                                                                        00003870
  IF FEIL_MELD_NR > 0 THEN                                              00003880
     DO;                                                                00003890
        TERMINERINGS_IND = FATAL_FEIL;                                  00003900
        GO TO L999;                                                     00003910
     END;                                                               00003920
                                                                        00003930
                                                                        00003940
  /***** O M R E G N I N G   P.G.A. I N N T E K T S E N D R I N G **/   00003950
                                                                        00003960
                                                                        00003970
  FØDSNUMMER = FRA_FNR;                                                 00003980
  SEARCH_FNR = FRA_FNR;                                                 00003990
                                                                        00004000
  IF INNT_ALDER_FRA = '66' THEN                                         00004010
     ØNSKET_STATUS  = '6';                                              00004020
  ELSE                                                                  00004030
     IF INNT_ALDER_FRA = '69' THEN                                      00004040
     ØNSKET_STATUS  = '9';                                              00004050
                                                                        00004060
                                                                        00004070
  EXEC CICS LINK PROGRAM('R001I601') COMMAREA (KOM_OMR);                00004080
                                                                        00004090
  IF FEIL_MELD_NR > 0 THEN                                              00004100
     DO;                                                                00004110
        GOTO L999;                                                      00004120
     END;                                                               00004130
  ELSE                                                                  00004140
     PROGRAM_ID = 'R001I201';                                           00004150
                                                                        00004160
                                                                        00004170
                                                                        00004180
  FØDSNUMMER = TIL_FNR;                                                 00004190
  SEARCH_FNR = TIL_FNR;                                                 00004200
                                                                        00004210
                                                                        00004220
  IF INNT_ALDER_TIL = '66' THEN                                         00004230
     ØNSKET_STATUS  = '6';                                              00004240
  ELSE                                                                  00004250
     IF INNT_ALDER_TIL = '69' THEN                                      00004260
     ØNSKET_STATUS  = '9';                                              00004270
                                                                        00004280
                                                                        00004290
  EXEC CICS LINK PROGRAM('R001I601') COMMAREA (KOM_OMR);                00004300
                                                                        00004310
  IF FEIL_MELD_NR > 0 THEN                                              00004320
     DO;                                                                00004330
        GOTO L999;                                                      00004340
     END;                                                               00004350
  ELSE                                                                  00004360
     PROGRAM_ID = 'R001I201';                                           00004370
                                                                        00004380
 L999:                                                                  00004390
                                                                        00004400
  IF FEIL_MELD_NR > 0 THEN                                              00004410
     CALL SKRIV_FEILMELDING;                                            00004420
                                                                        00004430
  ALLOCATE S001I01O;                                                    00004440
  ALLOCATE S001I01I;                                                    00004450
                                                                        00004460
  EXEC CICS LOAD PROGRAM('S001I13');                                    00004470
                                                                        00004480
  S001I01I.STYREKODEL   = -1;                                           00004490
  S001I01O.CICS_INFOO   = CICSINFO;                                     00004500
                                                                        00004510
  EXEC CICS SEND MAP('S001I01')                                         00004520
                                MAPSET('S001I13') CURSOR ERASE;         00004530
  CALL DATABASE('CLOSE');                                               00004540
                                                                        00004550
  IF FEIL_MELD_NR > 0   THEN                                            00004560
     DO;                                                                00004570
        TERMINERINGS_IND = FATAL_FEIL;                                  00004580
        GO TO L999;                                                     00004590
     END;                                                               00004600
                                                                        00004610
  EXEC CICS RETURN;                                                     00004620
                                                                        00004630
                                                                        00004640
                                                                        00004650
  /**********    H O V E D S T Y R I N G   S L U T T   *************/   00004660
                                                                        00004670
                                                                        00004680
                                                                        00004690
                                                                        00004700
 BYGG_OVERFØRINGSBILDE:                                                 00004710
   PROC;                                                                00004720
                                                                        00004730
    ALLOCATE S001I02O;                                                  00004740
    ALLOCATE S001I02I;                                                  00004750
                                                                        00004760
    EXEC CICS LOAD PROGRAM('S001I23');                                  00004770
                                                                        00004780
    S001I02O.FRAFNRO         = FRA_FNR;                                 00004790
    S001I02O.TILFNRO         = TIL_FNR;                                 00004800
    S001I02O.CICS_INFOO      = CICSINFO;                                00004810
                                                                        00004820
                                                                        00004830
    EXEC CICS ENTER TRACEID(10) FROM(GAMMEL_AKSJONSKODE);               00004840
    SSA1_RF0PERSN.PKEY       = FRA_FNR;                                 00004850
                                                                        00004860
    IF ANTALL_FRA_LEST  < 25 THEN                                       00004870
        DO;                                                             00004880
          CALL P005_LES_ROT_QUAL_FNR;                                   00004890
    EXEC CICS ENTER TRACEID(11) FROM(FEIL_MELD_NR);                     00004900
                                                                        00004910
          IF W01.MER_DATA THEN                                          00004920
             ANTALL_FRA_LEST  = 1;                                      00004930
          ELSE                                                          00004940
             DO;                                                        00004950
             /* ******************************************** */         00004960
             /* FRA-FNR IKKE I DATABASE--> FEILMELDING.     */          00004970
             /* ******************************************** */         00004980
                                                                        00004990
                MAP_MELDING =                                           00005000
                        'PERSONEN MED FRA-FNR : ' !! FRA_FNR !!         00005010
                                  ' ER IKKE I DATABASEN.' ;             00005020
                ALLOCATE S001I01O;                                      00005030
                ALLOCATE S001I01I;                                      00005040
                                                                        00005050
                EXEC CICS LOAD PROGRAM('S001I13');                      00005060
                                                                        00005070
                S001I01O.FRAFNRA      = 'I';                            00005080
                S001I01O.FRAFNRO      = FRA_FNR;                        00005090
                S001I01I.FRAFNRL      = -1; /* CURSOR POS       */      00005100
                S001I01O.TILFNRA      = 'I';                            00005110
                S001I01O.TILFNRO      = TIL_FNR;                        00005120
                S001I01O.STYREKODEO   = STYREKODE;                      00005130
                S001I01O.CICS_INFOO   = CICSINFO;                       00005140
                S001I01O.MELDINGO     = MAP_MELDING;                    00005150
                                                                        00005160
                EXEC CICS SEND MAP('S001I01')                           00005170
                                      MAPSET('S001I13') CURSOR ERASE;   00005180
                                                                        00005190
                TRANSKODE = 'R0I1';                                     00005200
                                                                        00005210
                CALL DATABASE('CLOSE');                                 00005220
                                                                        00005230
                IF FEIL_MELD_NR > 0   THEN                              00005240
                   DO;                                                  00005250
                      TERMINERINGS_IND = FATAL_FEIL;                    00005260
                      GO TO L999;                                       00005270
                   END;                                                 00005280
                                                                        00005290
                EXEC CICS RETURN;                                       00005300
             END;                                                       00005310
       END;                                                             00005320
    ELSE                                                                00005330
       DO;                                                              00005340
    EXEC CICS ENTER TRACEID(12) FROM(FEIL_MELD_NR);                     00005350
          ANTALL_FRA_LEST  = 1;                                         00005360
                                                                        00005370
          SSA1_RF0PERSN.PKEY       = FRA_FNR;                           00005380
                                                                        00005390
          CALL P005_LES_ROT_QUAL_FNR;                                   00005400
                                                                        00005410
          SSA1_PINNTEKT.ÅR           =     HUSK_PI_ÅR_FRA     ;         00005420
          SSA1_PINNTEKT.TYPE         =     HUSK_PI_TYPE_FRA   ;         00005430
                                                                        00005440
          CALL P010_LES_INNT_QUAL;                                      00005450
                                                                        00005460
          CALL FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR;                          00005470
                                                                        00005480
          ANTALL_FRA_LEST  = ANTALL_FRA_LEST + 1;                       00005490
       END;                                                             00005500
                                                                        00005510
    EXEC CICS ENTER TRACEID(30) FROM(FEIL_MELD_NR);                     00005520
                                                                        00005530
    DO WHILE(W01.MER_DATA &                                             00005540
                           ANTALL_FRA_LEST < 25);                       00005550
                                                                        00005560
    EXEC CICS ENTER TRACEID(31) FROM(FEIL_MELD_NR);                     00005570
                                                                        00005580
       /*******    LES NESTE PINNTEKT     *********/                    00005590
                                                                        00005600
       CALL P020_LES_NESTE_PINNTEKT_FNR;                                00005610
    EXEC CICS ENTER TRACEID(13) FROM(FEIL_MELD_NR);                     00005620
                                                                        00005630
       IF W01.MER_DATA     THEN                                         00005640
          DO;                                                           00005650
                                                                        00005660
             CALL FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR;                       00005670
                                                                        00005680
                                                                        00005690
             ANTALL_FRA_LEST = ANTALL_FRA_LEST + 1;                     00005700
          END;                                                          00005710
    END;                                                                00005720
                                                                        00005730
    EXEC CICS ENTER TRACEID(14) FROM(FEIL_MELD_NR);                     00005740
    ANTALL_LEST = ANTALL_FRA_LEST - 1;                                  00005750
                                                                        00005760
    IF ANTALL_FRA_LEST > 24 THEN                                        00005770
       DO;                                                              00005780
    EXEC CICS ENTER TRACEID(15) FROM(FEIL_MELD_NR);                     00005790
          CALL SJEKK_OM_FLERE_INNTEKTER_FRAFNR;                         00005800
       END;                                                             00005810
    ELSE                                                                00005820
       CALL SJEKK_OM_INGEN_INNTEKTER;                                   00005830
                                                                        00005840
    EXEC CICS ENTER TRACEID(16) FROM(FEIL_MELD_NR);                     00005850
                                                                        00005860
                                                                        00005870
    /***  B E H A N D L I N G  A V  T I L - F N R ***/                  00005880
                                                                        00005890
    EXEC CICS ENTER TRACEID(20) FROM(GAMMEL_AKSJONSKODE);               00005900
                                                                        00005910
                                                                        00005920
    SSA1_RF0PERSN.PKEY       = TIL_FNR;                                 00005930
                                                                        00005940
    IF ANTALL_TIL_LEST  < 25 THEN                                       00005950
       DO;                                                              00005960
          CALL P005_LES_ROT_QUAL_FNR;                                   00005970
    EXEC CICS ENTER TRACEID(21) FROM(MER_DATA);                         00005980
                                                                        00005990
          IF W01.MER_DATA THEN                                          00006000
             ANTALL_TIL_LEST  = 1;                                      00006010
          ELSE                                                          00006020
             DO;                                                        00006030
                /* ******************************************** */      00006040
                /* TIL-FNR IKKE I DATABASE--> PERSON OPPRETTES  */      00006050
                /* ******************************************** */      00006060
                                                                        00006070
                ANTALL_TIL_LEST  = 1;                                   00006080
                                                                        00006090
                CALL P030_OPPRETT_ROT;                                  00006100
                CALL P005_LES_ROT_QUAL_FNR;                             00006110
    EXEC CICS ENTER TRACEID(22) FROM(FEIL_MELD_NR);                     00006120
             END;                                                       00006130
       END;                                                             00006140
    ELSE                                                                00006150
       DO;                                                              00006160
          ANTALL_TIL_LEST            =     1;                           00006170
                                                                        00006180
          SSA1_RF0PERSN.PKEY         =     TIL_FNR;                     00006190
                                                                        00006200
          CALL P005_LES_ROT_QUAL_FNR;                                   00006210
                                                                        00006220
          SSA1_PINNTEKT.ÅR           =     HUSK_PI_ÅR_TIL     ;         00006230
          SSA1_PINNTEKT.TYPE         =     HUSK_PI_TYPE_TIL   ;         00006240
                                                                        00006250
          CALL P010_LES_INNT_QUAL;                                      00006260
                                                                        00006270
          CALL FLYTT_DBOPPL_TIL_BL_OMR_TILFNR;                          00006280
                                                                        00006290
          ANTALL_TIL_LEST  = ANTALL_TIL_LEST + 1;                       00006300
       END;                                                             00006310
                                                                        00006320
    EXEC CICS ENTER TRACEID(23) FROM(FEIL_MELD_NR);                     00006330
                                                                        00006340
    DO WHILE(W01.MER_DATA &                                             00006350
                           ANTALL_TIL_LEST < 25 );                      00006360
                                                                        00006370
                                                                        00006380
       /*******    LES NESTE PINNTEKT     *********/                    00006390
                                                                        00006400
       CALL P020_LES_NESTE_PINNTEKT_FNR;                                00006410
    EXEC CICS ENTER TRACEID(24) FROM(FEIL_MELD_NR);                     00006420
                                                                        00006430
       IF W01.MER_DATA     THEN                                         00006440
          DO;                                                           00006450
                                                                        00006460
    EXEC CICS ENTER TRACEID(25) FROM(FEIL_MELD_NR);                     00006470
             CALL FLYTT_DBOPPL_TIL_BL_OMR_TILFNR;                       00006480
                                                                        00006490
                                                                        00006500
             ANTALL_TIL_LEST = ANTALL_TIL_LEST + 1;                     00006510
          END;                                                          00006520
    EXEC CICS ENTER TRACEID(26) FROM(FEIL_MELD_NR);                     00006530
    END;                                                                00006540
                                                                        00006550
    IF    ANTALL_TIL_LEST > 24 &                                        00006560
                                W01.MER_DATA   THEN                     00006570
          CALL SJEKK_OM_FLERE_INNTEKTER_TILFNR;                         00006580
    EXEC CICS ENTER TRACEID(27) FROM(W01.MER_DATA);                     00006590
                                                                        00006600
  END BYGG_OVERFØRINGSBILDE;                                            00006610
                                                                        00006620
                                                                        00006630
                                                                        00006640
 SJEKK_OM_FLERE_INNTEKTER_FRAFNR:                                       00006650
   PROC;                                                                00006660
                                                                        00006670
     /*******    LES RF_BASE   *********/                               00006680
                                                                        00006690
  CALL P020_LES_NESTE_PINNTEKT_FNR;                                     00006700
                                                                        00006710
  IF W01.MER_DATA     THEN                                              00006720
     DO;                                                                00006730
        MAP_MELDING =                                                   00006740
                     'FLERE EN 24 INNTEKTER REGISTERT PÅ FRA-FNR. ' !!  00006750
                               'AKSJON = ME ==> NESTE SIDE. ';          00006760
                                                                        00006770
        S001I02O.MELDING6O = MAP_MELDING;                               00006780
                                                                        00006790
        HUSK_PI_ÅR_FRA   = W02_PI_ÅR;                                   00006800
        HUSK_PI_TYPE_FRA = W02_PI_TYPE;                                 00006810
                                                                        00006820
     END;                                                               00006830
  ELSE                                                                  00006840
     ANTALL_FRA_LEST = 24;                                              00006850
                                                                        00006860
  END SJEKK_OM_FLERE_INNTEKTER_FRAFNR;                                  00006870
                                                                        00006880
                                                                        00006890
                                                                        00006900
                                                                        00006910
                                                                        00006920
                                                                        00006930
 SJEKK_OM_FLERE_INNTEKTER_TILFNR:                                       00006940
   PROC;                                                                00006950
                                                                        00006960
     /*******    LES RF_BASE   *********/                               00006970
                                                                        00006980
  CALL P020_LES_NESTE_PINNTEKT_FNR;                                     00006990
                                                                        00007000
  IF W01.MER_DATA     THEN                                              00007010
     DO;                                                                00007020
                                                                        00007030
        MAP_MELDING =                                                   00007040
                     'FLERE EN 24 INNTEKTER REGISTERT PÅ TIL-FNR. ' !!  00007050
                               'AKSJON = ME ==> NESTE SIDE. ';          00007060
                                                                        00007070
        S001I02O.MELDING6O = MAP_MELDING;                               00007080
                                                                        00007090
        HUSK_PI_ÅR_TIL   = W02_PI_ÅR;                                   00007100
        HUSK_PI_TYPE_TIL = W02_PI_TYPE;                                 00007110
                                                                        00007120
                                                                        00007130
     END;                                                               00007140
  ELSE                                                                  00007150
     ANTALL_TIL_LEST = 24;                                              00007160
                                                                        00007170
  END SJEKK_OM_FLERE_INNTEKTER_TILFNR;                                  00007180
                                                                        00007190
                                                                        00007200
                                                                        00007210
                                                                        00007220
 SJEKK_OM_INGEN_INNTEKTER:                                              00007230
   PROC;                                                                00007240
                                                                        00007250
                                                                        00007260
    IF    ^W01.MER_DATA & FEIL_MELD_NR = 0 &                            00007270
                          ANTALL_FRA_LEST = 1 THEN                      00007280
          DO;                                                           00007290
             FEILMELDING_SATT   = '1'B;                                 00007300
             MAP_MELDING =                                              00007310
                        'PERSONEN MED FRA-FNR : ' !! FRA_FNR !!         00007320
                                  ' HAR IKKE REGISTERTE INNTEKTER.' ;   00007330
             ALLOCATE S001I01O;                                         00007340
             ALLOCATE S001I01I;                                         00007350
                                                                        00007360
             EXEC CICS LOAD PROGRAM('S001I13');                         00007370
                                                                        00007380
             S001I01I.FRAFNRL      = -1; /* CURSOR POS       */         00007390
             S001I01O.FRAFNRA      = 'I';                               00007400
             S001I01O.FRAFNRO      = FRA_FNR;                           00007410
             S001I01O.STYREKODEO   = STYREKODE;                         00007420
             S001I01O.CICS_INFOO   = CICSINFO   ;                       00007430
             S001I01O.MELDINGO     = MAP_MELDING;                       00007440
                                                                        00007450
             EXEC CICS SEND MAP('S001I01')                              00007460
                                      MAPSET('S001I13') CURSOR ERASE;   00007470
                                                                        00007480
             TRANSKODE = 'R0I1';                                        00007490
                                                                        00007500
             CALL DATABASE('CLOSE');                                    00007510
                                                                        00007520
             IF FEIL_MELD_NR > 0   THEN                                 00007530
                DO;                                                     00007540
                   TERMINERINGS_IND = FATAL_FEIL;                       00007550
                   GO TO L999;                                          00007560
                END;                                                    00007570
                                                                        00007580
             EXEC CICS RETURN;                                          00007590
          END;                                                          00007600
                                                                        00007610
                                                                        00007620
  END SJEKK_OM_INGEN_INNTEKTER;                                         00007630
                                                                        00007640
                                                                        00007650
                                                                        00007660
  AKSJON_BEHANDLING:                                                    00007670
     PROC;                                                              00007680
                                                                        00007690
  /* **************************************************************** */00007700
  /*HENSIKT:                                                          */00007710
  /*    UTFØRER ØNSKET AKSJON.                                          00007720
  /*                                                                  */00007730
  /*                                                                  */00007740
  /*BRUK:                                                             */00007750
  /*    CALL AKSJON_BEHANDLING;                                         00007760
  /*                                                                  */00007770
  /* **************************************************************** */00007780
                                                                        00007790
   DCL W_TKNR               FIXED DEC ( 4)   INIT ( 0 ),                00007800
       W_FNR                FIXED DEC (11)   INIT ( 0 );                00007810
                                                                        00007820
                                                                        00007830
   FEILMELDING_SATT       = '1'B;                                       00007840
   AKSJON_IKKE_SATT       = '1'B;                                       00007850
                                                                        00007860
   DO UNTIL (^FEILMELDING_SATT);                                        00007870
                                                                        00007880
      FEILMELDING_SATT = '0'B;                                          00007890
                                                                        00007900
      /***  LESER INN DATA FRA OVERFØRINGSBILDET.  */                   00007910
                                                                        00007920
                                                                        00007930
      EXEC CICS RECEIVE MAP('S001I02')                                  00007940
                               MAPSET('S001I23')SET (BMSMAPBR);         00007950
                                                                        00007960
                                                                        00007970
      IF S001I02I.FUNKSJONSKODEL > 0 THEN                               00007980
         DO;                                                            00007990
            FUNKSJONSKODE = S001I02I.FUNKSJONSKODEI;                    00008000
            IF FUNKSJONSKODE = 'I' THEN                                 00008010
               GO TO L999;                                              00008020
            ELSE                                                        00008030
               DO;                                                      00008040
                  CALL DATABASE('CLOSE');                               00008050
                                                                        00008060
                  EXEC CICS RETURN;                                     00008070
                                                                        00008080
               END;                                                     00008090
         END;                                                           00008100
                                                                        00008110
      /*------------------------------------------------------------*/  00008120
      /* SJEKKER OM AKSJONØNSKET ER GYLDIG                          */  00008130
      /*------------------------------------------------------------*/  00008140
                                                                        00008150
      S001I02O.CICS_INFOO = CICSINFO              ;                     00008160
                                                                        00008170
      IF S001I02I.AKSJONL > 0 THEN                                      00008180
         DO;                                                            00008190
            AKSJONSKODE = S001I02I.AKSJONI;                             00008200
            SELECT(AKSJONSKODE);                                        00008210
                                                                        00008220
               WHEN('OA')                                               00008230
                  DO;                                                   00008240
                     DO I = 1 TO ANTALL_LEST;                           00008250
                                                                        00008260
                        CALL MARKER_LINJE;                              00008270
                                                                        00008280
                     END;                                               00008290
                                                                        00008300
                     IF GAMMEL_AKSJONSKODE = 'DU' THEN /*DUMMY-INIT-*/  00008310
                        CALL BLANK_TIL_OPPL;           /*VERDI      */  00008320
                                                                        00008330
                     CALL BEHANDLE_MARKERTE_LINJER;                     00008340
                                                                        00008350
                     GAMMEL_AKSJONSKODE = AKSJONSKODE;                  00008360
                                                                        00008370
                     S001I02I.AKSJONL    = -1; /* CURSOR POS */         00008380
                                                                        00008390
                     EXEC CICS SEND MAP('S001I02')                      00008400
                               MAPSET('S001I23')  CURSOR ERASE;         00008410
                                                                        00008420
                  END;                                                  00008430
               WHEN('OM')                                               00008440
                  DO;                                                   00008450
                                                                        00008460
                     IF GAMMEL_AKSJONSKODE = 'DU' THEN /*DUMMY-INIT-*/  00008470
                        CALL BLANK_TIL_OPPL;           /*VERDI      */  00008480
                                                                        00008490
                     CALL BEHANDLE_MARKERTE_LINJER;                     00008500
                                                                        00008510
                     GAMMEL_AKSJONSKODE = AKSJONSKODE;                  00008520
                                                                        00008530
                                                                        00008540
                     S001I02I.AKSJONL    = -1; /* CURSOR POS */         00008550
                                                                        00008560
                     EXEC CICS SEND MAP('S001I02')                      00008570
                               MAPSET('S001I23')  CURSOR ERASE;         00008580
                                                                        00008590
                  END;                                                  00008600
                                                                        00008610
               WHEN('BE')                                               00008620
                  DO;                                                   00008630
                     IF GAMMEL_AKSJONSKODE = 'OA' !                     00008640
                        GAMMEL_AKSJONSKODE = 'ME' !                     00008650
                        GAMMEL_AKSJONSKODE = 'OM' THEN                  00008660
                        DO;                                             00008670
                           SSA1_RF0PERSN.PKEY = TIL_FNR;                00008680
                                                                        00008690
                           CALL OVERFØR_INNTEKTER(                      00008700
                                   W01_PINT,INNT_ALDER_FRA,             00008710
                                   INNT_ALDER_TIL,FRA_FNR,TIL_FNR);     00008720
                           IF FEIL_MELD_NR > 0 THEN                     00008730
                              DO;                                       00008740
                                 TERMINERINGS_IND = FATAL_FEIL         ;00008750
                                 AKSJON_IKKE_SATT = '0'B               ;00008760
                                 GO TO RETUR;                           00008770
                              END;                                      00008780
                                                                        00008790
                            /*----------------------------------------*/00008800
                            /* DATA TIL NORTRYGD   :   TIL - FNR      */00008810
                            /*----------------------------------------*/00008820
                                                                        00008830
                            W_FNR  = TIL_FNR                           ;00008840
                            W_TKNR = F100_FINN_TKNR (TIL_FNR)          ;00008850
                                                                        00008860
                            IF FEIL_MELD_NR  >    0                 THEN00008870
                               DO;                                      00008880
                                  FATAL_FEIL    =   '1'B               ;00008890
                                  GO TO RETUR;                          00008900
                               END;                                     00008910
                                                                        00008920
                            CALL P900_NOR_DATA (W_FNR , W_TKNR)        ;00008930
                                                                        00008940
                            IF FEIL_MELD_NR  >    0                 THEN00008950
                               DO;                                      00008960
                                  FATAL_FEIL    =   '1'B               ;00008970
                                  GO TO RETUR;                          00008980
                               END;                                     00008990
                            ELSE                                        00009000
                               PROGRAM_ID    =   'R001I201'            ;00009010
                                                                        00009020
                            /*----------------------------------------*/00009030
                            /* DATA TIL NORTRYGD   :   FRA - FNR      */00009040
                            /* SJEKKER OM ROT-SEGM HAR TKNR .         */00009050
                            /*----------------------------------------*/00009060
                                                                        00009070
                            W_FNR              =   FRA_FNR             ;00009080
                            SSA1_RF0PERSN.PKEY =   FRA_FNR             ;00009090
                            CALL P005_LES_ROT_QUAL_FNR;                 00009100
                                                                        00009110
                            IF RF0PERSN.TKNR   >   0                THEN00009120
                               W_TKNR          =   RF0PERSN.TKNR       ;00009130
                                                                        00009140
                            CALL P900_NOR_DATA (W_FNR , W_TKNR)        ;00009150
                                                                        00009160
                            IF FEIL_MELD_NR  >    0                 THEN00009170
                               DO;                                      00009180
                                  FATAL_FEIL    =   '1'B               ;00009190
                                  GO TO RETUR;                          00009200
                               END;                                     00009210
                            ELSE                                        00009220
                               PROGRAM_ID    =   'R001I201'            ;00009230
                                                                        00009240
                                                                        00009250
                           GAMMEL_AKSJONSKODE = 'BE';                   00009260
                           AKSJON_IKKE_SATT   = '0'B;                   00009270
                        END;                                            00009280
                      ELSE                                              00009290
                        DO;                                             00009300
                           MAP_MELDING       = 'OA/OM MÅ OPPGIS FØRST.';00009310
                           FEILMELDING_SATT  = '1'B;                    00009320
                           S001I02I.AKSJONL  =                          00009330
                                                -1; /* CURSOR POS */    00009340
                           S001I02O.MELDING6O = MAP_MELDING;            00009350
                                                                        00009360
                            EXEC CICS SEND MAP('S001I02')               00009370
                                  MAPSET('S001I23') CURSOR ERASE;       00009380
                        END;                                            00009390
                  END;                                                  00009400
               WHEN('SI')                                               00009410
                  DO;                                                   00009420
                     TRANSKODE = 'RI2A';                                00009430
                     EXEC CICS XCTL PROGRAM('R001I201')                 00009440
                                         COMMAREA(INTERN_KOM_OMR);      00009450
                  END;                                                  00009460
               WHEN('ME')                                               00009470
                  DO;                                                   00009480
                     AKSJON_IKKE_SATT       = '0'B;                     00009490
                     GAMMEL_AKSJONSKODE = AKSJONSKODE;                  00009500
                  END;                                                  00009510
               OTHERWISE                                                00009520
                  DO;                                                   00009530
                     MAP_MELDING        = 'UGYLDIG AKSJONSKODE';        00009540
                     FEILMELDING_SATT   = '1'B;                         00009550
                     S001I02I.AKSJONL  =                                00009560
                                          -1; /* CURSOR POS */          00009570
                     S001I02O.MELDING6O = MAP_MELDING;                  00009580
                                                                        00009590
                     EXEC CICS SEND MAP('S001I02')                      00009600
                                  MAPSET('S001I23') CURSOR ERASE;       00009610
                  END;                                                  00009620
            END;                                                        00009630
         END;                                                           00009640
      ELSE                                                              00009650
         DO;                                                            00009660
            MAP_MELDING        = 'AKSJONSKODE MÅ OPPGIS.';              00009670
            FEILMELDING_SATT   = '1'B;                                  00009680
            S001I02I.AKSJONL   =                                        00009690
                                 -1; /* CURSOR POS */                   00009700
            S001I02O.MELDING6O = MAP_MELDING;                           00009710
                                                                        00009720
            EXEC CICS SEND MAP('S001I02')                               00009730
                                       MAPSET('S001I23') CURSOR ERASE;  00009740
         END;                                                           00009750
  END;                                                                  00009760
                                                                        00009770
  RETUR:                                                                00009780
                                                                        00009790
  END AKSJON_BEHANDLING;                                                00009800
                                                                        00009810
                                                                        00009820
  FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR:                                       00009830
     PROC;                                                              00009840
                                                                        00009850
     S001I02O.CICS_INFOO = CICSINFO               ;                     00009860
                                                                        00009870
     SELECT(ANTALL_FRA_LEST);                                           00009880
        WHEN(1)                                                         00009890
            DO;                                                         00009900
               S001I02O.FRAÅR1O    = W02_PI_ÅR;                         00009910
               S001I02O.FRATYPE1O  = W02_PI_TYPE;                       00009920
               S001I02O.FRABELØP1O = W02_PI * 100;                      00009930
               W02.TAB_PI_ÅR(1)       = W02_PI_ÅR;                      00009940
               W02.TAB_PI_KODE(1)     = W02_PI_KODE;                    00009950
               W02.TAB_PI(1)          = W02_PI;                         00009960
               W02.TAB_PI_KOMMNR(1)   = W02_PI_KOMMNR;                  00009970
               W02.TAB_PI_RAPPDATO(1) = W02_PI_RAPPDATO;                00009980
            END;                                                        00009990
        WHEN(2)                                                         00010000
            DO;                                                         00010010
               S001I02O.FRAÅR2O    = W02_PI_ÅR;                         00010020
               S001I02O.FRATYPE2O  = W02_PI_TYPE;                       00010030
               S001I02O.FRABELØP2O = W02_PI * 100;                      00010040
               W02.TAB_PI_ÅR(2)       = W02_PI_ÅR;                      00010050
               W02.TAB_PI_KODE(2)     = W02_PI_KODE;                    00010060
               W02.TAB_PI(2)          = W02_PI;                         00010070
               W02.TAB_PI_KOMMNR(2)   = W02_PI_KOMMNR;                  00010080
               W02.TAB_PI_RAPPDATO(2) = W02_PI_RAPPDATO;                00010090
            END;                                                        00010100
        WHEN(3)                                                         00010110
            DO;                                                         00010120
               S001I02O.FRAÅR3O    = W02_PI_ÅR;                         00010130
               S001I02O.FRATYPE3O  = W02_PI_TYPE;                       00010140
               S001I02O.FRABELØP3O = W02_PI * 100;                      00010150
               W02.TAB_PI_ÅR(3)       = W02_PI_ÅR;                      00010160
               W02.TAB_PI_KODE(3)     = W02_PI_KODE;                    00010170
               W02.TAB_PI(3)          = W02_PI;                         00010180
               W02.TAB_PI_KOMMNR(3)   = W02_PI_KOMMNR;                  00010190
               W02.TAB_PI_RAPPDATO(3) = W02_PI_RAPPDATO;                00010200
            END;                                                        00010210
        WHEN(4)                                                         00010220
            DO;                                                         00010230
               S001I02O.FRAÅR4O    = W02_PI_ÅR;                         00010240
               S001I02O.FRATYPE4O  = W02_PI_TYPE;                       00010250
               S001I02O.FRABELØP4O = W02_PI * 100;                      00010260
               W02.TAB_PI_ÅR(4)       = W02_PI_ÅR;                      00010270
               W02.TAB_PI_KODE(4)     = W02_PI_KODE;                    00010280
               W02.TAB_PI(4)          = W02_PI;                         00010290
               W02.TAB_PI_KOMMNR(4)   = W02_PI_KOMMNR;                  00010300
               W02.TAB_PI_RAPPDATO(4) = W02_PI_RAPPDATO;                00010310
            END;                                                        00010320
        WHEN(5)                                                         00010330
            DO;                                                         00010340
               S001I02O.FRAÅR5O    = W02_PI_ÅR;                         00010350
               S001I02O.FRATYPE5O  = W02_PI_TYPE;                       00010360
               S001I02O.FRABELØP5O = W02_PI * 100;                      00010370
               W02.TAB_PI_ÅR(5)       = W02_PI_ÅR;                      00010380
               W02.TAB_PI_KODE(5)     = W02_PI_KODE;                    00010390
               W02.TAB_PI(5)          = W02_PI;                         00010400
               W02.TAB_PI_KOMMNR(5)   = W02_PI_KOMMNR;                  00010410
               W02.TAB_PI_RAPPDATO(5) = W02_PI_RAPPDATO;                00010420
            END;                                                        00010430
        WHEN(6)                                                         00010440
            DO;                                                         00010450
               S001I02O.FRAÅR6O    = W02_PI_ÅR;                         00010460
               S001I02O.FRATYPE6O  = W02_PI_TYPE;                       00010470
               S001I02O.FRABELØP6O = W02_PI * 100;                      00010480
               W02.TAB_PI_ÅR(6)       = W02_PI_ÅR;                      00010490
               W02.TAB_PI_KODE(6)     = W02_PI_KODE;                    00010500
               W02.TAB_PI(6)          = W02_PI;                         00010510
               W02.TAB_PI_KOMMNR(6)   = W02_PI_KOMMNR;                  00010520
               W02.TAB_PI_RAPPDATO(6) = W02_PI_RAPPDATO;                00010530
            END;                                                        00010540
        WHEN(7)                                                         00010550
            DO;                                                         00010560
               S001I02O.FRAÅR7O    = W02_PI_ÅR;                         00010570
               S001I02O.FRATYPE7O  = W02_PI_TYPE;                       00010580
               S001I02O.FRABELØP7O = W02_PI * 100;                      00010590
               W02.TAB_PI_ÅR(7)       = W02_PI_ÅR;                      00010600
               W02.TAB_PI_KODE(7)     = W02_PI_KODE;                    00010610
               W02.TAB_PI(7)          = W02_PI;                         00010620
               W02.TAB_PI_KOMMNR(7)   = W02_PI_KOMMNR;                  00010630
               W02.TAB_PI_RAPPDATO(7) = W02_PI_RAPPDATO;                00010640
            END;                                                        00010650
        WHEN(8)                                                         00010660
            DO;                                                         00010670
               S001I02O.FRAÅR8O    = W02_PI_ÅR;                         00010680
               S001I02O.FRATYPE8O  = W02_PI_TYPE;                       00010690
               S001I02O.FRABELØP8O = W02_PI * 100;                      00010700
               W02.TAB_PI_ÅR(8)       = W02_PI_ÅR;                      00010710
               W02.TAB_PI_KODE(8)     = W02_PI_KODE;                    00010720
               W02.TAB_PI(8)          = W02_PI;                         00010730
               W02.TAB_PI_KOMMNR(8)   = W02_PI_KOMMNR;                  00010740
               W02.TAB_PI_RAPPDATO(8) = W02_PI_RAPPDATO;                00010750
            END;                                                        00010760
        WHEN(9)                                                         00010770
            DO;                                                         00010780
               S001I02O.FRAÅR9O    = W02_PI_ÅR;                         00010790
               S001I02O.FRATYPE9O  = W02_PI_TYPE;                       00010800
               S001I02O.FRABELØP9O = W02_PI * 100;                      00010810
               W02.TAB_PI_ÅR(9)       = W02_PI_ÅR;                      00010820
               W02.TAB_PI_KODE(9)     = W02_PI_KODE;                    00010830
               W02.TAB_PI(9)          = W02_PI;                         00010840
               W02.TAB_PI_KOMMNR(9)   = W02_PI_KOMMNR;                  00010850
               W02.TAB_PI_RAPPDATO(9) = W02_PI_RAPPDATO;                00010860
            END;                                                        00010870
        WHEN(10)                                                        00010880
            DO;                                                         00010890
               S001I02O.FRAÅR10O    = W02_PI_ÅR;                        00010900
               S001I02O.FRATYPE10O  = W02_PI_TYPE;                      00010910
               S001I02O.FRABELØP10O = W02_PI * 100;                     00010920
               W02.TAB_PI_ÅR(10)       = W02_PI_ÅR;                     00010930
               W02.TAB_PI_KODE(10)     = W02_PI_KODE;                   00010940
               W02.TAB_PI(10)          = W02_PI;                        00010950
               W02.TAB_PI_KOMMNR(10)   = W02_PI_KOMMNR;                 00010960
               W02.TAB_PI_RAPPDATO(10) = W02_PI_RAPPDATO;               00010970
            END;                                                        00010980
        WHEN(11)                                                        00010990
            DO;                                                         00011000
               S001I02O.FRAÅR11O    = W02_PI_ÅR;                        00011010
               S001I02O.FRATYPE11O  = W02_PI_TYPE;                      00011020
               S001I02O.FRABELØP11O = W02_PI * 100;                     00011030
               W02.TAB_PI_ÅR(11)       = W02_PI_ÅR;                     00011040
               W02.TAB_PI_KODE(11)     = W02_PI_KODE;                   00011050
               W02.TAB_PI(11)          = W02_PI;                        00011060
               W02.TAB_PI_KOMMNR(11)   = W02_PI_KOMMNR;                 00011070
               W02.TAB_PI_RAPPDATO(11) = W02_PI_RAPPDATO;               00011080
            END;                                                        00011090
        WHEN(12)                                                        00011100
            DO;                                                         00011110
               S001I02O.FRAÅR12O    = W02_PI_ÅR;                        00011120
               S001I02O.FRATYPE12O  = W02_PI_TYPE;                      00011130
               S001I02O.FRABELØP12O = W02_PI * 100;                     00011140
               W02.TAB_PI_ÅR(12)       = W02_PI_ÅR;                     00011150
               W02.TAB_PI_KODE(12)     = W02_PI_KODE;                   00011160
               W02.TAB_PI(12)          = W02_PI;                        00011170
               W02.TAB_PI_KOMMNR(12)   = W02_PI_KOMMNR;                 00011180
               W02.TAB_PI_RAPPDATO(12) = W02_PI_RAPPDATO;               00011190
            END;                                                        00011200
        WHEN(13)                                                        00011210
            DO;                                                         00011220
               S001I02O.FRAÅR13O    = W02_PI_ÅR;                        00011230
               S001I02O.FRATYPE13O  = W02_PI_TYPE;                      00011240
               S001I02O.FRABELØP13O = W02_PI * 100;                     00011250
               W02.TAB_PI_ÅR(13)       = W02_PI_ÅR;                     00011260
               W02.TAB_PI_KODE(13)     = W02_PI_KODE;                   00011270
               W02.TAB_PI(13)          = W02_PI;                        00011280
               W02.TAB_PI_KOMMNR(13)   = W02_PI_KOMMNR;                 00011290
               W02.TAB_PI_RAPPDATO(13) = W02_PI_RAPPDATO;               00011300
            END;                                                        00011310
        WHEN(14)                                                        00011320
            DO;                                                         00011330
               S001I02O.FRAÅR14O    = W02_PI_ÅR;                        00011340
               S001I02O.FRATYPE14O  = W02_PI_TYPE;                      00011350
               S001I02O.FRABELØP14O = W02_PI * 100;                     00011360
               W02.TAB_PI_ÅR(14)       = W02_PI_ÅR;                     00011370
               W02.TAB_PI_KODE(14)     = W02_PI_KODE;                   00011380
               W02.TAB_PI(14)          = W02_PI;                        00011390
               W02.TAB_PI_KOMMNR(14)   = W02_PI_KOMMNR;                 00011400
               W02.TAB_PI_RAPPDATO(14) = W02_PI_RAPPDATO;               00011410
            END;                                                        00011420
        WHEN(15)                                                        00011430
            DO;                                                         00011440
               S001I02O.FRAÅR15O    = W02_PI_ÅR;                        00011450
               S001I02O.FRATYPE15O  = W02_PI_TYPE;                      00011460
               S001I02O.FRABELØP15O = W02_PI * 100;                     00011470
               W02.TAB_PI_ÅR(15)       = W02_PI_ÅR;                     00011480
               W02.TAB_PI_KODE(15)     = W02_PI_KODE;                   00011490
               W02.TAB_PI(15)          = W02_PI;                        00011500
               W02.TAB_PI_KOMMNR(15)   = W02_PI_KOMMNR;                 00011510
               W02.TAB_PI_RAPPDATO(15) = W02_PI_RAPPDATO;               00011520
            END;                                                        00011530
        WHEN(16)                                                        00011540
            DO;                                                         00011550
               S001I02O.FRAÅR16O    = W02_PI_ÅR;                        00011560
               S001I02O.FRATYPE16O  = W02_PI_TYPE;                      00011570
               S001I02O.FRABELØP16O = W02_PI * 100;                     00011580
               W02.TAB_PI_ÅR(16)       = W02_PI_ÅR;                     00011590
               W02.TAB_PI_KODE(16)     = W02_PI_KODE;                   00011600
               W02.TAB_PI(16)          = W02_PI;                        00011610
               W02.TAB_PI_KOMMNR(16)   = W02_PI_KOMMNR;                 00011620
               W02.TAB_PI_RAPPDATO(16) = W02_PI_RAPPDATO;               00011630
            END;                                                        00011640
        WHEN(17)                                                        00011650
            DO;                                                         00011660
               S001I02O.FRAÅR17O    = W02_PI_ÅR;                        00011670
               S001I02O.FRATYPE17O  = W02_PI_TYPE;                      00011680
               S001I02O.FRABELØP17O = W02_PI * 100;                     00011690
               W02.TAB_PI_ÅR(17)       = W02_PI_ÅR;                     00011700
               W02.TAB_PI_KODE(17)     = W02_PI_KODE;                   00011710
               W02.TAB_PI(17)          = W02_PI;                        00011720
               W02.TAB_PI_KOMMNR(17)   = W02_PI_KOMMNR;                 00011730
               W02.TAB_PI_RAPPDATO(17) = W02_PI_RAPPDATO;               00011740
            END;                                                        00011750
        WHEN(18)                                                        00011760
            DO;                                                         00011770
               S001I02O.FRAÅR18O    = W02_PI_ÅR;                        00011780
               S001I02O.FRATYPE18O  = W02_PI_TYPE;                      00011790
               S001I02O.FRABELØP18O = W02_PI * 100;                     00011800
               W02.TAB_PI_ÅR(18)       = W02_PI_ÅR;                     00011810
               W02.TAB_PI_KODE(18)     = W02_PI_KODE;                   00011820
               W02.TAB_PI(18)          = W02_PI;                        00011830
               W02.TAB_PI_KOMMNR(18)   = W02_PI_KOMMNR;                 00011840
               W02.TAB_PI_RAPPDATO(18) = W02_PI_RAPPDATO;               00011850
            END;                                                        00011860
        WHEN(19)                                                        00011870
            DO;                                                         00011880
               S001I02O.FRAÅR19O    = W02_PI_ÅR;                        00011890
               S001I02O.FRATYPE19O  = W02_PI_TYPE;                      00011900
               S001I02O.FRABELØP19O = W02_PI * 100;                     00011910
               W02.TAB_PI_ÅR(19)       = W02_PI_ÅR;                     00011920
               W02.TAB_PI_KODE(19)     = W02_PI_KODE;                   00011930
               W02.TAB_PI(19)          = W02_PI;                        00011940
               W02.TAB_PI_KOMMNR(19)   = W02_PI_KOMMNR;                 00011950
               W02.TAB_PI_RAPPDATO(19) = W02_PI_RAPPDATO;               00011960
            END;                                                        00011970
        WHEN(20)                                                        00011980
            DO;                                                         00011990
               S001I02O.FRAÅR20O    = W02_PI_ÅR;                        00012000
               S001I02O.FRATYPE20O  = W02_PI_TYPE;                      00012010
               S001I02O.FRABELØP20O = W02_PI * 100;                     00012020
               W02.TAB_PI_ÅR(20)       = W02_PI_ÅR;                     00012030
               W02.TAB_PI_KODE(20)     = W02_PI_KODE;                   00012040
               W02.TAB_PI(20)          = W02_PI;                        00012050
               W02.TAB_PI_KOMMNR(20)   = W02_PI_KOMMNR;                 00012060
               W02.TAB_PI_RAPPDATO(20) = W02_PI_RAPPDATO;               00012070
            END;                                                        00012080
        WHEN(21)                                                        00012090
            DO;                                                         00012100
               S001I02O.FRAÅR21O    = W02_PI_ÅR;                        00012110
               S001I02O.FRATYPE21O  = W02_PI_TYPE;                      00012120
               S001I02O.FRABELØP21O = W02_PI * 100;                     00012130
               W02.TAB_PI_ÅR(21)       = W02_PI_ÅR;                     00012140
               W02.TAB_PI_KODE(21)     = W02_PI_KODE;                   00012150
               W02.TAB_PI(21)          = W02_PI;                        00012160
               W02.TAB_PI_KOMMNR(21)   = W02_PI_KOMMNR;                 00012170
               W02.TAB_PI_RAPPDATO(21) = W02_PI_RAPPDATO;               00012180
            END;                                                        00012190
        WHEN(22)                                                        00012200
            DO;                                                         00012210
               S001I02O.FRAÅR22O    = W02_PI_ÅR;                        00012220
               S001I02O.FRATYPE22O  = W02_PI_TYPE;                      00012230
               S001I02O.FRABELØP22O = W02_PI * 100;                     00012240
               W02.TAB_PI_ÅR(22)       = W02_PI_ÅR;                     00012250
               W02.TAB_PI_KODE(22)     = W02_PI_KODE;                   00012260
               W02.TAB_PI(22)          = W02_PI;                        00012270
               W02.TAB_PI_KOMMNR(22)   = W02_PI_KOMMNR;                 00012280
               W02.TAB_PI_RAPPDATO(22) = W02_PI_RAPPDATO;               00012290
            END;                                                        00012300
        WHEN(23)                                                        00012310
            DO;                                                         00012320
               S001I02O.FRAÅR23O    = W02_PI_ÅR;                        00012330
               S001I02O.FRATYPE23O  = W02_PI_TYPE;                      00012340
               S001I02O.FRABELØP23O = W02_PI * 100;                     00012350
               W02.TAB_PI_ÅR(23)       = W02_PI_ÅR;                     00012360
               W02.TAB_PI_KODE(23)     = W02_PI_KODE;                   00012370
               W02.TAB_PI(23)          = W02_PI;                        00012380
               W02.TAB_PI_KOMMNR(23)   = W02_PI_KOMMNR;                 00012390
               W02.TAB_PI_RAPPDATO(23) = W02_PI_RAPPDATO;               00012400
            END;                                                        00012410
        WHEN(24)                                                        00012420
            DO;                                                         00012430
               S001I02O.FRAÅR24O    = W02_PI_ÅR;                        00012440
               S001I02O.FRATYPE24O  = W02_PI_TYPE;                      00012450
               S001I02O.FRABELØP24O = W02_PI * 100;                     00012460
               W02.TAB_PI_ÅR(24)       = W02_PI_ÅR;                     00012470
               W02.TAB_PI_KODE(24)     = W02_PI_KODE;                   00012480
               W02.TAB_PI(24)          = W02_PI;                        00012490
               W02.TAB_PI_KOMMNR(24)   = W02_PI_KOMMNR;                 00012500
               W02.TAB_PI_RAPPDATO(24) = W02_PI_RAPPDATO;               00012510
            END;                                                        00012520
        OTHERWISE;                                                      00012530
     END;                                                               00012540
  END FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR;                                   00012550
                                                                        00012560
                                                                        00012570
                                                                        00012580
                                                                        00012590
                                                                        00012600
  FLYTT_DBOPPL_TIL_BL_OMR_TILFNR:                                       00012610
     PROC;                                                              00012620
                                                                        00012630
     S001I02O.CICS_INFOO = CICSINFO               ;                     00012640
                                                                        00012650
     SELECT(ANTALL_TIL_LEST);                                           00012660
        WHEN(1)                                                         00012670
            DO;                                                         00012680
               S001I02O.TILÅR1O    = W02_PI_ÅR;                         00012690
               S001I02O.TILTYPE1O  = W02_PI_TYPE;                       00012700
               S001I02O.TILBELØP1O = W02_PI * 100;                      00012710
            END;                                                        00012720
        WHEN(2)                                                         00012730
            DO;                                                         00012740
               S001I02O.TILÅR2O    = W02_PI_ÅR;                         00012750
               S001I02O.TILTYPE2O  = W02_PI_TYPE;                       00012760
               S001I02O.TILBELØP2O = W02_PI * 100;                      00012770
            END;                                                        00012780
        WHEN(3)                                                         00012790
            DO;                                                         00012800
               S001I02O.TILÅR3O    = W02_PI_ÅR;                         00012810
               S001I02O.TILTYPE3O  = W02_PI_TYPE;                       00012820
               S001I02O.TILBELØP3O = W02_PI * 100;                      00012830
            END;                                                        00012840
        WHEN(4)                                                         00012850
            DO;                                                         00012860
               S001I02O.TILÅR4O    = W02_PI_ÅR;                         00012870
               S001I02O.TILTYPE4O  = W02_PI_TYPE;                       00012880
               S001I02O.TILBELØP4O = W02_PI * 100;                      00012890
            END;                                                        00012900
        WHEN(5)                                                         00012910
            DO;                                                         00012920
               S001I02O.TILÅR5O    = W02_PI_ÅR;                         00012930
               S001I02O.TILTYPE5O  = W02_PI_TYPE;                       00012940
               S001I02O.TILBELØP5O = W02_PI * 100;                      00012950
            END;                                                        00012960
        WHEN(6)                                                         00012970
            DO;                                                         00012980
               S001I02O.TILÅR6O    = W02_PI_ÅR;                         00012990
               S001I02O.TILTYPE6O  = W02_PI_TYPE;                       00013000
               S001I02O.TILBELØP6O = W02_PI * 100;                      00013010
            END;                                                        00013020
        WHEN(7)                                                         00013030
            DO;                                                         00013040
               S001I02O.TILÅR7O    = W02_PI_ÅR;                         00013050
               S001I02O.TILTYPE7O  = W02_PI_TYPE;                       00013060
               S001I02O.TILBELØP7O = W02_PI * 100;                      00013070
            END;                                                        00013080
        WHEN(8)                                                         00013090
            DO;                                                         00013100
               S001I02O.TILÅR8O    = W02_PI_ÅR;                         00013110
               S001I02O.TILTYPE8O  = W02_PI_TYPE;                       00013120
               S001I02O.TILBELØP8O = W02_PI * 100;                      00013130
            END;                                                        00013140
        WHEN(9)                                                         00013150
            DO;                                                         00013160
               S001I02O.TILÅR9O    = W02_PI_ÅR;                         00013170
               S001I02O.TILTYPE9O  = W02_PI_TYPE;                       00013180
               S001I02O.TILBELØP9O = W02_PI * 100;                      00013190
            END;                                                        00013200
        WHEN(10)                                                        00013210
            DO;                                                         00013220
               S001I02O.TILÅR10O    = W02_PI_ÅR;                        00013230
               S001I02O.TILTYPE10O  = W02_PI_TYPE;                      00013240
               S001I02O.TILBELØP10O = W02_PI * 100;                     00013250
            END;                                                        00013260
        WHEN(11)                                                        00013270
            DO;                                                         00013280
               S001I02O.TILÅR11O    = W02_PI_ÅR;                        00013290
               S001I02O.TILTYPE11O  = W02_PI_TYPE;                      00013300
               S001I02O.TILBELØP11O = W02_PI * 100;                     00013310
            END;                                                        00013320
        WHEN(12)                                                        00013330
            DO;                                                         00013340
               S001I02O.TILÅR12O    = W02_PI_ÅR;                        00013350
               S001I02O.TILTYPE12O  = W02_PI_TYPE;                      00013360
               S001I02O.TILBELØP12O = W02_PI * 100;                     00013370
            END;                                                        00013380
        WHEN(13)                                                        00013390
            DO;                                                         00013400
               S001I02O.TILÅR13O    = W02_PI_ÅR;                        00013410
               S001I02O.TILTYPE13O  = W02_PI_TYPE;                      00013420
               S001I02O.TILBELØP13O = W02_PI * 100;                     00013430
            END;                                                        00013440
        WHEN(14)                                                        00013450
            DO;                                                         00013460
               S001I02O.TILÅR14O    = W02_PI_ÅR;                        00013470
               S001I02O.TILTYPE14O  = W02_PI_TYPE;                      00013480
               S001I02O.TILBELØP14O = W02_PI * 100;                     00013490
            END;                                                        00013500
        WHEN(15)                                                        00013510
            DO;                                                         00013520
               S001I02O.TILÅR15O    = W02_PI_ÅR;                        00013530
               S001I02O.TILTYPE15O  = W02_PI_TYPE;                      00013540
               S001I02O.TILBELØP15O = W02_PI * 100;                     00013550
            END;                                                        00013560
        WHEN(16)                                                        00013570
            DO;                                                         00013580
               S001I02O.TILÅR16O    = W02_PI_ÅR;                        00013590
               S001I02O.TILTYPE16O  = W02_PI_TYPE;                      00013600
               S001I02O.TILBELØP16O = W02_PI * 100;                     00013610
            END;                                                        00013620
        WHEN(17)                                                        00013630
            DO;                                                         00013640
               S001I02O.TILÅR17O    = W02_PI_ÅR;                        00013650
               S001I02O.TILTYPE17O  = W02_PI_TYPE;                      00013660
               S001I02O.TILBELØP17O = W02_PI * 100;                     00013670
            END;                                                        00013680
        WHEN(18)                                                        00013690
            DO;                                                         00013700
               S001I02O.TILÅR18O    = W02_PI_ÅR;                        00013710
               S001I02O.TILTYPE18O  = W02_PI_TYPE;                      00013720
               S001I02O.TILBELØP18O = W02_PI * 100;                     00013730
            END;                                                        00013740
        WHEN(19)                                                        00013750
            DO;                                                         00013760
               S001I02O.TILÅR19O    = W02_PI_ÅR;                        00013770
               S001I02O.TILTYPE19O  = W02_PI_TYPE;                      00013780
               S001I02O.TILBELØP19O = W02_PI * 100;                     00013790
            END;                                                        00013800
        WHEN(20)                                                        00013810
            DO;                                                         00013820
               S001I02O.TILÅR20O    = W02_PI_ÅR;                        00013830
               S001I02O.TILTYPE20O  = W02_PI_TYPE;                      00013840
               S001I02O.TILBELØP20O = W02_PI * 100;                     00013850
            END;                                                        00013860
        WHEN(21)                                                        00013870
            DO;                                                         00013880
               S001I02O.TILÅR21O    = W02_PI_ÅR;                        00013890
               S001I02O.TILTYPE21O  = W02_PI_TYPE;                      00013900
               S001I02O.TILBELØP21O = W02_PI * 100;                     00013910
            END;                                                        00013920
        WHEN(22)                                                        00013930
            DO;                                                         00013940
               S001I02O.TILÅR22O    = W02_PI_ÅR;                        00013950
               S001I02O.TILTYPE22O  = W02_PI_TYPE;                      00013960
               S001I02O.TILBELØP22O = W02_PI * 100;                     00013970
            END;                                                        00013980
        WHEN(23)                                                        00013990
            DO;                                                         00014000
               S001I02O.TILÅR23O    = W02_PI_ÅR;                        00014010
               S001I02O.TILTYPE23O  = W02_PI_TYPE;                      00014020
               S001I02O.TILBELØP23O = W02_PI * 100;                     00014030
            END;                                                        00014040
        WHEN(24)                                                        00014050
            DO;                                                         00014060
               S001I02O.TILÅR24O    = W02_PI_ÅR;                        00014070
               S001I02O.TILTYPE24O  = W02_PI_TYPE;                      00014080
               S001I02O.TILBELØP24O = W02_PI * 100;                     00014090
            END;                                                        00014100
        OTHERWISE;                                                      00014110
     END;                                                               00014120
  END FLYTT_DBOPPL_TIL_BL_OMR_TILFNR;                                   00014130
                                                                        00014140
                                                                        00014150
                                                                        00014160
                                                                        00014170
                                                                        00014180
  BLANK_TIL_OPPL:                                                       00014190
    PROC;                                                               00014200
          S001I02I.TILÅR1I    = LOW_VALUES;                             00014210
          S001I02I.TILTYPE1I  = LOW_VALUES;                             00014220
          S001I02I.TILBELØP1I = LOW_VALUES;                             00014230
                                                                        00014240
                                                                        00014250
          S001I02I.TILÅR2I    = LOW_VALUES;                             00014260
          S001I02I.TILTYPE2I  = LOW_VALUES;                             00014270
          S001I02I.TILBELØP2I = LOW_VALUES;                             00014280
                                                                        00014290
                                                                        00014300
          S001I02I.TILÅR3I    = LOW_VALUES;                             00014310
          S001I02I.TILTYPE3I  = LOW_VALUES;                             00014320
          S001I02I.TILBELØP3I = LOW_VALUES;                             00014330
                                                                        00014340
                                                                        00014350
          S001I02I.TILÅR4I    = LOW_VALUES;                             00014360
          S001I02I.TILTYPE4I  = LOW_VALUES;                             00014370
          S001I02I.TILBELØP4I = LOW_VALUES;                             00014380
                                                                        00014390
                                                                        00014400
          S001I02I.TILÅR5I    = LOW_VALUES;                             00014410
          S001I02I.TILTYPE5I  = LOW_VALUES;                             00014420
          S001I02I.TILBELØP5I = LOW_VALUES;                             00014430
                                                                        00014440
                                                                        00014450
          S001I02I.TILÅR6I    = LOW_VALUES;                             00014460
          S001I02I.TILTYPE6I  = LOW_VALUES;                             00014470
          S001I02I.TILBELØP6I = LOW_VALUES;                             00014480
                                                                        00014490
                                                                        00014500
          S001I02I.TILÅR7I    = LOW_VALUES;                             00014510
          S001I02I.TILTYPE7I  = LOW_VALUES;                             00014520
          S001I02I.TILBELØP7I = LOW_VALUES;                             00014530
                                                                        00014540
                                                                        00014550
          S001I02I.TILÅR8I    = LOW_VALUES;                             00014560
          S001I02I.TILTYPE8I  = LOW_VALUES;                             00014570
          S001I02I.TILBELØP8I = LOW_VALUES;                             00014580
                                                                        00014590
                                                                        00014600
          S001I02I.TILÅR9I    = LOW_VALUES;                             00014610
          S001I02I.TILTYPE9I  = LOW_VALUES;                             00014620
          S001I02I.TILBELØP9I = LOW_VALUES;                             00014630
                                                                        00014640
                                                                        00014650
          S001I02I.TILÅR10I    = LOW_VALUES;                            00014660
          S001I02I.TILTYPE10I  = LOW_VALUES;                            00014670
          S001I02I.TILBELØP10I = LOW_VALUES;                            00014680
                                                                        00014690
                                                                        00014700
          S001I02I.TILÅR11I    = LOW_VALUES;                            00014710
          S001I02I.TILTYPE11I  = LOW_VALUES;                            00014720
          S001I02I.TILBELØP11I = LOW_VALUES;                            00014730
                                                                        00014740
                                                                        00014750
          S001I02I.TILÅR12I    = LOW_VALUES;                            00014760
          S001I02I.TILTYPE12I  = LOW_VALUES;                            00014770
          S001I02I.TILBELØP12I = LOW_VALUES;                            00014780
                                                                        00014790
                                                                        00014800
          S001I02I.TILÅR13I    = LOW_VALUES;                            00014810
          S001I02I.TILTYPE13I  = LOW_VALUES;                            00014820
          S001I02I.TILBELØP13I = LOW_VALUES;                            00014830
                                                                        00014840
                                                                        00014850
          S001I02I.TILÅR14I    = LOW_VALUES;                            00014860
          S001I02I.TILTYPE14I  = LOW_VALUES;                            00014870
          S001I02I.TILBELØP14I = LOW_VALUES;                            00014880
                                                                        00014890
                                                                        00014900
          S001I02I.TILÅR15I    = LOW_VALUES;                            00014910
          S001I02I.TILTYPE15I  = LOW_VALUES;                            00014920
          S001I02I.TILBELØP15I = LOW_VALUES;                            00014930
                                                                        00014940
                                                                        00014950
          S001I02I.TILÅR16I    = LOW_VALUES;                            00014960
          S001I02I.TILTYPE16I  = LOW_VALUES;                            00014970
          S001I02I.TILBELØP16I = LOW_VALUES;                            00014980
                                                                        00014990
                                                                        00015000
          S001I02I.TILÅR17I    = LOW_VALUES;                            00015010
          S001I02I.TILTYPE17I  = LOW_VALUES;                            00015020
          S001I02I.TILBELØP17I = LOW_VALUES;                            00015030
                                                                        00015040
                                                                        00015050
          S001I02I.TILÅR18I    = LOW_VALUES;                            00015060
          S001I02I.TILTYPE18I  = LOW_VALUES;                            00015070
          S001I02I.TILBELØP18I = LOW_VALUES;                            00015080
                                                                        00015090
                                                                        00015100
          S001I02I.TILÅR19I    = LOW_VALUES;                            00015110
          S001I02I.TILTYPE19I  = LOW_VALUES;                            00015120
          S001I02I.TILBELØP19I = LOW_VALUES;                            00015130
                                                                        00015140
                                                                        00015150
          S001I02I.TILÅR20I    = LOW_VALUES;                            00015160
          S001I02I.TILTYPE20I  = LOW_VALUES;                            00015170
          S001I02I.TILBELØP20I = LOW_VALUES;                            00015180
                                                                        00015190
                                                                        00015200
          S001I02I.TILÅR21I    = LOW_VALUES;                            00015210
          S001I02I.TILTYPE21I  = LOW_VALUES;                            00015220
          S001I02I.TILBELØP21I = LOW_VALUES;                            00015230
                                                                        00015240
                                                                        00015250
          S001I02I.TILÅR22I    = LOW_VALUES;                            00015260
          S001I02I.TILTYPE22I  = LOW_VALUES;                            00015270
          S001I02I.TILBELØP22I = LOW_VALUES;                            00015280
                                                                        00015290
                                                                        00015300
          S001I02I.TILÅR23I    = LOW_VALUES;                            00015310
          S001I02I.TILTYPE23I  = LOW_VALUES;                            00015320
          S001I02I.TILBELØP23I = LOW_VALUES;                            00015330
                                                                        00015340
                                                                        00015350
          S001I02I.TILÅR24I    = LOW_VALUES;                            00015360
          S001I02I.TILTYPE24I  = LOW_VALUES;                            00015370
          S001I02I.TILBELØP24I = LOW_VALUES;                            00015380
                                                                        00015390
  END BLANK_TIL_OPPL;                                                   00015400
                                                                        00015410
  MARKER_LINJE:                                                         00015420
     PROC;                                                              00015430
                                                                        00015440
     S001I02O.CICS_INFOO = CICSINFO               ;                     00015450
                                                                        00015460
     SELECT(I);                                                         00015470
        WHEN(1)                                                         00015480
            S001I02I.MRK1I    = 'M';                                    00015490
        WHEN(2)                                                         00015500
            S001I02I.MRK2I    = 'M';                                    00015510
        WHEN(3)                                                         00015520
            S001I02I.MRK3I    = 'M';                                    00015530
        WHEN(4)                                                         00015540
            S001I02I.MRK4I    = 'M';                                    00015550
        WHEN(5)                                                         00015560
            S001I02I.MRK5I    = 'M';                                    00015570
        WHEN(6)                                                         00015580
            S001I02I.MRK6I    = 'M';                                    00015590
        WHEN(7)                                                         00015600
            S001I02I.MRK7I    = 'M';                                    00015610
        WHEN(8)                                                         00015620
            S001I02I.MRK8I    = 'M';                                    00015630
        WHEN(9)                                                         00015640
            S001I02I.MRK9I    = 'M';                                    00015650
        WHEN(10)                                                        00015660
            S001I02I.MRK10I    = 'M';                                   00015670
        WHEN(11)                                                        00015680
            S001I02I.MRK11I    = 'M';                                   00015690
        WHEN(12)                                                        00015700
            S001I02I.MRK12I    = 'M';                                   00015710
        WHEN(13)                                                        00015720
            S001I02I.MRK13I    = 'M';                                   00015730
        WHEN(14)                                                        00015740
            S001I02I.MRK14I    = 'M';                                   00015750
        WHEN(15)                                                        00015760
            S001I02I.MRK15I    = 'M';                                   00015770
        WHEN(16)                                                        00015780
            S001I02I.MRK16I    = 'M';                                   00015790
        WHEN(17)                                                        00015800
            S001I02I.MRK17I    = 'M';                                   00015810
        WHEN(18)                                                        00015820
            S001I02I.MRK18I    = 'M';                                   00015830
        WHEN(19)                                                        00015840
            S001I02I.MRK19I    = 'M';                                   00015850
        WHEN(20)                                                        00015860
            S001I02I.MRK20I    = 'M';                                   00015870
        WHEN(21)                                                        00015880
            S001I02I.MRK21I    = 'M';                                   00015890
        WHEN(22)                                                        00015900
            S001I02I.MRK22I    = 'M';                                   00015910
        WHEN(23)                                                        00015920
            S001I02I.MRK23I    = 'M';                                   00015930
        WHEN(24)                                                        00015940
            S001I02I.MRK24I    = 'M';                                   00015950
        OTHERWISE;                                                      00015960
     END;                                                               00015970
  END MARKER_LINJE;                                                     00015980
                                                                        00015990
                                                                        00016000
                                                                        00016010
                                                                        00016020
                                                                        00016030
  BEHANDLE_MARKERTE_LINJER:                                             00016040
   PROC;                                                                00016050
                                                                        00016060
     S001I02O.CICS_INFOO = CICSINFO               ;                     00016070
                                                                        00016080
     IF S001I02I.MRK1I = 'M' THEN                                       00016090
        DO;                                                             00016100
           S001I02O.TILÅR1O    = S001I02O.FRAÅR1O;                      00016110
           S001I02O.TILTYPE1O  = S001I02O.FRATYPE1O;                    00016120
           S001I02O.TILBELØP1O = S001I02O.FRABELØP1O;                   00016130
           S001I02O.MRK1O      = '*';                                   00016140
           S001I02I.FRAÅR1I    = LOW_VALUES;                            00016150
           S001I02I.FRATYPE1I  = LOW_VALUES;                            00016160
           S001I02I.FRABELØP1I = LOW_VALUES;                            00016170
        END;                                                            00016180
     IF S001I02I.MRK2I = 'M' THEN                                       00016190
        DO;                                                             00016200
           S001I02O.TILÅR2O    = S001I02O.FRAÅR2O;                      00016210
           S001I02O.TILTYPE2O  = S001I02O.FRATYPE2O;                    00016220
           S001I02O.TILBELØP2O = S001I02O.FRABELØP2O;                   00016230
           S001I02O.MRK2O      = '*';                                   00016240
           S001I02I.FRAÅR2I    = LOW_VALUES;                            00016250
           S001I02I.FRATYPE2I  = LOW_VALUES;                            00016260
           S001I02I.FRABELØP2I = LOW_VALUES;                            00016270
        END;                                                            00016280
     IF S001I02I.MRK3I = 'M' THEN                                       00016290
        DO;                                                             00016300
           S001I02O.TILÅR3O    = S001I02O.FRAÅR3O;                      00016310
           S001I02O.TILTYPE3O  = S001I02O.FRATYPE3O;                    00016320
           S001I02O.TILBELØP3O = S001I02O.FRABELØP3O;                   00016330
           S001I02O.MRK3O      = '*';                                   00016340
           S001I02I.FRAÅR3I    = LOW_VALUES;                            00016350
           S001I02I.FRATYPE3I  = LOW_VALUES;                            00016360
           S001I02I.FRABELØP3I = LOW_VALUES;                            00016370
        END;                                                            00016380
     IF S001I02I.MRK4I = 'M' THEN                                       00016390
        DO;                                                             00016400
           S001I02O.TILÅR4O    = S001I02O.FRAÅR4O;                      00016410
           S001I02O.TILTYPE4O  = S001I02O.FRATYPE4O;                    00016420
           S001I02O.TILBELØP4O = S001I02O.FRABELØP4O;                   00016430
           S001I02O.MRK4O      = '*';                                   00016440
           S001I02I.FRAÅR4I    = LOW_VALUES;                            00016450
           S001I02I.FRATYPE4I  = LOW_VALUES;                            00016460
           S001I02I.FRABELØP4I = LOW_VALUES;                            00016470
        END;                                                            00016480
     IF S001I02I.MRK5I = 'M' THEN                                       00016490
        DO;                                                             00016500
           S001I02O.TILÅR5O    = S001I02O.FRAÅR5O;                      00016510
           S001I02O.TILTYPE5O  = S001I02O.FRATYPE5O;                    00016520
           S001I02O.TILBELØP5O = S001I02O.FRABELØP5O;                   00016530
           S001I02O.MRK5O      = '*';                                   00016540
           S001I02I.FRAÅR5I    = LOW_VALUES;                            00016550
           S001I02I.FRATYPE5I  = LOW_VALUES;                            00016560
           S001I02I.FRABELØP5I = LOW_VALUES;                            00016570
        END;                                                            00016580
     IF S001I02I.MRK6I = 'M' THEN                                       00016590
        DO;                                                             00016600
           S001I02O.TILÅR6O    = S001I02O.FRAÅR6O;                      00016610
           S001I02O.TILTYPE6O  = S001I02O.FRATYPE6O;                    00016620
           S001I02O.TILBELØP6O = S001I02O.FRABELØP6O;                   00016630
           S001I02O.MRK6O      = '*';                                   00016640
           S001I02I.FRAÅR6I    = LOW_VALUES;                            00016650
           S001I02I.FRATYPE6I  = LOW_VALUES;                            00016660
           S001I02I.FRABELØP6I = LOW_VALUES;                            00016670
        END;                                                            00016680
     IF S001I02I.MRK7I = 'M' THEN                                       00016690
        DO;                                                             00016700
           S001I02O.TILÅR7O    = S001I02O.FRAÅR7O;                      00016710
           S001I02O.TILTYPE7O  = S001I02O.FRATYPE7O;                    00016720
           S001I02O.TILBELØP7O = S001I02O.FRABELØP7O;                   00016730
           S001I02O.MRK7O      = '*';                                   00016740
           S001I02I.FRAÅR7I    = LOW_VALUES;                            00016750
           S001I02I.FRATYPE7I  = LOW_VALUES;                            00016760
           S001I02I.FRABELØP7I = LOW_VALUES;                            00016770
        END;                                                            00016780
     IF S001I02I.MRK8I = 'M' THEN                                       00016790
        DO;                                                             00016800
           S001I02O.TILÅR8O    = S001I02O.FRAÅR8O;                      00016810
           S001I02O.TILTYPE8O  = S001I02O.FRATYPE8O;                    00016820
           S001I02O.TILBELØP8O = S001I02O.FRABELØP8O;                   00016830
           S001I02O.MRK8O      = '*';                                   00016840
           S001I02I.FRAÅR8I    = LOW_VALUES;                            00016850
           S001I02I.FRATYPE8I  = LOW_VALUES;                            00016860
           S001I02I.FRABELØP8I = LOW_VALUES;                            00016870
        END;                                                            00016880
     IF S001I02I.MRK9I = 'M' THEN                                       00016890
        DO;                                                             00016900
           S001I02O.TILÅR9O    = S001I02O.FRAÅR9O;                      00016910
           S001I02O.TILTYPE9O  = S001I02O.FRATYPE9O;                    00016920
           S001I02O.TILBELØP9O = S001I02O.FRABELØP9O;                   00016930
           S001I02O.MRK9O      = '*';                                   00016940
           S001I02I.FRAÅR9I    = LOW_VALUES;                            00016950
           S001I02I.FRATYPE9I  = LOW_VALUES;                            00016960
           S001I02I.FRABELØP9I = LOW_VALUES;                            00016970
        END;                                                            00016980
     IF S001I02I.MRK10I = 'M' THEN                                      00016990
        DO;                                                             00017000
           S001I02O.TILÅR10O    = S001I02O.FRAÅR10O;                    00017010
           S001I02O.TILTYPE10O  = S001I02O.FRATYPE10O;                  00017020
           S001I02O.TILBELØP10O = S001I02O.FRABELØP10O;                 00017030
           S001I02O.MRK10O      = '*';                                  00017040
           S001I02I.FRAÅR10I    = LOW_VALUES;                           00017050
           S001I02I.FRATYPE10I  = LOW_VALUES;                           00017060
           S001I02I.FRABELØP10I = LOW_VALUES;                           00017070
        END;                                                            00017080
     IF S001I02I.MRK11I = 'M' THEN                                      00017090
        DO;                                                             00017100
           S001I02O.TILÅR11O    = S001I02O.FRAÅR11O;                    00017110
           S001I02O.TILTYPE11O  = S001I02O.FRATYPE11O;                  00017120
           S001I02O.TILBELØP11O = S001I02O.FRABELØP11O;                 00017130
           S001I02O.MRK11O      = '*';                                  00017140
           S001I02I.FRAÅR11I    = LOW_VALUES;                           00017150
           S001I02I.FRATYPE11I  = LOW_VALUES;                           00017160
           S001I02I.FRABELØP11I = LOW_VALUES;                           00017170
        END;                                                            00017180
     IF S001I02I.MRK12I = 'M' THEN                                      00017190
        DO;                                                             00017200
           S001I02O.TILÅR12O    = S001I02O.FRAÅR12O;                    00017210
           S001I02O.TILTYPE12O  = S001I02O.FRATYPE12O;                  00017220
           S001I02O.TILBELØP12O = S001I02O.FRABELØP12O;                 00017230
           S001I02O.MRK12O      = '*';                                  00017240
           S001I02I.FRAÅR12I    = LOW_VALUES;                           00017250
           S001I02I.FRATYPE12I  = LOW_VALUES;                           00017260
           S001I02I.FRABELØP12I = LOW_VALUES;                           00017270
        END;                                                            00017280
     IF S001I02I.MRK13I = 'M' THEN                                      00017290
        DO;                                                             00017300
           S001I02O.TILÅR13O    = S001I02O.FRAÅR13O;                    00017310
           S001I02O.TILTYPE13O  = S001I02O.FRATYPE13O;                  00017320
           S001I02O.TILBELØP13O = S001I02O.FRABELØP13O;                 00017330
           S001I02O.MRK13O      = '*';                                  00017340
           S001I02I.FRAÅR13I    = LOW_VALUES;                           00017350
           S001I02I.FRATYPE13I  = LOW_VALUES;                           00017360
           S001I02I.FRABELØP13I = LOW_VALUES;                           00017370
        END;                                                            00017380
     IF S001I02I.MRK14I = 'M' THEN                                      00017390
        DO;                                                             00017400
           S001I02O.TILÅR14O    = S001I02O.FRAÅR14O;                    00017410
           S001I02O.TILTYPE14O  = S001I02O.FRATYPE14O;                  00017420
           S001I02O.TILBELØP14O = S001I02O.FRABELØP14O;                 00017430
           S001I02O.MRK14O      = '*';                                  00017440
           S001I02I.FRAÅR14I    = LOW_VALUES;                           00017450
           S001I02I.FRATYPE14I  = LOW_VALUES;                           00017460
           S001I02I.FRABELØP14I = LOW_VALUES;                           00017470
        END;                                                            00017480
     IF S001I02I.MRK15I = 'M' THEN                                      00017490
        DO;                                                             00017500
           S001I02O.TILÅR15O    = S001I02O.FRAÅR15O;                    00017510
           S001I02O.TILTYPE15O  = S001I02O.FRATYPE15O;                  00017520
           S001I02O.TILBELØP15O = S001I02O.FRABELØP15O;                 00017530
           S001I02O.MRK15O      = '*';                                  00017540
           S001I02I.FRAÅR15I    = LOW_VALUES;                           00017550
           S001I02I.FRATYPE15I  = LOW_VALUES;                           00017560
           S001I02I.FRABELØP15I = LOW_VALUES;                           00017570
        END;                                                            00017580
     IF S001I02I.MRK16I = 'M' THEN                                      00017590
        DO;                                                             00017600
           S001I02O.TILÅR16O    = S001I02O.FRAÅR16O;                    00017610
           S001I02O.TILTYPE16O  = S001I02O.FRATYPE16O;                  00017620
           S001I02O.TILBELØP16O = S001I02O.FRABELØP16O;                 00017630
           S001I02O.MRK16O      = '*';                                  00017640
           S001I02I.FRAÅR16I    = LOW_VALUES;                           00017650
           S001I02I.FRATYPE16I  = LOW_VALUES;                           00017660
           S001I02I.FRABELØP16I = LOW_VALUES;                           00017670
        END;                                                            00017680
     IF S001I02I.MRK17I = 'M' THEN                                      00017690
        DO;                                                             00017700
           S001I02O.TILÅR17O    = S001I02O.FRAÅR17O;                    00017710
           S001I02O.TILTYPE17O  = S001I02O.FRATYPE17O;                  00017720
           S001I02O.TILBELØP17O = S001I02O.FRABELØP17O;                 00017730
           S001I02O.MRK17O      = '*';                                  00017740
           S001I02I.FRAÅR17I    = LOW_VALUES;                           00017750
           S001I02I.FRATYPE17I  = LOW_VALUES;                           00017760
           S001I02I.FRABELØP17I = LOW_VALUES;                           00017770
        END;                                                            00017780
     IF S001I02I.MRK18I = 'M' THEN                                      00017790
        DO;                                                             00017800
           S001I02O.TILÅR18O    = S001I02O.FRAÅR18O;                    00017810
           S001I02O.TILTYPE18O  = S001I02O.FRATYPE18O;                  00017820
           S001I02O.TILBELØP18O = S001I02O.FRABELØP18O;                 00017830
           S001I02O.MRK18O      = '*';                                  00017840
           S001I02I.FRAÅR18I    = LOW_VALUES;                           00017850
           S001I02I.FRATYPE18I  = LOW_VALUES;                           00017860
           S001I02I.FRABELØP18I = LOW_VALUES;                           00017870
        END;                                                            00017880
     IF S001I02I.MRK19I = 'M' THEN                                      00017890
        DO;                                                             00017900
           S001I02O.TILÅR19O    = S001I02O.FRAÅR19O;                    00017910
           S001I02O.TILTYPE19O  = S001I02O.FRATYPE19O;                  00017920
           S001I02O.TILBELØP19O = S001I02O.FRABELØP19O;                 00017930
           S001I02O.MRK19O      = '*';                                  00017940
           S001I02I.FRAÅR19I    = LOW_VALUES;                           00017950
           S001I02I.FRATYPE19I  = LOW_VALUES;                           00017960
           S001I02I.FRABELØP19I = LOW_VALUES;                           00017970
        END;                                                            00017980
     IF S001I02I.MRK20I = 'M' THEN                                      00017990
        DO;                                                             00018000
           S001I02O.TILÅR20O    = S001I02O.FRAÅR20O;                    00018010
           S001I02O.TILTYPE20O  = S001I02O.FRATYPE20O;                  00018020
           S001I02O.TILBELØP20O = S001I02O.FRABELØP20O;                 00018030
           S001I02O.MRK20O      = '*';                                  00018040
           S001I02I.FRAÅR20I    = LOW_VALUES;                           00018050
           S001I02I.FRATYPE20I  = LOW_VALUES;                           00018060
           S001I02I.FRABELØP20I = LOW_VALUES;                           00018070
        END;                                                            00018080
     IF S001I02I.MRK21I = 'M' THEN                                      00018090
        DO;                                                             00018100
           S001I02O.TILÅR21O    = S001I02O.FRAÅR21O;                    00018110
           S001I02O.TILTYPE21O  = S001I02O.FRATYPE21O;                  00018120
           S001I02O.TILBELØP21O = S001I02O.FRABELØP21O;                 00018130
           S001I02O.MRK21O      = '*';                                  00018140
           S001I02I.FRAÅR21I    = LOW_VALUES;                           00018150
           S001I02I.FRATYPE21I  = LOW_VALUES;                           00018160
           S001I02I.FRABELØP21I = LOW_VALUES;                           00018170
        END;                                                            00018180
     IF S001I02I.MRK22I = 'M' THEN                                      00018190
        DO;                                                             00018200
           S001I02O.TILÅR22O    = S001I02O.FRAÅR22O;                    00018210
           S001I02O.TILTYPE22O  = S001I02O.FRATYPE22O;                  00018220
           S001I02O.TILBELØP22O = S001I02O.FRABELØP22O;                 00018230
           S001I02O.MRK22O      = '*';                                  00018240
           S001I02I.FRAÅR22I    = LOW_VALUES;                           00018250
           S001I02I.FRATYPE22I  = LOW_VALUES;                           00018260
           S001I02I.FRABELØP22I = LOW_VALUES;                           00018270
        END;                                                            00018280
     IF S001I02I.MRK23I = 'M' THEN                                      00018290
        DO;                                                             00018300
           S001I02O.TILÅR23O    = S001I02O.FRAÅR23O;                    00018310
           S001I02O.TILTYPE23O  = S001I02O.FRATYPE23O;                  00018320
           S001I02O.TILBELØP23O = S001I02O.FRABELØP23O;                 00018330
           S001I02O.MRK23O      = '*';                                  00018340
           S001I02I.FRAÅR23I    = LOW_VALUES;                           00018350
           S001I02I.FRATYPE23I  = LOW_VALUES;                           00018360
           S001I02I.FRABELØP23I = LOW_VALUES;                           00018370
        END;                                                            00018380
     IF S001I02I.MRK24I = 'M' THEN                                      00018390
        DO;                                                             00018400
           S001I02O.TILÅR24O    = S001I02O.FRAÅR24O;                    00018410
           S001I02O.TILTYPE24O  = S001I02O.FRATYPE24O;                  00018420
           S001I02O.TILBELØP24O = S001I02O.FRABELØP24O;                 00018430
           S001I02O.MRK24O      = '*';                                  00018440
           S001I02I.FRAÅR24I    = LOW_VALUES;                           00018450
           S001I02I.FRATYPE24I  = LOW_VALUES;                           00018460
           S001I02I.FRABELØP24I = LOW_VALUES;                           00018470
        END;                                                            00018480
                                                                        00018490
  END BEHANDLE_MARKERTE_LINJER;                                         00018500
                                                                        00018510
                                                                        00018520
                                                                        00018530
                                                                        00018540
  OVERFØR_INNTEKTER:                                                    00018550
     PROC(W01_PINT,INNT_ALDER_FRA,INNT_ALDER_TIL,FRA_FNR,TIL_FNR);      00018560
                                                                        00018570
     DCL INNT_ALDER_FRA CHAR (2);                                       00018580
     DCL INNT_ALDER_TIL CHAR (2);                                       00018590
     DCL FRA_FNR        PIC '(11)9';                                    00018600
     DCL TIL_FNR        PIC '(11)9';                                    00018610
                                                                        00018620
    /* ************************************************************** */00018630
    /*                                                                */00018640
    /*   INNTEKT-SEGMENTET                                            */00018650
    /*                                                                */00018660
    /* ************************************************************** */00018670
                                                                        00018680
       DCL 1  W01_PINT               UNALIGNED,                         00018690
       %INCLUDE P0019928;                                               00018700
                                                                        00018710
                                                                        00018720
                                                                        00018730
     IF S001I02O.MRK1O = '*' THEN                                       00018740
        CALL SKRIV_INNT(1,INNT_ALDER_TIL,INNT_ALDER_FRA);               00018750
                                                                        00018760
     IF S001I02O.MRK2O = '*' THEN                                       00018770
        CALL SKRIV_INNT(2,INNT_ALDER_TIL,INNT_ALDER_FRA);               00018780
                                                                        00018790
     IF S001I02O.MRK3O = '*' THEN                                       00018800
        CALL SKRIV_INNT(3,INNT_ALDER_TIL,INNT_ALDER_FRA);               00018810
                                                                        00018820
     IF S001I02O.MRK4O = '*' THEN                                       00018830
        CALL SKRIV_INNT(4,INNT_ALDER_TIL,INNT_ALDER_FRA);               00018840
                                                                        00018850
     IF S001I02O.MRK5O = '*' THEN                                       00018860
        CALL SKRIV_INNT(5,INNT_ALDER_TIL,INNT_ALDER_FRA);               00018870
                                                                        00018880
     IF S001I02O.MRK6O = '*' THEN                                       00018890
        CALL SKRIV_INNT(6,INNT_ALDER_TIL,INNT_ALDER_FRA);               00018900
                                                                        00018910
     IF S001I02O.MRK7O = '*' THEN                                       00018920
        CALL SKRIV_INNT(7,INNT_ALDER_TIL,INNT_ALDER_FRA);               00018930
                                                                        00018940
     IF S001I02O.MRK8O = '*' THEN                                       00018950
        CALL SKRIV_INNT(8,INNT_ALDER_TIL,INNT_ALDER_FRA);               00018960
                                                                        00018970
     IF S001I02O.MRK9O = '*' THEN                                       00018980
        CALL SKRIV_INNT(9,INNT_ALDER_TIL,INNT_ALDER_FRA);               00018990
                                                                        00019000
     IF S001I02O.MRK10O = '*' THEN                                      00019010
        CALL SKRIV_INNT(10,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019020
                                                                        00019030
     IF S001I02O.MRK11O = '*' THEN                                      00019040
        CALL SKRIV_INNT(11,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019050
                                                                        00019060
     IF S001I02O.MRK12O = '*' THEN                                      00019070
        CALL SKRIV_INNT(12,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019080
                                                                        00019090
     IF S001I02O.MRK13O = '*' THEN                                      00019100
        CALL SKRIV_INNT(13,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019110
                                                                        00019120
     IF S001I02O.MRK14O = '*' THEN                                      00019130
        CALL SKRIV_INNT(14,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019140
                                                                        00019150
     IF S001I02O.MRK15O = '*' THEN                                      00019160
        CALL SKRIV_INNT(15,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019170
                                                                        00019180
     IF S001I02O.MRK16O = '*' THEN                                      00019190
        CALL SKRIV_INNT(16,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019200
                                                                        00019210
     IF S001I02O.MRK17O = '*' THEN                                      00019220
        CALL SKRIV_INNT(17,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019230
                                                                        00019240
     IF S001I02O.MRK18O = '*' THEN                                      00019250
        CALL SKRIV_INNT(18,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019260
                                                                        00019270
     IF S001I02O.MRK19O = '*' THEN                                      00019280
        CALL SKRIV_INNT(19,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019290
                                                                        00019300
     IF S001I02O.MRK20O = '*' THEN                                      00019310
        CALL SKRIV_INNT(20,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019320
                                                                        00019330
     IF S001I02O.MRK21O = '*' THEN                                      00019340
        CALL SKRIV_INNT(21,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019350
                                                                        00019360
     IF S001I02O.MRK22O = '*' THEN                                      00019370
        CALL SKRIV_INNT(22,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019380
                                                                        00019390
     IF S001I02O.MRK23O = '*' THEN                                      00019400
        CALL SKRIV_INNT(23,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019410
                                                                        00019420
     IF S001I02O.MRK24O = '*' THEN                                      00019430
        CALL SKRIV_INNT(24,INNT_ALDER_TIL,INNT_ALDER_FRA);              00019440
                                                                        00019450
  END OVERFØR_INNTEKTER;                                                00019460
                                                                        00019470
    %PAGE;                                                              00019480
    /* ************************************************************** */00019490
    /*                                                                */00019500
    /* PROCEDURE FOR Å LEGGE INN UNDERLIGGENDE SEGM. TIL ROT-SEGM.    */00019510
    /*                                                                */00019520
    /* ************************************************************** */00019530
                                                                        00019540
  P10_SKRIV_PINNTEKT:                                                   00019550
    PROC;                                                               00019560
                                                                        00019570
      SSA1_PINNTEKT.ÅR                 =     W02_PI_ÅR         ;        00019580
      SSA1_PINNTEKT.TYPE               =     W02_PI_TYPE       ;        00019590
                                                                        00019600
      CALL PLITDLI                          (W02_PARM_CT_5,             00019610
                                             W02_ISRT,                  00019620
                                             RF1,                       00019630
                                             W01_PINT,                  00019640
                                             SSA1_RF0PERSN,             00019650
                                             SSA_UQUAL_PINNTEKT);       00019660
                                                                        00019670
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN          00019680
        DO;                                                             00019690
           /* ******************************************** */           00019700
           /* FEIL VED SKRIV AV :  PINNTEKT                */           00019710
           /* ******************************************** */           00019720
  L105:                                                                 00019730
           FEIL_MELD_NR                =    500 ;                       00019740
           FEIL_VED_LABEL              =   '105';                       00019750
           GO   TO  RETUR;                                              00019760
        END;                                                            00019770
                                                                        00019780
      IF   RF1.STATUS_KODE             =   'II'    THEN                 00019790
        DO;                                                             00019800
           SSA1_RF0PERSN.PKEY               =     TIL_FNR;              00019810
           SSA1_PINNTEKT.ÅR                 =     W02_PI_ÅR         ;   00019820
           SSA1_PINNTEKT.TYPE               =     W02_PI_TYPE       ;   00019830
                                                                        00019840
          /* ******************************************** */            00019850
          /* SAMME PINNTEKT LIGGER INNE FRA FØR           */            00019860
          /* DETTE FJERNES FØR DET NYE LEGGES INN.        */            00019870
          /* ******************************************** */            00019880
                                                                        00019890
          CALL PLITDLI                        (W02_PARM_CT_5,           00019900
                                               W02_GHU,                 00019910
                                               RF1,                     00019920
                                               W01_IO,                  00019930
                                               SSA1_RF0PERSN,           00019940
                                               SSA1_PINNTEKT);          00019950
                                                                        00019960
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                00019970
            ! RF1.STATUS_KODE         ^=       '  '         THEN        00019980
            DO;                                                         00019990
              /* ******************************************** */        00020000
              /* FEIL VED LES   AV :  PINNTEKT                */        00020010
              /* ******************************************** */        00020020
  L110:                                                                 00020030
              FEIL_MELD_NR             =       500 ;                    00020040
              FEIL_VED_LABEL           =      '110';                    00020050
              DB_STATUS_KODE           =       RF1.STATUS_KODE;         00020060
              GO   TO  RETUR;                                           00020070
            END;                                                        00020080
                                                                        00020090
                                                                        00020100
          /* ******************************************** */            00020110
          /* KALLET GHU GIKK OK . DELETER PINNTEKT        */            00020120
          /* ******************************************** */            00020130
                                                                        00020140
          CALL PLITDLI                        (W02_PARM_CT_3,           00020150
                                               W02_DLET,                00020160
                                               RF1,                     00020170
                                               W01_IO);                 00020180
                                                                        00020190
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                00020200
            ! RF1.STATUS_KODE         ^=       '  '         THEN        00020210
            DO;                                                         00020220
              /* ******************************************** */        00020230
              /* FEIL VED DELETE  AV :  PINNTEKT              */        00020240
              /* ******************************************** */        00020250
  L120:                                                                 00020260
              FEIL_MELD_NR             =       500 ;                    00020270
              FEIL_VED_LABEL           =      '120';                    00020280
              DB_STATUS_KODE           =       RF1.STATUS_KODE;         00020290
              GO   TO  RETUR;                                           00020300
            END;                                                        00020310
                                                                        00020320
                                                                        00020330
          /* ************************************************* */       00020340
          /* GML. PINNTEKT ER FJERNET . DET NYE LEGGES INN     */       00020350
          /* ************************************************* */       00020360
                                                                        00020370
          CALL PLITDLI                        (W02_PARM_CT_5,           00020380
                                               W02_ISRT,                00020390
                                               RF1,                     00020400
                                               W01_PINT,                00020410
                                               SSA1_RF0PERSN,           00020420
                                               SSA_UQUAL_PINNTEKT);     00020430
                                                                        00020440
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                00020450
            ! RF1.STATUS_KODE         ^=       '  '         THEN        00020460
            DO;                                                         00020470
              /* ******************************************** */        00020480
              /* FEIL VED SKRIV AV :  PINNTEKT                */        00020490
              /* ******************************************** */        00020500
  L130:                                                                 00020510
              FEIL_MELD_NR             =    500              ;          00020520
              FEIL_VED_LABEL           =   '130'             ;          00020530
              DB_STATUS_KODE           =    RF1.STATUS_KODE  ;          00020540
              GO   TO  RETUR;                                           00020550
            END;                                                        00020560
                                                                        00020570
                                                                        00020580
        END;                                                            00020590
      ELSE                                                              00020600
         IF  RF1.STATUS_KODE           ^=       '  '         THEN       00020610
             DO;                                                        00020620
             /* ************************************************/       00020630
             /* RF1.STATUS_KODE ^= 'II','  ' EL 'GE'): DB-FEIL */       00020640
             /* ************************************************/       00020650
  L135:                                                                 00020660
                FEIL_MELD_NR                =    500 ;                  00020670
                FEIL_VED_LABEL              =   '135';                  00020680
                DB_STATUS_KODE              =    RF1.STATUS_KODE;       00020690
                GO   TO  RETUR;                                         00020700
             END;                                                       00020710
  RETUR:                                                                00020720
                                                                        00020730
  END P10_SKRIV_PINNTEKT;                                               00020740
                                                                        00020750
                                                                        00020760
                                                                        00020770
  P20_FJERN_PINNTEKT:                                                   00020780
     PROC;                                                              00020790
                                                                        00020800
  /* **************************************************************** */00020810
  /*HENSIKT:                                                          */00020820
  /*    FJERNER PINNTEKT FOR FRA_FNR ETTER AT INNTEKTENE ER           */00020830
  /*    OVERFØRT TIL TIL_FNR.                                         */00020840
  /*                                                                  */00020850
  /*BRUK:                                                             */00020860
  /*    CALL P20_FJERN_PINNTEKT;                                      */00020870
  /*                                                                  */00020880
  /* **************************************************************** */00020890
                                                                        00020900
      SSA1_PINNTEKT.ÅR                 =     W02_PI_ÅR;                 00020910
      SSA1_PINNTEKT.TYPE               =     W02_PI_TYPE;               00020920
                                                                        00020930
    /* ************************************************************** */00020940
    /* TAR ET GHU-KALL,FØR DLET.                                      */00020950
    /* ************************************************************** */00020960
                                                                        00020970
                                                                        00020980
      CALL PLITDLI                        (W02_PARM_CT_5,               00020990
                                           W02_GHU,                     00021000
                                           RF1,                         00021010
                                           W01_PINT,                    00021020
                                           SSA1_RF0PERSN,               00021030
                                           SSA1_PINNTEKT);              00021040
                                                                        00021050
                                                                        00021060
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                    00021070
          ! RF1.STATUS_KODE         ^=       '  '         THEN          00021080
          DO;                                                           00021090
              /* ******************************************** */        00021100
              /* FEIL VED LES   AV :  PINNTEKT                */        00021110
              /* ******************************************** */        00021120
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(14)            00021130
                                                         ACCUM PAGING;  00021140
  L140:                                                                 00021150
             FEIL_MELD_NR             =       500 ;                     00021160
             FEIL_VED_LABEL           =      '140';                     00021170
             DB_STATUS_KODE           =       RF1.STATUS_KODE;          00021180
             GO   TO  RETUR;                                            00021190
          END;                                                          00021200
                                                                        00021210
                                                                        00021220
       /* ******************************************** */               00021230
       /* KALLET GHU GIKK OK . DELETER PINNTEKT        */               00021240
       /* ******************************************** */               00021250
                                                                        00021260
       CALL PLITDLI                        (W02_PARM_CT_3,              00021270
                                           W02_DLET,                    00021280
                                           RF1,                         00021290
                                           W01_PINT);                   00021300
                                                                        00021310
       IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                   00021320
         ! RF1.STATUS_KODE         ^=       '  '         THEN           00021330
         DO;                                                            00021340
              /* ******************************************** */        00021350
              /* FEIL VED DELETE  AV :  PINNTEKT              */        00021360
              /* ******************************************** */        00021370
  L145:                                                                 00021380
            FEIL_MELD_NR             =       500 ;                      00021390
            FEIL_VED_LABEL           =      '145';                      00021400
            DB_STATUS_KODE           =       RF1.STATUS_KODE;           00021410
            GO   TO  RETUR;                                             00021420
         END;                                                           00021430
                                                                        00021440
                                                                        00021450
    /* ************************************************************** */00021460
    /* SJEKKER OM DET ER FLERE SEGMENTER UNDER ROT.                   */00021470
    /* HVIS IKKE,FJERNES ROT.                                         */00021480
    /* TAR ET GU-KALL,FØR GNP.                                       */ 00021490
    /* ************************************************************** */00021500
                                                                        00021510
                                                                        00021520
      CALL PLITDLI                        (W02_PARM_CT_4,               00021530
                                           W02_GU,                      00021540
                                           RF1,                         00021550
                                           W01_IO,                      00021560
                                           SSA1_RF0PERSN);              00021570
                                                                        00021580
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK !                  00021590
          RF1.STATUS_KODE         ^=       '  '             THEN        00021600
          DO;                                                           00021610
              /* ******************************************** */        00021620
              /* FEIL VED LES   AV :  ROT                     */        00021630
              /* ******************************************** */        00021640
  L150:                                                                 00021650
             FEIL_MELD_NR             =       500 ;                     00021660
             FEIL_VED_LABEL           =      '150';                     00021670
             GO   TO  RETUR;                                            00021680
          END;                                                          00021690
                                                                        00021700
      CALL PLITDLI                        (W02_PARM_CT_3,               00021710
                                           W02_GNP,                     00021720
                                           RF1,                         00021730
                                           W01_IO);                     00021740
                                                                        00021750
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK THEN               00021760
          DO;                                                           00021770
              /* ******************************************** */        00021780
              /* FEIL VED LES   AV :  ROT                     */        00021790
              /* ******************************************** */        00021800
  L155:                                                                 00021810
             FEIL_MELD_NR             =       500 ;                     00021820
             FEIL_VED_LABEL           =      '155';                     00021830
             GO   TO  RETUR;                                            00021840
          END;                                                          00021850
      ELSE                                                              00021860
         IF RF1.STATUS_KODE           =   'GE'             THEN         00021870
            DO;                                                         00021880
                                                                        00021890
                                                                        00021900
    /* ************************************************************** */00021910
    /* TAR ET GHU-KALL,FØR DLET.                                      */00021920
    /* ************************************************************** */00021930
                                                                        00021940
               CALL PLITDLI                        (W02_PARM_CT_4,      00021950
                                                    W02_GHU,            00021960
                                                    RF1,                00021970
                                                    W01_IO,             00021980
                                                    SSA1_RF0PERSN);     00021990
                                                                        00022000
               IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK !         00022010
                   RF1.STATUS_KODE         ^=       '  '    THEN        00022020
                   DO;                                                  00022030
              /* ******************************************** */        00022040
              /* FEIL VED LES   AV :  ROT                     */        00022050
              /* ******************************************** */        00022060
  L160:                                                                 00022070
                      FEIL_MELD_NR             =       500 ;            00022080
                      FEIL_VED_LABEL           =      '160';            00022090
                      GO   TO  RETUR;                                   00022100
                   END;                                                 00022110
                                                                        00022120
                                                                        00022130
       /* ******************************************** */               00022140
       /* BARE ROT IGJEN.ROT FJERNES.                  */               00022150
       /* ******************************************** */               00022160
                                                                        00022170
               CALL PLITDLI                       (W02_PARM_CT_3,       00022180
                                                   W02_DLET,            00022190
                                                   RF1,                 00022200
                                                   W01_IO);             00022210
                                                                        00022220
               IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK           00022230
                 ! RF1.STATUS_KODE         ^=       '  '         THEN   00022240
                   DO;                                                  00022250
              /* ******************************************** */        00022260
              /* FEIL VED DELETE  AV :  ROT                   */        00022270
              /* ******************************************** */        00022280
  L165:                                                                 00022290
                      FEIL_MELD_NR             =       500 ;            00022300
                      FEIL_VED_LABEL           =      '165';            00022310
                      DB_STATUS_KODE           =       RF1.STATUS_KODE; 00022320
                      GO   TO  RETUR;                                   00022330
                   END;                                                 00022340
            END;                                                        00022350
                                                                        00022360
  RETUR:                                                                00022370
                                                                        00022380
  END P20_FJERN_PINNTEKT;                                               00022390
                                                                        00022400
                                                                        00022410
                                                                        00022420
                                                                        00022430
                                                                        00022440
    %PAGE;                                                              00022450
    /* ************************************************************** */00022460
    /*                                                                */00022470
    /* PROCEDURE FOR LESE ROT-SEGM GU QUAL.                           */00022480
    /*                                                                */00022490
    /* ************************************************************** */00022500
                                                                        00022510
    P005_LES_ROT_QUAL_FNR:                                              00022520
      PROC;                                                             00022530
                                                                        00022540
      CALL PLITDLI                              (W02_PARM_CT_4,         00022550
                                                 W02_GU,                00022560
                                                 RF1,                   00022570
                                                 RF0PERSN,              00022580
                                                 SSA1_RF0PERSN);        00022590
                                                                        00022600
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00022610
        DO;                                                             00022620
          SELECT  ( RF1.STATUS_KODE );                                  00022630
                                                                        00022640
            WHEN  ( '  ' )                                              00022650
              W01.MER_DATA                 =    '1'B;                   00022660
                                                                        00022670
            WHEN  ( 'GE' )                                              00022680
              W01.MER_DATA                 =    '0'B;                   00022690
                                                                        00022700
            OTHERWISE                                                   00022710
              DO;                                                       00022720
                /* ************************************************** */00022730
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00022740
                /* ************************************************** */00022750
  L170:                                                                 00022760
                FEIL_MELD_NR               =     500;                   00022770
                FEIL_VED_LABEL             =    '170';                  00022780
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00022790
                W01.MER_DATA               =    '0'B;                   00022800
              END;                                                      00022810
          END;                                                          00022820
        END;                                                            00022830
      ELSE                                                              00022840
        DO;                                                             00022850
          /* ************************************************** */      00022860
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00022870
          /* ************************************************** */      00022880
  L180:                                                                 00022890
          FEIL_MELD_NR               =     500;                         00022900
          FEIL_VED_LABEL             =    '180';                        00022910
          W01.MER_DATA               =    '0'B;                         00022920
        END;                                                            00022930
                                                                        00022940
                                                                        00022950
    END P005_LES_ROT_QUAL_FNR;                                          00022960
                                                                        00022970
                                                                        00022980
                                                                        00022990
                                                                        00023000
    %PAGE;                                                              00023010
    /* ************************************************************** */00023020
    /*                                                                */00023030
    /* PROCEDURE FOR LESE INNT-SEGM GN QUAL.                          */00023040
    /*                                                                */00023050
    /* ************************************************************** */00023060
                                                                        00023070
    P010_LES_INNT_QUAL:                                                 00023080
      PROC;                                                             00023090
                                                                        00023100
                                                                        00023110
      CALL PLITDLI                          (W02_PARM_CT_4,             00023120
                                             W02_GNP,                   00023130
                                             RF1,                       00023140
                                             W01_PINT,                  00023150
                                             SSA1_PINNTEKT);            00023160
                                                                        00023170
                                                                        00023180
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00023190
        DO;                                                             00023200
          SELECT  ( RF1.STATUS_KODE );                                  00023210
                                                                        00023220
            WHEN  ( '  ' )                                              00023230
              W01.MER_DATA                 =    '1'B;                   00023240
                                                                        00023250
            WHEN  ( 'GE' )                                              00023260
              W01.MER_DATA                 =    '0'B;                   00023270
                                                                        00023280
            OTHERWISE                                                   00023290
              DO;                                                       00023300
                /* ************************************************** */00023310
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00023320
                /* ************************************************** */00023330
  L190:                                                                 00023340
                FEIL_MELD_NR               =     500;                   00023350
                FEIL_VED_LABEL             =    '190';                  00023360
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00023370
                W01.MER_DATA               =    '0'B;                   00023380
              END;                                                      00023390
          END;                                                          00023400
        END;                                                            00023410
      ELSE                                                              00023420
        DO;                                                             00023430
          /* ************************************************** */      00023440
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00023450
          /* ************************************************** */      00023460
  L200:                                                                 00023470
          FEIL_MELD_NR               =     500;                         00023480
          FEIL_VED_LABEL             =    '200';                        00023490
          W01.MER_DATA               =    '0'B;                         00023500
        END;                                                            00023510
                                                                        00023520
                                                                        00023530
    END P010_LES_INNT_QUAL;                                             00023540
                                                                        00023550
                                                                        00023560
                                                                        00023570
    /* ************************************************************** */00023580
    /*                                                                */00023590
    /* PROCEDURE FOR LESE NESTE PINNTEKT (GNP   UKVALIFISERT  )       */00023600
    /*                                                                */00023610
    /* ************************************************************** */00023620
                                                                        00023630
    P020_LES_NESTE_PINNTEKT_FNR:                                        00023640
      PROC;                                                             00023650
                                                                        00023660
      CALL PLITDLI                              (W02_PARM_CT_4,         00023670
                                                 W02_GNP,               00023680
                                                 RF1,                   00023690
                                                 W01_PINT,              00023700
                                                 SSA_UQUAL_PINNTEKT);   00023710
                                                                        00023720
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00023730
        DO;                                                             00023740
          SELECT ( RF1.STATUS_KODE );                                   00023750
                                                                        00023760
            WHEN ( '  ' )                                               00023770
              W01.MER_DATA                 =    '1'B;                   00023780
                                                                        00023790
            WHEN ( 'GE' , 'GB' )                                        00023800
              W01.MER_DATA                 =    '0'B;                   00023810
                                                                        00023820
            OTHERWISE                                                   00023830
              DO;                                                       00023840
                /* ************************************************** */00023850
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00023860
                /* ************************************************** */00023870
  L210:                                                                 00023880
                FEIL_MELD_NR               =     500;                   00023890
                FEIL_VED_LABEL             =    '210';                  00023900
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00023910
                W01.MER_DATA               =    '0'B;                   00023920
              END;                                                      00023930
          END;                                                          00023940
        END;                                                            00023950
      ELSE                                                              00023960
        DO;                                                             00023970
          /* ************************************************** */      00023980
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00023990
          /* ************************************************** */      00024000
  L215:                                                                 00024010
          FEIL_MELD_NR               =     500;                         00024020
          FEIL_VED_LABEL             =    '215';                        00024030
          W01.MER_DATA               =    '0'B;                         00024040
        END;                                                            00024050
                                                                        00024060
                                                                        00024070
    END P020_LES_NESTE_PINNTEKT_FNR;                                    00024080
                                                                        00024090
                                                                        00024100
                                                                        00024110
    %PAGE;                                                              00024120
    /* ************************************************************** */00024130
    /*                                                                */00024140
    /* PROCEDURE SOM OPPRETTER ROT.                                   */00024150
    /*                                                                */00024160
    /* ************************************************************** */00024170
                                                                        00024180
    P030_OPPRETT_ROT:                                                   00024190
      PROC;                                                             00024200
                                                                        00024210
      RF0PERSN.FNR                         =     TIL_FNR            ;   00024220
                                                                        00024230
      CALL PLITDLI                              (W02_PARM_CT_4,         00024240
                                                 W02_ISRT,              00024250
                                                 RF1,                   00024260
                                                 RF0PERSN,              00024270
                                                 SSA_UQUAL_ROT);        00024280
                                                                        00024290
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00024300
        DO;                                                             00024310
          SELECT  ( RF1.STATUS_KODE );                                  00024320
                                                                        00024330
            WHEN  ( '  ' )                                              00024340
              W01.MER_DATA                 =    '1'B;                   00024350
                                                                        00024360
            OTHERWISE                                                   00024370
              DO;                                                       00024380
                /* ************************************************** */00024390
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00024400
                /* ************************************************** */00024410
  L230:                                                                 00024420
                FEIL_MELD_NR               =     500;                   00024430
                FEIL_VED_LABEL             =    '230';                  00024440
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00024450
                W01.MER_DATA               =    '0'B;                   00024460
              END;                                                      00024470
          END;                                                          00024480
        END;                                                            00024490
      ELSE                                                              00024500
        DO;                                                             00024510
          /* ************************************************** */      00024520
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00024530
          /* ************************************************** */      00024540
  L240:                                                                 00024550
          FEIL_MELD_NR               =     500;                         00024560
          FEIL_VED_LABEL             =    '240';                        00024570
          W01.MER_DATA               =    '0'B;                         00024580
        END;                                                            00024590
                                                                        00024600
                                                                        00024610
    END P030_OPPRETT_ROT;                                               00024620
                                                                        00024630
                                                                        00024640
                                                                        00024650
                                                                        00024660
    /* ************************************************************** */00024670
    /*                                                                */00024680
    /* PROCEDURE FOR FINNE RETT TKNR .   (GU KVAL. PÅ ROT OG PINNTEKT)*/00024690
    /*                                                                */00024700
    /*     TKNR FINNES VED 1. OG SJEKKE OM ROTSEGM. FNR > 0  . ER DET */00024710
    /*     IKKE DET BENYTTES KOMMNR. I SISTE INNTEKTS-SEGM.           */00024720
    /*                                                                */00024730
    /* ************************************************************** */00024740
                                                                        00024750
    F100_FINN_TKNR:                                                     00024760
      PROC            ( W100_FNR)   RETURNS (FIXED DEC(4))            ; 00024770
                                                                        00024780
      DCL W100_FNR      FIXED DEC   (11)                              , 00024790
          W100_TKNR     FIXED DEC   ( 4)     INIT     (0)             ; 00024800
                                                                        00024810
                                                                        00024820
      SSA1_RF0PERSN.PKEY                  =      W100_FNR             ; 00024830
      CALL P005_LES_ROT_QUAL_FNR;                                       00024840
                                                                        00024850
                                                                        00024860
                                                                        00024870
      IF RF0PERSN.TKNR                    >      0                THEN  00024880
         W100_TKNR                        =      RF0PERSN.TKNR        ; 00024890
      ELSE                                                              00024900
         DO;                                                            00024910
            CALL PLITDLI                        (W02_PARM_CT_4,         00024920
                                                 W02_GNP,               00024930
                                                 RF1,                   00024940
                                                 W01_PINT,              00024950
                                                 SSA_UQUAL_PINNTEKT_L); 00024960
                                                                        00024970
            IF   UIBFCTR                   =     UIB_RC_OK    THEN      00024980
              DO;                                                       00024990
                 SELECT ( RF1.STATUS_KODE );                            00025000
                                                                        00025010
                    WHEN ( '  ' )                                       00025020
                        W100_TKNR          =     W01_PINT.W02_PI_KOMMNR;00025030
                                                                        00025040
                    WHEN ( 'GE' , 'GB' );                               00025050
                                                                        00025060
                    OTHERWISE                                           00025070
                                                                        00025080
                       /* ******************************************* */00025090
                       /*UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES*/00025100
                       /* ******************************************* */00025110
                       DO;                                              00025120
  L250:                                                                 00025130
                          FEIL_MELD_NR         =     500;               00025140
                          FEIL_VED_LABEL       =    '250';              00025150
                          DB_STATUS_KODE       =     RF1.STATUS_KODE;   00025160
                       END;                                             00025170
                 END;                                                   00025180
              END;                                                      00025190
            ELSE                                                        00025200
              DO;                                                       00025210
                 /* ******************************************* */      00025220
                 /* UIB'S RETUR-CODE ER UAKSEPTABEL             */      00025230
                 /* ******************************************* */      00025240
  L260:                                                                 00025250
                  FEIL_MELD_NR               =     500;                 00025260
                  FEIL_VED_LABEL             =    '260';                00025270
              END;                                                      00025280
         END;                                                           00025290
                                                                        00025300
      RETURN (W100_TKNR);                                               00025310
                                                                        00025320
                                                                        00025330
    END F100_FINN_TKNR;                                                 00025340
                                                                        00025350
                                                                        00025360
                                                                        00025370
                                                                        00025380
                                                                        00025390
                                                                        00025400
                                                                        00025410
                                                                        00025420
  PF2:                                                                  00025430
                                                                        00025440
     MAP_MELDING              = 'TRANSAKSJONEN FORKASTET';              00025450
     FEILMELDING_SATT         = '1'B;                                   00025460
     S001I01I.STYREKODEL      = -1;     /* CURSOR POS */                00025470
     S001I01O.CICS_INFOO      = CICSINFO;                               00025480
     S001I01O.MELDINGO        = MAP_MELDING;                            00025490
                                                                        00025500
     EXEC CICS SEND MAP('S001I01')                                      00025510
                                       MAPSET('S001I13') CURSOR ERASE;  00025520
                                                                        00025530
     TRANSKODE = 'R0I1';                                                00025540
     EXEC CICS RETURN TRANSID(TRANSKODE)                                00025550
                                         COMMAREA(KOM_OMR);             00025560
                                                                        00025570
                                                                        00025580
                                                                        00025590
  ERRBEH:                                                               00025600
     EXEC CICS HANDLE CONDITION ERROR;                                  00025610
     EXEC CICS PURGE MESSAGE;                                           00025620
     EXEC CICS ABEND ABCODE('FEIL');                                    00025630
                                                                        00025640
                                                                        00025650
                                                                        00025660
  SKRIV_FEILMELDING:                                                    00025670
     PROC;                                                              00025680
                                                                        00025690
  /* **************************************************************** */00025700
  /*HENSIKT:                                                          */00025710
  /*    GIR UT FEILMELDING.                                           */00025720
  /*                                                                  */00025730
  /*                                                                  */00025740
  /*BRUK:                                                             */00025750
  /*    CALL SKRIV_FEILMELDING;                                       */00025760
  /*                                                                  */00025770
  /* **************************************************************** */00025780
                                                                        00025790
                                                                        00025800
  IF TERMINERINGS_IND = FATAL_FEIL THEN                                 00025810
     DO;                                                                00025820
        EXEC CICS PURGE MESSAGE;                                        00025830
        FEIL_MELDING = 'PROGRAM ' !! DIV_PARAM_OMR.PROGRAM_ID !!        00025840
                               ' GÅR I FEIL VED LABEL NR. '        !!   00025850
                                        DIV_PARAM_OMR.FEIL_VED_LABEL;   00025860
        EXEC CICS SEND TEXT FROM (FEIL_MELDING) ACCUM ERASE PAGING      00025870
                                                           JUSTIFY(10); 00025880
                                                                        00025890
        FEIL_STRUC.KOM_OMR_PEKER = COMMAREA_PEKER;                      00025900
        FEIL_STRUC.FEIL_NR       = FEIL_MELD_NR;                        00025910
        EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC);        00025920
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(14)            00025930
                                                         ACCUM PAGING;  00025940
                                                                        00025950
        IF FEIL_MELD_NR        =     500              THEN              00025960
           DO;                                                          00025970
                                                                        00025980
              /* *************************************************** */ 00025990
              /*     DATA-BASE FEIL . RETUR_KODEN LEGGES UT .        */ 00026000
              /* *************************************************** */ 00026010
                                                                        00026020
              FEIL_MELDING     =  '  RETUR_KODE   =  '                  00026030
                      !! DIV_PARAM_OMR.DB_STATUS_KODE !! UIBFCTR ;      00026040
              EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM            00026050
                                               PAGING   JUSTIFY (18);   00026060
           END;                                                         00026070
                                                                        00026080
        ELSE                                                            00026090
           IF FEIL_MELD_NR   =     499              THEN                00026100
              DO;                                                       00026110
                                                                        00026120
               /* *************************************************** */00026130
               /*     PERSON ER UNDER BEHANDLING AV EN ANNEN TRANS    */00026140
               /* *************************************************** */00026150
                                                                        00026160
                                                                        00026170
                 FNR_PIC          =  DIV_PARAM_OMR.SEARCH_FNR  ;        00026180
                 FEIL_MELDING     =  '  FNR  =  ' !!  FNR_CHAR ;        00026190
                 EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM         00026200
                                                  PAGING   JUSTIFY (18);00026210
              END;                                                      00026220
                                                                        00026230
        FEIL_MELDING = 'TASKEN BLIR KANSELERT !!!!     ' !!             00026240
                                  'INGEN OPPDATERING ER BLITT UTFØRT. ';00026250
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(22)            00026260
                                                           ACCUM PAGING;00026270
        EXEC CICS SEND PAGE;                                            00026280
                                                                        00026290
        /******** NB!   NB! TASKEN BLIR KANSELERT  ********/            00026300
                                                                        00026310
         EXEC CICS ABEND                                                00026320
                     ABCODE(STOP);                                      00026330
     END;                                                               00026340
                                                                        00026350
  END SKRIV_FEILMELDING;                                                00026360
                                                                        00026370
                                                                        00026380
                                                                        00026390
  /* **************************************************************** */00026400
  /*                                                                  */00026410
  /*  PROCEDURE FOR Å FLYTTE DATA FRA BLANKETTOMR TIL SEGM,           */00026420
  /*  SKRIVE TIL-FNR-OPPL,FJERNE FRA-FNR_OPPLY OG KALLE OMREGNING.    */00026430
  /*                                                                  */00026440
  /* **************************************************************** */00026450
  /*                                                                    00026460
  */                                                                    00026470
  SKRIV_INNT:                                                           00026480
   PROC(I,INNT_ALDER_TIL,INNT_ALDER_FRA);                               00026490
                                                                        00026500
                                                                        00026510
   DCL I                                  PIC '99';                     00026520
   DCL INNT_ALDER                         PIC '99';                     00026530
   DCL FNR                                PIC '(11)9';                  00026540
   DCL FNR_ÅRH                            PIC '9'  DEF FNR POS(7);      00026550
   DCL FNR_ÅR                             PIC '99' DEF FNR POS(5);      00026560
   DCL INNT_ALDER_TIL                     CHAR(2);                      00026570
   DCL INNT_ALDER_FRA                     CHAR(2);                      00026580
                                                                        00026590
   W02_PI_ÅR           = W02.TAB_PI_ÅR      (I);                        00026600
   W02_PI_KODE         = W02.TAB_PI_KODE    (I);                        00026610
   W02_PI              = W02.TAB_PI         (I);                        00026620
   W02_PI_KOMMNR       = W02.TAB_PI_KOMMNR  (I);                        00026630
   W02_PI_RAPPDATO     = W02.TAB_PI_RAPPDATO(I);                        00026640
                                                                        00026650
   SSA1_RF0PERSN.PKEY  = TIL_FNR;                                       00026660
   FNR                 = TIL_FNR;                                       00026670
                                                                        00026680
   CALL P10_SKRIV_PINNTEKT;                                             00026690
                                                                        00026700
                                                                        00026710
  SKRIV_LISTEDATA:                                                      00026720
                                                                        00026730
  /* **************************************************************** */00026740
  /*HENSIKT:                                                          */00026750
  /*    SKRIVER OPPLYSNINGER UT PÅ R001.OLINNTE FOR BRUK VED UTSKRIFT */00026760
  /*    AV KONTROLLISTE.                                              */00026770
  /*                                                                  */00026780
  /*BRUK:                                                             */00026790
  /*    CALL SKRIV_LISTEDATA;                                         */00026800
  /*                                                                  */00026810
  /* **************************************************************** */00026820
                                                                        00026830
                                                                        00026840
   DCL                                                                  00026850
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00026860
      KEY_PEKER                  POINTER    ,                           00026870
      KEY_RECL                   CHAR (97)  ,                           00026880
      KEY                        CHAR (41)  ;                           00026890
   DCL                                                                  00026900
      LISTE_RECL                 CHAR(97)   ;                           00026910
   DCL                                                                  00026920
      01 REC_OMR  DEF LISTE_RECL,                                       00026930
         02 KONTOR               CHAR(3)    ,                           00026940
         02 TERMID               CHAR(4)    ,                           00026950
         02 FNR                  PIC '(11)9',                           00026960
         02 REGTPK               CHAR(6)    ,                           00026970
         02 IÅR                  PIC '(2)9' ,                           00026980
         02 BLTYPE               CHAR(1)    ,                           00026990
         02 IART                 CHAR(1)    ,                           00027000
         02 KOMMNR1              PIC '(4)9' ,                           00027010
         02 AGIVNR               PIC '(3)9' ,                           00027020
         02 RAPPDATO             PIC '(6)9' ,                           00027030
         02 NAVN                 CHAR(25)   ,                           00027040
         02 INNTEKT              PIC '(7)9' ,                           00027050
         02 ETYPE                CHAR(1)    ,                           00027060
         02 MERKE                CHAR(1)    ,                           00027070
         02 DÅR                  PIC '(2)9' ,                           00027080
         02 KOMMNR2              PIC '(2)9' ,                           00027090
         02 KOMMNR3              CHAR(2),                               00027100
         02 BRUKERID             CHAR(4)    ,                           00027110
         02 FNR2                 PIC '(11)9',                           00027120
         02 INDEKS               CHAR(1)    ;                           00027130
   DCL                                                                  00027140
      01 HDATO                   PIC '(6)9';                            00027150
   DCL                                                                  00027160
      01 HDATO_REDEF DEF HDATO,                                         00027170
         02 ÅR                   PIC '(2)9',                            00027180
         02 MND                  PIC '(2)9',                            00027190
         02 DAG                  PIC '(2)9';                            00027200
   DCL                                                                  00027210
      01 NYKKEL     DEF KEY,                                            00027220
         02 KONTOR_N             CHAR(3)    ,                           00027230
         02 TERMID_N             CHAR(4)    ,                           00027240
         02 FNR_N                PIC '(11)9',                           00027250
         02 REGTPK_N             CHAR(6)    ,                           00027260
         02 IÅR_N                PIC '(2)9' ,                           00027270
         02 BLTYPE_N             CHAR(1)    ,                           00027280
         02 IART_N               CHAR(1)    ,                           00027290
         02 KOMMNR1_N            PIC '(4)9' ,                           00027300
         02 AGIVNR_N             PIC '(3)9' ,                           00027310
         02 RAPPDATO_N           PIC '(6)9' ;                           00027320
   DCL                                                                  00027330
      01 DATO                    PIC '(6)9';                            00027340
   DCL                                                                  00027350
      01 DATO_REDEF DEF DATO,                                           00027360
         02 DAG                  PIC '(2)9',                            00027370
         02 MND                  PIC '(2)9',                            00027380
         02 ÅR                   PIC '(2)9';                            00027390
                                                                        00027400
   DCL                                                                  00027410
        (DATE, TIME)             BUILTIN;                               00027420
   DCL                                                                  00027430
      01 W02_BLTYPE              CHAR(1),                               00027440
      01 W02_ART                 CHAR(1);                               00027450
                                                                        00027460
                                                                        00027470
                                                                        00027480
   DCL 1  TID,                                                          00027490
          2  TID1                          CHAR (6), /* TT,MM,.SEK    */00027500
          2  TID2                          CHAR (3); /* MILL.SEK.     */00027510
  DCL TID_D          DEFINED   TID         CHAR (9);                    00027520
                                                                        00027530
                                                                        00027540
                                                                        00027550
     SELECT(W02_PI_TYPE);                                               00027560
                                                                        00027570
        WHEN('B','C','D')                                               00027580
                                                                        00027590
           DO;                                                          00027600
              W02_BLTYPE = 'B';                                         00027610
                                                                        00027620
              IF W02_PI_TYPE = 'B' THEN                                 00027630
                 W02_ART    = '1';                                      00027640
              ELSE                                                      00027650
                 IF W02_PI_TYPE = 'C' THEN                              00027660
                    W02_ART    = '2';                                   00027670
                 ELSE                                                   00027680
                    IF W02_PI_TYPE = 'D' THEN                           00027690
                       W02_ART    = '3';                                00027700
           END;                                                         00027710
                                                                        00027720
        WHEN('E','F')                                                   00027730
                                                                        00027740
           DO;                                                          00027750
              W02_BLTYPE = 'C';                                         00027760
                                                                        00027770
              IF W02_PI_TYPE = 'E' THEN                                 00027780
                 W02_ART    = '1';                                      00027790
              ELSE                                                      00027800
                 IF W02_PI_TYPE = 'F' THEN                              00027810
                    W02_ART    = '2';                                   00027820
           END;                                                         00027830
                                                                        00027840
        WHEN('H','I')                                                   00027850
                                                                        00027860
           DO;                                                          00027870
              W02_BLTYPE = 'D';                                         00027880
                                                                        00027890
              IF W02_PI_TYPE = 'H' THEN                                 00027900
                 W02_ART    = '1';                                      00027910
              ELSE                                                      00027920
                 IF W02_PI_TYPE = 'I' THEN                              00027930
                    W02_ART    = '2';                                   00027940
           END;                                                         00027950
                                                                        00027960
        WHEN('S','T')                                                   00027970
                                                                        00027980
           DO;                                                          00027990
              W02_BLTYPE = 'S';                                         00028000
                                                                        00028010
              IF W02_PI_TYPE = 'S' THEN                                 00028020
                 W02_ART    = '1';                                      00028030
              ELSE                                                      00028040
                 IF W02_PI_TYPE = 'T' THEN                              00028050
                    W02_ART    = '2';                                   00028060
           END;                                                         00028070
                                                                        00028080
        WHEN('V','W')                                                   00028090
                                                                        00028100
           DO;                                                          00028110
              W02_BLTYPE = 'U';                                         00028120
                                                                        00028130
              IF W02_PI_TYPE = 'V' THEN                                 00028140
                 W02_ART    = '1';                                      00028150
              ELSE                                                      00028160
                 IF W02_PI_TYPE = 'W' THEN                              00028170
                    W02_ART    = '2';                                   00028180
           END;                                                         00028190
                                                                        00028200
        OTHERWISE                                                       00028210
           ;                                                            00028220
     END;                                                               00028230
                                                                        00028240
   /*   ENDERING      SATISH     29.08.88        */                     00028250
   /*  SKALL SKRIVE ALLE OPLISTING MED/UTEN GFNR-KODE         */        00028260
                                                                        00028270
   /* IF SUBSTR(DIV_PARAM_OMR.CICS_IND,2) = ' ' THEN          */        00028280
   /*    GO TO ALT_OK;                                        */        00028290
                                                                        00028300
   /*   ENDERING      SATISH     29.08.88        */                     00028310
      HDATO             = DATE();                                       00028320
      TID_D             = TIME  ;                                       00028330
                                                                        00028340
      DATO_REDEF.ÅR     = HDATO_REDEF.ÅR ;                              00028350
      DATO_REDEF.MND    = HDATO_REDEF.MND;                              00028360
      DATO_REDEF.DAG    = HDATO_REDEF.DAG;                              00028370
                                                                        00028380
      LISTE_RECL        = ''               ;                            00028390
      REC_OMR.KONTOR    = 'OVR'            ;                            00028400
      REC_OMR.TERMID    = EIBTRMID         ;                            00028410
      REC_OMR.FNR       = TIL_FNR          ;                            00028420
      REC_OMR.REGTPK    = TID1             ;                            00028430
      REC_OMR.IÅR       = W02_PI_ÅR        ;                            00028440
      REC_OMR.BLTYPE    = W02_BLTYPE       ;                            00028450
      REC_OMR.IART      = W02_ART          ;                            00028460
      REC_OMR.KOMMNR1   = W02_PI_KOMMNR    ;                            00028470
      REC_OMR.RAPPDATO  = DATO             ;                            00028480
      REC_OMR.NAVN      = 'OVERF. FRA ' !! FRA_FNR;                     00028490
      REC_OMR.INNTEKT   = W02_PI * 100     ;                            00028500
      REC_OMR.MERKE     = W02_PI_MERKE     ;                            00028510
      REC_OMR.AGIVNR    = 0                ;                            00028520
      REC_OMR.BRUKERID  = STYRINGS_OMR.BRUKERID;                        00028530
      REC_OMR.FNR2      = FRA_FNR          ;                            00028540
      REC_OMR.INDEKS    = '3'              ;                            00028550
      IF SUBSTR(DIV_PARAM_OMR.CICS_IND,2) = 'G' THEN                    00028560
      REC_OMR.KOMMNR3   = DIV_PARAM_OMR.CICS_IND ;                      00028570
                                                                        00028580
      NYKKEL.KONTOR_N   = 'OVR'            ;                            00028590
      NYKKEL.TERMID_N   = EIBTRMID         ;                            00028600
      NYKKEL.FNR_N      = TIL_FNR          ;                            00028610
      NYKKEL.REGTPK_N   = TID1             ;                            00028620
      NYKKEL.IÅR_N      = W02_PI_ÅR        ;                            00028630
      NYKKEL.IART_N     = W02_ART          ;                            00028640
      NYKKEL.BLTYPE_N   = W02_BLTYPE       ;                            00028650
      NYKKEL.KOMMNR1_N  = W02_PI_KOMMNR    ;                            00028660
      NYKKEL.AGIVNR_N   = 0                ;                            00028670
      NYKKEL.RAPPDATO_N = DATO             ;                            00028680
      KEY_PEKER         = ADDR(KEY)        ;                            00028690
      KEY_RECL          = LISTE_RECL       ;                            00028700
                                                                        00028710
                                                                        00028720
      EXEC CICS HANDLE CONDITION ERROR    (L125)             ;          00028730
      EXEC CICS HANDLE CONDITION DUPREC   (ALT_OK)           ;          00028740
      EXEC CICS WRITE  DATASET ('OLINNTE') RIDFLD  (KEY_BIT )           00028750
                                             FROM    (KEY_RECL);        00028760
      GOTO ALT_OK;                                                      00028770
                                                                        00028780
    L125:                                                               00028790
      FEIL_MELD_NR                =    505 ;                            00028800
      FEIL_VED_LABEL              =   '125';                            00028810
      FATAL_FEIL                  =   '1'B ;                            00028820
                                                                        00028830
    ALT_OK:                                                             00028840
                                                                        00028850
      IF FNR_ÅRH < 5 THEN                                               00028860
         INNT_ALDER      = W02_PI_ÅR - FNR_ÅR;                          00028870
      ELSE                                                              00028880
         INNT_ALDER      = W02_PI_ÅR + 100 - FNR_ÅR;                    00028890
                                                                        00028900
      IF INNT_ALDER = 66 THEN                                           00028910
         INNT_ALDER_TIL  = '66';                                        00028920
      ELSE                                                              00028930
         IF INNT_ALDER = 69 THEN                                        00028940
            INNT_ALDER_TIL  = '69';                                     00028950
                                                                        00028960
      IF FEIL_MELD_NR = 0 THEN                                          00028970
         DO;                                                            00028980
            SSA1_RF0PERSN.PKEY  = FRA_FNR;                              00028990
            FNR                 = FRA_FNR;                              00029000
                                                                        00029010
            CALL P20_FJERN_PINNTEKT;                                    00029020
                                                                        00029030
   /*   ENDERING      SATISH     29.08.88                         */    00029040
   /*        IF SUBSTR(DIV_PARAM_OMR.CICS_IND,2) ^= ' ' THEN      */    00029050
   /*             DO;                                             */    00029060
   /*   ENDERING      SATISH     29.08.88                         */    00029070
                  REC_OMR.FNR       = FRA_FNR          ;                00029080
                  REC_OMR.FNR2      = 0                ;                00029090
                  NYKKEL.FNR_N      = FRA_FNR          ;                00029100
                  REC_OMR.NAVN      = 'FJERNING VED OVERFØRING';        00029110
                  REC_OMR.MERKE     = ' '                      ;        00029120
                  REC_OMR.INDEKS    = '4'              ;                00029130
                  IF SUBSTR(DIV_PARAM_OMR.CICS_IND,2) = 'G' THEN        00029140
                    REC_OMR.KOMMNR3   = DIV_PARAM_OMR.CICS_IND ;        00029150
                  KEY_PEKER         = ADDR(KEY)        ;                00029160
                  KEY_RECL          = LISTE_RECL       ;                00029170
                                                                        00029180
                                                                        00029190
                  EXEC CICS HANDLE CONDITION ERROR    (L126);           00029200
                  EXEC CICS HANDLE CONDITION DUPREC   (ALT_OK2);        00029210
                  EXEC CICS WRITE  DATASET ('OLINNTE') RIDFLD (KEY_BIT) 00029220
                                           FROM    (KEY_RECL);          00029230
                  GOTO ALT_OK2;                                         00029240
                                                                        00029250
  L270:                                                                 00029260
                  FEIL_MELD_NR                =    505 ;                00029270
                  FEIL_VED_LABEL              =   '270';                00029280
                  FATAL_FEIL                  =   '1'B ;                00029290
                                                                        00029300
  ALT_OK2:                                                              00029310
                                                                        00029320
                  IF FNR_ÅRH                  <  5          THEN        00029330
                     INNT_ALDER       =  W02_PI_ÅR       - FNR_ÅR;      00029340
                  ELSE                                                  00029350
                     INNT_ALDER       =  W02_PI_ÅR + 100 - FNR_ÅR;      00029360
                                                                        00029370
                  IF INNT_ALDER       =  66                      THEN   00029380
                     INNT_ALDER_FRA           = '66';                   00029390
                  ELSE                                                  00029400
                     IF INNT_ALDER            =  69 THEN                00029410
                        INNT_ALDER_FRA        = '69';                   00029420
                                                                        00029430
          /* END; */                                                    00029440
      END;                                                              00029450
                                                                        00029460
                                                                        00029470
  END SKRIV_INNT;                                                       00029480
                                                                        00029490
                                                                        00029500
                                                                        00029510
  /* **************************************************************** */00029520
  /*                                                                  */00029530
  /*  PROCEDURE FOR Å ÅPNE OG LUKKE RF-DATABASEN.                     */00029540
  /*                                                                  */00029550
  /* **************************************************************** */00029560
                                                                        00029570
  DATABASE:                                                             00029580
   PROC(STYRING);                                                       00029590
                                                                        00029600
   DCL                                                                  00029610
     STYRING                               CHAR(5),                     00029620
     NULL                                  BUILTIN,                     00029630
     UNSPEC                                BUILTIN,                     00029640
     PLITDLI                               ENTRY;                       00029650
                                                                        00029660
                                                                        00029670
  /*------------------------------------------------------------------*/00029680
  /* DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-KALL   */00029690
  /*------------------------------------------------------------------*/00029700
                                                                        00029710
     DCL                                                                00029720
       W01_PSB_NAVN                CHAR (8)       INIT('B001R001');     00029730
     DCL                                                                00029740
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');         00029750
     DCL                                                                00029760
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00029770
                                                                        00029780
                                                                        00029790
     DCL 1  W01_DLI_PARAM,                                              00029800
            2   W02_GU             CHAR (4)       INIT('GU  '),         00029810
            2   W02_PARM_CT_1      FIXED BIN(31)  INIT(1),              00029820
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT(3);              00029830
                                                                        00029840
  %PAGE;                                                                00029850
                                                                        00029860
     IF STYRING = 'OPEN' THEN                                           00029870
        DO;                                                             00029880
           CALL   PLITDLI                        (W02_PARM_CT_3,        00029890
                                                  W01_PCB_FUNCTION,     00029900
                                                  W01_PSB_NAVN,         00029910
                                                  UIBPTR);              00029920
                                                                        00029930
           IF DLIUIB.UIBFCTR                    =    '00000000'B THEN   00029940
              DO;                                                       00029950
                 ALLOCATE PCB_UIB_PEKER_OMR;                            00029960
                 PCB_UIB_PEKER_OMR.PCB_PEKER      =    UIBPCBAL;        00029970
                 PCB_UIB_PEKER_OMR.UIB_PEKER      =    UIBPTR;          00029980
              END;                                                      00029990
           ELSE                                                         00030000
              DO;                                                       00030010
                 FEIL_MELD_NR      =  500;                              00030020
 L555:           FEIL_VED_LABEL    = '555';                             00030030
                 MAP_MELDING =                                          00030040
                         'NOE ER GALT MED DATABASEN, KODE: ' !!         00030050
                           UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);   00030060
              END;                                                      00030070
        END;                                                            00030080
     ELSE                                                               00030090
        DO;                                                             00030100
           CALL   PLITDLI                        (W02_PARM_CT_1,        00030110
                                                  W01_TERM_FUNCTION);   00030120
           KOM_OMR.PCB_UIB_PEKER = NULL;                                00030130
        END;                                                            00030140
                                                                        00030150
  END DATABASE;                                                         00030160
                                                                        00030170
                                                                        00030180
  %INCLUDE R0019912;             /*  NUM-> CHAR                   */    00030190
  %INCLUDE R0019905;             /*  F_ALDER                      */    00030200
  %INCLUDE R0019957;             /*  P900_NOR_DATA ( FNR , TKNR ) */    00030210
  %INCLUDE R0019960;             /*  F_CICSINFO                   */    00030220
                                                                        00030230
                                                                        00030240
 END R001I20;                                                           00030250
