 /*       SIST ENDRET 13/07-89 13.21.33 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 14/04-89 13.33.23 AV   HERMAN                   */00000010
 /*       SIST ENDRET 21/08-84 13.56.37 AV   HERMAN                   */00000020
 /*       SIST ENDRET 19/10-83 09.52.37 AV   FARVIK                   */00000030
 /*       SIST ENDRET 11/10-83 08.27.28 AV   FARVIK                   */00000040
 /*       SIST ENDRET 15/09-83 12.52.29 AV   FARVIK                   */00000050
 /*       SIST ENDRET 08/12-82 08.50.31 AV   FARVIK                   */00000060
 /*       SIST ENDRET 28/10-82 14.27.24 AV   PERB                     */00000070
 /* ***************************************************************** */00000080
 /*IDENTIFIKASJON:                                                    */00000090
 /*    R0011405 - PROSEDYRER I PLI                                    */00000100
 /*    PROGRAMMERER: JAN, SEPTEMBER 1981                              */00000110
 /*HENSIKT:                                                           */00000120
 /*    PROSEDYRENE FORETAR KONTROLL AV DATA FOR E1_KAP7,E1_KAP8 OG    */00000130
 /*    E1_KAP10 OG E1_KAP11 FRA ENDRINGSBLANKETTEN.             *//*YS*/00000140
 /*PROGRAMTILKNYTNING:                                                */00000150
 /*    PROSEDYRENE INNGÅR SOM EN DEL AV BEHANDLINGEN AV ENDRINGS-     */00000160
 /*    BLANKETTEN.                                                    */00000170
 /*    INCLUDES I  R0011401.                                          */00000180
 /*BRUK:                                                              */00000190
 /*    CALL KONTROLL_E1_KAP7 (FEIL_I_E1_KAP7);                        */00000200
 /*    CALL KONTROLL_E1_KAP8 (FEIL_I_E1_KAP8);                        */00000210
 /*    CALL KONTROLL_E1_KAP10(FEIL_I_E1_KAP10);                       */00000220
 /*    CALL KONTROLL_E1_KAP11(FEIL_I_E1_KAP11);                 *//*YS*/00000230
 /******************************************************************* */00000240
 %PAGE;                                /*   */                          00000250
 /* ***************************************************************** */00000260
 /*                                                                   */00000270
 /*   MODULEN KONTROLLERER E1_KAP7 (ENDRING I INNTEKT ELLER PENSJONS- */00000280
 /*   GRAD) OG RETURNERER MED FEIL_FUNNET= '1'B HVIS FEIL, '0'B       */00000290
 /*   HVIS RIKTIG                                                     */00000300
 /*                                                                   */00000310
 /* ***************************************************************** */00000320
 %SKIP(2);                                                              00000330
 KONTROLL_E1_KAP7:                                                      00000340
   PROC (FEIL_FUNNET);                                                  00000350
   DCL                                                                  00000360
      FEIL_FUNNET BIT (1);                                              00000370
 %SKIP;                                                                 00000380
 /* ***************************************************************** */00000390
 /*   DERSOM FELTET ER UTFYLT                                         */00000400
 /* ***************************************************************** */00000410
                                                                        00000420
      IF E1K7.FAI > 0 THEN                                              00000430
                                                                        00000440
 /* ***************************************************************** */00000450
 /*      F_NUMERISK KONTROLLERER OM ET OVERFØRT CHAR-FELT ER NUMERISK */00000460
 /*      DERSOM FELTET ER NUMERISK RETURNERES '1'B, HVIS IKKE '0'B.   */00000470
 /* ***************************************************************** */00000480
 /* ***************************************************************** */00000490
 /*      F_FELT_PIC_CHAR ER EN FUNKSJON SOM KONVERTERER PIC-FELT TIL  */00000500
 /*      CHAR.                                                        */00000510
 /* ***************************************************************** */00000520
                                                                        00000530
         IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(E1K7.FAI)) THEN               00000540
            DO;                                                         00000550
               FEIL_FUNNET = '1'B;                                      00000560
                                                                        00000570
 /* ***************************************************************** */00000580
 /*      FEILMELD 200: TEGN SOM IKKE ER TALL FOREKOMMER I TALLFELTET. */00000590
 /* ***************************************************************** */00000600
                                                                        00000610
               E1K7.FAINR = 200;                                        00000620
            END;                                                        00000630
      IF E1K7.APD_MAX ^= ' ' THEN                                       00000640
         DO;                                                            00000650
            IF ^ (E1K7.APD_MAX = 'X') THEN                              00000660
               DO;                                                      00000670
                  FEIL_FUNNET    = '1'B;                                00000680
                                                                        00000690
 /* ***************************************************************** */00000700
 /*         FEILMELD 149: FEIL I MAKS PENSJONSGRAD                    */00000710
 /* ***************************************************************** */00000720
                                                                        00000730
                  E1K7.APD_MAXNR =149;                                  00000740
               END;                                                     00000750
            ELSE                                                        00000760
               IF E1K7.APD = 999 THEN                                   00000770
                  E1K7.APD = 100;                                       00000780
               ELSE                                                     00000790
                  IF E1K7.APD ^= 100 THEN                               00000800
                     DO;                                                00000810
                        FEIL_FUNNET = '1'B;                             00000820
                                                                        00000830
 /* **************************************************************** */ 00000840
 /*               FEILMELD 182: APD-MAX ER UTFYLT,APD ER IKKE 999    */ 00000850
 /*               ELLER 100.                                         */ 00000860
 /* **************************************************************** */ 00000870
                                                                        00000880
                        E1K7.APDNR  = 182;                              00000890
                     END;                                               00000900
         END;                                                           00000910
      ELSE                                                              00000920
         IF E1K7.APD = 999 THEN                                         00000930
            DO;                                                         00000940
               IF E1K7.FAI ^= 9999999  THEN                             00000950
                  E1K7.APD = 100;                                       00000960
               ELSE                                                     00000970
                  LEAVE;                                                00000980
            END;                                                        00000990
         ELSE                                                           00001000
            IF E1K7.APD > 0 THEN                                        00001010
               IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(E1K7.APD)) THEN         00001020
                  DO;                                                   00001030
                     FEIL_FUNNET = '1'B;                                00001040
                     E1K7.APDNR  = 200;                                 00001050
                  END;                                                  00001060
               ELSE                                                     00001070
                  IF ^(E1K7.APD = 0 !  E1K7.APD = 25 !                  00001080
                       E1K7.APD = 50 ! E1K7.APD = 75 !                  00001090
                       E1K7.APD = 100) THEN                             00001100
                     DO;                                                00001110
                        FEIL_FUNNET = '1'B;                             00001120
                                                                        00001130
 /* ***************************************************************** */00001140
 /*            FEILMELD 12: PENSJONSGRADEN ER UGYLDIG                 */00001150
 /* ***************************************************************** */00001160
                                                                        00001170
                        E1K7.APDNR  = 12;                               00001180
                     END;                                               00001190
   END KONTROLL_E1_KAP7;                                                00001200
 %PAGE;                                /*   */                          00001210
                                                                        00001220
 /* ***************************************************************** */00001230
 /*                                                                   */00001240
 /*   MODULEN KONTROLLERER E1_KAP8(REDUKSJON AV UFØREGRAD) OG         */00001250
 /*   RETURNERER MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG   */00001260
 /*                                                                   */00001270
 /* ***************************************************************** */00001280
                                                                        00001290
 %SKIP(2);                                                              00001300
 KONTROLL_E1_KAP8:                                                      00001310
   PROC (FEIL_FUNNET);                                                  00001320
   DCL                                                                  00001330
      FEIL_FUNNET BIT (1);                                              00001340
 %SKIP;                                                                 00001350
      IF E1K8.UFG > 0 THEN                                              00001360
         DO;                                                            00001370
            IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(E1K8.UFG)) THEN            00001380
               DO;                                                      00001390
                  FEIL_FUNNET = '1'B;                                   00001400
                  E1K8.UFGNR  = 200;                                    00001410
               END;                                                     00001420
            ELSE                                                        00001430
 /*YS*/      IF ^(E1K8.UFG = 15 ! E1K8.UFG = 20 ! E1K8.UFG = 25 !       00001440
 /*YS*/           E1K8.UFG = 30 ! E1K8.UFG = 35 ! E1K8.UFG = 40 !       00001450
 /*YS*/           E1K8.UFG = 45 ! E1K8.UFG = 50 ! E1K8.UFG = 55 !       00001460
 /*YS*/           E1K8.UFG = 60 ! E1K8.UFG = 65 ! E1K8.UFG = 70 !       00001470
                  E1K8.UFG = 75 ! E1K8.UFG = 80 ! E1K8.UFG = 85 !       00001480
 /*13.7.89-HL*/   E1K8.UFG = 100 !                                      00001490
                  E1K8.UFG = 90 ! E1K8.UFG = 95 ! E1K8.UFG = 999 ) THEN 00001500
                                                                        00001510
                  DO;                                                   00001520
                     FEIL_FUNNET = '1'B;                                00001530
                                                                        00001540
 /* ***************************************************************** */00001550
 /*            FEILMELD 38: UGYLDIG UFØREGRAD                         */00001560
 /* ***************************************************************** */00001570
                                                                        00001580
                     E1K8.UFGNR = 38;                                   00001590
                  END;                                                  00001600
         END;                                                           00001610
   END KONTROLL_E1_KAP8;                                                00001620
 %PAGE;                                /*   */                          00001630
                                                                        00001640
 /* ***************************************************************** */00001650
 /*                                                                   */00001660
 /*   MODULEN KONTROLLERER E1_KAP10 (DIVERSE ENDRINGER) OG RETURNERER */00001670
 /*   MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG              */00001680
 /*                                                                   */00001690
 /* ***************************************************************** */00001700
                                                                        00001710
 %SKIP(2);                                                              00001720
 KONTROLL_E1_KAP10:                                                     00001730
   PROC (FEIL_FUNNET);                                                  00001740
   DCL                                                                  00001750
      FEIL_FUNNET     BIT (1);                                          00001760
 %SKIP;                                                                 00001770
   DCL                                                                  00001780
      DAGENS_DATO_ÅMD PIC '999999',                                     00001790
      DAGENS_DATO_ÅM  DEF DAGENS_DATO_ÅMD PIC '9999',                   00001800
      DAGENS_DATO_Å   DEF DAGENS_DATO_ÅMD PIC '99';                     00001810
 %PAGE;                                /*   */                          00001820
                                                                        00001830
 /* ***************************************************************** */00001840
 /*  HJELPE DCL FOR Å SNU DATO                                        */00001850
 /* ***************************************************************** */00001860
                                                                        00001870
 %SKIP(1);                                                              00001880
   DCL                                                                  00001890
      HJ_FRAML_DATO_ÅM PIC '9999',                                      00001900
      FRAML_DATO_Å     DEF HJ_FRAML_DATO_ÅM POS(1) PIC '99',            00001910
      FRAML_DATO_M     DEF HJ_FRAML_DATO_ÅM POS(3) PIC '99';            00001920
 %SKIP;                                                                 00001930
   DCL                                                                  00001940
      HJ_FRAML_DATO_MÅ PIC '9999',                                      00001950
      HJ_FRAML_DATO_M  DEF HJ_FRAML_DATO_MÅ POS(1) PIC '99',            00001960
      HJ_FRAML_DATO_Å  DEF HJ_FRAML_DATO_MÅ POS(3) PIC '99';            00001970
 %PAGE;                                                                 00001980
                                                                        00001990
      DAGENS_DATO_ÅMD = DATE ();                                        00002000
      IF E1K10.FORVENTET > 0 THEN                                       00002010
         IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(E1K10.FORVENTET)) THEN        00002020
            DO;                                                         00002030
               FEIL_FUNNET       = '1'B;                                00002040
               E1K10.FORVENTETNR = 200;                                 00002050
            END;                                                        00002060
      IF ^(E1K10.O_TIL_PENSJON = 'X' ! E1K10.O_TIL_PENSJON = ' ') THEN  00002070
         DO;                                                            00002080
            FEIL_FUNNET           = '1'B;                               00002090
                                                                        00002100
 /* **************************************************************** */ 00002110
 /*   FEILMELD 150: FEIL I OVEGANG TIL PENSJON                       */ 00002120
 /* **************************************************************** */ 00002130
                                                                        00002140
            E1K10.O_TIL_PENSJONNR =150;                                 00002150
         END;                                                           00002160
      IF E1K10.TP_PROSENT > 0 THEN                                      00002170
         IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(E1K10.TP_PROSENT)) THEN       00002180
            DO;                                                         00002190
               FEIL_FUNNET        = '1'B;                               00002200
               E1K10.TP_PROSENTNR = 200;                                00002210
            END;                                                        00002220
         ELSE                                                           00002230
            IF E1K10.TP_PROSENT > 55 &                                  00002240
               E1K10.TP_PROSENT < 999 THEN                              00002250
               DO;                                                      00002260
                  FEIL_FUNNET        = '1'B;                            00002270
                                                                        00002280
 /* **************************************************************** */ 00002290
 /*         FEILMELD 64: FEIL I TP-PROSENT                           */ 00002300
 /* **************************************************************** */ 00002310
                                                                        00002320
                  E1K10.TP_PROSENTNR = 64;                              00002330
               END;                                                     00002340
      IF E1K10.FRAML_DATO_MÅ > 0 THEN                                   00002350
         IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(E1K10.FRAML_DATO_MÅ)) THEN    00002360
            DO;                                                         00002370
               FEIL_FUNNET           = '1'B;                            00002380
               E1K10.FRAML_DATO_MÅNR = 200;                             00002390
            END;                                                        00002400
         ELSE                                                           00002410
            IF E1K10.FRAML_DATO_MÅ > 0 THEN                             00002420
                                                                        00002430
 /* **************************************************************** */ 00002440
 /*            FUNKSJONEN F_GYLDIG_DATO KONTROLLERER OM EN DATO(ÅR/  */ 00002450
 /*            MND) ER GYLDIG. HVIS GYLDIG RETURNERES '1'B, HVIS     */ 00002460
 /*            IKKE GYLDIG '0'B.                                     */ 00002470
 /* **************************************************************** */ 00002480
                                                                        00002490
               IF ^ F_GYLDIG_DATO(E1K10.FRAML_DATO_MÅ) THEN             00002500
                  DO;                                                   00002510
                     FEIL_FUNNET           = '1'B;                      00002520
                                                                        00002530
 /* **************************************************************** */ 00002540
 /*            FEILMELD 71: UGYLDIG FRAMLEGGSDATO                    */ 00002550
 /* **************************************************************** */ 00002560
                                                                        00002570
                     E1K10.FRAML_DATO_MÅNR = 71;                        00002580
                  END;                                                  00002590
      IF VERIFY (E1K10.OPPHØR_EO,'JN ') ^= 0 THEN                       00002600
         DO;                                                            00002610
            FEIL_FUNNET       = '1'B;                                   00002620
                                                                        00002630
 /* **************************************************************** */ 00002640
 /*   FEILMELD 151: FEIL I OPPHØR-EO                                 */ 00002650
 /* **************************************************************** */ 00002660
                                                                        00002670
            E1K10.OPPHØR_EONR = 151;                                    00002680
         END;                                                           00002690
      ELSE                                                              00002700
         IF E1K10.OPPHØR_EO ^= ' ' & E1K10.FRAML_DATO_MÅ = 0 THEN       00002710
            DO;                                                         00002720
               FEIL_FUNNET       = '1'B;                                00002730
                                                                        00002740
 /* **************************************************************** */ 00002750
 /*      FEILMELD 184: OPPHØR-EO ER UTFYLT,FRAMLEGGSDATO IKKE UTFYLT */ 00002760
 /* **************************************************************** */ 00002770
                                                                        00002780
               E1K10.OPPHØR_EONR = 184;                                 00002790
            END;                                                        00002800
         ELSE                                                           00002810
            IF E1K10.OPPHØR_EO = ' ' & E1K10.FRAML_DATO_MÅ > 0 THEN     00002820
               DO;                                                      00002830
                  FEIL_FUNNET       = '1'B;                             00002840
                                                                        00002850
 /* **************************************************************** */ 00002860
 /*         FEILMELD 187: OPPHØR_EO IKKE UTFYLT,FRAML_DATO ER UTFYLT */ 00002870
 /* **************************************************************** */ 00002880
                                                                        00002890
                  E1K10.OPPHØR_EONR = 187;                              00002900
               END;                                                     00002910
 %SKIP(3);                             /*  */                           00002920
                                                                        00002930
 /* ***************************************************************** */00002940
 /*   KRYSS KONTROLLER                                                */00002950
 /* ***************************************************************** */00002960
                                                                        00002970
 %SKIP;                                                                 00002980
      IF ^ FEIL_FUNNET THEN                                             00002990
         DO;                                                            00003000
            HJ_FRAML_DATO_MÅ = E1K10.FRAML_DATO_MÅ;                     00003010
            FRAML_DATO_Å     = HJ_FRAML_DATO_Å;                         00003020
            FRAML_DATO_M     = HJ_FRAML_DATO_M;                         00003030
                                                                        00003040
            IF (E1K10.FRAML_DATO_MÅ > 0 ! E1K10.OPPHØR_EO ^= ' ' !      00003050
                E1K10.TP_PROSENT    < 999 !                             00003060
                E1K10.O_TIL_PENSJON ^= ' ') &                           00003070
                E1K10.FORVENTET     = 9999999   THEN                    00003080
                  DO;                                                   00003090
                     FEIL_FUNNET           = '1'B;                      00003100
                     E1K10.FORVENTETNR     = 88;                        00003110
                  END;                                                  00003120
            IF E1K10.FRAML_DATO_MÅ > 0 THEN                             00003130
               IF HJ_FRAML_DATO_ÅM < DAGENS_DATO_ÅM THEN                00003140
                  DO;                                                   00003150
                     FEIL_FUNNET           = '1'B;                      00003160
                     E1K10.FRAML_DATO_MÅNR = 72;                        00003170
                  END;                                                  00003180
         END;                                                           00003190
   END KONTROLL_E1_KAP10;                                               00003200
 %PAGE;                                /*   */                          00003210
 /*YS*/ /* OBS. NY PROSEDYRE   */                                       00003220
 /* ********************************************************** */ /*YS*/00003230
 /*                                                            */ /*YS*/00003240
 /*   MODULEN KONTROLLERER E1_KAP11(REDUKSJON AV YRKEGRAD) OG  */ /*YS*/00003250
 /*   RETURNERER MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS   */ /*YS*/00003260
 /*   RIKTIG                                                   */ /*YS*/00003270
 /*                                                            */ /*YS*/00003280
 /* ********************************************************** */ /*YS*/00003290
                                                                        00003300
 KONTROLL_E1_KAP11:                                               /*YS*/00003310
   PROC (FEIL_FUNNET);                                            /*YS*/00003320
   DCL                                                            /*YS*/00003330
      FEIL_FUNNET BIT (1);                                        /*YS*/00003340
                                                                        00003350
      IF E1K11.YUG > 0 THEN                                       /*YS*/00003360
         DO;                                                      /*YS*/00003370
            IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(E1K11.YUG)) THEN     /*YS*/00003380
               DO;                                                /*YS*/00003390
                  FEIL_FUNNET = '1'B;                             /*YS*/00003400
                  E1K11.YUGNR = 200;                              /*YS*/00003410
               END;                                               /*YS*/00003420
            ELSE                                                  /*YS*/00003430
             IF ^(E1K11.YUG = 15 ! E1K11.YUG = 20 !               /*YS*/00003440
                  E1K11.YUG = 25 ! E1K11.YUG = 30 !               /*YS*/00003450
                  E1K11.YUG = 35 ! E1K11.YUG = 40 !               /*YS*/00003460
                  E1K11.YUG = 45 ! E1K11.YUG = 50 !               /*YS*/00003470
                  E1K11.YUG = 55 ! E1K11.YUG = 60 !               /*YS*/00003480
                  E1K11.YUG = 65 ! E1K11.YUG = 70 !               /*YS*/00003490
                  E1K11.YUG = 75 ! E1K11.YUG = 80 !               /*YS*/00003500
                  E1K11.YUG = 85 ! E1K11.YUG = 90 !               /*YS*/00003510
                  E1K11.YUG = 95 ! E1K11.YUG = 999)  THEN         /*YS*/00003520
                                                                        00003530
                  DO;                                             /*YS*/00003540
                     FEIL_FUNNET = '1'B;                          /*YS*/00003550
                                                                        00003560
 /* *********************************************************** *//*YS*/00003570
 /*            FEILMELD 307: UGYLDIG UFØREGRAD                  *//*YS*/00003580
 /* *********************************************************** *//*YS*/00003590
                                                                        00003600
                     E1K11.YUGNR = 307;                           /*YS*/00003610
                  END;                                            /*YS*/00003620
             ELSE                                                 /*YS*/00003630
                IF E1K8.UFG > 0  THEN                             /*YS*/00003640
                   DO;                                            /*YS*/00003650
                      IF E1K8.UFG  < 50        &                  /*YS*/00003660
                         E1K8.UFG ^= E1K11.YUG    THEN            /*YS*/00003670
                         DO;                                      /*YS*/00003680
                            FEIL_FUNNET = '1'B;                   /*YS*/00003690
                            E1K8.UFGNR  = 311;                    /*YS*/00003700
                            E1K11.YUGNR = 999;                    /*YS*/00003710
                         END;                                     /*YS*/00003720
                      IF E1K8.UFG < E1K11.YUG    THEN             /*YS*/00003730
                         DO;                                      /*YS*/00003740
                            FEIL_FUNNET = '1'B;                   /*YS*/00003750
                            E1K8.UFGNR  = 317;                    /*YS*/00003760
                            E1K11.YUGNR = 999;                    /*YS*/00003770
                         END;                                     /*YS*/00003780
                                                                        00003790
                   END;                                           /*YS*/00003800
         END;                                                     /*YS*/00003810
   END KONTROLL_E1_KAP11;                                         /*YS*/00003820
