 /*       SIST ENDRET 01/12-89 08.38.22 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 12/05-87 08.33.30 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 07/02-86 09.56.21 AV   FARVIK                   */00000020
 /*       SIST ENDRET 22/10-85 14.59.35 AV   FARVIK                   */00000030
 /*       SIST ENDRET 27/08-85 10.31.19 AV   FARVIK                   */00000040
 /*       SIST ENDRET 18/10-82 16.38.13 AV   PERB                     */00000050
 /* ***************************************************************** */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /*    R0011102 PLI                                                   */00000080
 /*    PROGRAMMERER: GEIR, JULI 81                                    */00000090
 /*HENSIKT:                                                           */00000100
 /*    R0011102 INNEHOLDER:                                           */00000110
 /*      PROSEDYRER FOR BLANKING AV EB_TRANS_OMR.                     */00000120
 /*ENDRING:                                                           */00000130
 /*    PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL          */00000140
 /*    FB_TRANS_OMR ER SKILT UT OG LAGT I R0011109. 050587  BRITT     */00000150
 /*PROGRAMTILKNYTNING:                                                */00000160
 /*    PROSEDYRENE INKLUDERES I ALDERSBEHANDLINGA TIL DET             */00000170
 /*    MASKINELLE FOLKETRYGDSYSTEMET.                                 */00000180
 /*    ARBEIDSOMRÅDE: P0011101  (LIGGER I R001.TEST.COPYLIB)          */00000190
 /*BRUK:                                                              */00000200
 /*    %INCLUDE R0011102;                                             */00000210
 /*    BLANK_BP_BARN:    BLANKER BARNEDELEN                           */00000220
 /*    BLANK_BP_GEN:     BLANKER GENERELL DEL                         */00000230
 /*    BLANK_BP_AVD:     BLANKER AVDØDES DEL                          */00000240
 /*    BLANK_BP_MELDNR:  SETTER 0 I MELDINGSNUMMERNE                  */00000250
 /* ***************************************************************** */00000260
 %PAGE;                                                                 00000270
 /* ***************************************************************** */00000280
 /*                                                                   */00000290
 /*   PROSEDYREN BLANKER BP_BARNEDELEN I BP_TRANS_OMR I               */00000300
 /*   KOM_OMR FOR SØKNADER ETTERLATTE BARN, EN AV FORELDRENE DØD.     */00000310
 /*                                                                   */00000320
 /* ***************************************************************** */00000330
 %SKIP;                                                                 00000340
  BLANK_BP_BARN:                                                        00000350
    PROC;                                                               00000360
       DCL                                                              00000370
          ANT_BARN                          FIXED BIN (15);             00000380
          BPB.REGDATO                       = 0      ;                  00000390
          BPB.TERMID                        = '    ' ;                  00000400
          DO ANT_BARN                       = 1 TO 10;                  00000410
             BPB.TAB.FNR_BARN(ANT_BARN)     = 0      ;                  00000420
             BPB.TAB.FNR_GML_BARN(ANT_BARN) = 0      ;                  00000430
             BPB.TAB.NAVN_BARN(ANT_BARN)    = (25)' ';                  00000440
             BPB.TAB.TKNR(ANT_BARN)         = 0      ;                  00000450
          END;                                                          00000460
    END BLANK_BP_BARN;                                                  00000470
 %PAGE;                                                                 00000480
 /* ***************************************************************** */00000490
 /*                                                                   */00000500
 /*   PROSEDYREN BLANKER BP_GEN.DELEN I BP_TRANS_OMR I                */00000510
 /*   KOM_OMR FOR ETTERLATTE BARN.                                    */00000520
 /*                                                                   */00000530
 /* ***************************************************************** */00000540
 %SKIP;                                                                 00000550
  BLANK_BP_GEN:                                                         00000560
    PROC;                                                               00000570
       BPB.SPRÅK        = ' ';                                          00000580
       BPB.KT           = ' ';                                          00000590
       BPB.VIRK_DATO_MÅ = 0;                                            00000600
    END BLANK_BP_GEN;                                                   00000610
 %SKIP;                                                                 00000620
 /* ***************************************************************** */00000630
 /*                                                                   */00000640
 /*   PROSEDYREN BLANKER BP_AVD.DELEN I BP_TRANS_OMR I                */00000650
 /*   KOM_OMR FOR ETTERLATTE BARN.                                    */00000660
 /*                                                                   */00000670
 /* ***************************************************************** */00000680
 %SKIP;                                                                 00000690
  BLANK_BP_AVD:                                                         00000700
    PROC;                                                               00000710
       BPB.FNR_DØD        = 0;                                          00000720
       BPB.FNR_GML_DØD    = 0;                                          00000730
       BPB.NAVN_DØD       = (25)' ';                                    00000740
       BPB.DØDSDATO       = 0;                                          00000750
 /*YS*/BPB.YSKADE_TILLEGG = ' ';                                        00000760
 /*YS*/BPB.PLEIEBARN      = ' ';                                        00000770
    END BLANK_BP_AVD;                                                   00000780
 %PAGE;                                                                 00000790
 /* ***************************************************************** */00000800
 /*                                                                   */00000810
 /*   PROSEDYRE FOR Å SETTE 0 MELDINGSNUMMERNE I BP_TRANS_OMR I       */00000820
 /*   KOM_OMR.                                                        */00000830
 /*                                                                   */00000840
 /* ***************************************************************** */00000850
 %SKIP;                                                                 00000860
  BLANK_BP_MELDNR:                                                      00000870
    PROC;                                                               00000880
    DCL                                                                 00000890
       ANT_BARN                           FIXED BIN (15);               00000900
                                                                        00000910
       BPB.REGDATONR                      = 0;                          00000920
       BPB.TERMIDNR                       = 0;                          00000930
       DO ANT_BARN                        = 1 TO 10;                    00000940
          BPB.TAB.FNR_BARNNR(ANT_BARN)    = 0;                          00000950
          BPB.TAB.NAVN_BARNNR(ANT_BARN)   = 0;                          00000960
          BPB.TAB.TKNRNR(ANT_BARN)        = 0;                          00000970
       END;                                                             00000980
 %SKIP;                                                                 00000990
 /*      0 I MELDINGSNUMMERNE I GENERELL DEL                          */00001000
 %SKIP;                                                                 00001010
       BPB.SPRÅKNR        = 0;                                          00001020
       BPB.KTNR           = 0;                                          00001030
       BPB.VIRK_DATO_MÅNR = 0;                                          00001040
 %SKIP;                                                                 00001050
 /*      0 I MELDINGSNUMMERNE I DEL OM AVDØD                          */00001060
 %SKIP;                                                                 00001070
       BPB.FNR_DØDNR        = 0;                                        00001080
       BPB.NAVN_DØDNR       = 0;                                        00001090
       BPB.DØDSDATONR       = 0;                                        00001100
 /*YS*/BPB.YSKADE_TILLEGGNR = 0;                                        00001110
 /*YS*/BPB.PLEIEBARNNR      = 0;                                        00001120
  END BLANK_BP_MELDNR;                                                  00001130
