 /*       SIST ENDRET 21/05-86 10.34.26 AV   TASSEN                   */00000000
 /*       SIST ENDRET 08/11-82 11.52.10 AV   FARVIK                   */00000010
 /*       SIST ENDRET 01/10-82 13.43.02 AV   FARVIK                   */00000020
 /* ***************************************************************** */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /*    R0014147 - FRAVIK_80_PROSENT - INTERN PROC I PLI.              */00000050
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982.                          */00000060
 /*    ENDRET AV KARIN I JULI 82                                      */00000070
 /*HENSIKT:                                                           */00000080
 /*    PROGRAMMET BEREGNER APD_FRAVIK PÅ GRUNNLAG AV B02.FAI OG G. */   00000090
 /*PROGRAMTILKNYTNING:                                                */00000100
 /*    PROGRAMMET BLIR INKLUDERT I R0014136 - ÅTTI_PROSENT_REGELEN.   */00000110
 /*BRUK:                                                              */00000120
 /*    CALL FRAVIK_80_PROSENT(W_APD_FRAVIK);                          */00000130
 /*PROGRAMENDRING:                                                    */00000100
 /*    UTVIDET TIL Å TA SEG AV FORGSØRGET EKTEFELLE SOM VED OVERGANG  */00000110
 /*    TIL ALDERSPENSJON KAN TJENE OPP TIL 110 PROSENT AV G ISTEDET   */00000120
 /*    FOR DE ORDINÆRE INNTEKTSGRENSENE.  FEILMELDING NR. 321.        */00000110
 /*    ERIK, 25.6.86.                                                 */00000120
 /* ***************************************************************** */00000140
 FRAVIK_80_PROSENT: PROC(W_APD_FRAVIK);                                 00000150
                                                                        00000160
 DCL                                                                    00000170
    W_APD_FRAVIK      FIXED DEC(7,3);                                   00000180
                                                                        00000190
                                                                        00000200
   IF B02.ALDERSP.FAI(BER_SØ_IND) < 0.5 * G / 100 &                     00000210
   B02.ALDERSP.KONV_P_KODE(BER_SØ_IND) ^= 'F' THEN                      00000220
     W_APD_FRAVIK = 100;                                                00000230
                                                                        00000240
   ELSE IF B02.ALDERSP.FAI(BER_SØ_IND) < G / 100  &                     00000250
   B02.ALDERSP.KONV_P_KODE(BER_SØ_IND) ^= 'F' THEN                      00000260
     W_APD_FRAVIK = 75;                                                 00000270
                                                                        00000280
   ELSE IF B02.ALDERSP.FAI(BER_SØ_IND) <= 1.1 * G / 100 &               00000290
   B02.ALDERSP.KONV_P_KODE(BER_SØ_IND) = 'F' THEN                       00000300
     W_APD_FRAVIK = 100;                                                00000310
                                                                        00000320
   ELSE IF B02.ALDERSP.FAI(BER_SØ_IND) < 1.5 * G / 100 THEN             00000330
     W_APD_FRAVIK = 50;                                                 00000340
                                                                        00000350
   ELSE IF B02.ALDERSP.FAI(BER_SØ_IND) < 2 * G / 100 THEN               00000360
     W_APD_FRAVIK = 25;                                                 00000370
                                                                        00000380
   ELSE                                                                 00000390
     W_APD_FRAVIK = 0;                                                  00000400
                                                                        00000410
                                                                        00000420
 END FRAVIK_80_PROSENT;                                                 00000430
