 /*       SIST ENDRET 11/02-97 13.59.03 AV   JDA7339                  */00000000
 /*       SIST ENDRET 12/10-95 14.17.13 AV   JDA0310                  */00000010
 /*       SIST ENDRET 25/07-94 13.53.42 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 25/02-94 12.53.10 AV   HERMAN                   */00000030
 /*       SIST ENDRET 13/11-91 13.46.35 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 26/04-91 13.11.38 AV   DYBVIK                   */00000050
 R00104:                                                                00000060
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000070
 %SKIP;                                /*  */                           00000080
 /******************** PROGRAM ER DEL AV R0010401******************** */00000090
 /*IDENTIFIKASJON:                                                    */00000100
 /************************                                            */00000110
 /*  PROGRAM-IDENT : R001C401-REGISTRERING NYE BLANKETTER-HOVEDPROGR. */00000120
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000130
 /*  PROGRAMMERER  : ?                                                */00000140
 /*  PROGRAMMET BLE DELET     : PATHAK                                */00000150
 /*  ENDRINGERSDATO :                                                 */00000160
 /*  ENDRINGEN GJELDER:                                               */00000170
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000180
 /*                                                                   */00000190
 /******************************************************************* */00000200
 /*HENSIKT:*/                                                           00000210
 /************                                                        */00000220
 /*  PROGRAMMET ER DEL AV R0010401                                    */00000230
 /*  PROGRAMMET LESER INN STYRINGSKODEN, KONTROLLERER DEN             */00000240
 /*  OG SENDER UT DET FØRSTE BILDET AV DEN BLANKETTEN SOM SKAL        */00000250
 /*  REGISTRERES:                                                     */00000260
 /*    U3 ---> MAP S001U61 MAPSET S001U63 - GRBL. UFØREPENSJON       */ 00000270
 /*                                                                   */00000280
 /******************************************************************* */00000290
 /*PROGRAMTILKNYTTING:*/                                                00000300
 /**********************                                              */00000310
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSID = R040 OG R041.  */00000320
 /*  R040: KONTROLLEN KOMMER FRA R0010301                             */00000330
 /*  R041: KONTROLLEN KOMMER FRA                                      */00000340
 /*  PROGRAMMET GÅR VIA CICS TIL FORSKJELLIGE PROGRAMMER AVHENGIG     */00000350
 /*  HVILKEN STYRINGSKODE SOM BLIR SATT AV OPERATØREN ELLER           */00000360
 /*  ETTER BLANKETTKONTROLLEN TRANSKODE SATT AV PROGRAMMENE:          */00000370
 /*  U3 - UFØREPENSJON                                               */ 00000380
 /*                                                                   */00000390
 /******************************************************************* */00000400
 /*DATASETTOPPLYSNINGER:                                              */00000410
 /*************************                                           */00000420
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000430
 /*                                                                   */00000440
 /******************************************************************* */00000450
 /*FEILMELDINGER:*/                                                     00000460
 /*********************                                               */00000470
 /* 'UGYLDIG STYREKODE' BLIR SKREVET PÅ SKJERMBILDET NÅR STYRINGSKODE */00000480
 /*  IKKE HAR GYLDIG VERDI                                            */00000490
 /*                                                                   */00000500
 /* ***************************************************************** */00000510
      %INCLUDE S00101;     /*  MENY            */                       00000520
 %PAGE;                                                                 00000530
      %INCLUDE S001U6;     /*  UFØRE MAPSETTET */                       00000540
 %PAGE;                                                                 00000550
      %INCLUDE S001U8;    /*   ETTERLAT EKTEFFELS   */                  00000560
 %PAGE;                                                                 00000570
      %INCLUDE S001UC;     /*  UFØRE MAPSETTET */                       00000580
 %PAGE;                                                                 00000590
      %INCLUDE S001UE;     /*  ENDERING MAPSETTET */                    00000600
 %PAGE;                                                                 00000610
      %INCLUDE S001UJ;     /* ****  AFP      MAPSETTET */               00000620
 %PAGE;                                                                 00000630
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */            00000640
 %PAGE;                                                                 00000650
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                    00000660
 %PAGE;                                                                 00000670
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */               00000680
 %PAGE;                                                                 00000690
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */              00000700
 %PAGE;                                                                 00000710
      %INCLUDE P0019959;   /*  OMRAADE FOR FUNKTAB      */              00000720
 %PAGE;                                                                 00000730
      %INCLUDE DFHBMSCA;   /*  MAP HJELPEFELT           */              00000740
 %PAGE;                                                                 00000750
   DCL                                                                  00000760
      (COMMAREA_PEKER,IDENT_PEKER,                                      00000770
      BMSMAPBR)      PTR;                                               00000780
   DCL  W_TERMINAL   CHAR (4);                                          00000790
   DCL                                                                  00000800
      IDENT_BIT BIT(32) BASED (IDENT_PEKER);                            00000810
   DCL                                                                  00000820
      (DATE,NULL,CSTG,ADDR,SUBSTR,STG) BUILTIN;                         00000830
   DCL DATO     PIC '(6)9' INIT (0);                                    00000840
   DCL                                                                  00000850
      HJ2_DATO_ÅMD   PIC '(6)9',                                        00000860
                                                                        00000870
      HJ2_ÅR DEF HJ2_DATO_ÅMD  POS (1) PIC '(2)9',                      00000880
                                                                        00000890
      HJ1_DATO_MÅ    PIC '(6)9',                                        00000900
                                                                        00000910
      HJ1_ÅR DEF HJ1_DATO_MÅ   POS (3) PIC '(2)9';                      00000920
                                                                        00000930
      DATO = DATE;                                                      00000940
      W_TERMINAL =  EIBTRMID;                                           00000950
                                                                        00000960
      SELECT(STYREKODE);                                                00000970
         WHEN('U3')                                                     00000980
            DO;                                                         00000990
               TRANSKODE = 'RU60';                                      00001000
               ALLOCATE S001U61O ;                                      00001010
               S001U61O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00001020
               S001U61O.REGDATOO     = DATO;                            00001030
               S001U61O.TERMIDO    = W_TERMINAL;                        00001040
               IF SUBSTR(DIV_PARAM_OMR.CICS_IND,2,1) = 'A' THEN         00001050
                  S001U61O.CICS_INFOA = '1';                            00001060
                                                                        00001070
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00001080
               /* UFØREPENSJON                                 */       00001090
               EXEC CICS SEND MAP('S001U61') MAPSET('S001U63')          00001100
                                             ERASE;                     00001110
            END;                                                        00001120
                                                                        00001130
         WHEN('EE')                                                     00001140
            DO;                                                         00001150
               TRANSKODE = 'RU80';                                      00001160
               ALLOCATE S001U81O ;                                      00001170
               S001U81O.REGDATOO      = DATO;                           00001180
               S001U81O.TERMIDO    = W_TERMINAL;                        00001190
               S001U81O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00001200
               IF SUBSTR(DIV_PARAM_OMR.CICS_IND,2,1) = 'A' THEN         00001210
                  S001U81O.CICS_INFOA = '1';                            00001220
                                                                        00001230
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00001240
               /* UFØREPENSJON                                 */       00001250
               EXEC CICS SEND MAP('S001U81') MAPSET('S001U83')          00001260
                                             ERASE;                     00001270
            END;                                                        00001280
                                                                        00001290
                                                                        00001300
         WHEN('FO')                                                     00001310
            DO;                                                         00001320
               TRANSKODE = 'RUC0';                                      00001330
               ALLOCATE S001UC1O ;                                      00001340
               S001UC1O.REGDATOO      = DATO;                           00001350
               S001UC1O.TERMIDO    = W_TERMINAL;                        00001360
               S001UC1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00001370
                                                                        00001380
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00001390
               /* UFØREPENSJON                                 */       00001400
               EXEC CICS SEND MAP('S001UC1') MAPSET('S001UC3')          00001410
                                             ERASE;                     00001420
            END;                                                        00001430
         WHEN('EN')                                                     00001440
            DO;                                                         00001450
               TRANSKODE = 'RUE0';                                      00001460
               ALLOCATE S001UE1O ;                                      00001470
               S001UE1O.REGDATOO      = DATO;                           00001480
               S001UE1O.TERMIDO    = W_TERMINAL;                        00001490
               S001UE1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00001500
                                                                        00001510
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00001520
               /* UFØREPENSJON                                 */       00001530
               EXEC CICS SEND MAP('S001UE1') MAPSET('S001UE3')          00001540
                                             ERASE;                     00001550
            END;                                                        00001560
         WHEN('KF')                                                     00001570
            DO;                                                         00001580
               TRANSKODE = 'RUJ0';                                      00001590
               ALLOCATE S001UJ1O ;                                      00001600
               S001UJ1O.REGDATOO      = DATO;                           00001610
               S001UJ1O.TERMIDO    = W_TERMINAL;                        00001620
               S001UJ1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          00001630
                                                                        00001640
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */       00001650
               /* AVTALEFESTET PENSJON NY BLANKETT             */       00001660
               EXEC CICS SEND MAP('S001UJ1') MAPSET('S001UJ3')          00001670
                                             ERASE;                     00001680
            END;                                                        00001690
                                                                        00001700
                                                                        00001710
         OTHERWISE                                                      00001720
            DO;                                                         00001730
               TRANSKODE = 'R040';                                      00001740
               RETURN                  ;                                00001750
            END;                                                        00001760
      END;                                                              00001770
                                                                        00001780
      EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);            00001790
                                                                        00001800
                                                                        00001810
 END R00104;                                                            00001820
