 /*       SIST ENDRET 13/04-94 10.08.58 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 28/12-93 14.19.19 AV   HERMAN                   */00000010
 /*       SIST ENDRET 28/12-93 13.00.45 AV   HERMAN                   */00000020
 /*       SIST ENDRET 07/12-93 14.54.17 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 25/09-92 12.20.22 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 26/09-83 08.33.34 AV   LUNDEBY                  */00000050
 /*       SIST ENDRET 23/09-83 14.16.25 AV   LUNDEBY                  */00000060
 /*       SIST ENDRET 06/04-83 14.00.23 AV   LUNDEBY                  */00000070
                                                                        00000080
                                                                        00000090
  /* **************************************************************** */00000100
  /*IDENTIFIKASJON:                                                   */00000110
  /*    R0015601 - HOVEDPROGRAM I PLI                                 */00000120
  /*                                                                  */00000130
  /*    PROGRAMMERER: S. LUNDEBY , SFK , DESEMBER 1982                */00000140
  /*                                                                  */00000150
  /*HENSIKT:                                                          */00000160
  /*    SJEKKER ROT-SEGMENTET OM PERSONEN ER SPERRET                  */00000170
  /*    OG SPERRER DET MED :                                          */00000180
  /*                                                                  */00000190
  /*    ROT_SEGM. EKSISTERTE      :      J                            */00000200
  /*    ROT_SEGM. EKSISTERTE IKKE :      D     (FOR DUMMY-SEGM)       */00000210
  /*                                                                  */00000220
  /*PROGRAMTILKNYTNING:                                               */00000230
  /*                                                                  */00000240
  /*BRUKER                                                            */00000250
  /*                                                                  */00000260
  /* **************************************************************** */00000270
                                                                        00000280
  R001560 :                                                             00000290
    PROC            (COMMAREA_PEKER)                                    00000300
           OPTIONS  (MAIN);                                             00000310
                                                                        00000320
    %PAGE;                                                              00000330
    %INCLUDE P0019906;                              /* TRANS_OPPL_OMR */00000340
                                                                        00000350
    %PAGE;                                                              00000360
    %INCLUDE P0019908;                              /* KOM_OMR        */00000370
                                                                        00000380
    %PAGE;                                                              00000390
    %INCLUDE P0019910;                              /* STYRINGS_OMR   */00000400
                                                                        00000410
    %PAGE;                                                              00000420
    %INCLUDE P0019912;                              /* DIV_PARAM_OMR  */00000430
                                                                        00000440
    %PAGE;                                                              00000450
       DCL 1 B01              BASED (B01_PEKER),                        00000460
    %INCLUDE P0019921;                              /* B01            */00000470
                                                                        00000480
    %PAGE;                                                              00000490
       DCL 1 B02              BASED (B02_PEKER),                        00000500
    %INCLUDE P0019921;                              /* B02            */00000510
                                                                        00000520
    %PAGE;                                                              00000530
    /* ************************************************************** */00000540
    /*                                                                */00000550
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00000560
    /*                                                                */00000570
    /* ************************************************************** */00000580
                                                                        00000590
       DCL                                                              00000600
         ( ADDR , CSTG , LOW , STG , SUBSTR )  BUILTIN;                 00000610
       DCL                                                              00000620
         PLITDLI ENTRY;                                                 00000630
                                                                        00000640
    /* ************************************************************** */00000650
    /*                                                                */00000660
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000670
    /*                                                                */00000680
    /* ************************************************************** */00000690
                                                                        00000700
    %INCLUDE DLIUIB;                                                    00000710
                                                                        00000720
       DCL                                                              00000730
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00000740
       DCL                                                              00000750
           COMMAREA_PEKER            POINTER;                           00000760
       DCL                                                              00000770
           W01_HJELPE_PTR            POINTER;                           00000780
                                                                        00000790
    /* ************************************************************** */00000800
    /*                                                                */00000810
    /*   OPPTELINGS- OG LOOP-PARAMETRE M.M                            */00000820
    /*                                                                */00000830
    /* ************************************************************** */00000840
                                                                        00000850
       DCL 1  W01_OMR                   UNALIGNED,                      00000860
              2   I                     FIXED  BIN  (15)     INIT ( 0 ),00000870
              2   W02_ANT_GANGER_I_WAIT FIXED  BIN  (15)     INIT ( 0 ),00000880
              2   B                            CHAR (1)      INIT (' ');00000890
                                                                        00000900
                                                                        00000910
    /* ************************************************************** */00000920
    /*                                                                */00000930
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00000940
    /*                                                                */00000950
    /* ************************************************************** */00000960
                                                                        00000970
       DCL 1  W01_DLI_PARAM,                                            00000980
              2   W02_GHU                 CHAR (4)   INIT ('GHU '),     00000990
              2   W02_ISRT                CHAR (4)   INIT ('ISRT'),     00001000
              2   W02_REPL                CHAR (4)   INIT ('REPL'),     00001010
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00001020
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00001030
              2   W02_OUT2                CHAR (20)  INIT ((20)' '),    00001040
              2   W02_SPERREBEHANDLING    BIT  (1)   INIT ('0'B),       00001050
              2   W02_PERSONEN_ER_SPERRET BIT  (1)   INIT ('1'B);       00001060
                                                                        00001070
       DCL    W01_IO                 CHAR (100)      INIT ( (100) ' '); 00001080
       DCL    W01_HJELPE_IO          CHAR (100) BASED (W01_HJELPE_PTR); 00001090
                                                                        00001100
    /* ************************************************************** */00001110
    /*                                                                */00001120
    /*   DL1 SSA-OMRÅDER FOR ROT                                      */00001130
    /*                                                                */00001140
    /* ************************************************************** */00001150
                                                                        00001160
       DCL    SSA_UQUAL                         CHAR (9)  INIT ((9)' ');00001170
                                                                        00001180
       DCL 1  SSA1_RF0PERSN          UNALIGNED,                         00001190
              2    HDEL                         CHAR (17) INIT          00001200
                   ('RF0PERSN(FNR     '),                               00001210
              2    REL_OP                       CHAR (2)  INIT (' ='),  00001220
              2    PKEY               FIXED     DEC  (11) INIT ( 0  ),  00001230
              2    HP                           CHAR (1)  INIT (')' );  00001240
                                                                        00001250
    /* ************************************************************** */00001260
    /*                                                                */00001270
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00001280
    /*                                                                */00001290
    /* ************************************************************** */00001300
                                                                        00001310
    %PAGE;                                                              00001320
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00001330
                                                                        00001340
    %PAGE;                                                              00001350
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                   00001360
    %INCLUDE P0012003;                         /* PCB                 */00001370
                                                                        00001380
                                                                        00001390
                                                                        00001400
                                                                        00001410
                                                                        00001420
    /* ************************************************************** */00001430
    /*                                                                */00001440
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00001450
    /*     ---------------------------------------------------        */00001460
    /*                                                                */00001470
    /*                                                                */00001480
    /*      INITIERING AV PARAMETRE TIL DIV_PARAM_OMR.                */00001490
    /*                                                                */00001500
    /*      SETTER UIBPTR = UIB_PEKER   SOM OVERFØRES ETTER           */00001510
    /*      INITIERINGS-KALL   I     R0012001 .                       */00001520
    /*                                                                */00001530
    /* ************************************************************** */00001540
                                                                        00001550
    DB_STATUS_KODE                          =   '  '         ;          00001560
    PROGRAM_ID                              =   'R0015601'   ;          00001570
    UIBPTR                                  =    UIB_PEKER   ;          00001580
                                                                        00001590
    /* ********************************************************** */    00001600
    /*        SJEKKER OM SPERRE-BEHANDLING SKAL UTFØRES           */    00001610
    /* ********************************************************** */    00001620
                                                                        00001630
    CALL P010_SPERREBEHANDLING;                                         00001640
                                                                        00001650
                                                                        00001660
    /* ********************************************************** */    00001670
    /*        SJEKKER ROT-SEGM FINNES FRA FØR.                    */    00001680
    /* ********************************************************** */    00001690
                                                                        00001700
    SSA1_RF0PERSN.PKEY                      =    SEARCH_FNR  ;          00001710
    CALL P020_LES_ROT_GHU;                                              00001720
                                                                        00001730
    IF   DLIUIB.UIBFCTR                    ^=    UIB_RC_OK         THEN 00001740
      DO;                                                               00001750
         /* ********************************************** */           00001760
         /* UIB'S RETURCODE ER UAKSEPTABEL                 */           00001770
         /* ********************************************** */           00001780
  L100:                                                                 00001790
         FEIL_MELD_NR                 =   500;                          00001800
         FEIL_VED_LABEL               =  '100';                         00001810
         GO TO L999;                                                    00001820
      END;                                                              00001830
                                                                        00001840
                                                                        00001850
    DO   WHILE ( W02_PERSONEN_ER_SPERRET );                             00001860
     SELECT    ( RF1.STATUS_KODE);                                      00001870
      WHEN     ('  ')                                                   00001880
        /* ****************************************************** */    00001890
        /*                                                        */    00001900
        /*   PERSONEN FINNES I DB. PERSON-OPPLYSNINGENE           */    00001910
        /*   LEGGES I B01 .                                       */    00001920
        /*                                                        */    00001930
        /*   UNDERSØKER OM HAN ER SPERRET :                       */    00001940
        /*   1. GANG FORUTSETTES PERSONEN SPERRET .               */    00001950
        /*                                                        */    00001960
        /*   HVIS IKKE :                                          */    00001970
        /*   -----------                                          */    00001980
        /*     SPERRE-KODEN SETTES LIK  J  FOR Å VISE AT PERSONEN */    00001990
        /*     ER UNDER BEHANDLING OG ROT-SEGM. LEGGES UT IGJEN   */    00002000
        /*     MED SPERRE-KODEN .                                 */    00002010
        /*                                                        */    00002020
        /*   HVIS :                                               */    00002030
        /*   -----------                                          */    00002040
        /*     GÅR PROGRAMMET I WAIT OG PRØVER PÅ NYTT ETTER EN   */    00002050
        /*     GITT PERIODE .                                     */    00002060
        /*                                                        */    00002070
        /* ****************************************************** */    00002080
                                                                        00002090
        DO;                                                             00002100
          /* ************************************************** */      00002110
          /* NULLSTILLER SPERRE-KODEN I DO-LØKKEN.              */      00002120
          /* ************************************************** */      00002130
                                                                        00002140
          W02_PERSONEN_ER_SPERRET   =   '0'B ;                          00002150
                                                                        00002160
          SUBSTR            (ADDR (B01.RF0PERSN (POS_I_B01) )           00002170
           -> W01_HJELPE_IO,1,STG (B01.RF0PERSN (POS_I_B01)))           00002180
                              =    W01_IO;                              00002190
                                                                        00002200
          /* ************************************************** */      00002210
          /* HVIS IKKE FORESØRSEL :                             */      00002220
          /*      SJEKKER OM PERSONEN ER SPERRET                */      00002230
          /* ************************************************** */      00002240
                                                                        00002250
          IF W02_SPERREBEHANDLING                            THEN       00002260
                                                                        00002270
            IF  B01.RF0PERSN.SPERRE (POS_I_B01)    ^= ' '    THEN       00002280
                W02_PERSONEN_ER_SPERRET             = '1'B      ;       00002290
            ELSE                                                        00002300
              DO;                                                       00002310
                 B01.RF0PERSN.SPERRE    (POS_I_B01) = ' '       ;       00002320
                 W01_HJELPE_PTR                     =                   00002330
                     ADDR (B01.RF0PERSN (POS_I_B01))            ;       00002340
              END;                                                      00002350
                                                                        00002360
                                                                        00002370
          /* ************************************************** */      00002380
          /*                                                    */      00002390
          /* HVIS PERSON ER SPERRET GÅR PROGRAMMET I WAIT       */      00002400
          /* OG PRØVER PÅ NYTT ETTER   X  SEK.                  */      00002410
          /*                                                    */      00002420
          /* ETTER 5 FORSØK TERMINERER PROGRAMMET OG GÅR UT MED */      00002430
          /* MELDING OM AT PERSONEN ER UNDER BEHANDLING AV EN   */      00002440
          /* ANNEN TRANS. OPERATØREN BØR VENTE EN STUND OG      */      00002450
          /* FORSØKE PÅ NYTT .                                  */      00002460
          /*                                                    */      00002470
          /* ************************************************** */      00002480
                                                                        00002490
          IF   W02_PERSONEN_ER_SPERRET                 THEN             00002500
                                                                        00002510
            IF W02_ANT_GANGER_I_WAIT  <   5            THEN             00002520
              DO;                                                       00002530
                W02_OUT2        = ' CICS DELAY  5      ';               00002540
                CALL P020_LES_ROT_GHU;                                  00002550
                W02_ANT_GANGER_I_WAIT  =   W02_ANT_GANGER_I_WAIT + 1;   00002560
              END;                                                      00002570
            ELSE                                                        00002580
              DO;                                                       00002590
                /* ********************************************** */    00002600
                /* PERSONEN BEHANDLES AV EN ANNEN TRANS           */    00002610
                /* VIDERE BEHANDLING AVBRYTES .                   */    00002620
                /* ********************************************** */    00002630
  L110:                                                                 00002640
                FEIL_MELD_NR                 =   499;                   00002650
                FEIL_VED_LABEL               =  '110';                  00002660
                GO TO L999;                                             00002670
              END;                                                      00002680
          ELSE                                                          00002690
            DO;                                                         00002700
              /* ************************************************ */    00002710
              /*                                                  */    00002720
              /* PERSONEN  ER IKKE UNDER BEHANDLING .             */    00002730
              /*                                                  */    00002740
              /* HVIS IKKE FORESPØRSEL :                          */    00002750
              /* -----------------------                          */    00002760
              /*     SPERRE-KODEN ER SATT OG RFOPERSN OPPDATERES  */    00002770
              /*     MED DEN                                      */    00002780
              /*                                                  */    00002790
              /* ************************************************ */    00002800
                                                                        00002810
              IF W02_SPERREBEHANDLING                           THEN    00002820
                DO;                                                     00002830
                  W01_IO                =     W01_HJELPE_IO;            00002840
                  CALL PLITDLI               (W02_PARM_CT_3,            00002850
                                              W02_REPL,                 00002860
                                              RF1,                      00002870
                                              W01_IO);                  00002880
                                                                        00002890
                  IF  RF1.STATUS_KODE  ^=     '  '                      00002900
                    ! UIBFCTR          ^=     UIB_RC_OK    THEN         00002910
                    DO;                                                 00002920
                      /* *************************************** */     00002930
                      /*  FEIL VED REPLACE AV ROT-SEGM .         */     00002940
                      /* *************************************** */     00002950
  L120:                                                                 00002960
                      FEIL_MELD_NR        =  500;                       00002970
                      FEIL_VED_LABEL      = '120';                      00002980
                      DB_STATUS_KODE      =  RF1.STATUS_KODE;           00002990
                      GO TO L999;                                       00003000
                    END;                                                00003010
                END;                                                    00003020
            END;      /*  ELSE                                    */    00003030
        END;          /*  WHEN  ( '  ' )                          */    00003040
                                                                        00003050
      WHEN ('GE')                                                       00003060
        /* ****************************************************** */    00003070
        /*      PERSONEN FINNES IKKE I DB.                        */    00003080
        /*                                                        */    00003090
        /* HVIS IKKE FORESPØRSEL ELLER FJERNING :                 */    00003100
        /* --------------------------------------                 */    00003110
        /*                                                        */    00003120
        /*     OPPRETTER ET FORELØPIG ROTSEGMENT MED SPERRE       */    00003130
        /*     SPERRE-KODEN    =  D    FOR DUMMY-SEGMENT          */    00003140
        /*     ---------------------                              */    00003150
        /* ****************************************************** */    00003160
        DO;                                                             00003170
    /*    IF FUNKSJONSKODE        ^= 'R'   &        */                  00003180
          IF EIBTRNID             ^= 'RF05'    THEN                     00003190
             DO;                                                        00003200
                EXEC CICS LINK PROGRAM('R0015602') COMMAREA (KOM_OMR);  00003210
                IF FEIL_MELD_NR  > 0      THEN                          00003220
                   GOTO L999;                                           00003230
                                                                        00003240
             END;                                                       00003250
                                                                        00003260
          IF FUNKSJONSKODE        ^= 'F'       &                        00003270
             FUNKSJONSKODE        ^= 'E'       &                        00003280
             EIBTRNID             ^= 'RF05'    THEN                     00003290
             DO;                                                        00003300
              B01.RF0PERSN.SPERRE (POS_I_B01)   =  ' ';                 00003310
              B01.RF0PERSN.FNR    (POS_I_B01)   =   SEARCH_FNR;         00003320
              B01.RF0PERSN.TKNR   (POS_I_B01)   =   0101;               00003330
              W01_HJELPE_PTR        =  ADDR (B01.RF0PERSN (POS_I_B01)); 00003340
                                                                        00003350
                                                                        00003360
              W01_IO                =       W01_HJELPE_IO;              00003370
              SSA_UQUAL             =      'RF0PERSN ';                 00003380
              CALL PLITDLI                 (W02_PARM_CT_4,              00003390
                                            W02_ISRT,                   00003400
                                            RF1,                        00003410
                                            W01_IO,                     00003420
                                            SSA_UQUAL);                 00003430
                                                                        00003440
              IF   RF1.STATUS_KODE ^=       '  '                        00003450
                !  UIBFCTR         ^=       UIB_RC_OK        THEN       00003460
                DO;                                                     00003470
                   /* *********************************************** */00003480
                   /*  FEIL VED INSERT AV DUMMY - SEGM .              */00003490
                   /* *********************************************** */00003500
  L130:                                                                 00003510
                   DB_STATUS_KODE  =  RF1.STATUS_KODE;                  00003520
                   FEIL_MELD_NR    =  500;                              00003530
                   FEIL_VED_LABEL  = '130';                             00003540
                   GO TO L999;                                          00003550
                END;                                                    00003560
            END;      /*    IF  FUNKSJONSKODE  ^= 'F'         */        00003570
                                                                        00003580
          /* ************************************************ */        00003590
          /*   SETTER SPERRE-KODEN = FALSE  (DO-LØKKEN)       */        00003600
          /*   NULLSTILLER RF0PERSN                           */        00003610
          /* ************************************************ */        00003620
                                                                        00003630
          W02_PERSONEN_ER_SPERRET             =   '0'B ;                00003640
                                                                        00003650
          B01.RF0PERSN.FNR    (POS_I_B01)     =    0   ;                00003660
          B01.RF0PERSN.TKNR   (POS_I_B01)     =    0   ;                00003670
          B01.RF0PERSN.SPERRE (POS_I_B01)     =   ' '  ;                00003680
        END;                                                            00003690
                                                                        00003700
      OTHERWISE                                                         00003710
        DO;                                                             00003720
          /* ************************************************ */        00003730
          /*    UGYLDIG STATUSKODE FRA DLI                    */        00003740
          /* ************************************************ */        00003750
  L140:                                                                 00003760
          FEIL_MELD_NR    =  500;                                       00003770
          FEIL_VED_LABEL  = '140';                                      00003780
          DB_STATUS_KODE  =  RF1.STATUS_KODE;                           00003790
          GO TO L999;                                                   00003800
        END;                                                            00003810
     END;     /*   SELECT : STATUS-KODE ETTER KALL MOT ROT  */          00003820
                                                                        00003830
    END;      /*   DO WHILE PERSON_ER_SPERRET               */          00003840
                                                                        00003850
                                                                        00003860
                                                                        00003870
    %PAGE;                                                              00003880
    /* ************************************************************** */00003890
    /*                                                                */00003900
    /* PROCEDURE FOR SJEKKE OM SPERRE-BEHANDLINGNE SKAL UTFØRES       */00003910
    /*                                                                */00003920
    /* ************************************************************** */00003930
                                                                        00003940
    P010_SPERREBEHANDLING:                                              00003950
      PROC;                                                             00003960
                                                                        00003970
         W02_SPERREBEHANDLING            =  '1'B;                       00003980
                                                                        00003990
         SELECT   ( FUNKSJONSKODE );                                    00004000
                                                                        00004010
            WHEN  ( 'F' )                                               00004020
                                                                        00004030
               /************************************************** */   00004040
               /*   FORESPØRSEL                                    */   00004050
               /************************************************** */   00004060
                                                                        00004070
               W02_SPERREBEHANDLING  =  '0'B;                           00004080
                                                                        00004090
            WHEN  ( 'E' )                                               00004100
                                                                        00004110
               /************************************************** */   00004120
               /* ENDRING . SJEKKER OM PERSONEN ER LEST INN FØR .  */   00004130
               /************************************************** */   00004140
                                                                        00004150
               DO I = 1 TO 14  WHILE  ( W02_SPERREBEHANDLING );         00004160
                                                                        00004170
                  IF SEARCH_FNR               =  B02.FNR (I)  THEN      00004180
                     W02_SPERREBEHANDLING     =  '0'B      ;            00004190
               END;                                                     00004200
                                                                        00004210
            OTHERWISE ;                                                 00004220
                                                                        00004230
         END;   /*   SELECT  (FUNKSJONSKODE)                     */     00004240
                                                                        00004250
    END P010_SPERREBEHANDLING;                                          00004260
                                                                        00004270
                                                                        00004280
                                                                        00004290
                                                                        00004300
    %PAGE;                                                              00004310
    /* ************************************************************** */00004320
    /*                                                                */00004330
    /* PROCEDURE FOR LESE ROT-SEGM              ( GHU   )             */00004340
    /*                                                                */00004350
    /* ************************************************************** */00004360
                                                                        00004370
    P020_LES_ROT_GHU:                                                   00004380
      PROC;                                                             00004390
                                                                        00004400
      CALL PLITDLI                              (W02_PARM_CT_4,         00004410
                                                 W02_GHU,               00004420
                                                 RF1,                   00004430
                                                 W01_IO,                00004440
                                                 SSA1_RF0PERSN);        00004450
    END P020_LES_ROT_GHU;                                               00004460
                                                                        00004470
                                                                        00004480
  L999:                                                                 00004490
                                                                        00004500
    EXEC CICS RETURN;                                                   00004510
  END    R001560;                                                       00004520
