 /*       SIST ENDRET 06/04-94 14.53.32 AV   DYBVIK                   */00000000
 /* ***************************************************************** */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /* **********************                                            */00000030
 /*  PROGRAM-IDENT : R001IA09 - SUBPROGRAM - FLYTTER OO         FRA   */00000040
 /*                                          MAP TIL ARBEIDSOMRÅDE    */00000050
 /*  PROGRAM-SPRÅK : PLI                                              */00000060
 /*  PROGRAMMERER  : PATAHK                                           */00000070
 /*  PROGRAMMET BLE LAGET : FEB 1994                                  */00000080
 /* **********                                                        */00000090
 /*HENSIKT:                                                           */00000100
 /* **********                                                        */00000110
 /*  OVERFØRER DATA FRA SKJERMBILDE                                   */00000120
 /*  - MAP S001IA1 - TIL OO_TRANS_OMR.                                */00000130
 /*  DATA SOM OVERFØRES ER OO_SØKER OG OO_SPES - MEN IKKE OO_BARN     */00000140
 /*                                                                   */00000150
 /* ***************************************************************** */00000160
 /*PROGRAMTILKNYTTING:                                                */00000170
 /* ********************                                              */00000180
 /*  PROGRAMMET INCLUDES AV R001IA01 - KONTROLL_GRUNNBLANKETT_OO      */00000190
 /*  ALLE CICS-KOMMANDOS LIGGER I HOVEDPROG.                          */00000200
 /*  ARBEIDSOMRÅDET - P001IA01 - ER INCLUDET I HOVEDPROG.             */00000210
 /*  DE INTERNE PROSEDYRER ER :                                       */00000220
 /*    BLANK_OO_MAP:      BLANKER MAPEN                               */00000230
 /*    OVERFØR_OO_SØKER:  OVERFØRER OODELEN MAP->ARBEIDSOMRÅDE        */00000240
 /*    OVERFØR_OO_SPES:   OVERFØRER SPESIELL DEL MAP->ARBEIDSOMRÅDE   */00000250
 /*                                                                   */00000260
 /* ***************************************************************** */00000270
 %PAGE;                                                                 00000280
                                                                        00000290
   BLANK_OO_MAP:                                                        00000300
   PROC;                                                                00000310
   DCL                                                                  00000320
      LOW BUILTIN;                                                      00000330
        S001IA1O.FRA_FNRO   = 0;                                        00000340
        S001IA1O.TIL_FNRO   = 0;                                        00000350
        S001IA1O.START_ÅRO   = 0;                                       00000360
        S001IA1O.BARN_ANTTALO = 0;                                      00000370
        DO K = 1 TO 12;                                                 00000380
           S001IA1O.FNR_BARNO(K) =  LOW(11);                            00000390
   /*                                                                   00000400
        S001IA1O.FRA_ÅRO (K)   = LOW(2);                                00000410
        S001IA1O.TYPEO (K) = ' ';                                       00000420
        S001IA1O.INNTEKTO (K) = LOW(9);                                 00000430
   */                                                                   00000440
        END;                                                            00000450
                                                                        00000460
        S001IA1O.MELDING1O = (78)' ';                                   00000470
        S001IA1O.MELDING2O = (78)' ';                                   00000480
        S001IA1O.MELDING3O = (78)' ';                                   00000490
        S001IA1O.MELDING4O = (78)' ';                                   00000500
        S001IA1O.MELDING5O = (78)' ';                                   00000510
        S001IA1O.MELDING6O = (78)' ';                                   00000520
                                                                        00000530
   END BLANK_OO_MAP;                                                    00000540
                                                                        00000550
                                                                        00000560
                                                                        00000570
                                                                        00000580
 %PAGE;                                /*   */                          00000590
 /* ***************************************************************** */00000600
 /*                                                                   */00000610
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,                    */00000620
 /*   EVENTUELT ENDRET PÅ SKJERMBILDET TIL OO_TRANS_OMR I             */00000630
 /*   KOM_OMR FOR OO_SØKER.                                           */00000640
 /*           MAPSET:  S001UE3   MAP S001IA1                          */00000650
 /*                                                                   */00000660
 /* ***************************************************************** */00000670
 %SKIP;                                                                 00000680
   OVERFØR_OO_SØKER:                                                    00000690
   PROC;                                                                00000700
   DCL LI    FIXED DEC (2);                                             00000710
                                                                        00000720
        IF S001IA1I.FRA_FNRL > 0 THEN                                   00000730
           OOS.FRA_FNR = S001IA1I.FRA_FNRI;                             00000740
                                                                        00000750
        IF S001IA1I.TIL_FNRL > 0 THEN                                   00000760
           OOS.TIL_FNR = S001IA1I.TIL_FNRI;                             00000770
                                                                        00000780
        IF S001IA1I.START_ÅRL > 0 THEN                                  00000790
           OOS.START_ÅR = S001IA1I.START_ÅRI;                           00000800
                                                                        00000810
        IF S001IA1I.BARN_ANTTALL > 0 THEN                               00000820
           OOS.BARN_ANTTAL  = S001IA1I.BARN_ANTTALI;                    00000830
                                                                        00000840
        DO K = 1 TO 12;                                                 00000850
                                                                        00000860
           IF S001IA1I.FNR_BARNL(K) > 0 THEN                            00000870
              DO;                                                       00000880
                  OOB.FNR_BARN(K) = S001IA1I.FNR_BARNI(K);              00000890
              END;                                                      00000900
        END;                                                            00000910
                                                                        00000920
                                                                        00000930
   END OVERFØR_OO_SØKER;                                                00000940
 %PAGE;                                /*   */                          00000950
 /* ***************************************************************** */00000960
