 /*       SIST ENDRET 16/07-96 11.00.56 AV   HLB0310                  */00000000
 /*       SIST ENDRET 31/01-96 09.19.17 AV   JDA0310                  */00000010
 /*       SIST ENDRET 07/07-95 09.19.53 AV   JDA0310                  */00000020
 /*       SIST ENDRET 25/07-94 13.55.34 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 12/03-92 11.16.55 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 10/03-92 11.28.17 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 28/02-92 12.54.38 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 13/01-92 14.13.51 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 31/07-91 13.06.48 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 11/07-91 14.25.30 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 28/06-91 13.33.07 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 21/06-91 10.31.22 AV   HERMAN                   */00000110
 /*       SIST ENDRET 26/04-91 12.21.34 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 15/04-91 14.17.46 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 08/04-91 12.10.49 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 16/01-91 14.55.39 AV   HERMAN                   */00000150
 /*       SIST ENDRET 11/12-90 13.37.15 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 26/03-90 12.56.19 AV   HERMAN                   */00000170
 /*       SIST ENDRET 19/12-89 15.04.33 AV   HERMAN                   */00000180
 /*       SIST ENDRET 14/04-89 15.06.30 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 12/04-88 15.18.41 AV   HERMAN                   */00000200
 /*       SIST ENDRET 29/03-88 13.25.51 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 23/03-88 12.39.00 AV   DYBVIK                   */00000220
 /*       SIST ENDRET 08/03-88 11.29.14 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 12/01-88 11.07.07 AV   DYBVIK                   */00000240
 /*       SIST ENDRET 19/03-87 11.37.13 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 11/03-87 14.40.34 AV   DYBVIK                   */00000260
 /*       SIST ENDRET 21/04-86 10.06.25 AV   DYBVIK                   */00000270
 /*       SIST ENDRET 07/03-86 10.33.04 AV   ANNE                     */00000280
 /*       SIST ENDRET 26/01-84 10.58.09 AV   JANKR                    */00000290
 /* ***************************************************************** */00000300
 /* IDENTIFIKASJON                                                    */00000310
 /*     R0019F01 - AUTOHENDELSE_BEREGNING                             */00000320
 /*                ALDERSKONVERTERING - CICS-HOVEDPROG I PLI          */00000330
 /*     PROGRAMMERER: TOM JØRGENSEN, OKTOBER 1982.                    */00000340
 /* HENSIKT                                                           */00000350
 /*     SE FORKLARING NEDENFOR.                                       */00000360
 /* ***************************************************************** */00000370
 /* ***************************************************************** */00000380
 /* GRUNNBELØPS-ENDRING                                               */00000390
 /*        PROGRAMMET LESER SEKVENSIELT GJENNOM PEPO-BASEN.           */00000400
 /*           NÅR EN PERSON MED PENSJON ELLER EN FORSØRGET PERSON     */00000410
 /*           BLIR LEST SKAL FØLGENDE SKJE:                           */00000420
 /*              - UNDERSØKE OM PERSONEN PASSERER ALDERSGRENSEN       */00000430
 /*                18, 20, 67 ELLER 70 ÅR.                            */00000440
 /*              - HVIS PERSONEN PASSERER EN AV OVERNEVNTE GRENSER    */00000450
 /*                SKAL SISTE STATUS TIL PERSONENS FAMILIE OPPRETTES  */00000460
 /*                VED HJELP AV MODULEN                               */00000470
 /*                OPPRETT-SISTE-STATUS-FOR-FAMILIEN-BATCH            */00000480
 /*              - FAMILIEN BLIR BEHANDLET AV MODULEN AUTOBEREGNING   */00000490
 /*                OG RESULTATET BLIR SKREVET UT PÅ PEPO-BASEN,       */00000500
 /*                STØNADSBREV-BASEN OG TRANS-STATISTIKK-BASEN.       */00000510
 /*                                                                   */00000520
 /* ***************************************************************** */00000530
                                                                        00000540
 R0019F: PROC(COMMAREA_PEKER)                  OPTIONS (MAIN);          00000550
                                                                        00000560
                                                                        00000570
 %PAGE;                                                                 00000580
 %INCLUDE P0019906;               /* TRANS_OPPL_OMR                   */00000590
 %PAGE;                                                                 00000600
 %INCLUDE P0019908;               /* KOM_OMR                          */00000610
 %PAGE;                                                                 00000620
 %INCLUDE P0019910;               /* STYRINGSOMRÅDE                   */00000630
 %PAGE;                                                                 00000640
 %INCLUDE P0019912;               /* DIV_PARAM_OMR                    */00000650
 %PAGE;                                                                 00000660
 %INCLUDE P0014009;               /* POTALL_OPPL                      */00000670
 %PAGE;                                                                 00000680
 %INCLUDE P0019924;               /* G_V_TAB                          */00000690
 %PAGE;                                                                 00000700
 %INCLUDE P0019925;               /* G_TAB                            */00000710
 %PAGE;                                                                 00000720
 %INCLUDE P0019014;               /* FNR_TAB                          */00000730
 %PAGE;                                                                 00000740
 %INCLUDE S0019F;                 /* MAP TIL ALDERSKONVERTERING       */00000750
 %PAGE;                                                                 00000760
   DCL 1 B00     BASED (B00_PEKER),                                     00000770
 %INCLUDE P0019921;                                                     00000780
 %PAGE;                                                                 00000790
   DCL 1 B01     BASED (B01_PEKER),                                     00000800
 %INCLUDE P0019921;                                                     00000810
 %PAGE;                                                                 00000820
   DCL 1 B02     BASED (B02_PEKER),                                     00000830
 %INCLUDE P0019921;                                                     00000840
   DCL 1 WORK_TRANS_LISTE UNAL BASED (WORK_TRANS_LISTE_PEKER),          00000850
 %INCLUDE P0019911;                                                     00000860
                                                                        00000870
 %PAGE;                                                                 00000880
 %INCLUDE DLIUIB;                                                       00000890
 %PAGE;                                                                 00000900
 %INCLUDE P0012002;   /* PCB - PEKER - OMR    */                        00000910
 %PAGE;                                                                 00000920
    DCL PLITDLI ENTRY;                                                  00000930
                                                                        00000940
    DCL 1 SEGMENTER,                                                    00000950
                                                                        00000960
           2 ROTSEGM,                                                   00000970
              3 FNR              FIXED DEC (11),                        00000980
              3 NAVN             CHAR(25),                              00000990
              3 TKNR             FIXED DEC (5),                         00001000
              3 SPROG            CHAR(1),                               00001010
              3 AI               FIXED DEC (5),                         00001020
              3 SPERRE           CHAR(1),                               00001030
                                                                        00001040
           2 STATUSSEGM,                                                00001050
              %INCLUDE P0019930;                                        00001060
                                                                        00001070
    DCL 1 TILKNSEGM,                                                    00001080
              %INCLUDE P0019931;                                        00001090
                                                                        00001100
    DCL 1 RF1 BASED (RF1_PCB_PEKER),                                    00001110
 %INCLUDE P0012003;                                                     00001120
    DCL 1 RF4 BASED (RF4_PCB_PEKER),                                    00001130
 %INCLUDE P0012003;                                                     00001140
                                                                        00001150
    DCL EN   FIXED BIN (31) INIT (1);                                   00001160
    DCL TO   FIXED BIN (31) INIT (2);                                   00001170
    DCL TRE  FIXED BIN (31) INIT (3);                                   00001180
    DCL FIRE FIXED BIN (31) INIT (4);                                   00001190
    DCL FEM  FIXED BIN (31) INIT (5);                                   00001200
    DCL SEKS FIXED BIN (31) INIT (6);                                   00001210
                                                                        00001220
    DCL KODE CHAR(2);                                                   00001230
                                                                        00001240
                                                                        00001250
    DCL 1 SSA_ROT_GU,                                                   00001260
           2 SSA_ROT_NAVN      CHAR(11) INIT ('RF0PERSN*D('),           00001270
           2 FELT1             CHAR(8)  INIT ('FNR     '),              00001280
           2 RELOOP1           CHAR(2)  INIT (' ='),                    00001290
           2 FNR               FIXED DEC (11),                          00001300
           2 HØYRE_PARENTES    CHAR(1)  INIT (')');                     00001310
                                                                        00001320
    DCL 1 SSA_ROT,                                                      00001330
           2 SSA_ROT_NAVN      CHAR(11) INIT ('RF0PERSN*D ');           00001340
                                                                        00001350
    DCL 1 SSA_STATUS,                                                   00001360
           2 SSA_STATUS_FELT   CHAR(11) INIT ('STATUS  *P('),           00001370
           2 FELT1             CHAR(8)  INIT ('STATKODE'),              00001380
           2 RELOOP1           CHAR(2)  INIT (' ='),                    00001390
           2 SSA_STATUS_KODE   CHAR(1)  INIT ('S'),                     00001400
           2 CONC              CHAR(1)  INIT ('&'),                     00001410
           2 FELT2             CHAR(8)  INIT ('STKODHST'),              00001420
           2 RELOOP2           CHAR(2)  INIT (' ='),                    00001430
           2 SSA_STATUS_HIST   CHAR(1)  INIT (' '),                     00001440
           2 HØYRE_PARENTES    CHAR(1)  INIT (')');                     00001450
                                                                        00001460
                                                                        00001470
    DCL SSA_UQUAL              CHAR(9)  INIT ('STATUS   ');             00001480
                                                                        00001490
 %PAGE;                                                                 00001500
                                                                        00001510
                                                                        00001520
    DCL 1 REC_TIL_OSLO_TKR,                                             00001530
          2 FNR                   PIC'(11)9',                           00001540
          2 NAVN                  CHAR(25),                             00001550
          2 TYPE                  PIC '9';                              00001560
                                                                        00001570
                                                                        00001580
    DCL COMMAREA_PEKER    POINTER;                                      00001590
    DCL BMSMAPBR          POINTER;                                      00001600
    DCL (UNSPEC,ADDR,VERIFY,                                            00001610
         DATE,NULL, CSTG)      BUILTIN;                                 00001620
    DCL W_GRUNNBL_DATO    FIXED DEC (7);                                00001630
                                                                        00001640
                                                                        00001650
    DCL DAGENS_DATO      CHAR (6)                                  ;    00001660
                                                                        00001670
    DCL DAGENS_DATO_ÅR   DEF  DAGENS_DATO POS (1) PIC '99'         ,    00001680
        DAGENS_DATO_MND  DEF  DAGENS_DATO POS (3) PIC '99'         ,    00001690
        DAGENS_DATO_DAG  DEF  DAGENS_DATO POS (5) PIC '99'         ;    00001700
                                                                        00001710
    DCL W_DATO           CHAR (6)                                  ;    00001720
                                                                        00001730
    DCL W_DATO_DAG       DEF  W_DATO      POS (1) PIC '99'         ,    00001740
        W_DATO_MND       DEF  W_DATO      POS (3) PIC '99'         ,    00001750
        W_DATO_ÅR        DEF  W_DATO      POS (5) PIC '99'         ;    00001760
                                                                        00001770
    DCL MELDING           CHAR(78) INIT((78)' ');                       00001780
    DCL MELD2             CHAR(78) INIT((78)' ');                       00001790
                                                                        00001800
    DCL AVBRUDD BIT(1) INIT ('0'B);                                     00001810
    DCL OK      BIT(1) INIT ('1'B);                                     00001820
                                                                        00001830
    DCL W01_GET CHAR(4) INIT  ('GU  ');                                 00001840
                                                                        00001850
    DCL SSAKVAL CHAR(9) INIT ('         ');                             00001860
                                                                        00001870
    DCL PICX4              PIC'(4)9'       INIT (0);                    00001880
    DCL PICX4_POS1         PIC'(2)9'  DEF  PICX4 POS(1);                00001890
    DCL PICX4_POS3         PIC'(2)9'  DEF  PICX4 POS(3);                00001900
                                                                        00001910
    DCL START_TID           PIC'999B99B99'  INIT(0);                    00001920
    DCL SLUTT_TID           PIC'999B99B99'  INIT(0);                    00001930
    DCL RBA_PEKER           POINTER;                                    00001940
    DCL FEIL_RBA            POINTER;                                    00001950
                                                                        00001960
    DCL SYNC_POINT_TELL FIXED BIN (15) INIT(1);                         00001970
    DCL BRI_PROT_MDT    CHAR(1)        INIT('Z');                       00001980
    DCL PERIODE         FIXED BIN (15);                                 00001990
    DCL FIXED_BIN15     FIXED BIN (15);                                 00002000
    DCL LINJE_TELL      FIXED BIN (15);                                 00002010
    DCL W_SØKER_IND     FIXED BIN (15);                                 00002020
    DCL BARN_IND        FIXED BIN (15);                                 00002030
    DCL TILKN_IND       FIXED BIN (15);                                 00002040
    DCL PLASS_I_B02_IND FIXED BIN (15);                                 00002050
    DCL LOOP            FIXED BIN (15);                                 00002060
    DCL I               FIXED BIN (15);                                 00002070
    DCL J               FIXED DEC (3);                                  00002080
    DCL K               FIXED DEC (3);                                  00002090
    DCL IJ              FIXED DEC (7);                                  00002100
    DCL ALDER           FIXED DEC (5);                                  00002110
                                                                        00002120
    DCL SSA_IND         CHAR(9) INIT ('ROT_STAT');                      00002130
    DCL PIC11           PIC '(11)9';                                    00002140
    DCL PIC6            PIC '(6)9',                                     00002150
        PIC4_DEF_PIC6   PIC '(4)9' DEF PIC6 POS(1);                     00002160
    DCL PIC4            PIC '(4)9',                                     00002170
        PIC4_POS1       PIC '(2)9' DEF PIC4 POS(1),                     00002180
        PIC4_POS3       PIC '(2)9' DEF PIC4 POS(3);                     00002190
    DCL PIC7            PIC '(7)9',                                     00002200
        PIC7_POS_7      PIC '(1)9' DEF PIC7 POS(7),                     00002210
        PIC7_POS_6_7    PIC '(2)9' DEF PIC7 POS(6),                     00002220
        PIC7_POS_5_7    PIC '(3)9' DEF PIC7 POS(5),                     00002230
        PIC7_POS_4_7    PIC '(4)9' DEF PIC7 POS(4),                     00002240
        PIC7_POS_3_7    PIC '(5)9' DEF PIC7 POS(3),                     00002250
        PIC7_POS_2_7    PIC '(6)9' DEF PIC7 POS(2);                     00002260
    DCL W_ROT_FNR       PIC '(11)9';                                    00002270
    DCL ROT_KJONN       DEF W_ROT_FNR POS(9) PIC '9';                   00002280
    DCL W_BA_FNR        PIC '(11)9';                                    00002290
    DCL BA_KJONN        DEF W_BA_FNR POS(9) PIC '9';                    00002300
    DCL W_FNR           PIC '(11)9';                                    00002310
                                                                        00002320
    DCL ANT_OMR_FAM     PIC '(07)9'INIT (0),                            00002330
        ANT_OMR_FAMX DEF ANT_OMR_FAM   CHAR (07);                       00002340
                                                                        00002350
    DCL ANT_LEST_STATUS  PIC '(07)9'INIT (0),                           00002360
        ANT_LEST_STATUSX DEF ANT_LEST_STATUS  CHAR (07);                00002370
                                                                        00002380
    DCL GRUNN_OMR1      CHAR      (1202);                               00002390
    DCL GRUNN_OMR2      CHAR      (1202);                               00002400
    DCL GRUNN_IDENT     CHAR      ( 8);                                 00002410
                                                                        00002420
    DCL 1 FEIL_STRUC,                                                   00002430
          2 FEIL_NR        FIXED DEC(5),                                00002440
          2 FEIL_MELDING   CHAR(78),                                    00002450
          2 KOM_OMR_PEKER  POINTER;                                     00002460
                                                                        00002470
                                                                        00002480
    ON ERROR SNAP                                                       00002490
    BEGIN;                                                              00002500
       ON ERROR SYSTEM;                                                 00002510
       MELDING = 'STOPP PÅ GRUNN AV PLI - ABEND, HOVEDFØDSELSNUMMER: '!!00002520
                  W_FNR;                                                00002530
       GOTO SLUTT;                                                      00002540
    END;                                                                00002550
                                                                        00002560
                                                                        00002570
    START_TID  = EIBTIME;                                               00002580
    ALLOCATE PCB_UIB_PEKER_OMR;                                         00002590
    ALLOCATE WORK_TRANS_LISTE;                                          00002600
    ALLOCATE FNRTAB;                                                    00002610
    ALLOCATE B00;                                                       00002620
    ALLOCATE B01;                                                       00002630
    ALLOCATE B02;                                                       00002640
    ALLOCATE POTALL_OPPL;                                               00002650
    ALLOCATE GV_TAB_RE                                                ; 00002660
    ALLOCATE G_TAB_RE                                                 ; 00002670
                                                                        00002680
    KOM_OMR.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);              00002690
    KOM_OMR.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);            00002700
    KOM_OMR.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);             00002710
    KOM_OMR.GV_PEKER         = ADDR (GRUNN_OMR1   ) ;                   00002720
    KOM_OMR.G_PEKER          = ADDR (GRUNN_OMR2   ) ;                   00002730
    FEIL_STRUC.KOM_OMR_PEKER = COMMAREA_PEKER;                          00002740
                                                                        00002750
                                                                        00002760
    B00           = '';                                                 00002770
    B01           = '';                                                 00002780
    B02           = '';                                                 00002790
    SEGMENTER     = '';                                                 00002800
    POTALL_OPPL   = '';                                                 00002810
    FNRTAB        = '';                                                 00002820
    GV_TAB_RE     = '';                                                 00002830
    G_TAB_RE      = '';                                                 00002840
    I = 1;                                                              00002850
    PIC6 = DATE;                                                        00002860
    PIC4 = PIC4_DEF_PIC6;                                               00002870
    PIC4 = PIC4 + 2;                                                    00002880
    IF  PIC4_POS3 > 12 THEN                                             00002890
       DO;                                                              00002900
          PIC4_POS1 = PIC4_POS1 + 1;                                    00002910
          PIC4_POS3 = PIC4_POS3 - 12;                                   00002920
       END;                                                             00002930
    TRANS_OPPL_OMR.TRANSKODE        = 'AUTO';                           00002940
    TRANS_OPPL_OMR.NY_GML_TRANS_IND = ' ';                              00002950
    TRANS_OPPL_OMR.FØDSNUMMER       = 0;                                00002960
    TRANS_OPPL_OMR.VIRKNINGSDATO    = 0;                                00002970
    TRANS_OPPL_OMR.BLANKETTYPE      = '  ';                             00002980
    TRANS_OPPL_OMR.TRANS_RETURKODE  = '    ';                           00002990
    DIV_PARAM_OMR. FEIL_MELD_NR     = 0;                                00003000
    DIV_PARAM_OMR. STØNADSBREV_ØNSKET_IND = '1'B;                       00003010
    DIV_PARAM_OMR. KJØRINGS_TYPE    = 'S';  /* STYRING AV R0014901 */   00003020
                                           /* INGEN SPERREPROBLEMATIKK*/00003030
    DIV_PARAM_OMR. ØNSKET_STATUS    = 'S';  /* STYRING AV R0013110 */   00003040
    STYRINGS_OMR . FUNKSJONSKODE    = 'F';  /* STYRING AV R0013110 */   00003050
                                                                        00003060
                                                                        00003070
                                                                        00003080
    GRUNN_IDENT                     = 'P0019924';                       00003090
                                                                        00003100
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                      00003110
                                                                        00003120
    GRUNN_IDENT                     = 'P0019925';                       00003130
                                                                        00003140
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                      00003150
                                                                        00003160
                                                                        00003170
                                                                        00003180
    IF PROGRAM_ID = 'R0010426' THEN                                     00003190
       DO;                                                              00003200
          EXEC CICS LOAD PROGRAM ('S0019F3');                           00003210
          ALLOCATE S0019FO;                                             00003220
          S0019FO.MELDINGO = 'NB NB  SJEKK AT KJØREDATO ER KORREKT !!'; 00003230
          S0019FO.DATO_MÅO = F_SNU_DATO(PIC4);                          00003240
          EXEC CICS SEND MAP('S0019F') MAPSET ('S0019F3') ERASE;        00003250
          PROGRAM_ID = 'R0019F01';                                      00003260
          EXEC CICS RETURN TRANSID('RF01') COMMAREA(KOM_OMR);           00003270
       END;                                                             00003280
                                                                        00003290
                                                                        00003300
    EXEC CICS RECEIVE MAP('S0019F') MAPSET ('S0019F3') SET (BMSMAPBR);  00003310
                                                                        00003320
                                                                        00003330
 /* ENDRET 21.02.86  AL                                            */   00003340
                                                                        00003350
    IF S0019FI.FUNKSJONSKODEL > 0 &                                     00003360
       VERIFY(S0019FI.FUNKSJONSKODEI,'RVEFIAX') = 0 THEN                00003370
                                                                        00003380
       DO;                                                              00003390
          STYRINGS_OMR.FUNKSJONSKODE = S0019FI.FUNKSJONSKODEI ;         00003400
          EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR);       00003410
       END;                                                             00003420
                                                                        00003430
    ELSE                                                                00003440
       IF S0019FI.STYRE_KODEL > 0  THEN                                 00003450
          DO;                                                           00003460
             STYREKODE          =      S0019FI.STYRE_KODEI;             00003470
             EXEC CICS XCTL PROGRAM  ('R0010420')                       00003480
                            COMMAREA ( KOM_OMR  );                      00003490
          END;                                                          00003500
                                                                        00003510
    IF ^ F_NUMERISK(S0019FI.DATO_MÅI) THEN                              00003520
       DO;                                                              00003530
          S0019FI.DATO_MÅL = -1;                                        00003540
          MELDING ='TEGN SOM IKKE ER TALL I DATOFELT';                  00003550
       END;                                                             00003560
    ELSE IF ^ F_GYLDIG_DATO(S0019FO.DATO_MÅO) THEN                      00003570
       DO;                                                              00003580
          S0019FI.DATO_MÅL = -1;                                        00003590
          MELDING ='UGYLDIG DATO';                                      00003600
       END;                                                             00003610
    ELSE IF ^ F_NUMERISK(S0019FI.FNRI) THEN                             00003620
       DO;                                                              00003630
          S0019FI.FNRL = -1;                                            00003640
          MELDING ='TEGN SOM IKKE ER TALL I FØDSELSNUMMER - FELT';      00003650
       END;                                                             00003660
    ELSE IF ^ F_GYLDIG_FNR(S0019FO.FNRO) & S0019FO.FNRO  > 0 THEN       00003670
       DO;                                                              00003680
          S0019FI.FNRL = -1;                                            00003690
          MELDING ='UGYLDIG FØDSELSNUMMER ';                            00003700
       END;                                                             00003710
    ELSE IF ^ F_NUMERISK(S0019FI.ANT_Ø_BEHI) THEN                       00003720
       DO;                                                              00003730
          S0019FI.ANT_Ø_BEHL = -1;                                      00003740
          MELDING ='TEGN SOM IKKE ER TALL I ANTALL - FELT';             00003750
       END;                                                             00003760
    ELSE IF  S0019FO.ANT_Ø_BEHO = 1 & S0019FI.FNRI = 0 THEN             00003770
       DO;                                                              00003780
          S0019FI.ANT_Ø_BEHL = -1;                                      00003790
          MELDING ='FEIL KOMBINASJON - KJØRE-ANTALL = 1 OG FNR = 0';    00003800
       END;                                                             00003810
    ELSE IF                                                             00003820
         S0019FO.ANT_Ø_BEHO    = 999              !                     00003830
         S0019FO.ANT_Ø_BEHO    = 9999             !                     00003840
         S0019FO.ANT_Ø_BEHO    = 99999            !                     00003850
         S0019FO.ANT_Ø_BEHO    = 999999           THEN                  00003860
         DO;                                                            00003870
            S0019FI.ANT_Ø_BEHL = -1;                                    00003880
            MELDING            = 'ALLE SYV  9  TALLENE MÅ OPPGIS ';     00003890
         END;                                                           00003900
                                                                        00003910
    NESTE_HENDELSE_DATO_ÅM   = F_SNU_DATO(S0019FO.DATO_MÅO);            00003920
                                                                        00003930
 /* IF NESTE_HENDELSE_DATO_ÅM  >  PIC4   THEN                           00003940
     MELDING = ' OMREGNINGS DATO ER STORE ENN DAGEN DATO + 40 DAGER ';  00003950
  */                                                                    00003960
    EXEC CICS HANDLE CONDITION ERROR (CICS_ABEND);                      00003970
                                                                        00003980
    IF MELDING              ^= (78) ' ' THEN                            00003990
       CALL MAP_UT_OG_RETUR;                                            00004000
                                                                        00004010
                                                                        00004020
    S0019FO.ANT_LEST_STATUSO = 0;                                       00004030
    S0019FO.ANT_OMR_FAMO     = 0;                                       00004040
                                                                        00004050
    CALL DATABASE('OPEN');                                              00004060
                                                                        00004070
                                                                        00004080
                                  /** DERSOM EN GÅR INN HER STARTER EN  00004090
                                         SCAN PÅ NESTE FØDSELSNUMMER */ 00004100
    IF S0019FO.FNRO > 0 THEN                                            00004110
       DO;                                                              00004120
          SSA_IND = 'KV_ROT_ST';                                        00004130
          SSA_ROT_GU.FNR = S0019FO.FNRO;                                00004140
          CALL LES_ROT_STATUS_SEGM;                                     00004150
          W01_GET = 'GN  ';                                             00004160
          SSA_IND = 'ROT_STAT';                                         00004170
       END;                                                             00004180
                                                                        00004190
 /* ***************************************************************** */00004200
 /* LES ROTSEGMENT-STATUSSSEGMENT MED GHN KVALIFISERT MED            */ 00004210
 /*       (STATUS-KODE = S OG STATUS-KODE-HIST = BLANK)              */ 00004220
 /* LESER FØRSTE PERSON SOM HAR PENSJON                               */00004230
 /* ***************************************************************** */00004240
                                                                        00004250
    IF S0019FO.ANT_Ø_BEHO > 1 THEN                                      00004260
       CALL LES_ROT_STATUS_SEGM;                                        00004270
                                                                        00004280
                                                                        00004290
    W01_GET = 'GN  ';                                                   00004300
                                                                        00004310
                                                                        00004320
    MELD2       ='BEHANDLINGEN STARTER NÅ, JOBBEN TAR CA. 3 TIMER';     00004330
                                                                        00004340
    S0019FO.DATO_MÅA     = BRI_PROT_MDT;                                00004350
    S0019FO.FNRA         = BRI_PROT_MDT;                                00004360
    S0019FO.ANT_Ø_BEHA   = BRI_PROT_MDT;                                00004370
    S0019FO.START_TIDO   = EIBTIME / 100;                               00004380
    EXEC CICS SEND MAP ('S0019F') MAPSET ('S0019F3') WAIT               00004390
                                           DATAONLY;                    00004400
                                                                        00004410
    PICX4        =   EIBTIME / 100                              ;       00004420
                                                                        00004430
    DAGENS_DATO  =   DATE                                       ;       00004440
    W_DATO_DAG   =   DAGENS_DATO_DAG                            ;       00004450
    W_DATO_MND   =   DAGENS_DATO_MND                            ;       00004460
    W_DATO_ÅR    =   DAGENS_DATO_ÅR                             ;       00004470
                                                                        00004480
    MELDING = (78)' ';                                                  00004490
    FEIL_STRUC.FEIL_MELDING = MELDING;                                  00004500
    CALL SEND_TEXT;                                                     00004510
                                                                        00004520
          W_FNR          = S0019FO.FNRO;                                00004530
    MELDING = 'ALDERSKONVERTERING START KL:' !! PICX4 !!                00004540
                        '  DATO : ' !! W_DATO !! ' FNR='!!W_FNR ;       00004550
                                                                        00004560
    FEIL_STRUC.FEIL_MELDING = MELDING;                                  00004570
    CALL SEND_TEXT;                                                     00004580
                                                                        00004590
    DO  IJ = 1 TO S0019FO.ANT_Ø_BEHO WHILE (OK & ^AVBRUDD);             00004600
                                                                        00004610
       W_FNR = ROTSEGM.FNR;                                             00004620
                                                                        00004630
       ANT_LEST_STATUS = ANT_LEST_STATUS + 1;                           00004640
       S0019FO.ANT_LEST_STATUSO = ANT_LEST_STATUSX;                     00004650
                                                                        00004660
       ALDER      = F_ALDER(W_FNR,S0019FO.DATO_MÅO);                    00004670
                                                                        00004680
                                        /*LOVENDRING FRA 1.1.91 HL : */ 00004690
              /*TILFØYET TEST PÅ ALDER = 2000 8.4.88 - SIDEN 6.3.87  */ 00004700
              /*HAR UNGE UFØRE SOM FYLLER 20 ÅR FALT UTENFOR  -  HL  */ 00004710
                                                                        00004720
       IF    ALDER = 1801  !                                            00004730
             ALDER = 1901  !                                            00004740
             ALDER = 2000  !                                            00004750
             ALDER = 2001  !                                            00004760
             ALDER = 2101  !                                            00004770
             ALDER = 6001  !                                            00004780
             ALDER = 6501  !          /*TILLEGG 160796 HL*/             00004790
             ALDER = 6701  !                                            00004800
             ALDER = 7001           THEN                                00004810
                                                                        00004820
           DO;                                                          00004830
                                                                        00004840
              DIV_PARAM_OMR.FEIL_MELD_NR = 0;                           00004850
              DIV_PARAM_OMR.SØKER_IND    = 0;                           00004860
              DIV_PARAM_OMR.FAMILIE_IND  = 0;                           00004870
                                                                        00004880
                                                                        00004890
                                                                        00004900
              IF (STATUSSEGM.PENSJONSTYPE1 = 'N' !                      00004910
                  STATUSSEGM.PENSJONSTYPE1 = 'B') THEN                  00004920
                                                                        00004930
                 DO;                                                    00004940
                    SØKER_IND = 3;                                      00004950
                                                                        00004960
                    IF STATUSSEGM.PENSJONSTYPE2 = 'P' THEN              00004970
 /* ***************************************************************** */00004980
 /* BARNEPENSJONIST YNGSTE BARN                                       */00004990
 /* ***************************************************************** */00005000
                                                                        00005010
                       SEARCH_FNR = ROTSEGM.FNR;                        00005020
                                                                        00005030
                    ELSE                                                00005040
                                                                        00005050
                       DO;                                              00005060
 /* ***************************************************************** */00005070
 /* BARNEPENSJONIST ØVRIG BARN                                        */00005080
 /* ***************************************************************** */00005090
                                                                        00005100
                          CALL LES_TILKN;     /*  LES TILKN-SEGM MED */ 00005110
                                              /*  GN UKVALIFISERT    */ 00005120
                          IF FEIL_MELD_NR > 0 THEN                      00005130
                                                                        00005140
                             DO;                                        00005150
                                CALL ACCUM_FEIL;                        00005160
                                GOTO LES_GN;                            00005170
                             END;                                       00005180
                                                                        00005190
                          IF TILKNSEGM.TILKNYTNINGSKODE ^= 'N' THEN     00005200
                             DO;                                        00005210
                                 FEIL_STRUC.FEIL_MELDING=               00005220
                              W_FNR  !! ' FEIL I FAMILIA TILKYNTING';   00005230
                                 CALL SKRIVE_MELD;                      00005240
                             END;                                       00005250
                                                                        00005260
                          SEARCH_FNR = TILKNSEGM.FNR_TILKN;             00005270
                                                                        00005280
                       END;                                             00005290
                                                                        00005300
                 END;                                                   00005310
                                                                        00005320
              ELSE                                                      00005330
                                                                        00005340
                 IF (STATUSSEGM.PENSJONSTYPE1 = 'A' !                   00005350
                     STATUSSEGM.PENSJONSTYPE1 = 'K' !                   00005360
                     STATUSSEGM.PENSJONSTYPE1 = 'E' !                   00005370
                     STATUSSEGM.PENSJONSTYPE1 = 'F' !                   00005380
                     STATUSSEGM.PENSJONSTYPE1 = 'Y' !                   00005390
                     STATUSSEGM.PENSJONSTYPE1 = 'J' !                   00005400
                     STATUSSEGM.PENSJONSTYPE1 = 'U') THEN               00005410
                                                                        00005420
                    DO;                                                 00005430
 /* ***************************************************************** */00005440
 /* PENSJONIST ELLER FORSØRGET EKTEFELLE                              */00005450
 /* ***************************************************************** */00005460
                                                                        00005470
                       SEARCH_FNR = ROTSEGM.FNR;                        00005480
                       W_ROT_FNR  = ROTSEGM.FNR;                        00005490
                                                                        00005500
                       IF F_KJØNN(W_ROT_FNR) = 'K' THEN                 00005510
                                                                        00005520
                          SØKER_IND = 1;                                00005530
                                                                        00005540
                       ELSE                                             00005550
                                                                        00005560
                          SØKER_IND = 2;                                00005570
                                                                        00005580
                     END;                                               00005590
                                                                        00005600
                   ELSE                                                 00005610
                                                                        00005620
                   IF STATUSSEGM.PENSJONSTYPE1 = 'L' THEN               00005630
                                                                        00005640
                     DO;                                                00005650
 /* ***************************************************************** */00005660
 /* PERSONEN ER FORSØRGET BARN                                        */00005670
 /* ***************************************************************** */00005680
                                                                        00005690
                        CALL LES_TILKN;       /* LES TILKN-SEGM MED  */ 00005700
                                              /*  GN UKVALIFISERT    */ 00005710
                        IF FEIL_MELD_NR > 0 THEN                        00005720
                          DO;                                           00005730
                             CALL ACCUM_FEIL;                           00005740
                             GOTO LES_GN;                               00005750
                          END;                                          00005760
                                                                        00005770
                          IF TILKNSEGM.TILKNYTNINGSKODE ^= 'N' THEN     00005780
                             DO;                                        00005790
                                 FEIL_STRUC.FEIL_MELDING=               00005800
                                  W_FNR !! ' FEIL I FAMILIA TILKYNTING';00005810
                                 CALL SKRIVE_MELD;                      00005820
                             END;                                       00005830
                                                                        00005840
                        SEARCH_FNR = TILKNSEGM.FNR_TILKN;               00005850
                                                                        00005860
                        W_ROT_FNR = TILKNSEGM.FNR_TILKN;                00005870
                                                                        00005880
                        IF F_KJØNN(W_ROT_FNR) = 'K' THEN                00005890
                                                                        00005900
                           SØKER_IND = 1;                               00005910
                                                                        00005920
                        ELSE                                            00005930
                                                                        00005940
                           SØKER_IND = 2;                               00005950
                                                                        00005960
                     END;                                               00005970
                                                                        00005980
                                                                        00005990
              IF SØKER_IND > 0 THEN                                     00006000
                 DO;                                                    00006010
                    B01        = '';                                    00006020
                    ANT_OMR_FAM = ANT_OMR_FAM + 1;                      00006030
                    S0019FO.ANT_OMR_FAMO = ANT_OMR_FAMX;                00006040
                    CALL ROSSFFB;                                       00006050
                 END;                                                   00006060
              ELSE                                                      00006070
                 GOTO LES_GN;                                           00006080
 /* ***************************************************************** */00006090
 /*                      SISTE STATUS TIL ROT-SEGM-FNR'S FAMILIE BLIR */00006100
 /*                      LEST INN I B02                               */00006110
 /* ***************************************************************** */00006120
                                                                        00006130
              IF FEIL_MELD_NR > 0 THEN                                  00006140
                                                                        00006150
                 DO;                                                    00006160
                    CALL ACCUM_FEIL;                                    00006170
                    GOTO LES_GU;                                        00006180
                 END;     /* AVBRUDD ELLER VIDERE?   AVBRUDD = '1';  */ 00006190
                                                                        00006200
                                                                        00006210
              B02 = B01;                                                00006220
                                                                        00006230
              POTALL_OPPL   = '';                                       00006240
                                                                        00006250
              DIV_PERIODE = '';                                         00006260
                                                                        00006270
                                                                        00006280
              MELDING = 'SISTE FNR UNDER BEHANDLING :' !! W_FNR;        00006290
              CALL SKRIVE_MELD;                                         00006300
              EXEC CICS LINK PROGRAM('R0014901') COMMAREA(KOM_OMR);     00006310
                                                                        00006320
 /* ***************************************************************** */00006330
 /*                  FAMILIEN AUTOMATISK ALDERSOPPDATERT OG BEREGNET  */00006340
 /*                  PÅ NYTT.  RESULTATET BLIR SKREVET UT PÅ          */00006350
 /*                  STØNADSBREV-BASEN OG STATISTIKK-TRANS-BASEN.     */00006360
 /* ***************************************************************** */00006370
                                                                        00006380
              IF FEIL_MELD_NR = 0 THEN                                  00006390
                 DO;                                                    00006400
                                                                        00006410
 /* ***************************************************************** */00006420
 /*                 FAMILIEN BLIR SKREVET TILBAKE PÅ BASEN  R0015401  */00006430
 /* ***************************************************************** */00006440
                                                                        00006450
                    EXEC CICS LINK PROGRAM('R0015401')                  00006460
                                    COMMAREA(KOM_OMR);                  00006470
                                                                        00006480
 /* ***************************************************************** */00006490
 /*                         SKRIVET STØNADSBREV-DATABASE    R0017101  */00006500
 /* ***************************************************************** */00006510
                                                                        00006520
                    EXEC CICS LINK PROGRAM('R0017101')                  00006530
                                    COMMAREA(KOM_OMR);                  00006540
                                                                        00006550
                                                                        00006560
                 END;                                                   00006570
                                                                        00006580
              IF FEIL_MELD_NR > 0 THEN                                  00006590
                                                                        00006600
                 DO;                                                    00006610
                                /* SKRIV UT FEILMELDING OM FAMILIEN  */ 00006620
                                                                        00006630
                    CALL ACCUM_FEIL;                                    00006640
                    FEIL_MELD_NR = 0;                                   00006650
                                                                        00006660
                       /* ******************************************* */00006670
                                  /* FJERN-TRANS-FRA-STØNADSBREV-BASE */00006680
                                 /*    (STØNADSBREV-NØKKEL-TABELL)  **/ 00006690
                        /* ****************************************** */00006700
                                                                        00006710
                    EXEC CICS LINK PROGRAM('R0016401')                  00006720
                                    COMMAREA(KOM_OMR);                  00006730
                                                                        00006740
                    IF FEIL_MELD_NR > 0 THEN                            00006750
                       DO;                                              00006760
                          CALL ACCUM_FEIL;                              00006770
                          FEIL_MELD_NR = 0;                             00006780
                       END;                                             00006790
                                                                        00006800
                 END;                                                   00006810
                                                                        00006820
                                                                        00006830
              FNRTAB        = '';                                       00006840
                                                                        00006850
              EXEC CICS SYNCPOINT;                                      00006860
              CALL DATABASE('OPEN');                                    00006870
                                                                        00006880
            LES_GU:                                                     00006890
              SSA_ROT_GU.FNR = W_FNR;                                   00006900
              CALL GU_PÅ_ROT;                                           00006910
              CALL GN_PÅ_ROT;                                           00006920
                                                                        00006930
                                                                        00006940
           END;                                       /* IF ALDER =  */ 00006950
                                                                        00006960
                                                                        00006970
     LES_GN:                                                            00006980
       CALL LES_ROT_STATUS_SEGM;                                        00006990
                                                                        00007000
                                                                        00007010
 /* ***************************************************************** */00007020
 /* NESTE PERSON I SEKVENSEN LESES                                    */00007030
 /*        LES ROTSEGMENT_STATUSSEGMENT MED GN KVALIFISERT MED       */ 00007040
 /*             (STATUS_KODE = S OG STATUS_KODE_HIST = BLANK         */ 00007050
 /* ***************************************************************** */00007060
                                                                        00007070
       DIV_PARAM_OMR. STØNADSBREV_ØNSKET_IND = '1'B;                    00007080
                                                                        00007090
    END;                              /* END DO IJ = 1 TO ......     */ 00007100
                                                                        00007110
 /* ***************************************************************** */00007120
 /* ***************************************************************** */00007130
 %PAGE;                                                                 00007140
                                                                        00007150
 LES_TILKN:                                                             00007160
                                                                        00007170
  PROC;                                                                 00007180
                                                                        00007190
    DCL SSA_TILKN              CHAR(9)  INIT ('TILKN    ');             00007200
    DCL FUNC_GNP               CHAR(4)  INIT ('GNP ');                  00007210
                                                                        00007220
    CALL PLITDLI (FIRE,FUNC_GNP,RF4,TILKNSEGM,SSA_TILKN);               00007230
                                                                        00007240
                                                                        00007250
    IF DLIUIB.UIBFCTR                   ^=    '00000000'B THEN          00007260
       DO;                                                              00007270
          MELDING =                                                     00007280
           'NOE ER GALT MED DATABASEN PÅ KALL: GNP PÅ TILKN  KODE: '    00007290
            !! UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);               00007300
          GOTO SLUTT;                                                   00007310
       END;                                                             00007320
                                                                        00007330
    KODE = RF4.STATUS_KODE;                                             00007340
                                                                        00007350
    SELECT (RF4.STATUS_KODE);                                           00007360
                                                                        00007370
       WHEN ('  ')                                                      00007380
          DO;                                                           00007390
                                                                        00007400
             OK = '1'B;                                                 00007410
                                                                        00007420
          END;                                                          00007430
                                                                        00007440
       WHEN ('GE','GB')                                                 00007450
                                                                        00007460
          DO;                                                           00007470
  L110:      FEIL_MELD_NR = 497;         /* FINNES IKKE TILKN  **/      00007480
             PROGRAM_ID = 'R0019F01';                                   00007490
             FEIL_VED_LABEL = 'L110';                                   00007500
          END;                                                          00007510
                                                                        00007520
                                                                        00007530
       OTHERWISE                                                        00007540
 /* ***************************************************************** */00007550
 /* FEIL STATUSKODE                                                   */00007560
 /* ***************************************************************** */00007570
          DO;                                                           00007580
             MELDING = 'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!    00007590
                       ' FRA GNP PÅ TILKN, FNR: ' !! W_FNR;             00007600
             GO TO SLUTT;                                               00007610
          END;                                                          00007620
                                                                        00007630
    END;                                                                00007640
                                                                        00007650
                                                                        00007660
 END LES_TILKN;                                                         00007670
                                                                        00007680
                                                                        00007690
 LES_ROT_STATUS_SEGM:                                                   00007700
                                                                        00007710
  PROC;                                                                 00007720
                                                                        00007730
    IF SSA_IND = 'ROT_STAT' THEN                                        00007740
       CALL PLITDLI (FEM,W01_GET,RF4,SEGMENTER,SSA_ROT,SSA_STATUS);     00007750
                                                                        00007760
    ELSE                                                                00007770
       CALL PLITDLI (FEM,W01_GET,RF4,SEGMENTER,SSA_ROT_GU,SSA_STATUS);  00007780
                                                                        00007790
    IF DLIUIB.UIBFCTR                   ^=    '00000000'B THEN          00007800
       DO;                                                              00007810
          MELDING =                                                     00007820
           'NOE ER GALT MED DATABASEN PÅ KALL: ' !! W01_GET !! ' KODE: '00007830
            !! UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);               00007840
          GOTO SLUTT;                                                   00007850
       END;                                                             00007860
                                                                        00007870
    KODE = RF4.STATUS_KODE;                                             00007880
                                                                        00007890
    SELECT (RF4.STATUS_KODE);                                           00007900
                                                                        00007910
       WHEN ('  ','GA','GK')                                            00007920
          DO;                                                           00007930
                                                                        00007940
             OK = '1'B;                                                 00007950
                                                                        00007960
          END;                                                          00007970
                                                                        00007980
       WHEN ('GB')                                                      00007990
                                                                        00008000
          DO;                                                           00008010
             MELDING = 'DATABASEN HAR NÅ BLITT GJENNOMLEST OG ' !!      00008020
                       'OPPDATERT MED ALDERSKONVERTERINGER  GB';        00008030
             OK = '0'B;                                                 00008040
          END;                                                          00008050
                                                                        00008060
       WHEN ('GE')                                                      00008070
                                                                        00008080
          DO;                                                           00008090
             IF S0019FO.ANT_LEST_STATUSO = 0 &                          00008100
                S0019FO.ANT_Ø_BEHO > 1 THEN                             00008110
               MELDING = 'NORMAL-SLUTT   HAR IKKE MERE Å '!!            00008120
                                        'BEHANDLE I DATABASEN';         00008130
             ELSE                                                       00008140
             IF S0019FO.ANT_LEST_STATUSO = 0 &                          00008150
                S0019FO.ANT_Ø_BEHO       = 1 THEN                       00008160
               MELDING = 'DETTE FØDESELSNUMMER FINNES IKKE I DATABASEN';00008170
             ELSE                                                       00008180
               MELDING = 'NORMAL SLUTT DATABASEN GJENNOMLEST OG ' !!    00008190
                         'OPPDATERT MED ALDERSKONVERT  GE' !! W_FNR ;   00008200
             OK = '0'B;                                                 00008210
             GOTO SLUTT;                                                00008220
          END;                                                          00008230
                                                                        00008240
                                                                        00008250
       OTHERWISE                                                        00008260
 /* ***************************************************************** */00008270
 /* FEIL STATUSKODE                                                   */00008280
 /* ***************************************************************** */00008290
          DO;                                                           00008300
             MELDING = 'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!    00008310
                       ' FRA ' !! W01_GET !! 'CALL';                    00008320
             GO TO SLUTT;                                               00008330
          END;                                                          00008340
                                                                        00008350
    END;                                                                00008360
                                                                        00008370
 END LES_ROT_STATUS_SEGM;                                               00008380
                                                                        00008390
                                                                        00008400
 GU_PÅ_ROT:                                                             00008410
      PROC;                                                             00008420
                                                                        00008430
      W01_GET        = 'GU  ';                                          00008440
      CALL PLITDLI (FIRE,W01_GET,RF4,SEGMENTER,SSA_ROT_GU);             00008450
                                                                        00008460
      IF DLIUIB.UIBFCTR            ^=    '00000000'B THEN               00008470
         DO;                                                            00008480
            MELDING =                                                   00008490
           'NOE ER GALT MED DATABASEN PÅ KALL: ' !! W01_GET !!          00008500
           ' KODE: ' !! UNSPEC(UIBFCTR) !!' '!! UNSPEC(UIBDLTR);        00008510
            GOTO SLUTT;                                                 00008520
         END;                                                           00008530
                                                                        00008540
      SELECT (RF4.STATUS_KODE);                                         00008550
                                                                        00008560
         WHEN ('  ')                                                    00008570
            ;                                                           00008580
                                                                        00008590
         OTHERWISE                                                      00008600
 /* ***************************************************************** */00008610
 /* FEIL STATUSKODE                                                   */00008620
 /* ***************************************************************** */00008630
            DO;                                                         00008640
               MELDING =                                                00008650
                  'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!         00008660
                  ' FRA ' !! W01_GET !! 'CALL' !! W_FNR;                00008670
               GO TO SLUTT;                                             00008680
            END;                                                        00008690
                                                                        00008700
      END;                                                              00008710
                                                                        00008720
 END GU_PÅ_ROT;                                                         00008730
                                                                        00008740
 GN_PÅ_ROT:                                                             00008750
      PROC;                                                             00008760
      W01_GET = 'GN  ';                                                 00008770
                                                                        00008780
      CALL PLITDLI (FIRE,W01_GET,RF4,SEGMENTER,SSA_ROT);                00008790
                                                                        00008800
      IF DLIUIB.UIBFCTR            ^=    '00000000'B THEN               00008810
         DO;                                                            00008820
            MELDING =                                                   00008830
           'NOE ER GALT MED DATABASEN PÅ KALL: ' !! W01_GET !!          00008840
           ' KODE: ' !! UNSPEC(UIBFCTR) !!' '!! UNSPEC(UIBDLTR);        00008850
            GOTO SLUTT;                                                 00008860
         END;                                                           00008870
                                                                        00008880
      SELECT (RF4.STATUS_KODE);                                         00008890
                                                                        00008900
         WHEN ('  ')                                                    00008910
            ;                                                           00008920
                                                                        00008930
         WHEN ('GE','GB')                                               00008940
            DO;                                                         00008950
               MELDING =                                                00008960
                  'SLUTT På DATABASEN ' !! RF4.STATUS_KODE !!           00008970
                  ' MED ' !! W01_GET !! 'CALL' !! W_FNR;                00008980
               GO TO SLUTT;                                             00008990
            END;                                                        00009000
         OTHERWISE                                                      00009010
 /* ***************************************************************** */00009020
 /* FEIL STATUSKODE                                                   */00009030
 /* ***************************************************************** */00009040
            DO;                                                         00009050
               MELDING =                                                00009060
                  'FEIL DLI-STATUSSKODE ' !! RF4.STATUS_KODE !!         00009070
                  ' FRA ' !! W01_GET !! 'CALL' !! W_FNR;                00009080
               GO TO SLUTT;                                             00009090
            END;                                                        00009100
                                                                        00009110
      END;                                                              00009120
                                                                        00009130
 END GN_PÅ_ROT;                                                         00009140
                                                                        00009150
                                                                        00009160
 %PAGE;                                                                 00009170
 %INCLUDE R0019901;          /*     F_GYLDIG_DATO       */              00009180
 %PAGE;                                                                 00009190
 %INCLUDE R0019902;          /*     F_KJØNN             */              00009200
 %PAGE;                                                                 00009210
 %INCLUDE R0019904;          /*     F_GYLDIG_FNR        */              00009220
 %PAGE;                                                                 00009230
 %INCLUDE R0019905;          /*     F_ALDER             */              00009240
 %PAGE;                                                                 00009250
 %INCLUDE R0019910;          /*     F_NUMERISK          */              00009260
 %PAGE;                                                                 00009270
 %INCLUDE R0019913;          /*     F_SNU_DATO          */              00009280
 %PAGE;                                                                 00009290
 %INCLUDE R0019956;          /*     P9956_BER_G_CICS    */              00009300
 %PAGE;                                                                 00009310
 %INCLUDE R0019F21;          /*     ROSSFFB             */              00009320
 %PAGE;                                                                 00009330
                                                                        00009340
                                                                        00009350
                                                                        00009360
                                                                        00009370
 SLUTT:                                                                 00009380
    MELD2       = (78)' ';                                              00009390
    EXEC CICS ASKTIME;                                                  00009400
    S0019FO.STOPP_TIDO = EIBTIME/100;                                   00009410
    FEIL_STRUC.FEIL_MELDING =                                           00009420
                             W_FNR !! '   ' !! S0019FO.STOPP_TIDO;      00009430
                                                                        00009440
    CALL SKRIVE_MELD;                                                   00009450
                                                                        00009460
    IF S0019FO.ANT_Ø_BEHO = S0019FO.ANT_LEST_STATUSO THEN               00009470
       MELDING = 'KJØRINGEN ER NORMALT AVSLUTTET PÅ FØDSELSNUMMER: ' !! 00009480
                                                                W_FNR;  00009490
                                                                        00009500
    ELSE IF MELDING = (78)' ' THEN                                      00009510
       MELDING = 'KJØRINGEN ER AVSLUTTET PÅ FØDSELSNUMMER: ' !! W_FNR;  00009520
                                                                        00009530
                                                                        00009540
    S0019FO.MELDINGO = MELDING;                                         00009550
    FEIL_STRUC.FEIL_MELDING = MELDING;                                  00009560
                                                                        00009570
    CALL SKRIVE_MELD;                                                   00009580
    CALL SEND_TEXT;                                                     00009590
                                                                        00009600
                                                                        00009610
    EXEC CICS SEND MAP ('S0019F') MAPSET ('S0019F3') WAIT               00009620
                                           DATAONLY;                    00009630
                                                                        00009640
                                                                        00009650
    EXEC CICS RETURN;                                                   00009660
                                                                        00009670
                                                                        00009680
                                                                        00009690
  CICS_ABEND:                                                           00009700
    MELDING = 'STOPP PÅ GRUNN AV CICS - ABEND, HOVEDFØDSELSNUMMER: ' !! 00009710
               W_FNR;                                                   00009720
    EXEC CICS SYNCPOINT ROLLBACK;                                       00009730
    GOTO SLUTT;                                                         00009740
                                                                        00009750
                                                                        00009760
  MAP_UT_OG_RETUR:                                                      00009770
   PROC;                                                                00009780
      S0019FO.MELDINGO = MELDING;                                       00009790
      EXEC CICS SEND MAP ('S0019F') MAPSET('S0019F3') DATAONLY          00009800
                                              CURSOR;                   00009810
      EXEC CICS RETURN TRANSID('RF01') COMMAREA (KOM_OMR);              00009820
  END  MAP_UT_OG_RETUR;                                                 00009830
                                                                        00009840
                                                                        00009850
 DATABASE:                                                              00009860
   PROC(STYRING);                                                       00009870
                                                                        00009880
   DCL                                                                  00009890
     STYRING                               CHAR(5),                     00009900
     NULL                                  BUILTIN,                     00009910
     UNSPEC                                BUILTIN;                     00009920
                                                                        00009930
                                                                        00009940
                                                                        00009950
                                                                        00009960
  %SKIP;                                                                00009970
  /* **************************************************************** */00009980
  /*                                                                  */00009990
  /*     DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-   */00010000
  /*     KALL                                                         */00010010
  /*                                                                  */00010020
  /* **************************************************************** */00010030
     DCL                                                                00010040
       W01_PSB_NAVN                CHAR (8)       INIT('B001R001');     00010050
     DCL                                                                00010060
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');         00010070
     DCL                                                                00010080
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00010090
  %PAGE;                                                                00010100
  /* **************************************************************** */00010110
  /*                                                                  */00010120
  /*     ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00010130
  /*                                                                  */00010140
  /*                                                                  */00010150
  /* **************************************************************** */00010160
                                                                        00010170
  %PAGE;                                                                00010180
  /* **************************************************************** */00010190
  /*                                                                  */00010200
  /*     DLI CALL-PARAMETRE                                           */00010210
  /*                                                                  */00010220
  /* **************************************************************** */00010230
  %SKIP(2);                                                             00010240
     DCL 1  W01_DLI_PARAM,                                              00010250
            2   W02_GU             CHAR (4)       INIT('GU  '),         00010260
            2   W02_PARM_CT_1      FIXED BIN(31)  INIT(1),              00010270
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT(3),              00010280
            2   W02_PARM_CT_4      FIXED BIN(31)  INIT(4);              00010290
                                                                        00010300
  %PAGE;                                                                00010310
                                                                        00010320
     IF STYRING = 'OPEN' THEN                                           00010330
        DO;                                                             00010340
           CALL   PLITDLI                        (W02_PARM_CT_3,        00010350
                                                  W01_PCB_FUNCTION,     00010360
                                                  W01_PSB_NAVN,         00010370
                                                  UIBPTR);              00010380
                                                                        00010390
           IF DLIUIB.UIBFCTR                    =    '00000000'B THEN   00010400
             DO;                                                        00010410
               PCB_UIB_PEKER_OMR.PCB_PEKER      =    UIBPCBAL;          00010420
               PCB_UIB_PEKER_OMR.UIB_PEKER      =    UIBPTR;            00010430
             END;                                                       00010440
           ELSE                                                         00010450
             DO;                                                        00010460
                MELDING =                                               00010470
                 'NOE ER GALT MED DATABASEN PÅ ÅPNINGSKALLET, KODE: ' !!00010480
                  UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);            00010490
                GOTO SLUTT;                                             00010500
             END;                                                       00010510
        END;                                                            00010520
     ELSE                                                               00010530
        DO;                                                             00010540
           CALL   PLITDLI                        (W02_PARM_CT_1,        00010550
                                                  W01_TERM_FUNCTION);   00010560
           KOM_OMR.PCB_UIB_PEKER = NULL;                                00010570
        END;                                                            00010580
                                                                        00010590
 END DATABASE;                                                          00010600
                                                                        00010610
                                                                        00010620
 ACCUM_FEIL:                                                            00010630
    PROC;                                                               00010640
                                                                        00010650
      FEIL_STRUC.FEIL_MELDING = 'PROGRAM: ' !! DIV_PARAM_OMR.PROGRAM_ID 00010660
             !! ' FEIL VED LABEL: ' !! DIV_PARAM_OMR.FEIL_VED_LABEL   !!00010670
                ' DB-STATUSKODE: '  !! DIV_PARAM_OMR.DB_STATUS_KODE   !!00010680
                ' HOVEDFNR: '  !! W_FNR;                                00010690
                                                                        00010700
      CALL SKRIVE_MELD;                                                 00010710
      CALL SEND_TEXT;                                                   00010720
                                                                        00010730
      FEIL_STRUC.FEIL_NR = DIV_PARAM_OMR.FEIL_MELD_NR;                  00010740
      EXEC CICS LINK PROGRAM ('R0019921') COMMAREA(FEIL_STRUC);         00010750
                                                                        00010760
      CALL SEND_TEXT;                                                   00010770
      CALL SKRIVE_MELD;                                                 00010780
                                                                        00010790
      FEIL_STRUC.FEIL_MELDING = ' ';                                    00010800
                                                                        00010810
                                                                        00010820
 END ACCUM_FEIL;                                                        00010830
                                                                        00010840
                                                                        00010850
 SKRIVE_MELD:                                                           00010860
   PROC;                                                                00010870
                                                                        00010880
                                                                        00010890
    FEIL_STRUC.FEIL_MELDING = MELDING;                                  00010900
                                                                        00010910
    EXEC CICS WRITE DATASET('ALDKONV')                                  00010920
              FROM (FEIL_STRUC.FEIL_MELDING) RIDFLD(FEIL_RBA) RBA;      00010930
                                                                        00010940
                                                                        00010950
 END SKRIVE_MELD;                                                       00010960
                                                                        00010970
 SEND_TEXT:                                                             00010980
   PROC;                                                                00010990
                                                                        00011000
                                                                        00011010
      S0019FO.MELDINGO = MELDING;                                       00011020
      S0019FO.MELD2O   = MELD2;                                         00011030
      EXEC CICS SEND MAP ('S0019F') MAPSET('S0019F3') DATAONLY          00011040
                                              CURSOR;                   00011050
                                                                        00011060
      CALL SKRIVE_MELD;                                                 00011070
      MELDING = (78)' ';                                                00011080
                                                                        00011090
 END SEND_TEXT;                                                         00011100
                                                                        00011110
 END R0019F;                                                            00011120
                                                                        00011130
