 /*       SIST ENDRET 25/03-93 13.03.11 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 30/04-91 12.37.08 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 06/03-91 11.52.18 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 21/01-91 13.50.34 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 01/12-89 08.40.05 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 28/10-83 10.51.01 AV   OLAV                     */00000050
 /*       SIST ENDRET 27/10-83 17.30.50 AV   OLAV                     */00000060
 /*       SIST ENDRET 01/03-83 09.16.57 AV   OLAV                     */00000070
 /*       SIST ENDRET 05/01-83 13.04.58 AV   FARVIK                   */00000080
 /* ***************************************************************** */00000090
 /*IDENTIFIKASJON:                                                    */00000100
 /*    R0014132 - BEREGN_GP_ETTERLATT_AP - INTERN PROC I PLI.         */00000110
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982.                          */00000120
 /*    ENDRET AV KARIN I AUGUST 82                                    */00000130
 /*HENSIKT:                                                           */00000140
 /*    PROGRAMMET BEREGNER GRUNNPENSJON ALDER VED ETTERLATT.          */00000150
 /*PROGRAMTILKNYTNING:                                                */00000160
 /*    PROGRAMMET BLIR INKLUDERT I R0014121 - BEREGN_ETTERLATT_AP_DEL1*/00000170
 /*BRUK:                                                              */00000180
 /*    CALL BEREGN_GP_ETTERLATT_AP;                                   */00000190
 /* ***************************************************************** */00000200
 BEREGN_GP_ETTERLATT_AP: PROC;                                          00000210
                                                                        00000220
 DCL                                                                    00000230
    TT_EGEN               FIXED DEC(3),                                 00000240
    TT_AVDØD              FIXED DEC(3),                                 00000250
    ALDER_DØD_Å           PIC'999',                                     00000260
    PIC_4_ÅM              PIC'9999';                                    00000270
                                                                        00000280
  TT_EGEN  = 0;                                                         00000290
  TT_AVDØD = 0;                                                         00000300
                                                                        00000310
  PIC_4_ÅM = B02.STATUS.VIRK_DATO_ÅM(BER_SØ_IND);                       00000320
                                                                        00000330
  IF F_ALDER(W_FNR,F_SNU_DATO(PIC_4_ÅM)) >= 7000 THEN                   00000340
     CALL REGN_TT_67_TIL_70;                                            00000350
                                                                        00000360
                                                                        00000370
                                                                        00000380
                                                                        00000390
  IF FNR_EK_R.ÅRHUNDRE_EK < 5 THEN                                      00000400
     ALDER_DØD_Å = B02.DØDSDATO_ÅMD(BER_EK_IND) / 10000 -               00000410
                                               FNR_EK_R.ÅR_EK;          00000420
  ELSE                                                                  00000430
     ALDER_DØD_Å = B02.DØDSDATO_ÅMD(BER_EK_IND) / 10000 -               00000440
                                               FNR_EK_R.ÅR_EK + 100;    00000450
                                                                        00000460
  IF ALDER_DØD_Å > 66 THEN                                              00000470
     CALL REGN_TT_67_TIL_70;                                            00000480
                                                                        00000490
  TT_EGEN = B02.STATUS.TT_FØR_1967 (BER_SØ_IND) +                       00000500
           ((B02.STATUS.TT_ETTER_1966(BER_SØ_IND) + 11) / 12) +         00000510
            B02.STATUS.TT_67_TIL_70(BER_SØ_IND);                        00000520
                                                                        00000530
  TT_AVDØD = B02.TT_FØR_1967 (BER_EK_IND)                               00000540
                +(B02.TT_ETTER_1966 (BER_EK_IND)                        00000550
                + B02.TT_FRAMT(BER_EK_IND) + 11) / 12                   00000560
                + B02.TT_67_TIL_70(BER_EK_IND);                         00000570
                                                                        00000580
                                                             /*NY0191*/ 00000590
  IF B02.TT_16_66(BER_SØ_IND) > 0 THEN                       /*NY0191*/ 00000600
         TT_EGEN = ((B02.TT_16_66(BER_SØ_IND) + 6) / 12 ) +  /*NY0191*/ 00000610
                    B02.TT_67_TIL_70(BER_SØ_IND);                       00000620
                                                                        00000630
  IF B02.TT_16_66(BER_EK_IND) > 0 THEN                       /*NY0191*/ 00000640
         TT_AVDØD = ((B02.TT_16_66(BER_EK_IND)               /*NY0191*/ 00000650
                    + B02.TT_FRAMT(BER_EK_IND) + 6) / 12)               00000660
                    + B02.TT_67_TIL_70(BER_EK_IND);                     00000670
                                                                        00000680
  IF TT_AVDØD < B01.TT_ANV(BER_EK_IND)  THEN                 /*NY0191*/ 00000690
     TT_AVDØD = B01.TT_ANV(BER_EK_IND);                                 00000700
                                                                        00000710
  IF B02.FRAVIK_FLYKTN(BER_SØ_IND)  = 'J' THEN                          00000720
     TT_EGEN     = 40;                                                  00000730
                                                                        00000740
                                                                        00000750
  IF TT_AVDØD > 39 THEN                                                 00000760
     TT_AVDØD = 40;                                                     00000770
                                                                        00000780
   IF TT_EGEN > 39 THEN                                                 00000790
      B02.STATUS.TT_ANV(BER_SØ_IND) = 40;                               00000800
   ELSE                                                                 00000810
      DO;                                                               00000820
         IF TT_EGEN > TT_AVDØD THEN                                     00000830
            B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                           00000840
         ELSE                                                           00000850
            B02.TT_ANV(BER_SØ_IND) = TT_AVDØD;                          00000860
                                                                        00000870
      END;                                                              00000880
                                                                        00000890
  B02.TT_ANV(BER_EK_IND) = TT_AVDØD;                                    00000900
                                                                        00000910
  IF B02.TT_GARANTI(BER_SØ_IND) >                                       00000920
                  B02.TT_ANV(BER_SØ_IND)  THEN                          00000930
     B02.TT_ANV(BER_SØ_IND) = B02.TT_GARANTI(BER_SØ_IND);               00000940
                                                                        00000950
  /*DENNE LÅ IKKE INNE HER. TRUDE 240393*/                              00000960
  IF W_TT_KONVENSJON > 0 THEN                                           00000970
    DO;                                                                 00000980
       IF W_TT_KONVENSJON > 39 THEN                                     00000990
          W_TT_KONVENSJON = 40;                                         00001000
                                                                        00001010
          B02.TT_ANV(BER_SØ_IND)  = W_TT_KONVENSJON;                    00001020
    END;                                                                00001030
                                                                        00001040
  B02.ALDERSP.GP(BER_SØ_IND) = G * B02.TT_ANV(BER_SØ_IND) /             00001050
                                                    (40 * 12) + 0.5;    00001060
                                                                        00001070
 /* *********************************************************** */      00001080
 /* YS - BEREGNING                                              */      00001090
 /* *********************************************************** */      00001100
                                                                        00001110
 /*YS*/ DCL KAP11_GP     FIXED DEC (5);                                 00001120
 /*YS*/ DCL VANLIG_GP    FIXED DEC (5);                                 00001130
 /*YS*/                                                                 00001140
 /*YS*/                                                                 00001150
 /*YS*/ IF B02.YRKEPENS.YUG(BER_EK_IND) > 0      THEN                   00001160
 /*YS*/    DO;                                                          00001170
 /*YS*/       KAP11_GP = G*B02.YRKEPENS.YUG(BER_EK_IND)/(100*12)+ 0.5;  00001180
 /*YS*/       IF B02.YRKEPENS.YUG(BER_EK_IND) = 100    THEN             00001190
 /*YS*/          B02.ALDERSP.GP(BER_SØ_IND) = KAP11_GP;                 00001200
 /*YS*/       ELSE                                                      00001210
 /*YS*/          DO;                                                    00001220
 /*YS*/             VANLIG_GP = B02.ALDERSP.GP(BER_SØ_IND) *            00001230
 /*YS*/                         B02.YRKEPENS.YUG(BER_EK_IND)/100 + 0.5; 00001240
 /*YS*/             B02.ALDERSP.GP(BER_SØ_IND) =                        00001250
 /*YS*/                               B02.ALDERSP.GP(BER_SØ_IND) +      00001260
 /*YS*/                               KAP11_GP - VANLIG_GP;             00001270
 /*YS*/          END;                                                   00001280
 /*YS*/    END;                                                         00001290
                                                                        00001300
  IF B02.IKKE_GP(BER_SØ_IND)     = 'J'  THEN     /* TRUDE, 2704091 */   00001310
     B02.ALDERSP.GP(BER_SØ_IND)  = 0;                                   00001320
                                                                        00001330
                                                                        00001340
                                                                        00001350
 END BEREGN_GP_ETTERLATT_AP;                                            00001360
