 /*       SIST ENDRET 12/01-83 12.13.16 AV   OLAV                     */00000000
 /*       SIST ENDRET 30/11-82 13.50.23 AV   OLAV                     */00000010
 /* *************************************************************** */  00000020
 /*IDENTIFIKASJON:                                                  */  00000030
 /*    R0019949 - PROSEDYRE I PLI                                   */  00000040
 /*    PROGRAMMERER: OLAV NOV. 1982.                                */  00000050
 /*HENSIKT:                                                         */  00000060
 /*    BEREGNER FRAMTIDIG TRYGDETID.                                */  00000070
 /*BRUK:                                                            */  00000080
 /*    CALL BEREGN_TT_FRAMT(FNR,DATO_ÅM,TT_FRAMT)                   */  00000090
 /*          FNR      SKAL VÆRE DCL FIXED(11)                       */  00000100
 /*          DATO_ÅM  SKAL VÆRE DCL FIXED(5)                        */  00000110
 /*          TT_FRAMT SKAL VÆRE DCL FIXED(3)                        */  00000120
 /*                                                                 */  00000130
 /* *************************************************************** */  00000140
 %SKIP(2);                                                              00000150
 F_BEREGN_TT_FRAMT:                                                     00000160
   PROC(FØDSELSNR,DATO_ÅM) RETURNS(FIXED DEC(3));                       00000170
                                                                        00000180
   DCL                                                                  00000190
      FØDSELSNR                                      FIXED(11),         00000200
      DATO_ÅM                                        FIXED(5),          00000210
      TT_FRAMT                                       FIXED(3);          00000220
   DCL                                                                  00000230
      W_DATO_ÅM                                      PIC '99999',       00000240
      W_DATO_ÅR       DEF W_DATO_ÅM         POS (2)  PIC '99',          00000250
      W_DATO_MND      DEF W_DATO_ÅM         POS (4)  PIC '99';          00000260
   DCL                                                                  00000270
      W_FNR_R               PIC      '(11)9';                           00000280
   DCL                                                                  00000290
      1 W_FNR               DEF      W_FNR_R,                           00000300
        2 DAG               PIC        '99',                            00000310
        2 MND               PIC        '99',                            00000320
        2 ÅR                PIC        '99',                            00000330
        2 ÅRHUNDRE          PIC         '9',                            00000340
        2 REST              PIC      '9999';                            00000350
   DCL                                                                  00000360
      W_TT_FRAM_TIL_DATO                                PIC '(5)9',     00000370
      W_TT_FRAM_TIL_ÅR  DEF W_TT_FRAM_TIL_DATO POS (1)  PIC '999',      00000380
      W_TT_FRAM_TIL_MND DEF W_TT_FRAM_TIL_DATO POS (4)  PIC '99';       00000390
                                                                        00000400
 /* ***************************************************************** */00000410
 /* BEREGNING AV B02.FRAMT                                            */00000420
 /* ***************************************************************** */00000430
                                                                        00000440
      W_FNR_R                 = FØDSELSNR;                              00000450
      W_DATO_ÅM               = DATO_ÅM;                                00000460
      IF W_FNR.ÅRHUNDRE < 5 THEN                                        00000470
         DO;                                                            00000480
            IF DATO_ÅM < 7301 THEN                                      00000490
               W_TT_FRAM_TIL_DATO =                                     00000500
                          (W_FNR.ÅR + 70) * 100 + W_FNR.MND;            00000510
            ELSE                                                        00000520
               W_TT_FRAM_TIL_DATO =                                     00000530
                          (W_FNR.ÅR + 67) * 100 + W_FNR.MND;            00000540
         END;                                                           00000550
                                                                        00000560
      ELSE                                                              00000570
                                                                        00000580
         W_TT_FRAM_TIL_DATO =                                           00000590
                         ((W_FNR.ÅR + 70) - 100) * 100 + W_FNR.MND;     00000600
                                                                        00000610
      TT_FRAMT      = (W_TT_FRAM_TIL_ÅR * 12 + W_TT_FRAM_TIL_MND) -     00000620
                      (W_DATO_ÅR        * 12 + W_DATO_MND);             00000630
                                                                        00000640
      IF TT_FRAMT < 0 THEN                                              00000650
         TT_FRAMT = 0;                                                  00000660
                                                                        00000670
      RETURN(TT_FRAMT);                                                 00000680
                                                                        00000690
   END F_BEREGN_TT_FRAMT;                                               00000700
