 /*       SIST ENDRET 24/10-97 11.57.14 AV   JDA7339                  */00000000
 /*       SIST ENDRET 14/08-97 16.25.44 AV   HLA7339                  */00000010
 /*       SIST ENDRET 04/08-97 14.10.16 AV   JDA7339                  */00000020
 /* ================================================================= */00000030
 /* R0019704 FKS_SKJERM_ATTF(SKJERM_ATTF,TIDSBEGR_ATTF)               */00000040
 /* ----------------------------------------------------------------- */00000050
 /* INKLUDERES I : R001U620 (22)                                      */00000060
 /* S_KODE ER KODE FOR SKJERM_ATTF (S,X,BLANK)                        */00000070
 /* T_KODE ER KODE FOR TIDSBEGR_ATTF (S,X,BLANK)                      */00000080
 /* ================================================================= */00000090
 FKS_SKJERM_ATTF : PROC (S_KODE,T_KODE) RETURNS (FIXED DEC (5));        00000100
    /* -------------------------------------------------------------- */00000110
    DCL S_KODE           CHAR(1),                                       00000120
        T_KODE           CHAR(1);                                       00000130
    DCL FEILMELDING      FIXED DEC (5) INIT (0);                        00000140
    /* -------------------------------------------------------------- */00000150
    SELECT (S_KODE);                                                    00000160
       WHEN ('S') /* START SKJERM ATTFØRING */                          00000170
          IF B01.TIDSBEGR_ATTF(BER_SØ_IND) = 'J' &                      00000180
             T_KODE ^= 'X' THEN                                         00000190
             /* KAN IKKJE STARTE VARIG UTEN STANS TIDSBEGR */           00000200
             FEILMELDING = 438;                                         00000210
       WHEN ('X') /* SLUTT SKJERM ATTFØRING */                          00000220
          IF B01.UFØRPENS.SKJERM_ATTF(BER_SØ_IND) ^= 'J' THEN           00000230
             DO;                                                        00000240
                /* ----------------------------------------------- */   00000250
                /* VI AVVISER ALLE SOM SLUTTER FØR DE HAR STARTET  */   00000260
                /* ----------------------------------------------- */   00000270
                FEILMELDING = 431;                                      00000280
             END;                                                       00000290
         OTHER;     /* STANSES I INPUTKONTROLL  */                      00000300
    END; /* SELECT S_KODE */                                            00000310
    /* -------------------------------------------------------------- */00000320
    /* OPPDATERER B02. DERSOM ALT ER OK                               */00000330
    /* -------------------------------------------------------------- */00000340
    IF FEILMELDING = 0 THEN                                             00000350
       IF S_KODE = 'S' THEN                                             00000360
          B02.UFØRPENS.SKJERM_ATTF(BER_SØ_IND) = 'J';                   00000370
       ELSE                                                             00000380
          IF S_KODE = 'X' THEN                                          00000390
             B02.UFØRPENS.SKJERM_ATTF(BER_SØ_IND) = ' ';                00000400
    /* -------------------------------------------------------------- */00000410
    /* RETURNERER FEILKODE, 0 VISER AT ALT ER OK SÅ LANGT             */00000420
    /* -------------------------------------------------------------- */00000430
    RETURN (FEILMELDING);                                               00000440
                                                                        00000450
 END FKS_SKJERM_ATTF;                                                   00000460
