 /*       SIST ENDRET 26/04-91 11.43.45 AV   DYBVIK                   */00000000
 /*IDENTIFIKASJON:                                                    */00000010
 /*    R001NC06 - PROSEDYRE I PLI                                     */00000020
 /*    PROGRAMMERER:       SATISH 1991                                */00000030
 /*HENSIKT:                                                           */00000040
 /*    PROGRAMMET INNEHOLDER:                                         */00000050
 /*        PROSEDYRER FOR Å OVERFØRE DATA FRA F7_TRANS_OMR TIL        */00000060
 /*            SKJERMBILDE (MAP S001NC1 MAPSET S001NC3).              */00000070
 /*BRUK:                                                              */00000080
 /*    OVERFØR_F7_SØKER_MAP:   OVERFØRING AV SØKERDELEN               */00000090
 /*    OVERFØR_F7_BARN_MAP:    OVERFØRING AV BARNEDELEN               */00000100
 /*                                                                   */00000110
 /* ***************************************************************** */00000120
 /*                                                                   */00000130
 /*   PROSEDYRA OVERFØRER DATA FRA F7_TRANS_OMR.F7S TIL               */00000140
 /*   SKJERMBILDE F7_SØKER DELEN.                                     */00000150
 /*   MAP: S001NC1                                                    */00000160
 /*   MAPSET: S001NC3                                                 */00000170
 /*                                                                   */00000180
 /* ***************************************************************** */00000190
 %SKIP(2);                                                              00000200
 OVERFØR_F7_SØKER_MAP:                                                  00000210
   PROC;                                                                00000220
   DCL                                                                  00000230
      NORMAL  CHAR (1),                                                 00000240
      NOR_NUM CHAR (1),                                                 00000250
      BRI_NUM CHAR (1);                                                 00000260
      NORMAL    = ' ';                                                  00000270
      NOR_NUM   = '&';                                                  00000280
      BRI_NUM   = 'Q';                                                  00000290
 %SKIP(2);                                                              00000300
      S001NC1O.REGDATOO = F_FELT_PIC_CHAR6  (F7S.REGDATO);              00000310
      S001NC1O.TERMIDO = F7S.TERMID;                                    00000320
      S001NC1O.FNRO  = F_FELT_PIC_CHAR11 (F7S.FNR);                     00000330
      S001NC1O.TKNRO = F_FELT_PIC_CHAR4 (F7S.TKNR);                     00000340
      S001NC1O.TILL_EKO = F7S.TILL_EK;                                  00000350
      IF F_FELT_PIC_CHAR2(F7S.BT_ANT) ^= (2)'0' THEN                    00000360
        S001NC1O.BT_ANTO = F_FELT_PIC_CHAR2 (F7S.BT_ANT);               00000370
      S001NC1O.VIRK_DATO_MÅO = F7S.VIRK_DATO_MÅ;                        00000380
      IF F_FELT_PIC_CHAR11(F7S.FNR_EK) ^= (11)'0' THEN                  00000390
         S001NC1O.FNR_EKO = F_FELT_PIC_CHAR11 (F7S.FNR_EK);             00000400
                                                                        00000410
  /*  S001NC1O.NAVN_EKO = F7S.NAVN_EK;              161287 BF */        00000420
 /* FEILMELDINGER MARKERING AV  FELT (ATTRIBUTTENE) */                  00000430
 %SKIP(2);                                                              00000440
      S001NC1O.DUMMYA = '_';                                            00000450
                                                                        00000460
  /*DERSOM FEIL FRA BEHANDLE-TRANS OVERFØRES FEIL HER,BARE FØRSTE GANG*/00000470
       IF ^ FRA_CICS THEN                                               00000480
          DO;                                                           00000490
            IF FEIL_MELD_NR > 0 THEN                                    00000500
               CALL SKRIV_FEIL(FEIL_MELD_NR);                           00000510
             FEIL_MELD_NR = 0;                                          00000520
          END;                                                          00000530
                                                                        00000540
      S001NC1O.REGDATOA = DFHBMASK;                                     00000550
      S001NC1O.TERMIDA  = DFHBMASK;                                     00000560
                                                                        00000570
      IF F7S.FNRNR = 0 THEN                                             00000580
         S001NC1O.FNRA = NOR_NUM;                                       00000590
      ELSE                                                              00000600
         DO;                                                            00000610
            S001NC1O.FNRA = BRI_NUM;                                    00000620
            S001NC1I.FNRL = CURSOR_POS;                                 00000630
            IF F7S.FNRNR ^= 999 THEN                                    00000640
               CALL SKRIV_FEIL(F7S.FNRNR);                              00000650
         END;                                                           00000660
      IF F7S.TKNRNR = 0 THEN                                            00000670
         S001NC1O.TKNRA = NOR_NUM;                                      00000680
      ELSE                                                              00000690
         DO;                                                            00000700
            S001NC1O.TKNRA = BRI_NUM;                                   00000710
            S001NC1I.TKNRL = CURSOR_POS;                                00000720
            IF F7S.TKNRNR ^= 999 THEN                                   00000730
               CALL SKRIV_FEIL(F7S.TKNRNR);                             00000740
         END;                                                           00000750
      IF F7S.TILL_EKNR = 0 THEN                                         00000760
         S001NC1O.TILL_EKA = NORMAL;                                    00000770
      ELSE                                                              00000780
         DO;                                                            00000790
            S001NC1O.TILL_EKA = DFHBMBRY;                               00000800
            S001NC1I.TILL_EKL = CURSOR_POS;                             00000810
            IF F7S.TILL_EKNR ^= 999 THEN                                00000820
               CALL SKRIV_FEIL(F7S.TILL_EKNR);                          00000830
         END;                                                           00000840
      IF F7S.BT_ANTNR = 0 THEN                                          00000850
         S001NC1O.BT_ANTA = NOR_NUM;                                    00000860
      ELSE                                                              00000870
         DO;                                                            00000880
            S001NC1O.BT_ANTA = BRI_NUM;                                 00000890
            S001NC1I.BT_ANTL = CURSOR_POS;                              00000900
            IF F7S.BT_ANTNR ^= 999 THEN                                 00000910
               CALL SKRIV_FEIL(F7S.BT_ANTNR);                           00000920
         END;                                                           00000930
      IF F7S.VIRK_DATO_MÅNR = 0 THEN                                    00000940
         S001NC1O.VIRK_DATO_MÅA = NOR_NUM;                              00000950
      ELSE                                                              00000960
         DO;                                                            00000970
            S001NC1O.VIRK_DATO_MÅA = BRI_NUM;                           00000980
            S001NC1I.VIRK_DATO_MÅL = CURSOR_POS;                        00000990
            IF F7S.VIRK_DATO_MÅNR ^= 999 THEN                           00001000
               CALL SKRIV_FEIL(F7S.VIRK_DATO_MÅNR);                     00001010
         END;                                                           00001020
      IF F7S.FNR_EKNR = 0 THEN                                          00001030
         S001NC1O.FNR_EKA = NOR_NUM;                                    00001040
      ELSE                                                              00001050
         DO;                                                            00001060
            S001NC1O.FNR_EKA = BRI_NUM;                                 00001070
            S001NC1I.FNR_EKL = CURSOR_POS;                              00001080
            IF F7S.FNR_EKNR ^= 999 THEN                                 00001090
               CALL SKRIV_FEIL(F7S.FNR_EKNR);                           00001100
         END;                                                           00001110
                                                                        00001120
                                                                        00001130
     /* VED GAMLE TRANS SKAL FNR OG VIRKDATO BLOKKERES    */            00001140
                                                                        00001150
      IF NY_GML_TRANS_IND = 'G' & FRA_MED_DIALOG THEN                   00001160
         DO;                                                            00001170
           S001NC1O.FNRA          = DFHBMASK;                           00001180
           S001NC1O.VIRK_DATO_MÅA = DFHBMASK;                           00001190
         END;                                                           00001200
                                                                        00001210
      ELSE IF FRA_UTEN_DIALOG THEN      /* BLOKKER ALT SAMMEN   */      00001220
                                                                        00001230
         DO;                                                            00001240
           S001NC1O.REGDATOA      = DFHBMASK;                           00001250
           S001NC1O.TERMIDA       = DFHBMASK;                           00001260
           S001NC1O.FNRA          = DFHBMASK;                           00001270
           S001NC1O.TKNRA         = DFHBMASK;                           00001280
           S001NC1O.TILL_EKA      = DFHBMASK;                           00001290
           S001NC1O.BT_ANTA       = DFHBMASK;                           00001300
           S001NC1O.VIRK_DATO_MÅA = DFHBMASK;                           00001310
           S001NC1O.FNR_EKA       = DFHBMASK;                           00001320
                                                                        00001330
         END;                                                           00001340
                                                                        00001350
      IF ^ FRA_CICS THEN                                                00001360
         DO;                                                            00001370
           S001NC1O.STYRE_KODEA    = DFHBMASK;                          00001380
           S001NC1O.FUNKSJONSKODEA = DFHBMASK;                          00001390
         END;                                                           00001400
                                                                        00001410
   END OVERFØR_F7_SØKER_MAP;                                            00001420
                                                                        00001430
 OVERFØR_F7_SØKER2_MAP:                                                 00001440
   PROC;                                                                00001450
   DCL                                                                  00001460
      NORMAL  CHAR (1),                                                 00001470
      NOR_NUM CHAR (1),                                                 00001480
      BRI_NUM CHAR (1);                                                 00001490
      NORMAL    = ' ';                                                  00001500
      NOR_NUM   = '&';                                                  00001510
      BRI_NUM   = 'Q';                                                  00001520
                                                                        00001530
      IF  F7S.PENSJONSINNTEKT > 0   THEN                                00001540
          S001NC1O.PIO         = F7S.PENSJONSINNTEKT;                   00001550
      IF  F7S.ARBEIDSINNTEKT   > 0  THEN                                00001560
          S001NC1O.AIO         = F7S.ARBEIDSINNTEKT;                    00001570
      IF  F7S.PENSJONSINNTEKT_EK > 0 THEN                               00001580
          S001NC1O.PI_EKO      = F7S.PENSJONSINNTEKT_EK;                00001590
      IF  F7S.ARBEIDSINNTEKT_EK > 0 THEN                                00001600
          S001NC1O.AI_EKO      = F7S.ARBEIDSINNTEKT_EK;                 00001610
 %SKIP(3);                             /*    */                         00001620
      IF F7S.PENSJONSINNTEKTNR = 0 THEN                                 00001630
         S001NC1O.PIA         = NOR_NUM;                                00001640
      ELSE                                                              00001650
         DO;                                                            00001660
            S001NC1O.PIA         = DFHBMBRY;                            00001670
            S001NC1I.PIL         = CURSOR_POS;                          00001680
            IF F7S.PENSJONSINNTEKTNR ^= 999 THEN                        00001690
               CALL SKRIV_FEIL(F7S.PENSJONSINNTEKTNR );                 00001700
         END;                                                           00001710
      IF F7S.ARBEIDSINNTEKTNR = 0 THEN                                  00001720
         S001NC1O.AIA         = NOR_NUM;                                00001730
      ELSE                                                              00001740
         DO;                                                            00001750
            S001NC1O.AIA         = DFHBMBRY;                            00001760
            S001NC1I.AIL         = CURSOR_POS;                          00001770
            IF F7S.ARBEIDSINNTEKTNR ^= 999 THEN                         00001780
               CALL SKRIV_FEIL(F7S.ARBEIDSINNTEKTNR );                  00001790
         END;                                                           00001800
      IF F7S.PENSJONSINNTEKT_EKNR = 0 THEN                              00001810
         S001NC1O.PI_EKA         = NOR_NUM;                             00001820
      ELSE                                                              00001830
         DO;                                                            00001840
            S001NC1O.PI_EKA         = DFHBMBRY;                         00001850
            S001NC1I.PI_EKL         = CURSOR_POS;                       00001860
            IF F7S.PENSJONSINNTEKT_EKNR ^= 999 THEN                     00001870
               CALL SKRIV_FEIL(F7S.PENSJONSINNTEKT_EKNR );              00001880
         END;                                                           00001890
      IF F7S.ARBEIDSINNTEKT_EKNR = 0 THEN                               00001900
         S001NC1O.AI_EKA         = NOR_NUM;                             00001910
      ELSE                                                              00001920
         DO;                                                            00001930
            S001NC1O.AI_EKA         = DFHBMBRY;                         00001940
            S001NC1I.AI_EKL         = CURSOR_POS;                       00001950
            IF F7S.ARBEIDSINNTEKT_EKNR ^= 999 THEN                      00001960
               CALL SKRIV_FEIL(F7S.ARBEIDSINNTEKT_EKNR );               00001970
         END;                                                           00001980
                                                                        00001990
      IF FRA_UTEN_DIALOG THEN          /* BLOKKER ALT SAMMEN     */     00002000
         DO;                                                            00002010
           S001NC1O.PIA           = DFHBMASK;                           00002020
           S001NC1O.AIA           = DFHBMASK;                           00002030
           S001NC1O.PI_EKA        = DFHBMASK;                           00002040
           S001NC1O.AI_EKA        = DFHBMASK;                           00002050
         END;                                                           00002060
                                                                        00002070
   END OVERFØR_F7_SØKER2_MAP;                                           00002080
 %PAGE;                                /*   */                          00002090
 /* ***************************************************************** */00002100
 /*                                                                   */00002110
 /*   OVERFØRING FRA WORKAREA TIL MAP FOR BARNEDELEN                  */00002120
 /*                                                                   */00002130
 /* ***************************************************************** */00002140
 %SKIP(2);                                                              00002150
 OVERFØR_F7_BARN_MAP:                                                   00002160
   PROC;                                                                00002170
   DCL                                                                  00002180
      ANT_BARN FIXED BIN (15);                                          00002190
   DCL                                                                  00002200
      NORMAL  CHAR (1) INIT(' '),                                       00002210
      NOR_NUM CHAR (1) INIT('&'),                                       00002220
      BRI_NUM CHAR (1) INIT('Q');                                       00002230
 %SKIP;                                                                 00002240
                                                                        00002250
   /*CALL BLANK_F7_BARN_REST; */                                        00002260
                                                                        00002270
   DO ANT_BARN  = 1 TO F7S.BT_ANT;                                      00002280
      IF F_FELT_PIC_CHAR11(F7B.FNR_BARN(ANT_BARN)) ^= (11)'0' THEN      00002290
         DO;                                                            00002300
            S001NC1O.                                                   00002310
            FNR_BARNO (ANT_BARN) =                                      00002320
                        F_FELT_PIC_CHAR11(F7B.FNR_BARN(ANT_BARN));      00002330
            IF F7B.FNR_BARNNR(ANT_BARN) = 0 THEN                        00002340
               S001NC1O.FNR_BARNA(ANT_BARN)  = NOR_NUM;                 00002350
            ELSE                                                        00002360
               DO;                                                      00002370
                  S001NC1O.FNR_BARNA(ANT_BARN) = BRI_NUM;               00002380
                  S001NC1I.FNR_BARNL(ANT_BARN) = CURSOR_POS;            00002390
                  IF F7B.FNR_BARNNR(ANT_BARN) ^= 999 THEN               00002400
                    CALL SKRIV_FEIL(F7B.FNR_BARNNR(ANT_BARN));          00002410
               END;                                                     00002420
            S001NC1O.RBTNO(ANT_BARN) =                                  00002430
                         F7B.FELLES_BARN(ANT_BARN);                     00002440
            IF F7B.FELLES_BARNNR(ANT_BARN) = 0 THEN                     00002450
               S001NC1O.RBTNA(ANT_BARN) = NORMAL;                       00002460
            ELSE                                                        00002470
               DO;                                                      00002480
                  S001NC1O.RBTNA(ANT_BARN) = DFHBMBRY;                  00002490
                  S001NC1I.RBTNL(ANT_BARN) = CURSOR_POS;                00002500
                  IF F7B.FELLES_BARNNR(ANT_BARN) ^= 999 THEN            00002510
                    CALL SKRIV_FEIL(F7B.FELLES_BARNNR(ANT_BARN));       00002520
               END;                                                     00002530
         END;                                                           00002540
   END;                                                                 00002550
                                                                        00002560
                                                                        00002570
      IF FRA_UTEN_DIALOG THEN          /* BLOKKER ALT SAMMEN     */     00002580
         CALL BLOKKERE_BARN;                                            00002590
                                                                        00002600
   END OVERFØR_F7_BARN_MAP;                                             00002610
