 /*       SIST ENDRET 28/07-92 11.15.25 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 14/07-92 08.23.05 AV   HERMAN                   */00000010
 /*       SIST ENDRET 10/07-92 11.22.38 AV   HERMAN                   */00000020
 /*       SIST ENDRET 10/07-92 08.25.54 AV   HERMAN                   */00000030
 /*       SIST ENDRET 08/07-92 10.23.02 AV   HERMAN                   */00000040
 /*       SIST ENDRET 22/06-92 12.41.30 AV   HERMAN                   */00000050
 /*       SIST ENDRET 12/06-92 13.53.29 AV   TRUDE                    */00000060
 /*       SIST ENDRET 09/06-92 12.28.00 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 05/06-92 12.14.38 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 23/04-92 15.18.03 AV   HERMAN                   */00000090
 /*       SIST ENDRET 23/04-92 13.24.44 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 20/02-92 12.13.50 AV   HERMAN                   */00000110
 /*       SIST ENDRET 17/02-92 13.49.58 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 12/02-92 15.37.30 AV   HERMAN                   */00000130
 /*       SIST ENDRET 28/01-92 12.28.37 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 13/01-92 14.18.03 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 13/12-91 13.04.14 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 24/06-91 13.25.20 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 21/06-91 14.37.22 AV   HERMAN                   */00000180
 /*       SIST ENDRET 14/06-91 13.27.24 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 26/04-91 12.24.12 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 04/04-91 13.58.11 AV   HERMAN                   */00000210
 /*       SIST ENDRET 13/03-91 13.21.17 AV   DYBVIK                   */00000220
 /*       SIST ENDRET 15/01-91 15.27.14 AV   HERMAN                   */00000230
 /*       SIST ENDRET 10/01-91 14.59.23 AV   HERMAN                   */00000240
 /*       SIST ENDRET 08/01-91 12.47.29 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 11/12-90 13.35.41 AV   DYBVIK                   */00000260
 /*       SIST ENDRET 21/09-90 08.17.31 AV   DYBVIK                   */00000270
 /*       SIST ENDRET 18/09-90 13.12.14 AV   DYBVIK                   */00000280
 /*       SIST ENDRET 05/07-90 09.41.25 AV   DYBVIK                   */00000290
 /*       SIST ENDRET 14/03-90 09.50.42 AV   DYBVIK                   */00000300
 /*       SIST ENDRET 08/02-90 14.09.30 AV   DYBVIK                   */00000310
 /*       SIST ENDRET 23/01-90 15.34.20 AV   HERMAN                   */00000320
 /*       SIST ENDRET 09/01-90 12.25.04 AV   DYBVIK                   */00000330
 /*       SIST ENDRET 15/12-89 13.14.52 AV   HERMAN                   */00000340
 /*       SIST ENDRET 24/10-89 14.17.14 AV   DYBVIK                   */00000350
 /*       SIST ENDRET 16/10-89 13.24.15 AV   DYBVIK                   */00000360
 /*       SIST ENDRET 14/08-89 13.55.32 AV   DYBVIK                   */00000370
 /*       SIST ENDRET 14/04-89 14.53.27 AV   DYBVIK                   */00000380
 /* ***************************************************************** */00000390
 /*IDENTIFIKASJON:                                                    */00000400
 /*    R0014901 - AUTOHENDELSE_BEREGNING - HOVEDPROGRAM I CICS/PLI    */00000410
 /*    PROGRAMMERER: KRISTENSEN, SEPTEMBER 1982                       */00000420
 /*HENSIKT:                                                           */00000430
 /*    PROGRAMMET FINNER UT OM NOEN I FAMILIEN PASSERER BESTEMTE      */00000440
 /*    ALDERSGRENSER. DERSOM DETTE ER TILFELLE BLIR BEREGNINGER KALT, */00000450
 /*    EVENTUELLE STØNADSBREV SKREVET UT, SAMT KALT  PÅ RUTINER SOM   */00000460
 /*    DANNER STATISTIKK - TRANSER.                                   */00000470
 /*PROGRAMTILKNYTNING:                                                */00000480
 /*    PROGRAMMET BLIR LINKET FRA R0013001. D.V.S. ON-LINE KJØRING    */00000490
 /*    PROGRAMMET BLIR LINKET FRA ALDERSKONVERTER D.V.S. BATCH-KJØRING*/00000500
 /*      DET FORETAS LINK TIL 4001 - BEREGNING                        */00000510
 /*      DET FORETAS LINK TIL 6001 - STATISTIKK                       */00000520
 /*      DET FORETAS LINK TIL 7001 - STØNADSBREV                      */00000530
 /*                                                                   */00000540
 /*      FØLGENDE EKSTERNE RUTINER ER DET INCLUDE PÅ :                */00000550
 /*                                                                   */00000560
 /*         R0019902         FINNE KJØNN                              */00000570
 /*         R0019905         FINNE ALDER                              */00000580
 /*         R0019913         SNUR  DATO (PIC(4))                      */00000590
 /*         R0019934         OPPHØR_KOBLING_TO_PERSONER               */00000600
 /*         R0019938         ETTERLATTEPENSJON_OPPHØRER               */00000610
 /*         R0019966         AFP_NULL_OPPHØRER                        */00000620
 /*                                                                   */00000630
 /*      INTERNE RUTINER :                                            */00000640
 /*                                                                   */00000650
 /*         R001490                    HOVEDPROGRAMMET                */00000660
 /*           REGN_ALDER_FOR_FAMILIE                                  */00000670
 /*           ADDER_EN_MÅNED_TIL_ALDER_FAMILIE                        */00000680
 /*           AUTO_ONLINE              TESTER KONVERTERINGSGRENSER    */00000690
 /*             FINNES_SØKER                                          */00000700
 /*               SETT_VIRKDATO_BARN                                  */00000710
 /*             P67_TIL_P70                                           */00000720
 /*             OVERGANG_TIL_P67                                      */00000730
 /*             ER_EKTEFELLE_67_70                                    */00000740
 /*             FJERN_EKTEFELLE_TILLEGG                               */00000750
 /*             UNG_UFØR                                              */00000760
 /*             FØDT_UFØR                                             */00000770
 /*             FØDT_UFØR_BARN                                        */00000780
 /*             FJERN_BARNEPENSJON                                    */00000790
 /*             UFØR_BARN                                             */00000800
 /*             FJERN_BARNETILLEGG                                    */00000810
 /*             BARN_18ÅR                                             */00000820
 /*             BARNS_TILKNYTNINGSKODE_ENDRES                         */00000830
 /*             YRKESSKADE_ELEV                                       */00000840
 /*             SATSENDRING                                           */00000850
 /*             FINNE_SISTE_UFT_ÅM                                    */00000860
 /*                                                                   */00000870
 /*                                                                   */00000880
 /*                                                                   */00000890
 /*BRUK:                                                              */00000900
 /*    EXEC CICS LINK PROGRAM('R0014901') COMMAREA(KOM_OMR)           */00000910
 /*ENDRET : 15.2.84 - HERMAN.                                         */00000920
 /*         LOVENDRING PR 1.4.84 GÅR UT PÅ AT 'FORVENTET' I EP        */00000930
 /*         SKAL NYTTES SOM 'FAI' VED OVERGANG TIL AP - DERSOM        */00000940
 /*         SLIK BEREGNING ER GUNSTIGST.                              */00000950
 /*ENDRET : 26.6.84 OG 2.7.84 - HERMAN                                */00000960
 /*         EKTEFELLER SOM BLE KONVERTERT FRA UP TIL AP I SAMME MåNED:*/00000970
 /*         MANNEN FIKK 758 % VENTETILLEGG.                           */00000980
 /*ENDRET : 4/10.84 - KARIN.                                          */00000990
 /*         ETTERLATT EKTEFELLE MED OVERGANGSSTØNAD OG FRAMLEGGSDATO  */00001000
 /*         OG OPPHØRSDATO BLIR REGNET FRAM TIL DAGENS DATO.          */00001010
 /*         ENDRET TIL Å AUTOBEREGNES FRAM TIL FRAMLEGGSDATO.         */00001020
 /*ENDRET : 29.7.85 - HERMAN                                          */00001030
 /*         ENDRINGEN SOM ER BESKREVET OVENFOR VEDR. ETTERLATT ER     */00001040
 /*         FLYTTET OG BRUKER NÅ CALL TIL 9938.                       */00001050
 /*ENDRET : 21.10.85 - HERMAN                                         */00001060
 /*         FORELDRELØSE BARN SKAL HA STOPP I PENSJON FRA MÅNEDEN     */00001070
 /*         ETTER AT DE FYLLER 20 ÅR - FEILRAPPORT 259.               */00001080
 /*ENDRET : 8.10.86 - ERIK                                            */00001090
 /*         LAGT INN CALL TIL 4901 I 9951, SLIK AT INNTEKTSSTØNADS-   */00001100
 /*         BREVER FÅR VIRK.DATO TILBAKE TIL DET TIDSPUNKT ENDRINGEN  */00001110
 /*         GJELDER FRA, OG SLIK AT ETTER.BET. PERIODENE VISES PÅ     */00001120
 /*         STØNADSBREVET.                                            */00001130
 /*ENDRET : 13.2.87 - HERMAN                                          */00001140
 /*         UNGE UFøRE FåR ENDRET BUP_GARANTI TIL 2.50 POENG          */00001150
 /*         FRA 1.5.87.                                               */00001160
 /*ENDRET : 16.2.88 - HERMAN                                          */00001170
 /*         UNGE UFØRE FÅR ENDRET BUP_GARANTI TIL 3.00 POENG          */00001180
 /*         FRA 1.5.88                                                */00001190
 /*ENDRET : 23.12.88 - HERMAN                                         */00001200
 /*         UNGE UFØRE FÅR ENDRET ALDERSGRENSEN TIL 22 ÅR FRA 01895   */00001210
 /*ENDRET : 24.10.90 - TRUDE                                          */00001220
 /*         UNGE UFØRE FØR 1967 ENDRET GARANTI FRA 1.6 TIL 2.00       */00001230
 /*ENDRET : 13.5.91 - TRUDE                                           */00001240
 /*         UNGE UFØRE FÅR ENDRET BUP_GARANTI TIL 3.30 POENG          */00001250
 /*         FRA 1.5.91                                                */00001260
 /*ENDRET : 24.4.92 - TRUDE                                           */00001270
 /*         RULLERING AV ALDERSP.FAI OG FORSI-INNTEKTER               */00001280
 /*         REGELENDRINGER FRA 0591 OG 0192                           */00001290
 /* ***************************************************************** */00001300
 R001490: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                          00001310
 DCL                                                                    00001320
 1 B01 BASED(B01_PEKER),                                                00001330
 %INCLUDE P0019921;  /* B01-OMRÅDE (BASED)        */                    00001340
 DCL                                                                    00001350
 1 B02 BASED(B02_PEKER),                                                00001360
 %INCLUDE P0019921;  /* B02-OMRÅDE (BASED)        */                    00001370
 %INCLUDE P0019906;  /* TRANS-OPPL-OMRÅDE (BASED) */                    00001380
 %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)        */                    00001390
 %INCLUDE P0019910;  /* STYRINGS-OMRÅDE (BASED)   */                    00001400
 DCL                                                                    00001410
   1 TRANS_LISTE_OMR UNAL BASED (TRANS_LISTE_PEKER),                    00001420
     3 TRANS_LISTE_LINJE (5),                                           00001430
 %INCLUDE P0019911;  /* TRANS-LISTE-OMRÅDE UNDERNIVÅ)*/                 00001440
 DCL                                                                    00001450
   1 WORK_TRANS_LISTE UNAL BASED (WORK_TRANS_LISTE_PEKER),              00001460
 %INCLUDE P0019911;  /* TRANS-LISTE-OMRÅDE UNDERNIVÅ)*/                 00001470
 %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE (BASED)  */                    00001480
 %INCLUDE P0019925;  /* GRUNNBELØP OG SÆRTILLEGG-TABELL  */             00001490
                                                                        00001500
 DCL 1 B01_HJELP,                                                       00001510
 %INCLUDE P0019921;                                                     00001520
 DCL 1 B02_HJELP,                                                       00001530
 %INCLUDE P0019921;                                                     00001540
 DCL                                                                    00001550
   1 ALDERSOMRÅDE UNAL,                                                 00001560
     2 ALDER_PERSON (14),                                               00001570
       3 ÅR PIC 'S999',                                                 00001580
       3 MN PIC '99';                                                   00001590
                                                                        00001600
 DCL                                                                    00001610
   1 ALDERSOMRÅDE_DEF DEF ALDERSOMRÅDE UNAL,                            00001620
     2 ALDER_PERSON_ÅM (14)  PIC 'S99999';                              00001630
                                                                        00001640
                                                                        00001650
                                                                        00001660
 DCL                                                                    00001670
   (VERIFY,ADDR,CSTG,LOW,STG,SUBSTR) BUILTIN;                           00001680
 DCL                                                                    00001690
   COMMAREA_PEKER PTR;                                                  00001700
 DCL                                                                    00001710
   START_TRANS_OPPL_PEKER       POINTER;                                00001720
 DCL                                                                    00001730
   (I,J,K) FIXED BIN(15);                                               00001740
 DCL                                                                    00001750
   ALDER_VED_DØD                PIC 'S99999',                           00001760
   AUTODATO_ÅM                  PIC'9999',                              00001770
   AUTODATO_Å                   PIC'99' DEF AUTODATO_ÅM POS(1),         00001780
   AUTODATO_M                   PIC'99' DEF AUTODATO_ÅM POS(3),         00001790
   AVDØD_IND                    FIXED BIN(15),                          00001800
   BUP_IND                      FIXED BIN(15),                          00001810
   DØDSDATO_ÅM                  PIC'9999',                              00001820
   FIXED_DEC5                   FIXED DEC(5),                           00001830
   G_FØR                        FIXED DEC(5) INIT(0),                   00001840
   G_NÅ                         FIXED DEC(5) INIT(0),                   00001850
   HENDELSE_IND                 BIT (1),                                00001860
   HJ_VIRK_DATO_ÅM              PIC '9999',                             00001870
   JA                           BIT (1) INIT('1'B),                     00001880
   MAX_BARN                     FIXED BIN(15),                          00001890
   NEI                          BIT (1) INIT('0'B),                     00001900
   PIC4                         PIC'9999',                              00001910
   PIC11                        PIC'(11)9',                             00001920
   SATSENDRING_DENNE_MÅNED      BIT (1) INIT('0'B),                     00001930
   SISTE_UTFYLLTE_BUP_GAR_KODE  FIXED BIN(15),                          00001940
   START_SØKER_IND              FIXED BIN(15),                          00001950
   TRANSTYPE2                   PIC'99',                                00001960
   UF_IND                       FIXED BIN(15),                          00001970
   UFØR_BARN_IND                FIXED BIN(15),                          00001980
   W01_FØRSTE_GANG              BIT (1) INIT('1'B),                     00001990
   WS_B01_VIRK_DATO_MÅ          PIC'9999',                              00002000
   WS_TRANS_OPPL_VIRK_DATO      PIC'9999',                              00002010
   ÅR                           PIC'99' DEF PIC11 POS (5),              00002020
   ÅRHUNDRE                     PIC'9'  DEF PIC11 POS (7),              00002030
 /*YS*/ ETT_POENG               FIXED DEC (3,2) INIT (1.0),             00002040
 /*YS*/ ETT_KOMMA_FEM_POENG     FIXED DEC (3,2) INIT (1.5),             00002050
 /*YS*/ TO_POENG                FIXED DEC (3,2) INIT (2.0);             00002060
   DCL I_EK                     FIXED BIN(15);                          00002070
                                                                        00002080
 DCL W_FNR                      PIC '(11)9';                            00002090
 DCL 1 FNR_R DEF W_FNR,                                                 00002100
     2 DAG       PIC '99',                                              00002110
     2 MND       PIC '99',                                              00002120
     2 ÅR        PIC '99',                                              00002130
     2 ÅRHUNDRE  PIC '9',                                               00002140
     2 FILLER    PIC '(4)9';                                            00002150
                                                                        00002160
 DCL W_FNR_ÅM    PIC '(4)9';                                            00002170
                                                                        00002180
 HENDELSE_IND = NEI;                                                    00002190
 START_SØKER_IND          = SØKER_IND;                                  00002200
                                                                        00002210
    START_TRANS_OPPL_PEKER   = KOM_OMR.TRANS_OPPL_PEKER;                00002220
    KOM_OMR.TRANS_OPPL_PEKER = KOM_OMR.WORK_TRANS_LISTE_PEKER;          00002230
                                                                        00002240
                                                                        00002250
 TRANS_OPPL_OMR.TRANSKODE        = 'AUTO';                              00002260
 TRANS_OPPL_OMR.FØDSNUMMER       = 0;                                   00002270
 TRANS_OPPL_OMR.NY_GML_TRANS_IND = ' ';                                 00002280
 TRANS_OPPL_OMR.BLANKETTYPE      = '  ';                                00002290
 TRANS_OPPL_OMR.TRANS_RETURKODE  = (4)' ';                              00002300
                                                                        00002310
 ALDERSOMRÅDE_DEF = '';                                                 00002320
                                                                        00002330
                                                                        00002340
       SELECT (KJØRINGS_TYPE);                                          00002350
        WHEN ('S')                                                      00002360
             DO;                                                        00002370
                AUTODATO_ÅM = NESTE_HENDELSE_DATO_ÅM;                   00002380
             END;                                                       00002390
        WHEN ('Q')                                                      00002400
             DO;                                                        00002410
                AUTODATO_ÅM = B02.VIRK_DATO_ÅM(SØKER_IND);              00002420
                AUTODATO_ÅM = AUTODATO_ÅM + 1;                          00002430
                                                                        00002440
                IF AUTODATO_M = 13 THEN                                 00002450
                   DO;                                                  00002460
                     AUTODATO_M = 1;                                    00002470
                     AUTODATO_Å = AUTODATO_Å + 1;                       00002480
                   END;                                                 00002490
                                                                        00002500
                                                                        00002510
             END;                                                       00002520
        OTHERWISE                                                       00002530
             DO;                                                        00002540
               DO I=1 TO 14 UNTIL(B01.STATUS.VIRK_DATO_ÅM (I) > 0 &     00002550
                               B01.STATUS.PENSJONSTYPE1(I) ^='D' );     00002560
               AUTODATO_ÅM = B01.STATUS.VIRK_DATO_ÅM(I) + 1;            00002570
               END;                                                     00002580
                                                                        00002590
               IF AUTODATO_M = 13 THEN                                  00002600
                  DO;                                                   00002610
                    AUTODATO_M = 1;                                     00002620
                    AUTODATO_Å = AUTODATO_Å + 1;                        00002630
                  END;                                                  00002640
                                                                        00002650
             END;                                                       00002660
                                                                        00002670
        END;                                                            00002680
                                                                        00002690
 UFØR_BARN_IND = 0;                                                     00002700
                                                                        00002710
 CALL REGN_ALDER_FOR_FAMILIE;                                           00002720
                                                                        00002730
 DO WHILE (AUTODATO_ÅM <= NESTE_HENDELSE_DATO_ÅM);                      00002740
                                                                        00002750
   TRANS_OPPL_OMR.TRANSTYPE  = 0;                                       00002760
                                                                        00002770
   /** FINNER UT OM DET ER SATSENDRINGER DENNE MÅNED  **/               00002780
                                                                        00002790
   DO J = 1 TO 50 UNTIL(PERIODE_START_ÅMD(J)/100 >=AUTODATO_ÅM);        00002800
   END;                                                                 00002810
                                                                        00002820
                                                                        00002830
   PIC4 = PERIODE_START_ÅMD(J)/100;                                     00002840
   G    = G_TAB_PERIODE.GRUNNBELØP(J);                                  00002850
                                                                        00002860
   IF PIC4 = AUTODATO_ÅM THEN                                           00002870
     DO;                                                                00002880
                                                                        00002890
       SATSENDRING_DENNE_MÅNED = JA;                                    00002900
       G_FØR = G_TAB_PERIODE.GRUNNBELØP(J - 1);                         00002910
       G_NÅ  = G_TAB_PERIODE.GRUNNBELØP(J    );                         00002920
                                                                        00002930
                     /* TRUDE 090692 ????????????*/                     00002940
       CALL SATSENDRING; /*TIL HIT TRUDE */                             00002950
                                                                        00002960
                                                                        00002970
     END;                                                               00002980
   ELSE                                                                 00002990
     DO;                                                                00003000
       SATSENDRING_DENNE_MÅNED = NEI;                                   00003010
       G_FØR = 0;                                                       00003020
       G_NÅ  = 0;                                                       00003030
     END;                                                               00003040
                                                                        00003050
   CALL AUTO_ONLINE;                                                    00003060
                                                                        00003070
   DO WHILE (HENDELSE_IND = JA);                                        00003080
                                                                        00003090
     /** DET ER LAGET TRANS DENNE MÅNED  **/                            00003100
                                                                        00003110
     IF TRANS_OPPL_OMR.TRANSTYPE = 0 THEN /** DET ER BARE ENDRING **/   00003120
       DO;                                /** PÅ UFØRT BARN       **/   00003130
         TRANS_OPPL_OMR.TRANSTYPE = TRANSTYPE2;                         00003140
         TRANSTYPE2               = 0;                                  00003150
         TRANS_OPPL_OMR.FØDSNUMMER= B02.RF0PERSN.FNR(UFØR_BARN_IND);    00003160
         TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);        00003170
         SØKER_IND                = UFØR_BARN_IND;                      00003180
         HENDELSE_IND             = NEI;                                00003190
                                                                        00003200
       END;                                                             00003210
                                                                        00003220
     IF (TRANS_OPPL_OMR.TRANSTYPE > 0  &                                00003230
        TRANS_OPPL_OMR.TRANSTYPE < 50   )   !                           00003240
        TRANS_OPPL_OMR.TRANSTYPE = 99   THEN                            00003250
       DO;                                                              00003260
                                                                        00003270
         IF SØKER_IND    = 1         THEN                               00003280
            EKTEF_IND    = 2;                                           00003290
         ELSE                                                           00003300
            IF SØKER_IND = 2         THEN                               00003310
               EKTEF_IND = 1;                                           00003320
                                                                        00003330
         IF TRANS_OPPL_OMR.TRANSTYPE ^= 27 THEN                         00003340
            DO;                                                         00003350
               DO I = 1 TO 14;                                          00003360
                  B02.GAMMEL_FT_KODE(I) = ' ';                          00003370
               END;                                                     00003380
            END;                                                        00003390
                                                                        00003400
         EXEC CICS LINK PROGRAM('R0014001') COMMAREA(KOM_OMR);          00003410
                          /** BEREGNING **/                             00003420
         IF FEIL_MELD_NR > 0 THEN                                       00003430
           GOTO AVSLUTNING;                                             00003440
                                                                        00003450
         B01_HJELP            = B01           ;                         00003460
         B02_HJELP            = B02           ;                         00003470
                                                                        00003480
 /*      IF TRANS_OPPL_OMR.TRANSTYPE = 99   &                           00003490
              B02.BT_SÆRBARN(SØKER_IND)    ^>                           00003500
              B01.BT_SÆRBARN(SØKER_IND)     THEN                        00003510
              TRANS_OPPL_OMR.TRANSTYPE = 27;            */              00003520
                                                                        00003530
         IF TRANS_OPPL_OMR.TRANSTYPE ^= 27     THEN                     00003540
                                                                        00003550
         IF STØNADSBREV_ØNSKET_IND = JA THEN                            00003560
              DO;                                                       00003570
                                                                        00003580
                 EXEC CICS LINK PROGRAM('R0017001') COMMAREA(KOM_OMR);  00003590
                                       /*LAG_STØNADSBREV_TRANSER*/      00003600
                 IF FEIL_MELD_NR > 0 THEN                               00003610
                    GOTO AVSLUTNING;                                    00003620
                 IF TRANS_OPPL_OMR.TRANSTYPE = 99   THEN                00003630
                    TRANS_OPPL_OMR.TRANSTYPE = 27;                      00003640
                                                                        00003650
              END;                                                      00003660
                                                                        00003670
       END;                                                             00003680
                                                                        00003690
 /* VED OPPHØR MÅ STØNADSBREV-RUTINA KALLES FOR Å UNDERSØKE      */     00003700
 /* OM DET FINNES TRANSAKSJONER PÅ PERSONEN FRA FØR :            */     00003710
                                                                        00003720
     ELSE    /* TRANSTYPE ER DA > 49 */                                 00003730
                                                                        00003740
        IF TRANS_OPPL_OMR.TRANSTYPE = 54  !                             00003750
                                                                        00003760
             /*54 = PENSJONIST ER DØD, EKTEFELLEN HAR IKKE PENSJON*/    00003770
                                                                        00003780
           TRANS_OPPL_OMR.TRANSTYPE = 55          THEN                  00003790
                                                                        00003800
             /*55 = PENSJON OPPHØRER, EKTEFELLEN HAR IKKE PENSJON*/     00003810
                                                                        00003820
           IF STØNADSBREV_ØNSKET_IND = JA THEN                          00003830
                                                                        00003840
              DO;                                                       00003850
                                                                        00003860
                 EXEC CICS LINK PROGRAM('R0017001') COMMAREA(KOM_OMR);  00003870
                                     /*LAG_STØNADSBREV_TRANSER*/        00003880
                 IF FEIL_MELD_NR > 0 THEN                               00003890
                    GOTO AVSLUTNING;                                    00003900
              END;                                                      00003910
                                                                        00003920
        IF FUNKSJONSKODE = 'E' THEN                                     00003930
           IF W01_FØRSTE_GANG  THEN                                     00003940
              DO;                                                       00003950
                 WS_TRANS_OPPL_VIRK_DATO =                              00003960
                                       TRANS_OPPL_OMR.VIRKNINGSDATO;    00003970
                 TRANS_OPPL_OMR.VIRKNINGSDATO =                         00003980
                             TRANS_LISTE_OMR.VIRKNINGSDATO(1);          00003990
                                                                        00004000
                 DO I = 1 TO 14;                                        00004010
                    B01.PERSON(I)   = ''  ;                             00004020
                 END;                                                   00004030
                                                                        00004040
                 W01_FØRSTE_GANG = '0'B;                                00004050
                                                                        00004060
                /*LAG_DYNAMISK_STAT_TRANS*/                             00004070
                                                                        00004080
                 EXEC CICS LINK PROGRAM('R0016001') COMMAREA(KOM_OMR);  00004090
                                                                        00004100
                 TRANS_OPPL_OMR.VIRKNINGSDATO = WS_TRANS_OPPL_VIRK_DATO;00004110
                                                                        00004120
                 B01 = B02;                                             00004130
              END;                                                      00004140
                                                                        00004150
        EXEC CICS LINK PROGRAM('R0016001') COMMAREA(KOM_OMR);           00004160
                                                                        00004170
     IF FEIL_MELD_NR > 0 THEN                                           00004180
        GOTO AVSLUTNING;                                                00004190
                                                                        00004200
     IF TRANSTYPE2 > 0 THEN    /** BARNEKULLET ER OPPDATERT, NÅ   **/   00004210
       DO;                     /** SKAL DET UFØRE BARN OPPDATERES **/   00004220
         SØKER_IND = UFØR_BARN_IND;                                     00004230
         TRANS_OPPL_OMR.TRANSTYPE  = TRANSTYPE2;                        00004240
         TRANSTYPE2                = 0;                                 00004250
         TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR(SØKER_IND);       00004260
       END;                                                             00004270
     ELSE                                                               00004280
       HENDELSE_IND = NEI;                                              00004290
                                                                        00004300
     B01 = B02;                                                         00004310
                                                                        00004320
   END;   /** DO WHILE (HENDELSE_IND = JA)  **/                         00004330
                                                                        00004340
   AUTODATO_ÅM = AUTODATO_ÅM + 1;                                       00004350
   IF AUTODATO_M = 13 THEN                                              00004360
     DO;                                                                00004370
       AUTODATO_M = 1;                                                  00004380
       AUTODATO_Å = AUTODATO_Å + 1;                                     00004390
     END;                                                               00004400
                                                                        00004410
   CALL  ADDER_EN_MND_TIL_ALDER_FAMILIE;                                00004420
                                                                        00004430
 END;  /** DO WHILE (AUTODATO_ÅM <= NESTE_HENDELSE_DATO_ÅM) **/         00004440
                                                                        00004450
 IF UFØR_BARN_IND > 0 THEN                                              00004460
   FAMILIE_SPLITTET_IND = JA;                                           00004470
                                                                        00004480
 AVSLUTNING:                                                            00004490
                                                                        00004500
 SØKER_IND                = START_SØKER_IND;                            00004510
                                                                        00004520
                                                                        00004530
    KOM_OMR.TRANS_OPPL_PEKER = START_TRANS_OPPL_PEKER;                  00004540
                                                                        00004550
 EXEC CICS RETURN;                                                      00004560
                                                                        00004570
 /*****  HER SLUTTER HOVEDSTYRINGEN  *****/                             00004580
                                                                        00004590
                                                                        00004600
 AUTO_ONLINE:                                                           00004610
   PROC;                                                                00004620
                                                                        00004630
     DCL        FINNES_SØKER_TIL_DØD BIT(1) INIT('0'B);                 00004640
                                                                        00004650
 /*****  FOR Å FÅ SATT STYRING FOR TILLEGGSPENSJON FRA DØDE *****/      00004660
                                                                        00004670
   DO I = 1 TO 2;                                                       00004680
     IF B01.STATUS.DØDSDATO_ÅMD    (I) > 0 &                            00004690
 /*     FINNES_SØKER                       &              */            00004700
 /**/   ALDER_PERSON_ÅM(I) > 1912          &                            00004710
        B01.STATUS.STATUS_KODE_HIST(I) = 'X' THEN                       00004720
       DO;                                                              00004730
 /**/     AVDØD_IND = I;                                                00004740
          DØDSDATO_ÅM = B01.DØDSDATO_ÅMD(I) / 100;                      00004750
          PIC11 = B01.RF0PERSN.FNR(I);                                  00004760
          ALDER_VED_DØD = F_ALDER (PIC11,F_SNU_DATO(DØDSDATO_ÅM));      00004770
                                                                        00004780
         /** FINNE SISTE UTFYLLTE BUP_GAR_KODE FOR HIST PERSON**/       00004790
                                                                        00004800
          DO J = 5 TO 1 BY -1 UNTIL(B01.UFØRHIST.BUP_GAR_KODE           00004810
                                      (I,J) ^= ' ');                    00004820
             SISTE_UTFYLLTE_BUP_GAR_KODE = J;                           00004830
          END;                                                          00004840
                                                                        00004850
          IF (B01.UFØRHIST.BUP_GAR_KODE(I,                              00004860
           SISTE_UTFYLLTE_BUP_GAR_KODE)= 'A' &/* UNG UFØR SOM VENTER*/  00004870
           AUTODATO_ÅM > 8104 )    /*        &                          00004880
           ALDER_PERSON_ÅM(I) > 1912  &                                 00004890
           FINNES_SØKER            */   THEN                            00004900
             DO;                                                        00004910
                TRANS_OPPL_OMR.TRANSTYPE     = 31;                      00004920
 /*31 = FØDT UFØR FYLLER 20, ELLER ER 20 OG DATOEN ER 8105*/            00004930
                FINNES_SØKER_TIL_DØD = '1'B;                            00004940
                B02.BUP_GAR_KODE(I,SISTE_UTFYLLTE_BUP_GAR_KODE) = 'B';  00004950
             END;                                                       00004960
                                                                        00004970
           ELSE IF  (B01.UFØRHIST.BUP_GAR_KODE(I,                       00004980
           SISTE_UTFYLLTE_BUP_GAR_KODE)= 'C' &/* UNG UFØR SOM VENTER*/  00004990
           AUTODATO_ÅM = 8401)       /*      &                          00005000
           FINNES_SØKER              */ THEN                            00005010
                                                                        00005020
             DO;                                                        00005030
                TRANS_OPPL_OMR.TRANSTYPE     = 46;                      00005040
  /*46 = FØDT UFØR FYLLER 21 ÅR, ELLER ER 21 OG DATOEN ER 8401*/        00005050
                FINNES_SØKER_TIL_DØD = '1'B;                            00005060
                B02.BUP_GAR_KODE(I,SISTE_UTFYLLTE_BUP_GAR_KODE) = 'B';  00005070
             END;                                                       00005080
                                                                        00005090
 /*LOVENDRING 8901 - ENDRING 23.12.88 HL : */                           00005100
                                                                        00005110
           ELSE IF  (B01.UFØRHIST.BUP_GAR_KODE(I,                       00005120
           SISTE_UTFYLLTE_BUP_GAR_KODE)= 'D' &/* UNG UFØR SOM VENTER*/  00005130
                                              /* PÅ LOVENDRING 8901*/   00005140
           AUTODATO_ÅM = 8901)      /*       &                          00005150
           FINNES_SØKER             */  THEN                            00005160
           IF ALDER_PERSON_ÅM(I) < 2201  THEN /* THEN MANGLET TRUDE     00005170
                                                 260592  */             00005180
             DO;                                                        00005190
                TRANS_OPPL_OMR.TRANSTYPE     = 46;                      00005200
  /*46 = FØDT UFØR FYLLER 22 ÅR, ELLER ER 22 OG DATOEN ER 8901*/        00005210
                FINNES_SØKER_TIL_DØD = '1'B;                            00005220
                B02.BUP_GAR_KODE(I,SISTE_UTFYLLTE_BUP_GAR_KODE) = 'B';  00005230
             END;                                                       00005240
                                                                        00005250
 /*LOVENDRING 9105 - ENDRING 10.09.91 TRUDE ??? : */                    00005260
                                                                        00005270
           ELSE IF  (B01.UFØRHIST.BUP_GAR_KODE(I,                       00005280
           SISTE_UTFYLLTE_BUP_GAR_KODE)= 'B' & /* UNG UFØR SKAL 3.30 */ 00005290
           AUTODATO_ÅM = 9105)  THEN                                    00005300
                                                                        00005310
             DO;                                                        00005320
                TRANS_OPPL_OMR.TRANSTYPE     = 46;                      00005330
  /*46 = FØDT UFØR FYLLER 22 ÅR, ELLER ER 22 OG DATOEN ER 8901*/        00005340
                FINNES_SØKER_TIL_DØD = '1'B;                            00005350
                B02.BUP_GAR_KODE(I,SISTE_UTFYLLTE_BUP_GAR_KODE) = 'B';  00005360
             END;              /*HIT TRUDE, 0991????*/                  00005370
                                                                        00005380
 /*TILLEGG 2.3.90 HL : FOR Å GI GARANTI TIL UNGE DØDES ETTERLATTE */    00005390
                                                                        00005400
           ELSE                                                         00005410
           IF ALDER_VED_DØD < 2001         THEN                         00005420
                                                                        00005430
             DO;                                                        00005440
                IF AUTODATO_ÅM = 9105        THEN  /*TRUDE FRA HIT */   00005450
                   DO;                                                  00005460
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00005470
                      FINNES_SØKER_TIL_DØD = '1'B;                      00005480
                   END;                                                 00005490
                ELSE                               /* TIL HIT TRUDE  */ 00005500
                IF AUTODATO_ÅM = 8805        THEN                       00005510
                   DO;                                                  00005520
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00005530
                      FINNES_SØKER_TIL_DØD = '1'B;                      00005540
                   END;                                                 00005550
                ELSE                                                    00005560
                IF AUTODATO_ÅM = 8705        THEN                       00005570
                   DO;                                                  00005580
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00005590
                      FINNES_SØKER_TIL_DØD = '1'B;                      00005600
                   END;                                                 00005610
                ELSE                                                    00005620
                IF AUTODATO_ÅM = 8105        THEN                       00005630
                   DO;                                                  00005640
                      TRANS_OPPL_OMR.TRANSTYPE     = 31;                00005650
                      FINNES_SØKER_TIL_DØD = '1'B;                      00005660
                   END;                                                 00005670
             END;                                                       00005680
          ELSE                                                          00005690
          IF ALDER_VED_DØD < 2101         THEN                          00005700
                                                                        00005710
             DO;                                                        00005720
                IF AUTODATO_ÅM = 9105        THEN  /*TRUDE FRA HIT */   00005730
                   DO;                                                  00005740
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00005750
                      FINNES_SØKER_TIL_DØD = '1'B;                      00005760
                   END;                                                 00005770
                ELSE                               /* TIL HIT TRUDE  */ 00005780
                IF AUTODATO_ÅM = 8805        THEN                       00005790
                   DO;                                                  00005800
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00005810
                      FINNES_SØKER_TIL_DØD = '1'B;                      00005820
                   END;                                                 00005830
                ELSE                                                    00005840
                IF AUTODATO_ÅM = 8705        THEN                       00005850
                   DO;                                                  00005860
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00005870
                      FINNES_SØKER_TIL_DØD = '1'B;                      00005880
                   END;                                                 00005890
                ELSE                                                    00005900
                IF AUTODATO_ÅM = 8405        THEN                       00005910
                   DO;                                                  00005920
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00005930
                      FINNES_SØKER_TIL_DØD = '1'B;                      00005940
                   END;                                                 00005950
             END;                                                       00005960
          ELSE                                                          00005970
          IF ALDER_VED_DØD < 2201         THEN                          00005980
            DO;                                                         00005990
             IF AUTODATO_ÅM = 8901        THEN                          00006000
                DO;                                                     00006010
                   TRANS_OPPL_OMR.TRANSTYPE     = 46;                   00006020
                   FINNES_SØKER_TIL_DØD = '1'B;                         00006030
                END;                                                    00006040
             IF AUTODATO_ÅM = 9105        THEN   /*TRUDE*/              00006050
                DO;                                                     00006060
                   TRANS_OPPL_OMR.TRANSTYPE     = 46;                   00006070
                   FINNES_SØKER_TIL_DØD = '1'B;                         00006080
                END;                                                    00006090
            END;                                                        00006100
 /* HIT 2.3.90 HL */                                                    00006110
                                                                        00006120
       END;                                                             00006130
                                                                        00006140
   END;                                                                 00006150
                                                                        00006160
 IF AUTODATO_ÅM = 9201       THEN                                       00006170
 DO I = 1 TO 3;                                                         00006180
     IF B01.STATUS.VIRK_DATO_ÅM    (I) > 0   &                          00006190
        B01.GT_LOV92               (I) = 0   &                          00006200
        B01.STATUS.STATUS_KODE_HIST(I) = ' ' THEN                       00006210
     DO;                                                                00006220
     SELECT (B01.PENSJONSTYPE1(I));                                     00006230
                                                                        00006240
        WHEN('A')                                                       00006250
           DO;                                                          00006260
              IF B01.TP_BRUTTO(I)     > 0          &                    00006270
                 ALDER_PERSON_ÅM(3-I) < 6600     THEN                   00006280
                 DO;                                                    00006290
                                                                        00006300
              B02.GT_LOV92(I) = B01.ETTEPENS.TP_BRUTTO(I)               00006310
                              + B01.ALDERSP.TP(I);                      00006320
              B02.ALDERSP.SPT_1291(I) = B01.ALDERSP.SPT(I);             00006330
              B02.ALDERSP.OPT_1291(I) = B01.ALDERSP.OPT(I);             00006340
              B02.ALDERSP.PÅ_1291 (I) = B01.ALDERSP.PÅ (I);             00006350
              B02.ETTEPENS.SPT_1291(I) = B01.ETTEPENS.SPT_AVD(I);       00006360
              B02.ETTEPENS.OPT_1291(I) = B01.ETTEPENS.OPT_AVD(I);       00006370
              B02.ETTEPENS.PÅ_1291(I)  = B01.ETTEPENS.PÅ_AVD(I);        00006380
              HENDELSE_IND = JA;                                        00006390
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */         00006400
              TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);   00006410
              SØKER_IND = I;                                            00006420
              EKTEF_IND = 3 - I;                                        00006430
                 END;                                                   00006440
           END;                                                         00006450
                                                                        00006460
        WHEN('K')                                                       00006470
           DO;                                                          00006480
              B02.GT_LOV92(I) = B01.ALDERSP.TP(I);                      00006490
              B02.ALDERSP.SPT_1291(I) = B01.ALDERSP.SPT(I);             00006500
              B02.ALDERSP.OPT_1291(I) = B01.ALDERSP.OPT(I);             00006510
              B02.ALDERSP.PÅ_1291 (I) = B01.ALDERSP.PÅ (I);             00006520
              HENDELSE_IND = JA;                                        00006530
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */         00006540
              TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);   00006550
              SØKER_IND = I;                                            00006560
              EKTEF_IND = 3 - I;                                        00006570
           END;                                                         00006580
        WHEN('U', 'Y')                                                  00006590
           DO;                                                          00006600
            IF ALDER_PERSON_ÅM(I) < 6600     THEN                       00006610
              DO;                                                       00006620
                 B02.GT_LOV92(I) = B01.UFØRPENS.TP(I) +                 00006630
                                   B01.YRKEPENS.TP(I) +                 00006640
                                   B01.ETTEPENS.TP_BRUTTO(I);           00006650
                 DCL W_SISTE_UFT   FIXED BIN(15);                       00006660
                 W_SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                   00006670
                 IF B02.UFØRHIST.BUP(I,W_SISTE_UFT) > 5 THEN            00006680
                 DO;                                                    00006690
                    B02.UFØRPENS.SPT_1291(I) = B01.UFØRPENS.SPT(I);     00006700
                    B02.UFØRPENS.OPT_1291(I) = B01.UFØRPENS.OPT(I);     00006710
                    B02.UFØRPENS.PÅ_1291 (I) = B01.UFØRPENS.PÅ (I);     00006720
                    B02.YRKE_POENG_1291(I)   = B01.YRKEPENS.YPT(I);     00006730
                 END;                                                   00006740
                 HENDELSE_IND = JA;                                     00006750
                 TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */      00006760
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00006770
                 SØKER_IND = I;                                         00006780
                 EKTEF_IND = 3 - I;                                     00006790
              END;                                                      00006800
              IF B01.TP_BRUTTO(I)     > 0          &                    00006810
                 ALDER_PERSON_ÅM(3-I) < 6600     THEN                   00006820
                 DO;                                                    00006830
              B02.ETTEPENS.SPT_1291(I) = B01.ETTEPENS.SPT_AVD(I);       00006840
              B02.ETTEPENS.OPT_1291(I) = B01.ETTEPENS.OPT_AVD(I);       00006850
              B02.ETTEPENS.PÅ_1291(I)  = B01.ETTEPENS.PÅ_AVD(I);        00006860
              HENDELSE_IND = JA;                                        00006870
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */         00006880
              TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);   00006890
              SØKER_IND = I;                                            00006900
              EKTEF_IND = 3 - I;                                        00006910
                 END;                                                   00006920
           END;                                                         00006930
                                                                        00006940
        WHEN('E')                                                       00006950
           DO;                                                          00006960
              IF ALDER_PERSON_ÅM(3-I) < 6600     THEN                   00006970
                 DO;                                                    00006980
              B02.GT_LOV92(I) = B01.ETTEPENS.TP_BRUTTO(I);              00006990
              B02.ETTEPENS.SPT_1291(I) = B01.ETTEPENS.SPT_AVD(I);       00007000
              B02.ETTEPENS.OPT_1291(I) = B01.ETTEPENS.OPT_AVD(I);       00007010
              B02.ETTEPENS.PÅ_1291(I)  = B01.ETTEPENS.PÅ_AVD(I);        00007020
              HENDELSE_IND = JA;                                        00007030
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */         00007040
              TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);   00007050
              SØKER_IND = I;                                            00007060
              EKTEF_IND = 3 - I;                                        00007070
                 END;                                                   00007080
           END;                                                         00007090
                                                                        00007100
        WHEN('B')                                                       00007110
           DO;                                                          00007120
              B02.GT_LOV92(I) = B01.ETTEBARN.TP(I);                     00007130
              B02.SPT_1291_MOR(I) = B01.SPT_MOR(I);                     00007140
              B02.OPT_1291_MOR(I) = B01.OPT_MOR(I);                     00007150
              B02.PÅ_1291_MOR(I) = B01.PÅ_MOR(I);                       00007160
              B02.SPT_1291_FAR(I) = B01.SPT_FAR(I);                     00007170
              B02.OPT_1291_FAR(I) = B01.OPT_FAR(I);                     00007180
              B02.PÅ_1291_FAR(I) = B01.PÅ_FAR(I);                       00007190
              HENDELSE_IND = JA;                                        00007200
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */         00007210
              TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);   00007220
              SØKER_IND = I;                                            00007230
           END;                                                         00007240
                                                                        00007250
        OTHERWISE;                                                      00007260
     END;  /*OF SELECT*/                                                00007270
     END;                                                               00007280
 END;  /*DO I = 1 TO 3 */                                               00007290
                                                                        00007300
   I = 1;                                                               00007310
   TRANSTYPE2 = 0;                                                      00007320
                                                                        00007330
   DO WHILE (I < 3);                                                    00007340
     IF B01.STATUS.VIRK_DATO_ÅM    (I) > 0 &                            00007350
        B01.STATUS.STATUS_KODE_HIST(I) = ' ' THEN                       00007360
       DO;                                                              00007370
          PIC11 = B01.RF0PERSN.FNR(I);                                  00007380
                                                                        00007390
         /** FINNE SISTE UTFYLTE BUP_GAR_KODE FOR SØKER   **/           00007400
                                                                        00007410
         DO J = 5 TO 1 BY -1 UNTIL(B01.UFØRHIST.BUP_GAR_KODE            00007420
                                      (I,J) ^= ' ');                    00007430
           SISTE_UTFYLLTE_BUP_GAR_KODE = J;                             00007440
         END;                                                           00007450
                                                                        00007460
         IF (ALDER_PERSON_ÅM(I) = 7000            &                     00007470
             AUTODATO_ÅM        < 9100            &                     00007480
             B01.STATUS.PENSJONSTYPE1(I) = 'A' )  !                     00007490
            (ALDER_PERSON_ÅM(I) = 7001            &                     00007500
             AUTODATO_ÅM        > 9101            &                     00007510
             B01.STATUS.PENSJONSTYPE1(I) = 'A') THEN                    00007520
                                                                        00007530
            DO;                                                         00007540
               CALL P67_TIL_P70(FAMILIE_IND);                           00007550
               HENDELSE_IND = JA;                                       00007560
               SØKER_IND = I;                                           00007570
               I = I + 1;                                               00007580
            END;                                                        00007590
                                                                        00007600
         ELSE IF (ALDER_PERSON_ÅM(I)  = 6700    &                       00007610
                  AUTODATO_ÅM         < 9100    &                       00007620
                  ÅR > 5 & ÅRHUNDRE < 5      )           !              00007630
                  (ALDER_PERSON_ÅM(I)  = 6701   &                       00007640
                   AUTODATO_ÅM         > 9101   &                       00007650
                  ÅR > 5 & ÅRHUNDRE < 5      )           !              00007660
                 (ALDER_PERSON_ÅM(I) >= 6700    &                       00007670
                  ALDER_PERSON_ÅM(I) <  7000    &                       00007680
                  AUTODATO_ÅM         = 7301)            !              00007690
                 (ALDER_PERSON_ÅM(I)  = 7000    &                       00007700
                   AUTODATO_ÅM         < 9100   &                       00007710
                   B01.STATUS.PENSJONSTYPE1(I) ^= 'A')   !              00007720
                  (ALDER_PERSON_ÅM(I)  = 7001   &                       00007730
                   AUTODATO_ÅM         > 9101   &                       00007740
                   B01.STATUS.PENSJONSTYPE1(I) ^= 'F' &                 00007750
                   B01.STATUS.PENSJONSTYPE1(I) ^= 'A')            THEN  00007760
                                                                        00007770
                 DO;                                                    00007780
                   IF B01.STATUS.PENSJONSTYPE1(I) = 'E' !               00007790
                      B01.STATUS.PENSJONSTYPE1(I) = 'J' !               00007800
                      B01.STATUS.PENSJONSTYPE1(I) = 'K' !               00007810
                      B01.STATUS.PENSJONSTYPE1(I) = 'Y' !               00007820
                      B01.STATUS.PENSJONSTYPE1(I) = 'U' THEN            00007830
                                                                        00007840
                      DO;                                               00007850
                         CALL OVERGANG_TIL_P67(FAMILIE_IND);            00007860
                         HENDELSE_IND = JA;                             00007870
                         SØKER_IND = I;                                 00007880
                         I = I + 1;                                     00007890
                      END;                                              00007900
                                                                        00007910
                   ELSE IF B01.STATUS.PENSJONSTYPE1(I) = 'F' THEN       00007920
                                                                        00007930
                      DO;                                               00007940
                         CALL FJERN_EKTEFELLE_TILLEGG(I);               00007950
                         HENDELSE_IND = JA;                             00007960
                         FAMILIE_IND = I;                               00007970
                         I = I + 1;                                     00007980
                      END;                                              00007990
                                                                        00008000
                 END;    /** IF ALDER_PERSON_ÅM(I) = 6700 **/           00008010
                                                                        00008020
                                                                        00008030
         ELSE IF (ALDER_PERSON_ÅM(I) = 1800    &                        00008040
                  AUTODATO_ÅM        < 9100    &                        00008050
                 B01.PENSJONSTYPE1(I) = 'Y'    )        !               00008060
                 (ALDER_PERSON_ÅM(I) = 1801    &                        00008070
                  AUTODATO_ÅM        > 9101    &                        00008080
                 B01.PENSJONSTYPE1(I) = 'Y'    ) THEN                   00008090
                 CALL YRKESSKADE_ELEV(ETT_POENG);                       00008100
                                                                        00008110
         ELSE IF (ALDER_PERSON_ÅM(I) = 1900    &                        00008120
                  AUTODATO_ÅM        < 9100    &                        00008130
                 B01.PENSJONSTYPE1(I) = 'Y'    )     !                  00008140
                 (ALDER_PERSON_ÅM(I) = 1901    &                        00008150
                  AUTODATO_ÅM        > 9101    &                        00008160
                 B01.PENSJONSTYPE1(I) = 'Y'    ) THEN                   00008170
                 CALL YRKESSKADE_ELEV(ETT_KOMMA_FEM_POENG);             00008180
                                                                        00008190
         ELSE IF  B02.BUP_GAR_KODE(I,1) = 'A'     &                     00008200
 /*24.10.89*/     (B02.PENSJONSTYPE1(I) = 'U' !                         00008210
 /* HL */          B02.PENSJONSTYPE1(I) = 'Y')      THEN                00008220
              CALL UNG_UFØR;                                            00008230
                                                                        00008240
 /*YRKESSKADET ELEV SOM FYLLER 20 ÅR BLIR BEHANDLET I FORBINDELSE */    00008250
 /*MED BEHANDLING AV UNGE UFØRE BARE NÅR UFG >= 50                */    00008260
                                                                        00008270
         ELSE IF (ALDER_PERSON_ÅM(I) = 2000    &                        00008280
                  AUTODATO_ÅM        < 9100    &                        00008290
                 B01.PENSJONSTYPE1(I) = 'Y'    )   !                    00008300
                 (ALDER_PERSON_ÅM(I) = 2001    &                        00008310
                  AUTODATO_ÅM        > 9101    &                        00008320
                 B01.PENSJONSTYPE1(I) = 'Y'    ) THEN                   00008330
                 CALL YRKESSKADE_ELEV(TO_POENG);                        00008340
                                                                        00008350
 /*TILLEGG 2.3.89 HL */                                                 00008360
                                                                        00008370
         ELSE IF AUTODATO_ÅM          = 8904        &                   00008380
                 ALDER_PERSON_ÅM(I)  >= 6000        &                   00008390
                 B01.PENSJONSTYPE1(I) = 'F'        THEN                 00008400
                 DO;                                                    00008410
                    CALL FORSØRGET_EK_BLIR_60ÅR(I);                     00008420
                    HENDELSE_IND = JA;                                  00008430
                    FAMILIE_IND = I;                                    00008440
                    I = I + 1;                                          00008450
                 END;                                                   00008460
                                                                        00008470
         ELSE IF (AUTODATO_ÅM          > 8904       &                   00008480
                  ALDER_PERSON_ÅM(I)   = 6000   &                       00008490
                  AUTODATO_ÅM          < 9100   &                       00008500
                  B01.PENSJONSTYPE1(I) = 'F'     )    !                 00008510
                 (AUTODATO_ÅM          > 9101       &                   00008520
                  ALDER_PERSON_ÅM(I)   = 6001   &                       00008530
                  B01.PENSJONSTYPE1(I) = 'F'     )  THEN                00008540
                       DO;                                              00008550
                          CALL FORSØRGET_EK_BLIR_60ÅR(I);               00008560
                          HENDELSE_IND = JA;                            00008570
                          FAMILIE_IND = I;                              00008580
                          I = I + 1;                                    00008590
                       END;                                             00008600
                                                                        00008610
  /*HIT 2.3.89 HL */                                                    00008620
                                                                        00008630
  /*TILLEGG 18.9.89 HL */                                               00008640
         ELSE IF AUTODATO_ÅM          = 8907        &                   00008650
                B02.BUP_GAR_KODE(I,1) = 'E'        THEN                 00008660
                DO;                                                     00008670
                 B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;           00008680
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00008690
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00008700
                 TRANS_OPPL_OMR.TRANSTYPE     = 7;                      00008710
                 B02.BUP_GARANTI(I,1)         = 1.6;   /*TRUDE,10.90 */ 00008720
                 HENDELSE_IND = JA;                                     00008730
                 FAMILIE_IND = I;                                       00008740
                END;                                                    00008750
  /*HIT 18.9.89 HL */                                                   00008760
                                                                        00008770
  /*TILLEGG, 24.10.90  TRUDE  KAN VI BRUKE SAMME TRANSTYPE ??  */       00008780
         ELSE IF AUTODATO_ÅM          = 9101        &                   00008790
                B02.BUP_GAR_KODE(I,1) = 'E'         &                   00008800
                ÅR                    >  24         THEN                00008810
                DO;                                                     00008820
                                                                        00008830
                                                                        00008840
                   IF I  = 1 THEN                                       00008850
                      I_EK = 2;                                         00008860
                   ELSE                                                 00008870
                      I_EK = 1;                                         00008880
                                                                        00008890
                 IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                00008900
                    B01.VIRK_DATO_ÅM     (I_EK) > 0    THEN             00008910
                    DO;                                                 00008920
                       B02.VIRK_DATO_ÅM     (I_EK) = AUTODATO_ÅM;       00008930
                       IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN         00008940
                          CALL BARN_18ÅR(I_EK);                         00008950
                    END;                                                00008960
                 B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;           00008970
 /*HL*/          DO UF_IND = 1 TO SISTE_UTFYLLTE_BUP_GAR_KODE;          00008980
                    B02.BUP_GARANTI(I,UF_IND)    = 2;                   00008990
                 END;                                                   00009000
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00009010
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00009020
                 TRANS_OPPL_OMR.TRANSTYPE     = 7;                      00009030
                 HENDELSE_IND = JA;                                     00009040
                 FAMILIE_IND = I;                                       00009050
                 IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                  00009060
                    CALL BARN_18ÅR(I);                                  00009070
                                                                        00009080
                END;                                                    00009090
   /*TIL HIT, TRUDE  */                                                 00009100
                                                                        00009110
  /*TILLEGG, 20.01.92  TRUDE  KAN VI BRUKE SAMME TRANSTYPE ??  */       00009120
         ELSE IF AUTODATO_ÅM          = 9201        &                   00009130
                B02.BUP_GAR_KODE(I,1) = 'E'         &                   00009140
                ÅR                    >  25         THEN                00009150
                DO;                                                     00009160
                                                                        00009170
                   IF I  = 1 THEN                                       00009180
                      I_EK = 2;                                         00009190
                   ELSE                                                 00009200
                      I_EK = 1;                                         00009210
                                                                        00009220
                 IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                00009230
                    B01.VIRK_DATO_ÅM     (I_EK) > 0    THEN             00009240
                    DO;                                                 00009250
                       B02.VIRK_DATO_ÅM     (I_EK) = AUTODATO_ÅM;       00009260
                       IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN         00009270
                          CALL BARN_18ÅR(I_EK);                         00009280
                    END;                                                00009290
                 B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;           00009300
 /*HL*/          DO UF_IND = 1 TO SISTE_UTFYLLTE_BUP_GAR_KODE;          00009310
                    B02.BUP_GARANTI(I,UF_IND)    = 2.5;                 00009320
                 END;                                                   00009330
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00009340
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00009350
                 IF TRANS_OPPL_OMR.TRANSTYPE     = 27      THEN         00009360
                    DO;                                                 00009370
                       SØKER_IND = I;                                   00009380
                       EKTEF_IND = 3 - I;                               00009390
                    END;                                                00009400
                 ELSE                                                   00009410
                    FAMILIE_IND = I;                                    00009420
                 HENDELSE_IND = JA;                                     00009430
                 TRANS_OPPL_OMR.TRANSTYPE     = 7;                      00009440
                 IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                  00009450
                    CALL BARN_18ÅR(I);                                  00009460
                                                                        00009470
                END;                                                    00009480
   /*TIL HIT, TRUDE  */                                                 00009490
   /*ØKER TIL 3 , 0592 TRUDE  */                                        00009500
   /* NB!!! MÅ TAS BORT FØR PGM SKAL BRUKES VED G-END*/                 00009510
  /*TILLEGG, 20.01.92  TRUDE  KAN VI BRUKE SAMME TRANSTYPE ??  */       00009520
  /*     ELSE IF AUTODATO_ÅM          = 9205        &      */           00009530
                                                                        00009540
   ELSE IF AUTODATO_ÅM          = 9205        THEN                      00009550
      DO;                                                               00009560
        IF B02.BUP_GAR_KODE(I,1) = 'E'         &                        00009570
           ÅR                    >  25         THEN                     00009580
          DO;                                                           00009590
             IF I  = 1 THEN                                             00009600
                I_EK = 2;                                               00009610
             ELSE                                                       00009620
                I_EK = 1;                                               00009630
                            /* DISSE ÅRSKULL KOMMER NÅ INN UNDER*/      00009640
                            /* VANLIGE UNGE UFØRE. TP_GAR_KODEN  */     00009650
                            /* BLANKES */                               00009660
             IF ÅR   = 44 !                                             00009670
                ÅR   = 43  THEN                                         00009680
                  DO;                                                   00009690
                     B02.BUP_GAR_KODE(I,1)  = 'D'; /*????*/             00009700
                     CALL UNG_UFØR;                                     00009710
                  END;  /* ???? TIL HIT TRUDE */                        00009720
                                                                        00009730
             IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                    00009740
                B01.VIRK_DATO_ÅM     (I_EK) > 0    THEN                 00009750
                DO;                                                     00009760
                   B02.VIRK_DATO_ÅM     (I_EK) = AUTODATO_ÅM;           00009770
                   IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN             00009780
                      CALL BARN_18ÅR(I_EK);                             00009790
                END;                                                    00009800
             B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;               00009810
             DO UF_IND = 1 TO SISTE_UTFYLLTE_BUP_GAR_KODE;              00009820
                B02.BUP_GARANTI(I,UF_IND)    = 3;                       00009830
             END;                                                       00009840
             TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);        00009850
             TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);    00009860
             B02.VIRK_DATO_ÅM(I)          = AUTODATO_ÅM;                00009870
             IF TRANS_OPPL_OMR.TRANSTYPE     = 27      THEN             00009880
                DO;                                                     00009890
                   SØKER_IND = I;                                       00009900
                   EKTEF_IND = 3 - I;                                   00009910
                END;                                                    00009920
             ELSE                                                       00009930
                FAMILIE_IND = I;                                        00009940
             HENDELSE_IND = JA;                                         00009950
             TRANS_OPPL_OMR.TRANSTYPE     = 7;                          00009960
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                      00009970
                CALL BARN_18ÅR(I);                                      00009980
                                                                        00009990
          END;                                                          00010000
                                                                        00010010
 /*    ELSE IF  B02.BUP_GAR_KODE(I,1)^= ' '     &                       00010020
            (B02.PENSJONSTYPE1(I) = 'U' !                               00010030
             B02.PENSJONSTYPE1(I) = 'Y')      THEN                      00010040
             CALL UNG_UFØR;                                  */         00010050
       ELSE                                                             00010060
          DO;                                                           00010070
             DO J = 1 TO 13 WHILE (B01.TILKN.FNR_TILKN(I,J) > 0);       00010080
                 IF B01.TILKN.TILKNYTNINGSKODE(I,J) = 'V'     THEN      00010090
                    DO;                                                 00010100
                       HENDELSE_IND= JA;                                00010110
                       TRANS_OPPL_OMR.TRANSTYPE     = 99;               00010120
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00010130
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00010140
                       CALL BARN_18ÅR(I);                               00010150
                       SØKER_IND = I;                                   00010160
                       B02.VIRK_DATO_ÅM(I)       = AUTODATO_ÅM;         00010170
                    END;                                                00010180
             END;                                                       00010190
          END;                                                          00010200
    END;                                                                00010210
  /*TILLEGG 4.12.89  OG 9.1.90  HL*/                                    00010220
         ELSE IF AUTODATO_ÅM          = 9001        &                   00010230
               (B02.PENSJONSTYPE1(I)  = 'E'    !                        00010240
 /**/           B02.PENSJONSTYPE1(I)  = 'J'    !                        00010250
                B02.PENSJONSTYPE2(I)  = 'E'     )   &                   00010260
 /**/           B02.FORVENTET    (I)  > 160       &                     00010270
 /**/           B02.FORVENTET    (I)  < 1443      &                     00010280
 /* 1 */           ((B02.TP_BRUTTO(I) + B02.UFØRPENS.TP(I)              00010290
                     + B02.YRKEPENS.TP(I) < 1553)     !                 00010300
 /* 2 */            (B02.ETTEPENS.ST(I) + B02.UFØRPENS.ST(I) > 0 ))     00010310
                           THEN                                         00010320
                                                                        00010330
 /*8.2.HL : I TIDEN 4.12.89 - 9.1.90 STO BARE TEST NR 1 I PROGRAMMET */ 00010340
 /*         I TIDEN 9.1.90  - 8.2.90 STO BARE TEST NR 2 I PROGRAMMET */ 00010350
                                                                        00010360
                DO;                                                     00010370
                 B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;           00010380
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00010390
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00010400
                 TRANS_OPPL_OMR.TRANSTYPE     = 11;                     00010410
                 HENDELSE_IND = JA;                                     00010420
                 FAMILIE_IND = I;                                       00010430
                 I = I + 1;                                             00010440
                END;                                                    00010450
  /*HIT 4.12.89 HL */                                                   00010460
                                                                        00010470
         ELSE IF  B02.BUP_GAR_KODE(I,1)^= ' '     &                     00010480
 /*24.10.89*/     (B02.PENSJONSTYPE1(I) = 'U' !                         00010490
 /* HL */          B02.PENSJONSTYPE1(I) = 'Y')      THEN                00010500
              CALL UNG_UFØR;                                            00010510
                                                                        00010520
 /*  OPPHØR  AV OVERGANGSSTØNAD     */                                  00010530
                                                                        00010540
         ELSE                                                           00010550
           IF B02.FRAMLEGGSDATO_ÅM (I) = AUTODATO_ÅM &                  00010560
              B02.FRAMLEGGSKODE    (I) = 'O' THEN                       00010570
                                                                        00010580
              DO;                                                       00010590
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);    00010600
                 TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);00010610
                 B02.STATUS.VIRK_DATO_ÅM   (I)    = AUTODATO_ÅM;        00010620
   /* BRUKES */    HJ_VIRK_DATO_ÅM  = B02.FRAMLEGGSDATO_ÅM (I);         00010630
   /* I 9938 */    SØKER_IND = I;                                       00010640
                 CALL ETTERLATTEPENSJON_OPPHØRER;  /* R0019938 */       00010650
                 HENDELSE_IND = JA;                                     00010660
                 I = I + 1;                                             00010670
              END;                                                      00010680
                                                                        00010690
       END;                                                             00010700
     I = I + 1;                                                         00010710
   END;      /**  DO WHILE (I < 3)   **/                                00010720
                                                                        00010730
   IF HENDELSE_IND = NEI !                                              00010740
      TRANS_OPPL_OMR.TRANSTYPE = 27     THEN  /*TS*/                    00010750
                                                                        00010760
     DO;   /** DERSOM DER ER HENDELSER PÅ FORELDRE, SÅ BLIR BARNA **/   00010770
           /** GJENNOMGÅTT I DEN FORBINDELSE                      **/   00010780
       I = 3;                                                           00010790
           /** VI UNDERSØKER NÅ OM PERSONEN PÅ BARNEPLASS FYLLER ÅR  **/00010800
                                                                        00010810
 /*6.3.90 HL : '& FINNES SØKER */                                       00010820
                                                                        00010830
       IF FINNES_SØKER_TIL_DØD                  THEN                    00010840
 /*       IF FINNES_SØKER                       THEN   */               00010850
             HENDELSE_IND = JA;                                         00010860
                                                                        00010870
                                                                        00010880
       DO WHILE (I < MAX_BARN);                                         00010890
                                                                        00010900
         IF B01.STATUS.VIRK_DATO_ÅM    (I) > 0 &                        00010910
            B01.STATUS.STATUS_KODE_HIST(I) = ' ' THEN                   00010920
           DO;                                                          00010930
                                                                        00010940
             /** FINNE SISTE UTFYLLTE BUP_GAR_KODE  **/                 00010950
                                                                        00010960
             DO J = 5 TO 1 BY -1 UNTIL(B01.UFØRHIST.BUP_GAR_KODE        00010970
                                          (I,J) ^= ' ');                00010980
               SISTE_UTFYLLTE_BUP_GAR_KODE = J;                         00010990
             END;                                                       00011000
                                                                        00011010
 /* ENDRET 21.10.85 HL - DET HAR STÅTT '2000' NEDENFOR, FEILRAPP 259*/  00011020
                                                                        00011030
             IF ALDER_PERSON_ÅM(I) = 2001 THEN  /** 20 ÅR FORRIGE MD*/  00011040
               DO;                                                      00011050
                 IF B01.STATUS.PENSJONSTYPE1(I) = 'B'   &               00011060
                    B01.STATUS.DØD_AV_YRKESSKADE (I) ^= 'E'  THEN       00011070
                                                                        00011080
                   DO;                                                  00011090
                     CALL FJERN_BARNEPENSJON(I,FAMILIE_IND);            00011100
                     HENDELSE_IND = JA;                                 00011110
                                                                        00011120
                     IF B01.UFØRHIST.BUP_GAR_KODE(I,                    00011130
                        SISTE_UTFYLLTE_BUP_GAR_KODE)= 'A' THEN          00011140
                                                                        00011150
                        B02.UFØRHIST.BUP_GAR_KODE(I,                    00011160
                        SISTE_UTFYLLTE_BUP_GAR_KODE)= 'B';              00011170
                                                                        00011180
 /* ENDRET 16.2.88 HL- BUP_GARANTI ØKER TIL 3.00 FRA 1.5.88 */          00011190
 /* ENDRET 13.5.91 TS- BUP_GARANTI ØKER TIL 3.30 FRA 1.5.91 */          00011200
                                                                        00011210
                                                                        00011220
                     IF B01.UFØRHIST.BUP_GARANTI(I,                     00011230
                        SISTE_UTFYLLTE_BUP_GAR_KODE) > 0    THEN        00011240
                                                                        00011250
                        IF AUTODATO_ÅM > 8804               THEN        00011260
  /*TRUDE*/                IF AUTODATO_ÅM < 9105     THEN               00011270
                                                                        00011280
                             B02.UFØRHIST.BUP_GARANTI(I,                00011290
                             SISTE_UTFYLLTE_BUP_GAR_KODE)= 3.00;        00011300
                           ELSE                                         00011310
  /*TRUDE*/                                                             00011320
                             B02.UFØRHIST.BUP_GARANTI(I,                00011330
                               SISTE_UTFYLLTE_BUP_GAR_KODE)= 3.30;      00011340
                        ELSE                                            00011350
                                                                        00011360
                           IF AUTODATO_ÅM > 8704            THEN        00011370
                                                                        00011380
                              B02.UFØRHIST.BUP_GARANTI(I,               00011390
                              SISTE_UTFYLLTE_BUP_GAR_KODE)= 2.50;       00011400
                                                                        00011410
                   END;                                                 00011420
                                                                        00011430
               END;                                                     00011440
                                                                        00011450
             ELSE IF ALDER_PERSON_ÅM(I) = 1801 THEN/**18 ÅR FORR. MND**/00011460
               DO;                                                      00011470
                 IF B01.STATUS.PENSJONSTYPE1(I) = 'N'   &               00011480
                    B01.STATUS.DØD_AV_YRKESSKADE (I) ^= 'E'  THEN       00011490
                                                                        00011500
                   DO;                                                  00011510
                     CALL FJERN_BARNEPENSJON(I,FAMILIE_IND);            00011520
                     HENDELSE_IND = JA;                                 00011530
                   END;                                                 00011540
                                                                        00011550
                 ELSE IF B01.STATUS.PENSJONSTYPE1(I) = 'L' THEN         00011560
                   DO;                                                  00011570
                     CALL FJERN_BARNETILLEGG(I,SØKER_IND,               00011580
                                                   FAMILIE_IND);        00011590
                     HENDELSE_IND = JA;                                 00011600
                     I = MAX_BARN;  /** VI FINNER ALLE BARNA I   **/    00011610
                                        /** BARN_18_ÅR               **/00011620
                   END;                                                 00011630
                                                                        00011640
               END;   /** ELSE IF ALDER_PERSON_ÅM(I) = 1801  **/        00011650
                                                                        00011660
                                                                        00011670
             ELSE IF ALDER_PERSON_ÅM(I) = 2101  &  /**21 ÅR FORR. MND**/00011680
                    (B01.PENSJONSTYPE1(I) = 'N' !                       00011690
                     B01.PENSJONSTYPE1(I) = 'B') THEN                   00011700
                                                                        00011710
         /*VI FORUTSETTER DA AT DETTE ER EN YRKESSKADESAK */            00011720
                                                                        00011730
                DO;                                                     00011740
                   CALL FJERN_BARNEPENSJON(I,FAMILIE_IND);              00011750
                   HENDELSE_IND = JA;                                   00011760
                END;                                                    00011770
                                                                        00011780
           END;        /** IF VIRK_DATO_ÅM > 0 &    **/                 00011790
                                                                        00011800
         I = I + 1;                                                     00011810
                                                                        00011820
       END;  /** DO WHILE (I < MAX_BARN)  **/                           00011830
                                                                        00011840
       IF TRANS_OPPL_OMR.TRANSTYPE = 0 &  /*DET ER IKKE LAGET TRANS*/   00011850
          SATSENDRING_DENNE_MÅNED    THEN                               00011860
           DO;                                                          00011870
             CALL SATSENDRING;                                          00011880
                                                                        00011890
             IF TRANS_OPPL_OMR.TRANSTYPE ^= 0 THEN                      00011900
                HENDELSE_IND = JA;                                      00011910
           END;                                                         00011920
                                                                        00011930
     END;    /** DO FOR IF HENDELSE_IND = NEI  **/                      00011940
                                                                        00011950
                                                                        00011960
 FINNES_SØKER: PROC RETURNS (BIT(1));                                   00011970
                                                                        00011980
       DCL RETUR BIT (1) INIT('0'B);                                    00011990
                                                                        00012000
 /*ENDRET 6.3.90 HL : AVDØD_IND ISTEDET FOR 'I' */                      00012010
                                                                        00012020
       IF AVDØD_IND = 1                         &                       00012030
          B01.STATUS.VIRK_DATO_ÅM     (2) >  0  &                       00012040
          B01.STATUS.STATUS_KODE_HIST (2) = ' ' THEN                    00012050
          DO;                                                           00012060
             SØKER_IND = 2;                                             00012070
             RETUR     = '1'B;                                          00012080
             B02.STATUS.VIRK_DATO_ÅM     (2) = AUTODATO_ÅM;             00012090
             CALL SETT_VIRKDATO_BARN;                                   00012100
          END;                                                          00012110
       ELSE IF                                                          00012120
          B01.STATUS.VIRK_DATO_ÅM     (1) >  0  &                       00012130
          B01.STATUS.STATUS_KODE_HIST (1) = ' ' THEN                    00012140
          DO;                                                           00012150
             SØKER_IND = 1;                                             00012160
             RETUR     = '1'B;                                          00012170
             B02.STATUS.VIRK_DATO_ÅM     (1) = AUTODATO_ÅM;             00012180
             CALL SETT_VIRKDATO_BARN;                                   00012190
          END;                                                          00012200
                                                                        00012210
       IF                                                               00012220
          B01.STATUS.VIRK_DATO_ÅM     (3) >  0  &                       00012230
          B01.STATUS.STATUS_KODE_HIST (3) = ' ' &                       00012240
          B01.STATUS.PENSJONSTYPE1    (3) = 'B' THEN                    00012250
          DO;                                                           00012260
             SØKER_IND = 3;                                             00012270
             RETUR     = '1'B;                                          00012280
             CALL SETT_VIRKDATO_BARN;                                   00012290
          END;                                                          00012300
                                                                        00012310
       RETURN (RETUR);                                                  00012320
                                                                        00012330
       SETT_VIRKDATO_BARN: PROC;                                        00012340
                                                                        00012350
          DO J = 3 TO 14 ;                                              00012360
            IF                                                          00012370
              B01.STATUS.VIRK_DATO_ÅM     (J) >  0  &                   00012380
              B01.STATUS.STATUS_KODE_HIST (J) = ' ' THEN                00012390
                                                                        00012400
                 B02.STATUS.VIRK_DATO_ÅM     (J) = AUTODATO_ÅM;         00012410
          END;                                                          00012420
                                                                        00012430
       END SETT_VIRKDATO_BARN;                                          00012440
                                                                        00012450
     END FINNES_SØKER;                                                  00012460
                                                                        00012470
                                                                        00012480
 END AUTO_ONLINE;                                                       00012490
                                                                        00012500
                                                                        00012510
 REGN_ALDER_FOR_FAMILIE:                                                00012520
   PROC;                                                                00012530
                                                                        00012540
   DO J = 1 TO 14;                                                      00012550
     IF B01.STATUS.VIRK_DATO_ÅM(J) > 0 &                                00012560
        B01.RF0PERSN.FNR       (J) > 0 THEN                             00012570
       DO;                                                              00012580
         PIC11 = B01.RF0PERSN.FNR(J);                                   00012590
         FIXED_DEC5         = F_ALDER(PIC11,F_SNU_DATO(AUTODATO_ÅM));   00012600
         ALDER_PERSON_ÅM(J) = FIXED_DEC5;                               00012610
         MAX_BARN = J + 1;                                              00012620
       END;                                                             00012630
    END;      /**   DO J = 1 TO 14   **/                                00012640
                                                                        00012650
    IF MAX_BARN < 3 THEN                                                00012660
      MAX_BARN = 3;                /**   D.V.S INGEN BARN   **/         00012670
                                                                        00012680
 END REGN_ALDER_FOR_FAMILIE;                                            00012690
                                                                        00012700
                                                                        00012710
 ADDER_EN_MND_TIL_ALDER_FAMILIE:                                        00012720
   PROC;                                                                00012730
                                                                        00012740
   DO J = 1 TO 14;                                                      00012750
     IF B01.STATUS.VIRK_DATO_ÅM(J) > 0 &                                00012760
        B01.RF0PERSN.FNR       (J) > 0 THEN                             00012770
       DO;                                                              00012780
         ALDER_PERSON_ÅM(J) = ALDER_PERSON_ÅM(J) + 1;                   00012790
         IF ALDER_PERSON_ÅM(J) < 0 & ALDER_PERSON.MN(J) = 99 THEN       00012800
           ALDER_PERSON.MN(J) = 11;                                     00012810
         ELSE IF ALDER_PERSON.MN(J) = 12 THEN                           00012820
           DO;                                                          00012830
             ALDER_PERSON.MN(J) = 0;                                    00012840
             ALDER_PERSON.ÅR(J) = ALDER_PERSON.ÅR(J) + 1;               00012850
           END;                                                         00012860
       END;                                                             00012870
    END;      /**   DO J = 1 TO 14   **/                                00012880
                                                                        00012890
                                                                        00012900
 END ADDER_EN_MND_TIL_ALDER_FAMILIE;                                    00012910
                                                                        00012920
                                                                        00012930
 P67_TIL_P70:                                                           00012940
   PROC(I_EK);                                                          00012950
                                                                        00012960
   DCL                                                                  00012970
     I_EK       FIXED BIN(15),                                          00012980
     SISTE_UFT  FIXED BIN(15),                                          00012990
            SISTE_YUFT FIXED BIN(15);                                   00013000
                                                                        00013010
     IF I  = 1 THEN                                                     00013020
       I_EK = 2;                                                        00013030
     ELSE                                                               00013040
       I_EK = 1;                                                        00013050
                                                                        00013060
     B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;                       00013070
     B02.FAI                   (I) = 0;                                 00013080
     B02.FAI_DATO_ÅM           (I) = 0;                                 00013090
     B02.P67_KODE              (I) = ' ';                               00013100
     IF B01.ALDERSP.KONV_P_KODE(I) = 'F' THEN                           00013110
        B02.ALDERSP.KONV_P_KODE(I) = ' ';                               00013120
                                                                        00013130
        IF B01.STATUS.STATUS_KODE_HIST(I_EK) = ' ' THEN                 00013140
           CALL ER_EKTEFELLE_67_70 (I_EK);                              00013150
                                                                        00013160
                                                                        00013170
     /**  EGNE FORSØRGEDE BARN  **/                                     00013180
                                                                        00013190
     IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                              00013200
        CALL BARN_18ÅR(I);                                              00013210
                                                                        00013220
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                00013230
     TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);            00013240
     TRANS_OPPL_OMR.TRANSTYPE     = 26;                                 00013250
                                                                        00013260
 END P67_TIL_P70;                                                       00013270
                                                                        00013280
                                                                        00013290
 OVERGANG_TIL_P67:                                                      00013300
   PROC(I_EK);                                                          00013310
                                                                        00013320
   DCL                                                                  00013330
     I_EK        FIXED BIN(15),                                         00013340
     SISTE_UFT   FIXED BIN(15),                                         00013350
     SISTE_YUFT  FIXED BIN(15);                                         00013360
                                                                        00013370
     IF I  = 1 THEN                                                     00013380
       I_EK = 2;                                                        00013390
     ELSE                                                               00013400
       I_EK = 1;                                                        00013410
                                                                        00013420
     TRANS_OPPL_OMR.FØDSNUMMER     = B02.RF0PERSN.FNR(I);               00013430
     TRANS_OPPL_OMR.VIRKNINGSDATO  = F_SNU_DATO(AUTODATO_ÅM);           00013440
     B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;                       00013450
     IF B02.UFØRPENS.VILKÅR_8_4_3A(I) = 'J'           THEN              00013460
        B02.STATUS.VILKÅR_8_4_3A(I)   = 'J';                            00013470
                                                                        00013480
 /*NY LOV 1.1.91 : HL : */                                              00013490
                                                                        00013500
     IF B02.TT_16_66(I) > 0             THEN                            00013510
        B02.TT_16_66(I) = B02.TT_16_66(I) + B02.TT_FRAMT(I);            00013520
     ELSE                                                               00013530
        B02.TT_ETTER_1966(I) = B02.TT_ETTER_1966(I) + B02.TT_FRAMT(I);  00013540
                                                                        00013550
     B02.TT_FRAMT     (I) = 0;                                          00013560
                                                                        00013570
     IF SATSENDRING_DENNE_MÅNED = JA          &                         00013580
        B01.GT_TILLEGG_LOV92(I) = 0          THEN                       00013590
        FIXED_DEC5 = B01.FORVENTET (I) * G_NÅ/G_FØR;                    00013600
     ELSE                                                               00013610
        FIXED_DEC5 = B01.FORVENTET (I);                                 00013620
                                                                        00013630
     IF B01.STATUS.PENSJONSTYPE1(I) = 'E' THEN                          00013640
       DO;                                                              00013650
         B02.STATUS.PENSJONSTYPE1(I)  = 'A';                            00013660
         B02.ALDERSP.KONV_P_KODE (I)  = 'E';                            00013670
         B02.ETTEPENS.GP_BRUTTO  (I) = 0;                               00013680
         B02.ETTEPENS.GP_NETTO   (I) = 0;                               00013690
         B02.ETTEPENS.ST         (I) = 0;                               00013700
         B02.ETTEPENS.KT         (I) = 0;                               00013710
         B02.ETTEPENS.TP_BRUTTO  (I) = 0;                               00013720
         B02.ETTEPENS.TP_NETTO   (I) = 0;                               00013730
         B02.ETTEPENS.FORVENTET  (I) = 0;                               00013740
         B02.TILKN.TILKNYTNINGSKODE(I_EK,1) = 'A';                      00013750
                                                                        00013760
         IF B01.STATUS.PENSJONSTYPE2(I) = 'O' THEN                      00013770
           DO;                              /**  OVERGANGSTØNAD     **/ 00013780
             TRANS_OPPL_OMR.TRANSTYPE = 69; /**  IKKE KONVERTERING  **/ 00013790
             B02.STATUS.PENSJONSTYPE2(I)  = 'P';                        00013800
             B02.STATUS.SUM_YTELSE   (I)  = 0;                          00013810
           END;                                                         00013820
         ELSE                                                           00013830
           DO;                                                          00013840
             TRANS_OPPL_OMR.TRANSTYPE = 25; /* FRA EP TIL P67 */        00013850
             B02.STATUS.PENSJONSTYPE2(I)  = 'E';                        00013860
                                                                        00013870
             IF AUTODATO_ÅM > 8403                         THEN         00013880
                /* LOVENDRING: FORVENTET I EP KAN NYTTES SOM FAI */     00013890
                DO;                                                     00013900
                   B02.FAI  (I)                 = FIXED_DEC5;           00013910
                   B02.FAI_DATO_ÅM (I)          = AUTODATO_ÅM;          00013920
                END;                                                    00013930
                                                                        00013940
           END;                                                         00013950
                                                                        00013960
                                                                        00013970
       END;   /**  IF B01.STATUS.PENSJONSTYPE1(I) = 'E' **/             00013980
                                                                        00013990
     ELSE IF B01.STATUS.PENSJONSTYPE1(I) = 'J' THEN                     00014000
       DO;                                                              00014010
                                                                        00014020
         IF B01.STATUS.PENSJONSTYPE2(I) = 'P' THEN                      00014030
                                                                        00014040
             IF AUTODATO_ÅM > 8403                         THEN         00014050
                                                                        00014060
                DO;                                                     00014070
                   B02.FAI  (I)                 = FIXED_DEC5;           00014080
                   B02.FAI_DATO_ÅM (I)          = AUTODATO_ÅM;          00014090
                END;                                                    00014100
                                                                        00014110
         TRANS_OPPL_OMR.TRANSTYPE = 33;  /* FRA 'J' TIL P67 */          00014120
         B02.STATUS.PENSJONSTYPE1(I)  = 'A';                            00014130
         B02.STATUS.PENSJONSTYPE2(I)  = 'P';                            00014140
         B02.ALDERSP.KONV_P_KODE (I)  = 'J';                            00014150
         B02.ETTEPENS.GP_BRUTTO  (I) = 0;                               00014160
         B02.ETTEPENS.GP_NETTO   (I) = 0;                               00014170
         B02.ETTEPENS.ST         (I) = 0;                               00014180
         B02.ETTEPENS.KT         (I) = 0;                               00014190
         B02.ETTEPENS.TP_BRUTTO  (I) = 0;                               00014200
         B02.ETTEPENS.TP_NETTO   (I) = 0;                               00014210
         B02.ETTEPENS.FORVENTET  (I) = 0;                               00014220
                                                                        00014230
       END;                                                             00014240
                                                                        00014250
     ELSE          /**  TIDLIGERE UP     ELLER AFP        **/           00014260
     IF B01.PENSJONSTYPE2(I) = 'N' THEN                                 00014270
        DO;                                                             00014280
           CALL AFP_NULL_OPPHØRER (I,I_EK);                             00014290
           TRANS_OPPL_OMR.TRANSTYPE = 73;                               00014300
           IF B01.PENSJONSTYPE1 (I_EK) = 'A'       !                    00014310
              B01.PENSJONSTYPE1 (I_EK) = 'K'       !                    00014320
              B01.PENSJONSTYPE1 (I_EK) = 'U'      THEN                  00014330
                 CALL ER_EKTEFELLE_67_70 (I_EK);                        00014340
        END;                                                            00014350
     ELSE                                                               00014360
       DO;                                                              00014370
         IF B01.PENSJONSTYPE1(I) = 'U'    !                             00014380
            B01.PENSJONSTYPE1(I) = 'Y'           THEN                   00014390
           DO;                                                          00014400
                                                                        00014410
             IF AUTODATO_ÅM > 9201           &                          00014420
                B02.PENSJONSTYPE2(I) ^= 'E'  &                          00014430
                B02.UFØRPENS.UFG (I)  < 100     THEN                    00014440
                                                                        00014450
                DO;                                                     00014460
                   B02.P67_KODE(I)    = '5';                            00014470
                   B02.SUM_YTELSE(I)  = 0;                              00014480
                   TRANS_OPPL_OMR.TRANSTYPE = 74;  /* NULLPENSJON */    00014490
                END;                                                    00014500
             ELSE                                                       00014510
          DO;                                                           00014520
             TRANS_OPPL_OMR.TRANSTYPE = 24;  /* FRA UP TIL P67 */       00014530
                                                                        00014540
             IF B01.UFØRPENS.SPT_1291(I) > 0       &                    00014550
                AUTODATO_ÅM > 9300                THEN                  00014560
                DO;                                                     00014570
                   B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I);  00014580
                   B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I);  00014590
                   B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I);  00014600
                END;                                                    00014610
                                                                        00014620
      /*     ELSE                                                       00014630
             IF AUTODATO_ÅM > 9200                THEN                  00014640
                DO;                                                     00014650
                  B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT(I);        00014660
                  B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT(I);        00014670
                  B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ (I);        00014680
                END;                                                    00014690
                                                                        00014700
      */                                                                00014710
                                                                        00014720
         END;                                                           00014730
         B02.STATUS.VILKÅR_8_4_3A(I) = B02.UFØRPENS.VILKÅR_8_4_3A(I);   00014740
         B02.UFØRPENS            (I) = '';                              00014750
         SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                             00014760
         B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = AUTODATO_ÅM;                 00014770
         B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                         00014780
                                                                        00014790
         IF B01.STATUS.PENSJONSTYPE2 (I) = 'E' THEN                     00014800
            DO;                                                         00014810
                                                                        00014820
               IF AUTODATO_ÅM > 8403                    THEN            00014830
                                                                        00014840
                 DO;                                                    00014850
                    B02.FAI  (I)                 = FIXED_DEC5;          00014860
                    B02.FAI_DATO_ÅM (I)          = AUTODATO_ÅM;         00014870
                 END;                                                   00014880
                                                                        00014890
 /*LINJEN NEDENFOR ER LAGT INN 21.2.89 - HL        */                   00014900
                                                                        00014910
                   B02.TILKN.TILKNYTNINGSKODE(I_EK,1) = 'A';            00014920
                                                                        00014930
               B02.ETTEPENS.FORVENTET  (I) = 0;                         00014940
               TRANS_OPPL_OMR.TRANSTYPE = 41; /* FRA UE TIL AE */       00014950
            END;                                                        00014960
        IF B01.STATUS.PENSJONSTYPE1(I) = 'Y'   THEN                     00014970
                                                                        00014980
           DO;                                                          00014990
                                                                        00015000
 /*YS  VI SKAL BEHOLDE YRKEPENS.YUG OG YPT              */              00015010
              B02.YRKEPENS.GP         (I) = 0;                          00015020
              B02.YRKEPENS.BT         (I) = 0;                          00015030
              B02.YRKEPENS.TP         (I) = 0;                          00015040
  /*HL        B02.YRKEPENS.SPT        (I) = 0         */                00015050
              B02.YRKEPENS.YPT_KODE   (I) = '';                         00015060
              SISTE_YUFT = FINNE_SISTE_YUFT_ÅM(I);                      00015070
              B02.OPPH_DATO_ÅM(I,SISTE_YUFT) = AUTODATO_ÅM;             00015080
              B02.OPPH_KODE   (I,SISTE_YUFT) = 'A';                     00015090
                                                                        00015100
           END;                                                         00015110
                                                                        00015120
       END;  /*PT1 = U/Y */                                             00015130
     ELSE    /*PT1 = K */                                               00015140
       DO;                                                              00015150
          B02.ALDERSP.VT_SPT(I) = B02.ALDERSP.SPT(I);                   00015160
          B02.ALDERSP.VT_OPT(I) = B02.ALDERSP.OPT(I);                   00015170
          B02.ALDERSP.VT_PÅ (I) = B02.ALDERSP.PÅ (I);                   00015180
          TRANS_OPPL_OMR.TRANSTYPE  = 49;/*FRA AFP TIL P67*/            00015190
       END;                                                             00015200
                                                                        00015210
 /*DET FØLGENDE GJELDER BÅDE TIDLIGERE PT1 = U/Y OG PT1 = K :  */       00015220
                                                                        00015230
         B02.STATUS.PENSJONSTYPE1(I)  = 'A';                            00015240
 /**/    B02.KONV_P_KODE(I) = B01.PENSJONSTYPE1(I);                     00015250
                                                                        00015260
 /* TILLEGG 20.8.84 HL                                      */          00015270
                                                                        00015280
         B02.STATUS.PENSJONSTYPE3(I)  = '';                             00015290
                                                                        00015300
 /* HIT    20.8.84  HL                                      */          00015310
                                                                        00015320
         IF B01.VIRK_DATO_ÅM (I_EK) > 0           THEN                  00015330
            DO;                                                         00015340
               DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);         00015350
                 IF B01.TILKN.FNR_TILKN(I_EK,J) =                       00015360
                    B01.RF0PERSN.FNR   (I         ) THEN                00015370
                      DO;                                               00015380
                        B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';       00015390
                        B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';       00015400
                        J = 13;                                         00015410
                      END;                                              00015420
               END;                                                     00015430
                                                                        00015440
 /*LINJENE NEDENFOR ER FJERNET 21.2.89 - HL- FORDI PROGRAMMENE FOR*/    00015450
 /*BEREGNING FORUTSETTER AT OPPRINNELIG VIRKDATO BEHOLDES         */    00015460
                                                                        00015470
 /*            IF B01.STATUS.PENSJONSTYPE2 (I) = 'E' THEN         */    00015480
 /*               B02.VIRK_DATO_ÅM (I_EK) = AUTODATO_ÅM           */    00015490
 /*            ELSE                                               */    00015500
                                                                        00015510
 /*8.2.89*/    IF B01.STATUS_KODE_HIST (I_EK) = ' '   THEN              00015520
 /*AFP*/          CALL ER_EKTEFELLE_67_70(I_EK);                        00015530
            END;                                                        00015540
                                                                        00015550
         IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                          00015560
           CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                       00015570
                                                                        00015580
 /**/ END;  /**   DO FOR ELSE VED TIDLIGERE UP/ATV/AFP     **/          00015590
                                                                        00015600
 END OVERGANG_TIL_P67;                                                  00015610
                                                                        00015620
                                                                        00015630
 /*AFP ************************************************** */            00015640
 /*AFP                                                    */            00015650
 /*AFP         NY PROSEDYRE :                             */            00015660
 /*AFP                                                    */            00015670
 /*AFP ************************************************** */            00015680
                                                                        00015690
 ER_EKTEFELLE_67_70 :                                                   00015700
   PROC(I_EK);                                                          00015710
                                                                        00015720
   DCL                                                                  00015730
     I_EK        FIXED BIN(15),                                         00015740
     SISTE_UFT   FIXED BIN(15),                                         00015750
     SISTE_YUFT FIXED BIN(15);                                          00015760
                                                                        00015770
       B02.STATUS.VIRK_DATO_ÅM   (I_EK) = AUTODATO_ÅM;                  00015780
                                                                        00015790
       PIC11 = B01.RF0PERSN.FNR(I_EK);                                  00015800
       IF  (ALDER_PERSON_ÅM(I_EK)  = 6700 &                             00015810
              AUTODATO_ÅM         < 9100  &                             00015820
            ÅR > 5 & ÅRHUNDRE < 5         )    !                        00015830
           (ALDER_PERSON_ÅM(I_EK)  = 6701 &                             00015840
            AUTODATO_ÅM            > 9101 &                             00015850
            ÅR > 5 & ÅRHUNDRE < 5         )    !                        00015860
           (ALDER_PERSON_ÅM(I_EK) >= 6700 &                             00015870
            ALDER_PERSON_ÅM(I_EK) <  7000 &                             00015880
            AUTODATO_ÅM         = 7301)         !                       00015890
           (ALDER_PERSON_ÅM(I_EK)  = 7000 &                             00015900
            AUTODATO_ÅM         < 9100    &                             00015910
            B01.STATUS.PENSJONSTYPE1(I_EK) ^= 'A')     !                00015920
           (ALDER_PERSON_ÅM(I_EK)  = 7001 &                             00015930
            AUTODATO_ÅM         > 9101    &                             00015940
 /*HL*/     B01.STATUS.PENSJONSTYPE1(I_EK) ^= 'F' &                     00015950
            B01.STATUS.PENSJONSTYPE1(I_EK) ^= 'A')             THEN     00015960
           IF B01.PENSJONSTYPE2(I_EK) = 'N'       THEN                  00015970
              CALL AFP_NULL_OPPHØRER (I_EK,I);                          00015980
           ELSE                                                         00015990
           DO;                                                          00016000
                                                                        00016010
               IF B02.UFØRPENS.VILKÅR_8_4_3A(I_EK) = 'J'        THEN    00016020
                  B02.STATUS.VILKÅR_8_4_3A(I_EK)   = 'J';               00016030
                                                                        00016040
               B02.ALDERSP.APD          (I_EK) = 100;                   00016050
                                                                        00016060
               IF B02.TT_16_66(I_EK) > 0        THEN                    00016070
                  B02.TT_16_66(I_EK) = B02.TT_16_66(I_EK)               00016080
                             + B02.STATUS.TT_FRAMT     (I_EK);          00016090
               ELSE                                                     00016100
                  B02.TT_ETTER_1966(I_EK)                               00016110
                             = B02.TT_ETTER_1966(I_EK)                  00016120
                             + B02.TT_FRAMT     (I_EK);                 00016130
               B02.TT_FRAMT     (I_EK) = 0;                             00016140
                                                                        00016150
                                                                        00016160
               DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I, J) > 0);           00016170
                  IF B01.TILKN.FNR_TILKN(I,J) =                         00016180
                     B01.RF0PERSN.FNR   (I_EK       ) THEN              00016190
                        DO;                                             00016200
                          B02.TILKN.TILKNYTNINGSKODE(I,J)='A';          00016210
                          B02.TILKN.FT_FØR_91       (I,J)=' ';          00016220
                          J = 13;                                       00016230
                        END;                                            00016240
               END;                                                     00016250
                                                                        00016260
               IF B01.STATUS.PENSJONSTYPE1(I_EK) = 'F' THEN             00016270
                  DO;                       /* FORSØRGET EKTEFELLE */   00016280
                    B02.STATUS.PENSJONSTYPE1(I_EK)  = 'A';              00016290
                    B02.STATUS.PENSJONSTYPE2(I_EK)  = 'S';              00016300
                    B02.RF0PERSN.TKNR       (I_EK)  =                   00016310
                                             B01.RF0PERSN.TKNR (I);     00016320
                    B02.STATUS.PENSJONSTYPE2(I) = 'S';                  00016330
                    B02.ALDERSP.KONV_P_KODE (I_EK)  = 'F';              00016340
                    B02.P67_KODE            (I_EK)  = '5';              00016350
                  END;                                                  00016360
                                                                        00016370
                ELSE IF B01.STATUS.PENSJONSTYPE1(I_EK) = 'K' THEN       00016380
                   DO;                                                  00016390
                     B02.ALDERSP.KONV_P_KODE (I_EK)  = 'K';             00016400
                     B02.STATUS.PENSJONSTYPE1(I_EK)  = 'A';             00016410
                     B02.ALDERSP.VT_SPT(I_EK) = B02.ALDERSP.SPT(I_EK);  00016420
                     B02.ALDERSP.VT_OPT(I_EK) = B02.ALDERSP.OPT(I_EK);  00016430
                     B02.ALDERSP.VT_PÅ (I_EK) = B02.ALDERSP.PÅ (I_EK);  00016440
                                                                        00016450
                 TRANS_OPPL_OMR.BLANKETTYPE  = '49';/*FRA AFP TIL P67*/ 00016460
                                                                        00016470
                                                                        00016480
                   END;                                                 00016490
                                                                        00016500
                 ELSE IF B01.STATUS.PENSJONSTYPE1(I_EK) = 'U' THEN      00016510
                   DO;                                                  00016520
 /*      B02.ALDERSP.SPT_1291(I_EK) = B01.UFØRPENS.SPT_1291(I_EK); */   00016530
 /*      B02.ALDERSP.OPT_1291(I_EK) = B01.UFØRPENS.OPT_1291(I_EK); */   00016540
 /*      B02.ALDERSP.PÅ_1291 (I_EK) = B01.UFØRPENS.PÅ_1291 (I_EK); */   00016550
                     B02.STATUS.PENSJONSTYPE1(I_EK)  = 'A';             00016560
                     B02.ALDERSP.KONV_P_KODE (I_EK)  = 'U';             00016570
                     IF B02.UFØRPENS.UFG(I_EK)      < 100     THEN      00016580
                        B02.P67_KODE (I_EK)  = '5';                     00016590
                     B02.SUM_YTELSE(I_EK)  = 0;                         00016600
                     B02.ALDERSP.UTTAKSDATO_ÅM (I_EK)= AUTODATO_ÅM;     00016610
                     B02.UFØRPENS            (I_EK)  = '';              00016620
                     TRANS_OPPL_OMR.BLANKETTYPE      = '24';/*UP=>P67*/ 00016630
                     SISTE_UFT = FINNE_SISTE_UFT_ÅM(I_EK);              00016640
                     B02.OPPHØRSDATO_ÅM(I_EK,SISTE_UFT) =AUTODATO_ÅM;   00016650
                     B02.OPPHØRSKODE   (I_EK,SISTE_UFT) = 'A';          00016660
                                                                        00016670
                     IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN           00016680
                       CALL BARNS_TILKNYTNINGSKODE_ENDRES(I_EK);        00016690
                                                                        00016700
                   END;                                                 00016710
                                                                        00016720
             ELSE IF B01.STATUS.PENSJONSTYPE1(I_EK) = 'Y' THEN          00016730
               DO;                                                      00016740
 /*      B02.ALDERSP.SPT_1291(I_EK) = B01.UFØRPENS.SPT_1291(I_EK); */   00016750
 /*      B02.ALDERSP.OPT_1291(I_EK) = B01.UFØRPENS.OPT_1291(I_EK); */   00016760
 /*      B02.ALDERSP.PÅ_1291 (I_EK) = B01.UFØRPENS.PÅ_1291 (I_EK); */   00016770
                 B02.ALDERSP.KONV_P_KODE (I_EK)  = 'Y';                 00016780
                     IF B02.UFØRPENS.UFG(I_EK)      < 100     THEN      00016790
                        B02.P67_KODE (I_EK)  = '5';                     00016800
                     B02.SUM_YTELSE(I_EK)  = 0;                         00016810
                 B02.STATUS.PENSJONSTYPE1(I_EK)  = 'A';                 00016820
                  B02.ALDERSP.UTTAKSDATO_ÅM (I_EK)= AUTODATO_ÅM;        00016830
                 SISTE_UFT = FINNE_SISTE_UFT_ÅM(I_EK);                  00016840
                 B02.OPPHØRSDATO_ÅM(I_EK,SISTE_UFT) = AUTODATO_ÅM;      00016850
                 B02.OPPHØRSKODE   (I_EK,SISTE_UFT) = 'A';              00016860
                 SISTE_YUFT = FINNE_SISTE_YUFT_ÅM(I_EK);                00016870
                 B02.OPPH_DATO_ÅM(I_EK,SISTE_YUFT) = AUTODATO_ÅM;       00016880
                 B02.OPPH_KODE   (I_EK,SISTE_YUFT) = 'A';               00016890
                 B02.UFØRPENS            (I_EK) = '';                   00016900
 /*YS  VI SKAL BEHOLDE YRKEPENS.YUG OG YPT              */              00016910
                 B02.YRKEPENS.GP         (I_EK) = 0;                    00016920
                 B02.YRKEPENS.BT         (I_EK) = 0;                    00016930
                 B02.YRKEPENS.TP         (I_EK) = 0;                    00016940
 /* HL           B02.YRKEPENS.SPT        (I_EK) = 0       */            00016950
                 B02.YRKEPENS.YPT_KODE   (I_EK) = '';                   00016960
                 TRANS_OPPL_OMR.BLANKETTYPE    = '24';/*FRA UP TIL P67*/00016970
                 IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN               00016980
                   CALL BARNS_TILKNYTNINGSKODE_ENDRES(I_EK);            00016990
                                                                        00017000
               END;                                                     00017010
                                                                        00017020
               END;  /** IF ALDER_PERSON_ÅM(I_EK) = 6700   **/          00017030
                                                                        00017040
             ELSE  /** EKTEFELLEN FYLLER IKKE 67 ÅR DENNE MÅNED  **/    00017050
                                                                        00017060
               DO;                                                      00017070
                  IF (ALDER_PERSON_ÅM(I_EK) = 7000  &                   00017080
                      AUTODATO_ÅM           < 9100 )  !                 00017090
                     (ALDER_PERSON_ÅM(I_EK) = 7001  &                   00017100
 /*HL*/              B01.STATUS.PENSJONSTYPE1(I_EK) ^= 'F' &            00017110
                      AUTODATO_ÅM           > 9101 )     THEN           00017120
                     DO;                                                00017130
                        TRANS_OPPL_OMR.BLANKETTYPE  = '26';/*P67=>P70*/ 00017140
                        IF B01.ALDERSP.KONV_P_KODE(I_EK) = 'F' THEN     00017150
                           B02.ALDERSP.KONV_P_KODE(I_EK) = ' ';         00017160
                     END;                                               00017170
                  IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN              00017180
                     CALL BARN_18ÅR(I_EK);                              00017190
                                                                        00017200
               END;                                                     00017210
                                                                        00017220
 END ER_EKTEFELLE_67_70;                                                00017230
                                                                        00017240
                                                                        00017250
 FJERN_EKTEFELLE_TILLEGG:                                               00017260
   PROC(I_EK);                                                          00017270
                                                                        00017280
   DCL                                                                  00017290
     SISTE_UFT  FIXED BIN(15),                                          00017300
     SISTE_YUFT FIXED BIN(15),                                          00017310
     I_EK       FIXED BIN(15),                                          00017320
     I          FIXED BIN(15);                                          00017330
                                                                        00017340
     IF I_EK = 1 THEN                                                   00017350
       DO;                                                              00017360
         SØKER_IND = 2;                                                 00017370
         I         = 2;                                                 00017380
       END;                                                             00017390
     ELSE                                                               00017400
       DO;                                                              00017410
         SØKER_IND = 1;                                                 00017420
         I         = 1;                                                 00017430
       END;                                                             00017440
                                                                        00017450
     B02.STATUS.VIRK_DATO_ÅM   (I)    = AUTODATO_ÅM;                    00017460
     B02.STATUS.PENSJONSTYPE2(I   )   = 'S';                            00017470
     B02.STATUS.PENSJONSTYPE2(I_EK)   = 'S';                            00017480
     B02.RF0PERSN.TKNR       (I_EK)  =                                  00017490
                              B01.RF0PERSN.TKNR (I);                    00017500
     B02.STATUS.PENSJONSTYPE1(I_EK)   = 'A';                            00017510
     B02.STATUS.VIRK_DATO_ÅM (I_EK)   =  AUTODATO_ÅM;                   00017520
     B02.ALDERSP.KONV_P_KODE (I_EK)   = 'F';                            00017530
     B02.P67_KODE            (I_EK)   = '5';                            00017540
                                                                        00017550
     DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I,J) > 0);                      00017560
       IF B01.TILKN.FNR_TILKN(I,J) =                                    00017570
          B01.RF0PERSN.FNR   (I_EK      ) THEN                          00017580
            DO;                                                         00017590
              B02.TILKN.TILKNYTNINGSKODE(I, J) = 'A';                   00017600
              B02.TILKN.FT_FØR_91       (I,J)=' ';                      00017610
              J = 13;                                                   00017620
            END;                                                        00017630
     END;                                                               00017640
                                                                        00017650
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                00017660
     TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);            00017670
     TRANS_OPPL_OMR.TRANSTYPE     = 28; /* FT UTGÅR */                  00017680
                                                                        00017690
     PIC11 = B01.RF0PERSN.FNR(I);                                       00017700
                                                                        00017710
       IF  (ALDER_PERSON_ÅM(I)  = 6700 &                                00017720
               AUTODATO_ÅM      < 9100 &                                00017730
            ÅR > 5 & ÅRHUNDRE < 5      )      !                         00017740
           (ALDER_PERSON_ÅM(I)  = 6701 &                                00017750
            AUTODATO_ÅM         > 9101 &                                00017760
            ÅR > 5 & ÅRHUNDRE < 5      )      !                         00017770
           (ALDER_PERSON_ÅM(I) >= 6700 &                                00017780
            ALDER_PERSON_ÅM(I) <  7000 &                                00017790
            AUTODATO_ÅM         = 7301)       !                         00017800
           (ALDER_PERSON_ÅM(I)  = 7000 &                                00017810
            AUTODATO_ÅM         < 9100 &                                00017820
            B01.STATUS.PENSJONSTYPE1(I) ^= 'A')     !                   00017830
           (ALDER_PERSON_ÅM(I)  = 7001 &                                00017840
            AUTODATO_ÅM         > 9101 &                                00017850
 /*HL*/     B01.STATUS.PENSJONSTYPE1(I) ^= 'F'  &                       00017860
            B01.STATUS.PENSJONSTYPE1(I) ^= 'A')             THEN        00017870
       DO;                                                              00017880
          IF B02.UFØRPENS.VILKÅR_8_4_3A(I) = 'J'        THEN            00017890
             B02.STATUS.VILKÅR_8_4_3A(I)   = 'J';                       00017900
                                                                        00017910
  /*     B02.ALDERSP.APD          (I) = 100     23.1.90 HL */           00017920
            IF B02.TT_16_66(I) > 0           THEN                       00017930
               B02.TT_16_66(I) = B02.TT_16_66(I)                        00017940
                           + B02.TT_FRAMT     (I);                      00017950
            ELSE                                                        00017960
               B02.TT_ETTER_1966(I)                                     00017970
                           = B02.TT_ETTER_1966(I)                       00017980
                           + B02.TT_FRAMT     (I);                      00017990
            B02.TT_FRAMT     (I) = 0;                                   00018000
                                                                        00018010
         IF B01.STATUS.PENSJONSTYPE1(I) = 'U' THEN                      00018020
           DO;                                                          00018030
  /*          B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I); */    00018040
  /*          B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I); */    00018050
  /*          B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I); */    00018060
             IF AUTODATO_ÅM > 9201           &                          00018070
                B02.PENSJONSTYPE2(I) ^= 'E'  &                          00018080
                B02.UFØRPENS.UFG (I)  < 100     THEN                    00018090
                                                                        00018100
                DO;                                                     00018110
                   TRANS_OPPL_OMR.TRANSTYPE = 74;  /* NULLPENSJON */    00018120
                   B02.P67_KODE(I)       = '5';                         00018130
                   B02.SUM_YTELSE(I)     = 0;                           00018140
                END;                                                    00018150
             ELSE                                                       00018160
                TRANS_OPPL_OMR.TRANSTYPE     = 24; /* FRA UP TIL P67 */ 00018170
             B02.ALDERSP.KONV_P_KODE (I)  = 'U';                        00018180
             B02.ALDERSP.UTTAKSDATO_ÅM(I) = AUTODATO_ÅM;                00018190
             B02.STATUS.PENSJONSTYPE1(I)  = 'A';                        00018200
             SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                         00018210
             B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = AUTODATO_ÅM;             00018220
             B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                     00018230
             B02.UFØRPENS            (I) = '';                          00018240
                                                                        00018250
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);           00018260
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                         00018270
                  B01.RF0PERSN.FNR   (I         ) THEN                  00018280
                    DO;                                                 00018290
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';         00018300
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';         00018310
                      J = 13;                                           00018320
                    END;                                                00018330
             END;                                                       00018340
                                                                        00018350
             /**  FORSØRGEDE BARN   **/                                 00018360
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                      00018370
               CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                   00018380
                                                                        00018390
           END;                                                         00018400
                                                                        00018410
         ELSE                                                           00018420
         IF B01.STATUS.PENSJONSTYPE1(I) = 'K' THEN                      00018430
           DO;                                                          00018440
             TRANS_OPPL_OMR.TRANSTYPE     = 49; /*FRA AFP TIL P67 */    00018450
             B02.ALDERSP.KONV_P_KODE (I)  = 'K';                        00018460
 /*HL        B02.ALDERSP.UTTAKSDATO_ÅM(I) = AUTODATO_ÅM   */            00018470
             B02.STATUS.PENSJONSTYPE1(I)  = 'A';                        00018480
              B02.ALDERSP.VT_SPT(I) = B02.ALDERSP.SPT(I);               00018490
              B02.ALDERSP.VT_OPT(I) = B02.ALDERSP.OPT(I);               00018500
              B02.ALDERSP.VT_PÅ (I) = B02.ALDERSP.PÅ (I);               00018510
                                                                        00018520
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);           00018530
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                         00018540
                  B01.RF0PERSN.FNR   (I         ) THEN                  00018550
                    DO;                                                 00018560
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';         00018570
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';         00018580
                      J = 13;                                           00018590
                    END;                                                00018600
             END;                                                       00018610
           END;                                                         00018620
                                                                        00018630
         ELSE IF B01.PENSJONSTYPE1(I) = 'Y' THEN                        00018640
          DO;                                                           00018650
             IF AUTODATO_ÅM > 9201           &                          00018660
                B02.PENSJONSTYPE2(I) ^= 'E'  &                          00018670
                B02.UFØRPENS.UFG (I)  < 100     THEN                    00018680
                                                                        00018690
                DO;                                                     00018700
                   TRANS_OPPL_OMR.TRANSTYPE = 74;  /* NULLPENSJON */    00018710
                   B02.P67_KODE(I)       = '5';                         00018720
                   B02.SUM_YTELSE(I)     = 0;                           00018730
                END;                                                    00018740
             ELSE                                                       00018750
                TRANS_OPPL_OMR.BLANKETTYPE= '24';/*FRA UP TIL P67*/     00018760
 /*         B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I); */      00018770
 /*         B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I); */      00018780
 /*         B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I); */      00018790
            B02.ALDERSP.KONV_P_KODE (I)  = 'Y';                         00018800
            B02.STATUS.PENSJONSTYPE1(I)  = 'A';                         00018810
            B02.ALDERSP.UTTAKSDATO_ÅM (I)= AUTODATO_ÅM;                 00018820
            SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                          00018830
            B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = AUTODATO_ÅM;              00018840
            B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                      00018850
            SISTE_YUFT = FINNE_SISTE_YUFT_ÅM(I);                        00018860
            B02.OPPH_DATO_ÅM(I,SISTE_YUFT) = AUTODATO_ÅM;               00018870
            B02.OPPH_KODE   (I,SISTE_YUFT) = 'A';                       00018880
            B02.UFØRPENS            (I) = '';                           00018890
 /*YS  VI SKAL BEHOLDE YRKEPENS.YUG OG YPT              */              00018900
            B02.YRKEPENS.GP         (I) = 0;                            00018910
            B02.YRKEPENS.BT         (I) = 0;                            00018920
            B02.YRKEPENS.TP         (I) = 0;                            00018930
 /*  HL     B02.YRKEPENS.SPT        (I) = 0          */                 00018940
            B02.YRKEPENS.YPT_KODE   (I) = '';                           00018950
                                                                        00018960
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);           00018970
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                         00018980
                  B01.RF0PERSN.FNR   (I         ) THEN                  00018990
                    DO;                                                 00019000
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';         00019010
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';         00019020
                      J = 13;                                           00019030
                    END;                                                00019040
             END;                                                       00019050
                                                                        00019060
             /**  FORSØRGEDE BARN   **/                                 00019070
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                      00019080
               CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                   00019090
                                                                        00019100
           END;                                                         00019110
                                                                        00019120
       END;  /** IF ALDER_PERSON_ÅM(I) = 6700   **/                     00019130
                                                                        00019140
     ELSE  /** EKTEFELLEN FYLLER IKKE 67 ÅR DENNE MÅNED  **/            00019150
       IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                            00019160
          CALL BARN_18ÅR(I);                                            00019170
                                                                        00019180
                                                                        00019190
 END FJERN_EKTEFELLE_TILLEGG;                                           00019200
                                                                        00019210
                                                                        00019220
 FORSØRGET_EK_BLIR_60ÅR :                                               00019230
   PROC(I_EK);                                                          00019240
                                                                        00019250
   DCL                                                                  00019260
     SISTE_UFT  FIXED BIN(15),                                          00019270
     SISTE_YUFT  FIXED BIN(15),                                         00019280
     I_EK       FIXED BIN(15),                                          00019290
     I          FIXED BIN(15);                                          00019300
                                                                        00019310
     IF I_EK = 1 THEN                                                   00019320
       DO;                                                              00019330
         SØKER_IND = 2;                                                 00019340
         I         = 2;                                                 00019350
       END;                                                             00019360
     ELSE                                                               00019370
       DO;                                                              00019380
         SØKER_IND = 1;                                                 00019390
         I         = 1;                                                 00019400
       END;                                                             00019410
                                                                        00019420
     B02.STATUS.VIRK_DATO_ÅM   (I)    = AUTODATO_ÅM;                    00019430
     B02.STATUS.VIRK_DATO_ÅM (I_EK)   =  AUTODATO_ÅM;                   00019440
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                00019450
     TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);            00019460
     TRANS_OPPL_OMR.TRANSTYPE     = 6;                                  00019470
                                                                        00019480
     PIC11 = B01.RF0PERSN.FNR(I);                                       00019490
                                                                        00019500
       IF  (ALDER_PERSON_ÅM(I)  = 6700 &                                00019510
               AUTODATO_ÅM      < 9100 &                                00019520
            ÅR > 5 & ÅRHUNDRE < 5      )     !                          00019530
           (ALDER_PERSON_ÅM(I)  = 6701 &                                00019540
            AUTODATO_ÅM         > 9101 &                                00019550
            ÅR > 5 & ÅRHUNDRE < 5      )     !                          00019560
           (ALDER_PERSON_ÅM(I) >= 6700 &                                00019570
            ALDER_PERSON_ÅM(I) <  7000 &                                00019580
            AUTODATO_ÅM         = 7301 )     !                          00019590
           (ALDER_PERSON_ÅM(I)  = 7000 &                                00019600
            AUTODATO_ÅM         < 9100 &                                00019610
            B01.STATUS.PENSJONSTYPE1(I) ^= 'A')      !                  00019620
           (ALDER_PERSON_ÅM(I)  = 7001 &                                00019630
            AUTODATO_ÅM         > 9101 &                                00019640
            B01.STATUS.PENSJONSTYPE1(I) ^= 'F' &                        00019650
            B01.STATUS.PENSJONSTYPE1(I) ^= 'A')             THEN        00019660
       DO;                                                              00019670
          IF B02.UFØRPENS.VILKÅR_8_4_3A(I) = 'J'        THEN            00019680
             B02.STATUS.VILKÅR_8_4_3A(I)   = 'J';                       00019690
                                                                        00019700
 /*      B02.ALDERSP.APD          (I) = 100     - 23.1.90 HL */         00019710
                                                                        00019720
 /*LOVENDRING 1.1.91 HL : */                                            00019730
                                                                        00019740
         IF B02.TT_16_66(I) > 0                 THEN                    00019750
            B02.TT_16_66(I) = B02.TT_16_66(I)                           00019760
                           + B02.TT_FRAMT     (I);                      00019770
         ELSE                                                           00019780
            B02.TT_ETTER_1966(I) = B02.TT_ETTER_1966(I)                 00019790
                           + B02.TT_FRAMT     (I);                      00019800
         B02.TT_FRAMT     (I) = 0;                                      00019810
                                                                        00019820
         IF B01.STATUS.PENSJONSTYPE1(I) = 'U' THEN                      00019830
           DO;                                                          00019840
             IF AUTODATO_ÅM > 9201           &                          00019850
                B02.PENSJONSTYPE2(I) ^= 'E'  &                          00019860
                B02.UFØRPENS.UFG (I)  < 100     THEN                    00019870
                                                                        00019880
                DO;                                                     00019890
                   B02.P67_KODE(I)      = '5';                          00019900
                   B02.SUM_YTELSE(I)     = 0;                           00019910
                   TRANS_OPPL_OMR.TRANSTYPE = 74;  /* NULLPENSJON */    00019920
                END;                                                    00019930
             ELSE                                                       00019940
                TRANS_OPPL_OMR.TRANSTYPE     = 24; /* FRA UP TIL P67 */ 00019950
 /*          B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I); */     00019960
 /*          B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I); */     00019970
 /*          B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I); */     00019980
             B02.ALDERSP.KONV_P_KODE (I)  = 'U';                        00019990
             B02.ALDERSP.UTTAKSDATO_ÅM(I) = AUTODATO_ÅM;                00020000
             B02.STATUS.PENSJONSTYPE1(I)  = 'A';                        00020010
             SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                         00020020
             B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = AUTODATO_ÅM;             00020030
             B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                     00020040
             B02.UFØRPENS            (I) = '';                          00020050
                                                                        00020060
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);           00020070
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                         00020080
                  B01.RF0PERSN.FNR   (I         ) THEN                  00020090
                    DO;                                                 00020100
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';         00020110
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';         00020120
                      J = 13;                                           00020130
                    END;                                                00020140
             END;                                                       00020150
                                                                        00020160
             /**  FORSØRGEDE BARN   **/                                 00020170
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                      00020180
               CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                   00020190
                                                                        00020200
           END;                                                         00020210
                                                                        00020220
   ELSE                                                                 00020230
         IF B01.STATUS.PENSJONSTYPE1(I) = 'K' THEN                      00020240
           DO;                                                          00020250
             TRANS_OPPL_OMR.TRANSTYPE     = 49; /*FRA AFP TIL P67 */    00020260
             B02.ALDERSP.KONV_P_KODE (I)  = 'K';                        00020270
 /*HL        B02.ALDERSP.UTTAKSDATO_ÅM(I) = AUTODATO_ÅM  */             00020280
             B02.STATUS.PENSJONSTYPE1(I)  = 'A';                        00020290
              B02.ALDERSP.VT_SPT(I) = B02.ALDERSP.SPT(I);               00020300
              B02.ALDERSP.VT_OPT(I) = B02.ALDERSP.OPT(I);               00020310
              B02.ALDERSP.VT_PÅ (I) = B02.ALDERSP.PÅ (I);               00020320
                                                                        00020330
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);           00020340
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                         00020350
                  B01.RF0PERSN.FNR   (I         ) THEN                  00020360
                    DO;                                                 00020370
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';         00020380
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';         00020390
                      J = 13;                                           00020400
                    END;                                                00020410
             END;                                                       00020420
           END;                                                         00020430
                                                                        00020440
         ELSE IF B01.PENSJONSTYPE1(I) = 'Y' THEN                        00020450
          DO;                                                           00020460
 /*         B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I); */      00020470
 /*         B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I); */      00020480
 /*         B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I); */      00020490
            IF B02.UFØRPENS.UFG(I)      < 100          THEN             00020500
               B02.P67_KODE(I)         = '5';                           00020510
            B02.SUM_YTELSE(I)     = 0;                                  00020520
            B02.ALDERSP.KONV_P_KODE (I)  = 'Y';                         00020530
            B02.STATUS.PENSJONSTYPE1(I)  = 'A';                         00020540
            B02.ALDERSP.UTTAKSDATO_ÅM (I)= AUTODATO_ÅM;                 00020550
            SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                          00020560
            B02.OPPHØRSDATO_ÅM(I,SISTE_UFT) = AUTODATO_ÅM;              00020570
            B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                      00020580
            SISTE_YUFT = FINNE_SISTE_YUFT_ÅM(I);                        00020590
            B02.OPPH_DATO_ÅM(I,SISTE_YUFT) = AUTODATO_ÅM;               00020600
            B02.OPPH_KODE   (I,SISTE_YUFT) = 'A';                       00020610
            B02.UFØRPENS            (I) = '';                           00020620
 /*YS  VI SKAL BEHOLDE YRKEPENS.YUG OG YPT              */              00020630
            B02.YRKEPENS.GP         (I) = 0;                            00020640
            B02.YRKEPENS.BT         (I) = 0;                            00020650
            B02.YRKEPENS.TP         (I) = 0;                            00020660
 /* HL      B02.YRKEPENS.SPT        (I) = 0                */           00020670
            B02.YRKEPENS.YPT_KODE   (I) = '';                           00020680
            TRANS_OPPL_OMR.BLANKETTYPE= '24';/*FRA UP TIL P67*/         00020690
                                                                        00020700
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);           00020710
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                         00020720
                  B01.RF0PERSN.FNR   (I         ) THEN                  00020730
                    DO;                                                 00020740
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';         00020750
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';         00020760
                      J = 13;                                           00020770
                    END;                                                00020780
             END;                                                       00020790
                                                                        00020800
             /**  FORSØRGEDE BARN   **/                                 00020810
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                      00020820
               CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                   00020830
                                                                        00020840
           END;                                                         00020850
                                                                        00020860
                                                                        00020870
       END;  /** IF ALDER_PERSON_ÅM(I) = 6700   **/                     00020880
                                                                        00020890
     ELSE  /** EKTEFELLEN FYLLER IKKE 67 ÅR DENNE MÅNED  **/            00020900
       IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                            00020910
          CALL BARN_18ÅR(I);                                            00020920
                                                                        00020930
                                                                        00020940
 END FORSØRGET_EK_BLIR_60ÅR;                                            00020950
                                                                        00020960
                                                                        00020970
 UNG_UFØR :                                                             00020980
    PROC;                                                               00020990
                                                                        00021000
         IF (ALDER_PERSON_ÅM(I) = 2000  &                               00021010
             AUTODATO_ÅM        < 9100  &                               00021020
             B01.PENSJONSTYPE1(I) = 'Y' )     !                         00021030
            (ALDER_PERSON_ÅM(I) = 2001  &                               00021040
             AUTODATO_ÅM        > 9101  &                               00021050
             B01.PENSJONSTYPE1(I) = 'Y' )    THEN                       00021060
                                                                        00021070
                DO;                                                     00021080
                                                                        00021090
     /** FINNE SISTE UTFYLTE YRKEHIST-SEGMENT **/                       00021100
                                                                        00021110
                   DO J = 1 TO 5  UNTIL                                 00021120
                          (B01.YRKEHIST.OPPH_DATO_ÅM(I,J) = 0);         00021130
                   END;                                                 00021140
                                                                        00021150
                   IF B02.YRKE11(I,J)        = 'V'        THEN          00021160
                      B02.PAÅ(I,J)           = 2;                       00021170
                                                                        00021180
                END;                                                    00021190
                                                                        00021200
         ELSE;                                                          00021210
                                                                        00021220
         IF ALDER_PERSON_ÅM(I) = 2000         THEN                      00021230
                                                                        00021240
              IF (B02.BUP_GAR_KODE(I,1) = 'A'        &                  00021250
                  AUTODATO_ÅM > 8104    )   THEN                        00021260
                                                                        00021270
                DO;                                                     00021280
                   DO BUP_IND = 1 TO SISTE_UTFYLLTE_BUP_GAR_KODE;       00021290
                                                                        00021300
                      B02.BUP_GAR_KODE(I,BUP_IND) = 'B';                00021310
                                                                        00021320
 /*ENDRET 13.5.91 TS - LOVENDRING -    */                               00021330
                                                                        00021340
                      IF AUTODATO_ÅM > 8804    THEN                     00021350
   /*TRUDE*/            IF AUTODATO_ÅM < 9105    THEN                   00021360
                                                                        00021370
                         B02.BUP_GARANTI(I,BUP_IND) = 3.00;             00021380
                        ELSE                                            00021390
   /*TRUDE*/             B02.BUP_GARANTI(I,BUP_IND) = 3.30;             00021400
                                                                        00021410
                      ELSE                                              00021420
                                                                        00021430
                         IF AUTODATO_ÅM > 8704    THEN                  00021440
                                                                        00021450
                            B02.BUP_GARANTI(I,BUP_IND) = 2.50;          00021460
                                                                        00021470
                         ELSE                                           00021480
                                                                        00021490
                            B02.BUP_GARANTI(I,BUP_IND) = 2.00;          00021500
                                                                        00021510
                   END;                                                 00021520
                                                                        00021530
                   CALL FØDT_UFØR(FAMILIE_IND);                         00021540
                                                                        00021550
                   TRANS_OPPL_OMR.TRANSTYPE     = 31;                   00021560
  /*31 = FØDT UFØR FYLLER 20 ÅR, ELLER ER 20 OG PASSERER DATOEN 8105*/  00021570
                   HENDELSE_IND = JA;                                   00021580
                   SØKER_IND = I;                                       00021590
                   I = I + 1;                                           00021600
                                                                        00021610
                END;                                                    00021620
                                                                        00021630
              ELSE; /* B02.BUP_GAR_KODE(I,1) = 'A' --------*/           00021640
                                                                        00021650
 /*HL       END   */                                                    00021660
                                                                        00021670
         ELSE IF AUTODATO_ÅM = 8105      THEN                           00021680
                                                                        00021690
               IF (ALDER_PERSON_ÅM(I) > 1912    &                       00021700
                   B02.BUP_GAR_KODE(I,1) = 'A') THEN                    00021710
                                                                        00021720
                  DO;                                                   00021730
                                                                        00021740
                     DO BUP_IND = 1 TO SISTE_UTFYLLTE_BUP_GAR_KODE;     00021750
                                                                        00021760
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';              00021770
                                                                        00021780
                        B02.BUP_GARANTI(I,BUP_IND)  = 2.00;             00021790
                                                                        00021800
                     END;                                               00021810
                                                                        00021820
                     CALL FØDT_UFØR(FAMILIE_IND);                       00021830
                                                                        00021840
                     TRANS_OPPL_OMR.TRANSTYPE     = 31;                 00021850
  /*31 = FØDT UFØR FYLLER 20 ÅR, ELLER ER 20 OG PASSERER DATOEN 8105*/  00021860
                     HENDELSE_IND = JA;                                 00021870
                     SØKER_IND = I;                                     00021880
                     I = I + 1;                                         00021890
                                                                        00021900
                  END;                                                  00021910
                                                                        00021920
               ELSE; /* ALDER_PERSON_ÅM(I) > 1912 ------ */             00021930
                                                                        00021940
         ELSE IF AUTODATO_ÅM = 8401     THEN                            00021950
                                                                        00021960
                IF B02.BUP_GAR_KODE(I,1) = 'C'  THEN                    00021970
                                                                        00021980
                   DO;                                                  00021990
                                                                        00022000
                      DO BUP_IND = 1 TO SISTE_UTFYLLTE_BUP_GAR_KODE;    00022010
                                                                        00022020
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';              00022030
                                                                        00022040
                        B02.BUP_GARANTI(I,BUP_IND)  = 2.00;             00022050
                                                                        00022060
                      END;                                              00022070
                                                                        00022080
                      CALL FØDT_UFØR(FAMILIE_IND);                      00022090
                                                                        00022100
                      TRANS_OPPL_OMR.TRANSTYPE     = 46;                00022110
  /*46 = UFØR MELLOM 20 OG 21 ÅR PASSERER DATOEN 8401*/                 00022120
                      HENDELSE_IND = JA;                                00022130
                      SØKER_IND = I;                                    00022140
                      I = I + 1;                                        00022150
                                                                        00022160
                   END;                                                 00022170
                                                                        00022180
                ELSE; /* B02.BUP_GAR_KODE(I,1) = 'C'  */                00022190
                                                                        00022200
         ELSE IF AUTODATO_ÅM = 8705       THEN                          00022210
                                                                        00022220
               IF B02.BUP_GAR_KODE(I,SISTE_UTFYLLTE_BUP_GAR_KODE)       00022230
                                      = 'B'            THEN             00022240
                                                                        00022250
                  DO;                                                   00022260
                                                                        00022270
                     DO BUP_IND = 1 TO SISTE_UTFYLLTE_BUP_GAR_KODE;     00022280
                                                                        00022290
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';              00022300
                                                                        00022310
                        B02.BUP_GARANTI(I,BUP_IND) = 2.50;              00022320
                                                                        00022330
                     END;                                               00022340
                     CALL FØDT_UFØR(FAMILIE_IND);                       00022350
                                                                        00022360
                     TRANS_OPPL_OMR.TRANSTYPE     = 30;                 00022370
  /*30 = FØDT UFØR FÅR OMREGNET PENSJON PR. 1.5.87 (2.50 POENG)     */  00022380
                     HENDELSE_IND = JA;                                 00022390
                     SØKER_IND = I;                                     00022400
                     I = I + 1;                                         00022410
                                                                        00022420
                  END;                                                  00022430
                                                                        00022440
               ELSE;  /* B02.BUP_GAR_KODE(I,1) = 'B' */                 00022450
                                                                        00022460
 /*ENDRET 16.2.88 HL - LOVENDRING  */                                   00022470
                                                                        00022480
         ELSE IF AUTODATO_ÅM = 8805       THEN                          00022490
                                                                        00022500
               IF B02.BUP_GAR_KODE(I,SISTE_UTFYLLTE_BUP_GAR_KODE)       00022510
                                      = 'B'            THEN             00022520
                                                                        00022530
                  DO;                                                   00022540
                                                                        00022550
                     DO BUP_IND = 1 TO SISTE_UTFYLLTE_BUP_GAR_KODE;     00022560
                                                                        00022570
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';              00022580
                                                                        00022590
                        B02.BUP_GARANTI(I,BUP_IND) = 3.00;              00022600
                                                                        00022610
                     END;                                               00022620
                     CALL FØDT_UFØR(FAMILIE_IND);                       00022630
                                                                        00022640
                     TRANS_OPPL_OMR.TRANSTYPE     = 39;                 00022650
  /*39 = FØDT UFØR FÅR OMREGNET PENSJON PR. 1.5.88 (3.00 POENG)     */  00022660
                     HENDELSE_IND = JA;                                 00022670
                     SØKER_IND = I;                                     00022680
                     I = I + 1;                                         00022690
                                                                        00022700
                  END;                                                  00022710
               ELSE;  /* B02.BUP_GAR_KODE(I,1) = 'B' */                 00022720
                                                                        00022730
       /*TRUDE FRA HIT, 130591*/                                        00022740
       /*BUP_GARANTI ØKER TIL 3.30 FRA 05.91*/                          00022750
         ELSE IF AUTODATO_ÅM = 9105       THEN                          00022760
                                                                        00022770
               IF B02.BUP_GAR_KODE(I,SISTE_UTFYLLTE_BUP_GAR_KODE)       00022780
                                      = 'B'            THEN             00022790
                                                                        00022800
                  DO;                                                   00022810
                                                                        00022820
                     DO BUP_IND = 1 TO SISTE_UTFYLLTE_BUP_GAR_KODE;     00022830
                                                                        00022840
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';              00022850
                                                                        00022860
                        B02.BUP_GARANTI(I,BUP_IND) = 3.30;              00022870
                                                                        00022880
                     END;                                               00022890
                     CALL FØDT_UFØR(FAMILIE_IND);                       00022900
                                                                        00022910
                     TRANS_OPPL_OMR.TRANSTYPE     = 39;                 00022920
  /*39 = FØDT UFØR FÅR OMREGNET PENSJON PR. 1.5.88 (3.00 POENG)   ??*/  00022930
                     HENDELSE_IND = JA;                                 00022940
                     SØKER_IND = I;                                     00022950
                     I = I + 1;                                         00022960
                                                                        00022970
  /*TRUDE HIT */  END;                                                  00022980
                                                                        00022990
               ELSE;  /* B02.BUP_GAR_KODE(I,1) = 'B' */                 00023000
                                                                        00023010
 /*HIT 16.2.88 HL  */                                                   00023020
                                                                        00023030
 /*LOVENDRING 8901 - ENDRET 23.12.88 - HL : */                          00023040
                                                                        00023050
         ELSE IF AUTODATO_ÅM = 8901       &                             00023060
                 ALDER_PERSON_ÅM(I) < 2201    THEN                      00023070
                                                                        00023080
               IF B02.BUP_GAR_KODE(I,1) = 'D'   THEN                    00023090
                                                                        00023100
                  DO;                                                   00023110
                                                                        00023120
                     DO BUP_IND = 1 TO SISTE_UTFYLLTE_BUP_GAR_KODE;     00023130
                                                                        00023140
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';              00023150
                                                                        00023160
                        B02.BUP_GARANTI(I,BUP_IND) = 3.00;              00023170
                                                                        00023180
                     END;                                               00023190
                     CALL FØDT_UFØR(FAMILIE_IND);                       00023200
                                                                        00023210
                     TRANS_OPPL_OMR.TRANSTYPE     = 46;                 00023220
  /*46 = UFØR MELLOM 21 OG 22 ÅR PASSERER DATOEN 8901 */                00023230
                     HENDELSE_IND = JA;                                 00023240
                     SØKER_IND = I;                                     00023250
                     I = I + 1;                                         00023260
                                                                        00023270
                  END;                                                  00023280
                                                                        00023290
               ELSE;  /* B02.BUP_GAR_KODE(I,1) = 'D' */                 00023300
                                                                        00023310
 /*LOVENDRING 9105 - ENDRET 13.05.91 - TS : */                          00023320
                                                                        00023330
         ELSE IF AUTODATO_ÅM = 9105       THEN                          00023340
                                                                        00023350
               IF B02.BUP_GAR_KODE(I,1) = 'D'   THEN                    00023360
                                                                        00023370
                  DO;                                                   00023380
                                                                        00023390
                     DO BUP_IND = 1 TO SISTE_UTFYLLTE_BUP_GAR_KODE;     00023400
                                                                        00023410
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';              00023420
                                                                        00023430
                        B02.BUP_GARANTI(I,BUP_IND) = 3.30;              00023440
                                                                        00023450
                     END;                                               00023460
                     CALL FØDT_UFØR(FAMILIE_IND);                       00023470
                                                                        00023480
                     TRANS_OPPL_OMR.TRANSTYPE     = 46;   /*???*/       00023490
  /*46 = UFØR MELLOM 21 OG 22 ÅR PASSERER DATOEN 8901  ????*/           00023500
                     HENDELSE_IND = JA;                                 00023510
                     SØKER_IND = I;                                     00023520
                     I = I + 1;                                         00023530
                                                                        00023540
                  END;                                                  00023550
               ELSE;   /* TRUDE 030692 ????  */                         00023560
         ELSE IF AUTODATO_ÅM = 9205       THEN                          00023570
                                                                        00023580
               IF B02.BUP_GAR_KODE(I,1) = 'D'   THEN                    00023590
                                                                        00023600
                  DO;                                                   00023610
                                                                        00023620
                     DO BUP_IND = 1 TO SISTE_UTFYLLTE_BUP_GAR_KODE;     00023630
                                                                        00023640
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';              00023650
                                                                        00023660
                        B02.BUP_GARANTI(I,BUP_IND) = 3.30;              00023670
                                                                        00023680
                        IF  B02.STATUS.TP_GAR_KODE(I) = 'E' THEN        00023690
                            B02.STATUS.TP_GAR_KODE(I) = ' '; /*TS*/     00023700
                     END;                                               00023710
                     CALL FØDT_UFØR(FAMILIE_IND);                       00023720
                                                                        00023730
                     TRANS_OPPL_OMR.TRANSTYPE     = 7;                  00023740
                     HENDELSE_IND = JA;                                 00023750
                     SØKER_IND = I;                                     00023760
                     I = I + 1;                                         00023770
                                                                        00023780
                  END;                                                  00023790
               ELSE;  /* B02.BUP_GAR_KODE(I,1) = 'D' */                 00023800
                                                                        00023810
 /*HIT 23.12.88 HL */                                                   00023820
                                                                        00023830
 END UNG_UFØR;                                                          00023840
                                                                        00023850
                                                                        00023860
 FØDT_UFØR:                                                             00023870
   PROC(I_EK);                                                          00023880
                                                                        00023890
   DCL                                                                  00023900
     I_EK           FIXED BIN(15),                                      00023910
     SISTE_BUP_EK   FIXED BIN(15);                                      00023920
                                                                        00023930
     IF I = 1 THEN                                                      00023940
       I_EK = 2;                                                        00023950
     ELSE                                                               00023960
       I_EK = 1;                                                        00023970
                                                                        00023980
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                00023990
     TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);            00024000
     B02.STATUS.VIRK_DATO_ÅM   (I)    = AUTODATO_ÅM;                    00024010
     B02.BUP_GAR_KODE(I,SISTE_UTFYLLTE_BUP_GAR_KODE) = 'B';             00024020
                                                                        00024030
     IF B01.RF0PERSN.FNR(I_EK) > 0 THEN                                 00024040
       DO;                                                              00024050
         B02.STATUS.VIRK_DATO_ÅM   (I_EK) = AUTODATO_ÅM;                00024060
                                                                        00024070
         /** FINNE SISTE UTFYLLTE BUP_GAR_KODE FOR EK   **/             00024080
                                                                        00024090
         DO J = 5 TO 1 BY -1 UNTIL(B01.UFØRHIST.BUP_GAR_KODE            00024100
                                      (I_EK,J) ^= ' ');                 00024110
           SISTE_BUP_EK = J;                                            00024120
         END;                                                           00024130
                                                                        00024140
         IF B01.STATUS.PENSJONSTYPE1(I_EK)  = 'U'    !                  00024150
            B01.STATUS.PENSJONSTYPE1(I_EK)  = 'Y' THEN                  00024160
           DO;                                                          00024170
             IF (B01.UFØRHIST.BUP_GAR_KODE(I_EK,SISTE_BUP_EK) = 'A' &   00024180
                ALDER_PERSON_ÅM(I_EK) > 1912) !                         00024190
                (B01.UFØRHIST.BUP_GAR_KODE(I_EK,SISTE_BUP_EK) = 'C' &   00024200
                 AUTODATO_ÅM = 8401)          !                         00024210
                (B01.UFØRHIST.BUP_GAR_KODE(I_EK,SISTE_BUP_EK) = 'D' &   00024220
                 AUTODATO_ÅM = 8901)           THEN                     00024230
                                                                        00024240
                 B02.UFØRHIST.BUP_GAR_KODE(I_EK,SISTE_BUP_EK) = 'B';    00024250
                                                                        00024260
 /*ENDRET 16.2.88 HL- GARANTI ØKER TIL 3.00 FRA 1.5.88 */               00024270
 /*ENDRET 13.5.91 TS- GARANTI ØKER TIL 3.30 FRA 1.5.91 */               00024280
                                                                        00024290
             IF AUTODATO_ÅM > 8804   &                                  00024300
                                                                        00024310
                B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) > 0 THEN    00024320
                                                                        00024330
  /*TRUDE*/    IF AUTODATO_ÅM < 9105   THEN                             00024340
                 B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 3.00;    00024350
               ELSE                                                     00024360
                 B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 3.30;    00024370
                                                                        00024380
             ELSE IF AUTODATO_ÅM > 8704   &                             00024390
                                                                        00024400
                B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) > 0 THEN    00024410
                                                                        00024420
                B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 2.50;     00024430
                                                                        00024440
 /*HIT 16.2.88 HL  */                                                   00024450
                                                                        00024460
                                                                        00024470
             IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN                   00024480
               CALL BARN_18ÅR(I_EK);                                    00024490
                                                                        00024500
           END;                                                         00024510
                                                                        00024520
       END;                                                             00024530
                                                                        00024540
     IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                              00024550
        CALL BARN_18ÅR(I);                                              00024560
                                                                        00024570
 END FØDT_UFØR;                                                         00024580
                                                                        00024590
                                                                        00024600
 FØDT_UFØR_BARN:                                                        00024610
   PROC;                                                                00024620
                                                                        00024630
     TRANSTYPE2 = 31;                                                   00024640
     B02.STATUS.VIRK_DATO_ÅM   (I)    = AUTODATO_ÅM;                    00024650
     B02.BUP_GAR_KODE(I,SISTE_UTFYLLTE_BUP_GAR_KODE) = 'B';             00024660
     UFØR_BARN_IND = I;                                                 00024670
                                                                        00024680
 END FØDT_UFØR_BARN;                                                    00024690
                                                                        00024700
                                                                        00024710
 FJERN_BARNEPENSJON:                                                    00024720
   PROC(BARN_IND,MF_IND);                                               00024730
                                                                        00024740
     /** RUTINEN SKILLER IKKE PÅ FJERNING VED 20 OG 18 ÅR           **/ 00024750
        /** HELLER IKKE PÅ FJERNING VED 21 ÅR                       **/ 00024760
     /** BARN_IND ER INDEKSEN PÅ DET BARN DET ER OPPHØR FOR.        **/ 00024770
     /** SØKER_IND ER INDEKSEN FOR DEN TRANSEN DET GJELDER.         **/ 00024780
     /** MF_IND ER INDEKSEN FOR AVDØD MOR ELLER FAR.                **/ 00024790
     /** UFØR_BARN_IND SETTES BARE VED SPLITTING AV FAMILIE, SLIK   **/ 00024800
     /** AT BEREGNING KAN KALLES OPP TO GANGER FRA STYRINGSRUTINEN. **/ 00024810
                                                                        00024820
   DCL                                                                  00024830
     BARN_IND     FIXED BIN(15),                                        00024840
     IND          FIXED BIN(15),                                        00024850
     MF_IND       FIXED BIN(15);                                        00024860
                                                                        00024870
     TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);            00024880
                                                                        00024890
     B02.ETTEBARN         (BARN_IND)   = '';                            00024900
     B02.STATUS.SUM_YTELSE(BARN_IND)   = 0;                             00024910
                                                                        00024920
     DO IND = 1 TO 14 UNTIL(B01.FNR(IND) =                              00024930
                            B01.TILKN.FNR_TILKN(BARN_IND,1));           00024940
     END;                                                               00024950
                                                                        00024960
         DO J = 3 TO 14 UNTIL(B01.STATUS.PENSJONSTYPE2(J) = 'P');       00024970
                                                                        00024980
              /*   P ANGIR AT DETTE ER YNGSTE BARN I KULLET */          00024990
                                                                        00025000
         END;                                                           00025010
                                                                        00025020
         SØKER_IND = J;                                                 00025030
                                                                        00025040
     IF B01.STATUS.ANTALL_BARN(SØKER_IND) = 1 THEN /*IKKE FLERE BARN*/  00025050
       DO;                                                              00025060
         TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(BARN_IND);     00025070
                                                                        00025080
         /** TILKN - SEGMENT FOR BARNET FJERNES HOS TILKNYTTEDE     **/ 00025090
         /** FORELDRE                                               **/ 00025100
                                                                        00025110
                                                                        00025120
         IF B01.RF0PERSN.FNR (1) > 0 THEN                               00025130
            CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,1);                00025140
                                                                        00025150
         IF B01.RF0PERSN.FNR (2) > 0 THEN                               00025160
            CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,2);                00025170
                                                                        00025180
         IF B01.STATUS.PENSJONSTYPE3(BARN_IND)  = 'U' THEN              00025190
           DO;                                                          00025200
             CALL UFØR_BARN(BARN_IND);                                  00025210
             TRANSTYPE2 = 0;                                            00025220
             TRANS_OPPL_OMR.TRANSTYPE = 42; /* UFØR BARN FYLLER 18/20*/ 00025230
           END;                                                         00025240
         ELSE                                                           00025250
           DO;                                                          00025260
             B02.STATUS.STATUS_KODE_HIST(BARN_IND)   = 'O';             00025270
             B02.STATUS.VIRK_DATO_ÅM    (BARN_IND)   = AUTODATO_ÅM;     00025280
             TRANS_OPPL_OMR.TRANSTYPE = 58;/*BP UTEN SØSKEN FYLLER ÅR*/ 00025290
           END;                                                         00025300
                                                                        00025310
       END;   /**    IF B01.STATUS.ANTALL_BARN(BARN_IND) = 1  **/       00025320
                                                                        00025330
     ELSE     /** FLERE ENN ETT BARN   **/                              00025340
                                                                        00025350
       DO;                                                              00025360
         IF B01.STATUS.PENSJONSTYPE2(BARN_IND)  = 'P'  THEN             00025370
                                                                        00025380
                     /** YNGSTE BARN OPPHØRER    **/                    00025390
           DO;                                                          00025400
             TRANS_OPPL_OMR.TRANSTYPE = 58;/*BP UTEN SØSKEN OPPHØRER*/  00025410
             TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.                  00025420
                                         FNR(SØKER_IND);                00025430
                                                                        00025440
             /** TILKN - SEGMENT FOR BARNET FJERNES HOS TILKNYTTEDE  **/00025450
             /** FORELDRE                                            **/00025460
                                                                        00025470
             IF B01.RF0PERSN.FNR (1) > 0 THEN                           00025480
                CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,1);            00025490
                                                                        00025500
             IF B01.RF0PERSN.FNR (2) > 0 THEN                           00025510
                CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,2);            00025520
                                                                        00025530
             B02.STATUS.VIRK_DATO_ÅM    (BARN_IND) = AUTODATO_ÅM;       00025540
                                                                        00025550
             IF B01.STATUS.PENSJONSTYPE3(BARN_IND)  = 'U' THEN          00025560
               DO;           /** SPLITTING AV FAMILIE  **/              00025570
                 TRANS_OPPL_OMR.TRANSTYPE = 0;                          00025580
                 UFØR_BARN_IND = BARN_IND;                              00025590
                 CALL UFØR_BARN(BARN_IND);                              00025600
               END;                                                     00025610
             ELSE                                                       00025620
               B02.STATUS.STATUS_KODE_HIST(BARN_IND) = 'O';             00025630
                                                                        00025640
             DO J = BARN_IND  + 1 TO  MAX_BARN - 1;                     00025650
                IF B01.STATUS.PENSJONSTYPE2(J)  = 'Ø' THEN              00025660
                   /* 'Ø' = BARNET ER IKKE YNGSTE BARN */               00025670
                   DO;                                                  00025680
                      CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,J);      00025690
                      B02.ETTEBARN            (J) = '';                 00025700
                      B02.STATUS.SUM_YTELSE   (J) = 0;                  00025710
                      B02.STATUS.VIRK_DATO_ÅM (J) = AUTODATO_ÅM;        00025720
                                                                        00025730
                      IF B01.STATUS.PENSJONSTYPE3(J)  = 'U' THEN        00025740
                         DO;           /** SPLITTING AV FAMILIE  **/    00025750
                            UFØR_BARN_IND = J;                          00025760
                            CALL UFØR_BARN(J);   /**  (J       )   **/  00025770
                         END;                                           00025780
                      ELSE                                              00025790
                         B02.STATUS.STATUS_KODE_HIST(J) = 'O';          00025800
                   END;                                                 00025810
                                                                        00025820
             END;                                                       00025830
                                                                        00025840
             I = MAX_BARN; /*** NB! NB! FOR å IKKE BEHANDLE BARNA **/   00025850
                           /*** PåNYTT FRA HOVEDLOOP              **/   00025860
                                                                        00025870
           END;   /** IF B01.STATUS.PENSJONSTYPE2(BARN_IND)  = P   */   00025880
                                                                        00025890
         ELSE   /** BARN SOM UTGÅR ER IKKE YNGSTE BARN   **/            00025900
                                                                        00025910
           DO;                                                          00025920
             B02.STATUS.ANTALL_BARN(SØKER_IND) =                        00025930
                           B02.STATUS.ANTALL_BARN(SØKER_IND) - 1;       00025940
             B02.STATUS.VIRK_DATO_ÅM(SØKER_IND) = AUTODATO_ÅM;          00025950
             TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR               00025960
                                                   (SØKER_IND);         00025970
             TRANS_OPPL_OMR.TRANSTYPE = 29;                             00025980
               /* 29 = BP OPPHØRER, DET ER SØSKEN TILBAKE */            00025990
                                                                        00026000
           LOOP:                                                        00026010
             DO J = 1 TO 13;                                            00026020
               IF B01.TILKN.FNR_TILKN(SØKER_IND,J) =                    00026030
                               B01.RF0PERSN.FNR(BARN_IND) THEN          00026040
                 DO;                                                    00026050
                   DO K = J TO 12;                                      00026060
                     B02.TILKN (SØKER_IND,K) =                          00026070
                            B02.TILKN (SØKER_IND,K + 1);                00026080
                   END;                                                 00026090
                   B02.TILKN (SØKER_IND,13) = '';                       00026100
                   LEAVE LOOP;                                          00026110
                 END;                                                   00026120
                                                                        00026130
             END;    /**  DO J = 1 TO 13  **/                           00026140
                                                                        00026150
                                                                        00026160
             DO J = 1 TO 13 UNTIL(B02.TILKN.                            00026170
                        TILKNYTNINGSKODE(SØKER_IND,J) = 'D');           00026180
                                                                        00026190
               IF B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,J) = 'D' THEN    00026200
                 DO;                                                    00026210
                   PIC11 = B01.TILKN.FNR_TILKN(SØKER_IND,J);            00026220
                   IF F_KJØNN(PIC11) = 'K' THEN                         00026230
                     MF_IND = 1;                                        00026240
                   ELSE                                                 00026250
                     MF_IND = 2;                                        00026260
                 END;                                                   00026270
                                                                        00026280
             END;    /**  DO J = 1 TO 13 UNTIL(B02.TILKN **/            00026290
                                                                        00026300
             IF B01.STATUS.PENSJONSTYPE3(BARN_IND)  = 'U' THEN          00026310
               DO;           /** SPLITTING AV FAMILIE  **/              00026320
                 UFØR_BARN_IND = BARN_IND;                              00026330
                 TRANS_OPPL_OMR.TRANSTYPE = 0;                          00026340
                 CALL UFØR_BARN(BARN_IND);   /**  (BARN_IND)   **/      00026350
               END;                                                     00026360
             ELSE                                                       00026370
               DO;                                                      00026380
                  DO J = 1 TO 13;                                       00026390
                     B02.TILKN(BARN_IND,J)             = '';            00026400
                  END;                                                  00026410
                  B02.STATUS.STATUS_KODE_HIST(BARN_IND) = 'O';          00026420
                  B02.STATUS.VIRK_DATO_ÅM    (BARN_IND) =               00026430
                                                        AUTODATO_ÅM;    00026440
               END;                                                     00026450
                                                                        00026460
             DO J = 3 TO MAX_BARN - 1;                                  00026470
                B02.STATUS.VIRK_DATO_ÅM   (J) = AUTODATO_ÅM;            00026480
             END;                                                       00026490
                                                                        00026500
           END;  /** DO FOR ELSE  BARN SOM UTGÅR ER IKKE YNGSTE BARN **/00026510
                                                                        00026520
       END;   /**  DO FOR ELSE FLERE ENN ETT BARN   **/                 00026530
                                                                        00026540
                                                                        00026550
 END FJERN_BARNEPENSJON;                                                00026560
                                                                        00026570
                                                                        00026580
 UFØR_BARN:                                                             00026590
   PROC(BARN_IND);                                                      00026600
                                                                        00026610
     /** UFØR BARN ENDRES TIL REN UFØR                      **/         00026620
     /** TRANS DANNES IKKE HER, MEN I OVERLIGGENDE RUTINE   **/         00026630
                                                                        00026640
   DCL                                                                  00026650
     BARN_IND     FIXED BIN(15);                                        00026660
                                                                        00026670
     B02.STATUS.PENSJONSTYPE1  (BARN_IND) = 'U';                        00026680
     B02.STATUS.PENSJONSTYPE2  (BARN_IND) = 'P';                        00026690
     B02.STATUS.PENSJONSTYPE3  (BARN_IND) = ' ';                        00026700
     B02.STATUS.ANTALL_BARN    (BARN_IND) =  0;                         00026710
                                                                        00026720
     DO J = 1 TO 13;                                                    00026730
       B02.TILKN.FNR_TILKN       (BARN_IND,J) = 0;                      00026740
       B02.TILKN.TILKNYTNINGSKODE(BARN_IND,J) = ' ';                    00026750
     END;                                                               00026760
                                                                        00026770
     TRANSTYPE2 = 42; /* UFØR BARN FYLLER 18/20 ÅR */                   00026780
                                                                        00026790
 END UFØR_BARN;                                                         00026800
                                                                        00026810
                                                                        00026820
 FJERN_BARNETILLEGG:                                                    00026830
   PROC(BARN_IND,I,I_EK);                                               00026840
                                                                        00026850
   DCL                                                                  00026860
     BARN_IND       FIXED BIN(15),                                      00026870
     I              FIXED BIN(15),                                      00026880
     I_EK           FIXED BIN(15);                                      00026890
                                                                        00026900
     IF B01.RF0PERSN.FNR(1) = B01.TILKN.FNR_TILKN(BARN_IND,1) THEN      00026910
       DO;                                                              00026920
         I    = 1;                                                      00026930
         I_EK = 2;                                                      00026940
       END;                                                             00026950
     ELSE                                                               00026960
       DO;                                                              00026970
         I    = 2;                                                      00026980
         I_EK = 1;                                                      00026990
       END;                                                             00027000
                                                                        00027010
     B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;                       00027020
     IF B01.STATUS.PENSJONSTYPE1(I_EK)  ^= ' ' THEN                     00027030
       DO;                                                              00027040
         IF B01.STATUS_KODE_HIST(I_EK)  = ' ' THEN                      00027050
                                                                        00027060
         B02.STATUS.VIRK_DATO_ÅM   (I_EK) = AUTODATO_ÅM;                00027070
       END;                                                             00027080
                                                                        00027090
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                00027100
     TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);            00027110
     IF B01.GARANTITILLEGG_BARN   (I)  = 0               &              00027120
        B01.GARANTITILLEGG_SÆRBARN(I)  = 0               &              00027130
        B01.BT_SÆRBARN            (I)  = 0               &              00027140
        B01.ALDERSP.BT            (I)  = 0               &              00027150
        B01.UFØRPENS.BT           (I)  = 0               &              00027160
        B01.YRKEPENS.BT           (I)  = 0            THEN              00027170
                                                                        00027180
        TRANS_OPPL_OMR.TRANSTYPE = 70; /* IKKE BREV   */                00027190
     ELSE                                                               00027200
        TRANS_OPPL_OMR.TRANSTYPE = 28; /* FT OPPHØRER */                00027210
                                                                        00027220
     IF B01.STATUS.ANTALL_BARN(I)  > 0 THEN                             00027230
        CALL BARN_18ÅR(I);                                              00027240
                                                                        00027250
     IF B01.STATUS.ANTALL_BARN(I_EK)  > 0 THEN                          00027260
        CALL BARN_18ÅR(I_EK);                                           00027270
                                                                        00027280
 END FJERN_BARNETILLEGG;                                                00027290
                                                                        00027300
                                                                        00027310
 BARN_18ÅR:                                                             00027320
   PROC(I);                                                             00027330
   DCL                                                                  00027340
     BARN_IND       FIXED BIN(15),                                      00027350
     I              FIXED BIN(15);                                      00027360
                                                                        00027370
     DO J = 1 TO 13 WHILE (B01.TILKN.FNR_TILKN(I,J) > 0);               00027380
       IF B01.TILKN.TILKNYTNINGSKODE(I,J) = 'L'     !                   00027390
  /*HL*/  B01.TILKN.TILKNYTNINGSKODE(I,J) = 'V'     !                   00027400
          B01.TILKN.TILKNYTNINGSKODE(I,J) = 'W'    THEN                 00027410
         DO;                                                            00027420
           DO BARN_IND = 3 TO 14 UNTIL(B01.RF0PERSN.FNR(BARN_IND) =     00027430
                                    B01.TILKN.FNR_TILKN(I,J));          00027440
           END;                                                         00027450
                                                                        00027460
           IF ALDER_PERSON_ÅM(BARN_IND) = 1801 THEN                     00027470
             DO;                                                        00027480
               B02.STATUS.STATUS_KODE_HIST(BARN_IND)   = 'O';           00027490
               B02.STATUS.VIRK_DATO_ÅM    (BARN_IND)   = AUTODATO_ÅM;   00027500
               CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,I);             00027510
                                                                        00027520
               B02.STATUS.ANTALL_BARN(I) =                              00027530
                            B02.STATUS.ANTALL_BARN(I) - 1;              00027540
                                                                        00027550
             END;                                                       00027560
           ELSE                                                         00027570
             B02.STATUS.VIRK_DATO_ÅM   (BARN_IND) = AUTODATO_ÅM;        00027580
         END;                                                           00027590
     END;        /**    DO J = 1 TO 13      **/                         00027600
                                                                        00027610
 END BARN_18ÅR;                                                         00027620
                                                                        00027630
                                                                        00027640
 BARNS_TILKNYTNINGSKODE_ENDRES:                                         00027650
   PROC(I);                                                             00027660
   DCL                                                                  00027670
     BARN_IND       FIXED BIN(15),                                      00027680
     I              FIXED BIN(15);                                      00027690
                                                                        00027700
     DO J = 1 TO 13 WHILE (B01.TILKN.FNR_TILKN(I,J) > 0);               00027710
       IF B01.TILKN.TILKNYTNINGSKODE(I,J) = 'L'    !                    00027720
 /*HL*/   B01.TILKN.TILKNYTNINGSKODE(I,J) = 'V'    !                    00027730
          B01.TILKN.TILKNYTNINGSKODE(I,J) = 'W'   THEN                  00027740
         DO;                                                            00027750
           DO BARN_IND = 3 TO 14 UNTIL(B01.RF0PERSN.FNR(BARN_IND) =     00027760
                                    B01.TILKN.FNR_TILKN(I,J));          00027770
           END;                                                         00027780
                                                                        00027790
           IF ALDER_PERSON_ÅM(BARN_IND) = 1801 THEN                     00027800
             DO;                                                        00027810
               B02.STATUS.STATUS_KODE_HIST(BARN_IND) = 'O';             00027820
               B02.STATUS.VIRK_DATO_ÅM    (BARN_IND) = AUTODATO_ÅM;     00027830
               B02.STATUS.ANTALL_BARN(I) =                              00027840
                            B02.STATUS.ANTALL_BARN(I) - 1;              00027850
               CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,I);             00027860
             END;                                                       00027870
           ELSE                                                         00027880
             DO;                                                        00027890
               B02.TILKN.TILKNYTNINGSKODE(BARN_IND,1) = 'A';            00027900
               B02.STATUS.VIRK_DATO_ÅM   (BARN_IND) = AUTODATO_ÅM;      00027910
             END;                                                       00027920
         END;                                                           00027930
     END;        /**    DO J = 1 TO 13      **/                         00027940
                                                                        00027950
 END BARNS_TILKNYTNINGSKODE_ENDRES;                                     00027960
                                                                        00027970
                                                                        00027980
        YRKESSKADE_ELEV:                                                00027990
         PROC(W_PAÅ);                                                   00028000
                                                                        00028010
            DCL I_EK     FIXED BIN (15);                                00028020
            DCL W_IND    FIXED BIN (15);                                00028030
            DCL W_PAÅ    FIXED DEC (3,2);                               00028040
                                                                        00028050
     /** FINNE SISTE UTFYLTE YRKEHIST-SEGMENT **/                       00028060
                                                                        00028070
         DO J = 1 TO 5  UNTIL(B01.YRKEHIST.OPPH_DATO_ÅM(I,J) = 0);      00028080
         END;                                                           00028090
                                                                        00028100
         IF B02.YRKE11(I,J)        = 'V'      &                         00028110
            B02.PAÅ   (I,J)        < W_PAÅ          THEN                00028120
                                                                        00028130
           DO;                                                          00028140
             B02.PAÅ(I,J)                 = W_PAÅ;                      00028150
             B02.STATUS.VIRK_DATO_ÅM(I)   = AUTODATO_ÅM;                00028160
             IF W_PAÅ > B02.YRKEPENS.YPT(I) THEN                        00028170
                DO;                                                     00028180
                   TRANS_OPPL_OMR.TRANSTYPE     = 38;                   00028190
                   B02.YRKEPENS.YPT(I) = W_PAÅ;                         00028200
                   B02.YRKEPENS.YPT_KODE(I) = 'Y';                      00028210
                END;                                                    00028220
                                                                        00028230
             ELSE                                                       00028240
                TRANS_OPPL_OMR.TRANSTYPE     = 72;                      00028250
                                                                        00028260
             TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);        00028270
             TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);    00028280
             HENDELSE_IND                 = JA;                         00028290
             SØKER_IND                    = I;                          00028300
             I                            = I + 1;                      00028310
                                                                        00028320
             IF I = 1 THEN                                              00028330
                I_EK = 2;                                               00028340
             ELSE                                                       00028350
                I_EK = 1;                                               00028360
                                                                        00028370
             IF B01.STATUS.VIRK_DATO_ÅM (I_EK) > 0  &                   00028380
                B01.STATUS_KODE_HIST    (I_EK) = ' '   THEN             00028390
                                                                        00028400
                B02.STATUS.VIRK_DATO_ÅM (I_EK) = AUTODATO_ÅM;           00028410
                                                                        00028420
             DO W_IND = 3 TO 13;                                        00028430
                                                                        00028440
                IF B01.STATUS.VIRK_DATO_ÅM (W_IND) > 0  THEN            00028450
                   B02.STATUS.VIRK_DATO_ÅM (W_IND) = AUTODATO_ÅM;       00028460
                ELSE                                                    00028470
                   W_IND = 13;                                          00028480
                                                                        00028490
             END;                                                       00028500
                                                                        00028510
           END;                                                         00028520
                                                                        00028530
                                                                        00028540
        END YRKESSKADE_ELEV;                                            00028550
                                                                        00028560
                                                                        00028570
 SATSENDRING:                                                           00028580
   PROC;                                                                00028590
                                                                        00028600
   /** DERSOM VI TIDLIGERE I AUTOHENDELSE-BEREGNINGEN HAR SPLITTET  **/ 00028610
   /** EN FAMILIE - UFØRT BARN FYLTE  18 ÅR - SÅ MÅ VI HER KUNNE    **/ 00028620
   /** FORBEREDE NY BEREGNING FOR BÅDE BARNEKULLET OG DEN UFØRE.    **/ 00028630
                                                                        00028640
   DCL                                                                  00028650
     I      FIXED BIN(15);                                              00028660
                                                                        00028670
                                                                        00028680
                                                                        00028690
     DO I = 1 TO 2;                                                     00028700
       IF B01.STATUS.PENSJONSTYPE1(I) = 'A' !                           00028710
          B01.STATUS.PENSJONSTYPE1(I) = 'E' !                           00028720
          B01.STATUS.PENSJONSTYPE1(I) = 'J' !                           00028730
          B01.STATUS.PENSJONSTYPE1(I) = 'K' !                           00028740
          B01.STATUS.PENSJONSTYPE1(I) = 'Y' !                           00028750
          B01.STATUS.PENSJONSTYPE1(I) = 'U' THEN                        00028760
         DO;                                                            00028770
           TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR(I);             00028780
           TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */            00028790
           TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);      00028800
           HENDELSE_IND = JA;                                           00028810
           IF I = 1 THEN                                                00028820
             DO;                                                        00028830
               SØKER_IND   = 1;                                         00028840
               FAMILIE_IND = 2;                                         00028850
             END;                                                       00028860
           ELSE                                                         00028870
             DO;                                                        00028880
               SØKER_IND   = 2;                                         00028890
               FAMILIE_IND = 1;                                         00028900
             END;                                                       00028910
           IF B01.ETTEPENS.FORVENTET(I) > 0        &                    00028920
              B01.GT_TILLEGG_LOV92(I) = 0          THEN                 00028930
             DO;                                                        00028940
               FIXED_DEC5 = (B02.ETTEPENS.FORVENTET(I) * G_NÅ/G_FØR);   00028950
                                                                        00028960
               B02.ETTEPENS.FORVENTET(I) = FIXED_DEC5;                  00028970
             END;                                                       00028980
                                                                        00028990
             /*---------------------------------------------------- */  00029000
             /*VI MÅ RULLERE FORSI-INNTEKTER OG ALDERSP.FAI         */  00029010
             /*REGELENDRINGER 0591 OG 0192 . TRUDE 240492           */  00029020
             /*---------------------------------------------------- */  00029030
                                                                        00029040
           IF B01.FORSI.ARBEIDSINNTEKT(I) > 0 THEN                      00029050
             DO;                                                        00029060
               FIXED_DEC5 = (B02.FORSI.ARBEIDSINNTEKT(I) * G_NÅ/G_FØR); 00029070
               B02.FORSI.ARBEIDSINNTEKT(I) = FIXED_DEC5;                00029080
             END;                                                       00029090
                                                                        00029100
           IF B01.FORSI.PENSJONSINNTEKT(I) > 0 THEN                     00029110
             DO;                                                        00029120
               FIXED_DEC5 = (B02.FORSI.PENSJONSINNTEKT(I) * G_NÅ/G_FØR);00029130
               B02.FORSI.PENSJONSINNTEKT(I) = FIXED_DEC5;               00029140
             END;                                                       00029150
                                                                        00029160
           IF B01.FORSI.ARBEIDSINNTEKT_EK(I) > 0 THEN                   00029170
             DO;                                                        00029180
              FIXED_DEC5 = (B02.FORSI.ARBEIDSINNTEKT_EK(I)              00029190
                                   * G_NÅ/G_FØR);                       00029200
              B02.FORSI.ARBEIDSINNTEKT_EK(I) = FIXED_DEC5;              00029210
             END;                                                       00029220
                                                                        00029230
           IF B01.FORSI.PENSJONSINNTEKT_EK(I) > 0 THEN                  00029240
             DO;                                                        00029250
               FIXED_DEC5 = (B02.FORSI.PENSJONSINNTEKT_EK(I)            00029260
                                  * G_NÅ/G_FØR);                        00029270
               B02.FORSI.PENSJONSINNTEKT_EK(I) = FIXED_DEC5;            00029280
             END;                                                       00029290
                                                                        00029300
           W_FNR          = B02.RF0PERSN.FNR(I);                        00029310
           W_FNR_ÅM       = FNR_R.ÅR!!FNR_R.MND;                        00029320
                                                                        00029330
           IF (W_FNR_ÅM        > 2500   &                               00029340
               FNR_R.ÅRHUNDRE  < 5      &                               00029350
               B01.KONV_P_KODE(I) ^= 'K' ) !                            00029360
                                                                        00029370
              (B01.KONV_P_KODE(I)    = 'K'  !                           00029380
               B01.PENSJONSTYPE1(I)  = 'K'  &                           00029390
               B01.UTTAKSDATO_ÅM(I) > 9200 )  THEN                      00029400
                DO;                                                     00029410
                  IF B01.ALDERSP.FAI(I) > 0 THEN                        00029420
                   DO;                                                  00029430
                     FIXED_DEC5 = (B02.ALDERSP.FAI(I) * G_NÅ/G_FØR);    00029440
                     B02.ALDERSP.FAI(I) = FIXED_DEC5;                   00029450
                   END;                                                 00029460
                END;                                                    00029470
                                                                        00029480
           I = 2;                                                       00029490
         END;                                                           00029500
     END;      /** DO I = 1 TO 2  **/                                   00029510
                                                                        00029520
     IF TRANS_OPPL_OMR.TRANSTYPE = 0 THEN                               00029530
       DO;                                                              00029540
                                                                        00029550
         /*  FINNE YNGSTE BARN      */                                  00029560
         DO J = 3 TO 14 UNTIL(B01.STATUS.PENSJONSTYPE2(J) = 'P');       00029570
                                                                        00029580
         END;                                                           00029590
                                                                        00029600
         IF B01.STATUS.PENSJONSTYPE2(J) = 'P'   THEN                    00029610
                                                                        00029620
           DO;                                                          00029630
             TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR(J);           00029640
             TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */          00029650
             TRANS_OPPL_OMR.VIRKNINGSDATO = F_SNU_DATO(AUTODATO_ÅM);    00029660
             HENDELSE_IND = JA;  /*TRUDE 190692 ????? */                00029670
             SØKER_IND = J;                                             00029680
                                                                        00029690
          LOOP2:                                                        00029700
             DO K = 1 TO 13 WHILE(B01.FNR_TILKN(1,K) > 0);              00029710
               IF B01.TILKN.TILKNYTNINGSKODE(1,K) = 'D' THEN            00029720
                 DO;                                                    00029730
                   PIC11 =  B01.TILKN.FNR_TILKN(1,K);                   00029740
                   IF F_KJØNN(PIC11) = 'K' THEN                         00029750
                     FAMILIE_IND = 1;                                   00029760
                   ELSE                                                 00029770
                     FAMILIE_IND = 2;                                   00029780
                   LEAVE LOOP2;                                         00029790
                 END;                                                   00029800
             END;                                                       00029810
                                                                        00029820
           END;   /** DO IF B01.STATUS.PENSJONSTYPE2(J) = P   **/       00029830
                                                                        00029840
         IF UFØR_BARN_IND > 0 & TRANSTYPE2 = 0 THEN                     00029850
            DO;                                                         00029860
                                                                        00029870
                                                                        00029880
           TRANSTYPE2 = 27;                                             00029890
                                                                        00029900
                                                                        00029910
           END;                                                         00029920
                                                                        00029930
       END;   /** DO IF TRANS_OPPL_OMR.TRANSTYPE = 0  **/               00029940
                                                                        00029950
 END SATSENDRING;                                                       00029960
                                                                        00029970
                                                                        00029980
 FINNE_SISTE_UFT_ÅM:                                                    00029990
   PROC(IND) RETURNS(FIXED BIN(15));                                    00030000
   DCL                                                                  00030010
     IND    FIXED BIN(15),                                              00030020
     SISTE  FIXED BIN(15);                                              00030030
                                                                        00030040
     /** FINNE SISTE UTFYLLTE UFT_ÅM   **/                              00030050
     DO J = 5 TO 1 BY -1 UNTIL(B01.UFØRHIST.UFT_ÅM                      00030060
                                  (IND,J) > 0);                         00030070
       SISTE = J;                                                       00030080
     END;                                                               00030090
                                                                        00030100
     RETURN(SISTE);                                                     00030110
                                                                        00030120
 END FINNE_SISTE_UFT_ÅM;                                                00030130
                                                                        00030140
                                                                        00030150
        FINNE_SISTE_YUFT_ÅM:                                            00030160
          PROC(IND) RETURNS(FIXED BIN(15));                             00030170
          DCL                                                           00030180
            IND    FIXED BIN(15),                                       00030190
            SISTE  FIXED BIN(15);                                       00030200
                                                                        00030210
            /** FINNE SISTE UTFYLTE YUFT_ÅM   **/                       00030220
            DO J = 5 TO 1 BY -1 UNTIL(B01.YRKEHIST.YUFT_ÅM              00030230
                                         (IND,J) > 0);                  00030240
              SISTE = J;                                                00030250
            END;                                                        00030260
                                                                        00030270
            RETURN(SISTE);                                              00030280
                                                                        00030290
        END FINNE_SISTE_YUFT_ÅM;                                        00030300
                                                                        00030310
                                                                        00030320
 % INCLUDE R0019902;   /*    FINNE KJØNN                  */            00030330
 %PAGE;                                                                 00030340
 % INCLUDE R0019905;   /*    FINNE ALDER                  */            00030350
 %PAGE;                                                                 00030360
 % INCLUDE R0019913;   /*    SNUR  DATO (PIC(4))          */            00030370
 %PAGE;                                                                 00030380
 % INCLUDE R0019934;   /*    OPPHØR_KOBLING_TO_PERSONER   */            00030390
 %PAGE;                                                                 00030400
 % INCLUDE R0019938;   /*    ETTERLATTEPENSJON_OPPHØRER   */            00030410
 %PAGE;                                                                 00030420
 % INCLUDE R0019966;   /*    AFP_NULL_OPPHØRER            */            00030430
 %PAGE;                                                                 00030440
                                                                        00030450
 END R001490;                                                           00030460
