 /*       SIST ENDRET 05/06-92 12.12.44 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 25/06-91 13.30.53 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 14/06-91 13.25.35 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 28/02-91 12.42.28 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 29/03-88 13.13.32 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 10/03-87 08.57.01 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 02/03-83 13.05.19 AV   OLAV                     */00000060
 /*       SIST ENDRET 24/11-82 09.50.51 AV   FARVIK                   */00000070
 /*       SIST ENDRET 01/10-82 13.38.40 AV   FARVIK                   */00000080
 /* ***************************************************************** */00000090
 /* IDENTIFIKASJON                                                    */00000100
 /*     R0014134 - F_BEREGN_KOMPENSASJONSTILLEGG - PROSEDYRE I PLI.   */00000110
 /*     PROGRAMMERER: TOM JØRGENSEN, JUNI-82.                         */00000120
 /*     SIST ENDRET AV KARIN I JULI 82                                */00000130
 /* HENSIKT                                                           */00000140
 /*     BEREGNE KOMPENSASJONSTILLEGG.                                 */00000150
 /* PROGRAMTILKNYTNING                                                */00000160
 /*     PROSEDYREN BLIR INKLUDERT I OVERLIGGENDE PROGRAM.             */00000170
 /* BRUK                                                              */00000180
 /*     KT = F_BEREGN_KOMPENSASJONSTILLEGG(PENSJONSTYPE1,             */00000190
 /*             PENSJONSTYPE2,TT_ANV,ANTALL_BARN,KOMPFAKTOR,          */00000200
 /*             FORH_INDIKATOR);                                      */00000210
 /* ENDRET FRA :                                                      */00000220
 /*      PROC (PTYPE2,TT_A,A_B,KOMPFAKTOR,FORH_IND)                   */00000230
 /*  TIL :                                                            */00000240
 /*      PROC (PTYPE1,PTYPE2,TT_A,A_B,KOMPFAKTOR,FORH_IND)            */00000250
 /*  MARS 88 - SATISH                                                 */00000260
 /* ***************************************************************** */00000270
 F_BEREGN_KOMPENSASJONSTILLEGG:                                         00000280
  PROC (PTYPE1,PTYPE2,TT_A,A_B,KOMPFAKTOR,FORH_IND)                     00000290
        RETURNS (FIXED DEC (5,2));                                      00000300
   DCL PTYPE1         CHAR(1);                                          00000310
   DCL PTYPE2         CHAR(1);                                          00000320
   DCL TT_A   UNAL    FIXED DEC (3);                                    00000330
   DCL A_B            FIXED DEC (3);                                    00000340
   DCL W_KT           FIXED DEC (9,4);                                  00000350
   DCL KT             FIXED DEC (5,2)   INIT (0);                       00000360
   DCL KOMPFAKTOR     FIXED DEC(3,1);                                   00000370
   DCL FORH_IND       CHAR(1);                                          00000380
   DCL SATS1          FIXED DEC (3);                                    00000390
   DCL SATS2          FIXED DEC (3);                                    00000400
   DCL SATS3          FIXED DEC (3);                                    00000410
                                                                        00000420
 /* KOMP OPPHøRER FRA 1.5.92 : */                                       00000430
                                                                        00000440
   IF G > 35500               THEN                                      00000450
      GOTO SLUTT;                                                       00000460
                                                                        00000470
 /*FRA 0591 ER DET NYE SATSER FOR KOMP : */                             00000480
                                                                        00000490
   IF G < 35500 THEN                                                    00000500
      DO;                                                               00000510
         SATS1 = 375;                                                   00000520
         SATS2 = 500;                                                   00000530
         SATS3 = 750;                                                   00000540
      END;                                                              00000550
   ELSE                                                                 00000560
      DO;                                                               00000570
         SATS1 = 188;                                                   00000580
         SATS2 = 250;                                                   00000590
         SATS3 = 375;                                                   00000600
      END;                                                              00000610
                                                                        00000620
                                                                        00000630
   IF G > 6799                           THEN                           00000640
      /* KOMPTILLEGGET KOM 1.1-70 */                                    00000650
                                                                        00000660
      DO;                                                               00000670
        IF PTYPE2 = 'S' THEN                                            00000680
           DO;                                                          00000690
                                                                        00000700
             /*W_KT = (SATS1 * TT_A * KOMPFAKTOR) / (40 * 12);*/        00000710
                                                                        00000720
               W_KT = SATS1 * TT_A;                                     00000730
               W_KT = W_KT * KOMPFAKTOR;                                00000740
               W_KT = W_KT / (40 * 12);                                 00000750
           END;                                                         00000760
        ELSE                                                            00000770
           IF PTYPE2 = 'F' THEN                                         00000780
              DO;                                                       00000790
                                                                        00000800
                /*W_KT = (SATS3 * TT_A * KOMPFAKTOR) / (40 * 12);*/     00000810
                                                                        00000820
                  W_KT = SATS3 * TT_A;                                  00000830
                  W_KT = W_KT * KOMPFAKTOR;                             00000840
                  W_KT = W_KT / (40 * 12);                              00000850
              END;                                                      00000860
           ELSE                                                         00000870
 /*           IF PTYPE2 = 'Y' THEN       */                             00000880
              IF PTYPE2 = 'P' &                                         00000890
                 (PTYPE1 = 'B' !                                        00000900
                  PTYPE1 = 'N')  THEN                                   00000910
                 DO;                                                    00000920
                                                                        00000930
                  /*W_KT = (SATS2 * TT_A) / (40 * 12 * A_B);*/          00000940
                                                                        00000950
                    W_KT = SATS2 * TT_A;                                00000960
                    W_KT = W_KT / (40 * 12);                            00000970
                    W_KT = W_KT / A_B;                                  00000980
                 END;                                                   00000990
              ELSE                                                      00001000
                 DO;                                                    00001010
                                                                        00001020
                  /*W_KT = (SATS2 * TT_A * KOMPFAKTOR) / (40 * 12);*/   00001030
                                                                        00001040
                    W_KT = SATS2 * TT_A;                                00001050
                    W_KT = W_KT * KOMPFAKTOR;                           00001060
                    W_KT = W_KT / (40 * 12);                            00001070
                 END;                                                   00001080
        IF FORH_IND = 'J' THEN                                          00001090
           KT = W_KT + 0.5;                                             00001100
        ELSE                                                            00001110
           KT = W_KT;                                                   00001120
      END;                                                              00001130
   ELSE                                                                 00001140
      KT = 0;                                                           00001150
                                                                        00001160
                                                                        00001170
                                                                        00001180
                                                                        00001190
   IF B02.SPESOPPL.BOSATT(BER_SØ_IND) ^= 0          !                   00001200
      B02.RF0PERSN.TKNR  (BER_SØ_IND)  = 2101      THEN                 00001210
      DO;                                                               00001220
        W_KT = 0  ;                                                     00001230
        KT = W_KT ;                                                     00001240
      END;                                                              00001250
                                                                        00001260
  SLUTT :                                                               00001270
                                                                        00001280
   RETURN (KT);                                                         00001290
 END F_BEREGN_KOMPENSASJONSTILLEGG;                                     00001300
