 /*       SIST ENDRET 25/02-94 12.23.43 AV   HERMAN                   */00000000
 /*       SIST ENDRET 03/09-93 13.44.36 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 12/02-93 08.59.07 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 09/02-93 13.10.26 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 06/01-93 12.30.25 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 17/02-92 13.43.45 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 20/01-92 14.34.06 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 11/10-91 09.20.22 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 21/01-91 13.49.25 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 16/05-88 12.29.01 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 11/11-86 11.30.00 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 15/10-85 15.39.18 AV   FARVIK                   */00000110
 /*       SIST ENDRET 11/10-85 13.04.28 AV   FARVIK                   */00000120
 /*       SIST ENDRET 13/09-83 09.04.16 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 29/10-82 07.45.07 AV   PERB                     */00000140
 /*       SIST ENDRET 07/09-82 13.34.19 AV   FARVIK                   */00000150
  /* **************************************************************** */00000160
  /*IDENTIFIKASJON:                                                   */00000170
  /*    R0011603 - PROSEDYRE I PLI                                    */00000180
  /*    PROGRAMMERER: GEIR, SEPTEMBER 1981                            */00000190
  /*HENSIKT:                                                          */00000200
  /*    PROSEDYREN FORETAR KONTROLL AV DATA VEDRØRENDE                */00000210
  /*    OPPHØRSBLANKETT 1.                                            */00000220
  /*PROGRAMTILKNYTNING:                                               */00000230
  /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV                */00000240
  /*    OPPHØRSBLANKETT 1, INCLUDES I R0011601.                       */00000250
  /*BRUK:                                                             */00000260
  /*    CALL KONTROLL_O1                                              */00000270
  /*                                                                  */00000280
 /*ENDRET: 14.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000290
 /* ******                                                            */00000300
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000310
 /*    OM FNR ER ENDRET (R0019906).                                   */00000320
  /* **************************************************************** */00000330
  /*                                                                  */00000340
  /*    MODULEN KONTROLLERER OPPHØRSBLANKETT NR 1 OG RETURNERER       */00000350
  /*    MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG.           */00000360
  /*                                                                  */00000370
  /* **************************************************************** */00000380
 %SKIP(2);                                                              00000390
  KONTROLL_O1:                                                          00000400
    PROC (FEIL_FUNNET);                                                 00000410
    DCL                                                                 00000420
       FEIL_FUNNET     BIT (1),                                         00000430
       HJ_DØDSDATO_DØD PIC '999999',                                    00000440
       HJ_DØDSDATO_D   PIC '99' DEF HJ_DØDSDATO_DØD POS(1),             00000450
       HJ_DØDSDATO_M   PIC '99' DEF HJ_DØDSDATO_DØD POS(3),             00000460
       HJ_DØDSDATO_Å   PIC '99' DEF HJ_DØDSDATO_DØD POS(5),             00000470
       HJ_DØDSDATO_ÅMD PIC '999999',                                    00000480
       DØDSDATO_Å      DEF HJ_DØDSDATO_ÅMD POS(1) PIC '99',             00000490
       DØDSDATO_M      DEF HJ_DØDSDATO_ÅMD POS(3) PIC '99',             00000500
       DØDSDATO_D      DEF HJ_DØDSDATO_ÅMD POS(5) PIC '99',             00000510
       DØDSDATO_DØD_ÅM DEF HJ_DØDSDATO_DØD PIC '9999';                  00000520
   DCL                                                                  00000530
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00000540
      KEY_PEKER                  POINTER,                               00000550
      TK_RECL                    CHAR (101);                            00000560
    DCL                                                                 00000570
       DAGENS_DATO_ÅMD PIC '999999',                                    00000580
       HJ_DATO_MÅ      PIC '9999',                                      00000590
       HJ_DATO_M       DEF HJ_DATO_MÅ POS(1) PIC '99',                  00000600
       HJ_DATO_Å       DEF HJ_DATO_MÅ POS(3) PIC '99';                  00000610
    DCL                                                                 00000620
       1 FNR_REG,                                                       00000630
         2 FNR1         FIXED DEC(11),                                  00000640
         2 FNR2         FIXED DEC(11),                                  00000650
         2 BRUKERID     CHAR     ( 4);                                  00000660
                                                                        00000670
   DCL                                                                  00000680
      W_FNR                                     PIC'(11)9';             00000690
   DCL                                                                  00000700
      1 FNR DEF W_FNR,                                                  00000710
        2 DAG                                   PIC'(2)9',              00000720
        2 MND                                   PIC'(2)9',              00000730
        2 AAR                                   PIC'(2)9',              00000740
        2 ÅRHUNDRE                              PIC'9',                 00000750
        2 REST                                  PIC'(4)9';              00000760
                                                                        00000770
   DCL W_FNR_ÅMD                                PIC'(6)9';     /*NY93*/ 00000780
   DCL W_FNR_1900                               PIC'(1)9';     /*NY93*/ 00000790
                                                                        00000800
                                                                        00000810
       FNR_REG.BRUKERID =  DIV_PARAM_OMR.CICS_IND;                      00000820
       ANT_FEIL_SKREVET =  0;                                           00000830
       KEY_PEKER        =  ADDR(O1.TKNR_DØD);                           00000840
       FEIL_FUNNET      = '0'B;                                         00000850
       DAGENS_DATO_ÅMD  =  DATE();                                      00000860
                                                                        00000870
       IF ^F_NUMERISK(F_FELT_PIC_CHAR11(O1.FNR_DØD)) THEN               00000880
          DO;                                                           00000890
             FEIL_FUNNET  = '1'B;                                       00000900
             O1.FNR_DØDNR = 200;                                        00000910
          END;                                                          00000920
       ELSE                                                             00000930
          IF ^ F_GYLDIG_FNR(O1.FNR_DØD) THEN                            00000940
             DO;                                                        00000950
                FEIL_FUNNET  = '1'B;                                    00000960
                O1.FNR_DØDNR = 1;                                       00000970
             END;                                                       00000980
          ELSE                                                          00000990
             DO;                                                        00001000
                FNR_REG.FNR1 = O1.FNR_DØD;                              00001010
                EXEC CICS LINK PROGRAM ('R0019906') COMMAREA (FNR_REG); 00001020
                IF FNR_REG.FNR2 > 0 THEN                                00001030
                   DO;                                                  00001040
                      O1.FNR_DØDNR   = 203;                             00001050
                      O1.FNR_GML_DØD = O1.FNR_DØD;                      00001060
                      O1.FNR_DØD     = FNR_REG.FNR2;                    00001070
                   END;                                                 00001080
             END;                                                       00001090
                                                                        00001100
       IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(O1.TKNR_DØD)) THEN              00001110
          DO;                                                           00001120
             FEIL_FUNNET   = '1'B;                                      00001130
             O1.TKNR_DØDNR = 200;                                       00001140
          END;                                                          00001150
       ELSE                                                             00001160
          DO;                                                           00001170
                  EXEC CICS HANDLE CONDITION NOTFND(NOTFND);            00001180
                  EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)    00001190
                                               INTO(TK_RECL);           00001200
                  GOTO TKNR_UT;                                         00001210
              NOTFND:                                                   00001220
                  FEIL_FUNNET   = '1'B;                                 00001230
                  O1.TKNR_DØDNR = 3;                                    00001240
                  LEAVE;                                                00001250
              TKNR_UT:                                                  00001260
               DIV_PARAM_OMR.DIV_TKNR = SUBSTR(TK_RECL,1,4);            00001270
          END;                                                          00001280
                                                                        00001290
       IF ^ F_NUMERISK(F_FELT_PIC_CHAR6(O1.DØDSDATO_DØD)) THEN          00001300
          DO;                                                           00001310
             FEIL_FUNNET       = '1'B;                                  00001320
             O1.DØDSDATO_DØDNR = 200;                                   00001330
          END;                                                          00001340
       ELSE                                                             00001350
          IF ^ F_GYLDIG_DATO_DMÅ(O1.DØDSDATO_DØD) THEN                  00001360
             DO;                                                        00001370
                FEIL_FUNNET       = '1'B;                               00001380
                O1.DØDSDATO_DØDNR = 75;                                 00001390
             END;                                                       00001400
                                                                        00001410
       IF ^ F_NUMERISK(F_FELT_PIC_CHAR11(O1.FNR_EK)) THEN               00001420
          DO;                                                           00001430
             FEIL_FUNNET = '1'B;                                        00001440
             O1.FNR_EKNR = 200;                                         00001450
          END;                                                          00001460
       ELSE                                                             00001470
          IF O1.FNR_EK > 0 THEN                                         00001480
             DO;                                                        00001490
                IF ^ F_GYLDIG_FNR(O1.FNR_EK) THEN                       00001500
                   DO;                                                  00001510
                      FEIL_FUNNET = '1'B;                               00001520
                      O1.FNR_EKNR = 15;                                 00001530
                   END;                                                 00001540
                ELSE                                                    00001550
                   DO;                                                  00001560
                      FNR_REG.FNR1 = O1.FNR_EK;                         00001570
                      EXEC CICS LINK PROGRAM ('R0019906')               00001580
                                                     COMMAREA (FNR_REG);00001590
                      IF FNR_REG.FNR2 > 0 THEN                          00001600
                         DO;                                            00001610
                            O1.FNR_EKNR = 203;                          00001620
                            O1.FNR_GML_EK = O1.FNR_EK;                  00001630
                            O1.FNR_EK = FNR_REG.FNR2;                   00001640
                         END;                                           00001650
                   END;                                                 00001660
                IF ^ F_NUMERISK(F_FELT_PIC_CHAR5(O1.PI_DØD)) THEN       00001670
                   DO;                                                  00001680
                      FEIL_FUNNET = '1'B;                               00001690
                      O1.PI_DØDNR = 200;                                00001700
                   END;                                                 00001710
             END;                                                       00001720
                                                                        00001730
    /* IF O1.FNR_EK > 0 & F_KJØNN(O1.FNR_DØD)                           00001740
                              = F_KJØNN(O1.FNR_EK) THEN                 00001750
          DO;                                                           00001760
              FEIL_FUNNET  = '1'B;                                      00001770
              O1.FNR_DØDNR     = 16;                                    00001780
              O1.FNR_EKNR = 999;                                        00001790
          END; */                                                       00001800
 %SKIP(3);                /*   */                                       00001810
 /*  HER SETTES VERDIER INN I TRANS.OPPL.OMR                         */ 00001820
                                                                        00001830
     FØDSNUMMER      = O1.FNR_DØD;                                      00001840
     HJ_DØDSDATO_DØD = O1.DØDSDATO_DØD;                                 00001850
     HJ_DATO_Å       = HJ_DØDSDATO_Å;                                   00001860
     HJ_DATO_M       = HJ_DØDSDATO_M;                                   00001870
                                                                        00001880
 /*LOVENDRING 1.1.91 - HL : */                                          00001890
                                                                        00001900
     IF HJ_DATO_Å > 90 THEN                                             00001910
        IF HJ_DATO_M = 12     THEN                                      00001920
           DO;                                                          00001930
              HJ_DATO_Å = HJ_DATO_Å + 1;                                00001940
              HJ_DATO_M = 1;                                            00001950
           END;                                                         00001960
        ELSE                                                            00001970
           HJ_DATO_M = HJ_DATO_M + 1;                                   00001980
                                                                        00001990
     VIRKNINGSDATO   = HJ_DATO_MÅ;                                      00002000
 /*      KRYSSKONTROLLER                                             */ 00002010
                                                                        00002020
     IF ^FEIL_FUNNET THEN                                               00002030
        DO;                                                             00002040
           HJ_DØDSDATO_DØD     = O1.DØDSDATO_DØD;                       00002050
           DØDSDATO_D          = HJ_DØDSDATO_D;                         00002060
           DØDSDATO_M          = HJ_DØDSDATO_M;                         00002070
           DØDSDATO_Å          = HJ_DØDSDATO_Å;                         00002080
           W_FNR     = O1.FNR_DØD;                       /*NY93*/       00002090
           W_FNR_ÅMD = FNR.AAR!!FNR.MND!!FNR.DAG;        /*NY93*/       00002100
           W_FNR_1900 = FNR.ÅRHUNDRE;                   /*NY93*/        00002110
           IF HJ_DØDSDATO_ÅMD >= DAGENS_DATO_ÅMD THEN                   00002120
              DO;                                                       00002130
                 FEIL_FUNNET       = '1'B;                              00002140
                 O1.DØDSDATO_DØDNR = 76;                                00002150
              END;                                                      00002160
           /* DØDSDATO IKKE MINDRE ENN FØDSELSDATO JD 8.2.93*/          00002170
           IF HJ_DØDSDATO_ÅMD <  W_FNR_ÅMD &                            00002180
              W_FNR_1900      <  5          THEN                        00002190
              DO;                                                       00002200
                 FEIL_FUNNET       = '1'B;                              00002210
                 O1.DØDSDATO_DØDNR = 75;                                00002220
              END;                                                      00002230
        END;                                                            00002240
  END KONTROLL_O1;                                                      00002250
