 /*       SIST ENDRET 22/06-98 13.38.37 AV   JDA7339                  */00000000
 /*       SIST ENDRET 22/06-98 13.36.53 AV   JDA7339                  */00000010
 /*       SIST ENDRET 28/09-94 12.19.47 AV   JDA0310                  */00000020
 /*       SIST ENDRET 09/03-93 15.09.31 AV   TRUDE                    */00000030
 /*       SIST ENDRET 21/07-92 11.25.34 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 05/06-92 12.13.15 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 10/01-92 14.34.54 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 13/12-91 12.24.55 AV   DYBVIK                   */00000070
 /* ***************************************************************** */00000080
 /*IDENTIFIKASJON:                                                    */00000090
 /*    R0014243 - PROSEDYRE I PLI.                                    */00000100
 /*    PROGRAMMERER: TRUDE, SEPT 1991                                 */00000110
 /*HENSIKT:                                                           */00000120
 /*    RUTINEN OPPDATERER AP_GP_NETTO,AP_TP_NETTO,                    */00000130
 /*                       SÆRTILLEGG OG KOMPTILLEGG                   */00000140
 /*                       GT_TILLEGG_LOV92                            */00000150
 /*       KAN NULLSTILLE  GT_LOV92                                    */00000160
 /*    ALDERSP.GP/TP/ST ER NETTO PENSJONSBELØP                        */00000170
 /*PROGRAMTILKNYTNING:                                                */00000180
 /*    PROGRAMMET BLIR INKLUDERT I                                    */00000190
 /*BRUK:                                                              */00000200
 /*    CALL AP_JUSTER_MED_FORVENTET_INNTEKT;                          */00000210
 /* ***************************************************************** */00000220
                                                                        00000230
 JUSTER_AE_MED_F: PROC(KT,AP_TEI);                                      00000240
                                                                        00000250
                                                                        00000260
    DCL KT  DEC FIXED (3),                                              00000270
        AP_TEI DEC FIXED (7);                                           00000280
    DCL                                                                 00000290
       I             FIXED BIN(15)    INIT (0),                         00000300
       W_BRUTTO_AP   DEC FIXED(7)     INIT (0),                         00000310
       W_BRUTTO_GP   DEC FIXED(5)     INIT (0),                         00000320
       W_BRUTTO_TP   DEC FIXED(5)     INIT (0),                         00000330
       W_BRUTTO_TP_EP   DEC FIXED(7)     INIT (0),                      00000340
       W_BRUTTO_ST   DEC FIXED(5)     INIT (0),                         00000350
       W_BRUTTO_GT   DEC FIXED(7)     INIT (0),                         00000360
       W_SUM_TP      DEC FIXED(7)     INIT (0),                         00000370
       FRADRAG_F     DEC FIXED(7)     INIT (0),                         00000380
       G_HALVE       DEC FIXED(7)     INIT (0),                         00000390
       W_NETTO_AP    DEC FIXED(7)     INIT (0),                         00000400
       W_KT_FRADRAG  DEC FIXED(3)     INIT (0),                         00000410
       W_ST_FRADRAG  DEC FIXED(5)     INIT (0),                         00000420
       REST_FRADRAG  DEC FIXED(5)     INIT (0),                         00000430
       W_GP_FRADRAG  DEC FIXED(5)     INIT (0),                         00000440
       W_TEI         DEC FIXED(7)     INIT (0),                         00000450
       EP_SUM_YTELSE DEC FIXED(7)     INIT (0),                         00000460
       W_ETTER92     DEC FIXED(7)     INIT (0),                         00000470
       W_KT          DEC FIXED(3)     INIT (0);                         00000480
                                                                        00000490
    DCL KODE         CHAR (1) INIT (' ');                               00000500
                                                                        00000510
    DCL ROUND        BUILTIN;                                           00000520
                                                                        00000530
    W_KT    = KT;                                                       00000540
    W_TEI   = AP_TEI;                                                   00000550
    FRADRAG_F = (B02.FAI(BER_SØ_IND) * 100);                            00000560
    G_HALVE   = G / 2;                                                  00000570
                                                                        00000580
   IF FRADRAG_F  ^> G THEN                                              00000590
    DO;                                                                 00000600
      B02.AP_GP_NETTO(BER_SØ_IND)   = B02.ALDERSP.GP(BER_SØ_IND);       00000610
      B02.AP_TP_NETTO(BER_SØ_IND)   = B02.ALDERSP.TP(BER_SØ_IND);       00000620
      B02.TP_NETTO(BER_SØ_IND)      = B02.TP_BRUTTO (BER_SØ_IND);       00000630
      B02.ALDERSP.KT(BER_SØ_IND)    = W_KT;                             00000640
      IF B02.GT_LOV92(BER_SØ_IND)   > 0          THEN                   00000650
         DO;                                                            00000660
            B02.GT_TILLEGG_LOV92(BER_SØ_IND) = B02.GT_LOV92(BER_SØ_IND) 00000670
                                       -  B02.AP_TP_NETTO(BER_SØ_IND)   00000680
                                       -  B02.TP_NETTO(BER_SØ_IND)      00000690
                                       -  B02.ALDERSP.ST(BER_SØ_IND);   00000700
                                                                        00000710
            IF B02.GT_TILLEGG_LOV92(BER_SØ_IND) < 0    THEN             00000720
               DO;                                                      00000730
                  B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                 00000740
                  B02.GT_LOV92(BER_SØ_IND)         = 0;                 00000750
               END;                                                     00000760
         END;                                                           00000770
      ELSE                                                              00000780
         B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                          00000790
    END;                                                                00000800
  ELSE                                                                  00000810
    DO;                                                                 00000820
 /*    FRADRAG_F = FRADRAG_F - G_HALVE;             */                  00000830
       FRADRAG_F = FRADRAG_F - G;                /*9806*/               00000840
       FRADRAG_F = ( FRADRAG_F * 0.4) / 12;                             00000850
   /******* DIV_PARAM_OMR.FULLT_SÆRTILLEGG  = W_ST;??******/            00000860
   /******* DIV_PARAM_OMR.FULLT_SÆRTILLEGG MÅ BRUKES 03.93 TRUDE*/      00000870
                                                                        00000880
    W_BRUTTO_GP    =  B02.ALDERSP.GP(BER_SØ_IND);                       00000890
    W_BRUTTO_TP    =  B02.ALDERSP.TP(BER_SØ_IND);                       00000900
    W_BRUTTO_TP_EP    =  B02.TP_BRUTTO(BER_SØ_IND);                     00000910
  /*W_BRUTTO_ST    =  B02.ALDERSP.ST(BER_SØ_IND) KUN NETTO ST*/         00000920
    W_BRUTTO_ST    =  DIV_PARAM_OMR.FULLT_SÆRTILLEGG(BER_SØ_IND);       00000930
    W_ETTER92     =  W_BRUTTO_TP + W_BRUTTO_ST + W_BRUTTO_TP_EP;        00000940
                                                                        00000950
    IF B02.GT_LOV92(BER_SØ_IND)  > W_ETTER92    THEN                    00000960
       W_BRUTTO_GT  = B02.GT_LOV92(BER_SØ_IND) - W_ETTER92;             00000970
                                                                        00000980
    W_BRUTTO_AP    = W_BRUTTO_GP + W_BRUTTO_TP + W_BRUTTO_ST +          00000990
                     B02.TP_BRUTTO(BER_SØ_IND) + W_KT                   00001000
                     + W_BRUTTO_GT;                                     00001010
                                                                        00001020
    IF FRADRAG_F > W_BRUTTO_AP  THEN                                    00001030
             DO;                                                        00001040
                B02.AP_GP_NETTO           (BER_SØ_IND)    = 0;          00001050
                B02.AP_TP_NETTO           (BER_SØ_IND)    = 0;          00001060
                B02.TP_NETTO              (BER_SØ_IND)    = 0;          00001070
                B02.ALDERSP.ST            (BER_SØ_IND)    = 0;          00001080
                B02.ALDERSP.KT            (BER_SØ_IND)    = 0;          00001090
                B02.GT_TILLEGG_LOV92      (BER_SØ_IND)    = 0;          00001100
                                                                        00001110
             END;                                                       00001120
    ELSE                                                                00001130
        DO;                                                             00001140
 /* ***************************************************************** */00001150
 /* FRADRAGET ER MINDRE ENN GP + TP + ST                              */00001160
 /* ***************************************************************** */00001170
                                                                        00001180
                W_NETTO_AP            = W_BRUTTO_AP - FRADRAG_F;        00001190
                                                                        00001200
                AP_GP               = ROUND(                            00001210
                                   B02.ALDERSP.GP(BER_SØ_IND) *         00001220
                                   W_NETTO_AP / W_BRUTTO_AP , 0);       00001230
                REST_FRADRAG =                                          00001240
                         FRADRAG_F - B02.ALDERSP.GP(BER_SØ_IND)         00001250
                                   + AP_GP;                             00001260
                                                                        00001270
                IF  B02.TP_BRUTTO(BER_SØ_IND)  > 0 THEN                 00001280
                  DO;                                                   00001290
                     EP_TP              = ROUND(                        00001300
                                        B02.TP_BRUTTO(BER_SØ_IND) *     00001310
                                        W_NETTO_AP / W_BRUTTO_AP , 0);  00001320
                     REST_FRADRAG = REST_FRADRAG -                      00001330
                                    B02.TP_BRUTTO(BER_SØ_IND) +         00001340
                                    EP_TP;                              00001350
                  END;                                                  00001360
                                                                        00001370
                IF  W_BRUTTO_GT  > 0 THEN                               00001380
                  DO;                                                   00001390
                     AP_GT             = ROUND(                         00001400
                                        W_BRUTTO_GT *                   00001410
                                        W_NETTO_AP / W_BRUTTO_AP , 0);  00001420
                     REST_FRADRAG = REST_FRADRAG -                      00001430
                                    W_BRUTTO_GT +                       00001440
                                    AP_GT;                              00001450
                  END;                                                  00001460
                                                                        00001470
                IF  W_BRUTTO_TP  > 0 THEN                               00001480
                  DO;                                                   00001490
                    IF G > 35500   THEN                                 00001500
                      DO;                                               00001510
                        IF B02.ALDERSP.ST(BER_SØ_IND)  = 0 THEN         00001520
                           AP_TP  = W_BRUTTO_TP - REST_FRADRAG;         00001530
                        ELSE                                            00001540
                          DO;                                           00001550
                            AP_TP             = ROUND(                  00001560
                                                W_BRUTTO_TP *           00001570
                                         W_NETTO_AP / W_BRUTTO_AP , 0); 00001580
                           REST_FRADRAG = REST_FRADRAG -                00001590
                                          W_BRUTTO_TP +                 00001600
                                          AP_TP;                        00001610
                          END;                                          00001620
                      END;                                              00001630
                    ELSE                                                00001640
                      DO;                                               00001650
                        AP_TP          = ROUND(                         00001660
                                         W_BRUTTO_TP *                  00001670
                                         W_NETTO_AP / W_BRUTTO_AP , 0); 00001680
                        REST_FRADRAG = REST_FRADRAG -                   00001690
                                       W_BRUTTO_TP +                    00001700
                                       AP_TP;                           00001710
                      END;                                              00001720
                  END;                                                  00001730
                                                                        00001740
                IF  W_BRUTTO_ST  > 0 THEN                               00001750
                  DO;                                                   00001760
                    IF W_KT = 0 THEN                                    00001770
                      AP_ST       = W_BRUTTO_ST - REST_FRADRAG;         00001780
                    ELSE                                                00001790
                      DO;                                               00001800
                        AP_ST          = ROUND(                         00001810
                                         W_BRUTTO_ST *                  00001820
                                         W_NETTO_AP / W_BRUTTO_AP , 0); 00001830
                        REST_FRADRAG = REST_FRADRAG -                   00001840
                                       W_BRUTTO_ST +                    00001850
                                       AP_ST;                           00001860
                      END;                                              00001870
                  END;                                                  00001880
                                                                        00001890
                IF W_KT > REST_FRADRAG             THEN                 00001900
                   AP_KT = W_KT - REST_FRADRAG;                         00001910
                ELSE                                                    00001920
                   AP_KT = 0;                                           00001930
        END;                                                            00001940
      EP_SUM_YTELSE = AP_GP + AP_TP + EP_TP + AP_ST + AP_KT + AP_GT;    00001950
      IF W_SUM_YTELSE < EP_SUM_YTELSE THEN                              00001960
        DO;                                                             00001970
          IF EP_SUM_YTELSE  < 10 THEN  /*OK IFL. P.JESPERSEN 271191*/   00001980
           DO;                                                          00001990
               B02.AP_GP_NETTO(BER_SØ_IND) = 0;                         00002000
               B02.AP_TP_NETTO(BER_SØ_IND) = 0;                         00002010
               B02.TP_NETTO(BER_SØ_IND) = 0;                            00002020
               B02.ALDERSP.ST(BER_SØ_IND) = 0;                          00002030
               B02.ALDERSP.KT(BER_SØ_IND) = 0;                          00002040
               B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                    00002050
           END;                                                         00002060
          ELSE                                                          00002070
           DO;                                                          00002080
               B02.AP_GP_NETTO(BER_SØ_IND) = AP_GP;                     00002090
               B02.AP_TP_NETTO(BER_SØ_IND) = AP_TP;                     00002100
               B02.TP_NETTO(BER_SØ_IND) = EP_TP;                        00002110
               B02.ALDERSP.ST(BER_SØ_IND) = AP_ST;                      00002120
               B02.ALDERSP.KT(BER_SØ_IND) = AP_KT;                      00002130
               B02.GT_TILLEGG_LOV92(BER_SØ_IND) = AP_GT;                00002140
           END;                                                         00002150
           DIV_PARAM_OMR.AP_KODE_AEY(BER_SØ_IND) = 'E';                 00002160
        END;                                                            00002170
                                                                        00002180
    END;                                                                00002190
                                                                        00002200
    B02.UTTAKS_APD(BER_SØ_IND)   = 000; /* 999 ØNSKE FRA NORTRYGD*/     00002210
    B02.APD(BER_SØ_IND)          = 000; /* 999 ØNSKE FRA NORTRYGD*/     00002220
                                                                        00002230
    /* TRUDE 210792 : */                                                00002240
    IF B02.ALDERSP.UTTAKSDATO_ÅM(BER_SØ_IND) = 0 THEN                   00002250
       B02.ALDERSP.UTTAKSDATO_ÅM(BER_SØ_IND) =                          00002260
                                B02.VIRK_DATO_ÅM(BER_SØ_IND);           00002270
                                                                        00002280
 RETUR:                                                                 00002290
 END JUSTER_AE_MED_F;                                                   00002300
