 /*       SIST ENDRET 08/02-96 14.27.25 AV   JDA0310                  */00000000
 /*       SIST ENDRET 06/09-95 10.29.39 AV   JDA0310                  */00000010
 /*       SIST ENDRET 10/05-94 13.24.57 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 06/04-94 14.55.12 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 25/09-92 12.21.09 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 16/10-90 12.43.43 AV   DYBVIK                   */00000050
 /* ------------------------------------------------------------------*/00000060
 /* SIST ENDRET 28/9-90 AV TUYEN                                      */00000070
 /*    REGISTRERING AV FORELØPIG INNTEKT.                             */00000080
 /* ------------------------------------------------------------------*/00000090
 /*       SIST ENDRET 06/09-90 14.34.47 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 27/08-90 12.56.57 AV   DYBVIK                   */00000110
 /*  -----------------------------------------------------------------*/00000120
 /*  SIST ENDRET 6/5-94 AV OLAV                                       */00000130
 /*    HVIS W02_INNT_TYPE = 'J','K' ELLER 'L'                         */00000140
 /*    SÅ AVSLUTTES IKKE 'TASKEN  (V/SAMME INNTEKT OG KOMMUNENR).     */00000150
 /*  ---------------------------------------------------------------- */00000160
 /*  -----------------------------------------------------------------*/00000170
 /*  SIST ENDRET 6/9-90 AV TUYEN                                      */00000180
 /*    KORREKSJON AV INNTEKT PÅ SAMME INNTEKTTYPE OG ÅR MEN ULIKE     */00000190
 /*    KOMMUNE GODTAS MEN MED EN ADVARSEL.                            */00000200
 /*  ---------------------------------------------------------------- */00000210
 /*  SIST ENDRET 10/1-90 AV   TUYEN                                   */00000220
 /*    1. KONTROLL-LISTA VISER GAMMEL REG. DATO ISTEDENFOR            */00000230
 /*       DAGENS DATO (FOR 'FJERNING VED KORRIGERING').               */00000240
 /*    2. DERSOM DEN NYE REGISTRERINGEN ER HELT LIK DET SOM STÅR INNE */00000250
 /*       FRA FØR, KOMMER DET EN MELDING OM DETTE.                    */00000260
 /*  ---------------------------------------------------------------  */00000270
 /*  SIST ENDRET 20/11-89 AV   TUYEN                                  */00000280
 /*    1. FOR FØRSTE GANG REGISTRERING OG KORREKSJON:                 */00000290
 /*          DERSOM DET LIGGER I BASEN EN INNTEKT SOM ER LIK DET      */00000300
 /*          REGISTRERTE INNTEKT OG KOMMUNENR ER LIKE MEN             */00000310
 /*          INNTEKT-TYPE ER ULIKE:                                   */00000320
 /*          - SLIK GODTAS DET IDAG                                   */00000330
 /*          - NÅ ENDRES DET S.A. REGISTRERING AVVISES                */00000340
 /*                                                                   */00000350
 /*          FOR REC_ART B (INNTEKT-TYPE B, C, D) VIL REGISTRERINGEN  */00000360
 /*          GODTAS MEN MED EN ADVARSEL.                              */00000370
 /*                                                                   */00000380
 /*  ---------------------------------------------------------------  */00000390
 /*       SIST ENDRET 28/10-87 14.55.17 AV   DYBVIK                   */00000400
 /*       SIST ENDRET 21/07-87 08.18.05 AV   DYBVIK                   */00000410
 /*       SIST ENDRET 05/06-87 13.06.16 AV   DYBVIK                   */00000420
 /*       SIST ENDRET 19/05-87 10.31.23 AV   DYBVIK                   */00000430
 /*       SIST ENDRET 02/12-86 13.24.35 AV   DYBVIK                   */00000440
 /*       SIST ENDRET 03/03-86 13.39.49 AV   FARVIK                   */00000450
 /*       SIST ENDRET 06/02-86 15.11.21 AV   FARVIK                   */00000460
 /*       SIST ENDRET 16/12-85 07.45.42 AV   FARVIK                   */00000470
 /*       SIST ENDRET 19/11-85 16.00.31 AV   FARVIK                   */00000480
 /*       SIST ENDRET 27/08-85 13.00.22 AV   FARVIK                   */00000490
                                                                        00000500
 /* ***************************************************************** */00000510
 /*                                                                   */00000520
 /*  PROGRAMMET FORTAR REGISTRERING AV NYE INNTEKTER.                 */00000530
 /*                                                                   */00000540
 /*  PROGRAMMERER ROLF FARVIK, DATA-UTVIKLING A/S ,   JULI 1983       */00000550
 /* ***************************************************************** */00000560
 /* ENDRET 29.01.85 AV SVERRE LUNDEBY FRA DATA-UTVIKLING A/S.         */00000570
 /* ---------------                                                   */00000580
 /*    LEGGER UT DATA TIL NORTRYGD. TKNR FINNES VED 1. OG SJEKKE OM   */00000590
 /*    DET FINNES I ROT-SEGM. ER RF0PERSN.TKNR = 0 BRUKES KOMMNR. I   */00000600
 /*    SISTE INNTEKTS-SEGM.                                           */00000610
 /* ***************************************************************** */00000620
                                                                        00000630
 R001I50:                                                               00000640
   PROC (COMMAREA_PEKER) OPTIONS(MAIN);                                 00000650
                                                                        00000660
 %PAGE;                                                                 00000670
      %INCLUDE S001I4;     /*  INNTEKTMAPSET4    (BASED) */             00000680
                                                                        00000690
 %PAGE;                                                                 00000700
      %INCLUDE P001I401;   /*  TRANS_OMR          (BASED) */            00000710
 %PAGE;                                                                 00000720
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */            00000730
 %PAGE;                                                                 00000740
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                    00000750
 %PAGE;                                                                 00000760
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */               00000770
 %PAGE;                                                                 00000780
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */              00000790
 %PAGE;                                                                 00000800
 %SKIP(1);                                                              00000810
                                                                        00000820
  DCL FNR_PIC                    PIC '(11)9'  INIT ( 0 )   ;            00000830
  DCL FNR_CHAR                   CHAR (11)    DEF FNR_PIC  ;            00000840
  DCL FNR_ÅRH                    PIC '9'      DEF FNR_PIC  POS(7);      00000850
  DCL FNR_ÅR                     PIC '99'     DEF FNR_PIC  POS(5);      00000860
  DCL ÅR_PIC                     PIC '(2)9'   INIT ( 0 )   ;            00000870
  DCL INNT_ALDER                 PIC '(2)9'                ;            00000880
  DCL INNT_MÅ                    PIC '(4)9'                ;            00000890
  DCL FEILTYPE                   PIC '(1)9'                ;            00000900
  DCL ÅR_CHAR                    CHAR (2)     DEF ÅR_PIC   ;            00000910
  DCL FATAL_FEIL                 BIT  (1)     INIT ('0'B)  ;            00000920
  DCL ROT_IKKE_FUNNET            BIT  (1)     INIT ('0'B)  ;            00000930
  DCL IKKE_FUNNET                BIT  (1)     INIT ('0'B)  ;            00000940
  DCL ANT_X                      FIXED DEC(9) INIT (0)     ;            00000950
  DCL FEIL                       CHAR(2)       ;                        00000960
  DCL TEKST                      CHAR(10)      ;                        00000970
  DCL ÅR_DAGNR_CHAR              CHAR(6)       ;                        00000980
  DCL ÅR_DAGNR_NUM DEF ÅR_DAGNR_CHAR PIC '(5)9';                        00000990
  DCL DATO_NUM                   PIC '(6)9'    ;                        00001000
  DCL DATO_CHAR DEF DATO_NUM     CHAR(6)       ;                        00001010
                                                                        00001020
   DCL                                                                  00001030
       MAP_MELDING              CHAR(78)      INIT((78)' '),            00001040
       1  FEIL_STRUC,                                                   00001050
          2  FEIL_NR               FIXED DEC(5),                        00001060
          2  FEIL_MELDING          CHAR     (78),                       00001070
          2  KOM_OMR_PEKER         POINTER;                             00001080
    %PAGE;                                                              00001090
    /* ************************************************************** */00001100
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00001110
    /* ************************************************************** */00001120
                                                                        00001130
       DCL                                                              00001140
      (TIME,DATE ,ADDR , CSTG , LOW , STG , SUBSTR ,ONCODE)  BUILTIN;   00001150
       DCL                                                              00001160
         PLITDLI ENTRY,                                                 00001170
              BMSMAPBR  PTR;                                            00001180
                                                                        00001190
    /* ************************************************************** */00001200
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00001210
    /* ************************************************************** */00001220
                                                                        00001230
    %INCLUDE DLIUIB;                                                    00001240
                                                                        00001250
       DCL                                                              00001260
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00001270
                                                                        00001280
       DCL                                                              00001290
         ( COMMAREA_PEKER , W01_HJELPE_PEKER , TRANS_SEGM_PEKER )       00001300
                                               POINTER;                 00001310
                                                                        00001320
    /* ************************************************************** */00001330
    /*   ROT_SEGMENT.                                                 */00001340
    /* ************************************************************** */00001350
                                                                        00001360
       DCL 1  RF0PERSN               UNALIGNED,                         00001370
       %INCLUDE P0019927;                                               00001380
                                                                        00001390
    /* ************************************************************** */00001400
    /*   STATUS-SEGMENTET                                             */00001410
    /* ************************************************************** */00001420
                                                                        00001430
       DCL 1  W01_STATUS             UNALIGNED,                         00001440
       %INCLUDE P0019930;                                               00001450
                                                                        00001460
    /* ************************************************************** */00001470
    /*   INNTEKT-SEGMENTET                                            */00001480
    /* ************************************************************** */00001490
                                                                        00001500
       DCL 1  W01_PINT               UNALIGNED,                         00001510
       %INCLUDE P0019928;                                               00001520
                                                                        00001530
    /* ************************************************************** */00001540
    /*   DIV HJELPEFELT.                                              */00001550
    /* ************************************************************** */00001560
                                                                        00001570
       DCL 1  W01,                                                      00001580
              2   W02_INNT_TYPE               CHAR ( 1),                00001590
              2   W02_DAGENS_DATO       FIXED DEC  ( 6),                00001600
              2   FNR                   FIXED DEC  (11) INIT ( 0  ),    00001610
              2   TKNR                  FIXED DEC  ( 4) INIT ( 0  ),    00001620
              2   MER_DATA                    BIT  ( 1) INIT ('0'B),    00001630
              2   TIDL_FFU                    BIT  ( 1) INIT ('0'B);    00001640
                                                                        00001650
    /* ************************************************************** */00001660
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00001670
    /* ************************************************************** */00001680
                                                                        00001690
       DCL 1  W01_DLI_PARAM,                                            00001700
              2   W02_GET                 CHAR (4)   INIT ('    '),     00001710
              2   W02_GHU                 CHAR (4)   INIT('GHU '),      00001720
              2   W02_DLET                CHAR (4)   INIT('DLET'),      00001730
              2   W02_ISRT                CHAR (4)   INIT('ISRT'),      00001740
              2   W02_REPL                CHAR (4)   INIT('REPL'),      00001750
              2   W02_GU                  CHAR (4)   INIT ('GU  '),     00001760
              2   W02_GN                  CHAR (4)   INIT ('GN  '),     00001770
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),     00001780
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00001790
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00001800
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),          00001810
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');  00001820
                                                                        00001830
       DCL    W01_IO                CHAR (150)       INIT ( (150) ' ' );00001840
                                                                        00001850
    /* ************************************************************** */00001860
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00001870
    /* ************************************************************** */00001880
                                                                        00001890
       DCL    SSA_UQUAL_ROT        STATIC CHAR ( 9) INIT('RF0PERSN ')  ;00001900
                                                                        00001910
       DCL 1  SSA_UQUAL_PINNTEKT   STATIC CHAR ( 9) INIT('PINNTEKT ')  ;00001920
                                                                        00001930
       DCL 1  SSA_UQUAL_PINNTEKT_L STATIC CHAR (11) INIT('PINNTEKT*L ');00001940
                                                                        00001950
                                                                        00001960
       DCL 1  SSA1_RF0PERSN          UNALIGNED,                         00001970
              2    HDEL                       CHAR (17)  INIT           00001980
                   ('RF0PERSN(FNR     '),                               00001990
              2    REL_OP                     CHAR (2)   INIT (' ='),   00002000
              2    PKEY               FIXED   DEC  (11),                00002010
              2    HP                         CHAR (1)   INIT (')');    00002020
                                                                        00002030
                                                                        00002040
       DCL 1  SSA1_STATUS            UNALIGNED,                         00002050
              2    HDEL                       CHAR (17)  INIT           00002060
                   ('STATUS  (STATKODE'),                               00002070
              2    REL_OP                     CHAR (2)   INIT (' ='),   00002080
              2    STATKODE                   CHAR (1)   INIT ('S'),    00002090
              2    HP                         CHAR (1)   INIT (')');    00002100
                                                                        00002110
                                                                        00002120
                                                                        00002130
       DCL 1  SSA1_PINNTEKT          UNALIGNED,                         00002140
              2    HDEL                       CHAR (17)  INIT           00002150
                   ('PINNTEKT(INNTÅRTY'),                               00002160
              2    REL_OP                     CHAR (2)   INIT (' ='),   00002170
              2    ÅR                 FIXED   DEC  (2),                 00002180
              2    TYPE                       CHAR (1),                 00002190
              2    HP                         CHAR (1)   INIT (')');    00002200
                                                                        00002210
                                                                        00002220
                                                                        00002230
                                                                        00002240
       DCL 1  SSA2_PINNTEKT          UNALIGNED,                         00002250
              2    HDEL                       CHAR (17)  INIT           00002260
                   ('PINNTEKT(INNTÅR  '),                               00002270
              2    REL_OP1                    CHAR (2)   INIT (' ='),   00002280
              2    ÅR                 FIXED   DEC  (2),                 00002290
              2    KONKAT                     CHAR (1)   INIT('&'),     00002300
              2    UDEL                       CHAR (8)   INIT           00002310
                   ('INNTTYPE'),                                        00002320
              2    REL_OP2                    CHAR (2)   INIT (' ='),   00002330
              2    TYPE                       CHAR (1),                 00002340
              2    HP                         CHAR (1)   INIT (')');    00002350
                                                                        00002360
 /* TILLEGG 08.12.89 AV TUYEN */                                        00002370
                                                                        00002380
       DCL 1  SSA3_PINNTEKT          UNALIGNED,                         00002390
              2    HDEL1                      CHAR (17)  INIT           00002400
                   ('PINNTEKT(INNTÅRTY'),                               00002410
              2    REL_OP1                    CHAR (2)   INIT ('=>'),   00002420
              2    ÅR1                FIXED   DEC  (2),                 00002430
              2    TYPE1                      CHAR (1),                 00002440
              2    KONKAT                     CHAR (1)   INIT ('&') ,   00002450
              2    HDEL2                      CHAR (8)   INIT           00002460
                   ('INNTÅRTY'),                                        00002470
              2    REL_OP2                    CHAR (2)   INIT ('<='),   00002480
              2    ÅR2                FIXED   DEC  (2),                 00002490
              2    TYPE2                      CHAR (1),                 00002500
              2    HP                         CHAR (1)   INIT (')');    00002510
                                                                        00002520
 /* TILLEGG 1/10-90 AV TUYEN */                                         00002530
                                                                        00002540
       DCL 1  SSA4_PINNTEKT          UNALIGNED,                         00002550
              2    HDEL                       CHAR (17)  INIT           00002560
                   ('PINNTEKT(INNTÅR  '),                               00002570
              2    REL_OP                     CHAR (2)   INIT (' ='),   00002580
              2    ÅR                 FIXED   DEC  (2),                 00002590
              2    HP                         CHAR (1)   INIT (')');    00002600
                                                                        00002610
 /* TIL HIT */                                                          00002620
                                                                        00002630
    /* ************************************************************** */00002640
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00002650
    /* ************************************************************** */00002660
                                                                        00002670
    %PAGE;                                                              00002680
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00002690
    %PAGE;                                                              00002700
                                                                        00002710
    /* DCL 1  B01              BASED (B01_PEKER),                       00002720
    %INCLUDE P0019921;                */       /* B01_OMR (BASED)     */00002730
                                                                        00002740
                                                                        00002750
    %PAGE;                                                              00002760
    /* DCL 1  B02              BASED (B02_PEKER),                       00002770
    %INCLUDE P0019921;                  */     /* B02_OMR (BASED)     */00002780
                                                                        00002790
    %PAGE;                                                              00002800
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                   00002810
    %INCLUDE P0012003;                         /* PCB                 */00002820
                                                                        00002830
                                                                        00002840
    %PAGE;                                                              00002850
                                                                        00002860
    /* ************************************************************** */00002870
    /*                                                                */00002880
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00002890
    /*     ---------------------------------------------------        */00002900
    /*                                                                */00002910
    /*                                                                */00002920
    /*      INITIERING AV PARAMETRE TIL DIV OMR.     .                */00002930
    /*                                                                */00002940
    /*                                                                */00002950
    /* ************************************************************** */00002960
                                                                        00002970
  PROGRAM_ID            = 'R001I501'                   ;                00002980
                                                                        00002990
                                                                        00003000
  DB_STATUS_KODE        = '  '                         ;                00003010
  FEIL_MELD_NR          = 0                            ;                00003020
  DATO_CHAR             = DATE                         ;                00003030
  UIBPTR                = PCB_UIB_PEKER_OMR.UIB_PEKER  ;                00003040
                                                                        00003050
                                                                        00003060
                                                                        00003070
  DO  I = 8 TO 14 WHILE(NIS.ÅR(I) > 0 & FEIL_MELD_NR = 0);              00003080
                                                                        00003090
      CALL BEREGN_INNT_TYPE(                                            00003100
                 NIS.TYPE(I),NIS.ART(I),W02_INNT_TYPE);                 00003110
                                                                        00003120
      SSA1_RF0PERSN.PKEY               =     NISF.FNR ;                 00003130
      SEARCH_FNR                       = NISF.FNR;                      00003140
      ROT_IKKE_FUNNET                  =     '0'B     ;                 00003150
      IKKE_FUNNET                      =     '0'B     ;                 00003160
                                                                        00003170
      CALL P05_SJEKK_OM_DØD;                                            00003180
                                                                        00003190
      IF FEIL_MELD_NR > 0 THEN                                          00003200
         GOTO L999;                                                     00003210
                                                                        00003220
      CALL P10_BEHANDLE_PINNTEKT;                                       00003230
                                                                        00003240
      IF FEIL_MELD_NR > 0 THEN                                          00003250
         GOTO L999;                                                     00003260
                                                                        00003270
      IF FEILTYPE    > 0 THEN                                           00003280
         GOTO FORTSETT;                                                 00003290
                                                                        00003300
      IF NIS.TYPE(I) = 'S' !                                            00003310
         NIS.TYPE(I) = 'D' !                                            00003320
         (NIS.TYPE(I) = 'B' & (NIS.MERKE(I) = 1 ! NIS.MERKE(I) = 5)) !  00003330
         (NIS.TYPE(I) = 'C' &  NIS.KOMMNR(I) > 2500) THEN               00003340
         DO;                                                            00003350
            CALL P30_SKRIV_KEYFIL;                                      00003360
            IF FEIL_MELD_NR > 0 THEN                                    00003370
               GOTO L999;                                               00003380
         END;                                                           00003390
                                                                        00003400
  /***** O M R E G N I N G   P.G.A. I N N T E K T S E N D R I N G **/   00003410
                                                                        00003420
                                                                        00003430
      FØDSNUMMER = NISF.FNR;                                            00003440
      SEARCH_FNR = NISF.FNR;                                            00003450
      FNR_PIC    = NISF.FNR;                                            00003460
                                                                        00003470
      IF NIS.ETYPE(I) = 0 THEN                                          00003480
         DO;                                                            00003490
            IF FNR_ÅRH < 5 THEN                                         00003500
                                                                        00003510
               INNT_ALDER   = NIS.ÅR(I) - FNR_ÅR;                       00003520
            ELSE                                                        00003530
               INNT_ALDER   = NIS.ÅR(I) + 100 - FNR_ÅR;                 00003540
                                                                        00003550
            IF INNT_ALDER = 66 THEN                                     00003560
               ØNSKET_STATUS  = '6';                                    00003570
            ELSE                                                        00003580
               IF INNT_ALDER = 69 THEN                                  00003590
                  ØNSKET_STATUS  = '9';                                 00003600
         END;                                                           00003610
                                                                        00003620
                                                                        00003630
      EXEC CICS LINK PROGRAM('R001I601') COMMAREA (KOM_OMR);            00003640
                                                                        00003650
      IF FEIL_MELD_NR > 0 THEN                                          00003660
         DO;                                                            00003670
            GOTO L999;                                                  00003680
         END;                                                           00003690
      ELSE                                                              00003700
         PROGRAM_ID = 'R001I501';                                       00003710
                                                                        00003720
      CALL P40_SKRIV_KOMPREC;                                           00003730
                                                                        00003740
      IF FEIL_MELD_NR > 0 THEN                                          00003750
         CALL SKRIV_FEILMELDING;                                        00003760
                                                                        00003770
                                                                        00003780
                                                                        00003790
   FORTSETT:                                                            00003800
                                                                        00003810
   CALL SKRIV_LISTEDATA(FEILTYPE,FEILTYPE);                             00003820
                                                                        00003830
   IF NIS.MERKE(I) = 2 !                                                00003840
      TIDL_FFU            THEN                                          00003850
      CALL SKRIV_FFU_DATA;                                              00003860
                                                                        00003870
                                                                        00003880
     /*----------------------------------------*/                       00003890
     /* DATA TIL NORTRYGD   :   TIL - FNR      */                       00003900
     /*----------------------------------------*/                       00003910
                                                                        00003920
     SSA1_RF0PERSN.PKEY = NISF.FNR                   ;                  00003930
     W01.FNR            = NISF.FNR                   ;                  00003940
     W01.TKNR           = F100_FINN_TKNR (NISF.FNR)  ;                  00003950
                                                                        00003960
     IF FEIL_MELD_NR    >  0                      THEN                  00003970
        DO;                                                             00003980
           FATAL_FEIL   = '1'B                       ;                  00003990
           GO TO L999;                                                  00004000
        END;                                                            00004010
                                                                        00004020
     CALL P900_NOR_DATA (W01.FNR , W01.TKNR)         ;                  00004030
                                                                        00004040
     IF FEIL_MELD_NR    >  0                      THEN                  00004050
        DO;                                                             00004060
           FATAL_FEIL   = '1'B                       ;                  00004070
           GO TO L999;                                                  00004080
        END;                                                            00004090
     ELSE                                                               00004100
        PROGRAM_ID      = 'R001I501'            ;                       00004110
  END;                                                                  00004120
                                                                        00004130
 L999:                                                                  00004140
                                                                        00004150
  EXEC CICS PURGE MESSAGE;                                              00004160
                                                                        00004170
  IF FEIL_MELD_NR > 0 THEN                                              00004180
     CALL SKRIV_FEILMELDING;                                            00004190
                                                                        00004200
  TRANS_RETURKODE = 'R041';                                             00004210
                                                                        00004220
  EXEC CICS RETURN;                                                     00004230
                                                                        00004240
                                                                        00004250
                                                                        00004260
  /**********    H O V E D S T Y R I N G   S L U T T   *************/   00004270
                                                                        00004280
  BEREGN_INNT_TYPE:                                                     00004290
     PROC(TYPE,ART,INNT_TYPE);                                          00004300
                                                                        00004310
     DCL TYPE      CHAR(1);                                             00004320
     DCL ART       PIC '9';                                             00004330
     DCL INNT_TYPE CHAR(1);                                             00004340
                                                                        00004350
     SELECT(TYPE);                                                      00004360
                                                                        00004370
        WHEN('B')                                                       00004380
                                                                        00004390
           SELECT(ART);                                                 00004400
                                                                        00004410
              WHEN(1)                                                   00004420
                 INNT_TYPE = 'B';                                       00004430
              WHEN(2)                                                   00004440
                 INNT_TYPE = 'C';                                       00004450
              WHEN(3)                                                   00004460
                 INNT_TYPE = 'D';                                       00004470
              OTHERWISE                                                 00004480
                   ;                                                    00004490
           END;                                                         00004500
        WHEN('C')                                                       00004510
                                                                        00004520
           SELECT(ART);                                                 00004530
                                                                        00004540
              WHEN(1)                                                   00004550
                 INNT_TYPE = 'E';                                       00004560
              WHEN(2)                                                   00004570
                 INNT_TYPE = 'F';                                       00004580
              OTHERWISE                                                 00004590
                   ;                                                    00004600
           END;                                                         00004610
        WHEN('D')                                                       00004620
                                                                        00004630
           SELECT(ART);                                                 00004640
                                                                        00004650
              WHEN(1)                                                   00004660
                 INNT_TYPE = 'H';                                       00004670
              WHEN(2)                                                   00004680
                 INNT_TYPE = 'I';                                       00004690
              OTHERWISE                                                 00004700
                   ;                                                    00004710
           END;                                                         00004720
        WHEN('S')                                                       00004730
                                                                        00004740
           SELECT(ART);                                                 00004750
                                                                        00004760
              WHEN(1)                                                   00004770
                 INNT_TYPE = 'S';                                       00004780
              WHEN(2)                                                   00004790
                 INNT_TYPE = 'T';                                       00004800
              OTHERWISE                                                 00004810
                   ;                                                    00004820
           END;                                                         00004830
        WHEN('O')                                                       00004840
                                                                        00004850
           SELECT(ART);                                                 00004860
                                                                        00004870
              WHEN(4)                                                   00004880
                 INNT_TYPE = 'J';                                       00004890
              WHEN(5)                                                   00004900
                 INNT_TYPE = 'K';                                       00004910
              WHEN(6)                                                   00004920
                 INNT_TYPE = 'L';                                       00004930
              OTHERWISE                                                 00004940
                   ;                                                    00004950
           END;                                                         00004960
        WHEN('U')                                                       00004970
                                                                        00004980
           SELECT(ART);                                                 00004990
                                                                        00005000
              WHEN(1)                                                   00005010
                 INNT_TYPE = 'V';                                       00005020
              WHEN(2)                                                   00005030
                 INNT_TYPE = 'W';                                       00005040
              OTHERWISE                                                 00005050
                   ;                                                    00005060
           END;                                                         00005070
                                                                        00005080
        OTHERWISE                                                       00005090
           ;                                                            00005100
     END;                                                               00005110
  END BEREGN_INNT_TYPE;                                                 00005120
    %PAGE;                                                              00005130
                                                                        00005140
                                                                        00005150
                                                                        00005160
  P05_SJEKK_OM_DØD:                                                     00005170
    PROC;                                                               00005180
                                                                        00005190
                                                                        00005200
    DCL 01 D_DATO                            PIC '(6)9',                00005210
        01 D_DATO_REDEF DEF D_DATO                     ,                00005220
           02 ÅR                             PIC '(2)9',                00005230
           02 MND                            PIC '(2)9',                00005240
           02 DAG                            PIC '(2)9';                00005250
                                                                        00005260
                                                                        00005270
                                                                        00005280
    W01_STATUS                      =     ''               ;            00005290
                                                                        00005300
                                                                        00005310
    /* ***************************************************** */         00005320
    /*  LES AV ROT OG STATUS.                                */         00005330
    /* ***************************************************** */         00005340
                                                                        00005350
                                                                        00005360
    CALL PLITDLI                         (W02_PARM_CT_5,                00005370
                                          W02_GU,                       00005380
                                          RF1,                          00005390
                                          W01_STATUS,                   00005400
                                          SSA1_RF0PERSN,                00005410
                                          SSA1_STATUS);                 00005420
                                                                        00005430
    IF DLIUIB.UIBRCODE.UIBFCTR       ^=   UIB_RC_OK    THEN             00005440
       DO;                                                              00005450
          /* ******************************************** */            00005460
          /* FEIL VED LES   AV :  ROT OG STATUS.          */            00005470
          /* ******************************************** */            00005480
  L005:                                                                 00005490
          FEIL_MELD_NR                =    500 ;                        00005500
          FEIL_VED_LABEL              =   '005';                        00005510
          FATAL_FEIL                  =   '1'B ;                        00005520
          GO   TO  RETUR;                                               00005530
       END;                                                             00005540
                                                                        00005550
                                                                        00005560
    IF RF1.STATUS_KODE               =   'GE'    THEN                   00005570
       DO;                                                              00005580
          /* ******************************************** */            00005590
          /* ROT ELLER STATUS IKKE FUNNET.                */            00005600
          /*  LES AV ROT.                                 */            00005610
          /* ******************************************** */            00005620
                                                                        00005630
                                                                        00005640
          CALL PLITDLI                   (W02_PARM_CT_4,                00005650
                                          W02_GHU,                      00005660
                                          RF1,                          00005670
                                          RF0PERSN,                     00005680
                                          SSA1_RF0PERSN);               00005690
                                                                        00005700
          IF DLIUIB.UIBRCODE.UIBFCTR  ^=  UIB_RC_OK         THEN        00005710
             DO;                                                        00005720
                /* ******************************************** */      00005730
                /* FEIL VED LES   AV :  ROT                     */      00005740
                /* ******************************************** */      00005750
  L010:                                                                 00005760
                FEIL_MELD_NR           =  500 ;                         00005770
                FEIL_VED_LABEL         = '010';                         00005780
                FATAL_FEIL             = '1'B ;                         00005790
                GOTO RETUR;                                             00005800
             END;                                                       00005810
                                                                        00005820
          IF RF1.STATUS_KODE           = 'GE'    THEN                   00005830
             DO;                                                        00005840
                /* ******************************************** */      00005850
                /* ROT    IKKE FUNNET.                          */      00005860
                /* ******************************************** */      00005870
                                                                        00005880
                EXEC CICS LINK PROGRAM('R0015602') COMMAREA (KOM_OMR);  00005890
                                                                        00005900
                IF FEIL_MELD_NR     >    0 THEN                         00005910
                   DO;                                                  00005920
                                                                        00005930
                      GO  TO   RETUR;                                   00005940
                   END;                                                 00005950
                                                                        00005960
                                                                        00005970
                ROT_IKKE_FUNNET            =   '1'B;                    00005980
                GO  TO   RETUR;                                         00005990
             END;                                                       00006000
          ELSE                                                          00006010
             IF RF1.STATUS_KODE         ^=   '  '    THEN               00006020
                DO;                                                     00006030
                   /* ******************************************** */   00006040
                   /* FEIL VED LES AV :  ROT                       */   00006050
                   /* ******************************************** */   00006060
  L015:                                                                 00006070
                   FEIL_MELD_NR          =    500 ;                     00006080
                   FATAL_FEIL            =   '1'B ;                     00006090
                   DB_STATUS_KODE        =    RF1.STATUS_KODE;          00006100
                   FEIL_VED_LABEL        =   '015';                     00006110
                   GO   TO  RETUR;                                      00006120
                END;                                                    00006130
       END;                                                             00006140
    ELSE                                                                00006150
       IF RF1.STATUS_KODE               ^=   '  '    THEN               00006160
          DO;                                                           00006170
             /* ******************************************** */         00006180
             /* FEIL VED LES AV :  ROT OG STATUS.            */         00006190
             /* ******************************************** */         00006200
  L020:                                                                 00006210
             FEIL_MELD_NR                =    500 ;                     00006220
             FATAL_FEIL                  =   '1'B ;                     00006230
             DB_STATUS_KODE              =    RF1.STATUS_KODE;          00006240
             FEIL_VED_LABEL              =   '020';                     00006250
             GO   TO  RETUR;                                            00006260
          END;                                                          00006270
                                                                        00006280
                                                                        00006290
       D_DATO   = W01_STATUS.DØDSDATO_ÅMD;                              00006300
                                                                        00006310
       IF D_DATO             > 0                  &                     00006320
          NIS.ÅR         (I) > D_DATO_REDEF.ÅR    &                     00006330
          NIS.PG_INNTEKT (I) > 0                  THEN                  00006340
          DO;                                                           00006350
             FEILTYPE       = 1                            ;            00006360
             CALL SKRIV_BREV     (FEILTYPE,D_DATO_REDEF.ÅR);            00006370
             CALL SKRIV_LISTEDATA(FEILTYPE,D_DATO_REDEF.ÅR);            00006380
          END;                                                          00006390
                                                                        00006400
                                                                        00006410
  RETUR:                                                                00006420
                                                                        00006430
  END P05_SJEKK_OM_DØD;                                                 00006440
                                                                        00006450
                                                                        00006460
  P10_BEHANDLE_PINNTEKT:                                                00006470
    PROC;                                                               00006480
                                                                        00006490
           /* ******************************************** */           00006500
           /*  SKRIV ROT HVIS DET IKKE FINNES.             */           00006510
           /* ******************************************** */           00006520
                                                                        00006530
     DCL DUMMY_ÅR    PIC '(2)9';                                        00006540
                                                                        00006550
      DUMMY_ÅR = 0;                                                     00006560
                                                                        00006570
      IF ROT_IKKE_FUNNET THEN                                           00006580
         DO;                                                            00006590
            IF NISF.NAVN = '                         '  THEN            00006600
               DO;                                                      00006610
                  /* *************************** */                     00006620
                  /* NAVN MÅ UTFYLLES.           */                     00006630
                  /* *************************** */                     00006640
                  FEILTYPE = 8;                                         00006650
                  CALL SKRIV_BREV(FEILTYPE,DUMMY_ÅR);                   00006660
                  CALL SKRIV_LISTEDATA(FEILTYPE,FEILTYPE);              00006670
                  GO   TO  RETUR;                                       00006680
               END;                                                     00006690
                                                                        00006700
            RF0PERSN.FNR                     =     NISF.FNR ;           00006710
            RF0PERSN.NAVN                    =     NISF.NAVN;           00006720
            RF0PERSN.TKNR                    =     0        ;           00006730
            RF0PERSN.SPRÅK                   =     ' '      ;           00006740
            RF0PERSN.AI67                    =     0        ;           00006750
            RF0PERSN.SPERRE                  =     ' '      ;           00006760
                                                                        00006770
            CALL PLITDLI                          (W02_PARM_CT_4,       00006780
                                                   W02_ISRT,            00006790
                                                   RF1,                 00006800
                                                   RF0PERSN,            00006810
                                                   SSA_UQUAL_ROT);      00006820
                                                                        00006830
            IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN    00006840
               DO;                                                      00006850
           /* ******************************************** */           00006860
           /* FEIL VED SKRIV AV :  ROT                     */           00006870
           /* ******************************************** */           00006880
  L100:                                                                 00006890
                  FEIL_MELD_NR                =    500 ;                00006900
                  FEIL_VED_LABEL              =   '100';                00006910
                  FATAL_FEIL                  =   '1'B ;                00006920
                  GO   TO  RETUR;                                       00006930
               END;                                                     00006940
                                                                        00006950
            IF   RF1.STATUS_KODE            ^=   '  '    THEN           00006960
               DO;                                                      00006970
           /* ******************************************** */           00006980
           /* FEIL VED SKRIV AV :  ROT                     */           00006990
           /* ******************************************** */           00007000
  L103:                                                                 00007010
                 FEIL_MELD_NR                =    500 ;                 00007020
                 FATAL_FEIL                  =   '1'B ;                 00007030
                 DB_STATUS_KODE              =   RF1.STATUS_KODE;       00007040
                 FEIL_VED_LABEL              =   '103';                 00007050
                 GO   TO  RETUR;                                        00007060
               END;                                                     00007070
                                                                        00007080
                                                                        00007090
         END;                                                           00007100
                                                                        00007110
 /* TILLEGG 1/10-90 AV TUYEN */                                         00007120
                                                                        00007130
  IF NIS.TYPE(I) = 'A' THEN                                             00007140
    DO;                                                                 00007150
      SSA4_PINNTEKT.ÅR    = NIS.ÅR(I);                                  00007160
                                                                        00007170
      CALL PLITDLI                          (W02_PARM_CT_5,             00007180
                                             W02_GHU,                   00007190
                                             RF1,                       00007200
                                             W01_PINT,                  00007210
                                             SSA1_RF0PERSN,             00007220
                                             SSA4_PINNTEKT);            00007230
                                                                        00007240
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN          00007250
        DO;                                                             00007260
           /* ******************************************** */           00007270
           /* FEIL VED LES   AV :  PINNTEKT                */           00007280
           /* ******************************************** */           00007290
  LXX1:                                                                 00007300
           FEIL_MELD_NR                =    500 ;                       00007310
           FEIL_VED_LABEL              =   'XX1';                       00007320
           FATAL_FEIL                  =   '1'B ;                       00007330
           GO   TO  RETUR;                                              00007340
        END;                                                            00007350
                                                                        00007360
      ALLOCATE S001I04O      ;                                          00007370
      ALLOCATE S001I04I      ;                                          00007380
      EXEC CICS LOAD PROGRAM('S001I43') ;                               00007390
                                                                        00007400
      S001I04O.MELDING1O = '';                                          00007410
      S001I04O.MELDING2O = '';                                          00007420
                                                                        00007430
      IF   RF1.STATUS_KODE             =   '  '    THEN                 00007440
        DO;                                                             00007450
          /* ******************************************** */            00007460
          /* DET FINNES INNTEKT MED SAMME ÅR.             */            00007470
          /* ******************************************** */            00007480
                                                                        00007490
           S001I04O.MELDING1O =                                         00007500
              'DET FINNES INNTEKT I BASEN I SAMME ÅR!';                 00007510
                                                                        00007520
           S001I04O.MELDING2O = 'REGISTRERINGEN FORKASTES!!!';          00007530
                                                                        00007540
           EXEC CICS SEND MAP('S001I04')                                00007550
                     MAPSET('S001I43') CURSOR          ;                00007560
                                                                        00007570
           /* DUMMY RECEIVE-KALL. */                                    00007580
                                                                        00007590
           EXEC CICS RECEIVE MAP('S001I04')                             00007600
                     MAPSET('S001I43') SET(BMSMAPBR);                   00007610
                                                                        00007620
           GOTO L999;                                                   00007630
        END;                                                            00007640
                                                                        00007650
      ELSE                                                              00007660
        IF RF1.STATUS_KODE = 'GE' THEN                                  00007670
          DO;                                                           00007680
            /* INGEN INNTEKT REGISTRERT FOR AKTUELT ÅR */               00007690
                                                                        00007700
               IF NIS.ETYPE(I) ^= 0 THEN                                00007710
                  DO;                                                   00007720
                      S001I04O.MELDING1O =                              00007730
                            'BARE ENDR. TYPE "0" TILLATES!';            00007740
                      EXEC CICS SEND MAP('S001I04')                     00007750
                             MAPSET('S001I43') CURSOR          ;        00007760
                                                                        00007770
                     /* DUMMY RECEIVE-KALL. */                          00007780
                                                                        00007790
                      EXEC CICS RECEIVE MAP('S001I04')                  00007800
                             MAPSET('S001I43') SET(BMSMAPBR);           00007810
                      GOTO L999;                                        00007820
                  END;                                                  00007830
                                                                        00007840
               IF NIS.KOMMNR(I) ^= 0000 THEN                            00007850
                  DO;                                                   00007860
                      S001I04O.MELDING1O =                              00007870
                            'BARE KOMMUNENR 0000 TILLATES!';            00007880
                      EXEC CICS SEND MAP('S001I04')                     00007890
                             MAPSET('S001I43') CURSOR          ;        00007900
                                                                        00007910
                     /* DUMMY RECEIVE-KALL. */                          00007920
                                                                        00007930
                      EXEC CICS RECEIVE MAP('S001I04')                  00007940
                             MAPSET('S001I43') SET(BMSMAPBR);           00007950
                      GOTO L999;                                        00007960
                  END;                                                  00007970
                                                                        00007980
               IF NIS.PG_INNTEKT(I) ^= 0 THEN                           00007990
                  DO;                                                   00008000
                      S001I04O.MELDING1O =                              00008010
                            'BARE NULL-INNTEKT TILLATES!';              00008020
                                                                        00008030
                      EXEC CICS SEND MAP('S001I04')                     00008040
                          MAPSET('S001I43') CURSOR          ;           00008050
                                                                        00008060
                     /* DUMMY RECEIVE-KALL. */                          00008070
                                                                        00008080
                      EXEC CICS RECEIVE MAP('S001I04')                  00008090
                          MAPSET('S001I43') SET(BMSMAPBR);              00008100
                                                                        00008110
                      GOTO L999;                                        00008120
                  END;                                                  00008130
                                                                        00008140
               ELSE                                                     00008150
                  DO;                                                   00008160
                                                                        00008170
                     W02_PI_ÅR       = NIS.ÅR(I)              ;         00008180
                     W02_PI_MERKE    = NIS.MERKE(I)           ;         00008190
                     W02_PI          = 0                      ;         00008200
                     W02_PI_KOMMNR   = 0000                   ;         00008210
                                                                        00008220
                     W02_PI_TYPE     = 'A'                    ;         00008230
                     DATO_CHAR       = DATE                   ;         00008240
                     ÅR_DAGNR_CHAR   = R0019947(DATO_CHAR)    ;         00008250
                     W02_PI_RAPPDATO = ÅR_DAGNR_NUM           ;         00008260
                                                                        00008270
                     CALL PLITDLI             (W02_PARM_CT_5,           00008280
                                               W02_ISRT,                00008290
                                               RF1,                     00008300
                                               W01_PINT,                00008310
                                               SSA1_RF0PERSN,           00008320
                                               SSA_UQUAL_PINNTEKT);     00008330
                                                                        00008340
                     IF   DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK THEN     00008350
                     DO;                                                00008360
                  /* ******************************************** */    00008370
                  /* FEIL VED SKRIV AV :  PINNTEKT                */    00008380
                  /* ******************************************** */    00008390
  LXX3:                                                                 00008400
                        FEIL_MELD_NR                =    500 ;          00008410
                        FEIL_VED_LABEL              =   'XX3';          00008420
                        FATAL_FEIL                  =   '1'B ;          00008430
                        GO   TO  RETUR;                                 00008440
                     END;                                               00008450
                                                                        00008460
                     IF   RF1.STATUS_KODE  ^= '  ' THEN                 00008470
                     DO;                                                00008480
  LXX4:                                                                 00008490
                        FEIL_MELD_NR                =    500 ;          00008500
                        FATAL_FEIL                  =   '1'B ;          00008510
                        DB_STATUS_KODE               = RF1.STATUS_KODE; 00008520
                        FEIL_VED_LABEL              =   'XX4';          00008530
                        GO   TO  RETUR;                                 00008540
                     END;                                               00008550
                                                                        00008560
                     GOTO RETUR;                                        00008570
                  END;                                                  00008580
          END;                                                          00008590
                                                                        00008600
        ELSE                                                            00008610
          DO;                                                           00008620
             /* ************************************************/       00008630
             /* RF1.STATUS_KODE ^= 'II','  ' EL 'GE'): DB-FEIL */       00008640
             /* ************************************************/       00008650
  LXX2:                                                                 00008660
              FEIL_MELD_NR                =   500 ;                     00008670
              FEIL_VED_LABEL              =  'XX2';                     00008680
              FATAL_FEIL                  =   '1'B ;                    00008690
              DB_STATUS_KODE      =   RF1.STATUS_KODE;                  00008700
              GO   TO  RETUR;                                           00008710
          END;                                                          00008720
   END;                                                                 00008730
                                                                        00008740
 /* TIL HIT */                                                          00008750
                                                                        00008760
      SSA1_PINNTEKT.ÅR    =  NIS.ÅR(I)     ;                            00008770
      SSA1_PINNTEKT.TYPE  =  W02_INNT_TYPE ;                            00008780
                                                                        00008790
      TIDL_FFU = '0'B;                                                  00008800
                                                                        00008810
      CALL P15_LES_INNTEKT_GN;                                          00008820
                                                                        00008830
                                                                        00008840
      DO WHILE (FEIL_MELD_NR = 0 & ^IKKE_FUNNET);                       00008850
                                                                        00008860
                                                                        00008870
                                                                        00008880
         IF NIS.KOMMNR(I) < 2500 THEN                                   00008890
            CALL P50_BEHANDLE_INNTEKTER_1;                              00008900
                                                                        00008910
                                                                        00008920
         IF FEIL_MELD_NR > 0 THEN                                       00008930
            GO   TO  L999;                                              00008940
                                                                        00008950
                                                                        00008960
         IF NIS.KOMMNR(I) = 0301 THEN                                   00008970
            CALL P60_BEHANDLE_INNTEKTER_2;                              00008980
                                                                        00008990
                                                                        00009000
         IF FEIL_MELD_NR > 0 THEN                                       00009010
            GO   TO  L999;                                              00009020
                                                                        00009030
         CALL P70_BEHANDLE_INNTEKTER_3;                                 00009040
                                                                        00009050
                                                                        00009060
         IF FEIL_MELD_NR > 0 THEN                                       00009070
            GO   TO  L999;                                              00009080
                                                                        00009090
         IF W02_PI_MERKE = 2 THEN                                       00009100
            TIDL_FFU = '1'B;                                            00009110
                                                                        00009120
         CALL P15_LES_INNTEKT_GN;                                       00009130
                                                                        00009140
     END;                                                               00009150
                                                                        00009160
                                                                        00009170
      IF FEIL_MELD_NR > 0 THEN                                          00009180
         GO   TO  RETUR;                                                00009190
                                                                        00009200
           /* ******************************************** */           00009210
           /*  LES      :  PINNTEKT                        */           00009220
           /* ******************************************** */           00009230
                                                                        00009240
                                                                        00009250
      CALL PLITDLI                          (W02_PARM_CT_5,             00009260
                                             W02_GHU,                   00009270
                                             RF1,                       00009280
                                             W01_PINT,                  00009290
                                             SSA1_RF0PERSN,             00009300
                                             SSA1_PINNTEKT);            00009310
                                                                        00009320
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN          00009330
        DO;                                                             00009340
           /* ******************************************** */           00009350
           /* FEIL VED LES   AV :  PINNTEKT                */           00009360
           /* ******************************************** */           00009370
  L105:                                                                 00009380
           FEIL_MELD_NR                =    500 ;                       00009390
           FEIL_VED_LABEL              =   '105';                       00009400
           FATAL_FEIL                  =   '1'B ;                       00009410
           GO   TO  RETUR;                                              00009420
        END;                                                            00009430
                                                                        00009440
                                                                        00009450
      IF   RF1.STATUS_KODE             =   '  '    THEN                 00009460
        DO;                                                             00009470
          /* ******************************************** */            00009480
          /* SAMME PINNTEKT LIGGER INNE FRA FØR.          */            00009490
          /* ******************************************** */            00009500
                                                                        00009510
                                                                        00009520
           IF NIS.ETYPE(I) = 1 THEN                                     00009530
              DO;                                                       00009540
                 IF NIS.PG_INNTEKT(I) = 0 &                             00009550
                    NIS.KOMMNR(I) ^= W02_PI_KOMMNR &                    00009560
                    (W02_PI_KOMMNR ^=0)            THEN                 00009570
                                                                        00009580
                    DO;                                                 00009590
                       FEILTYPE = 2;                                    00009600
                       CALL SKRIV_BREV(FEILTYPE,DUMMY_ÅR);              00009610
                    END;                                                00009620
                                                                        00009630
                                                                        00009640
 /* TILLEGG 06.09.90 AV TUYEN. */                                       00009650
                                                                        00009660
                 IF NIS.KOMMNR(I) ^= W02_PI_KOMMNR &                    00009670
                    (W02_PI_KOMMNR ^= 0) THEN                           00009680
                                                                        00009690
                    DO;                                                 00009700
                                                                        00009710
                       ALLOCATE S001I04O      ;                         00009720
                       ALLOCATE S001I04I      ;                         00009730
                       EXEC CICS LOAD PROGRAM('S001I43') ;              00009740
                                                                        00009750
                       S001I04O.MELDING1O = '';                         00009760
                       S001I04O.MELDING2O = '';                         00009770
                       S001I04O.MELDING3O = '';                         00009780
                       S001I04O.MELDING1O =                             00009790
                                                                        00009800
              'KOMMUNE ER FORSKJELLIG FRA KOMMUNE REGISTRERT I BASEN!.';00009810
                                                                        00009820
                       S001I04O.MELDING2O =                             00009830
                                                                        00009840
              'ER DU SIKKER PÅ AT DET ER RIKTIG Å KORRIGERE???';        00009850
                                                                        00009860
                                                                        00009870
                       EXEC CICS SEND MAP('S001I04')                    00009880
                           MAPSET('S001I43') CURSOR          ;          00009890
                                                                        00009900
              /* DUMMY RECEIVE-KALL. */                                 00009910
                                                                        00009920
                       EXEC CICS RECEIVE MAP('S001I04')                 00009930
                           MAPSET('S001I43') SET(BMSMAPBR);             00009940
                                                                        00009950
                   END;                                                 00009960
 /* TIL HIT */                                                          00009970
                                                                        00009980
                 CALL SKRIV_LISTEDATA_KORR;                             00009990
                                                                        00010000
                                                                        00010010
                 W02_PI_ÅR       = NIS.ÅR(I)                 ;          00010020
                 W02_PI_MERKE    = NIS.MERKE(I)              ;          00010030
                 W02_PI          = NIS.PG_INNTEKT(I) / 100   ;          00010040
                 W02_PI_KOMMNR   = NIS.KOMMNR(I)             ;          00010050
                                                                        00010060
                 W02_PI_TYPE     = W02_INNT_TYPE             ;          00010070
                 DATO_CHAR       = DATE                      ;          00010080
                 ÅR_DAGNR_CHAR   = R0019947(DATO_CHAR)       ;          00010090
                 W02_PI_RAPPDATO = ÅR_DAGNR_NUM              ;          00010100
                                                                        00010110
                                                                        00010120
                                                                        00010130
                 CALL PLITDLI                      (W02_PARM_CT_3,      00010140
                                                    W02_REPL,           00010150
                                                    RF1,                00010160
                                                    W01_PINT);          00010170
                                                                        00010180
                 IF   DLIUIB.UIBRCODE.UIBFCTR  ^=     UIB_RC_OK    THEN 00010190
                      DO;                                               00010200
           /* ******************************************** */           00010210
           /* FEIL VED SKRIV AV :  PINNTEKT                */           00010220
           /* ******************************************** */           00010230
  L106:                                                                 00010240
                         FEIL_MELD_NR                =    500 ;         00010250
                         FEIL_VED_LABEL              =   '106';         00010260
                         FATAL_FEIL                  =   '1'B ;         00010270
                         GO   TO  RETUR;                                00010280
                     END;                                               00010290
                                                                        00010300
                                                                        00010310
                     IF  RF1.STATUS_KODE     ^=       '  ' THEN         00010320
                         DO;                                            00010330
             /* ************************************************/       00010340
             /* FEIL VED REPL AV INNTEKT.                      */       00010350
             /* ************************************************/       00010360
  L107:                                                                 00010370
                            FEIL_MELD_NR                =   500 ;       00010380
                            FEIL_VED_LABEL              =  '107';       00010390
                            FATAL_FEIL                  =   '1'B ;      00010400
                            DB_STATUS_KODE      =   RF1.STATUS_KODE;    00010410
                            GO   TO  RETUR;                             00010420
                         END;                                           00010430
                                                                        00010440
              END;                                                      00010450
           ELSE                                                         00010460
                                                                        00010470
          /* ******************************************** */            00010480
          /* HVIS ETYPE = 9 (OPPHØR),GODKJENNES DETTE     */            00010490
          /* HVIS KOMMUNENR I TRANS ER LIK DET PÅ BASE.   */            00010500
          /* ******************************************** */            00010510
              IF NIS.ETYPE(I) = 9 THEN                                  00010520
                 DO;                                                    00010530
                    IF NIS.KOMMNR(I) = W02_PI_KOMMNR THEN               00010540
                       DO;                                              00010550
                                                                        00010560
                                                                        00010570
                          W02_PI_ÅR       = NIS.ÅR(I)              ;    00010580
                          W02_PI_MERKE    = NIS.MERKE(I)           ;    00010590
                          W02_PI          = NIS.PG_INNTEKT(I) / 100;    00010600
                          W02_PI_KOMMNR   = NIS.KOMMNR(I)          ;    00010610
                                                                        00010620
                          W02_PI_TYPE     = W02_INNT_TYPE          ;    00010630
                          DATO_CHAR       = DATE                   ;    00010640
                          ÅR_DAGNR_CHAR   = R0019947(DATO_CHAR)    ;    00010650
                          W02_PI_RAPPDATO = ÅR_DAGNR_NUM           ;    00010660
                                                                        00010670
                                                                        00010680
                                                                        00010690
                                                                        00010700
                         CALL PLITDLI           (W02_PARM_CT_3,         00010710
                                                 W02_DLET,              00010720
                                                 RF1,                   00010730
                                                 W01_PINT);             00010740
                                                                        00010750
                         IF   DLIUIB.UIBRCODE.UIBFCTR  ^=               00010760
                                                      UIB_RC_OK    THEN 00010770
                             DO;                                        00010780
           /* ******************************************** */           00010790
           /* FEIL VED DLET  AV :  PINNTEKT                */           00010800
           /* ******************************************** */           00010810
  L111:                                                                 00010820
                                FEIL_MELD_NR                =    500 ;  00010830
                                FEIL_VED_LABEL              =   '111';  00010840
                                FATAL_FEIL                  =   '1'B ;  00010850
                                GO   TO  RETUR;                         00010860
                             END;                                       00010870
                                                                        00010880
                                                                        00010890
                         IF  RF1.STATUS_KODE     ^=       '  ' THEN     00010900
                            DO;                                         00010910
             /* ************************************************/       00010920
             /* FEIL VED DLET AV INNTEKT.                      */       00010930
             /* ************************************************/       00010940
  L112:                                                                 00010950
                               FEIL_MELD_NR                =   500 ;    00010960
                               FEIL_VED_LABEL              =  '112';    00010970
                               FATAL_FEIL                  =   '1'B ;   00010980
                               DB_STATUS_KODE      =   RF1.STATUS_KODE; 00010990
                               GO   TO  RETUR;                          00011000
                            END;                                        00011010
                                                                        00011020
                                                                        00011030
                                                                        00011040
                          W02_PI         = 0;                           00011050
                          W02_PI_MERKE   = '9';                         00011060
                                                                        00011070
                         CALL PLITDLI           (W02_PARM_CT_5,         00011080
                                                 W02_ISRT     ,         00011090
                                                 RF1          ,         00011100
                                                 W01_PINT     ,         00011110
                                                 SSA1_RF0PERSN,         00011120
                                                 SSA_UQUAL_PINNTEKT);   00011130
                                                                        00011140
                         IF   DLIUIB.UIBRCODE.UIBFCTR  ^=               00011150
                                                      UIB_RC_OK    THEN 00011160
                             DO;                                        00011170
           /* ******************************************** */           00011180
           /* FEIL VED ISRT  AV :  PINNTEKT                */           00011190
           /* ******************************************** */           00011200
  L113:                                                                 00011210
                                FEIL_MELD_NR                =    500 ;  00011220
                                FEIL_VED_LABEL              =   '113';  00011230
                                FATAL_FEIL                  =   '1'B ;  00011240
                                GO   TO  RETUR;                         00011250
                             END;                                       00011260
                                                                        00011270
                                                                        00011280
                         IF  RF1.STATUS_KODE     ^=       '  ' THEN     00011290
                            DO;                                         00011300
             /* ************************************************/       00011310
             /* FEIL VED ISRT AV INNTEKT.                      */       00011320
             /* ************************************************/       00011330
  L114:                                                                 00011340
                               FEIL_MELD_NR                =   500 ;    00011350
                               FEIL_VED_LABEL              =  '114';    00011360
                               FATAL_FEIL                  =   '1'B ;   00011370
                               DB_STATUS_KODE      =   RF1.STATUS_KODE; 00011380
                               GO   TO  RETUR;                          00011390
                            END;                                        00011400
                       END;                                             00011410
                    ELSE                                                00011420
                       DO;                                              00011430
           /* ******************************************** */           00011440
           /* UGYLDIG ETYPE.ETYPE = 9 OG KOMMNR. ER ULIKE. */           00011450
           /* ******************************************** */           00011460
  L115:                                                                 00011470
                          FEIL_MELD_NR                =    259 ;        00011480
                          FEIL_VED_LABEL              =   '115';        00011490
                          GO   TO  RETUR;                               00011500
                       END;                                             00011510
                 END;                                                   00011520
              ELSE                                                      00011530
                 DO;                                                    00011540
           /* ******************************************** */           00011550
           /* UGYLDIG ETYPE.SAMME INNTEKT OG ÅR LIGGER INNE*/           00011560
           /* (ETYPE = 0).                                 */           00011570
           /* ******************************************** */           00011580
  L116:                                                                 00011590
                    FEIL_MELD_NR                =    260 ;              00011600
                    FEIL_VED_LABEL              =   '116';              00011610
                                                                        00011620
                    IF NIS.KOMMNR(I) ^= W02_PI_KOMMNR THEN              00011630
                                                                        00011640
                       DO;                                              00011650
                          FEILTYPE = 3;                                 00011660
                          CALL SKRIV_BREV(FEILTYPE,DUMMY_ÅR);           00011670
                       END;                                             00011680
                                                                        00011690
 /* TILLEGG 10/1-90 AV TUYEN. */                                        00011700
                                                                        00011710
                    ELSE                                                00011720
                                                                        00011730
                       IF (NIS.MERKE(I)      = W02_PI_MERKE) &          00011740
                          (NIS.PG_INNTEKT(I) = (W02_PI*100)) THEN       00011750
                                                                        00011760
                          DO;                                           00011770
                             ALLOCATE S001I04O      ;                   00011780
                             ALLOCATE S001I04I      ;                   00011790
                             EXEC CICS LOAD PROGRAM('S001I43') ;        00011800
                                                                        00011810
                             S001I04O.MELDING1O = '';                   00011820
                             S001I04O.MELDING2O = '';                   00011830
                             S001I04O.MELDING1O =                       00011840
                                                                        00011850
              'DEN NYE REGISTRERINGEN ER HELT LIK DET SOM STÅR INNE ';  00011860
                                                                        00011870
                             S001I04O.MELDING2O =                       00011880
                                                                        00011890
              'FRA FØR.  TASKEN BLIR KANSELLERT !!!';                   00011900
                                                                        00011910
                                                                        00011920
                             EXEC CICS SEND MAP('S001I04')              00011930
                                MAPSET('S001I43') CURSOR          ;     00011940
                                                                        00011950
              /* DUMMY RECEIVE-KALL. */                                 00011960
                                                                        00011970
                             EXEC CICS RECEIVE MAP('S001I04')           00011980
                                MAPSET('S001I43') SET(BMSMAPBR);        00011990
                                                                        00012000
                          END;                                          00012010
 /* TIL HIT */                                                          00012020
                    CALL SKRIV_LISTEDATA(FEILTYPE,FEILTYPE);            00012030
                                                                        00012040
                    GO   TO  RETUR;                                     00012050
                 END;                                                   00012060
        END;                                                            00012070
                                                                        00012080
      ELSE                                                              00012090
         IF  RF1.STATUS_KODE           =       'GE'         THEN        00012100
             DO;                                                        00012110
             /* ************************************************/       00012120
             /* FINNES IKKE FRA FØR,BÅDE ETYPE=0 (FØRSTE-      */       00012130
             /* GANGSREGISTRERING) OG ETYPE=1(ENDRING) GODTAS. */       00012140
             /* ************************************************/       00012150
                                                                        00012160
                IF NIS.ETYPE(I) = 0 !                                   00012170
                   NIS.ETYPE(I) = 1 THEN                                00012180
                                                                        00012190
                   DO;                                                  00012200
                                                                        00012210
                         SSA2_PINNTEKT.ÅR      =     NIS.ÅR(I);         00012220
                         SSA2_PINNTEKT.TYPE    =     'A';               00012230
                                                                        00012240
             /* ******************************************** */         00012250
             /*  LES :  PINNTEKT MED BLTYPE = A(FORLØPIG INNT)*/        00012260
             /*         HVIS DEN FINNES,FJERNES DEN.          */        00012270
             /* ******************************************** */         00012280
                                                                        00012290
                                                                        00012300
                         CALL PLITDLI          (W02_PARM_CT_5,          00012310
                                                W02_GHU,                00012320
                                                RF1,                    00012330
                                                W01_PINT,               00012340
                                                SSA1_RF0PERSN,          00012350
                                                SSA2_PINNTEKT);         00012360
                                                                        00012370
                         IF   DLIUIB.UIBRCODE.UIBFCTR    ^=             00012380
                                             UIB_RC_OK    THEN          00012390
                              DO;                                       00012400
           /* ******************************************** */           00012410
           /* FEIL VED LES   AV :  PINNTEKT                */           00012420
           /* ******************************************** */           00012430
  L108:                                                                 00012440
                                 FEIL_MELD_NR          =    500 ;       00012450
                                 FEIL_VED_LABEL        =   '108';       00012460
                                 FATAL_FEIL            =   '1'B ;       00012470
                                 GO   TO  RETUR;                        00012480
                              END;                                      00012490
                                                                        00012500
                         IF   RF1.STATUS_KODE   =   '  '    THEN        00012510
                              DO;                                       00012520
                                                                        00012530
                                                                        00012540
                                                                        00012550
                                 CALL PLITDLI   (W02_PARM_CT_3,         00012560
                                                 W02_DLET,              00012570
                                                 RF1,                   00012580
                                                 W01_PINT);             00012590
                                                                        00012600
                                 IF   DLIUIB.UIBRCODE.UIBFCTR  ^=       00012610
                                                      UIB_RC_OK    THEN 00012620
                                      DO;                               00012630
           /* ******************************************** */           00012640
           /* FEIL VED DLET  AV :  PINNTEKT                */           00012650
           /* ******************************************** */           00012660
  L109:                                                                 00012670
                                         FEIL_MELD_NR    =    500 ;     00012680
                                         FEIL_VED_LABEL  =   '109';     00012690
                                         FATAL_FEIL      =   '1'B ;     00012700
                                         GO   TO  RETUR;                00012710
                                      END;                              00012720
                                                                        00012730
                                                                        00012740
                                  IF  RF1.STATUS_KODE     ^=            00012750
                                                          '  ' THEN     00012760
                                      DO;                               00012770
             /* ************************************************/       00012780
             /* FEIL VED DLET AV INNTEKT.                      */       00012790
             /* ************************************************/       00012800
  L110:                                                                 00012810
                                         FEIL_MELD_NR   =   500 ;       00012820
                                         FEIL_VED_LABEL =  '110';       00012830
                                         FATAL_FEIL     =   '1'B ;      00012840
                                         DB_STATUS_KODE =               00012850
                                                    RF1.STATUS_KODE;    00012860
                                         GO   TO  RETUR;                00012870
                                      END;                              00012880
                              END;                                      00012890
                                                                        00012900
                                                                        00012910
 /* TILLEGG 18.12.89 AV TUYEN */                                        00012920
                                                                        00012930
                         SSA3_PINNTEKT.ÅR1     =     NIS.ÅR(I);         00012940
                         SSA3_PINNTEKT.TYPE1   =     'A'      ;         00012950
                         SSA3_PINNTEKT.ÅR2     =     NIS.ÅR(I);         00012960
                         SSA3_PINNTEKT.TYPE2   =     'W'      ;         00012970
                                                                        00012980
                         CALL PLITDLI          (W02_PARM_CT_5,          00012990
                                                W02_GU,                 00013000
                                                RF1,                    00013010
                                                W01_PINT,               00013020
                                                SSA1_RF0PERSN,          00013030
                                                SSA3_PINNTEKT) ;        00013040
                                                                        00013050
                         IF   DLIUIB.UIBRCODE.UIBFCTR    ^=             00013060
                                             UIB_RC_OK    THEN          00013070
                              DO;                                       00013080
           /* ******************************************** */           00013090
           /* FEIL VED LES   AV :  PINNTEKT                */           00013100
           /* ******************************************** */           00013110
    L200:                                                               00013120
                                 FEIL_MELD_NR          =    500 ;       00013130
                                 FEIL_VED_LABEL        =   '200';       00013140
                                 FATAL_FEIL            =   '1'B ;       00013150
                                 GO   TO  RETUR;                        00013160
                              END;                                      00013170
                                                                        00013180
                                                                        00013190
                         DO WHILE (RF1.STATUS_KODE = '  ') ;            00013200
                                                                        00013210
            /* DET FINNES INNTEKT I BASEN PÅ SAMME ÅR. */               00013220
                                                                        00013230
                            IF W02_PI_KOMMNR = NIS.KOMMNR(I) &          00013240
                               W02_PI * 100  = NIS.PG_INNTEKT(I) &      00013250
   /* OMSORG*/                ( W02_PI_TYPE   ^= 'J' &                  00013260
   /* OMSORG*/                  W02_PI_TYPE   ^= 'K' &                  00013270
   /* OMSORG*/                  W02_PI_TYPE   ^= 'L' ) THEN             00013280
                                                                        00013290
                               IF (W02_PI_TYPE   = 'B' !                00013300
                                   W02_PI_TYPE   = 'C' !                00013310
                                   W02_PI_TYPE   = 'D' ) &              00013320
                                  (W02_INNT_TYPE = 'B' !                00013330
                                   W02_INNT_TYPE = 'C' !                00013340
                                   W02_INNT_TYPE = 'D' ) THEN           00013350
                                   DO;                                  00013360
                                                                        00013370
            /* DERSOM KOMMUNENR OG INNTEKT ER LIKE OG REC.ART ER B */   00013380
            /* SKRIVES DET UT EN ADVARSEL.                         */   00013390
                                                                        00013400
                                      ALLOCATE S001I04O      ;          00013410
                                      ALLOCATE S001I04I      ;          00013420
                                     EXEC CICS LOAD PROGRAM('S001I43'); 00013430
                                                                        00013440
                                      S001I04O.MELDING1O = '';          00013450
                                      S001I04O.MELDING2O = '';          00013460
                                      S001I04O.MELDING3O = '';          00013470
                                      S001I04O.MELDING1O =              00013480
                                                                        00013490
                          'OBS: DET FINNES I BASEN SAMME INNTEKT' ;     00013500
                                                                        00013510
                                      S001I04O.MELDING2O =              00013520
                                                                        00013530
                          'MED BL.TYPE B OG KOMMUNENR ER LIKE.' ;       00013540
                                                                        00013550
                                      S001I04O.MELDING3O =              00013560
                                                                        00013570
                          'ER DU SIKKERT PÅ AT DETTE ER RIKTIG ???' ;   00013580
                                                                        00013590
                                                                        00013600
                                      EXEC CICS SEND MAP('S001I04')     00013610
                                         MAPSET('S001I43') CURSOR ;     00013620
                                                                        00013630
                                      EXEC CICS RECEIVE MAP('S001I04')  00013640
                                       MAPSET('S001I43') SET(BMSMAPBR); 00013650
                                   END;                                 00013660
                                ELSE                                    00013670
                                   DO;                                  00013680
                                                                        00013690
   /*OMSORG*/             IF  ( W02_INNT_TYPE   ^= 'J' &                00013700
                                W02_INNT_TYPE   ^= 'K' &                00013710
                                W02_INNT_TYPE   ^= 'L' )           !    00013720
                                                                        00013730
                             (  NIS.ÅR(I)        < 92              &    00013740
                              ( W02_INNT_TYPE    = 'J' !                00013750
                                W02_INNT_TYPE    = 'K' !                00013760
                                W02_INNT_TYPE    = 'L' ))       THEN    00013770
                                                                        00013780
                    DO;                                                 00013790
            /* DERSOM KOMMUNENR OG INNTEKT ER LIKE OG REC.ART IKKE */   00013800
            /* ER B OG INNTEKT-TYPE ER FORSKJELLIGE AVBRYTTES      */   00013810
            /* PROGRAMMET.                                         */   00013820
                                                                        00013830
                                      ALLOCATE S001I04O      ;          00013840
                                      ALLOCATE S001I04I      ;          00013850
                                     EXEC CICS LOAD PROGRAM('S001I43'); 00013860
                                                                        00013870
                                      S001I04O.MELDING1O = '';          00013880
                                      S001I04O.MELDING2O = '';          00013890
                                      S001I04O.MELDING3O = '';          00013900
                                      S001I04O.MELDING4O = '';          00013910
                                      S001I04O.MELDING1O =              00013920
                                                                        00013930
                   'DET FINNES I BASEN SAMME INNTEKT OG KOMMUNENR' ;    00013940
                                                                        00013950
                                      S001I04O.MELDING2O =              00013960
                                                                        00013970
                   'MEN FORSKJELLIG INNTEKT-TYPE.' ;                    00013980
                                                                        00013990
                                      S001I04O.MELDING3O =              00014000
                                                                        00014010
                   'DERFOR KANSELLERES TASKEN.' ;                       00014020
                                                                        00014030
                                      S001I04O.MELDING4O =              00014040
                                                                        00014050
                   'INGEN REGISTRERING BLIR FORETATT.' ;                00014060
                                                                        00014070
                                                                        00014080
                                      EXEC CICS SEND MAP('S001I04')     00014090
                                         MAPSET('S001I43') CURSOR ;     00014100
                                                                        00014110
                                      EXEC CICS RECEIVE MAP('S001I04')  00014120
                                       MAPSET('S001I43') SET(BMSMAPBR); 00014130
                                                                        00014140
                                      GOTO L999 ;                       00014150
                    END;                                                00014160
                                   END;                                 00014170
                                                                        00014180
                              CALL PLITDLI          (W02_PARM_CT_5,     00014190
                                                     W02_GN,            00014200
                                                     RF1,               00014210
                                                     W01_PINT,          00014220
                                                     SSA1_RF0PERSN,     00014230
                                                     SSA3_PINNTEKT) ;   00014240
                                                                        00014250
                              IF  DLIUIB.UIBRCODE.UIBFCTR    ^=         00014260
                                             UIB_RC_OK    THEN          00014270
                                  DO;                                   00014280
           /* ******************************************** */           00014290
           /* FEIL VED LES   AV :  PINNTEKT                */           00014300
           /* ******************************************** */           00014310
    L201:                                                               00014320
                                      FEIL_MELD_NR         =    500 ;   00014330
                                      FEIL_VED_LABEL       =   '200';   00014340
                                      FATAL_FEIL           =   '1'B ;   00014350
                                      GO   TO  RETUR;                   00014360
                                  END;                                  00014370
                         END;                                           00014380
 /* TIL HIT */                                                          00014390
                                                                        00014400
                                                                        00014410
                         W02_PI_ÅR       = NIS.ÅR(I)              ;     00014420
                         W02_PI_MERKE    = NIS.MERKE(I)           ;     00014430
                         W02_PI          = NIS.PG_INNTEKT(I) / 100;     00014440
                         W02_PI_KOMMNR   = NIS.KOMMNR(I)          ;     00014450
                                                                        00014460
                         W02_PI_TYPE     = W02_INNT_TYPE          ;     00014470
                         DATO_CHAR       = DATE                   ;     00014480
                         ÅR_DAGNR_CHAR   = R0019947(DATO_CHAR)    ;     00014490
                         W02_PI_RAPPDATO = ÅR_DAGNR_NUM           ;     00014500
                                                                        00014510
                                                                        00014520
                         CALL PLITDLI             (W02_PARM_CT_5,       00014530
                                                   W02_ISRT,            00014540
                                                   RF1,                 00014550
                                                   W01_PINT,            00014560
                                                   SSA1_RF0PERSN,       00014570
                                                   SSA_UQUAL_PINNTEKT); 00014580
                                                                        00014590
                         IF   DLIUIB.UIBRCODE.UIBFCTR    ^=             00014600
                                              UIB_RC_OK    THEN         00014610
                              DO;                                       00014620
           /* ******************************************** */           00014630
           /* FEIL VED SKRIV AV :  PINNTEKT                */           00014640
           /* ******************************************** */           00014650
  L120:                                                                 00014660
                                 FEIL_MELD_NR                =    500 ; 00014670
                                 FEIL_VED_LABEL              =   '120'; 00014680
                                 FATAL_FEIL                  =   '1'B ; 00014690
                                 GO   TO  RETUR;                        00014700
                              END;                                      00014710
                                                                        00014720
                                                                        00014730
                         IF  RF1.STATUS_KODE     ^=       '  ' THEN     00014740
                             DO;                                        00014750
             /* ************************************************/       00014760
             /* RF1.STATUS_KODE ^= 'II','  ' EL 'GE'): DB-FEIL */       00014770
             /* ************************************************/       00014780
  L125:                                                                 00014790
                                FEIL_MELD_NR                =   500 ;   00014800
                                FEIL_VED_LABEL              =  '125';   00014810
                                FATAL_FEIL                  =   '1'B ;  00014820
                                DB_STATUS_KODE      =   RF1.STATUS_KODE;00014830
                                GO   TO  RETUR;                         00014840
                             END;                                       00014850
                   END;                                                 00014860
                ELSE                                                    00014870
                   DO;                                                  00014880
           /* ********************************************** */         00014890
           /* UGYLDIG ETYPE.INNTEKT LIGGER IKKE INNE FRA FØR.*/         00014900
           /* ********************************************** */         00014910
  L130:                                                                 00014920
                      FEIL_MELD_NR                =    262 ;            00014930
                      FEIL_VED_LABEL              =   '130';            00014940
                      GO   TO  RETUR;                                   00014950
                   END;                                                 00014960
             END;                                                       00014970
                                                                        00014980
         ELSE                                                           00014990
            IF  RF1.STATUS_KODE           ^=       '  '         THEN    00015000
                DO;                                                     00015010
             /* ************************************************/       00015020
             /* RF1.STATUS_KODE ^= 'II','  ' EL 'GE'): DB-FEIL */       00015030
             /* ************************************************/       00015040
  L135:                                                                 00015050
                   FEIL_MELD_NR                =    500 ;               00015060
                   FEIL_VED_LABEL              =   '135';               00015070
                   FATAL_FEIL                  =   '1'B ;               00015080
                   DB_STATUS_KODE              =    RF1.STATUS_KODE;    00015090
                   GO   TO  RETUR;                                      00015100
                END;                                                    00015110
  RETUR:                                                                00015120
                                                                        00015130
  END P10_BEHANDLE_PINNTEKT;                                            00015140
                                                                        00015150
                                                                        00015160
  P15_LES_INNTEKT_GN:                                                   00015170
    PROC;                                                               00015180
                                                                        00015190
                                                                        00015200
                                                                        00015210
                                                                        00015220
           /* ******************************************** */           00015230
           /*  LES      :  PINNTEKT                        */           00015240
           /* ******************************************** */           00015250
                                                                        00015260
                                                                        00015270
      CALL PLITDLI                          (W02_PARM_CT_5,             00015280
                                             W02_GN,                    00015290
                                             RF1,                       00015300
                                             W01_PINT,                  00015310
                                             SSA1_RF0PERSN,             00015320
                                             SSA1_PINNTEKT);            00015330
                                                                        00015340
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN          00015350
        DO;                                                             00015360
           /* ******************************************** */           00015370
           /* FEIL VED LES   AV :  PINNTEKT                */           00015380
           /* ******************************************** */           00015390
  L140:                                                                 00015400
           FEIL_MELD_NR                =    500 ;                       00015410
           FEIL_VED_LABEL              =   '140';                       00015420
           FATAL_FEIL                  =   '1'B ;                       00015430
           GO   TO  RETUR;                                              00015440
        END;                                                            00015450
                                                                        00015460
      IF   RF1.STATUS_KODE             =   'GE'    THEN                 00015470
           DO;                                                          00015480
              IKKE_FUNNET = '1'B;                                       00015490
              GO TO RETUR;                                              00015500
           END;                                                         00015510
      ELSE                                                              00015520
         IF   RF1.STATUS_KODE         ^=   '  '    THEN                 00015530
              DO;                                                       00015540
           /* ******************************************** */           00015550
           /* FEIL VED LES   AV :  PINNTEKT                */           00015560
           /* ******************************************** */           00015570
  L145:                                                                 00015580
                 FEIL_MELD_NR                =    500 ;                 00015590
                 FEIL_VED_LABEL              =   '145';                 00015600
                 DB_STATUS_KODE              =   RF1.STATUS_KODE;       00015610
                 IKKE_FUNNET                 =   '1'B ;                 00015620
                 FATAL_FEIL                  =   '1'B ;                 00015630
                 GO   TO  RETUR;                                        00015640
              END;                                                      00015650
                                                                        00015660
  RETUR:                                                                00015670
                                                                        00015680
  END P15_LES_INNTEKT_GN;                                               00015690
                                                                        00015700
                                                                        00015710
                                                                        00015720
                                                                        00015730
    /* ************************************************************** */00015740
    /* PROCEDURE FOR Å SKRIV OPPLYSNINGER UT PÅ KEYFILEN.             */00015750
    /* ************************************************************** */00015760
                                                                        00015770
  P30_SKRIV_KEYFIL:                                                     00015780
    PROC;                                                               00015790
                                                                        00015800
   DCL                                                                  00015810
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00015820
      KEY_PEKER                  POINTER                  ,             00015830
      KEYFIL_RECL                CHAR (21)                ,             00015840
      KEY                        PIC '(14)9'              ;             00015850
   DCL                                                                  00015860
      01 KEY_OMR                 CHAR(21)   ;                           00015870
   DCL                                                                  00015880
      01 REC_OMR  DEF KEY_OMR,                                          00015890
         02 FNR                  PIC '(11)9',                           00015900
         02 IÅR                  PIC '(2)9',                            00015910
         02 ART                  PIC '(1)9',                            00015920
         02 RAPPDATOM      FIXED DEC (7)   ,                            00015930
         02 AGIVKODE             PIC '(3)9';                            00015940
   DCL                                                                  00015950
      01 HDATO                   PIC '(6)9';                            00015960
   DCL                                                                  00015970
      01 HDATO_REDEF DEF HDATO,                                         00015980
         02 ÅR                   PIC '(2)9',                            00015990
         02 MND                  PIC '(2)9',                            00016000
         02 DAG                  PIC '(2)9';                            00016010
   DCL                                                                  00016020
      01 DATOM                   PIC '(7)9';                            00016030
   DCL                                                                  00016040
      01 DATOM_REDEF DEF DATOM,                                         00016050
         02 ÅR                   PIC '(2)9',                            00016060
         02 MND                  PIC '(2)9',                            00016070
         02 DAG                  PIC '(2)9',                            00016080
         02 M                    CHAR (1);                              00016090
                                                                        00016100
      REC_OMR.FNR       = NISF.FNR;                                     00016110
      REC_OMR.IÅR       = NIS.ÅR(I);                                    00016120
      REC_OMR.ART       = NIS.ART(I);                                   00016130
                                                                        00016140
      HDATO             = DATE();                                       00016150
                                                                        00016160
      DATOM_REDEF.ÅR    = HDATO_REDEF.ÅR;                               00016170
      DATOM_REDEF.MND   = HDATO_REDEF.MND;                              00016180
      DATOM_REDEF.DAG   = HDATO_REDEF.DAG;                              00016190
      DATOM_REDEF.M     = NIS.MERKE(I);                                 00016200
                                                                        00016210
      REC_OMR.RAPPDATOM = DATOM;                                        00016220
      REC_OMR.AGIVKODE  = NIS.AGIVKODE(I);                              00016230
                                                                        00016240
      KEY         = NISF.FNR * 1000 + NIS.ÅR(I) * 10 + NIS.ART(I);      00016250
      KEY_PEKER   = ADDR(KEY);                                          00016260
      KEYFIL_RECL = KEY_OMR;                                            00016270
                                                                        00016280
      EXEC CICS HANDLE CONDITION ERROR   (L110)  ;                      00016290
      EXEC CICS HANDLE CONDITION DUPREC  (ALT_OK);                      00016300
      EXEC CICS WRITE  DATASET ('KEYFIL') RIDFLD (KEY_BIT    )          00016310
                                          FROM   (KEYFIL_RECL);         00016320
      GOTO ALT_OK;                                                      00016330
                                                                        00016340
    L110:                                                               00016350
                                                                        00016360
      FEIL_MELD_NR                =    512  ;                           00016370
      FEIL_VED_LABEL              =   '110';                            00016380
      FATAL_FEIL                  =   '1'B ;                            00016390
                                                                        00016400
    ALT_OK:                                                             00016410
                                                                        00016420
  END P30_SKRIV_KEYFIL;                                                 00016430
                                                                        00016440
                                                                        00016450
                                                                        00016460
                                                                        00016470
                                                                        00016480
    /* ************************************************************** */00016490
    /*                                                                */00016500
    /* PROCEDURE FOR Å SKRIVE KOMPREC.                                */00016510
    /*                                                                */00016520
    /* ************************************************************** */00016530
                                                                        00016540
  P40_SKRIV_KOMPREC:                                                    00016550
    PROC;                                                               00016560
   DCL                                                                  00016570
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00016580
      KEY_PEKER                  POINTER    ,                           00016590
      KEY_RECL                   CHAR (61)  ,                           00016600
      KEY                        PIC '(14)9';                           00016610
   DCL                                                                  00016620
      KOMP_RECL                  CHAR(61);                              00016630
   DCL                                                                  00016640
      01 REC_OMR  DEF KOMP_RECL,                                        00016650
         02 TYPE                 CHAR(1)   ,                            00016660
         02 ETYPE                CHAR(1)   ,                            00016670
         02 IÅR                  PIC '(2)9',                            00016680
         02 KOMMNR         FIXED DEC (4)   ,                            00016690
         02 RAPPDATOM      FIXED DEC (7)   ,                            00016700
         02 FNR            FIXED DEC (11)  ,                            00016710
         02 GMLFNR         FIXED DEC (11)  ,                            00016720
         02 AINNTEKT       FIXED DEC (7)   ,                            00016730
         02 SINNTEKT       FIXED DEC (7)   ,                            00016740
         02 BINNTEKT       FIXED DEC (7)   ,                            00016750
         02 INNTOMB              PIC '(1)9',                            00016760
         02 NAVN                 CHAR(25)  ;                            00016770
   DCL                                                                  00016780
      01 HDATO                   PIC '(6)9';                            00016790
   DCL                                                                  00016800
      01 HDATO_REDEF DEF HDATO,                                         00016810
         02 ÅR                   PIC '(2)9',                            00016820
         02 MND                  PIC '(2)9',                            00016830
         02 DAG                  PIC '(2)9';                            00016840
   DCL                                                                  00016850
      01 DATOM                   PIC '(7)9';                            00016860
   DCL                                                                  00016870
      01 DATOM_REDEF DEF DATOM,                                         00016880
         02 ÅR                   PIC '(2)9',                            00016890
         02 MND                  PIC '(2)9',                            00016900
         02 DAG                  PIC '(2)9',                            00016910
         02 M                    CHAR(1);                               00016920
                                                                        00016930
      REC_OMR.TYPE      = NIS.TYPE(I) ;                                 00016940
      REC_OMR.ETYPE     = NIS.ETYPE(I);                                 00016950
      REC_OMR.IÅR       = NIS.ÅR(I)   ;                                 00016960
                                                                        00016970
      REC_OMR.KOMMNR = NIS.KOMMNR(I);                                   00016980
                                                                        00016990
      HDATO             = DATE()         ;                              00017000
                                                                        00017010
      DATOM_REDEF.ÅR    = HDATO_REDEF.ÅR ;                              00017020
      DATOM_REDEF.MND   = HDATO_REDEF.MND;                              00017030
      DATOM_REDEF.DAG   = HDATO_REDEF.DAG;                              00017040
      DATOM_REDEF.M     = NIS.MERKE(I)   ;                              00017050
                                                                        00017060
      REC_OMR.RAPPDATOM = DATOM          ;                              00017070
      REC_OMR.FNR       = NISF.FNR       ;                              00017080
      REC_OMR.NAVN      = NISF.NAVN      ;                              00017090
      REC_OMR.GMLFNR    = 0              ;                              00017100
      REC_OMR.AINNTEKT  = 0              ;                              00017110
      REC_OMR.SINNTEKT  = 0              ;                              00017120
      REC_OMR.BINNTEKT  = 0              ;                              00017130
                                                                        00017140
      IF NIS.ART(I)     = 1 THEN                                        00017150
         REC_OMR.AINNTEKT  = NIS.PG_INNTEKT(I);                         00017160
      ELSE                                                              00017170
         IF NIS.ART(I)     = 2 THEN                                     00017180
            REC_OMR.SINNTEKT  = NIS.PG_INNTEKT(I);                      00017190
         ELSE                                                           00017200
            IF NIS.ART(I)     = 3 THEN                                  00017210
               REC_OMR.BINNTEKT  = NIS.PG_INNTEKT(I);                   00017220
                                                                        00017230
      KEY_PEKER   = ADDR(KEY);                                          00017240
      KEY_RECL    = KOMP_RECL;                                          00017250
                                                                        00017260
      EXEC CICS HANDLE CONDITION ERROR(L115);                           00017270
      EXEC CICS WRITE DATASET ('KOMP') RIDFLD(KEY_BIT) RBA              00017280
                                                FROM(KEY_RECL);         00017290
      GOTO ALT_OK;                                                      00017300
    L115:                                                               00017310
      FEIL_MELD_NR                =     511;                            00017320
      FEIL_VED_LABEL              =   '115';                            00017330
      FATAL_FEIL                  =   '1'B ;                            00017340
    ALT_OK:                                                             00017350
                                                                        00017360
  END P40_SKRIV_KOMPREC;                                                00017370
                                                                        00017380
                                                                        00017390
  P50_BEHANDLE_INNTEKTER_1:                                             00017400
    PROC;                                                               00017410
                                                                        00017420
      IF  NIS.TYPE(I) = 'C' THEN                                        00017430
          IF (W02_PI_TYPE = 'B'       !                                 00017440
             W02_PI_TYPE  = 'C'       !                                 00017450
             W02_PI_TYPE  = 'D' )     &                                 00017460
             W02_PI_ÅR    = NIS.ÅR(I) &                                 00017470
             W02_PI_MERKE > 3          THEN                             00017480
             FEILTYPE    = 0    ;                                       00017490
          ELSE                                                          00017500
             DO;                                                        00017510
                FEILTYPE    = 4    ;                                    00017520
                IKKE_FUNNET = '1'B ;                                    00017530
                CALL SKRIV_BREV(FEILTYPE,DUMMY_ÅR);                     00017540
             END;                                                       00017550
                                                                        00017560
  RETUR:                                                                00017570
                                                                        00017580
  END P50_BEHANDLE_INNTEKTER_1;                                         00017590
                                                                        00017600
                                                                        00017610
                                                                        00017620
  P60_BEHANDLE_INNTEKTER_2:                                             00017630
    PROC;                                                               00017640
                                                                        00017650
     DCL DUMMY_ÅR    PIC '(2)9';                                        00017660
                                                                        00017670
     DUMMY_ÅR = 0;                                                      00017680
                                                                        00017690
     IF  NIS.TYPE(I) = 'B' THEN                                         00017700
         DO;                                                            00017710
            IF (W02_PI_TYPE = 'V' !                                     00017720
                W02_PI_TYPE = 'W' ) &                                   00017730
                W02_PI_ÅR   = NIS.ÅR(I) THEN                            00017740
                DO;                                                     00017750
                   FEILTYPE    = 5    ;                                 00017760
                   IKKE_FUNNET = '1'B ;                                 00017770
                   CALL SKRIV_BREV(FEILTYPE,DUMMY_ÅR);                  00017780
                END;                                                    00017790
         END;                                                           00017800
     ELSE                                                               00017810
        IF  NIS.TYPE(I) = 'U' THEN                                      00017820
            IF (W02_PI_TYPE = 'B' !                                     00017830
                W02_PI_TYPE = 'C'  !                                    00017840
                W02_PI_TYPE = 'D' ) &                                   00017850
                W02_PI_ÅR   = NIS.ÅR(I) THEN                            00017860
                DO;                                                     00017870
                   FEILTYPE    = 5    ;                                 00017880
                   IKKE_FUNNET = '1'B ;                                 00017890
                   CALL SKRIV_BREV(FEILTYPE,DUMMY_ÅR);                  00017900
                END;                                                    00017910
                                                                        00017920
  END P60_BEHANDLE_INNTEKTER_2;                                         00017930
                                                                        00017940
                                                                        00017950
                                                                        00017960
  P70_BEHANDLE_INNTEKTER_3:                                             00017970
    PROC;                                                               00017980
                                                                        00017990
     DCL DUMMY_ÅR    PIC '(2)9';                                        00018000
                                                                        00018010
      DUMMY_ÅR = 0;                                                     00018020
                                                                        00018030
      IF  (NIS.TYPE(I) = 'B' !                                          00018040
          NIS.TYPE(I)  = 'U') &                                         00018050
          NIS.MERKE(I) > 3       THEN                                   00018060
          IF W02_PI_TYPE = 'E' !                                        00018070
             W02_PI_TYPE = 'F'   THEN                                   00018080
             FEILTYPE    = 0    ;                                       00018090
          ELSE                                                          00018100
             DO;                                                        00018110
                FEILTYPE    = 6    ;                                    00018120
                IKKE_FUNNET = '1'B ;                                    00018130
                CALL SKRIV_BREV(FEILTYPE,DUMMY_ÅR);                     00018140
             END;                                                       00018150
  END P70_BEHANDLE_INNTEKTER_3;                                         00018160
                                                                        00018170
                                                                        00018180
                                                                        00018190
                                                                        00018200
                                                                        00018210
    /* ************************************************************** */00018220
    /*                                                                */00018230
    /* PROCEDURE FOR FINNE RETT TKNR .   (GU KVAL. PÅ ROT OG PINNTEKT)*/00018240
    /*                                                                */00018250
    /*     TKNR FINNES VED 1. OG SJEKKE OM ROTSEGM. FNR > 0  . ER DET */00018260
    /*     IKKE DET BENYTTES KOMMNR. I SISTE INNTEKTS-SEGM.           */00018270
    /*                                                                */00018280
    /* ************************************************************** */00018290
                                                                        00018300
    F100_FINN_TKNR:                                                     00018310
      PROC            ( W100_FNR)   RETURNS (FIXED DEC(4))            ; 00018320
                                                                        00018330
      DCL W100_FNR      FIXED DEC   (11)                              , 00018340
          W100_TKNR     FIXED DEC   ( 4)     INIT     (0)             ; 00018350
                                                                        00018360
                                                                        00018370
                                                                        00018380
      CALL PLITDLI                              (W02_PARM_CT_4,         00018390
                                                 W02_GU,                00018400
                                                 RF1,                   00018410
                                                 RF0PERSN,              00018420
                                                 SSA1_RF0PERSN);        00018430
                                                                        00018440
      IF UIBFCTR                          ^=     UIB_RC_OK         !    00018450
         RF1.STATUS_KODE                  ^=    '  '          THEN      00018460
         DO;                                                            00018470
                                                                        00018480
            /* **************************************************** */  00018490
            /* UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES        */  00018500
            /* **************************************************** */  00018510
  L161:                                                                 00018520
            FEIL_MELD_NR         =     500;                             00018530
            FEIL_VED_LABEL       =    '161';                            00018540
            DB_STATUS_KODE       =     RF1.STATUS_KODE;                 00018550
            GO TO RETUR;                                                00018560
         END;                                                           00018570
                                                                        00018580
                                                                        00018590
      IF RF0PERSN.TKNR                    >      0                THEN  00018600
         W100_TKNR                        =      RF0PERSN.TKNR        ; 00018610
      ELSE                                                              00018620
         DO;                                                            00018630
            CALL PLITDLI                        (W02_PARM_CT_4,         00018640
                                                 W02_GNP,               00018650
                                                 RF1,                   00018660
                                                 W01_PINT,              00018670
                                                 SSA_UQUAL_PINNTEKT_L); 00018680
                                                                        00018690
            IF   UIBFCTR                   =     UIB_RC_OK    THEN      00018700
              DO;                                                       00018710
                 SELECT ( RF1.STATUS_KODE );                            00018720
                                                                        00018730
                    WHEN ( '  ' )                                       00018740
                        W100_TKNR          =     W01_PINT.W02_PI_KOMMNR;00018750
                                                                        00018760
                    WHEN ( 'GE' , 'GB' );                               00018770
                                                                        00018780
                    OTHERWISE                                           00018790
                                                                        00018800
                       /* ******************************************* */00018810
                       /*UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES*/00018820
                       /* ******************************************* */00018830
                       DO;                                              00018840
  L162:                                                                 00018850
                          FEIL_MELD_NR         =     500;               00018860
                          FEIL_VED_LABEL       =    '162';              00018870
                          DB_STATUS_KODE       =     RF1.STATUS_KODE;   00018880
                       END;                                             00018890
                 END;                                                   00018900
              END;                                                      00018910
            ELSE                                                        00018920
              DO;                                                       00018930
                 /* ******************************************* */      00018940
                 /* UIB'S RETUR-CODE ER UAKSEPTABEL             */      00018950
                 /* ******************************************* */      00018960
  L164:                                                                 00018970
                  FEIL_MELD_NR               =     500;                 00018980
                  FEIL_VED_LABEL             =    '164';                00018990
              END;                                                      00019000
         END;                                                           00019010
                                                                        00019020
  RETUR:                                                                00019030
      RETURN (W100_TKNR);                                               00019040
                                                                        00019050
                                                                        00019060
    END F100_FINN_TKNR;                                                 00019070
                                                                        00019080
                                                                        00019090
                                                                        00019100
                                                                        00019110
  SKRIV_FEILMELDING:                                                    00019120
     PROC;                                                              00019130
                                                                        00019140
  /* **************************************************************** */00019150
  /*HENSIKT:                                                          */00019160
  /*    GIR UT FEILMELDING.                                           */00019170
  /*                                                                  */00019180
  /*                                                                  */00019190
  /*BRUK:                                                             */00019200
  /*    CALL SKRIV_FEILMELDING;                                       */00019210
  /*                                                                  */00019220
  /* **************************************************************** */00019230
                                                                        00019240
                                                                        00019250
   IF FATAL_FEIL           THEN                                         00019260
      DO;                                                               00019270
        FEIL_MELDING = 'PROGRAM ' !! DIV_PARAM_OMR.PROGRAM_ID !!        00019280
                               ' GÅR I FEIL VED LABEL NR. '        !!   00019290
                                        DIV_PARAM_OMR.FEIL_VED_LABEL;   00019300
        EXEC CICS PURGE MESSAGE;                                        00019310
        EXEC CICS SEND TEXT FROM (FEIL_MELDING) ACCUM ERASE PAGING      00019320
                                                           JUSTIFY(10); 00019330
                                                                        00019340
        FEIL_STRUC.KOM_OMR_PEKER = COMMAREA_PEKER;                      00019350
        FEIL_STRUC.FEIL_NR       = FEIL_MELD_NR;                        00019360
        EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC);        00019370
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(14)            00019380
                                                         ACCUM PAGING;  00019390
                                                                        00019400
        IF FEIL_MELD_NR        =     500              THEN              00019410
           DO;                                                          00019420
                                                                        00019430
              /* *************************************************** */ 00019440
              /*     DATA-BASE FEIL . RETUR_KODEN LEGGES UT .        */ 00019450
              /* *************************************************** */ 00019460
                                                                        00019470
              FEIL_MELDING     =  '  RETUR_KODE   =  '                  00019480
                                       !! DIV_PARAM_OMR.DB_STATUS_KODE ;00019490
              EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM            00019500
                                               PAGING   JUSTIFY (18);   00019510
           END;                                                         00019520
                                                                        00019530
        ELSE                                                            00019540
           IF FEIL_MELD_NR   =     499              THEN                00019550
              DO;                                                       00019560
                                                                        00019570
               /* *************************************************** */00019580
               /*     PERSON ER UNDER BEHANDLING AV EN ANNEN TRANS    */00019590
               /* *************************************************** */00019600
                                                                        00019610
                                                                        00019620
                 FNR_PIC          =  NISF.FNR;                          00019630
                 FEIL_MELDING     =  '  FNR  =  ' !!  FNR_CHAR ;        00019640
                 EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM         00019650
                                                  PAGING   JUSTIFY (18);00019660
              END;                                                      00019670
           ELSE                                                         00019680
              IF FEIL_MELD_NR   =     512              THEN             00019690
                 DO;                                                    00019700
                                                                        00019710
               /* *************************************************** */00019720
               /*     FEIL I SKRIV AV KEYFIL.                         */00019730
               /* *************************************************** */00019740
                                                                        00019750
                                                                        00019760
                    FNR_PIC          =  NISF.FNR;                       00019770
                    ÅR_PIC           =  NIS.ÅR(I);                      00019780
                    FEIL_MELDING     =  '  FNR  =  ' !!  FNR_CHAR !!    00019790
                                    '  INNTEKTSÅR = ' !!  ÅR_CHAR ;     00019800
                    EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM      00019810
                                                  PAGING   JUSTIFY (18);00019820
                                                                        00019830
                    FEIL_MELDING     =  '  EIBRCODE     =  '            00019840
                                       !! EIBRCODE;                     00019850
                    EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM      00019860
                                               PAGING   JUSTIFY (18);   00019870
                 END;                                                   00019880
           ELSE                                                         00019890
              IF FEIL_MELD_NR   =     511              THEN             00019900
                 DO;                                                    00019910
                                                                        00019920
               /* *************************************************** */00019930
               /*     FEIL I SKRIV AV KOMPREC.                        */00019940
               /* *************************************************** */00019950
                                                                        00019960
                                                                        00019970
                    FNR_PIC          =  NISF.FNR;                       00019980
                    ÅR_PIC           =  NIS.ÅR(I);                      00019990
                    FEIL_MELDING     =  '  FNR  =  ' !!  FNR_CHAR !!    00020000
                                    '  INNTEKTSÅR = ' !!  ÅR_CHAR ;     00020010
                    EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM      00020020
                                                  PAGING   JUSTIFY (18);00020030
                                                                        00020040
                    FEIL_MELDING     =  '  EIBRCODE     =  '            00020050
                                       !! EIBRCODE;                     00020060
                    EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM      00020070
                                               PAGING   JUSTIFY (18);   00020080
                  END;                                                  00020090
                                                                        00020100
        FEIL_MELDING = 'TASKEN BLIR KANSELERT !!!!     ' !!             00020110
                                  'INGEN OPPDATERING ER BLITT UTFØRT. ';00020120
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(22)            00020130
                                                           ACCUM PAGING;00020140
        EXEC CICS SEND PAGE;                                            00020150
                                                                        00020160
        /******** NB!   NB! TASKEN BLIR KANSELERT  ********/            00020170
                                                                        00020180
         EXEC CICS ABEND                                                00020190
                     ABCODE(STOP);                                      00020200
     END;                                                               00020210
  ELSE                                                                  00020220
           IF FEIL_MELD_NR   =     382              THEN                00020230
              DO;                                                       00020240
                 ALLOCATE S001I04O      ;                               00020250
                 S001I04O.MELDING1O =                                   00020260
           'FNR ER I HISTORISK DATABASE ***  REGISTRERINGEN FORKASTES'; 00020270
                                                                        00020280
           S001I04O.MELDING2O =                                         00020290
              '** VENT ** KAN REGISTRERES I MORGEN ***';                00020300
                                                                        00020310
                  EXEC CICS SEND MAP('S001I04')                         00020320
                                 MAPSET('S001I43') CURSOR          ;    00020330
                                                                        00020340
                                                                        00020350
                  EXEC CICS RECEIVE MAP('S001I04')                      00020360
                           MAPSET('S001I43') SET(BMSMAPBR);             00020370
              END;                                                      00020380
                                                                        00020390
  ELSE                                                                  00020400
     DO;                                                                00020410
        DIV_PARAM_OMR.FRA_CICS        = '0'B;                           00020420
        DIV_PARAM_OMR.HENT_FRAM_MAP   = '1'B;                           00020430
        DIV_PARAM_OMR.FRA_MED_DIALOG  = '1'B;                           00020440
        DIV_PARAM_OMR.FRA_UTEN_DIALOG = '0'B;                           00020450
        TRANS_OPPL_OMR.BLANKETTYPE    = 'NI';                           00020460
        EXEC CICS LINK PROGRAM('R0013301')COMMAREA(KOM_OMR);            00020470
     END;                                                               00020480
                                                                        00020490
  END SKRIV_FEILMELDING;                                                00020500
                                                                        00020510
  SKRIV_FFU_DATA:                                                       00020520
     PROC;                                                              00020530
                                                                        00020540
  /* **************************************************************** */00020550
  /*HENSIKT:                                                          */00020560
  /*    SKRIVER OPPLYSNINGER UT PÅ BREVFIL FOR BRUK TIL FFURAPPORT*/    00020570
  /*                                                                  */00020580
  /*                                                                  */00020590
  /*BRUK:                                                             */00020600
  /*    CALL SKRIV_FFU_DATA;                                          */00020610
  /*                                                                  */00020620
  /* **************************************************************** */00020630
   DCL                                                                  00020640
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00020650
      KEY_PEKER                  POINTER    ,                           00020660
      KEY_RECL                   CHAR (70)  ,                           00020670
      KEY                        CHAR(13)   ;                           00020680
   DCL                                                                  00020690
      FFU_RECL                  CHAR(70)   ;                            00020700
   DCL                                                                  00020710
      01 REC_OMR  DEF FFU_RECL,                                         00020720
         02 FNR                  PIC '(11)9',                           00020730
         02 IÅR1                 PIC '(2)9' ,                           00020740
         02 NAVN                 CHAR(25)   ,                           00020750
         02 INNTEKT              PIC '(7)9' ,                           00020760
         02 KOMMNR               PIC '(4)9' ,                           00020770
         02 AGIVNR               PIC '(3)9' ,                           00020780
         02 RAPPDATO             PIC '(6)9' ,                           00020790
         02 FILLER               CHAR(12)   ;                           00020800
   DCL                                                                  00020810
      01 DATO                    PIC '(6)9';                            00020820
   DCL                                                                  00020830
      01 DATO_REDEF DEF DATO,                                           00020840
         02 DAG                  PIC '(2)9',                            00020850
         02 MND                  PIC '(2)9',                            00020860
         02 ÅR                   PIC '(2)9';                            00020870
                                                                        00020880
   DCL                                                                  00020890
      01 HDATO                   PIC '(6)9';                            00020900
   DCL                                                                  00020910
      01 HDATO_REDEF DEF HDATO,                                         00020920
         02 ÅR                   PIC '(2)9',                            00020930
         02 MND                  PIC '(2)9',                            00020940
         02 DAG                  PIC '(2)9';                            00020950
                                                                        00020960
  DCL 01 NYKKEL     DEF KEY,                                            00020970
         02 FNR_N                PIC '(11)9',                           00020980
         02 IÅR_N                PIC '(2)9' ;                           00020990
                                                                        00021000
      HDATO             = DATE();                                       00021010
                                                                        00021020
      DATO_REDEF.ÅR     = HDATO_REDEF.ÅR ;                              00021030
      DATO_REDEF.MND    = HDATO_REDEF.MND;                              00021040
      DATO_REDEF.DAG    = HDATO_REDEF.DAG;                              00021050
                                                                        00021060
      KEY_PEKER = ADDR(KEY);                                            00021070
                                                                        00021080
      REC_OMR.RAPPDATO  = DATO             ;                            00021090
                                                                        00021100
      NYKKEL.FNR_N      = NISF.FNR         ;                            00021110
      NYKKEL.IÅR_N      = NIS.ÅR(I)       ;                             00021120
                                                                        00021130
      REC_OMR.FNR       = NISF.FNR         ;                            00021140
      REC_OMR.NAVN      = NISF.NAVN        ;                            00021150
      REC_OMR.IÅR1      = NIS.ÅR(I)        ;                            00021160
      REC_OMR.INNTEKT   = NIS.PG_INNTEKT(I);                            00021170
      REC_OMR.KOMMNR    = NIS.KOMMNR(I)    ;                            00021180
      REC_OMR.AGIVNR    = NIS.AGIVKODE(I)  ;                            00021190
                                                                        00021200
                                                                        00021210
      KEY_RECL    = FFU_RECL;                                           00021220
                                                                        00021230
                                                                        00021240
                                                                        00021250
      EXEC CICS HANDLE CONDITION ERROR(L120);                           00021260
      EXEC CICS HANDLE CONDITION DUPREC(ALT_OK);                        00021270
      EXEC CICS WRITE DATASET ('FFUDATA') RIDFLD(KEY_BIT) RBA           00021280
                                                FROM(KEY_RECL);         00021290
      GOTO ALT_OK;                                                      00021300
    L120:                                                               00021310
      FEIL_MELD_NR                =     516;                            00021320
      FEIL_VED_LABEL              =   '120';                            00021330
      FATAL_FEIL                  =   '1'B ;                            00021340
    ALT_OK:                                                             00021350
                                                                        00021360
                                                                        00021370
  END SKRIV_FFU_DATA;                                                   00021380
                                                                        00021390
                                                                        00021400
                                                                        00021410
                                                                        00021420
                                                                        00021430
  SKRIV_BREV:                                                           00021440
     PROC(FEILTYPE,D_ÅR);                                               00021450
                                                                        00021460
  /* **************************************************************** */00021470
  /*HENSIKT:                                                          */00021480
  /*    SKRIVER BREV OM FEILSITUASJONER.                              */00021490
  /*                                                                  */00021500
  /*                                                                  */00021510
  /*BRUK:                                                             */00021520
  /*    CALL SKRIV_BREV(FEILTYPE,D_ÅR);                               */00021530
  /*                                                                  */00021540
  /* **************************************************************** */00021550
   DCL                                                                  00021560
     1 CHARLIST2,                                                       00021570
       2 PRINT,                                                         00021580
         3 TERMID CHAR(4) INIT('    '),                                 00021590
         3 RESERV CHAR(12) INIT(' '),                                   00021600
       2 SLUTT2,                                                        00021610
         3 SLUTT  FIXED BIN(15) INIT(-1),                               00021620
         3 RESERV CHAR(14)      INIT(' ');                              00021630
                                                                        00021640
                                                                        00021650
   DCL                                                                  00021660
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00021670
      KEY_PEKER                  POINTER,                               00021680
      KOMMNR_RECL                CHAR (100);                            00021690
   DCL                                                                  00021700
      01 KOMMNR_OMR  DEF KOMMNR_RECL,                                   00021710
         02 NR                   PIC '(4)9' ,                           00021720
         02 NAVN                 CHAR (25),                             00021730
         02 ADR1                 CHAR (35),                             00021740
         02 ADR2                 CHAR (30),                             00021750
         02 FILLER               CHAR ( 6);                             00021760
                                                                        00021770
   DCL                                                                  00021780
      UTLINJE1                   CHAR(80)   ;                           00021790
   DCL                                                                  00021800
      FEILTYPE                   PIC '9'    ;                           00021810
   DCL                                                                  00021820
      ANT_GANGER                 PIC '(2)9' ;                           00021830
   DCL                                                                  00021840
      01 NAVN_1                  CHAR (35)  ;                           00021850
   DCL                                                                  00021860
      01 PIC_INNTEKT1            PIC 'Z.ZZZ.ZZ9';                       00021870
   DCL                                                                  00021880
      01 DATO                    PIC '(6)9';                            00021890
   DCL                                                                  00021900
      01 DATO_REDEF DEF DATO,                                           00021910
         02 DAG                  PIC '(2)9',                            00021920
         02 MND                  PIC '(2)9',                            00021930
         02 ÅR                   PIC '(2)9';                            00021940
                                                                        00021950
   DCL                                                                  00021960
      01 D_ÅR                    PIC '99';                              00021970
   DCL                                                                  00021980
      01 HDATO                   PIC '(6)9';                            00021990
   DCL                                                                  00022000
      01 HDATO_REDEF DEF HDATO,                                         00022010
         02 ÅR                   PIC '(2)9',                            00022020
         02 MND                  PIC '(2)9',                            00022030
         02 DAG                  PIC '(2)9';                            00022040
                                                                        00022050
      TERMID  = 'R1B7';                                                 00022060
                                                                        00022070
      HDATO             = DATE();                                       00022080
                                                                        00022090
      DATO_REDEF.ÅR     = HDATO_REDEF.ÅR ;                              00022100
      DATO_REDEF.MND    = HDATO_REDEF.MND;                              00022110
      DATO_REDEF.DAG    = HDATO_REDEF.DAG;                              00022120
                                                                        00022130
                                                                        00022140
      /*   HENTER KOMMUNEOPPLYSNINGER   ********/                       00022150
                                                                        00022160
      KEY_PEKER   = ADDR(NIS.KOMMNR(I));                                00022170
                                                                        00022180
                                                                        00022190
      EXEC CICS HANDLE CONDITION ERROR(IKKE_FUNNET1);                   00022200
                                                                        00022210
      EXEC CICS READ DATASET ('KOMTAB') RIDFLD(KEY_BIT)                 00022220
                                                    INTO(KOMMNR_RECL);  00022230
      GO TO OK1;                                                        00022240
                                                                        00022250
  IKKE_FUNNET1:                                                         00022260
      NAVN_1   = 'UKJENT KOMMUNENR.';                                   00022270
  OK1:                                                                  00022280
      NAVN_1   = KOMMNR_OMR.NAVN;                                       00022290
                                                                        00022300
      ALLOCATE S001I04O;                                                00022310
      ALLOCATE S001I04I;                                                00022320
      EXEC CICS LOAD PROGRAM('S001I43');                                00022330
                                                                        00022340
      S001I04O.MELDING1O = '';                                          00022350
      S001I04O.MELDING2O = '';                                          00022360
      S001I04O.MELDING3O = '';                                          00022370
      S001I04O.MELDING4O = '';                                          00022380
      S001I04O.MELDING5O = '';                                          00022390
      S001I04O.MELDING6O = '';                                          00022400
                                                                        00022410
      SELECT (FEILTYPE);                                                00022420
         WHEN (1)                                                       00022430
           DO;                                                          00022440
                                                                        00022450
  /* **************************************************************** */00022460
  /*    SKRIVER UT RAPPORT NR.1 PÅ LOKAL SKRIVER.                     */00022470
  /*                                                                  */00022480
  /*                                                                  */00022490
  /*                                                                  */00022500
  /*    INNTEKT REGISTRERT PÅ DØD PERSON.                             */00022510
  /*                                                                  */00022520
  /* **************************************************************** */00022530
                                                                        00022540
                                                                        00022550
                                                                        00022560
        S001I04O.MELDING2O =                                            00022570
                                                                        00022580
        '**** P E R S O N E N  E R  D Ø D ****';                        00022590
                                                                        00022600
        S001I04O.MELDING4O =                                            00022610
                                                                        00022620
                   'KLARGJØR PRINTER OG TRYKK ENTER.';                  00022630
                                                                        00022640
        S001I04O.MELDING6O =                                            00022650
                                                                        00022660
                    '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).'; 00022670
                                                                        00022680
                                                                        00022690
        EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;         00022700
          /*                                           DATAONLY ;*/     00022710
                                                                        00022720
        /* DUMMY RECEIVE-KALL.                                     */   00022730
                                                                        00022740
        EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')              00022750
                                               SET(BMSMAPBR);           00022760
                                                                        00022770
        EXEC CICS ROUTE LIST (CHARLIST2);                               00022780
                                                                        00022790
                                                                        00022800
        UTLINJE1 = '                                                  ' 00022810
                   !! '                OSLO, ' !! DATO;                 00022820
                                                                        00022830
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                        00022840
                                                                        00022850
                                                                        00022860
                                                                        00022870
        ANT_GANGER = 3;                                                 00022880
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00022890
                                                                        00022900
        UTLINJE1 = '    TIL LIGNINGSSJEFEN I ' !! KOMMNR_OMR.NAVN;      00022910
                                                                        00022920
        CALL SEND_UTLINJE(UTLINJE1);                                    00022930
                                                                        00022940
        UTLINJE1 = '                         ' !! KOMMNR_OMR.ADR1;      00022950
                                                                        00022960
        CALL SEND_UTLINJE(UTLINJE1);                                    00022970
                                                                        00022980
                                                                        00022990
        UTLINJE1 = '                         ' !! KOMMNR_OMR.ADR2;      00023000
                                                                        00023010
        CALL SEND_UTLINJE(UTLINJE1);                                    00023020
                                                                        00023030
        ANT_GANGER = 4;                                                 00023040
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00023050
                                                                        00023060
        UTLINJE1 = '    ' !! NISF.FNR !! '  ' !! NISF.NAVN;             00023070
                                                                        00023080
        CALL SEND_UTLINJE(UTLINJE1);                                    00023090
        EXEC CICS SEND TEXT FROM(BLANKLINJE) ACCUM PAGING L80 PRINT;    00023100
                                                                        00023110
        UTLINJE1 = '    RAPPORTERING AV PENSJONSGIVENDE INNTEKT FOR ÅR' 00023120
                   !! ' ETTER REGISTRERT';                              00023130
                                                                        00023140
        CALL SEND_UTLINJE(UTLINJE1);                                    00023150
                                                                        00023160
        UTLINJE1 = '    DØDSÅR.';                                       00023170
                                                                        00023180
        CALL SEND_UTLINJE(UTLINJE1);                                    00023190
        ANT_GANGER = 1;                                                 00023200
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00023210
                                                                        00023220
        UTLINJE1 = '    FOR OVENNEVNTE SKATTEYTER ER PENSJONSGIVENDE '  00023230
                   !! 'INNTEKT INN-';                                   00023240
                                                                        00023250
        CALL SEND_UTLINJE(UTLINJE1);                                    00023260
                                                                        00023270
        PIC_INNTEKT1 = NIS.PG_INNTEKT(I);                               00023280
                                                                        00023290
        UTLINJE1 = '    RAPPORTERT TIL RIKSTRYGDEVERKET MED KR  '       00023300
                   !! PIC_INNTEKT1 !! ' FOR';                           00023310
                                                                        00023320
        CALL SEND_UTLINJE(UTLINJE1);                                    00023330
                                                                        00023340
                                                                        00023350
        UTLINJE1 = '    INNTEKTSÅRET 19' !! NIS.ÅR(I) !! '.';           00023360
                                                                        00023370
        CALL SEND_UTLINJE(UTLINJE1);                                    00023380
        ANT_GANGER = 1;                                                 00023390
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00023400
                                                                        00023410
                                                                        00023420
        UTLINJE1 = '    I FØLGE VÅRT REGISTER ER VEDKOMMENDE SKATTEYTER'00023430
                   !! ' DØD I 19' !! D_ÅR !! ',';                       00023440
                                                                        00023450
        CALL SEND_UTLINJE(UTLINJE1);                                    00023460
                                                                        00023470
                                                                        00023480
        UTLINJE1 = '    OG DET INNRAPPORTERTE BELØP BLIR AV DEN GRUNN'  00023490
                   !! ' IKKE REGI-';                                    00023500
                                                                        00023510
        CALL SEND_UTLINJE(UTLINJE1);                                    00023520
                                                                        00023530
        UTLINJE1 = '    STRERT.';                                       00023540
                                                                        00023550
        CALL SEND_UTLINJE(UTLINJE1);                                    00023560
        ANT_GANGER = 4;                                                 00023570
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00023580
                                                                        00023590
                                                                        00023600
        UTLINJE1 = '                                RIKSTRYGDEVERKET';  00023610
                                                                        00023620
        CALL SEND_UTLINJE(UTLINJE1);                                    00023630
                                                                        00023640
                                                                        00023650
        EXEC CICS SEND PAGE;                                            00023660
                                                                        00023670
           END;                                                         00023680
                                                                        00023690
         WHEN (2)                                                       00023700
           DO;                                                          00023710
                                                                        00023720
  /* **************************************************************** */00023730
  /*    SKRIVER UT RAPPORT NR.2 PÅ LOKAL SKRIVER.                     */00023740
  /*                                                                  */00023750
  /* NULLINNTEKT RAPPORTERT FRA EN ANNEN KOMMUNE.                     */00023760
  /*                                                                  */00023770
  /* **************************************************************** */00023780
                                                                        00023790
     DCL PI PIC '(9)9';                                                 00023800
                                                                        00023810
        S001I04O.MELDING2O =                                            00023820
                                                                        00023830
        '**** F E I L  I N N R A P P O R T E R I N G ****';             00023840
                                                                        00023850
        S001I04O.MELDING4O =                                            00023860
                                                                        00023870
                   'KLARGJØR PRINTER OG TRYKK ENTER.';                  00023880
                                                                        00023890
        S001I04O.MELDING6O =                                            00023900
                                                                        00023910
                    '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).'; 00023920
                                                                        00023930
                                                                        00023940
        EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;         00023950
                                                                        00023960
        /* DUMMY RECEIVE-KALL.                                     */   00023970
                                                                        00023980
        EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')              00023990
                                               SET(BMSMAPBR);           00024000
                                                                        00024010
        EXEC CICS ROUTE LIST (CHARLIST2);                               00024020
                                                                        00024030
                                                                        00024040
        UTLINJE1 = '                                                  ' 00024050
                   !! '                OSLO, ' !! DATO;                 00024060
                                                                        00024070
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                        00024080
                                                                        00024090
                                                                        00024100
        ANT_GANGER = 3;                                                 00024110
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00024120
                                                                        00024130
        UTLINJE1 = '    TIL SKATTEDIREKTORATET';                        00024140
                                                                        00024150
                                                                        00024160
        CALL SEND_UTLINJE(UTLINJE1);                                    00024170
                                                                        00024180
        ANT_GANGER = 3;                                                 00024190
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00024200
                                                                        00024210
        UTLINJE1 = '    FNR: ' !! NISF.FNR                              00024220
                  !! '  NAVN: ' !! NISF.NAVN                            00024230
                  !! '    INNTEKTSÅR: ' !! NIS.ÅR(I);                   00024240
                                                                        00024250
        CALL SEND_UTLINJE(UTLINJE1);                                    00024260
                                                                        00024270
        ANT_GANGER = 1;                                                 00024280
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00024290
                                                                        00024300
        UTLINJE1 = '    FOR OVENNEVTE SKATTEYTER ER'                    00024310
                   !! 'NULLINNTEKT RAPPORTERT FRA EN ANNEN KOMMUNE';    00024320
                                                                        00024330
        CALL SEND_UTLINJE(UTLINJE1);                                    00024340
                                                                        00024350
        UTLINJE1 = '    ENN TIDLIGERE RAPPORTERT INNTEKT OVER NULL.';   00024360
                                                                        00024370
        CALL SEND_UTLINJE(UTLINJE1);                                    00024380
                                                                        00024390
                                                                        00024400
        UTLINJE1 = '    NULLINNTEKT ER RAPPORTERT FRA '                 00024410
                   !! ' KOMMUNENR. ' !! NIS.KOMMNR(I) !! ',';           00024420
        CALL SEND_UTLINJE(UTLINJE1);                                    00024430
                                                                        00024440
        PI = W02_PI * 100;                                              00024450
        UTLINJE1 = '    MENS TIDLIGERE ER DET RAPPORTERT  '             00024460
             !! 'INNTEKT MED KR. ' !! PI !! 'FRA';                      00024470
                                                                        00024480
        CALL SEND_UTLINJE(UTLINJE1);                                    00024490
                                                                        00024500
        UTLINJE1 = '    KOMMUNENR. ' !! CHAR(W02_PI_KOMMNR);            00024510
        CALL SEND_UTLINJE(UTLINJE1);                                    00024520
                                                                        00024530
                                                                        00024540
        ANT_GANGER = 4;                                                 00024550
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00024560
                                                                        00024570
                                                                        00024580
                                                                        00024590
        UTLINJE1 = '                                         '          00024600
                !! '        RIKSTRYGDEVERKET';                          00024610
                                                                        00024620
        CALL SEND_UTLINJE(UTLINJE1);                                    00024630
                                                                        00024640
                                                                        00024650
        EXEC CICS SEND PAGE;                                            00024660
                                                                        00024670
                                                                        00024680
           END;                                                         00024690
                                                                        00024700
         WHEN (3)                                                       00024710
           DO;                                                          00024720
                                                                        00024730
                                                                        00024740
  /* **************************************************************** */00024750
  /*    SKRIVER UT RAPPORT NR.3 PÅ LOKAL SKRIVER.                     */00024760
  /*    BREV NR.1                                                     */00024770
  /*                                                                  */00024780
  /*                                                                  */00024790
  /* **************************************************************** */00024800
                                                                        00024810
    DCL KOMMNR PIC '(4)9';                                              00024820
                                                                        00024830
                                                                        00024840
        S001I04O.MELDING2O =                                            00024850
                                                                        00024860
        '**** I N N T E K T  F R A  T O  K O M M U N E R ****';         00024870
                                                                        00024880
        S001I04O.MELDING3O =                                            00024890
                                                                        00024900
        '**** B R E V NR.1 **************';                             00024910
                                                                        00024920
        S001I04O.MELDING4O =                                            00024930
                                                                        00024940
                   'KLARGJØR PRINTER OG TRYKK ENTER.';                  00024950
                                                                        00024960
        S001I04O.MELDING6O =                                            00024970
                                                                        00024980
                    '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).'; 00024990
                                                                        00025000
                                                                        00025010
        EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;         00025020
                                                                        00025030
        /* DUMMY RECEIVE-KALL.                                     */   00025040
                                                                        00025050
        EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')              00025060
                                               SET(BMSMAPBR);           00025070
                                                                        00025080
        EXEC CICS ROUTE LIST (CHARLIST2);                               00025090
                                                                        00025100
                                                                        00025110
        UTLINJE1 = '                                                  ' 00025120
                   !! '                OSLO, ' !! DATO;                 00025130
                                                                        00025140
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                        00025150
                                                                        00025160
                                                                        00025170
        ANT_GANGER = 3;                                                 00025180
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00025190
                                                                        00025200
        UTLINJE1 = '    TIL LIGNINGSSJEFEN I ' !! KOMMNR_OMR.NAVN;      00025210
                                                                        00025220
        CALL SEND_UTLINJE(UTLINJE1);                                    00025230
                                                                        00025240
        UTLINJE1 = '                         ' !! KOMMNR_OMR.ADR1;      00025250
                                                                        00025260
        CALL SEND_UTLINJE(UTLINJE1);                                    00025270
                                                                        00025280
                                                                        00025290
        UTLINJE1 = '                         ' !! KOMMNR_OMR.ADR2;      00025300
                                                                        00025310
        CALL SEND_UTLINJE(UTLINJE1);                                    00025320
                                                                        00025330
        ANT_GANGER = 3;                                                 00025340
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00025350
                                                                        00025360
        UTLINJE1 = '    ' !! NISF.FNR !! '  ' !! NISF.NAVN;             00025370
                                                                        00025380
        CALL SEND_UTLINJE(UTLINJE1);                                    00025390
                                                                        00025400
        ANT_GANGER = 1;                                                 00025410
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00025420
        UTLINJE1 = '    RAPPORTERING AV PENSJONSGIVENDE INNTEKT FOR INN'00025430
                   !! 'TEKTSÅRET 19' !! NIS.ÅR(I);                      00025440
                                                                        00025450
        CALL SEND_UTLINJE(UTLINJE1);                                    00025460
                                                                        00025470
                                                                        00025480
        ANT_GANGER = 1;                                                 00025490
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00025500
                                                                        00025510
                                                                        00025520
                                                                        00025530
        UTLINJE1 = '    FOR OVENNEVNTE SKATTEYTER ER PENSJONSGIVENDE '  00025540
                   !! 'INNTEKT FOR 19' !! NIS.ÅR(I);                    00025550
                                                                        00025560
        CALL SEND_UTLINJE(UTLINJE1);                                    00025570
                                                                        00025580
                                                                        00025590
        UTLINJE1 = '    INNRAPPORTERT BÅDE FRA:';                       00025600
                                                                        00025610
        CALL SEND_UTLINJE(UTLINJE1);                                    00025620
                                                                        00025630
        ANT_GANGER = 1;                                                 00025640
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00025650
                                                                        00025660
                                                                        00025670
                                                                        00025680
        UTLINJE1 = '                      A: ' !! NIS.KOMMNR(I) !! ' '  00025690
                          !! NAVN_1;                                    00025700
                                                                        00025710
        CALL SEND_UTLINJE(UTLINJE1);                                    00025720
                                                                        00025730
        ANT_GANGER = 1;                                                 00025740
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00025750
                                                                        00025760
        KOMMNR = W02_PI_KOMMNR;                                         00025770
                                                                        00025780
        /*   HENTER KOMMUNEOPPLYSNINGER FRA KOMMUNE NR.2  ********/     00025790
                                                                        00025800
        KEY_PEKER = ADDR(KOMMNR);                                       00025810
                                                                        00025820
        EXEC CICS HANDLE CONDITION ERROR(IKKE_FUNNET2);                 00025830
                                                                        00025840
        EXEC CICS READ DATASET ('KOMTAB') RIDFLD(KEY_BIT)               00025850
                                                    INTO(KOMMNR_RECL);  00025860
        GO TO OK2;                                                      00025870
                                                                        00025880
  IKKE_FUNNET2:                                                         00025890
        KOMMNR_OMR.NAVN = 'UKJENT KOMMUNENR.';                          00025900
  OK2:                                                                  00025910
                                                                        00025920
                                                                        00025930
                                                                        00025940
                                                                        00025950
        UTLINJE1 = '                      B: ' !! CHAR(W02_PI_KOMMNR)   00025960
                  !! ' ' !! KOMMNR_OMR.NAVN;                            00025970
                                                                        00025980
        CALL SEND_UTLINJE(UTLINJE1);                                    00025990
                                                                        00026000
        ANT_GANGER = 2;                                                 00026010
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00026020
                                                                        00026030
                                                                        00026040
                                                                        00026050
                                                                        00026060
        UTLINJE1 = '    RIKSTRYGDEVERKET HAR REGISTRERT DEN PENSJONSGI' 00026070
                   !! 'VENDE INNTEKT';                                  00026080
                                                                        00026090
        CALL SEND_UTLINJE(UTLINJE1);                                    00026100
                                                                        00026110
                                                                        00026120
                                                                        00026130
                                                                        00026140
        UTLINJE1 = '    FRA A, MENS DEN PENSJONSGIVENDE INNTEKT FRA B'  00026150
                   !! ' ER AVVIST.';                                    00026160
                                                                        00026170
        CALL SEND_UTLINJE(UTLINJE1);                                    00026180
                                                                        00026190
                                                                        00026200
                                                                        00026210
        UTLINJE1 = '    ÅRSAKEN TIL DETTE ER AT INNTEKTEN FRA A ER'     00026220
                   !! ' REGISTRERT FØRST.';                             00026230
                                                                        00026240
        CALL SEND_UTLINJE(UTLINJE1);                                    00026250
        ANT_GANGER = 1;                                                 00026260
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00026270
                                                                        00026280
                                                                        00026290
                                                                        00026300
                                                                        00026310
        UTLINJE1 = '    VI ANMODER DE BERØRTE KOMMUNER OM Å BRINGE SKA' 00026320
                   !! 'TTEYTERS RIKTIGE';                               00026330
                                                                        00026340
        CALL SEND_UTLINJE(UTLINJE1);                                    00026350
                                                                        00026360
                                                                        00026370
                                                                        00026380
                                                                        00026390
        UTLINJE1 = '    SKATTEKOMMUNE FOR 19' !! NIS.ÅR(I)              00026400
                   !! ' PÅ DET RENE, DERSOM FORHOLDET IKKE ALLE-';      00026410
                                                                        00026420
        CALL SEND_UTLINJE(UTLINJE1);                                    00026430
                                                                        00026440
                                                                        00026450
        UTLINJE1 =    '    REDE ER AVKLARET.';                          00026460
                                                                        00026470
        CALL SEND_UTLINJE(UTLINJE1);                                    00026480
                                                                        00026490
                                                                        00026500
                                                                        00026510
        EXEC CICS SEND PAGE RETAIN;                                     00026520
                                                                        00026530
                                                                        00026540
                                                                        00026550
        EXEC CICS ROUTE LIST (CHARLIST2);                               00026560
                                                                        00026570
                                                                        00026580
        UTLINJE1 = '    RUTINENE DERETTER :';                           00026590
                                                                        00026600
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                        00026610
        ANT_GANGER = 2;                                                 00026620
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00026630
                                                                        00026640
                                                                        00026650
                                                                        00026660
                                                                        00026670
                                                                        00026680
                                                                        00026690
        UTLINJE1 = '           1. DERSOM A FASTHOLDER SKATTEPLIKTEN'    00026700
                   !! ' ER DET IKKE NØD-';                              00026710
                                                                        00026720
        CALL SEND_UTLINJE(UTLINJE1);                                    00026730
                                                                        00026740
                                                                        00026750
                                                                        00026760
                                                                        00026770
        UTLINJE1 = '              VENDIG Å FORETA SEG NOE(MED MINDRE'   00026780
                   !! ' ANDRE ANSETTELSER';                             00026790
        CALL SEND_UTLINJE(UTLINJE1);                                    00026800
                                                                        00026810
                                                                        00026820
                                                                        00026830
                                                                        00026840
        UTLINJE1 = '              SKAL ENDRES).';                       00026850
                                                                        00026860
        CALL SEND_UTLINJE(UTLINJE1);                                    00026870
                                                                        00026880
        ANT_GANGER = 2;                                                 00026890
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00026900
                                                                        00026910
                                                                        00026920
                                                                        00026930
                                                                        00026940
        UTLINJE1 = '           2. DERSOM A FRAFALLER SKATTEPLIKTEN'     00026950
                   !! ' MELDES AVGANG';                                 00026960
                                                                        00026970
        CALL SEND_UTLINJE(UTLINJE1);                                    00026980
                                                                        00026990
                                                                        00027000
                                                                        00027010
                                                                        00027020
        UTLINJE1 = '              VED Å PÅFØRE KODE "9" I RUTEN '       00027030
                   !! '"P.KODE" PÅ DEN';                                00027040
                                                                        00027050
        CALL SEND_UTLINJE(UTLINJE1);                                    00027060
                                                                        00027070
                                                                        00027080
                                                                        00027090
                                                                        00027100
        UTLINJE1 = '              ORDINÆRE LIGNINGSBLANKETT'            00027110
                                            !! '.BLANKETTEN SENDES';    00027120
                                                                        00027130
        CALL SEND_UTLINJE(UTLINJE1);                                    00027140
                                                                        00027150
                                                                        00027160
                                                                        00027170
                                                                        00027180
        UTLINJE1 = '              DATASENTERET FOR SKATTEVESENET '      00027190
                         !! 'SAMMEN MED';                               00027200
                                                                        00027210
        CALL SEND_UTLINJE(UTLINJE1);                                    00027220
                                                                        00027230
        UTLINJE1 = '              EVENTUELLE ANDRE RETTEBLANKETTER.';   00027240
                                                                        00027250
        CALL SEND_UTLINJE(UTLINJE1);                                    00027260
                                                                        00027270
        ANT_GANGER = 4;                                                 00027280
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00027290
                                                                        00027300
                                                                        00027310
                                                                        00027320
        UTLINJE1 = '    SKATTEDIREKTORATET                   '          00027330
                !! '        RIKSTRYGDEVERKET';                          00027340
                                                                        00027350
        CALL SEND_UTLINJE(UTLINJE1);                                    00027360
                                                                        00027370
                                                                        00027380
        EXEC CICS SEND PAGE RETAIN;                                     00027390
                                                                        00027400
                                                                        00027410
                                                                        00027420
                                                                        00027430
  /* **************************************************************** */00027440
  /*    SKRIVER UT RAPPORT NR.3 PÅ LOKAL SKRIVER.                     */00027450
  /*    BREV NR.2                                                     */00027460
  /*                                                                  */00027470
  /*                                                                  */00027480
  /* **************************************************************** */00027490
                                                                        00027500
                                                                        00027510
        ALLOCATE S001I04O;                                              00027520
        ALLOCATE S001I04I;                                              00027530
        EXEC CICS LOAD PROGRAM('S001I43');                              00027540
                                                                        00027550
        S001I04O.MELDING3O =                                            00027560
                                                                        00027570
        '**** B R E V 2 **************';                                00027580
                                                                        00027590
        S001I04O.MELDING3O = '                                 ';       00027600
                                                                        00027610
        S001I04O.MELDING4O =                                            00027620
                                                                        00027630
                   'KLARGJØR PRINTER OG TRYKK ENTER.';                  00027640
                                                                        00027650
        S001I04O.MELDING6O =                                            00027660
                                                                        00027670
                    '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).'; 00027680
                                                                        00027690
                                                                        00027700
        EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;         00027710
                                                                        00027720
        /* DUMMY RECEIVE-KALL.                                     */   00027730
                                                                        00027740
        EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')              00027750
                                               SET(BMSMAPBR);           00027760
                                                                        00027770
        EXEC CICS ROUTE LIST (CHARLIST2);                               00027780
                                                                        00027790
                                                                        00027800
                                                                        00027810
                                                                        00027820
        UTLINJE1 = '                                                  ' 00027830
                   !! '                OSLO, ' !! DATO;                 00027840
                                                                        00027850
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                        00027860
                                                                        00027870
                                                                        00027880
                                                                        00027890
        ANT_GANGER = 4;                                                 00027900
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00027910
                                                                        00027920
                                                                        00027930
                                                                        00027940
        UTLINJE1 = '    TIL LIGNINGSSJEFEN I ' !! KOMMNR_OMR.NAVN;      00027950
                                                                        00027960
        CALL SEND_UTLINJE(UTLINJE1);                                    00027970
                                                                        00027980
                                                                        00027990
                                                                        00028000
        UTLINJE1 = '                         ' !! KOMMNR_OMR.ADR1;      00028010
                                                                        00028020
        CALL SEND_UTLINJE(UTLINJE1);                                    00028030
                                                                        00028040
                                                                        00028050
        UTLINJE1 = '                         ' !! KOMMNR_OMR.ADR2;      00028060
                                                                        00028070
        CALL SEND_UTLINJE(UTLINJE1);                                    00028080
                                                                        00028090
        ANT_GANGER = 3;                                                 00028100
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00028110
                                                                        00028120
                                                                        00028130
                                                                        00028140
        UTLINJE1 = '    ' !! NISF.FNR !! '  ' !! NISF.NAVN;             00028150
                                                                        00028160
        CALL SEND_UTLINJE(UTLINJE1);                                    00028170
        ANT_GANGER = 1;                                                 00028180
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00028190
                                                                        00028200
                                                                        00028210
                                                                        00028220
        UTLINJE1 = '    RAPPORTERING AV PENSJONSGIVENDE INNTEKT FOR INN'00028230
                   !! 'TEKTSÅRET 19' !! NIS.ÅR(I);                      00028240
                                                                        00028250
        CALL SEND_UTLINJE(UTLINJE1);                                    00028260
                                                                        00028270
                                                                        00028280
        ANT_GANGER = 1;                                                 00028290
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00028300
                                                                        00028310
                                                                        00028320
                                                                        00028330
        UTLINJE1 = '    FOR OVENNEVNTE SKATTEYTER ER PENSJONSGIVENDE '  00028340
                   !! 'INNTEKT FOR 19' !! NIS.ÅR(I);                    00028350
                                                                        00028360
        CALL SEND_UTLINJE(UTLINJE1);                                    00028370
                                                                        00028380
                                                                        00028390
                                                                        00028400
                                                                        00028410
        UTLINJE1 = '    INNRAPPORTERT BÅDE FRA:';                       00028420
                                                                        00028430
        CALL SEND_UTLINJE(UTLINJE1);                                    00028440
                                                                        00028450
        ANT_GANGER = 1;                                                 00028460
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00028470
                                                                        00028480
                                                                        00028490
                                                                        00028500
        UTLINJE1 = '                      A: ' !! NIS.KOMMNR(I) !! ' '  00028510
                          !! NAVN_1;                                    00028520
                                                                        00028530
        CALL SEND_UTLINJE(UTLINJE1);                                    00028540
                                                                        00028550
        ANT_GANGER = 1;                                                 00028560
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00028570
                                                                        00028580
                                                                        00028590
                                                                        00028600
                                                                        00028610
        UTLINJE1 = '                      B: ' !! CHAR(W02_PI_KOMMNR)   00028620
                   !! ' ' !! KOMMNR_OMR.NAVN;                           00028630
                                                                        00028640
        CALL SEND_UTLINJE(UTLINJE1);                                    00028650
                                                                        00028660
        ANT_GANGER = 2;                                                 00028670
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00028680
                                                                        00028690
                                                                        00028700
                                                                        00028710
                                                                        00028720
        UTLINJE1 = '    RIKSTRYGDEVERKET HAR REGISTRERT DEN PENSJONSGI' 00028730
                   !! 'VENDE INNTEKT';                                  00028740
                                                                        00028750
        CALL SEND_UTLINJE(UTLINJE1);                                    00028760
                                                                        00028770
                                                                        00028780
                                                                        00028790
                                                                        00028800
        UTLINJE1 = '    FRA A, MENS DEN PENSJONSGIVENDE INNTEKT FRA B'  00028810
                   !! ' ER AVVIST.';                                    00028820
                                                                        00028830
        CALL SEND_UTLINJE(UTLINJE1);                                    00028840
                                                                        00028850
                                                                        00028860
                                                                        00028870
        UTLINJE1 = '    ÅRSAKEN TIL DETTE ER AT INNTEKTEN FRA A ER'     00028880
                   !! ' REGISTRERT FØRST.';                             00028890
                                                                        00028900
        CALL SEND_UTLINJE(UTLINJE1);                                    00028910
        ANT_GANGER = 1;                                                 00028920
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00028930
                                                                        00028940
                                                                        00028950
                                                                        00028960
                                                                        00028970
        UTLINJE1 = '    VI ANMODER DE BERØRTE KOMMUNER OM Å BRINGE SKA' 00028980
                   !! 'TTEYTERS RIKTIGE';                               00028990
                                                                        00029000
        CALL SEND_UTLINJE(UTLINJE1);                                    00029010
                                                                        00029020
                                                                        00029030
                                                                        00029040
                                                                        00029050
        UTLINJE1 = '    SKATTEKOMMUNE FOR 19' !! NIS.ÅR(I)              00029060
                   !! ' PÅ DET RENE, DERSOM FORHOLDET IKKE ALLE-';      00029070
                                                                        00029080
        CALL SEND_UTLINJE(UTLINJE1);                                    00029090
                                                                        00029100
                                                                        00029110
        UTLINJE1 = '    REDE ER AVKLARET.';                             00029120
                                                                        00029130
        CALL SEND_UTLINJE(UTLINJE1);                                    00029140
                                                                        00029150
                                                                        00029160
                                                                        00029170
                                                                        00029180
        EXEC CICS SEND PAGE RETAIN;                                     00029190
        EXEC CICS ROUTE LIST (CHARLIST2);                               00029200
                                                                        00029210
                                                                        00029220
                                                                        00029230
        UTLINJE1 = '    RUTINENE DERETTER :';                           00029240
                                                                        00029250
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                        00029260
                                                                        00029270
                                                                        00029280
        ANT_GANGER = 1;                                                 00029290
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00029300
                                                                        00029310
                                                                        00029320
                                                                        00029330
        UTLINJE1 = '           1. DERSOM  B FASTHOLDER SKATTEPLIKTEN'   00029340
                   !! ' ANSETTES PENSJONS-';                            00029350
                                                                        00029360
        CALL SEND_UTLINJE(UTLINJE1);                                    00029370
                                                                        00029380
                                                                        00029390
                                                                        00029400
                                                                        00029410
        UTLINJE1 = '              GIVENDE INNTEKT PÅ BLANKETTEN "END'   00029420
                   !! 'RING I PENSJONS-';                               00029430
                                                                        00029440
        CALL SEND_UTLINJE(UTLINJE1);                                    00029450
                                                                        00029460
                                                                        00029470
                                                                        00029480
                                                                        00029490
        UTLINJE1 = '              GIVENDE INNTEKT". BLANKETTEN SENDES'  00029500
                   !! ' DATASENTERET';                                  00029510
                                                                        00029520
        CALL SEND_UTLINJE(UTLINJE1);                                    00029530
                                                                        00029540
                                                                        00029550
                                                                        00029560
                                                                        00029570
        UTLINJE1 = '              FOR SKATTEVESENET. (DERSOM ANDRE AN'  00029580
                   !! 'SETTELSER M.V.';                                 00029590
                                                                        00029600
        CALL SEND_UTLINJE(UTLINJE1);                                    00029610
                                                                        00029620
                                                                        00029630
                                                                        00029640
                                                                        00029650
        UTLINJE1 = '              SKAL ENDRES,NYTTES DEN ORDINÆRE L'    00029660
                   !! 'IGNINGSBLANKETT';                                00029670
                                                                        00029680
        CALL SEND_UTLINJE(UTLINJE1);                                    00029690
                                                                        00029700
                                                                        00029710
                                                                        00029720
                                                                        00029730
        UTLINJE1 = '              SOM SENDES DATASENTERET FOR SKATT'    00029740
                   !! 'EVESENET.)';                                     00029750
        CALL SEND_UTLINJE(UTLINJE1);                                    00029760
                                                                        00029770
                                                                        00029780
        ANT_GANGER = 1;                                                 00029790
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00029800
                                                                        00029810
                                                                        00029820
                                                                        00029830
        UTLINJE1 = '           2. DERSOM B FRAFALLER SKATTEPLIKTEN'     00029840
                   !! ' MELDES AVGANG VED';                             00029850
        CALL SEND_UTLINJE(UTLINJE1);                                    00029860
                                                                        00029870
                                                                        00029880
                                                                        00029890
                                                                        00029900
        UTLINJE1 = '              Å PÅFØRE KODE "9" I RUTEN "P.KODE" '  00029910
                   !! 'PÅ DEN ORDINÆRE';                                00029920
        CALL SEND_UTLINJE(UTLINJE1);                                    00029930
                                                                        00029940
                                                                        00029950
                                                                        00029960
                                                                        00029970
        UTLINJE1 = '              LIGNINGSBLANKETT. BLANKETTEN SENDES'  00029980
                   !! ' DATASENTERET';                                  00029990
        CALL SEND_UTLINJE(UTLINJE1);                                    00030000
                                                                        00030010
                                                                        00030020
                                                                        00030030
                                                                        00030040
        UTLINJE1 = '              FOR SKATTEVESENET SAMMEN MED EVEN'    00030050
                   !! 'TUELLE ANDRE RETTE-';                            00030060
        CALL SEND_UTLINJE(UTLINJE1);                                    00030070
                                                                        00030080
                                                                        00030090
                                                                        00030100
                                                                        00030110
        UTLINJE1 = '              BLANKETTER.';                         00030120
                                                                        00030130
        CALL SEND_UTLINJE(UTLINJE1);                                    00030140
                                                                        00030150
                                                                        00030160
        ANT_GANGER = 4;                                                 00030170
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00030180
                                                                        00030190
                                                                        00030200
                                                                        00030210
                                                                        00030220
        UTLINJE1 = '    SKATTEDIREKTORATET                   '          00030230
                !! '        RIKSTRYGDEVERKET';                          00030240
                                                                        00030250
        CALL SEND_UTLINJE(UTLINJE1);                                    00030260
                                                                        00030270
                                                                        00030280
        EXEC CICS SEND PAGE RETAIN;                                     00030290
                                                                        00030300
                                                                        00030310
           END;                                                         00030320
                                                                        00030330
                                                                        00030340
 /*      WHEN (4)                                                     */00030350
 /*        DO;                                                        */00030360
                                                                        00030370
 /*ENDRET 3.7.87 HL - MELDING NR 4 SKAL IKKE SKRIVES - FRAPP 516*/      00030380
                                                                        00030390
                                                                        00030400
  /* **************************************************************** */00030410
  /*    SKRIVER UT RAPPORT NR.4 PÅ LOKAL SKRIVER.                     */00030420
  /*                                                                  */00030430
  /* FEIL VED INNRAPPORTERINGEN.                                      */00030440
  /*                                                                  */00030450
  /* **************************************************************** */00030460
                                                                        00030470
                                                                        00030480
  /*    S001I04O.MELDING2O =                                          */00030490
  /*                                                                  */00030500
  /*    '**** F E I L  I N N R A P P O R T E R I N G  ****';          */00030510
  /*                                                                  */00030520
  /*    S001I04O.MELDING4O =                                          */00030530
                                                                        00030540
 /*                'KLARGJØR PRINTER OG TRYKK ENTER.';            */    00030550
                                                                        00030560
 /*     S001I04O.MELDING6O =                                      */    00030570
                                                                        00030580
 /*          '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).';  */    00030590
                                                                        00030600
                                                                        00030610
 /*     EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;   */    00030620
                                                                        00030630
        /* DUMMY RECEIVE-KALL.                                     */   00030640
                                                                        00030650
 /*     EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')        */    00030660
 /*                                            SET(BMSMAPBR);     */    00030670
                                                                        00030680
 /*     EXEC CICS ROUTE LIST (CHARLIST2);                         */    00030690
                                                                        00030700
                                                                        00030710
 /*UTLINJE1 = '                                                  '*/    00030720
 /*                !! '                OSLO, ' !! DATO;           */    00030730
                                                                        00030740
 /*     CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                  */    00030750
                                                                        00030760
                                                                        00030770
 /*     ANT_GANGER = 3;                                           */    00030780
 /*     CALL SEND_BLANKLINJE(ANT_GANGER);                         */    00030790
                                                                        00030800
 /*     UTLINJE1 = '    TIL DIREKTORATET FOR SKATTEVESENET ';     */    00030810
                                                                        00030820
 /*     CALL SEND_UTLINJE(UTLINJE1);                              */    00030830
                                                                        00030840
 /*     ANT_GANGER = 3;                                           */    00030850
 /*     CALL SEND_BLANKLINJE(ANT_GANGER);                         */    00030860
                                                                        00030870
 /*     UTLINJE1 = 'FNR: ' !! NISF.FNR !! ' NAVN: ' !! NISF.NAVN  */    00030880
 /*       !!  'INNTEKTSÅR: ' !! NIS.ÅR(I);                        */    00030890
                                                                        00030900
 /*     CALL SEND_UTLINJE(UTLINJE1);                              */    00030910
 /*     ANT_GANGER = 1;                                           */    00030920
 /*     CALL SEND_BLANKLINJE(ANT_GANGER);                         */    00030930
                                                                        00030940
 /*UTLINJE1 = '    INNTEKT OMBORD RAPPORTERT FRA DIREKTORATET '   */    00030950
 /*                !! 'FOR SJØMENN,MEN';                          */    00030960
                                                                        00030970
 /*     CALL SEND_UTLINJE(UTLINJE1);                              */    00030980
                                                                        00030990
                                                                        00031000
 /*     ANT_GANGER = 1;                                           */    00031010
 /*     CALL SEND_BLANKLINJE(ANT_GANGER);                         */    00031020
                                                                        00031030
                                                                        00031040
                                                                        00031050
 /*     UTLINJE1 = '    IKKE FRA DIREKTORATET FOR SKATTEVESENET.';*/    00031060
                                                                        00031070
 /*     CALL SEND_UTLINJE(UTLINJE1);                              */    00031080
                                                                        00031090
                                                                        00031100
 /*     ANT_GANGER = 4;                                           */    00031110
 /*     CALL SEND_BLANKLINJE(ANT_GANGER);                         */    00031120
                                                                        00031130
                                                                        00031140
                                                                        00031150
 /*     UTLINJE1 = '                                         '   */     00031160
 /*             !! '        RIKSTRYGDEVERKET';                   */     00031170
                                                                        00031180
 /*     CALL SEND_UTLINJE(UTLINJE1);                             */     00031190
                                                                        00031200
                                                                        00031210
 /*     EXEC CICS SEND PAGE;                                     */     00031220
                                                                        00031230
 /*        END;                                                  */     00031240
                                                                        00031250
                                                                        00031260
         WHEN (5)                                                       00031270
           DO;                                                          00031280
                                                                        00031290
  /* **************************************************************** */00031300
  /*    SKRIVER UT RAPPORT NR.5 PÅ LOKAL SKRIVER.                     */00031310
  /*                                                                  */00031320
  /* OSLO HAR SENDT BÅDE B- OG U-RAPPORT PÅ SAMME PERSON FOR SAMME ÅR.*/00031330
  /*                                                                  */00031340
  /* **************************************************************** */00031350
                                                                        00031360
                                                                        00031370
        S001I04O.MELDING2O =                                            00031380
                                                                        00031390
        '**** F E I L  I N N R A P P O R T E R I N G';                  00031400
                                                                        00031410
        S001I04O.MELDING4O =                                            00031420
                                                                        00031430
                   'KLARGJØR PRINTER OG TRYKK ENTER.';                  00031440
                                                                        00031450
        S001I04O.MELDING6O =                                            00031460
                                                                        00031470
                    '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).'; 00031480
                                                                        00031490
                                                                        00031500
        EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;         00031510
                                                                        00031520
        /* DUMMY RECEIVE-KALL.                                     */   00031530
                                                                        00031540
        EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')              00031550
                                               SET(BMSMAPBR);           00031560
                                                                        00031570
        EXEC CICS ROUTE LIST (CHARLIST2);                               00031580
                                                                        00031590
                                                                        00031600
        UTLINJE1 = '                                                  ' 00031610
                   !! '                OSLO, ' !! DATO;                 00031620
                                                                        00031630
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                        00031640
                                                                        00031650
                                                                        00031660
        ANT_GANGER = 3;                                                 00031670
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00031680
                                                                        00031690
        UTLINJE1 = '    TIL SKATTEDIREKTORATET';                        00031700
                                                                        00031710
        CALL SEND_UTLINJE(UTLINJE1);                                    00031720
                                                                        00031730
        ANT_GANGER = 3;                                                 00031740
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00031750
                                                                        00031760
        UTLINJE1 = 'FNR: ' !! NISF.FNR                                  00031770
                              !! ' NAVN: ' !! NISF.NAVN                 00031780
                              !! ' INNTEKTSÅR: ' !! NIS.ÅR(I);          00031790
                                                                        00031800
        CALL SEND_UTLINJE(UTLINJE1);                                    00031810
                                                                        00031820
        ANT_GANGER = 2;                                                 00031830
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00031840
                                                                        00031850
        UTLINJE1 = '    FOR OVENNEVNTE SKATTEYTER ER DET INNSENDT '     00031860
                   !! 'BÅDE B- OG U-RAPPORT';                           00031870
                                                                        00031880
        CALL SEND_UTLINJE(UTLINJE1);                                    00031890
                                                                        00031900
                                                                        00031910
        UTLINJE1 = '   FOR SAMME ÅR.';                                  00031920
                                                                        00031930
        CALL SEND_UTLINJE(UTLINJE1);                                    00031940
                                                                        00031950
        ANT_GANGER = 4;                                                 00031960
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00031970
                                                                        00031980
                                                                        00031990
                                                                        00032000
        UTLINJE1 = '                                         '          00032010
                !! '        RIKSTRYGDEVERKET';                          00032020
                                                                        00032030
        CALL SEND_UTLINJE(UTLINJE1);                                    00032040
                                                                        00032050
                                                                        00032060
        EXEC CICS SEND PAGE;                                            00032070
                                                                        00032080
                                                                        00032090
                                                                        00032100
           END;                                                         00032110
                                                                        00032120
                                                                        00032130
                                                                        00032140
                                                                        00032150
         WHEN (6)                                                       00032160
           DO;                                                          00032170
                                                                        00032180
  /* **************************************************************** */00032190
  /*    SKRIVER UT RAPPORT NR.6 PÅ LOKAL SKRIVER.                     */00032200
  /*                                                                  */00032210
  /* FEIL VED INNRAPPORTERINGEN.                                      */00032220
  /*                                                                  */00032230
  /* **************************************************************** */00032240
                                                                        00032250
                                                                        00032260
        S001I04O.MELDING2O =                                            00032270
                                                                        00032280
        '**** F E I L  I N N R A P P O R T E R I N G  ****';            00032290
                                                                        00032300
                                                                        00032310
        S001I04O.MELDING4O =                                            00032320
                                                                        00032330
                   'KLARGJØR PRINTER OG TRYKK ENTER.';                  00032340
                                                                        00032350
        S001I04O.MELDING6O =                                            00032360
                                                                        00032370
                    '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).'; 00032380
                                                                        00032390
                                                                        00032400
        EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;         00032410
                                                                        00032420
        /* DUMMY RECEIVE-KALL.                                     */   00032430
                                                                        00032440
        EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')              00032450
                                               SET(BMSMAPBR);           00032460
                                                                        00032470
        EXEC CICS ROUTE LIST (CHARLIST2);                               00032480
                                                                        00032490
                                                                        00032500
        UTLINJE1 = '                                                  ' 00032510
                   !! '                OSLO, ' !! DATO;                 00032520
                                                                        00032530
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                        00032540
                                                                        00032550
                                                                        00032560
        ANT_GANGER = 3;                                                 00032570
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00032580
                                                                        00032590
        UTLINJE1 = '    TIL DIREKTORATET FOR SJØMENN ';                 00032600
                                                                        00032610
        CALL SEND_UTLINJE(UTLINJE1);                                    00032620
                                                                        00032630
        ANT_GANGER = 3;                                                 00032640
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00032650
                                                                        00032660
        UTLINJE1 = 'FNR: ' !! NISF.FNR !! ' NAVN: ' !! NISF.NAVN        00032670
          !! 'INNTEKTSÅR: ' !! NIS.ÅR(I);                               00032680
                                                                        00032690
        CALL SEND_UTLINJE(UTLINJE1);                                    00032700
                                                                        00032710
        ANT_GANGER = 1;                                                 00032720
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00032730
                                                                        00032740
                                                                        00032750
        UTLINJE1 = '    INNTEKT OMBORD RAPPORTERT FRA DIREKTORATET '    00032760
                   !! 'FOR SKATTEVESENET,MEN';                          00032770
                                                                        00032780
        CALL SEND_UTLINJE(UTLINJE1);                                    00032790
                                                                        00032800
                                                                        00032810
        ANT_GANGER = 1;                                                 00032820
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00032830
                                                                        00032840
                                                                        00032850
                                                                        00032860
        UTLINJE1 = '    IKKE FRA DIREKTORATET FOR SJØMENN.';            00032870
                                                                        00032880
        CALL SEND_UTLINJE(UTLINJE1);                                    00032890
                                                                        00032900
        ANT_GANGER = 4;                                                 00032910
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00032920
                                                                        00032930
                                                                        00032940
                                                                        00032950
        UTLINJE1 = '                                         '          00032960
                !! '        RIKSTRYGDEVERKET';                          00032970
                                                                        00032980
        CALL SEND_UTLINJE(UTLINJE1);                                    00032990
                                                                        00033000
                                                                        00033010
        EXEC CICS SEND PAGE;                                            00033020
                                                                        00033030
           END;                                                         00033040
                                                                        00033050
                                                                        00033060
                                                                        00033070
                                                                        00033080
         WHEN (8)                                                       00033090
           DO;                                                          00033100
                                                                        00033110
  /* **************************************************************** */00033120
  /*    SKRIVER UT RAPPORT NR.8 PÅ LOKAL SKRIVER.                     */00033130
  /*                                                                  */00033140
  /* NAVN IKKE UTFYLT.                                                */00033150
  /*                                                                  */00033160
  /* **************************************************************** */00033170
                                                                        00033180
        S001I04O.MELDING2O =                                            00033190
                                                                        00033200
        '**** N A V N  M Å  O P P G I S  ****';                         00033210
                                                                        00033220
        S001I04O.MELDING4O =                                            00033230
                                                                        00033240
                   'KLARGJØR PRINTER OG TRYKK ENTER.';                  00033250
                                                                        00033260
        S001I04O.MELDING6O =                                            00033270
                                                                        00033280
                    '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).'; 00033290
                                                                        00033300
                                                                        00033310
        EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;         00033320
                                                                        00033330
        /* DUMMY RECEIVE-KALL.                                     */   00033340
                                                                        00033350
        EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')              00033360
                                               SET(BMSMAPBR);           00033370
                                                                        00033380
        EXEC CICS ROUTE LIST (CHARLIST2);                               00033390
                                                                        00033400
                                                                        00033410
        UTLINJE1 = '                                                  ' 00033420
                   !! '                OSLO, ' !! DATO;                 00033430
                                                                        00033440
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                        00033450
                                                                        00033460
                                                                        00033470
        ANT_GANGER = 3;                                                 00033480
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00033490
                                                                        00033500
        UTLINJE1 = '    TIL SKATTEDIREKTORATET';                        00033510
        CALL SEND_UTLINJE(UTLINJE1);                                    00033520
                                                                        00033530
        ANT_GANGER = 3;                                                 00033540
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00033550
                                                                        00033560
        UTLINJE1 = 'FNR: ' !! NISF.FNR !! '       '                     00033570
                              !! '   INNTEKTSÅR: ' !! NIS.ÅR(I);        00033580
                                                                        00033590
        CALL SEND_UTLINJE(UTLINJE1);                                    00033600
                                                                        00033610
        ANT_GANGER = 1;                                                 00033620
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00033630
                                                                        00033640
        UTLINJE1 = '    VEDKOMMENDE ER IKKE I REGISTERET FRA FØR,  '    00033650
                   !! 'NAVN MÅ DERFOR OPPGIS.';                         00033660
                                                                        00033670
        CALL SEND_UTLINJE(UTLINJE1);                                    00033680
                                                                        00033690
                                                                        00033700
        ANT_GANGER = 4;                                                 00033710
        CALL SEND_BLANKLINJE(ANT_GANGER);                               00033720
                                                                        00033730
                                                                        00033740
                                                                        00033750
        UTLINJE1 = '                                         '          00033760
                !! '        RIKSTRYGDEVERKET';                          00033770
                                                                        00033780
        CALL SEND_UTLINJE(UTLINJE1);                                    00033790
                                                                        00033800
                                                                        00033810
        EXEC CICS SEND PAGE;                                            00033820
                                                                        00033830
                                                                        00033840
                                                                        00033850
           END;                                                         00033860
                                                                        00033870
         OTHERWISE;                                                     00033880
                                                                        00033890
 /*ENDRET 3.7.87 HL - MELDING NR 4 SKAL IKKE SKRIVES - FRAPP 516*/      00033900
                                                                        00033910
      END;                                                              00033920
                                                                        00033930
  END SKRIV_BREV;                                                       00033940
                                                                        00033950
                                                                        00033960
                                                                        00033970
  SEND_UTLINJE_FØRSTE_GANG:                                             00033980
       PROC(LINJE);                                                     00033990
                                                                        00034000
       DCL LINJE CHAR(80);                                              00034010
                                                                        00034020
        EXEC CICS SEND TEXT FROM(LINJE) ACCUM PAGING L80 PRINT          00034030
                                         ERASE;                         00034040
                                                                        00034050
                                                                        00034060
  END SEND_UTLINJE_FØRSTE_GANG;                                         00034070
                                                                        00034080
                                                                        00034090
                                                                        00034100
                                                                        00034110
  SEND_BLANKLINJE:                                                      00034120
       PROC(I);                                                         00034130
                                                                        00034140
   DCL  BLANKLINJE                 CHAR(80)  INIT (' ');                00034150
   DCL I     PIC '9';                                                   00034160
   DCL J     PIC '9';                                                   00034170
                                                                        00034180
        DO J = 1 TO I;                                                  00034190
           EXEC CICS SEND TEXT FROM(BLANKLINJE) ACCUM PAGING L80 PRINT; 00034200
        END;                                                            00034210
                                                                        00034220
  END SEND_BLANKLINJE;                                                  00034230
                                                                        00034240
                                                                        00034250
                                                                        00034260
  SEND_UTLINJE:                                                         00034270
       PROC(LINJE);                                                     00034280
                                                                        00034290
       DCL LINJE CHAR(80);                                              00034300
                                                                        00034310
        EXEC CICS SEND TEXT FROM(LINJE) ACCUM PAGING L80 PRINT;         00034320
                                                                        00034330
                                                                        00034340
  END SEND_UTLINJE;                                                     00034350
                                                                        00034360
                                                                        00034370
                                                                        00034380
                                                                        00034390
  SKRIV_LISTEDATA:                                                      00034400
     PROC(TYPE,DØDSÅR);                                                 00034410
                                                                        00034420
  /* **************************************************************** */00034430
  /*HENSIKT:                                                          */00034440
  /*    SKRIVER OPPLYSNINGER UT PÅ P001.OLINNTE FOR BRUK VED UTSKRIFT */00034450
  /*    AV KONTROLLISTE.                                              */00034460
  /*                                                                  */00034470
  /*BRUK:                                                             */00034480
  /*    CALL SKRIV_LISTEDATA;                                         */00034490
  /*                                                                  */00034500
  /* **************************************************************** */00034510
                                                                        00034520
                                                                        00034530
   DCL                                                                  00034540
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00034550
      KEY_PEKER                  POINTER                  ,             00034560
      KEY_RECL                   CHAR (97)                ,             00034570
      KEY                        CHAR (41)                ;             00034580
   DCL                                                                  00034590
      LISTE_RECL                 CHAR(97)   ;                           00034600
   DCL                                                                  00034610
      01 REC_OMR  DEF LISTE_RECL,                                       00034620
         02 KONTOR               CHAR(3)    ,                           00034630
         02 TERMID               CHAR(4)    ,                           00034640
         02 FNR                  PIC '(11)9',                           00034650
         02 REGTPK               CHAR(6)    ,                           00034660
         02 IÅR                  PIC '(2)9' ,                           00034670
         02 BLTYPE               CHAR(1)    ,                           00034680
         02 IART                 CHAR(1)    ,                           00034690
         02 KOMMNR1              PIC '(4)9' ,                           00034700
         02 AGIVNR               PIC '(3)9' ,                           00034710
         02 RAPPDATO             PIC '(6)9' ,                           00034720
         02 NAVN                 CHAR(25)   ,                           00034730
         02 INNTEKT              PIC '(7)9' ,                           00034740
         02 ETYPE                CHAR(1)    ,                           00034750
         02 MERKE                CHAR(1)    ,                           00034760
         02 DÅR                  PIC '(2)9' ,                           00034770
         02 KOMMNR2              PIC '(4)9' ,                           00034780
         02 BRUKERID             CHAR(4)    ,                           00034790
         02 FNR2                 PIC '(11)9',                           00034800
         02 INDEKS               PIC '9'    ;                           00034810
   DCL                                                                  00034820
       DØDSÅR                  PIC '(2)9',                              00034830
       TYPE                    PIC '(1)9';                              00034840
   DCL                                                                  00034850
      01 HDATO                   PIC '(6)9';                            00034860
   DCL                                                                  00034870
      01 HDATO_REDEF DEF HDATO,                                         00034880
         02 ÅR                   PIC '(2)9',                            00034890
         02 MND                  PIC '(2)9',                            00034900
         02 DAG                  PIC '(2)9';                            00034910
   DCL                                                                  00034920
      01 NYKKEL     DEF KEY,                                            00034930
         02 KONTOR_N             CHAR(3)    ,                           00034940
         02 TERMID_N             CHAR(4)    ,                           00034950
         02 FNR_N                PIC '(11)9',                           00034960
         02 REGTPK_N             CHAR(6)    ,                           00034970
         02 IÅR_N                PIC '(2)9' ,                           00034980
         02 BLTYPE_N             CHAR(1)    ,                           00034990
         02 IART_N               CHAR(1)    ,                           00035000
         02 KOMMNR1_N            PIC '(4)9' ,                           00035010
         02 AGIVNR_N             PIC '(3)9' ,                           00035020
         02 RAPPDATO_N           PIC '(6)9' ;                           00035030
   DCL                                                                  00035040
      01 DATO                    PIC '(6)9';                            00035050
   DCL                                                                  00035060
      01 DATO_REDEF DEF DATO,                                           00035070
         02 DAG                  PIC '(2)9',                            00035080
         02 MND                  PIC '(2)9',                            00035090
         02 ÅR                   PIC '(2)9';                            00035100
                                                                        00035110
                                                                        00035120
   DCL 1  TID,                                                          00035130
          2  TID1                          CHAR (6), /* TT,MM,.SEK    */00035140
          2  TID2                          CHAR (3); /* MILL.SEK.     */00035150
   DCL TID_D          DEFINED   TID        CHAR (9);                    00035160
                                                                        00035170
                                                                        00035180
      EXEC CICS DELAY INTERVAL(002);                                    00035190
                                                                        00035200
      TID_D             = TIME  ;                                       00035210
      HDATO             = DATE();                                       00035220
      DATO_REDEF.ÅR     = HDATO_REDEF.ÅR ;                              00035230
      DATO_REDEF.MND    = HDATO_REDEF.MND;                              00035240
      DATO_REDEF.DAG    = HDATO_REDEF.DAG;                              00035250
                                                                        00035260
      LISTE_RECL        = ''               ;                            00035270
      REC_OMR.KONTOR    = NISF.AVSENDER    ;                            00035280
      REC_OMR.FNR       = NISF.FNR         ;                            00035290
      REC_OMR.IÅR       = NIS.ÅR(I)        ;                            00035300
      REC_OMR.BLTYPE    = NIS.TYPE(I)      ;                            00035310
      REC_OMR.IART      = NIS.ART(I)       ;                            00035320
      REC_OMR.KOMMNR1   = NIS.KOMMNR(I)    ;                            00035330
      REC_OMR.AGIVNR    = NIS.AGIVKODE(I)  ;                            00035340
      REC_OMR.RAPPDATO  = DATO             ;                            00035350
      REC_OMR.NAVN      = NISF.NAVN        ;                            00035360
                                                                        00035370
      IF TYPE = 1 THEN                                                  00035380
         REC_OMR.DÅR    = DØDSÅR           ;                            00035390
      ELSE                                                              00035400
         REC_OMR.DÅR    = 0                ;                            00035410
      REC_OMR.TERMID    = EIBTRMID         ;                            00035420
      REC_OMR.REGTPK    = TID1             ;                            00035430
      REC_OMR.BRUKERID  = STYRINGS_OMR.BRUKERID;                        00035440
      REC_OMR.INNTEKT   = NIS.PG_INNTEKT(I);                            00035450
                                                                        00035460
      REC_OMR.ETYPE     = NIS.ETYPE(I)     ;                            00035470
      REC_OMR.MERKE     = NIS.MERKE(I)     ;                            00035480
      REC_OMR.INDEKS    = '1'              ;                            00035490
                                                                        00035500
                                                                        00035510
      NYKKEL.KONTOR_N   = NISF.AVSENDER    ;                            00035520
      NYKKEL.FNR_N      = NISF.FNR         ;                            00035530
      NYKKEL.IÅR_N      = NIS.ÅR(I)        ;                            00035540
      NYKKEL.BLTYPE_N   = NIS.TYPE(I)      ;                            00035550
      NYKKEL.IART_N     = NIS.ART(I)       ;                            00035560
      NYKKEL.KOMMNR1_N  = NIS.KOMMNR(I)    ;                            00035570
      NYKKEL.AGIVNR_N   = NIS.AGIVKODE(I)  ;                            00035580
      NYKKEL.RAPPDATO_N = DATO             ;                            00035590
      NYKKEL.TERMID_N   = EIBTRMID         ;                            00035600
      NYKKEL.REGTPK_N   = TID1             ;                            00035610
      KEY_PEKER         = ADDR(KEY)        ;                            00035620
      KEY_RECL          = LISTE_RECL       ;                            00035630
                                                                        00035640
                                                                        00035650
      EXEC CICS HANDLE CONDITION ERROR    (L125)             ;          00035660
      EXEC CICS HANDLE CONDITION DUPREC   (ALT_OK)           ;          00035670
      EXEC CICS WRITE  DATASET ('OLINNTE') RIDFLD  (KEY_BIT )           00035680
                                           FROM    (KEY_RECL);          00035690
      GOTO ALT_OK;                                                      00035700
                                                                        00035710
    L125:                                                               00035720
      FEIL_MELD_NR                =    505 ;                            00035730
      FEIL_VED_LABEL              =   '125';                            00035740
      FATAL_FEIL                  =   '1'B ;                            00035750
                                                                        00035760
    ALT_OK:                                                             00035770
                                                                        00035780
                                                                        00035790
  END SKRIV_LISTEDATA;                                                  00035800
                                                                        00035810
                                                                        00035820
  SKRIV_LISTEDATA_KORR:                                                 00035830
                  PROC;                                                 00035840
                                                                        00035850
  /* **************************************************************** */00035860
  /*HENSIKT:                                                          */00035870
  /*    SKRIVER OPPLYSNINGER UT PÅ R001.OLINNTE FOR BRUK VED UTSKRIFT */00035880
  /*    AV KONTROLLISTE.                                              */00035890
  /*    BLIR KALT OPP VED KORRIGERINGSRAPPORTER.                      */00035900
  /*                                                                  */00035910
  /*BRUK:                                                             */00035920
  /*    CALL SKRIV_LISTEDATA_KORR;                                    */00035930
  /*                                                                  */00035940
  /* **************************************************************** */00035950
                                                                        00035960
                                                                        00035970
                                                                        00035980
   DCL                                                                  00035990
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00036000
      KEY_PEKER                  POINTER                ,               00036010
      KEY_RECL                   CHAR (97)              ,               00036020
      KEY                        CHAR (41)              ;               00036030
   DCL                                                                  00036040
      LISTE_RECL                 CHAR(97)   ;                           00036050
   DCL                                                                  00036060
      01 REC_OMR  DEF LISTE_RECL,                                       00036070
         02 KONTOR               CHAR(3)    ,                           00036080
         02 TERMID               CHAR(4)    ,                           00036090
         02 FNR                  PIC '(11)9',                           00036100
         02 REGTPK               CHAR(6)    ,                           00036110
         02 IÅR                  PIC '(2)9' ,                           00036120
         02 BLTYPE               CHAR(1)    ,                           00036130
         02 IART                 CHAR(1)    ,                           00036140
         02 KOMMNR1              PIC '(4)9' ,                           00036150
         02 AGIVNR               PIC '(3)9' ,                           00036160
         02 RAPPDATO             CHAR(6)    ,                           00036170
         02 NAVN                 CHAR(25)   ,                           00036180
         02 INNTEKT              PIC '(7)9' ,                           00036190
         02 ETYPE                CHAR(1)    ,                           00036200
         02 MERKE                CHAR(1)    ,                           00036210
         02 DÅR                  PIC '(2)9' ,                           00036220
         02 KOMMNR2              PIC '(4)9' ,                           00036230
         02 BRUKERID             CHAR(4)    ,                           00036240
         02 FNR2                 PIC '(11)9',                           00036250
         02 INDEKS               CHAR(1)    ;                           00036260
   DCL                                                                  00036270
      01 HDATO                   PIC '(6)9';                            00036280
   DCL                                                                  00036290
      01 HDATO_REDEF DEF HDATO,                                         00036300
         02 ÅR                   PIC '(2)9',                            00036310
         02 MND                  PIC '(2)9',                            00036320
         02 DAG                  PIC '(2)9';                            00036330
   DCL                                                                  00036340
      01 NYKKEL     DEF KEY,                                            00036350
         02 KONTOR_N             CHAR(3)    ,                           00036360
         02 TERMID_N             CHAR(4)    ,                           00036370
         02 FNR_N                PIC '(11)9',                           00036380
         02 REGTPK_N             CHAR(6)    ,                           00036390
         02 IÅR_N                PIC '(2)9' ,                           00036400
         02 BLTYPE_N             CHAR(1)    ,                           00036410
         02 IART_N               CHAR(1)    ,                           00036420
         02 KOMMNR1_N            PIC '(4)9' ,                           00036430
         02 AGIVNR_N             PIC '(3)9' ,                           00036440
         02 RAPPDATO_N           PIC '(6)9' ;                           00036450
   DCL                                                                  00036460
      01 DATO                    PIC '(6)9';                            00036470
   DCL                                                                  00036480
      01 DATO_REDEF DEF DATO,                                           00036490
         02 DAG                  PIC '(2)9',                            00036500
         02 MND                  PIC '(2)9',                            00036510
         02 ÅR                   PIC '(2)9';                            00036520
                                                                        00036530
   DCL                                                                  00036540
      (DATE, TIME)    BUILTIN;                                          00036550
   DCL                                                                  00036560
      01 W02_BLTYPE              CHAR(1),                               00036570
      01 W02_ART                 CHAR(1);                               00036580
                                                                        00036590
                                                                        00036600
   DCL 1  TID,                                                          00036610
          2  TID1                          CHAR (6), /* TT,MM,.SEK    */00036620
          2  TID2                          CHAR (3); /* MILL.SEK.     */00036630
  DCL TID_D          DEFINED   TID         CHAR (9);                    00036640
                                                                        00036650
 /* TILLEGG 10/1-90 AV TUYEN                         */                 00036660
                                                                        00036670
   DCL R1_DATO                    CHAR(6);                              00036680
   DCL 01 R2_DATO DEF R1_DATO,                                          00036690
          02 ÅR                   CHAR(2),                              00036700
          02 MND                  CHAR(2),                              00036710
          02 DAG                  CHAR(2);                              00036720
                                                                        00036730
   DCL R4_DATO                    CHAR(6);                              00036740
   DCL 01 R3_DATO DEF R4_DATO,                                          00036750
          02 DAG                  CHAR(2),                              00036760
          02 MND                  CHAR(2),                              00036770
          02 ÅR                   CHAR(2);                              00036780
                                                                        00036790
   DCL ÅR_DAGNR_CHAR              CHAR(6) INIT ((6)' ');                00036800
   DCL RAPP_DATO   DEF ÅR_DAGNR_CHAR PIC '(5)9' POS (1);                00036810
   DCL RAPP_DATO_S DEF ÅR_DAGNR_CHAR CHAR (1) POS (6);                  00036820
                                                                        00036830
 /* HIT */                                                              00036840
                                                                        00036850
                                                                        00036860
     SELECT(W02_PI_TYPE);                                               00036870
                                                                        00036880
        WHEN('B','C','D')                                               00036890
                                                                        00036900
           DO;                                                          00036910
              W02_BLTYPE = 'B';                                         00036920
                                                                        00036930
              IF W02_PI_TYPE = 'B' THEN                                 00036940
                 W02_ART    = '1';                                      00036950
              ELSE                                                      00036960
                 IF W02_PI_TYPE = 'C' THEN                              00036970
                    W02_ART    = '2';                                   00036980
                 ELSE                                                   00036990
                    IF W02_PI_TYPE = 'D' THEN                           00037000
                       W02_ART    = '3';                                00037010
           END;                                                         00037020
                                                                        00037030
        WHEN('E','F')                                                   00037040
                                                                        00037050
           DO;                                                          00037060
              W02_BLTYPE = 'C';                                         00037070
                                                                        00037080
              IF W02_PI_TYPE = 'E' THEN                                 00037090
                 W02_ART    = '1';                                      00037100
              ELSE                                                      00037110
                 IF W02_PI_TYPE = 'F' THEN                              00037120
                    W02_ART    = '2';                                   00037130
           END;                                                         00037140
                                                                        00037150
        WHEN('H','I')                                                   00037160
                                                                        00037170
           DO;                                                          00037180
              W02_BLTYPE = 'D';                                         00037190
                                                                        00037200
              IF W02_PI_TYPE = 'H' THEN                                 00037210
                 W02_ART    = '1';                                      00037220
              ELSE                                                      00037230
                 IF W02_PI_TYPE = 'I' THEN                              00037240
                    W02_ART    = '2';                                   00037250
           END;                                                         00037260
                                                                        00037270
        WHEN('J','K','L')                                               00037280
                                                                        00037290
           DO;                                                          00037300
              W02_BLTYPE = 'O';                                         00037310
                                                                        00037320
              IF W02_PI_TYPE = 'J' THEN                                 00037330
                 W02_ART    = '4';                                      00037340
              ELSE                                                      00037350
                 IF W02_PI_TYPE = 'K' THEN                              00037360
                    W02_ART    = '5';                                   00037370
                 ELSE                                                   00037380
                    IF W02_PI_TYPE = 'L' THEN                           00037390
                       W02_ART    = '6';                                00037400
           END;                                                         00037410
                                                                        00037420
        WHEN('S','T')                                                   00037430
                                                                        00037440
           DO;                                                          00037450
              W02_BLTYPE = 'S';                                         00037460
                                                                        00037470
              IF W02_PI_TYPE = 'S' THEN                                 00037480
                 W02_ART    = '1';                                      00037490
              ELSE                                                      00037500
                 IF W02_PI_TYPE = 'T' THEN                              00037510
                    W02_ART    = '2';                                   00037520
           END;                                                         00037530
                                                                        00037540
        WHEN('V','W')                                                   00037550
                                                                        00037560
           DO;                                                          00037570
              W02_BLTYPE = 'U';                                         00037580
                                                                        00037590
              IF W02_PI_TYPE = 'V' THEN                                 00037600
                 W02_ART    = '1';                                      00037610
              ELSE                                                      00037620
                 IF W02_PI_TYPE = 'W' THEN                              00037630
                    W02_ART    = '2';                                   00037640
           END;                                                         00037650
                                                                        00037660
        OTHERWISE                                                       00037670
           ;                                                            00037680
     END;                                                               00037690
                                                                        00037700
                                                                        00037710
                                                                        00037720
      HDATO             = DATE();                                       00037730
      TID_D             = TIME  ;                                       00037740
                                                                        00037750
      DATO_REDEF.ÅR     = HDATO_REDEF.ÅR ;                              00037760
      DATO_REDEF.MND    = HDATO_REDEF.MND;                              00037770
      DATO_REDEF.DAG    = HDATO_REDEF.DAG;                              00037780
                                                                        00037790
      LISTE_RECL        = ''               ;                            00037800
      REC_OMR.KONTOR    = NISF.AVSENDER    ;                            00037810
      REC_OMR.FNR       = NISF.FNR         ;                            00037820
      REC_OMR.NAVN      = 'FJERNING VED KORRIGERING';                   00037830
      REC_OMR.TERMID    = EIBTRMID         ;                            00037840
      REC_OMR.REGTPK    = TID1             ;                            00037850
      REC_OMR.BRUKERID  = STYRINGS_OMR.BRUKERID;                        00037860
      REC_OMR.IÅR       = W02_PI_ÅR        ;                            00037870
      REC_OMR.BLTYPE    = W02_BLTYPE       ;                            00037880
      REC_OMR.IART      = W02_ART          ;                            00037890
      REC_OMR.KOMMNR1   = W02_PI_KOMMNR    ;                            00037900
 /*   REC_OMR.RAPPDATO  = DATO             ;          */                00037910
                                                                        00037920
 /* 10/1-90 AV TUYEN                                  */                00037930
                                                                        00037940
     RAPP_DATO          = W02_PI_RAPPDATO;                              00037950
     RAPP_DATO_S        = ' ';                                          00037960
     R1_DATO            = R0019947(ÅR_DAGNR_CHAR);                      00037970
     R3_DATO.ÅR         = R2_DATO.ÅR ;                                  00037980
     R3_DATO.MND        = R2_DATO.MND;                                  00037990
     R3_DATO.DAG        = R2_DATO.DAG;                                  00038000
                                                                        00038010
      REC_OMR.RAPPDATO  = R4_DATO          ;                            00038020
                                                                        00038030
 /* HIT */                                                              00038040
                                                                        00038050
      REC_OMR.AGIVNR    = 0                ;                            00038060
      REC_OMR.INNTEKT   = W02_PI * 100     ;                            00038070
      REC_OMR.INDEKS    = '2'              ;                            00038080
                                                                        00038090
      NYKKEL.KONTOR_N   = NISF.AVSENDER    ;                            00038100
      NYKKEL.TERMID_N   = EIBTRMID         ;                            00038110
      NYKKEL.FNR_N      = NISF.FNR         ;                            00038120
      NYKKEL.REGTPK_N   = TID1             ;                            00038130
      NYKKEL.IÅR_N      = W02_PI_ÅR        ;                            00038140
      NYKKEL.IART_N     = W02_ART          ;                            00038150
      NYKKEL.BLTYPE_N   = W02_BLTYPE       ;                            00038160
      NYKKEL.KOMMNR1_N  = W02_PI_KOMMNR    ;                            00038170
      NYKKEL.AGIVNR_N   = 0                ;                            00038180
                                                                        00038190
 /* 11.01-89 AV TUYEN */                                                00038200
                                                                        00038210
      NYKKEL.RAPPDATO_N = R4_DATO          ;                            00038220
                                                                        00038230
 /* HIT */                                                              00038240
                                                                        00038250
      KEY_PEKER         = ADDR(KEY)        ;                            00038260
      KEY_RECL          = LISTE_RECL       ;                            00038270
                                                                        00038280
                                                                        00038290
      EXEC CICS HANDLE CONDITION ERROR    (L105)             ;          00038300
      EXEC CICS HANDLE CONDITION DUPREC   (ALT_OK)           ;          00038310
      EXEC CICS WRITE  DATASET ('OLINNTE') RIDFLD  (KEY_BIT )           00038320
                                           FROM    (KEY_RECL);          00038330
      GOTO ALT_OK;                                                      00038340
                                                                        00038350
   L130:                                                                00038360
      FEIL_MELD_NR                =    505 ;                            00038370
      FEIL_VED_LABEL              =   '130';                            00038380
      FATAL_FEIL                  =   '1'B ;                            00038390
                                                                        00038400
   ALT_OK:                                                              00038410
                                                                        00038420
 END SKRIV_LISTEDATA_KORR;                                              00038430
                                                                        00038440
                                                                        00038450
  %INCLUDE R0019912;             /*  NUM-> CHAR                       */00038460
  %INCLUDE R0019905;             /*  F_ALDER                          */00038470
  %INCLUDE R0019947;             /*  ÅÅMMDD > ÅRDAGNR,ÅRDAGNR > ÅÅMMDD*/00038480
  %INCLUDE R0019957;             /*  P900_NOR_DATA (FNR,TKNR)         */00038490
                                                                        00038500
                                                                        00038510
 END R001I50;                                                           00038520
