 /*       SIST ENDRET 25/11-91 13.57.42 AV   HERMAN                   */00000000
 /*       SIST ENDRET 06/09-91 10.10.59 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 03/09-91 12.55.10 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 14/06-91 13.30.55 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 22/03-91 12.22.15 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 18/09-90 13.11.51 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 29/03-88 13.22.51 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 10/03-87 09.07.45 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 11/10-84 11.56.42 AV   KARIN                    */00000080
 /*       SIST ENDRET 25/04-83 11.54.47 AV   OLAV                     */00000090
 /*       SIST ENDRET 06/04-83 15.07.25 AV   OLAV                     */00000100
 /*       SIST ENDRET 24/03-83 12.34.41 AV   OLAV                     */00000110
 /*       SIST ENDRET 24/03-83 12.13.10 AV   OLAV                     */00000120
 /* **************************************************************** */ 00000130
 /*IDENTIFIKASJON:                                                   */ 00000140
 /*    R0014801 - PROSEDYRE I PLI                                    */ 00000150
 /*    PROGRAMMERER: JAN, JUNI 1982                                  */ 00000160
 /*HENSIKT:                                                          */ 00000170
 /*    BEREGNE ETTERLATTEPENSJON FOR BARN, EN AV FORELDRENE DØD      */ 00000180
 /*                                                                  */ 00000190
 /*PROGRAMTILKNYTNING:                                               */ 00000200
 /*    KALLES OPP AV PROGRAM R0013520                                */ 00000210
 /*BRUK:                                                             */ 00000220
 /*    EXEC CICS XCTL PROGRAM ('R0014801') COMMAREA (KOM_OMR)        */ 00000230
 /* **************************************************************** */ 00000240
 /* SIST ENDRET AV KARIN 11/10-84                                    */ 00000250
 /* ENDRINGEN GJELDER FEIL I TT_ANV, TT_FRAMT_DØD ER ERSTATTET MED   */ 00000260
 /*                          TT_FRAMT.                               */ 00000270
 /* **************************************************************** */ 00000280
 /* SIST ENDRET AV TRUDE MARS 91                                     */ 00000290
 /* ENDRINGEN GJELDER : NY BLANKETT B6,BT TRYGDETIDSAVHENGIG.        */ 00000300
 /*                                                                  */ 00000310
 /* **************************************************************** */ 00000320
 %PAGE;                                                                 00000330
 REGN_BP:                                                               00000340
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000350
 %PAGE;                                                                 00000360
  /*  %INCLUDE P0011101;   */                                           00000370
      %INCLUDE P0019906;                                                00000380
      %INCLUDE P0019908;                                                00000390
      %INCLUDE P0019910;                                                00000400
      %INCLUDE P0019912;                                                00000410
 %PAGE;                                                                 00000420
   DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                       00000430
   DCL COMMAREA_PEKER PTR;                                              00000440
 %PAGE;                                                                 00000450
   DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                       00000460
 %PAGE;                                                                 00000470
   DCL                                                                  00000480
      VERIFY                      BUILTIN,                              00000490
      FNR                         PIC '(11)9',                          00000500
      FNR_IND_SIF DEF FNR POS (9) PIC '9';                              00000510
   DCL                                                                  00000520
      GP                    FIXED DEC(5),                               00000530
      KT                    FIXED DEC(5),                               00000540
      W_GP_UFØR             FIXED DEC(5),                               00000550
      W_ANTALL_BARN         FIXED DEC(3),                               00000560
      TT_ANV_ETTERLATT UNAL FIXED DEC(3),                               00000570
      TT_ANV_UFØR UNAL      FIXED DEC(3),                               00000580
      MF_IND                FIXED BIN(15),                              00000590
      I                     FIXED BIN(15);                              00000600
                                                                        00000610
   DCL                                                                  00000620
      B6_TT_REDUSERT       FIXED DEC (3) INIT (0);                      00000630
                                                                        00000640
 /* ***************************************************************** */00000650
 /* PROGRAMMET STARTER HER                                            */00000660
 /* ***************************************************************** */00000670
                                                                        00000680
  IF TRANS_OPPL_OMR.BLANKETTYPE  = 'B6' THEN                            00000690
     CALL HENT_FRA_B6;                                                  00000700
  ELSE                                                                  00000710
    IF TRANS_OPPL_OMR.BLANKETTYPE  = 'BP' THEN                          00000720
       CALL HENT_FRA_BP;                                                00000730
                                                                        00000740
 /* ***************************************************************** */00000750
 /* DERSOM AVDØDE ER KVINNE                                           */00000760
 /* ***************************************************************** */00000770
                                                                        00000780
    IF VERIFY(FNR_IND_SIF,'02468') = 0 THEN                             00000790
       MF_IND = 1;                                                      00000800
    ELSE                                                                00000810
                                                                        00000820
 /* **************************************************************** */ 00000830
 /* AVDØDE ER MANN                                                   */ 00000840
 /* **************************************************************** */ 00000850
                                                                        00000860
       MF_IND = 2;                                                      00000870
    TT_ANV_ETTERLATT = 0;                                               00000880
    TT_ANV_UFØR      = 0;                                               00000890
                                                                        00000900
    TT_ANV_ETTERLATT = B02.TT_FØR_1967   (MF_IND) +                     00000910
                      (B02.TT_ETTER_1966 (MF_IND) +                     00000920
                       B02.TT_FRAMT      (MF_IND) + 11)/ 12 +           00000930
                       B02.TT_67_TIL_70  (MF_IND);                      00000940
                                                                        00000950
                                            /*NY 0191 */                00000960
    IF B02.TT_16_66(MF_IND)  > 0  THEN                                  00000970
       TT_ANV_ETTERLATT = (B02.TT_16_66(MF_IND) +                       00000980
                           B02.TT_FRAMT (MF_IND) + 6) / 12 +            00000990
                           B02.TT_67_TIL_70(MF_IND);                    00001000
                                                                        00001010
    IF B6_TT_REDUSERT  > 0 THEN                                         00001020
      DO;                                                               00001030
        TT_ANV_ETTERLATT = B6_TT_REDUSERT;                              00001040
        B02.TT_16_66(BER_SØ_IND)  = TT_ANV_ETTERLATT * 12;              00001050
      END;                                                              00001060
                                                                        00001070
    ELSE                                               /*TRUDE 0991*/   00001080
      DO;                                                               00001090
       IF B02.TT_16_66(BER_SØ_IND)  = 0  THEN                           00001100
         DO;                                                            00001110
          TT_ANV_ETTERLATT = 40;                                        00001120
          B02.TT_16_66(BER_SØ_IND)  = TT_ANV_ETTERLATT * 12;            00001130
         END;                                                           00001140
      END;                                                              00001150
                                                         /*TIL HIT */   00001160
                                                                        00001170
    IF B02.TT_16_66(BER_SØ_IND)  > 0 THEN                               00001180
       TT_ANV_ETTERLATT = B02.TT_16_66(BER_SØ_IND) / 12;                00001190
                                                                        00001200
    IF TT_ANV_ETTERLATT > 39 THEN                                       00001210
       TT_ANV_ETTERLATT = 40;                                           00001220
                                                                        00001230
                                                                        00001240
    W_ANTALL_BARN    = B02.ANTALL_BARN (BER_SØ_IND);                    00001250
    GP               = G * 0.4;                                         00001260
                                                                        00001270
    IF W_ANTALL_BARN > 1 THEN                                           00001280
       GP = GP + G * 0.25 * (W_ANTALL_BARN - 1);                        00001290
    GP = GP / (W_ANTALL_BARN * 12) + 0.5;                               00001300
                                                                        00001310
  /* IF TRANS_OPPL_OMR.BLANKETTYPE  = 'B6' THEN        NY0191*/         00001320
  /*   IF B6_TT_REDUSERT   > 0 THEN             */                      00001330
  IF TT_ANV_ETTERLATT < 40   THEN      /*0891TS*/                       00001340
      DO;                                                               00001350
          GP            = G * 0.4;                                      00001360
                                                                        00001370
          IF W_ANTALL_BARN > 1 THEN                                     00001380
             GP = GP + G * 0.25 * (W_ANTALL_BARN - 1);                  00001390
                                                                        00001400
       /* GP = GP * B6_TT_REDUSERT / 40;   */                           00001410
          GP = GP * TT_ANV_ETTERLATT / 40;                              00001420
          GP = GP / (W_ANTALL_BARN * 12) + 0.5;                         00001430
      END;                                                              00001440
                                                                        00001450
 /* ***************************************************************** */00001460
 /* DEM SKAL NORMALT IKKE OVERFØRES KOMP.TILLEGG,MEN DET KAN OVERFØRES*/00001470
 /* FRA DEN ETTERLATTE EKTEFELLEN                                     */00001480
 /* ***************************************************************** */00001490
                                                                        00001500
    IF TRANSTYPE = 40 ! B01.ETTEBARN.KT (BER_SØ_IND) > 0 THEN           00001510
                                                                        00001520
 /* ***************************************************************** */00001530
 /* VED ENDRINGER BEHOLDES KT DERSOM DET ER UTBETALT FRA FØR          */00001540
 /* ***************************************************************** */00001550
 /*   ENDRET   10.02.88   SATISH                                */      00001560
 /*    KT = F_BEREGN_KOMPENSASJONSTILLEGG('Y',                  */      00001570
 /*              TT_ANV_ETTERLATT,W_ANTALL_BARN,1,'J');         */      00001580
 /*  HIT TIL         10.02.88                                   */      00001590
       KT = F_BEREGN_KOMPENSASJONSTILLEGG('N','P',                      00001600
                 TT_ANV_ETTERLATT,W_ANTALL_BARN,1,'J');                 00001610
    ELSE                                                                00001620
       KT = 0;                                                          00001630
                                                                        00001640
 /* ***************************************************************** */00001650
 /* KOMP. SKAL IKKE GIS TIL UTENLANDSBOENDE.  ERIK 22.12.86.          */00001660
 /* ***************************************************************** */00001670
                                                                        00001680
    IF B02.TKNR(BER_SØ_IND) = '2101' THEN                               00001690
       DO;                                                              00001700
          KT = 0;                                                       00001710
       END;                                                             00001720
                                                                        00001730
    DO I = 3 TO 14;                                                     00001740
                                                                        00001750
 /* ***************************************************************** */00001760
 /* DERSOM BARNET ER ETTERLATT MED UFØREPENSJON.                      */00001770
 /* ***************************************************************** */00001780
                                                                        00001790
       B02.ETTEBARN.SPT_MOR(I) = 0;                                     00001800
       B02.ETTEBARN.OPT_MOR(I) = 0;                                     00001810
       B02.ETTEBARN.PÅ_MOR(I)  = 0;                                     00001820
       B02.ETTEBARN.SPT_FAR(I) = 0;                                     00001830
       B02.ETTEBARN.OPT_FAR(I) = 0;                                     00001840
       B02.ETTEBARN.PÅ_FAR(I)  = 0;                                     00001850
       IF B02.PENSJONSTYPE1 (I) = 'N' THEN                              00001860
          DO;                                                           00001870
             IF B02.PENSJONSTYPE3 (I) = 'U' THEN                        00001880
                DO;                                                     00001890
                   CALL BEREGN_GP_UFØR_ETTERLATT_BARN(I,TT_ANV_UFØR,    00001900
                                                       W_GP_UFØR);      00001910
                   B02.TT_ANV     (I) = TT_ANV_UFØR;                    00001920
                   B02.UFØRPENS.GP(I) = W_GP_UFØR;                      00001930
                   B02.UFØRPENS.ST(I) = F_BEREGN_SÆRTILLEGG_BARN(       00001940
                                            B02.VIRK_DATO_ÅM (I),       00001950
                                            TT_ANV_UFØR,0,G,            00001960
                                            ST_PROSENT_ENSLIG,1);       00001970
                                                                        00001980
 /* ***************************************************************** */00001990
 /* SYSTEMET KAN IKKE BEREGNE TILLEGGSPENSJON I SLIKE TILFELLE,       */00002000
 /* MELDING PÅ STØNADSBREVET OM DETTE.                                */00002010
 /* ***************************************************************** */00002020
                                                                        00002030
 /* ENDRET 15.03.88  SATISH                                          */ 00002040
 /*            B02.UFØRPENS.KT(I) = F_BEREGN_KOMPENSASJONSTILLEGG    */ 00002050
 /*                               ('P',TT_ANV_UFØR,1,1,'J');         */ 00002060
 /* HITTIL                                                           */ 00002070
                                                                        00002080
                   B02.UFØRPENS.KT(I) = F_BEREGN_KOMPENSASJONSTILLEGG   00002090
                                        ('0','P',TT_ANV_UFØR,1,1,'J');  00002100
                                                                        00002110
                                                                        00002120
 /*KOMP.TILLEGGET ENDRET FRA 1.5.91 ( G > 34100 ) */                    00002130
                                                                        00002140
  IF G > 34100 THEN                                                     00002150
     IF B02.UFØRPENS.KT(I) > B02.UFØRPENS.ST(I) THEN                    00002160
        B02.UFØRPENS.KT(I) =                                            00002170
        B02.UFØRPENS.KT(I) - B02.UFØRPENS.ST(I);                        00002180
     ELSE                                                               00002190
        B02.UFØRPENS.KT(I) = 0;                                         00002200
                                                                        00002210
                                                                        00002220
                                                                        00002230
                   B02.SUM_YTELSE (I) = B02.UFØRPENS.GP (I)             00002240
                                         + B02.UFØRPENS.ST (I)          00002250
                                         + B02.UFØRPENS.KT (I);         00002260
                                                                        00002270
 /* ***************************************************************** */00002280
 /* YTELSENE SOM UFØR ER ALLTID STØRRE ENN SOM ETTERLATT BARN.        */00002290
 /* ***************************************************************** */00002300
 /* ***************************************************************** */00002310
 /* HER NULLES ETTEBARN SEGMENTET.                                    */00002320
 /* ***************************************************************** */00002330
                                                                        00002340
                  B02.ETTEBARN.GP (I) = 0;                              00002350
                  B02.ETTEBARN.KT (I) = 0;                              00002360
               END;                                                     00002370
            ELSE IF  B02.STATUS_KODE_HIST (I) ^= 'O'  THEN              00002380
               DO;                                                      00002390
                  B02.ETTEBARN.GP (I) = GP;                             00002400
                  B02.ETTEBARN.KT (I) = KT;                             00002410
                  B02.ETTEBARN.TP (I) = 0;                              00002420
                  B02.ETTEBARN.TP (I) = 0;                              00002430
                  B02.SUM_YTELSE  (I) = GP + KT;                        00002440
                  B02.TT_ANV      (I) = TT_ANV_ETTERLATT;               00002450
               END;                                                     00002460
        END;                                                            00002470
    END;                                                                00002480
                                                                        00002490
   HENT_FRA_BP: PROC;                                                   00002500
   %INCLUDE P0011101;                                                   00002510
                                                                        00002520
   END HENT_FRA_BP;                                                     00002530
                                                                        00002540
                                                                        00002550
   HENT_FRA_B6: PROC;                                                   00002560
   %INCLUDE P001NB01;                                                   00002570
                                                                        00002580
   IF B6B.TT_REDUSERT  >  0   THEN                                      00002590
      B6_TT_REDUSERT = B6B.TT_REDUSERT;                                 00002600
                                                                        00002610
   END HENT_FRA_B6;                                                     00002620
   EXEC CICS RETURN;                                                    00002630
        %INCLUDE R0014134;                                              00002640
        %INCLUDE R0014723;                                              00002650
        %INCLUDE R0014724;                                              00002660
   END REGN_BP;                                                         00002670
