   R0019947: PROC(BUFF) RETURNS(CHAR (6));                                      
 /*-------------------------------------------------------------------*/        
 /*      HJELPEPROGRAM FOR OMGJØRING FRA ÅR/MND/DAG TIL ÅR/DAGNR      */        
 /*      OG OMVENDT.                                                  */        
 /*                                                                   */        
 /*      BUFF ER KOMMUNIKASJONEN MELLOM DET KALLENDE PROGRAM OG       */        
 /*      R0019947.                                                    */        
 /*                                                                   */        
 /*      HVIS R0019947 KALLES MED EN VERDI AV TYPEN ÅRMDDG, VIL       */        
 /*      HJELPEPROGRAMMET GI TILBAKE VERDIEN ÅRDAGNR. HVIS R0019947   */        
 /*      KALLES MED EN VERDI AV TYPEN ÅRDAGNR, VIL VERDIEN ÅRMDDG     */        
 /*      BLI SENDT TILBAKE. FORUTSETNINGEN FOR Å FÅ UTFØRT DET        */        
 /*      SISTNEVNTE ER AT 6. SIFFER I INPUT ER BLANK.                 */        
 /*      KOMMUNIKASJONEN FOREGÅR I UPAKKET FELT.                      */        
 /*-------------------------------------------------------------------*/        
         DCL BUFF CHAR (6);                                                     
         DCL DGNR  DEF BUFF PIC '(5)9',                                         
             BÅR   DEF BUFF PIC '99',                                           
             TESTB DEF BUFF POS (6) CHAR(1),                                    
             DAT   DEF BUFF PIC '(6)9';                                         
         DCL 1 DATUM,                                                           
               2 ÅR    PIC'99',                                                 
               2 MD    PIC'99',                                                 
               2 DG    PIC'99',                                                 
             1 DATO DEF DATUM PIC'(6)9';                                        
         DCL 1 DAGNUM,                                                          
               2 ÅR    PIC'99',                                                 
               2 DNR   PIC'999',                                                
             1 DAGNR DEF DAGNUM PIC'(5)9';                                      
         DCL DNR_X   FIXED BIN(15) INIT(0);                                     
         DCL 1 MDTAB,                                                           
               2 MD01  PIC '99' INIT(31),                                       
               2 MD02  PIC '99' INIT(00),                                       
               2 MD03  PIC '99' INIT(31),                                       
               2 MD04  PIC '99' INIT(30),                                       
               2 MD05  PIC '99' INIT(31),                                       
               2 MD06  PIC '99' INIT(30),                                       
               2 MD07  PIC '99' INIT(31),                                       
               2 MD08  PIC '99' INIT(31),                                       
               2 MD09  PIC '99' INIT(30),                                       
               2 MD10  PIC '99' INIT(31),                                       
               2 MD11  PIC '99' INIT(30),                                       
               2 MD12  PIC '99' INIT(31);                                       
         DCL 1 MDTALL(12) POS(1) DEF MDTAB,                                     
               2 TALL  PIC '99';                                                
         DCL INDEX  FIXED BIN(15);                                              
         DCL FEIL   BIT(1) INIT ('0'B),                                         
             DIV    FIXED BIN(31),                                              
             REST   FIXED BIN(15);                                              
         DCL SUM BUILTIN;                                                       
 START:                                                                         
         IF TESTB = ' ' THEN                                                    
            DO;                                                                 
               IF TESTB = ' ' &  VERIFY(DGNR, '0123456789') > 0 THEN            
                  FEIL = '1'B;                                                  
            END;                                                                
          ELSE                                                                  
            IF VERIFY(DAT, '0123456789') > 0 THEN                               
               FEIL = '1'B;                                                     
         IF ^ FEIL THEN                                                         
            DO;                                                                 
 /* FORTSETT: */                                                                
               DIV = BÅR / 4;                                                   
               REST = BÅR - (4 * DIV);                                          
               IF REST > 0 THEN                                                 
                  MD02 = 28;                                                    
                ELSE                                                            
                  MD02 = 29;                                                    
               IF TESTB ^= ' ' THEN                                             
                  DO;                                                           
 /* GJØR_OM: */                                                                 
                     DATO = DAT;                                                
                     IF MD > 12 ! MD = 0 THEN                                   
                        FEIL = '1'B;                                            
                      ELSE                                                      
                        IF DG = 0 ! DG > TALL(MD) THEN                          
                           FEIL = '1'B;                                         
                     IF ^ FEIL THEN                                             
                        DO;                                                     
                           INDEX     = MD - 1;                                  
                           DAGNUM.ÅR = DATUM.ÅR;                                
                           DNR       = 0;                                       
                           DO WHILE (INDEX > 0);                                
                              DNR   = DNR + TALL(INDEX);                        
                              INDEX = INDEX - 1;                                
                           END;                                                 
                           DNR  = DNR + DG;                                     
                           DGNR = DAGNR;                                        
                        END;                                                    
                  END;                                                          
 /* END GJØR_OM */                                                              
                ELSE                                                            
                  DO;                                                           
 /* GJØR_TILBAKE: */                                                            
                     DAGNR = DGNR;                                              
                     IF DNR = 0 ! DNR > SUM(TALL) THEN                          
                        FEIL = '1'B;                                            
                      ELSE                                                      
                        DO;                                                     
                           DNR_X    = DNR;                                      
                           DATUM.ÅR = DAGNUM.ÅR;                                
                           INDEX    = 1;                                        
                           DO WHILE (DNR_X > 0);                                
                              DNR_X = DNR_X - TALL(INDEX);                      
                              IF DNR_X > 0 THEN                                 
                                 INDEX = INDEX + 1;                             
                           END;                                                 
                           DNR       = DNR_X + TALL(INDEX);                     
                           DATUM.MD  = INDEX;                                   
                           DATUM.DG  = DNR;                                     
                           DAT = DATO;                                          
                        END;                                                    
                  END;                                                          
   /*    END GJØR_TILBAKE */                                                    
            END;                                                                
   /* END FORTSETT        */                                                    
 SLUTT:                                                                         
         IF FEIL THEN                                                           
            PUT SKIP LIST('FEIL DATO INPUT ', BUFF);                            
         RETURN (BUFF);                                                         
   END R0019947;                                                                
