 /*       SIST ENDRET 02/07-98 13.53.02 AV   JDA7339                  */00000000
 /*       SIST ENDRET 02/07-98 13.49.08 AV   JDA7339                  */00000010
 /*       SIST ENDRET 29/06-98 08.45.55 AV   JDA7339                  */00000020
 /*       SIST ENDRET 29/06-98 08.39.51 AV   JDA7339                  */00000030
 /*       SIST ENDRET 15/06-98 13.27.55 AV   JDA7339                  */00000040
 /*       SIST ENDRET 15/06-98 13.24.43 AV   JDA7339                  */00000050
 /*       SIST ENDRET 19/05-98 13.02.51 AV   JDA7339                  */00000060
 /*       SIST ENDRET 19/05-98 12.49.51 AV   JDA7339                  */00000070
 /*       SIST ENDRET 08/05-98 12.39.51 AV   JDA7339                  */00000080
 /*       SIST ENDRET 05/05-98 13.02.45 AV   JDA7339                  */00000090
 /*       SIST ENDRET 29/04-98 10.19.28 AV   JDA7339                  */00000100
 /*       SIST ENDRET 29/04-98 10.12.43 AV   JDA7339                  */00000110
 /*       SIST ENDRET 25/03-98 14.18.55 AV   JDA7339                  */00000120
 /*       SIST ENDRET 24/03-98 11.49.30 AV   MHA7339                  */00000130
 /*       SIST ENDRET 13/03-98 10.06.12 AV   JDA7339                  */00000140
 /*       SIST ENDRET 13/03-98 10.00.48 AV   JDA7339                  */00000150
 /*       SIST ENDRET 19/08-97 10.44.32 AV   TSB7339                  */00000160
 /*       SIST ENDRET 19/08-97 10.40.22 AV   TSB7339                  */00000170
 /*       SIST ENDRET 23/05-97 12.24.32 AV   JDA7339                  */00000180
 /*       SIST ENDRET 03/11-95 09.35.13 AV   TSB0310                  */00000190
 /*       SIST ENDRET 12/10-95 14.25.32 AV   JDA0310                  */00000200
 /*       SIST ENDRET 28/11-94 11.08.22 AV   JDA0310                  */00000210
 /*       SIST ENDRET 29/08-94 13.01.45 AV   DYBVIK                   */00000220
 /*       SIST ENDRET 16/08-94 11.36.22 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 21/03-94 15.02.08 AV   DYBVIK                   */00000240
 /*       SIST ENDRET 11/03-94 14.44.10 AV   TRUDE                    */00000250
 /*       SIST ENDRET 25/02-94 13.04.29 AV   HERMAN                   */00000260
 /*       SIST ENDRET 11/02-93 13.27.07 AV   DYBVIK                   */00000270
 /*       SIST ENDRET 17/09-92 09.48.22 AV   DYBVIK                   */00000280
 /*       SIST ENDRET 26/09-83 12.05.03 AV   OLAV                     */00000290
 R001400:                                                               00000300
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000310
 %SKIP;    /*  */                                                       00000320
 /* ***************************************************************** */00000330
 /*IDENTIFIKASJON:                                                    */00000340
 /*     R0014001 - PROSEDYRE I PLI                                    */00000350
 /*     PROGRAMMERER: P. BERGESTAD, APRIL 1982                        */00000360
 /*HENSIKT:                                                           */00000370
 /*     HOVEDPROSEDYRE FOR BEREGNING.                                 */00000380
 /*PROGRAMTILKNYTNING:                                                */00000390
 /*     PROGRAMMET KALLES OPP FRA R0013001 (BEHANDLE TRANS) VHA. CICS */00000400
 /*BRUK:                                                              */00000410
 /*     EXEC CICS LINK('R0014001')                                    */00000420
 /* ***************************************************************** */00000430
 %INCLUDE P0019906;     /* TRANS OPPLYSNINGSOMRÅDE           */         00000440
 %INCLUDE P0019908;     /* KOM OMRÅDET                       */         00000450
 %INCLUDE P0019912;     /* DIV-PARAM OMR                     */         00000460
 %INCLUDE P0019910;     /* STYRINGSOMRÅDE                    */         00000470
  DCL 1 B01 BASED(B01_PEKER),                                           00000480
 %INCLUDE P0019921;     /* B01-OMRÅDET                       */         00000490
  DCL 1 B02 BASED(B02_PEKER),                                           00000500
 %INCLUDE P0019921;     /* B02-OMRÅDET                       */         00000510
  DCL 1 B02_SAVE BASED(EKSTRA_PEKER2),                                  00000520
 %INCLUDE P0019921;     /* SAVE-OMRÅDE FOR EØS-PROGRAM       */         00000530
 %INCLUDE P0019925;     /* GRUNNBELØPS - TABELL              */         00000540
  DCL                                                                   00000550
     (ADDR,                                                             00000560
      CSTG)             BUILTIN;                                        00000570
  DCL                                                                   00000580
     COMMAREA_PEKER    PTR;                                             00000590
  DCL                                                                   00000600
     W_VIRK_DATO_ÅMD   FIXED DEC(7),                                    00000610
     W_TRANSTYPE       PIC'99',                                         00000620
     (I,J,W_IND)       FIXED BIN(15);                                   00000630
  DCL  H_BER_SØ_IND    FIXED BIN (15),                                  00000640
       H_BER_EK_IND    FIXED BIN (15);                                  00000650
                                                                        00000660
  DCL   HL_TESTX   CHAR (1);                                            00000670
 %PAGE;                                                                 00000680
                                                                        00000690
                                                                        00000700
    PROGRAM_ID = 'R0014001';                                            00000710
                                                                        00000720
    ALLOCATE B02_SAVE;                                                  00000730
    KOM_OMR.EKSTRA_PEKER2 = ADDR(B02_SAVE);                             00000740
                                                                        00000750
    BER_SØ_IND = SØKER_IND;                                             00000760
    BER_EK_IND = EKTEF_IND;                                             00000770
                                                                        00000780
 /* ***************************************************************** */00000790
 /* FORSØRGET BARN ER DØD  -  ENDRING LAGT INN 18.7.84 HL.            */00000800
 /* ***************************************************************** */00000810
                                                                        00000820
    IF TRANSTYPE = 19                   THEN                            00000830
       DO;                                                              00000840
          IF B01.RF0PERSN.FNR(1) = B01.TILKN.FNR_TILKN(SØKER_IND,1) THEN00000850
             DO;                                                        00000860
                BER_SØ_IND = 1;                                         00000870
                BER_EK_IND = 2;                                         00000880
             END;                                                       00000890
          ELSE                                                          00000900
             DO;                                                        00000910
                BER_SØ_IND = 2;                                         00000920
                BER_EK_IND = 1;                                         00000930
             END;                                                       00000940
       END;                                                             00000950
                                                                        00000960
 /* ***************************************************************** */00000970
 /* FORSØRGET EKTEFELLE ER DØD, ELLER EKTEFELLE MED PENSJON ER DØD,   */00000980
 /* ELLER EKTEFELLENS PENSJON ER STOPPET AV ANDRE GRUNNER ENN DØD.    */00000990
 /* ***************************************************************** */00001000
                                                                        00001010
 /* ENDRET 24.2.88 HL - GAMMEL TRANSTYPE 39 ER FJERNET */               00001020
                                                                        00001030
    IF TRANSTYPE = 17   !                                               00001040
       TRANSTYPE = 18   !                                               00001050
       TRANSTYPE = 36   !                                               00001060
       TRANSTYPE = 35   !                                               00001070
       TRANSTYPE = 37      THEN                                         00001080
       DO;                                                              00001090
          IF BER_SØ_IND = 1 THEN                                        00001100
             DO;                                                        00001110
                BER_SØ_IND = 2;                                         00001120
                BER_EK_IND = 1;                                         00001130
             END;                                                       00001140
          ELSE                                                          00001150
             IF BER_SØ_IND = 2 THEN                                     00001160
                DO;                                                     00001170
                   BER_SØ_IND = 1;                                      00001180
                   BER_EK_IND = 2;                                      00001190
                END;                                                    00001200
             ELSE                                                       00001210
                DO I = 3 TO 14;                                         00001220
                                                                        00001230
                   IF B02.PENSJONSTYPE2(I) = 'P' &                      00001240
                      (B02.PENSJONSTYPE1(I) = 'N' !                     00001250
                       B02.PENSJONSTYPE1(I) = 'B')      THEN            00001260
                      DO;                                               00001270
                         BER_SØ_IND = I;                                00001280
                         I = 14;                                        00001290
                      END;                                              00001300
                END;                                                    00001310
       END;                                                             00001320
 /* ***************************************************************** */00001330
 /* OBS. NÅR EK. PENSJON MÅ REGNES OM, SETTER VI TRANSTYPE = BLANK    */00001340
 /* VI BEHØVER IKKE ANDRE OPPLYSNINGER I TRANSEN FOR ALDERSPENSJONIST */00001350
 /* ***************************************************************** */00001360
                                                                        00001370
 /* HENTER G, ST_PROSENT_ENSLIG, ST_PROSENT_SAMST PR.VIRK_DATO, GV_TAB*/00001380
                                                                        00001390
 %SKIP;                                                                 00001400
    IF TRANSTYPE = 27 !                                                 00001410
       TRANSTYPE = 22 !                                                 00001420
       TRANSTYPE = 23 !                                                 00001430
       TRANSTYPE = 43 !                                                 00001440
       TRANSTYPE = 44                     THEN                          00001450
       W_VIRK_DATO_ÅMD = F_SNU_DATO(                                    00001460
                       TRANS_OPPL_OMR.VIRKNINGSDATO)  * 100 + 1;        00001470
    ELSE                                                                00001480
       W_VIRK_DATO_ÅMD = B02.VIRK_DATO_ÅM(BER_SØ_IND) * 100 + 1;        00001490
                                                                        00001500
 /*VIRK_DATO LIK G_DATO NåR 4001 CALLES FRA 1820-AUTO. 9804             00001510
                                                                        00001520
    IF KJØRINGS_TYPE = 'A'           THEN                               00001530
       W_VIRK_DATO_ÅMD = B01.G_DATO_ÅM(BER_SØ_IND) * 100 + 1;           00001540
 FJERNET 9806 *********************************** */                    00001550
                                                                        00001560
    IF W_VIRK_DATO_ÅMD < 920000         &                               00001570
       BER_SØ_IND < 3                         THEN                      00001580
       DO;                                                              00001590
          B01.GT_LOV92(BER_SØ_IND) = 0;                                 00001600
          B01.GT_LOV92(BER_EK_IND) = 0;                                 00001610
          B02.GT_LOV92(BER_SØ_IND) = 0;                                 00001620
          B02.GT_LOV92(BER_EK_IND) = 0;                                 00001630
          B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                         00001640
          B02.GT_TILLEGG_LOV92(BER_EK_IND) = 0;                         00001650
          B02.ALDERSP.SPT_1291(BER_SØ_IND) = 0;                         00001660
          B02.ALDERSP.OPT_1291(BER_SØ_IND) = 0;                         00001670
          B02.ALDERSP.PÅ_1291(BER_SØ_IND) = 0;                          00001680
          B02.ALDERSP.SPT_1291(BER_EK_IND) = 0;                         00001690
          B02.ALDERSP.OPT_1291(BER_EK_IND) = 0;                         00001700
          B02.ALDERSP.PÅ_1291(BER_SØ_IND) = 0;                          00001710
          B02.UFØRPENS.SPT_1291(BER_SØ_IND) = 0;                        00001720
          B02.UFØRPENS.OPT_1291(BER_SØ_IND) = 0;                        00001730
          B02.UFØRPENS.PÅ_1291(BER_SØ_IND) = 0;                         00001740
          B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND) = 0;                      00001750
          B02.UFØRPENS.SPT_1291(BER_EK_IND) = 0;                        00001760
          B02.UFØRPENS.OPT_1291(BER_EK_IND) = 0;                        00001770
          B02.UFØRPENS.PÅ_1291(BER_EK_IND) = 0;                         00001780
          B02.UFØRPENS.PÅ_ETTER91(BER_EK_IND) = 0;                      00001790
          B02.ETTEPENS.SPT_1291(BER_SØ_IND) = 0;                        00001800
          B02.ETTEPENS.OPT_1291(BER_SØ_IND) = 0;                        00001810
          B02.ETTEPENS.PÅ_1291(BER_SØ_IND) = 0;                         00001820
          B02.ETTEPENS.PÅ_ETTER91(BER_SØ_IND) = 0;                      00001830
          B02.ETTEPENS.SPT_1291(BER_EK_IND) = 0;                        00001840
          B02.ETTEPENS.OPT_1291(BER_EK_IND) = 0;                        00001850
          B02.ETTEPENS.PÅ_1291(BER_EK_IND) = 0;                         00001860
          B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND) = 0;                      00001870
          B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) = 0;                      00001880
          B02.YRKEPENS.YRKE_POENG_1291(BER_SØ_IND) = 0;                 00001890
          B02.YRKEPENS.PÅ_ETTER91(BER_EK_IND) = 0;                      00001900
          B02.YRKEPENS.YRKE_POENG_1291(BER_EK_IND) = 0;                 00001910
       END;                                                             00001920
                                                                        00001930
    DO J = 1 TO 60;                                                     00001940
       IF W_VIRK_DATO_ÅMD >= PERIODE_START_ÅMD(J) &                     00001950
          W_VIRK_DATO_ÅMD <= PERIODE_SLUTT_ÅMD(J) THEN                  00001960
          DO;                                                           00001970
             G                 = G_TAB_PERIODE.GRUNNBELØP(J);           00001980
             ST_PROSENT_ENSLIG = G_TAB_PERIODE.ST_PROSENT_E(J);         00001990
             ST_PROSENT_SAMST  = G_TAB_PERIODE.ST_PROSENT_S(J);         00002000
                                                                        00002010
             DO I = 1 TO 14;                                            00002020
                IF B02.FNR(I)        > 0 THEN                           00002030
                   B02.G_DATO_ÅM(I)  = PERIODE_START_ÅMD(J) / 100;      00002040
             END;                                                       00002050
                                                                        00002060
             J                 = 99;                                    00002070
          END;                                                          00002080
    END;                                                                00002090
 %PAGE;                                                                 00002100
   DCL PT1    CHAR (1) INIT (' ');                                      00002110
   DCL PIND    FIXED BIN (15);                                          00002120
   DCL PDATO   FIXED DEC (5);                                           00002130
   PDATO  = B02.VIRK_DATO_ÅM(2);                                        00002140
   PT1    = B02.PENSJONSTYPE1(BER_SØ_IND);                              00002150
   PIND =  BER_SØ_IND;                                                  00002160
                                                                        00002170
   B02_SAVE = B02;                                                      00002180
                                                                        00002190
    SELECT (B02.PENSJONSTYPE1(BER_SØ_IND));                             00002200
       WHEN('A')                                                        00002210
          DO;                                                           00002220
             IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'E' THEN                00002230
                DO;                                                     00002240
                                                                        00002250
                   B02.ETTEPENS.FORVENTET(BER_SØ_IND) = 0;              00002260
                                                                        00002270
                   EXEC CICS LINK PROGRAM('R0014101') COMMAREA(KOM_OMR);00002280
                   IF FEIL_MELD_NR > 0  THEN                            00002290
                      GO TO L999;                                       00002300
                   ELSE                                                 00002310
                      PROGRAM_ID = 'R0014001';                          00002320
                END;                                                    00002330
             ELSE                                                       00002340
                DO;                                                     00002350
                   IF B02.P67_KODE(BER_SØ_IND) ^= '5'      THEN         00002360
                   EXEC CICS LINK PROGRAM('R0014201') COMMAREA(KOM_OMR);00002370
                   IF FEIL_MELD_NR > 0  THEN                            00002380
                      GO TO L999;                                       00002390
                   ELSE                                                 00002400
                      PROGRAM_ID = 'R0014001';                          00002410
                   IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'S' !             00002420
  /*TS 290894*/       B02.PENSJONSTYPE2(BER_EK_IND) = 'S' !             00002430
                      B02.PENSJONSTYPE2(BER_EK_IND) = 'P' !             00002440
 /*AFP*/              B02.PENSJONSTYPE2(BER_EK_IND) = 'N' THEN          00002450
                      DO;                                               00002460
                         W_TRANSTYPE = TRANS_OPPL_OMR.TRANSTYPE;        00002470
                         TRANS_OPPL_OMR.TRANSTYPE   = 0;                00002480
                         IF TRANS_OPPL_OMR.BLANKETTYPE = '24' !         00002490
                            TRANS_OPPL_OMR.BLANKETTYPE = '26' THEN      00002500
                            DO;                                         00002510
                               TRANS_OPPL_OMR.TRANSTYPE   =             00002520
                                  F_FELT_CHAR_PIC2                      00002530
                                     (TRANS_OPPL_OMR.BLANKETTYPE);      00002540
                               TRANS_OPPL_OMR.BLANKETTYPE = '  ';       00002550
                            END;                                        00002560
                         TRANS_OPPL_OMR.FØDSNUMMER  =                   00002570
                                                 B02.FNR(BER_EK_IND);   00002580
                         IF  SØKER_IND > 2 THEN                         00002590
                            DO;                                         00002600
                                H_BER_SØ_IND = BER_SØ_IND;              00002610
                                H_BER_EK_IND = BER_EK_IND;              00002620
                                BER_SØ_IND   = H_BER_EK_IND;            00002630
                                BER_EK_IND   = H_BER_SØ_IND;            00002640
                            END;                                        00002650
                         ELSE                                           00002660
                             DO;                                        00002670
                                BER_SØ_IND = EKTEF_IND;                 00002680
                                BER_EK_IND = SØKER_IND;                 00002690
                             END;                                       00002700
                         IF B02.PENSJONSTYPE1(BER_SØ_IND) ='A' THEN     00002710
                            DO;                                         00002720
                   IF B02.P67_KODE(BER_SØ_IND) ^= '5'      THEN         00002730
                               EXEC CICS LINK PROGRAM('R0014201')       00002740
                                                   COMMAREA(KOM_OMR);   00002750
                               IF FEIL_MELD_NR > 0  THEN                00002760
                                  GO TO L999;                           00002770
                               ELSE                                     00002780
                                  PROGRAM_ID = 'R0014001';              00002790
                            END;                                        00002800
                         ELSE                                           00002810
                         IF B02.PENSJONSTYPE1(BER_SØ_IND) ='K' THEN     00002820
                            DO;                                         00002830
                               EXEC CICS LINK PROGRAM('R0014251')       00002840
                                                   COMMAREA(KOM_OMR);   00002850
                               IF FEIL_MELD_NR > 0  THEN                00002860
                                  GO TO L999;                           00002870
                               ELSE                                     00002880
                                  PROGRAM_ID = 'R0014001';              00002890
                            END;                                        00002900
                         ELSE                                           00002910
                            DO;                                         00002920
                               EXEC CICS LINK PROGRAM('R0014401')       00002930
                                                   COMMAREA(KOM_OMR);   00002940
                               IF FEIL_MELD_NR > 0  THEN                00002950
                                  GO TO L999;                           00002960
                               ELSE                                     00002970
                                  PROGRAM_ID = 'R0014001';              00002980
                            END;                                        00002990
                         TRANS_OPPL_OMR.FØDSNUMMER =                    00003000
                                                 B02.FNR(SØKER_IND);    00003010
                         TRANS_OPPL_OMR.TRANSTYPE  = W_TRANSTYPE;       00003020
                         BER_SØ_IND  = SØKER_IND;                       00003030
                         BER_EK_IND  = EKTEF_IND;                       00003040
                      END;                                              00003050
                END;                                                    00003060
          END;                                                          00003070
 %PAGE;                                                                 00003080
       WHEN('E')                                                        00003090
          DO;                                                           00003100
             EXEC CICS LINK PROGRAM('R0014301') COMMAREA(KOM_OMR);      00003110
             IF FEIL_MELD_NR > 0  THEN                                  00003120
                GO TO L999;                                             00003130
             ELSE                                                       00003140
                PROGRAM_ID = 'R0014001';                                00003150
          END;                                                          00003160
       WHEN('J')                                                        00003170
          DO;                                                           00003180
             EXEC CICS LINK PROGRAM('R0014601') COMMAREA(KOM_OMR);      00003190
             IF FEIL_MELD_NR > 0  THEN                                  00003200
                GO TO L999;                                             00003210
             ELSE                                                       00003220
                PROGRAM_ID = 'R0014001';                                00003230
          END;                                                          00003240
       WHEN('B')                                                        00003250
          DO;                                                           00003260
             DO I = 3 TO 14;                                            00003270
                IF B02.PENSJONSTYPE2(I) = 'P' THEN                      00003280
                   DO;                                                  00003290
                      BER_SØ_IND = I;                                   00003300
                      I = 14;                                           00003310
                   END;                                                 00003320
             END;                                                       00003330
                                                                        00003340
             EXEC CICS LINK PROGRAM('R0014701') COMMAREA(KOM_OMR);      00003350
             IF FEIL_MELD_NR > 0  THEN                                  00003360
                GO TO L999;                                             00003370
             ELSE                                                       00003380
                PROGRAM_ID = 'R0014001';                                00003390
          END;                                                          00003400
       WHEN('N')                                                        00003410
          DO;                                                           00003420
             DO I = 3 TO 14;                                            00003430
                IF B02.PENSJONSTYPE2(I) = 'P' THEN                      00003440
                   DO;                                                  00003450
                      BER_SØ_IND = I;                                   00003460
                      I = 14;                                           00003470
                   END;                                                 00003480
             END;                                                       00003490
                                                                        00003500
             EXEC CICS LINK PROGRAM('R0014801') COMMAREA(KOM_OMR);      00003510
             IF FEIL_MELD_NR > 0  THEN                                  00003520
                GO TO L999;                                             00003530
             ELSE                                                       00003540
                PROGRAM_ID = 'R0014001';                                00003550
          END;                                                          00003560
 %PAGE;                                                                 00003570
       WHEN('U')                                                        00003580
          DO;                                                           00003590
             IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'E' THEN                00003600
                DO;                                                     00003610
                   EXEC CICS LINK PROGRAM('R0014501') COMMAREA(KOM_OMR);00003620
                   IF FEIL_MELD_NR > 0  THEN                            00003630
                      GO TO L999;                                       00003640
                   ELSE                                                 00003650
                      PROGRAM_ID = 'R0014001';                          00003660
                END;                                                    00003670
             ELSE                                                       00003680
                DO;                                                     00003690
                   EXEC CICS LINK PROGRAM('R0014401')COMMAREA(KOM_OMR); 00003700
                   IF FEIL_MELD_NR > 0  THEN                            00003710
                      GO TO L999;                                       00003720
                   ELSE                                                 00003730
                      PROGRAM_ID = 'R0014001';                          00003740
                                                                        00003750
                  IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'S' !              00003760
                     B02.PENSJONSTYPE2(BER_EK_IND) = 'S' !   /*HL*/     00003770
                     B02.PENSJONSTYPE2(BER_EK_IND) = 'P' !              00003780
 /*AFP*/             B02.PENSJONSTYPE2(BER_EK_IND) = 'N' THEN           00003790
                     DO;                                                00003800
                        W_TRANSTYPE = TRANS_OPPL_OMR.TRANSTYPE;         00003810
                        TRANS_OPPL_OMR.TRANSTYPE   = 0;                 00003820
                        TRANS_OPPL_OMR.FØDSNUMMER  =                    00003830
                                                B02.FNR(BER_EK_IND);    00003840
                        IF  SØKER_IND > 2 THEN                          00003850
                            DO;                                         00003860
                                H_BER_SØ_IND = BER_SØ_IND;              00003870
                                H_BER_EK_IND = BER_EK_IND;              00003880
                                BER_SØ_IND   = H_BER_EK_IND;            00003890
                                BER_EK_IND   = H_BER_SØ_IND;            00003900
                            END;                                        00003910
                        ELSE                                            00003920
                            DO;                                         00003930
                               BER_SØ_IND = EKTEF_IND;                  00003940
                               BER_EK_IND = SØKER_IND;                  00003950
                            END;                                        00003960
                                                                        00003970
                        IF B02.PENSJONSTYPE1(BER_SØ_IND) = 'A' THEN     00003980
                           DO;                                          00003990
                   IF B02.P67_KODE(BER_SØ_IND) ^= '5'      THEN         00004000
                              EXEC CICS LINK PROGRAM('R0014201')        00004010
                                                   COMMAREA(KOM_OMR);   00004020
                              IF FEIL_MELD_NR > 0  THEN                 00004030
                                 GO TO L999;                            00004040
                                 ELSE                                   00004050
                                    PROGRAM_ID = 'R0014001';            00004060
                           END;                                         00004070
                        ELSE                                            00004080
                        IF B02.PENSJONSTYPE1(BER_SØ_IND) = 'K' THEN     00004090
                           DO;                                          00004100
                              EXEC CICS LINK PROGRAM('R0014251')        00004110
                                                   COMMAREA(KOM_OMR);   00004120
                              IF FEIL_MELD_NR > 0  THEN                 00004130
                                 GO TO L999;                            00004140
                              ELSE                                      00004150
                                 PROGRAM_ID = 'R0014001';               00004160
                           END;                                         00004170
                        ELSE                                            00004180
                           DO;                                          00004190
                              EXEC CICS LINK PROGRAM('R0014401')        00004200
                                               COMMAREA(KOM_OMR);       00004210
                              IF FEIL_MELD_NR > 0  THEN                 00004220
                                 GO TO L999;                            00004230
                              ELSE                                      00004240
                                 PROGRAM_ID = 'R0014001';               00004250
                           END;                                         00004260
                        TRANS_OPPL_OMR.FØDSNUMMER =                     00004270
                                             B02.FNR(SØKER_IND);        00004280
                        TRANS_OPPL_OMR.TRANSTYPE  = W_TRANSTYPE;        00004290
                        BER_SØ_IND = SØKER_IND;                         00004300
                        BER_EK_IND = EKTEF_IND;                         00004310
                     END;                                               00004320
                END;                                                    00004330
          END;                                                          00004340
       WHEN('K')                                /*AFP HERFRA*/          00004350
          DO;                                                           00004360
             EXEC CICS LINK PROGRAM('R0014251') COMMAREA(KOM_OMR);      00004370
             IF FEIL_MELD_NR > 0  THEN                                  00004380
                GO TO L999;                                             00004390
             ELSE                                                       00004400
                PROGRAM_ID = 'R0014001';                                00004410
             IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'S' !                   00004420
  /*TS 300997*/       B02.PENSJONSTYPE2(BER_EK_IND) = 'S' !             00004430
                B02.PENSJONSTYPE2(BER_EK_IND) = 'P' !                   00004440
                B02.PENSJONSTYPE2(BER_EK_IND) = 'N' THEN                00004450
                DO;                                                     00004460
                   W_TRANSTYPE = TRANS_OPPL_OMR.TRANSTYPE;              00004470
                   TRANS_OPPL_OMR.TRANSTYPE   = 0;                      00004480
                   IF TRANS_OPPL_OMR.BLANKETTYPE = '24' !               00004490
                      TRANS_OPPL_OMR.BLANKETTYPE = '26' THEN            00004500
                      DO;                                               00004510
                         TRANS_OPPL_OMR.TRANSTYPE   =                   00004520
                            F_FELT_CHAR_PIC2                            00004530
                               (TRANS_OPPL_OMR.BLANKETTYPE);            00004540
                         TRANS_OPPL_OMR.BLANKETTYPE = '  ';             00004550
                      END;                                              00004560
                   TRANS_OPPL_OMR.FØDSNUMMER  =                         00004570
                                           B02.FNR(BER_EK_IND);         00004580
                   BER_SØ_IND  = EKTEF_IND;                             00004590
                   BER_EK_IND  = SØKER_IND;                             00004600
                   IF B02.PENSJONSTYPE1(BER_SØ_IND) ='A' THEN           00004610
                      DO;                                               00004620
                   IF B02.P67_KODE(BER_SØ_IND) ^= '5'      THEN         00004630
                         EXEC CICS LINK PROGRAM('R0014201')             00004640
                                             COMMAREA(KOM_OMR);         00004650
                         IF FEIL_MELD_NR > 0  THEN                      00004660
                            GO TO L999;                                 00004670
                         ELSE                                           00004680
                            PROGRAM_ID = 'R0014001';                    00004690
                      END;                                              00004700
                   ELSE                                                 00004710
                   IF B02.PENSJONSTYPE1(BER_SØ_IND) ='K' THEN           00004720
                      DO;                                               00004730
                         EXEC CICS LINK PROGRAM('R0014251')             00004740
                                             COMMAREA(KOM_OMR);         00004750
                         IF FEIL_MELD_NR > 0  THEN                      00004760
                            GO TO L999;                                 00004770
                         ELSE                                           00004780
                            PROGRAM_ID = 'R0014001';                    00004790
                      END;                                              00004800
                   ELSE                                                 00004810
                      DO;                                               00004820
                         EXEC CICS LINK PROGRAM('R0014401')             00004830
                                             COMMAREA(KOM_OMR);         00004840
                         IF FEIL_MELD_NR > 0  THEN                      00004850
                            GO TO L999;                                 00004860
                         ELSE                                           00004870
                            PROGRAM_ID = 'R0014001';                    00004880
                      END;                                              00004890
                   TRANS_OPPL_OMR.FØDSNUMMER =                          00004900
                                           B02.FNR(SØKER_IND);          00004910
                   TRANS_OPPL_OMR.TRANSTYPE  = W_TRANSTYPE;             00004920
                   BER_SØ_IND  = SØKER_IND;                             00004930
                   BER_EK_IND  = EKTEF_IND;                             00004940
                END;                                                    00004950
                                                                        00004960
          END;                                                          00004970
                                                                        00004980
 %PAGE;                                                                 00004990
         /* *************************************************** */      00005000
         /* HER KOMMER YRKESSKADEPENSJON                        */      00005010
         /* B02.PENSJONSTYPE1 =  'Y'.   ERIK 27.7.87.           */      00005020
         /* *************************************************** */      00005030
        WHEN('Y')                                                       00005040
           DO;                                                          00005050
              IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'E' THEN               00005060
                 DO;                                                    00005070
                    EXEC CICS LINK PROGRAM('R0014501')                  00005080
                                     COMMAREA(KOM_OMR);                 00005090
                    IF FEIL_MELD_NR > 0 THEN                            00005100
                       GO TO L999;                                      00005110
                    ELSE                                                00005120
                       PROGRAM_ID = 'R0014001';                         00005130
                 END;                                                   00005140
              ELSE                                                      00005150
                 DO;                                                    00005160
                    EXEC CICS LINK PROGRAM('R0014401')                  00005170
                                     COMMAREA(KOM_OMR);                 00005180
                    IF FEIL_MELD_NR > 0 THEN                            00005190
                       GO TO L999;                                      00005200
                    ELSE                                                00005210
                       PROGRAM_ID = 'R0014001';                         00005220
                                                                        00005230
                    IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'S' !            00005240
                       B02.PENSJONSTYPE2(BER_EK_IND) = 'P' !            00005250
                       B02.PENSJONSTYPE2(BER_EK_IND) = 'N' THEN         00005260
                       DO;                                              00005270
                          W_TRANSTYPE = TRANS_OPPL_OMR.TRANSTYPE;       00005280
                          TRANS_OPPL_OMR.TRANSTYPE = 0;                 00005290
                          TRANS_OPPL_OMR.FØDSNUMMER =                   00005300
                                            B02.FNR(BER_EK_IND);        00005310
                         IF  SØKER_IND > 2 THEN                         00005320
                            DO;                                         00005330
                                H_BER_SØ_IND = BER_SØ_IND;              00005340
                                H_BER_EK_IND = BER_EK_IND;              00005350
                                BER_SØ_IND   = H_BER_EK_IND;            00005360
                                BER_EK_IND   = H_BER_SØ_IND;            00005370
                            END;                                        00005380
                         ELSE                                           00005390
                             DO;                                        00005400
                                BER_SØ_IND = EKTEF_IND;                 00005410
                                BER_EK_IND = SØKER_IND;                 00005420
                             END;                                       00005430
                          IF B02.PENSJONSTYPE1(BER_SØ_IND)              00005440
                                                = 'A' THEN              00005450
                             DO;                                        00005460
                   IF B02.P67_KODE(BER_SØ_IND) ^= '5'      THEN         00005470
                                EXEC CICS LINK PROGRAM                  00005480
                                ('R0014201') COMMAREA(KOM_OMR);         00005490
                                IF FEIL_MELD_NR > 0 THEN                00005500
                                   GO TO L999;                          00005510
                                ELSE                                    00005520
                                   PROGRAM_ID = 'R0014001';             00005530
                             END;                                       00005540
                         ELSE                                           00005550
                         IF B02.PENSJONSTYPE1(BER_SØ_IND) ='K' THEN     00005560
                            DO;                                         00005570
                               EXEC CICS LINK PROGRAM('R0014251')       00005580
                                                   COMMAREA(KOM_OMR);   00005590
                               IF FEIL_MELD_NR > 0  THEN                00005600
                                  GO TO L999;                           00005610
                               ELSE                                     00005620
                                  PROGRAM_ID = 'R0014001';              00005630
                            END;                                        00005640
                          ELSE                                          00005650
                             DO;                                        00005660
                                EXEC CICS LINK PROGRAM                  00005670
                                ('R0014401') COMMAREA(KOM_OMR);         00005680
                                IF FEIL_MELD_NR > 0 THEN                00005690
                                   GO TO L999;                          00005700
                                ELSE                                    00005710
                                   PROGRAM_ID = 'R0014001';             00005720
                             END;                                       00005730
                          TRANS_OPPL_OMR.FØDSNUMMER =                   00005740
                                          B02.FNR(SØKER_IND);           00005750
                          TRANS_OPPL_OMR.TRANSTYPE = W_TRANSTYPE;       00005760
                          BER_SØ_IND = SØKER_IND;                       00005770
                          BER_EK_IND = EKTEF_IND;                       00005780
                       END;                                             00005790
                    END;                                                00005800
               END;                                                     00005810
                                                                        00005820
       WHEN('G')                                                        00005830
          DO;                                                           00005840
                PROGRAM_ID = 'R0014001';                                00005850
          END;                                                          00005860
                                                                        00005870
       WHEN('D')                                                        00005880
          DO;                                                           00005890
                PROGRAM_ID = 'R0014001';                                00005900
          END;                                                          00005910
         /* *************************************************** */      00005920
         /* YRKESSKADEPENSJON TIL HIT.                          */      00005930
         /* ERIK 27.7.87.                                       */      00005940
         /* *************************************************** */      00005950
                                                                        00005960
       OTHERWISE                                                        00005970
          DO;                                                           00005980
 L180:                                                                  00005990
             FEIL_VED_LABEL = '180';                                    00006000
             FEIL_MELD_NR   = 1802;                                     00006010
             GO TO L999;                                                00006020
          END;                                                          00006030
                                                                        00006040
    END;    /*SELECT*/                                                  00006050
                                                                        00006060
  IF SØKER_IND > 2 THEN                                                 00006070
     GO TO L999;                                                        00006080
                                                                        00006090
  CALL FORSØRG_SØKER;                                                   00006100
  CALL FORSØRG_EKTEF;                                                   00006110
                                                                        00006120
 /* DET ER LAGET NYTT HOVEDPROGRAM FOR EØS-BEREGNING : */               00006130
                                                                        00006140
 /*     CALL EØS_HOVEDRUTINE;      4020*/                               00006150
                                                                        00006160
    SELECT (B02.PENSJONSTYPE1(BER_SØ_IND));                             00006170
      WHEN ('U')                                                        00006180
         CALL UP_RUTINE_EØS;                                            00006190
      WHEN ('E')                                                        00006200
         CALL EP_RUTINE_EØS;                                            00006210
      OTHERWISE;                                                        00006220
    END; /*SELECT*/                                                     00006230
                                                                        00006240
     HL_TESTX = B02.BEREGN_FOLKETRYGD(SØKER_IND);                       00006250
                                                                        00006260
  UP_RUTINE_EØS: PROC;                                                  00006270
                                                                        00006280
  IF W_VIRK_DATO_ÅMD > 940000           &                               00006290
     B02.BEREGN_FOLKETRYGD(SØKER_IND) ^= ' '       THEN                 00006300
     DO;  /* EØS BEREGNING SØKER STARTER HER */                         00006310
        EXEC CICS LINK PROGRAM('R0014470') COMMAREA(KOM_OMR);           00006320
        IF FEIL_MELD_NR > 0  THEN                                       00006330
           GO TO L999;                                                  00006340
        ELSE                                                            00006350
           PROGRAM_ID = 'R0014001';                                     00006360
        IF B02.PRO_RATA_BEREGNING(SØKER_IND)  = 'J'   &                 00006370
           B02.PRO_RATA_BEREGNING(EKTEF_IND) ^= 'J'    THEN             00006380
           CALL FORSØRG_EKTEF;                                          00006390
        ELSE                                                            00006400
        IF B02.PRO_RATA_BEREGNING(EKTEF_IND)  = 'J'   &                 00006410
           B02.PRO_RATA_BEREGNING(SØKER_IND) ^= 'J'    THEN             00006420
           CALL FORSØRG_SØKER;                                          00006430
     END; /* EØS BEREGNING SØKER SLUTTER HER */                         00006440
                                                                        00006450
  IF W_VIRK_DATO_ÅMD > 940000           &                               00006460
     B02.BEREGN_FOLKETRYGD(EKTEF_IND) ^= ' '   THEN                     00006470
     DO;                                                                00006480
                         TRANS_OPPL_OMR.FØDSNUMMER  =                   00006490
                                                 B02.FNR(BER_EK_IND);   00006500
                         W_TRANSTYPE = TRANS_OPPL_OMR.TRANSTYPE;        00006510
                         TRANS_OPPL_OMR.TRANSTYPE   = 0;                00006520
        BER_SØ_IND = EKTEF_IND;                                         00006530
        BER_EK_IND = SØKER_IND;                                         00006540
        EXEC CICS LINK PROGRAM('R0014470') COMMAREA(KOM_OMR);           00006550
        IF FEIL_MELD_NR > 0  THEN                                       00006560
           GO TO L999;                                                  00006570
        ELSE                                                            00006580
           PROGRAM_ID = 'R0014001';                                     00006590
 /*     CALL EØS_HOVEDRUTINE;      4020*/                               00006600
        IF B02.PRO_RATA_BEREGNING(SØKER_IND)  = 'J'   &                 00006610
           B02.PRO_RATA_BEREGNING(EKTEF_IND) ^= 'J'    THEN             00006620
           CALL FORSØRG_EKTEF;                                          00006630
        ELSE                                                            00006640
        IF B02.PRO_RATA_BEREGNING(EKTEF_IND)  = 'J'   &                 00006650
           B02.PRO_RATA_BEREGNING(SØKER_IND) ^= 'J'    THEN             00006660
           CALL FORSØRG_SØKER;                                          00006670
                         TRANS_OPPL_OMR.FØDSNUMMER =                    00006680
                                                 B02.FNR(SØKER_IND);    00006690
                         TRANS_OPPL_OMR.TRANSTYPE  = W_TRANSTYPE;       00006700
        BER_SØ_IND = SØKER_IND;                                         00006710
        BER_EK_IND = EKTEF_IND;                                         00006720
     END;                                                               00006730
  IF (B02.BEREGN_FOLKETRYGD(SØKER_IND) ^= ' ' !                         00006740
      B02.BEREGN_FOLKETRYGD(EKTEF_IND) ^= ' ' ) &                       00006750
     (W_VIRK_DATO_ÅMD > 940000                ) THEN                    00006760
     CALL GARANTI_ST; /* 4010 GARANTERT SÆRTILLEGG FRA 0194 */          00006770
  END UP_RUTINE_EØS;                                                    00006780
                                                                        00006790
  EP_RUTINE_EØS: PROC;                                                  00006800
                                                                        00006810
  IF W_VIRK_DATO_ÅMD > 940000           &                               00006820
     B02.BEREGN_FOLKETRYGD(EKTEF_IND) ^= ' '       THEN                 00006830
                                                                        00006840
     DO;                                                                00006850
        EXEC CICS LINK PROGRAM('R0014370') COMMAREA(KOM_OMR);           00006860
        IF FEIL_MELD_NR > 0  THEN                                       00006870
           GO TO L999;                                                  00006880
        ELSE                                                            00006890
           PROGRAM_ID = 'R0014001';                                     00006900
     END;                                                               00006910
  END EP_RUTINE_EØS;                                                    00006920
                                                                        00006930
 FORSØRG_SØKER : PROC;                                                  00006940
                                                                        00006950
                                                                        00006960
  IF B02.SUM_YTELSE(BER_SØ_IND)   > 0 THEN                              00006970
   DO;                                                                  00006980
 /*  IF (B02.VIRK_DATO_ÅM(BER_SØ_IND) > 9400 &          */              00006990
     IF (W_VIRK_DATO_ÅMD > 940000         &            /*HL*/           00007000
         B02.PENSJONSTYPE2(BER_SØ_IND) = 'S')  !                        00007010
        (B02.PENSJONSTYPE2(BER_SØ_IND) = 'N' &    /* TRUDE 0897 */      00007020
         B02.PENSJONSTYPE2(BER_EK_IND) = 'P' &                          00007030
        (B02.SIVILSTAND   (BER_SØ_IND) = 'G' !                          00007040
         B02.SIVILSTAND   (BER_SØ_IND) = 'W' !                          00007050
         B02.SIVILSTAND   (BER_SØ_IND) = 'P'))   THEN                   00007060
       DO;                                                              00007070
            CALL GARANTI_ST;  /*R0014010 GARANTERT SÆRTILLEGG FRA 0194*/00007080
       END;                                                             00007090
                                                                        00007100
    IF B02.PENSJONSTYPE1(BER_SØ_IND)   = 'K' &                          00007110
       B02.PENSJONSTYPE2(3)            = 'N' THEN                       00007120
       B02.PENSJONSTYPE2(BER_SØ_IND)   = 'F';                           00007130
                                                                        00007140
    IF B02.FT_SKAL_BEREGNES(BER_SØ_IND)  = 'J'    !                     00007150
       B02.FT_SKAL_BEREGNES(BER_SØ_IND)  = 'N'    THEN                  00007160
       CALL FORSØRG(BER_SØ_IND);                                        00007170
                                                                        00007180
                                                                        00007190
      IF B02.PENSJONSTYPE1(BER_SØ_IND) = 'K'  &                         00007200
         B02.PENSJONSTYPE2(3)          = 'N'  THEN                      00007210
             B02.PENSJONSTYPE2(BER_SØ_IND) = 'N';                       00007220
   END;                                                                 00007230
  ELSE                                                                  00007240
    DO;                                                                 00007250
      B02.GARANTITILLEGG_BARN(BER_SØ_IND)  = 0;                         00007260
      B02.GARANTITILLEGG_EK(BER_SØ_IND)    = 0;                         00007270
      B02.GARANTITILLEGG_SÆRBARN(BER_SØ_IND)    = 0;                    00007280
      B02.BT_SÆRBARN(BER_SØ_IND)    = 0;             /*9806*/           00007290
    END;                                                                00007300
                                                                        00007310
 END FORSØRG_SØKER;                                                     00007320
                                                                        00007330
 FORSØRG_EKTEF : PROC;                                                  00007340
                                                                        00007350
  IF B02.SUM_YTELSE(BER_EK_IND)   > 0 THEN                              00007360
   DO;                                                                  00007370
    IF B02.PENSJONSTYPE1(BER_SØ_IND)   = 'K' &                          00007380
       B02.PENSJONSTYPE2(3)            = 'N' THEN                       00007390
       B02.PENSJONSTYPE2(BER_SØ_IND)   = 'F';                           00007400
                                                                        00007410
    IF B02.FT_SKAL_BEREGNES(BER_EK_IND)  = 'J'    !                     00007420
       B02.FT_SKAL_BEREGNES(BER_EK_IND)  = 'N'         THEN             00007430
       CALL FORSØRG(BER_EK_IND);                                        00007440
                                                                        00007450
                                                                        00007460
      IF B02.PENSJONSTYPE1(BER_SØ_IND) = 'K'  &                         00007470
         B02.PENSJONSTYPE2(3)          = 'N'  THEN                      00007480
             B02.PENSJONSTYPE2(BER_SØ_IND) = 'N';                       00007490
                                                                        00007500
   END;                                                                 00007510
  ELSE                                                                  00007520
    DO;                                                                 00007530
      B02.GARANTITILLEGG_BARN(BER_EK_IND)  = 0;                         00007540
      B02.GARANTITILLEGG_EK(BER_EK_IND)    = 0;                         00007550
      B02.GARANTITILLEGG_SÆRBARN(BER_EK_IND)    = 0;                    00007560
      B02.BT_SÆRBARN(BER_EK_IND)    = 0;             /*9806*/           00007570
    END;                                                                00007580
 END FORSØRG_EKTEF;                                                     00007590
                                                                        00007600
                                                                        00007610
 L999:                                                                  00007620
    EXEC CICS RETURN;                                                   00007630
 %INCLUDE R0014010;     /* GARANTERT SÆRTILLEGG 0194         */         00007640
 %INCLUDE R0014016;     /* JUSTER MED 40 PROSENT (NY 02.97)  */         00007650
 %INCLUDE R0014011;     /* FORSØRG   - REGNER INNTEKTSPRØVET */         00007660
 %INCLUDE R0019913;     /* F_SNU_DATO                        */         00007670
 %INCLUDE R0019905;     /* F_ALDER                           */         00007680
 %INCLUDE R0014015;     /* JUSTER_MED_FORVENTET              */         00007690
 %INCLUDE R0019912;     /* ENDRE CHAR->PIC / PIC->CHAR       */         00007700
  END R001400;                                                          00007710
