 /*       SIST ENDRET 05/09-94 10.10.40 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 01/12-89 08.58.19 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 29/03-88 13.17.15 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 24/03-87 12.08.15 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 27/08-85 10.10.39 AV   HERMAN                   */00000040
 /*       SIST ENDRET 21/08-85 08.13.05 AV   FARVIK                   */00000050
 /*       SIST ENDRET 15/02-85 15.04.06 AV   HERMAN                   */00000060
 /*       SIST ENDRET 28/03-84 14.58.32 AV   KARIN                    */00000070
 /*       SIST ENDRET 14/10-83 08.01.30 AV   OLAV                     */00000080
 /*       SIST ENDRET 11/10-83 11.12.37 AV   FARVIK                   */00000090
 /*       SIST ENDRET 12/09-83 09.12.05 AV   OLAV                     */00000100
 /*       SIST ENDRET 13/04-83 13.45.30 AV   FARVIK                   */00000110
 /*       SIST ENDRET 25/03-83 10.01.48 AV   OLAV                     */00000120
 /*       SIST ENDRET 05/01-88 10.01.48 AV   SATISH                   */00000130
 /****************************************************************** */ 00000140
 /*IDENTIFIKASJON:                                                   */ 00000150
 /*    R0011020 - PROSEDYRE I PLI                                    */ 00000160
 /*    PROGRAMMERER: GEIR, JANUAR 1982                               */ 00000170
 /*    KON_FB                                                        */ 00000180
 /*ENDRINGSDATO : 16/3-84                                            */ 00000190
 /*ENDRINGEN GJELDER: DET ER BEHOV FOR Å REGISTRERE FORELDRELØSE     */ 00000200
 /*                   BARN UTEN OPPLYSNINGER OM AVDØD MOR OG FAR     */ 00000210
 /*                   AVDØDES FNR SETTES DA LIK 11111111111 OG       */ 00000220
 /*                   ENDRINGEN VEDRøRER KONTROLLER MOT OPPLYSNINGER */ 00000230
 /*                   I REGISTERET.                                  */ 00000240
 /*ENDRINGEN BLE UTFØRT AV KARIN                                     */ 00000250
 /****************************************************************   */ 00000260
 /*HENSIKT:                                                          */ 00000270
 /*    KONTROLL AV TRANSAKSJON På FORELDRELØSE BARN                  */ 00000280
 /*    RUTINEN KONTROLLERER ALLE PERSONER I TRANSAKSJONEN MOT        */ 00000290
 /*    INFORMASJON I REGISTERET.                                     */ 00000300
 /*    NÅR DET OPPDAGES UOVERENSSTEMMELSER, BLIR FEIL-MELD-NR SATT   */ 00000310
 /*    OG VI GÅR UT AV PGR.FOR HVER PERSON SOM GÅR FEILFRI GJENNOM   */ 00000320
 /*    KONTROLLENE BLIR DET OPPRETTET NY STATUS FOR PERSONEN OG      */ 00000330
 /*    SØKERENS STATUS OPPDATERES. TRANSTYPE SETTES I TRANSAKSJONEN. */ 00000340
 /*    DETTE FORUTSETTER AT DØDSMELDINGEN FOR AVDØDE ER BEHANDLET PÅ */ 00000350
 /*    FORHÅND OG AT BARNA ER SORTERT ETTER FNR. DETTE ER FORDI VI MÅ*/ 00000360
 /*    KONTROLLERE OM BARNET ER TILKNYTTET SAMME YNGSTE BARN SOM OGSÅ*/ 00000370
 /*    ER TILKNYTTET SAMME AVDØDE (SOM ER I TRANSEN). DETTE KAN VI   */ 00000380
 /*    IKKE GJØRE HVIS IKKE YNGSTE BARN ALT ER LEST INN. YNGSTE BARN */ 00000390
 /*    I TRANSEN BEHANDLES FØRST.                                    */ 00000400
 /*PROGRAMTILKNYTNING:                                               */ 00000410
 /*    KALLES OPP FRA PROGRAM R0013520.                              */ 00000420
 /*BRUK:                                                             */ 00000430
 /*    EXEC CICS XCTL PROGRAM ('R0011020') COMMAREA (KOM_OMR)        */ 00000440
 /*                                                                  */ 00000450
 /* ***************************************************************  */ 00000460
 %SKIP;                                                                 00000470
 KON_FB:                                                                00000480
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000490
 %SKIP;                                                                 00000500
      %INCLUDE P0019908;  /* KOM_OMR  BASED(COMMAREA_PEKER)          */ 00000510
      %INCLUDE P0019906;  /* TRANS_OPPL_OMR  BASED(TRANS_OPPL_PEKER) */ 00000520
      %INCLUDE P0011001;                                                00000530
      %INCLUDE P0019910;  /* STYRINGS_OMR  BASED(STYRINGS_PEKER)     */ 00000540
      %INCLUDE P0019912;  /* DIV_PARAM_OMR  BASED(DIV_PARAM_PEKER)   */ 00000550
      DCL 1 B01 BASED(B01_PEKER),%INCLUDE P0019921;                     00000560
      DCL 1 B02 BASED(B02_PEKER),%INCLUDE P0019921;                     00000570
   DCL                                                                  00000580
      COMMAREA_PEKER PTR;                                               00000590
 %PAGE;                                                                 00000600
   DCL                                                                  00000610
       BARN_IND                          FIXED BIN (15),                00000620
       FORRIGE_YNG_BARN_IND              FIXED BIN (15),                00000630
       AVDØD_MOR_IND                     FIXED BIN (15),                00000640
       AVDØD_FAR_IND                     FIXED BIN (15),                00000650
 /*YS*/YRKE_IND                          FIXED BIN (15),                00000660
       W_STATUS_TYPE                     CHAR       (1),                00000670
       YNG_BARN_LEST                     CHAR       (1),                00000680
       BARN_ANTALL                       DEC FIXED (3),                 00000690
       I                                 FIXED BIN (15),                00000700
       J                                 FIXED BIN (15),                00000710
       HJ_VIRK_DATO_ÅM                   PIC     '(4)9',                00000720
       HJ_DØDSDATO_ÅM_MOR                FIXED BIN (5),                 00000730
       HJ_DØDSDATO_ÅM_FAR                FIXED BIN (5),                 00000740
       HJF                               CHAR       (1),                00000750
       ANT_BARN_I_TRANS                  DEC FIXED (3);                 00000760
 %SKIP;                                /*   */                          00000770
                                                                        00000780
 /* ********************************************************** */       00000790
 /* PROGRAMMET BEGYNNER HER.                                   */       00000800
 /* ********************************************************** */       00000810
                                                                        00000820
 %SKIP;                                                                 00000830
      PROGRAM_ID           = 'R0011020';                                00000840
      TRANSTYPE            = 05;                                        00000850
      YNG_BARN_LEST        = 'N';                                       00000860
      I                    = 0;                                         00000870
      AVDØD_MOR_IND        = 1;                                         00000880
      AVDØD_FAR_IND        = 2;                                         00000890
      ANT_BARN_I_TRANS     = 0;                                         00000900
      BARN_ANTALL          = 0;                                         00000910
      BARN_IND             = 0;                                         00000920
      W_STATUS_TYPE        = STATUS_TYPE;                               00000930
      FORRIGE_YNG_BARN_IND = 0;                                         00000940
      HJ_VIRK_DATO_ÅM = F_SNU_DATO (BARN_GEN.VIRK_DATO_MÅ); /* 9913 */  00000950
 %SKIP;                                                                 00000960
 /* ***************************************************************** */00000970
 /* DERSOM AVDØD MOR ER OPPGITT PÅ BLANKETTEN -                       */00000980
 /* MOR.FNR_M ^= 11111111111                                          */00000990
 /* ***************************************************************** */00001000
                                                                        00001010
  IF MOR.FNR_M ^= (11)'1' THEN                                          00001020
     DO;                                                                00001030
                                                                        00001040
 /* ***************************************************************** */00001050
 /* DERSOM AVDØD MOR IKKE ER I BASEN.                                 */00001060
 /* ***************************************************************** */00001070
                                                                        00001080
        IF B01.FNR(AVDØD_MOR_IND) = 0 THEN                              00001090
           DO;                                                          00001100
              DØD = '1'B;                                               00001110
              SEARCH_FNR  = MOR.FNR_M;                                  00001120
              POS_I_B01   = AVDØD_MOR_IND;                              00001130
              EXEC CICS LINK PROGRAM ('R0019928') COMMAREA (KOM_OMR);   00001140
                                      /* OPPRETT_STATUS_FOR_PERSON */   00001150
              IF FEIL_MELD_NR > 0 THEN                                  00001160
                 GO  TO L999;                                           00001170
              ELSE                                                      00001180
                 PROGRAM_ID = 'R0011020';                               00001190
              DØD = '0'B;                                               00001200
           END;                                                         00001210
        ELSE                                                            00001220
           IF B01.FNR(AVDØD_MOR_IND) ^= MOR.FNR_M THEN                  00001230
              DO;                                                       00001240
  L100:                                                                 00001250
                 FEIL_VED_LABEL = '100';                                00001260
                 FEIL_MELD_NR   = 1307;                                 00001270
                 GO TO L999;                                            00001280
              END;                                                      00001290
     END;     /* AVDØD MOR ^= 11111111111 */                            00001300
                                                                        00001310
 /* ***************************************************************** */00001320
 /* DERSOM AVDØD FAR ER OPPGITT PÅ BLANKETTEN -                       */00001330
 /* FAR.FNR_F ^= 11111111111                                          */00001340
 /* ***************************************************************** */00001350
                                                                        00001360
  IF FAR.FNR_F ^= (11)'1' THEN                                          00001370
     DO;                                                                00001380
 /* ***************************************************************** */00001390
 /* DERSOM AVDØD FAR IKKE ER I BASEN.                                 */00001400
 /* ***************************************************************** */00001410
                                                                        00001420
        IF B01.FNR(AVDØD_FAR_IND) = 0 THEN                              00001430
           DO;                                                          00001440
              DØD = '1'B;                                               00001450
              SEARCH_FNR  = FAR.FNR_F;                                  00001460
              POS_I_B01   = AVDØD_FAR_IND;                              00001470
              EXEC CICS LINK PROGRAM ('R0019928') COMMAREA (KOM_OMR);   00001480
                                     /* OPPRETT_STATUS_FOR_PERSON    */ 00001490
              IF FEIL_MELD_NR > 0 THEN                                  00001500
                 GO  TO L999;                                           00001510
              ELSE                                                      00001520
                 PROGRAM_ID = 'R0011020';                               00001530
              DØD = '0'B;                                               00001540
           END;                                                         00001550
        ELSE                                                            00001560
           IF B01.FNR(AVDØD_FAR_IND) ^= FAR.FNR_F THEN                  00001570
              DO;                                                       00001580
  L110:                                                                 00001590
     EXEC CICS ENTER TRACEID(01) FROM (FAR.FNR_F);                      00001600
     EXEC CICS ENTER TRACEID(02) FROM (B01.FNR(AVDØD_FAR_IND));         00001610
                                                                        00001620
                 FEIL_VED_LABEL = '110';                                00001630
                 FEIL_MELD_NR   = 1307;                                 00001640
                 GO TO L999;                                            00001650
              END;                                                      00001660
     END;                                                               00001670
                                                                        00001680
 /* ***************************************************************** */00001690
 /* DERSOM IKKE REGISTRERT SOM DØD.                                   */00001700
 /* ***************************************************************** */00001710
                                                                        00001720
      IF B01.DØDSDATO_ÅMD(AVDØD_MOR_IND) = 0 &                          00001730
         B01.FNR(AVDØD_MOR_IND) > 0 THEN                                00001740
         DO;                                                            00001750
  L120:                                                                 00001760
            FEIL_VED_LABEL = '120';                                     00001770
            FEIL_MELD_NR   = 1710;                                      00001780
            GO TO L999;                                                 00001790
         END;                                                           00001800
      IF B01.DØDSDATO_ÅMD(AVDØD_FAR_IND) = 0 &                          00001810
         B01.FNR(AVDØD_FAR_IND) > 0 THEN                                00001820
         DO;                                                            00001830
  L130:                                                                 00001840
            FEIL_VED_LABEL = '130';                                     00001850
            FEIL_MELD_NR   = 1710;                                      00001860
            GO TO L999;                                                 00001870
         END;                                                           00001880
                                                                        00001890
      HJ_DØDSDATO_ÅM_MOR  = B01.DØDSDATO_ÅMD(AVDØD_MOR_IND) / 100;      00001900
      HJ_DØDSDATO_ÅM_FAR  = B01.DØDSDATO_ÅMD(AVDØD_FAR_IND) / 100;      00001910
      STATUS_TYPE = W_STATUS_TYPE;                                      00001920
 /* ***************************************************************** */00001930
 /* SØKER HAR IKKE PENSJONSSTATUS.                                    */00001940
 /* ***************************************************************** */00001950
                                                                        00001960
                                                                        00001970
      IF STATUS_TYPE = 'A' !                                            00001980
         STATUS_TYPE = 'C' !                                            00001990
         STATUS_TYPE = 'I' !          /* TILLEGGSTEST På 'I' OG 'K'   */00002000
         STATUS_TYPE = 'K' THEN       /* 14.2.85  HL                  */00002010
         DO;                                                            00002020
                                                                        00002030
 /* ***************************************************************** */00002040
 /* DERSOM SØKER ER I BASEN.                                          */00002050
 /* ***************************************************************** */00002060
                                                                        00002070
            IF B01.FNR(SØKER_IND) >  0 THEN                             00002080
               DO;                                                      00002090
                  CALL FLYTT_B01_TIL_B02(SØKER_IND);     /* 9926 */     00002100
                  IF FEIL_MELD_NR > 0 THEN                              00002110
                     GO TO L999;                                        00002120
                  ELSE                                                  00002130
                     PROGRAM_ID = 'R0011020';                           00002140
                  B02.NAVN  (SØKER_IND) = BARN.NAVN_B(1);               00002150
                  B02.TKNR  (SØKER_IND) = BARN.TKNR(1);                 00002160
                  B02.SPRÅK (SØKER_IND) = BARN_GEN.SPRÅK;               00002170
               END;                                                     00002180
                                                                        00002190
 /* ***************************************************************** */00002200
 /* SØKER ER IKKE I BASEN.                                            */00002210
 /* ***************************************************************** */00002220
                                                                        00002230
            ELSE                                                        00002240
               DO;                                                      00002250
                  B02.FNR   (SØKER_IND) = BARN.FNR_B(1);                00002260
                  B02.NAVN  (SØKER_IND) = BARN.NAVN_B(1);               00002270
                  B02.TKNR  (SØKER_IND) = BARN.TKNR(1);                 00002280
                  B02.SPRÅK (SØKER_IND) = BARN_GEN.SPRÅK;               00002290
               END;                                                     00002300
            B02.PERSON(AVDØD_MOR_IND) = B01.PERSON(AVDØD_MOR_IND);      00002310
            B02.PERSON(AVDØD_FAR_IND) = B01.PERSON(AVDØD_FAR_IND);      00002320
                                                                        00002330
            CALL OPPRETT_STATUS_FB_BARN(SØKER_IND);   /* 1021 */        00002340
                                                                        00002350
 /*YS*/     IF FEIL_MELD_NR > 0 THEN                                    00002360
 /*YS*/        GO TO L999;                                              00002370
                                                                        00002380
            IF MOR.FNR_M ^= (11)'1' THEN                                00002390
                                                                        00002400
               /* AVDØDES MOR-FNR ER OPPGITT I TRANSEN */               00002410
                                                                        00002420
               CALL                                                     00002430
               KOBLE_TO_PERSONER(SØKER_IND,AVDØD_MOR_IND);  /* 9924 */  00002440
            IF FAR.FNR_F ^= (11)'1' THEN                                00002450
                                                                        00002460
               /* AVDØDES FAR-FNR ER OPPGITT I TRANSEN */               00002470
                                                                        00002480
               CALL                                                     00002490
               KOBLE_TO_PERSONER(SØKER_IND,AVDØD_FAR_IND);  /* 9924 */  00002500
                                                                        00002510
         END;  /* STATUS-TYPE = A,C,I ELLER K  */                       00002520
      ELSE                                                              00002530
         DO;                                                            00002540
                                                                        00002550
 /* ***************************************************************** */00002560
 /* SØKER HAR PENSJONSSTATUS.                                         */00002570
 /* ***************************************************************** */00002580
                                                                        00002590
            IF B01.TKNR(SØKER_IND) > 0 THEN                             00002600
               IF B01.TKNR(SØKER_IND) ^= BARN.TKNR(1) THEN              00002610
                  DO;                                                   00002620
  L140:                                                                 00002630
                     FEIL_VED_LABEL = '140';                            00002640
                     FEIL_MELD_NR   = 1702;                             00002650
                     GO TO L999;                                        00002660
                  END;                                                  00002670
                                                                        00002680
 /* ***************************************************************** */00002690
 /* DERSOM SØKER HAR UFØREPENSJON.                                    */00002700
 /* ***************************************************************** */00002710
                                                                        00002720
             IF B01.PENSJONSTYPE1(SØKER_IND) = 'U' THEN                 00002730
                DO;                                                     00002740
                                                                        00002750
 /* ***************************************************************** */00002760
 /* DERSOM SØKER ER UGIFT.                                            */00002770
 /* ***************************************************************** */00002780
                                                                        00002790
                   IF B01.SIVILSTAND(SØKER_IND) = 'U' THEN              00002800
                      DO;                                               00002810
                                                                        00002820
                         CALL                                           00002830
                             FLYTT_B01_TIL_B02(SØKER_IND);  /* 9926 */  00002840
                                                                        00002850
                         IF FEIL_MELD_NR > 0 THEN                       00002860
                            GO TO L999;                                 00002870
                         ELSE                                           00002880
                            PROGRAM_ID = 'R0011020';                    00002890
                                                                        00002900
                         B02.PERSON(AVDØD_MOR_IND) =                    00002910
                                        B01.PERSON(AVDØD_MOR_IND);      00002920
                         B02.PERSON(AVDØD_FAR_IND) =                    00002930
                                        B01.PERSON(AVDØD_FAR_IND);      00002940
                         B02.PENSJONSTYPE3(SØKER_IND) = 'U';            00002950
                                                                        00002960
                         IF MOR.FNR_M ^= (11)'1' THEN                   00002970
                             CALL                                       00002980
                             KOBLE_TO_PERSONER(                         00002990
                                       SØKER_IND, AVDØD_MOR_IND);       00003000
                             /* 9924 */                                 00003010
                                                                        00003020
                         IF FAR.FNR_F ^= (11)'1' THEN                   00003030
                             CALL                                       00003040
                             KOBLE_TO_PERSONER(                         00003050
                                       SØKER_IND, AVDØD_FAR_IND);       00003060
                             /* 9924 */                                 00003070
                      END;                                              00003080
                                                                        00003090
 /* ***************************************************************** */00003100
 /* ELLERS ER SØKER GIFT, SKILT, ETTERLATT.                           */00003110
 /* ***************************************************************** */00003120
                                                                        00003130
                   ELSE                                                 00003140
                      DO;                                               00003150
  L150:                                                                 00003160
                         FEIL_VED_LABEL = '150';                        00003170
                         FEIL_MELD_NR   = 1301;                         00003180
                         GO TO L999;                                    00003190
                      END;                                              00003200
                END;                                                    00003210
             ELSE                                                       00003220
                IF B01.PENSJONSTYPE1(SØKER_IND) = 'N' THEN              00003230
                   DO;                                                  00003240
                                                                        00003250
 /* ***************************************************************** */00003260
 /* DERSOM SØKER ER YNGSTE BARN.                                      */00003270
 /* ***************************************************************** */00003280
                                                                        00003290
 /*    ENDRET 05.01-88 AV SATISH                                      */00003300
                                                                        00003310
 /*                   IF B01.PENSJONSTYPE2(SØKER_IND) = 'Y' THEN      */00003320
 /*    HIT    05.01-88  ------                                        */00003330
                                                                        00003340
                      IF B01.PENSJONSTYPE2(SØKER_IND) = 'P'  THEN       00003350
                         DO;                                            00003360
                            YNG_BARN_LEST = 'J';                        00003370
                            B02.PERSON(AVDØD_MOR_IND) =                 00003380
                                        B01.PERSON(AVDØD_MOR_IND);      00003390
                            B02.PERSON(AVDØD_FAR_IND) =                 00003400
                                        B01.PERSON(AVDØD_FAR_IND);      00003410
                                                                        00003420
                            CALL                                        00003430
                                FLYTT_B01_TIL_B02(SØKER_IND); /* 9926*/ 00003440
                            IF FEIL_MELD_NR > 0 THEN                    00003450
                               GO TO L999;                              00003460
                            ELSE                                        00003470
                               PROGRAM_ID = 'R0011020';                 00003480
                                                                        00003490
 /* ***************************************************************** */00003500
 /* DERSOM SØKER ER TILKNYTTET AVDØD MOR.                             */00003510
 /* ***************************************************************** */00003520
                                                                        00003530
                            DO I = 1 TO 13 WHILE (                      00003540
                                     B01.FNR_TILKN(SØKER_IND,I) > 0);   00003550
                              IF B01.FNR_TILKN(SØKER_IND,I) =           00003560
                                 B01.FNR(AVDØD_MOR_IND)           THEN  00003570
                                 CALL                                   00003580
                                     KOBLE_TO_PERSONER(                 00003590
                                            SØKER_IND, AVDØD_FAR_IND);  00003600
                                     /* 9924 */                         00003610
                                                                        00003620
 /* ***************************************************************** */00003630
 /* ELLERS TILKNYTTET AVDØD FAR.                                      */00003640
 /* ***************************************************************** */00003650
                                                                        00003660
                              ELSE                                      00003670
                                 CALL                                   00003680
                                     KOBLE_TO_PERSONER(                 00003690
                                             SØKER_IND, AVDØD_MOR_IND); 00003700
                                     /* 9924 */                         00003710
                            END;                                        00003720
                         END;                                           00003730
                                                                        00003740
 /* ***************************************************************** */00003750
 /* IKKE YNGSTE BARN.                                                 */00003760
 /* ***************************************************************** */00003770
                                                                        00003780
                     ELSE                                               00003790
                         DO;                                            00003800
  L160:                                                                 00003810
                            FEIL_VED_LABEL = '160';                     00003820
                            FEIL_MELD_NR   = 1303;                      00003830
                            GO TO L999;                                 00003840
                         END;                                           00003850
                   END;                                                 00003860
                ELSE                                                    00003870
                   IF B01.PENSJONSTYPE1(SØKER_IND) = 'B' THEN           00003880
                      DO;                                               00003890
                                                                        00003900
 /* **************************************************************** */ 00003910
 /* DERSOM SØKER ER YNGSTE BARN.                                     */ 00003920
 /* **************************************************************** */ 00003930
                                                                        00003940
 /*    ENDRET 05.01-88 AV SATISH                                      */00003950
                                                                        00003960
 /*                      IF B01.PENSJONSTYPE2(SØKER_IND) = 'Y'        */00003970
 /*    HIT    05.01-88  ------                                        */00003980
                         IF B01.PENSJONSTYPE2(SØKER_IND) = 'P'  THEN    00003990
                            DO;                                         00004000
                               YNG_BARN_LEST = 'J';                     00004010
                               B02.PERSON(AVDØD_MOR_IND) =              00004020
                                        B01.PERSON(AVDØD_MOR_IND);      00004030
                               B02.PERSON(AVDØD_FAR_IND) =              00004040
                                        B01.PERSON(AVDØD_FAR_IND);      00004050
                                                                        00004060
                               CALL                                     00004070
                                   FLYTT_B01_TIL_B02(SØKER_IND);        00004080
                                   /* 9926 */                           00004090
                                                                        00004100
                               IF FEIL_MELD_NR > 0 THEN                 00004110
                                  GO TO L999;                           00004120
                               ELSE                                     00004130
                                  PROGRAM_ID = 'R0011020';              00004140
                            END;                                        00004150
                                                                        00004160
 /* **************************************************************** */ 00004170
 /* IKKE YNGSTE BARN.                                                */ 00004180
 /* **************************************************************** */ 00004190
                                                                        00004200
                         ELSE                                           00004210
                            DO;                                         00004220
  L170:                                                                 00004230
                               FEIL_VED_LABEL = '170';                  00004240
                               FEIL_MELD_NR   = 1303;                   00004250
                               GO TO L999;                              00004260
                            END;                                        00004270
                      END;                                              00004280
                                                                        00004290
 /* **************************************************************** */ 00004300
 /* ELLERS FORSØRGET BARN.                                           */ 00004310
 /* **************************************************************** */ 00004320
                                                                        00004330
                   ELSE                                                 00004340
                      IF B01.PENSJONSTYPE1(SØKER_IND) = 'L' THEN        00004350
                         DO;                                            00004360
  L180:                                                                 00004370
                            FEIL_VED_LABEL = '180';                     00004380
                            FEIL_MELD_NR   = 1203;                      00004390
                            GO TO L999;                                 00004400
                         END;                                           00004410
                                                                        00004420
 /* **************************************************************** */ 00004430
 /* PENSJONSTYPE1 = NOE ANNET.                                       */ 00004440
 /* **************************************************************** */ 00004450
                                                                        00004460
                      ELSE                                              00004470
                         DO;                                            00004480
                                                                        00004490
 /* **************************************************************** */ 00004500
 /* DERSOM FORSØRGET EKTEFELLE.                                      */ 00004510
 /* **************************************************************** */ 00004520
                                                                        00004530
                            IF B01.SIVILSTAND(SØKER_IND) = 'G'          00004540
                                                              THEN      00004550
                               DO;                                      00004560
  L190:                                                                 00004570
                                  FEIL_VED_LABEL = '190';               00004580
                                  FEIL_MELD_NR   = 1206;                00004590
                                  GO TO L999;                           00004600
                               END;                                     00004610
                            ELSE                                        00004620
                               DO;                                      00004630
  L200:                                                                 00004640
                                  FEIL_VED_LABEL = '200';               00004650
                                  FEIL_MELD_NR   = 1301;                00004660
                                  GO TO L999;                           00004670
                               END;                                     00004680
                         END;                                           00004690
            BARN_IND = 3;                                               00004700
                                                                        00004710
            CALL                                                        00004720
                AJOURFØR_B02_MED_FB_TRANS(1);            /* 1022 */     00004730
                                                                        00004740
 /*YS*/     IF FEIL_MELD_NR > 0 THEN                                    00004750
 /*YS*/        GO TO L999;                                              00004760
         END;                                                           00004770
                                                                        00004780
 /* **************************************************************** */ 00004790
 /* BARNEDELEN.                                                      */ 00004800
 /* **************************************************************** */ 00004810
 /* NÅ HAR VI AVDØDE OG YNGSTE BARN MED EVENTUELLE TILKNYTTEDE BARN */  00004820
 /* PÅ PLASS OG KOBLET I B02                                        */  00004830
 /* *************************************************************** */  00004840
                                                                        00004850
 DO I = 2 TO 12 WHILE(BARN.FNR_B(I) > 0);                               00004860
    BARN_IND = 0;                                                       00004870
    DO J = 4 TO 14 WHILE (B02.FNR(J) > 0);                              00004880
       IF BARN.FNR_B(I) = B02.FNR(J) THEN                               00004890
          DO;                                                           00004900
             BARN_IND = J;                                              00004910
             J        = 14;                                             00004920
          END;                                                          00004930
    END;                                                                00004940
 %PAGE;                                /* */                            00004950
                                                                        00004960
 /* ***************************************************************** */00004970
 /* BARNET ER IKKE I B01, IKKE TILKNYTTET YNGSTE BARN I TRANSEN.      */00004980
 /* ***************************************************************** */00004990
                                                                        00005000
    IF BARN_IND = 0 THEN                                                00005010
       DO;                                                              00005020
          BARN_IND        = J;                                          00005030
          SEARCH_FNR      = BARN.FNR_B(I);                              00005040
          POS_I_B01       = BARN_IND;                                   00005050
          EXEC CICS LINK PROGRAM ('R0019928') COMMAREA (KOM_OMR);       00005060
                                 /* OPPRETT_STATUS_FOR_PERSON */        00005070
                                                                        00005080
          IF FEIL_MELD_NR > 0 THEN                                      00005090
             GO  TO L999;                                               00005100
          ELSE                                                          00005110
             PROGRAM_ID = 'R0011020';                                   00005120
                                                                        00005130
 /* *************************************************************** */  00005140
 /* DERSOM BARNET IKKE HAR PENSJONSSTATUS.                          */  00005150
 /* *************************************************************** */  00005160
          IF STATUS_TYPE = 'A' !                                        00005170
             STATUS_TYPE = 'C' !                                        00005180
             STATUS_TYPE = 'I' !      /* TILLEGGSTEST På 'I' OG 'K' */  00005190
             STATUS_TYPE = 'K' THEN   /* 14.2.85  HL                */  00005200
             DO;                                                        00005210
                                                                        00005220
 /* *************************************************************** */  00005230
 /* DERSOM BARNET ER I BASEN.                                       */  00005240
 /* *************************************************************** */  00005250
                                                                        00005260
                IF B01.FNR(BARN_IND) > 0           THEN                 00005270
                   DO;                                                  00005280
                                                                        00005290
                      CALL FLYTT_B01_TIL_B02(BARN_IND);  /* 9926 */     00005300
                                                                        00005310
                      IF FEIL_MELD_NR > 0 THEN                          00005320
                         GO TO L999;                                    00005330
                      ELSE                                              00005340
                         PROGRAM_ID = 'R0011020';                       00005350
                      IF B02.NAVN (BARN_IND) = (25) ' ' THEN            00005360
                         B02.NAVN (BARN_IND) = BARN.NAVN_B(I);          00005370
                   END;                                                 00005380
                ELSE                                                    00005390
                                                                        00005400
 /* ***************************************************************** */00005410
 /* BARNET ER IKKE I BASEN                                            */00005420
 /* ***************************************************************** */00005430
                                                                        00005440
                   DO;                                                  00005450
                      B02.FNR   (BARN_IND) = BARN.FNR_B(I);             00005460
                      B02.NAVN  (BARN_IND) = BARN.NAVN_B(I);            00005470
                      B02.TKNR  (BARN_IND) = BARN.TKNR(I);              00005480
                      B02.SPRÅK (BARN_IND) = BARN_GEN.SPRÅK;            00005490
                   END;                                                 00005500
                                                                        00005510
                CALL OPPRETT_STATUS_FB_BARN(BARN_IND);      /* 1021 */  00005520
                                                                        00005530
 /*YS*/         IF FEIL_MELD_NR > 0 THEN                                00005540
 /*YS*/            GO TO L999;                                          00005550
                                                                        00005560
                CALL KOBLE_TO_PERSONER(SØKER_IND,BARN_IND); /* 9924 */  00005570
                                                                        00005580
             END;                                                       00005590
          ELSE                                                          00005600
             DO;                                                        00005610
                IF B01.TKNR(BARN_IND) ^=                                00005620
                                           BARN.TKNR(I) THEN            00005630
                   DO;                                                  00005640
  L210:                                                                 00005650
                      FEIL_VED_LABEL = '210';                           00005660
                      FEIL_MELD_NR   = 1702;                            00005670
                      GO TO L999;                                       00005680
                   END;                                                 00005690
                ELSE                                                    00005700
                   IF STATUS_TYPE ^= 'F' &                              00005710
                      STATUS_TYPE ^= 'H'       THEN                     00005720
                      DO;                                               00005730
                                                                        00005740
                         IF B01.PENSJONSTYPE1(BARN_IND) = 'U' THEN      00005750
                            DO;                                         00005760
                               IF B01.SIVILSTAND(BARN_IND) = 'U' THEN   00005770
                                  DO;                                   00005780
                                                                        00005790
                                     CALL                               00005800
                                         FLYTT_B01_TIL_B02(BARN_IND);   00005810
                                         /* 9926 */                     00005820
                                                                        00005830
                                     IF FEIL_MELD_NR > 0 THEN           00005840
                                        GO TO L999;                     00005850
                                     ELSE                               00005860
                                        PROGRAM_ID = 'R0011020';        00005870
                                                                        00005880
                                     CALL                               00005890
                                         KOBLE_TO_PERSONER(             00005900
                                                    SØKER_IND,BARN_IND);00005910
                                         /* 9924 */                     00005920
                                                                        00005930
                                  END;                                  00005940
                               ELSE                                     00005950
                                  DO;                                   00005960
  L220:                                                                 00005970
                                     FEIL_VED_LABEL = '220';            00005980
                                     FEIL_MELD_NR   = 1301;             00005990
                                     GO TO L999;                        00006000
                                  END;                                  00006010
                            END;                                        00006020
                         ELSE                                           00006030
                            IF B01.PENSJONSTYPE1(BARN_IND) = 'N' !      00006040
                               B01.PENSJONSTYPE1(BARN_IND) = 'B' THEN   00006050
                               DO;                                      00006060
                                                                        00006070
 /* ***************************************************************** */00006080
 /* NÅ SUMMERER VI ANTALL BARN I SAMME BARNEKULL FOR Å VÆRE SIKKER PÅ */00006090
 /* AT DET ER INGEN IGJEN I REGISTERET. BARNA ER SORTERT PÅ FORHÅND   */00006100
 /* SLIK AT VI ALLTID LESER YNGSTE BARN FØRST.                        */00006110
 /* ***************************************************************** */00006120
                                                                        00006130
                                                                        00006140
 /*    ENDRET 05.01-88 AV SATISH                                      */00006150
                                                                        00006160
 /*                               IF B01.PENSJONSTYPE2(               */00006170
 /*                                             BARN_IND) = 'Y' THEN  */00006180
 /*    HIT    05.01-88  ------                                        */00006190
                                IF B01.PENSJONSTYPE2(BARN_IND) = 'P'    00006200
                                                 THEN                   00006210
                                     DO;                                00006220
                                        IF YNG_BARN_LEST = 'J' THEN     00006230
                                           DO;                          00006240
  L230:                                                                 00006250
                                              FEIL_VED_LABEL = '230';   00006260
                                              FEIL_MELD_NR   = 1309;    00006270
                                              GO TO L999;               00006280
                                           END;                         00006290
                                       CALL                             00006300
                                           FLYTT_B01_TIL_B02(BARN_IND); 00006310
                                           /* 9926 */                   00006320
                                                                        00006330
                                       IF FEIL_MELD_NR > 0 THEN         00006340
                                          GO TO L999;                   00006350
                                       ELSE                             00006360
                                          PROGRAM_ID = 'R0011020';      00006370
                                                                        00006380
                                       CALL                             00006390
                                           KOBLE_TO_PERSONER(           00006400
                                                    SØKER_IND,BARN_IND);00006410
                                           /* 9924 */                   00006420
                                                                        00006430
                                       FORRIGE_YNG_BARN_IND =           00006440
                                                            BARN_IND;   00006450
                                       YNG_BARN_LEST = 'J';             00006460
                                    END;                                00006470
                                 ELSE                                   00006480
                                                                        00006490
 /* ***************************************************************** */00006500
 /* DERSOM TILKNYTTET FORRIGE YNGSTE BARN OG PENSJONSTYPE2 = Ø.       */00006510
 /* ***************************************************************** */00006520
                                                                        00006530
                                    IF B01.PENSJONSTYPE2(               00006540
                                                  BARN_IND) = 'Ø' THEN  00006550
                                       DO;                              00006560
                                                                        00006570
                                          CALL                          00006580
                                              FLYTT_B01_TIL_B02(        00006590
                                                            BARN_IND);  00006600
                                              /* 9926 */                00006610
                                                                        00006620
                                          IF FEIL_MELD_NR > 0 THEN      00006630
                                             GO TO L999;                00006640
                                          ELSE                          00006650
                                             PROGRAM_ID = 'R0011020';   00006660
                                                                        00006670
                                          CALL                          00006680
                                              KOBLE_TO_PERSONER(        00006690
                                                    SØKER_IND,BARN_IND);00006700
                                              /* 9924 */                00006710
                                                                        00006720
                                       END;                             00006730
                                    ELSE                                00006740
                                       DO;                              00006750
  L240:                                                                 00006760
                                          FEIL_VED_LABEL = '240';       00006770
                                          FEIL_MELD_NR   = 1307;        00006780
                                          GO TO L999;                   00006790
                                       END;                             00006800
                               END;                                     00006810
                            ELSE                                        00006820
                               IF B01.PENSJONSTYPE1(BARN_IND) =         00006830
                                                               'L' THEN 00006840
                                  DO;                                   00006850
                                                                        00006860
 /* ***************************************************************** */00006870
 /* BARNET ER FORSØRGET AV ANDRE                                      */00006880
 /* ***************************************************************** */00006890
                                                                        00006900
  L250:                                                                 00006910
                                     FEIL_VED_LABEL = '250';            00006920
                                     FEIL_MELD_NR   = 1203;             00006930
                                     GO TO L999;                        00006940
                                  END;                                  00006950
                               ELSE                                     00006960
                                                                        00006970
 /* ***************************************************************** */00006980
 /* BARNET ER REGISTRERT SOM GIFT/SKILT/ETTERLATT                     */00006990
 /* ***************************************************************** */00007000
 /* DERSOM FORSØRGET EKTEFELLE.                                       */00007010
 /* ***************************************************************** */00007020
                                                                        00007030
                                     IF B01.PENSJONSTYPE1(              00007040
                                                   BARN_IND) = 'F' THEN 00007050
                                        DO;                             00007060
  L260:                                                                 00007070
                                           FEIL_VED_LABEL = '260';      00007080
                                           FEIL_MELD_NR   = 1206;       00007090
                                           GO TO L999;                  00007100
                                        END;                            00007110
                                     ELSE                               00007120
                                        DO;                             00007130
  L270:                                                                 00007140
                                           FEIL_VED_LABEL = '270';      00007150
                                           FEIL_MELD_NR   = 1306;       00007160
                                           GO TO L999;                  00007170
                                        END;                            00007180
                      END;                                              00007190
                   ELSE                                                 00007200
                      DO;                                               00007210
  L275:                                                                 00007220
                         FEIL_VED_LABEL = '275';                        00007230
                         FEIL_MELD_NR   = 0601;                         00007240
                         GO TO L999;                                    00007250
                      END;                                              00007260
                CALL                                                    00007270
                    AJOURFØR_B02_MED_FB_TRANS(I);        /* 1022 */     00007280
                                                                        00007290
 /*YS*/         IF FEIL_MELD_NR > 0 THEN                                00007300
 /*YS*/            GO TO L999;                                          00007310
             END;                                                       00007320
       END;                                                             00007330
    ELSE                                                                00007340
 /*YS*/DO;                                                              00007350
          CALL                                                          00007360
              AJOURFØR_B02_MED_FB_TRANS(I);             /* 1022 */      00007370
                                                                        00007380
 /*YS*/   IF FEIL_MELD_NR > 0 THEN                                      00007390
 /*YS*/      GO TO L999;                                                00007400
 /*YS*/END;                                                             00007410
                                                                        00007420
 END;                                                                   00007430
                                                                        00007440
 ANT_BARN_I_TRANS = I - 1;                                              00007450
                                                                        00007460
 IF FORRIGE_YNG_BARN_IND > 0 THEN                                       00007470
  DO;                                                                   00007480
    DO I = 1 TO 13 WHILE(B02.FNR_TILKN(FORRIGE_YNG_BARN_IND,I) > 0);    00007490
       IF B02.FNR(SØKER_IND) ^=                                         00007500
                             B02.FNR_TILKN(FORRIGE_YNG_BARN_IND,I) THEN 00007510
          DO;                                                           00007520
             DO J = 1 TO 14 UNTIL(B02.FNR(J) =                          00007530
                              B02.FNR_TILKN(FORRIGE_YNG_BARN_IND,I));   00007540
             END;                                                       00007550
             IF B02.TILKNYTNINGSKODE(FORRIGE_YNG_BARN_IND,I) = 'Ø' THEN 00007560
                B02.ANTALL_BARN(FORRIGE_YNG_BARN_IND) =                 00007570
                             B02.ANTALL_BARN(FORRIGE_YNG_BARN_IND) - 1; 00007580
                                                                        00007590
             CALL OPPHØR_KOBLING_TO_PERSONER(FORRIGE_YNG_BARN_IND,I);   00007600
                  /* 9934 */                                            00007610
                                                                        00007620
          END;                                                          00007630
    END;                                                                00007640
  B02.ANTALL_BARN(FORRIGE_YNG_BARN_IND) =                               00007650
                             B02.ANTALL_BARN(FORRIGE_YNG_BARN_IND) - 1; 00007660
  IF B02.ANTALL_BARN(FORRIGE_YNG_BARN_IND) > 1 THEN                     00007670
                                                                        00007680
 /* ***************************************************************** */00007690
 /* DET ER FLERE BARN FREMDELES TILKNYTTET.                           */00007700
 /* ***************************************************************** */00007710
                                                                        00007720
     DO;                                                                00007730
   L280:                                                                00007740
        FEIL_VED_LABEL = '280';                                         00007750
        FEIL_MELD_NR   = 1308;                                          00007760
        GO TO L999;                                                     00007770
     END;                                                               00007780
  ELSE                                                                  00007790
     B02.ANTALL_BARN(FORRIGE_YNG_BARN_IND) = 0;                         00007800
  END;                                                                  00007810
 /* ***************************************************************** */00007820
 /* NÅR ALLE BARNA I TRANSEN ER I B02 MÅ ANTALL BARN I DET NYE        */00007830
 /* BARNEKULLET SUMMERES OG PESTATUS TIL YNGSTE BARN AJOURFØRES MED   */00007840
 /* DETTE TALLET                                                      */00007850
 /* ***************************************************************** */00007860
                                                                        00007870
 DO I = 3 TO 14 WHILE(B02.FNR(I) > 0);                                  00007880
    BARN_ANTALL = BARN_ANTALL + 1;                                      00007890
 END;                                                                   00007900
                                                                        00007910
 B02.ANTALL_BARN(SØKER_IND) = BARN_ANTALL;                              00007920
                                                                        00007930
 IF B02.ANTALL_BARN(SØKER_IND) ^= ANT_BARN_I_TRANS THEN                 00007940
       DO;                                                              00007950
  L290:                                                                 00007960
          FEIL_VED_LABEL = '290';                                       00007970
          FEIL_MELD_NR   = 1308;                                        00007980
          GO TO L999;                                                   00007990
       END;                                                             00008000
 L999:                                                                  00008010
 EXEC CICS RETURN;                                                      00008020
 %PAGE;                                                                 00008030
 %INCLUDE R0011021;         /* OPPRETT_STATUS_FB_BARN     */            00008040
 %INCLUDE R0011022;         /* AJOURFØR_B02_MED_FB_TRANS  */            00008050
 %INCLUDE R0019905;         /* F_ALDER                    */            00008060
 %INCLUDE R0019913;         /* F_SNU_DATO                 */            00008070
 %INCLUDE R0019924;         /* KOBLE_TO_PERSONER          */            00008080
 %INCLUDE R0019926;         /* FLYTT_B01_TIL_B02          */            00008090
 %INCLUDE R0019934;         /* OPPHØR_KOBLING_TO_PERSONER */            00008100
 %INCLUDE R0019949;         /* F_BEREGN_TT_FRAMT          */            00008110
 %INCLUDE R0019965;         /* F_DATO_ÅM_PLUSS1           */ /*YS*/     00008120
                                                                        00008130
                                                                        00008140
 END KON_FB;                                                            00008150
