 /*       SIST ENDRET 17/02-92 13.44.40 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 08/01-92 15.45.17 AV   HERMAN                   */00000010
 /*       SIST ENDRET 22/02-90 11.41.46 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 19/02-90 14.30.05 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 14/12-89 14.10.47 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 01/12-89 10.09.48 AV   DYBVIK                   */00000050
 /* ***************************************************************** */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /*    R0014129 - BEREGN_ETTERLATT_AP_YP                              */00000080
 /*    PROGRAMMERER: HERMAN OKT 89                                    */00000090
 /*HENSIKT:                                                           */00000100
 /*    FINNER HVILKEN BEREGNING SOM GIR MEST :                        */00000110
 /*     1. VANLIG MED TP_EGEN                                         */00000120
 /*     2. VANLIG MED TP_EGEN_PT_55 + TP_BRUTTO                       */00000130
 /*     3. YP-FORDEL OG BARE EGET BEREGNINGSGRUNNLAG                  */00000140
 /*     4. YP-FORDEL MEN MED TP_BRUTTO (AVDØDES)                      */00000150
 /*PROGRAMTILKNYTNING:                                                */00000160
 /*    PROGRAMMET BLIR INKLUDERT I R0014101 - (BEREGN_ETTERLATT_AP)   */00000170
 /*    OG CALLET FRA 4121                                             */00000180
 /*BRUK:                                                              */00000190
 /*    CALL BEREGN_ETTERLATT_AP_YP;                                   */00000200
 /* ***************************************************************** */00000210
 BEREGN_ETTERLATT_AP_YP:                                                00000220
  PROC;                                                                 00000230
                                                                        00000240
 DCL REST_GRAD            FIXED DEC (3) INIT (0);                       00000250
 DCL YRKE_TP              FIXED DEC (7) INIT (0);                       00000260
 DCL YRKE_GP              FIXED DEC (7) INIT (0);                       00000270
 DCL ALDER_TP             FIXED DEC (7) INIT (0);                       00000280
 DCL ALDER_TP_55          FIXED DEC (7) INIT (0);                       00000290
 DCL TP_YA_PT_55          FIXED DEC (7) INIT (0);                       00000300
 DCL ALDER_GP             FIXED DEC (7) INIT (0);                       00000310
 DCL YRKE_EGEN            FIXED DEC (7) INIT (0);                       00000320
 DCL YRKE_55              FIXED DEC (7) INIT (0);                       00000330
 DCL ALDER_EGEN           FIXED DEC (7) INIT (0);                       00000340
 DCL ALDER_55             FIXED DEC (7) INIT (0);                       00000350
 DCL SISTE                FIXED BIN (15);                               00000360
 DCL YPT_UTEN             FIXED DEC (3,2) INIT (0);                     00000370
  DCL        TP_WORK           FIXED DEC (13,4);                        00000380
  DCL        FAKTOR1           FIXED DEC (13,4);                        00000390
  DCL        FAKTOR2           FIXED DEC (13,4);                        00000400
                                                                        00000410
 /* ***************************************************************** */00000420
 /* FØRST BEREGNES PENSJON MED YP-FORDEL - MED ETTERLATTEFORDEL, OG   */00000430
 /* MED EVT POENGTILLEGG                                              */00000440
 /* ***************************************************************** */00000450
                                                                        00000460
    IF B02.YRKEPENS.YPT(BER_SØ_IND) <                                   00000470
       B02.YRKE_POENG_1291(BER_SØ_IND)         THEN                     00000480
       B02.YRKEPENS.YPT(BER_SØ_IND) =                                   00000490
       B02.YRKE_POENG_1291(BER_SØ_IND);                                 00000500
                                                                        00000510
       TP_WORK  = G * B02.YRKEPENS.YPT(BER_SØ_IND) * 0.55;              00000520
       TP_WORK  = TP_WORK * B02.YRKEPENS.YUG(BER_SØ_IND) /100;          00000530
       TP_WORK  = TP_WORK / 12;                                         00000540
       IF B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) = 0    THEN               00000550
          TP_YA_PT_55 = TP_WORK * 0.45 + 0.5;                           00000560
                                                                        00000570
       ELSE                                                             00000580
          DO;                                                           00000590
             FAKTOR1 = (B02.YRKEPENS.PÅ(BER_SØ_IND)                     00000600
                        - B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) )         00000610
                      / B02.YRKEPENS.PÅ(BER_SØ_IND) * 0.45;             00000620
             FAKTOR2 = B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND)              00000630
                      / B02.YRKEPENS.PÅ(BER_SØ_IND) * 0.42;             00000640
            TP_YA_PT_55 = TP_WORK * (FAKTOR1 + FAKTOR2 + 0.00005) + 0.5;00000650
         END;                                                           00000660
                                                                        00000670
 /* TP_YA_PT_55 = B02.YRKEPENS.YPT(BER_SØ_IND) * G * 0.45 * 0.55        00000680
             * B02.YRKEPENS.YUG(BER_SØ_IND) / (100 * 12) + 0.5; */      00000690
                                                                        00000700
    YRKE_GP = B02.YRKEPENS.YUG(BER_SØ_IND) * G / (100 * 12) + 0.5;      00000710
                                                                        00000720
    REST_GRAD = 100 - B02.YRKEPENS.YUG(BER_SØ_IND);                     00000730
                                                                        00000740
    ALDER_TP_55 = F_TP92(FNR_R.ÅR,G,                                    00000750
                  POREKKE.SPT(BER_SØ_IND),                              00000760
                  POREKKE.OPT(BER_SØ_IND),                              00000770
                  POREKKE.PÅ (BER_SØ_IND),                              00000780
          POREKKE.PÅ_ETTER91 (BER_SØ_IND),                              00000790
                  REST_GRAD,55,'J');                                    00000800
                                                                        00000810
    ALDER_GP = G * B02.TT_ANV(BER_SØ_IND) * REST_GRAD                   00000820
                             / (100 * 40 * 12) + 0.5;                   00000830
                                                                        00000840
 /* ***************************************************************** */00000850
 /* SÅ BEREGNES YPT UTEN EVT POENGTILLEGG                             */00000860
 /* ***************************************************************** */00000870
                                                                        00000880
                                                                        00000890
      /** FINNE SISTE UTFYLTE YUFT_ÅM   **/                             00000900
      DO J = 5 TO 1 BY -1 UNTIL(B02.YRKEHIST.YUFT_ÅM                    00000910
                            (BER_SØ_IND,J) > 0);                        00000920
         SISTE = J;                                                     00000930
      END;                                                              00000940
                                                                        00000950
                                                                        00000960
      IF B02.YRKEPENS.YPT(BER_SØ_IND) >                                 00000970
         B02.YRKEHIST.PAÅ(BER_SØ_IND,SISTE)       THEN                  00000980
                                                                        00000990
         DO;                                                            00001000
                                                                        00001010
            IF B01.POENGTILLEGG_KODE(BER_SØ_IND) = 'A'  THEN            00001020
               DO;                                                      00001030
                  IF B02.YRKEPENS.YPT(BER_SØ_IND) - 1  <                00001040
                     B02.YRKEHIST.PAÅ(BER_SØ_IND,SISTE) THEN            00001050
                                                                        00001060
                     YPT_UTEN = B02.YRKEHIST.PAÅ(BER_SØ_IND,SISTE);     00001070
                                                                        00001080
                  ELSE                                                  00001090
                                                                        00001100
                     YPT_UTEN = B02.YRKEPENS.YPT(BER_SØ_IND) - 1;       00001110
               END;                                                     00001120
            ELSE                                                        00001130
            IF B01.POENGTILLEGG_KODE(BER_SØ_IND) = 'B'  THEN            00001140
               DO;                                                      00001150
                  IF B02.YRKEPENS.YPT(BER_SØ_IND) - 0.5  <              00001160
                     B02.YRKEHIST.PAÅ(BER_SØ_IND,SISTE) THEN            00001170
                                                                        00001180
                     YPT_UTEN = B02.YRKEHIST.PAÅ(BER_SØ_IND,SISTE);     00001190
                                                                        00001200
                  ELSE                                                  00001210
                                                                        00001220
                     YPT_UTEN = B02.YRKEPENS.YPT(BER_SØ_IND) - 0.5;     00001230
               END;                                                     00001240
                                                                        00001250
 /*TILLEGG 22.2.90 HL : */                                              00001260
                                                                        00001270
            ELSE                                                        00001280
               YPT_UTEN = B02.YRKEPENS.YPT(BER_SØ_IND);                 00001290
                                                                        00001300
 /*HIT 22.2.90 HL */                                                    00001310
                                                                        00001320
         END;                                                           00001330
                                                                        00001340
      ELSE                                                              00001350
                                                                        00001360
         YPT_UTEN = B02.YRKEPENS.YPT(BER_SØ_IND);                       00001370
                                                                        00001380
 /* ***************************************************************** */00001390
 /* SÅ BEREGNES PENSJON MED YP-FORDEL - UTEN ETTERLATTEFORDEL OG      */00001400
 /* UTEN POENGTILLEGG                                                 */00001410
 /* ***************************************************************** */00001420
                                                                        00001430
       TP_WORK  = G * YPT_UTEN;                                         00001440
       TP_WORK  = TP_WORK * B02.YRKEPENS.YUG(BER_SØ_IND) /100;          00001450
       TP_WORK  = TP_WORK / 12;                                         00001460
       IF B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) = 0    THEN               00001470
          YRKE_TP = TP_WORK * 0.45 + 0.5;                               00001480
                                                                        00001490
       ELSE                                                             00001500
          DO;                                                           00001510
             FAKTOR1 = (B02.YRKEPENS.PÅ(BER_SØ_IND)                     00001520
                        - B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) )         00001530
                      / B02.YRKEPENS.PÅ(BER_SØ_IND) * 0.45;             00001540
             FAKTOR2 = B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND)              00001550
                      / B02.YRKEPENS.PÅ(BER_SØ_IND) * 0.42;             00001560
             YRKE_TP = TP_WORK * (FAKTOR1 + FAKTOR2 + 0.00005) + 0.5;   00001570
         END;                                                           00001580
                                                                        00001590
 /* YRKE_TP = YPT_UTEN * G * 0.45                                       00001600
              * B02.YRKEPENS.YUG(BER_SØ_IND) / (100 * 12) + 0.5; */     00001610
                                                                        00001620
    ALDER_TP = F_TP92(FNR_R.ÅR,G,                                       00001630
               POREKKE.SPT(14),/*POENGREKKEN UTEN PT LIGGER */          00001640
               POREKKE.OPT(14),/*PÅ PLASS NR 14 */                      00001650
               POREKKE.PÅ (14),                                         00001660
               POREKKE.PÅ_ETTER91 (14),                                 00001670
               REST_GRAD,100,'J');                                      00001680
                                                                        00001690
 /* ***************************************************************** */00001700
 /* SAMMENLIGNING FORETAS, OG RESULTATET MERKES I YPT_KODE            */00001710
 /* ***************************************************************** */00001720
                                                                        00001730
    YRKE_EGEN  = YRKE_TP + YRKE_GP + ALDER_TP + ALDER_GP;               00001740
    YRKE_55    = TP_YA_PT_55 + ALDER_TP_55 + YRKE_GP + ALDER_GP         00001750
 /*TILLEGG 19.2.90 HL : */   + TP_EK_PT;                                00001760
    ALDER_EGEN = TP_EGEN + B02.ALDERSP.GP(BER_SØ_IND);                  00001770
    ALDER_55 = TP_PT_EGEN_55 + TP_EK_PT + B02.ALDERSP.GP(BER_SØ_IND);   00001780
                                                                        00001790
    IF YRKE_EGEN > ALDER_EGEN                THEN                       00001800
       IF YRKE_EGEN > ALDER_55                 THEN                     00001810
          IF YRKE_EGEN > YRKE_55                 THEN                   00001820
             DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '3';                   00001830
                                           /*YRKE_EGEN ER STØRST*/      00001840
          ELSE                                                          00001850
             DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '4';                   00001860
                                           /*YRKE_55 ER STØRST*/        00001870
       ELSE                                                             00001880
       IF ALDER_55 > YRKE_55                 THEN                       00001890
          DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '2';                      00001900
                                           /*ALDER_55 ER STØRST*/       00001910
       ELSE                                                             00001920
          DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '4';                      00001930
                                           /*YRKE_55 ER STØRST*/        00001940
    ELSE                                                                00001950
    IF ALDER_EGEN > ALDER_55                 THEN                       00001960
       IF ALDER_EGEN > YRKE_55                 THEN                     00001970
          DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '1';                      00001980
                                           /*ALDER_EGEN ER STØRST*/     00001990
       ELSE                                                             00002000
          DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '4';                      00002010
                                           /*YRKE_55 ER STØRST*/        00002020
    ELSE                                                                00002030
    IF ALDER_55 > YRKE_55                    THEN                       00002040
       DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '2';                         00002050
                                           /*ALDER_55 ER STØRST*/       00002060
    ELSE                                                                00002070
       DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '4';                         00002080
                                           /*YRKE_55 ER STØRST*/        00002090
                                                                        00002100
 /* ***************************************************************** */00002110
 /* PENSJON OG POENGTALL OPPDATERES                                   */00002120
 /* ***************************************************************** */00002130
                                                                        00002140
 SELECT (DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN);                            00002150
                                                                        00002160
    WHEN ('1')  /* ALDER_EGEN ER STØRST*/                               00002170
                                                                        00002180
    DO;                                                                 00002190
                                                                        00002200
       B02.POENGTILLEGG_DATO_ÅM(BER_SØ_IND) = 0;                        00002210
       B02.POENGTILLEGG_KODE   (BER_SØ_IND) = ' ';                      00002220
       B02.POENGTILLEGG_DATO_ÅM(BER_EK_IND) = 0;                        00002230
       B02.POENGTILLEGG_KODE   (BER_EK_IND) = ' ';                      00002240
                                                                        00002250
       POREKKE(BER_SØ_IND)     = POREKKE(14);                           00002260
 /* PLASS 14 BRUKES SOM OPPBEVARINGSOMR. DA DENNE PLASSEN     */        00002270
 /* ALLTID ER LEDIG I ALDERSPENSJON.                          */        00002280
       POREKKE_P67(BER_SØ_IND) = W_POREKKE;                             00002290
                                                                        00002300
       B02.ALDERSP.TP(BER_SØ_IND)   = TP_EGEN;                          00002310
       B02.ALDERSP.SPT(BER_SØ_IND)  = POREKKE.SPT(BER_SØ_IND);          00002320
       B02.ALDERSP.OPT(BER_SØ_IND)  = POREKKE.OPT(BER_SØ_IND);          00002330
       B02.ALDERSP.PÅ(BER_SØ_IND)   = POREKKE.PÅ (BER_SØ_IND);          00002340
                                                                        00002350
       B02.VT_SPT(BER_SØ_IND)   = POREKKE_P67.SPT(BER_SØ_IND);          00002360
       B02.VT_OPT(BER_SØ_IND)   = POREKKE_P67.OPT(BER_SØ_IND);          00002370
       B02.VT_PÅ (BER_SØ_IND)   = POREKKE_P67.PÅ (BER_SØ_IND);          00002380
                                                                        00002390
       B02.ETTEPENS.TP_BRUTTO(BER_SØ_IND) = 0;                          00002400
       B02.ETTEPENS.TP_NETTO(BER_SØ_IND)  = 0;                          00002410
     END;                                                               00002420
                                                                        00002430
    WHEN ('2')  /* ALDER_55 ER STØRST*/                                 00002440
                                                                        00002450
     DO;                                                                00002460
        B02.ALDERSP.TP(BER_SØ_IND)   = TP_PT_EGEN_55;                   00002470
        B02.ALDERSP.SPT(BER_SØ_IND)  = POREKKE.SPT(BER_SØ_IND);         00002480
        B02.ALDERSP.OPT(BER_SØ_IND)  = POREKKE.OPT(BER_SØ_IND);         00002490
        B02.ALDERSP.PÅ(BER_SØ_IND)   = POREKKE.PÅ (BER_SØ_IND);         00002500
                                                                        00002510
        B02.VT_SPT(BER_SØ_IND)   = POREKKE_P67.SPT(BER_SØ_IND);         00002520
        B02.VT_OPT(BER_SØ_IND)   = POREKKE_P67.OPT(BER_SØ_IND);         00002530
        B02.VT_PÅ (BER_SØ_IND)   = POREKKE_P67.PÅ (BER_SØ_IND);         00002540
                                                                        00002550
        B02.ETTEPENS.TP_BRUTTO(BER_SØ_IND) = TP_EK_PT;                  00002560
        B02.ETTEPENS.TP_NETTO(BER_SØ_IND)  = TP_EK_PT;                  00002570
                                                                        00002580
     END;                                                               00002590
                                                                        00002600
    WHEN ('3')  /* YRKE_EGEN ER STØRST*/                                00002610
                                                                        00002620
     DO;                                                                00002630
       B02.POENGTILLEGG_DATO_ÅM(BER_SØ_IND) = 0;                        00002640
       B02.POENGTILLEGG_KODE   (BER_SØ_IND) = ' ';                      00002650
       B02.POENGTILLEGG_DATO_ÅM(BER_EK_IND) = 0;                        00002660
       B02.POENGTILLEGG_KODE   (BER_EK_IND) = ' ';                      00002670
                                                                        00002680
       POREKKE(BER_SØ_IND)     = POREKKE(14);                           00002690
 /* PLASS 14 BRUKES SOM OPPBEVARINGSOMR. DA DENNE PLASSEN     */        00002700
 /* ALLTID ER LEDIG I ALDERSPENSJON.                          */        00002710
       POREKKE_P67(BER_SØ_IND) = W_POREKKE;                             00002720
                                                                        00002730
       B02.ALDERSP.GP(BER_SØ_IND)   = YRKE_GP + ALDER_GP;               00002740
       B02.ALDERSP.TP(BER_SØ_IND)   = YRKE_TP + ALDER_TP;               00002750
       B02.ALDERSP.SPT(BER_SØ_IND)  = POREKKE.SPT(BER_SØ_IND);          00002760
       B02.ALDERSP.OPT(BER_SØ_IND)  = POREKKE.OPT(BER_SØ_IND);          00002770
       B02.ALDERSP.PÅ(BER_SØ_IND)   = POREKKE.PÅ (BER_SØ_IND);          00002780
                                                                        00002790
       B02.VT_SPT(BER_SØ_IND)   = POREKKE_P67.SPT(BER_SØ_IND);          00002800
       B02.VT_OPT(BER_SØ_IND)   = POREKKE_P67.OPT(BER_SØ_IND);          00002810
       B02.VT_PÅ (BER_SØ_IND)   = POREKKE_P67.PÅ (BER_SØ_IND);          00002820
                                                                        00002830
       B02.ETTEPENS.TP_BRUTTO(BER_SØ_IND) = 0;                          00002840
       B02.ETTEPENS.TP_NETTO(BER_SØ_IND)  = 0;                          00002850
                                                                        00002860
       B02.YRKEPENS.YPT(BER_SØ_IND) = YPT_UTEN;                         00002870
     END;                                                               00002880
                                                                        00002890
    WHEN ('4')  /* YRKE_55 ER STØRST*/                                  00002900
                                                                        00002910
     DO;                                                                00002920
        B02.ALDERSP.TP(BER_SØ_IND)   = TP_YA_PT_55 + ALDER_TP_55;       00002930
        B02.ALDERSP.GP(BER_SØ_IND)   = YRKE_GP + ALDER_GP;              00002940
        B02.ALDERSP.SPT(BER_SØ_IND)  = POREKKE.SPT(BER_SØ_IND);         00002950
        B02.ALDERSP.OPT(BER_SØ_IND)  = POREKKE.OPT(BER_SØ_IND);         00002960
        B02.ALDERSP.PÅ(BER_SØ_IND)   = POREKKE.PÅ (BER_SØ_IND);         00002970
                                                                        00002980
        B02.VT_SPT(BER_SØ_IND)   = POREKKE_P67.SPT(BER_SØ_IND);         00002990
        B02.VT_OPT(BER_SØ_IND)   = POREKKE_P67.OPT(BER_SØ_IND);         00003000
        B02.VT_PÅ (BER_SØ_IND)   = POREKKE_P67.PÅ (BER_SØ_IND);         00003010
                                                                        00003020
        B02.ETTEPENS.TP_BRUTTO(BER_SØ_IND) = TP_EK_PT;                  00003030
        B02.ETTEPENS.TP_NETTO(BER_SØ_IND)  = TP_EK_PT;                  00003040
                                                                        00003050
     END;                                                               00003060
                                                                        00003070
    OTHERWISE;                                                          00003080
                                                                        00003090
 END;                                                                   00003100
                                                                        00003110
 END BEREGN_ETTERLATT_AP_YP;                                            00003120
