 /*       SIST ENDRET 25/02-97 11.53.58 AV   JDA7339                  */00000000
 /*       SIST ENDRET 06/02-96 13.22.28 AV   JDA0310                  */00000010
 /*       SIST ENDRET 10/01-96 11.00.28 AV   TSB0310                  */00000020
 /*       SIST ENDRET 13/06-95 10.55.27 AV   TSB0310                  */00000030
 /*       SIST ENDRET 17/02-94 13.26.00 AV   TRUDE                    */00000040
 /* ***************************************************************** */00000050
 /*IDENTIFIKASJON:                                                    */00000060
 /* **********************                                            */00000070
 /*  PROGRAM-IDENT : R00104FB  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000080
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000090
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000100
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000110
 /*                                                                   */00000120
 /* ***************************************************************** */00000130
 /*HENSIKT:                                                           */00000140
 /* **********                                                        */00000150
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000160
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000170
 /*    FORHÅND.                                                       */00000180
 /*    MAPS HØRER INN UNDER MAPSET 'S001F1'.                         */ 00000190
 /*                                                                   */00000200
 /* ***************************************************************** */00000210
 /*PROGRAMTILKNYTTING:                                                */00000220
 /* ********************                                              */00000230
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000240
 /*                                                                   */00000250
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000260
 /*    BRUK :                                                         */00000270
 /*    EXEC CICS XCTL PROGRAM ('R00104FB') COMMAREA(KOM_OMR);         */00000280
 /*    PROGRAMMET INCLUDER :                                          */00000290
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    FB       */00000300
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       FB       */00000310
 /* ***************************************************************** */00000320
 /*DATASETTOPPLYSNINGER:                                              */00000330
 /* ***********************                                           */00000340
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000350
 /*                                                                   */00000360
 /* ***************************************************************** */00000370
 /*FEILMELDINGER:                                                     */00000380
 /* *******************                                               */00000390
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000400
 /*                                                                   */00000410
 /* ***************************************************************** */00000420
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000430
                                                                        00000440
          %INCLUDE P0019906;                                            00000450
          %INCLUDE P0019908;                                            00000460
          %INCLUDE P0019910;                                            00000470
          %INCLUDE P0019912;                                            00000480
          %INCLUDE P0019913;                                            00000490
                                                                        00000500
 DCL                                                                    00000510
      (CSTG, ADDR)                   BUILTIN;                           00000520
 DCL  COMMAREA_PEKER         PTR,                                       00000530
      LOKAL_KOM_PTR          PTR;                                       00000540
                                                                        00000550
                                                                        00000560
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000570
 DCL                                                                    00000580
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000590
    DFHBMUNP             CHAR(1) INIT(' '),                             00000600
    DFHBMBRY             CHAR(1) INIT('H'),                             00000610
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000620
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000630
    MELDING6O            CHAR(10),                                      00000640
    YMELDING6O           CHAR(10);                                      00000650
                                                                        00000660
          %INCLUDE S001F1  ;                                            00000670
          %INCLUDE P0011001;                                            00000680
          DCL                                                           00000690
             SISTE_GANG       BIT(1) INIT('1'B);                        00000700
                                                                        00000710
                                                                        00000720
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000730
                                                                        00000740
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000750
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000760
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000770
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000780
                                                                        00000790
                                                                        00000800
                                                                        00000810
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000820
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000830
                                                                        00000840
                                                                        00000850
                                                                        00000860
           IF ^W01_YSKADE   THEN                                        00000870
              DO;                                                       00000880
                 CALL OVERFØR_FB_BARN_MAP;          /* R0011006 */      00000890
                 CALL OVERFØR_FB_MOR_MAP;           /* R0011006 */      00000900
                 CALL OVERFØR_FB_FAR_MAP;           /* R0011006 */      00000910
                                                                        00000920
                 IF BARNE_TAB_POS = '1' & BARN.FNR_B(5) > 0 THEN        00000930
                    DO;                                                 00000940
                       SISTE_GANG    = '0'B;                            00000950
                       BARNE_TAB_POS = '2';                             00000960
                       START         = START - 1;                       00000970
                       I             = I - 1;                           00000980
                       W01_TRANS_IND     = W01_TRANS_IND   - 1;         00000990
                    END;                                                00001000
                 ELSE IF BARNE_TAB_POS = '2' & BARN.FNR_B(9) > 0 THEN   00001010
                    DO;                                                 00001020
                       TRANS_ANT     = TRANS_ANT + 1;                   00001030
                       SISTE_GANG    = '0'B;                            00001040
                       BARNE_TAB_POS = '3';                             00001050
                       START         = START - 1;                       00001060
                       I             = I - 1;                           00001070
                       W01_TRANS_IND     = W01_TRANS_IND   - 1;         00001080
                    END;                                                00001090
                 ELSE IF BARNE_TAB_POS = '3' THEN                       00001100
                    TRANS_ANT = TRANS_ANT + 1;                          00001110
                                                                        00001120
                 IF SISTE_GANG THEN                                     00001130
                    DO;                                                 00001140
                       IF MOR.YSKADE_TILLEGG_M ^= 'J' &                 00001150
                          FAR.YSKADE_TILLEGG_F ^= 'J' THEN              00001160
                                                                        00001170
                          /* FREE TRANS_OMR,TRANS_OPPL_OMR;   */        00001180
                                                                        00001190
                       IF MOR.YSKADE_TILLEGG_M  = 'J'   THEN            00001200
                          DO;                                           00001210
                             W01_YSKADE        = '1'B;                  00001220
                             W01_MOR_BEHANDLES = '1'B;                  00001230
                             W01_SIDE_ANTALL   = W01_SIDE_ANTALL + 1;   00001240
                          END;                                          00001250
                                                                        00001260
                       IF FAR.YSKADE_TILLEGG_F  = 'J'   THEN            00001270
                          DO;                                           00001280
                             IF ^W01_MOR_BEHANDLES      THEN            00001290
                                W01_FAR_BEHANDLES = '1'B;               00001300
                             W01_YSKADE           = '1'B;               00001310
                             W01_SIDE_ANTALL      = W01_SIDE_ANTALL + 1;00001320
                          END;                                          00001330
                    END;                                                00001340
                                                                        00001350
                 S001101O.DUMMYA = 'Ø';             /* PROT,DARK  */    00001360
                 W01_MAP      = 'S001101';                              00001370
                                                                        00001380
              END;                                                      00001390
           ELSE                                                         00001400
              DO;                                                       00001410
                                                                        00001420
                 IF W01_MOR_BEHANDLES   THEN                            00001430
                    DO;                                                 00001440
                       CALL OVERFØR_FBY_MOR_MAP;                        00001450
                       IF FAR.YSKADE_TILLEGG_F ^= 'J' THEN              00001460
                          DO;                                           00001470
                             W01_YSKADE = '0'B;                         00001480
                             /* FREE TRANS_OMR,TRANS_OPPL_OMR;  */      00001490
                          END;                                          00001500
                                                                        00001510
                       S001201O.DUMMYA = 'Ø';  /* PROT,DARK */          00001520
                       W01_MAP      = 'S0011201';                       00001530
                       W01_MOR_BEHANDLES = '0'B;                        00001540
                    END;                                                00001550
                                                                        00001560
                 IF W01_FAR_BEHANDLES   THEN                            00001570
                    DO;                                                 00001580
                       W01_FAR_BEHANDLES = '0'B;                        00001590
                       CALL OVERFØR_FBY_FAR_MAP;                        00001600
                       W01_YSKADE = '0'B;                               00001610
                                                                        00001620
                    /* FREE TRANS_OMR,TRANS_OPPL_OMR;  */               00001630
                                                                        00001640
                       S001201O.DUMMYA = 'Ø';         /* PROT,DARK */   00001650
                       W01_MAP      = 'S001201';                        00001660
                    END;                                                00001670
                 ELSE                                                   00001680
                    IF FAR.YSKADE_TILLEGG_F = 'J' THEN                  00001690
                       W01_FAR_BEHANDLES = '1'B;                        00001700
              END;                                                      00001710
                                                                        00001720
                                                                        00001730
                                                                        00001740
      EXEC CICS RETURN;                                                 00001750
                                                                        00001760
                                                                        00001770
                                                                        00001780
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00001790
      PROC(FIXED_DEC_5);                                                00001800
                                                                        00001810
      DCL                                                               00001820
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00001830
                                                                        00001840
   END SKRIV_FEIL;                                                      00001850
                                                                        00001860
        SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001870
                                                                        00001880
           DCL                                                          00001890
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001900
                                                                        00001910
        END SKRIV_FEIL_YP;                                              00001920
                                                                        00001930
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001940
                                                                        00001950
           DCL                                                          00001960
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001970
                                                                        00001980
        END SKRIV_FEIL_SP;                                              00001990
                                                                        00002000
          %INCLUDE R0019912;                                            00002010
          %INCLUDE R0011006;                                            00002020
                                                                        00002030
 END R001041;                                                           00002040
                                                                        00002050
                                                                        00002060
