 /*       SIST ENDRET 24/07-91 09.33.30 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 26/04-91 11.43.15 AV   DYBVIK                   */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /*    R001NC02  -                                                    */00000030
 /*    PROGRAMMERER:                                                  */00000040
 /*HENSIKT:                                                           */00000050
 /*    R001NC02 INNHOLDER:                                            */00000060
 /*      PROSEDYRER FOR BLANKING AV F7_TRANS_OMR.                     */00000070
 /*ENDRING:                                                           */00000080
 /*    PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL          */00000090
 /*    F7_TRANS_OMR ER SKILT UT OG LAGT I R001NC09.                   */00000100
 /*PROGRAMTILKNYTNING:                                                */00000110
 /*    PROSEDYRENE INCLUDES I BEHANDLINGA AV FORSØRGINGSTILLEGG FOR   */00000120
 /*    EKTEFELLE OG /ELLER BARN TIL DET MASKINELLE                    */00000130
 /*    FOLKETRYGDSYSTEMET.                                            */00000140
 /*    ARBEIDSOMRÅDE: P001NC01                                        */00000150
 /*BRUK:                                                              */00000160
 /*    %INCLUDE R001NC02;                                             */00000170
 /*    BLANK_F7_SØKER:    BLANKER SØKERDELEN                          */00000180
 /*    BLANK_F7_BARN:     BLANKER BARNEDELEN                          */00000190
 /*    BLANK_F7_MELDNR:   SETTER 0 I MELDINGSNUMMERNE                 */00000200
 %PAGE;                                /*   */                          00000210
 /* ***************************************************************** */00000220
 /*                                                                   */00000230
 /*    PROSEDYREN BLANKER F7_SØKERDELEN I F7_TRANS_OMR I              */00000240
 /*    KOM_OMR FOR FORSØRGINGSTILLEGG EKTEFELLE OG/ELLER BARN.        */00000250
 /*                                                                   */00000260
 /* ***************************************************************** */00000270
 %SKIP(2);                             /*   */                          00000280
 BLANK_F7_SØKER:                                                        00000290
   PROC;                                                                00000300
      F7S.REGDATO = 0;                                                  00000310
      F7S.TERMID = '    ';                                              00000320
      F7S.FNR = 0;                                                      00000330
      F7S.FNR_GML = 0;                                                  00000340
      F7S.TKNR = 0;                                                     00000350
      F7S.TILL_EK = ' ';                                                00000360
      F7S.BT_ANT = 0;                                                   00000370
      F7S.VIRK_DATO_MÅ = 0;                                             00000380
      F7S.FNR_EK = 0;                                                   00000390
      F7S.FNR_GML_EK = 0;                                               00000400
                                                                        00000410
   END BLANK_F7_SØKER;                                                  00000420
 BLANK_F7_SØKER2:                                                       00000430
   PROC;                                                                00000440
      F7S.PENSJONSINNTEKT  = 0;                                         00000450
      F7S.ARBEIDSINNTEKT  = 0;                                          00000460
      F7S.PENSJONSINNTEKT_EK = 0;                                       00000470
      F7S.ARBEIDSINNTEKT_EK = 0;                                        00000480
   END BLANK_F7_SØKER2;                                                 00000490
 %PAGE;                                /*   */                          00000500
 /* ***************************************************************** */00000510
 /*                                                                   */00000520
 /*    PROSEDYREN BLANKER F7_BARNEDELEN I F7_TRANS_OMR I              */00000530
 /*    KOM_OMR FOR FORSØRGINGSTILLEGG FOR EKTEFELLE OG/ELLER BARN.    */00000540
 /*                                                                   */00000550
 /* ***************************************************************** */00000560
 %SKIP;                                                                 00000570
 BLANK_F7_BARN:                                                         00000580
   PROC;                                                                00000590
   DCL                                                                  00000600
      ANT_BARN FIXED BIN (15);                                          00000610
 %SKIP;                                                                 00000620
      DO ANT_BARN = 1 TO 12;                                            00000630
         F7B.FNR_BARN(ANT_BARN) = 0;                                    00000640
         F7B.FELLES_BARN(ANT_BARN) = ' ';                               00000650
         F7B.FNR_GML_BARN(ANT_BARN) = 0;                                00000660
      END;                                                              00000670
   END BLANK_F7_BARN;                                                   00000680
 %PAGE;                                /* */                            00000690
 BLANK_F7_BARN_REST:                                                    00000700
   PROC;                                                                00000710
   DCL                                                                  00000720
      ANT_BARN FIXED BIN (15),                                          00000730
      WS       FIXED BIN (15);                                          00000740
 %SKIP;                                                                 00000750
      WS   = F7S.BT_ANT + 1;                                            00000760
      IF WS < 13  THEN                                                  00000770
      DO;                                                               00000780
         DO ANT_BARN = WS TO 12;                                        00000790
            F7B.FNR_BARN(ANT_BARN) = 0;                                 00000800
            F7B.FELLES_BARN(ANT_BARN) = ' ';                            00000810
            F7B.FNR_GML_BARN(ANT_BARN) = 0;                             00000820
        END;                                                            00000830
     END;                                                               00000840
   END BLANK_F7_BARN_REST;                                              00000850
 %PAGE;                                /* */                            00000860
 /* ***************************************************************** */00000870
 /*                                                                   */00000880
 /*    PROSEDYRE FOR Å SETTE 0  MELDINGSNUMMERNE I F7_TRANS_OMR I     */00000890
 /*    KOM_OMR.                                                       */00000900
 /*                                                                   */00000910
 /* ***************************************************************** */00000920
 %SKIP(2);                                                              00000930
 BLANK_F7_MELDNR:                                                       00000940
   PROC;                                                                00000950
   DCL                                                                  00000960
      ANT_BARN FIXED BIN (15);                                          00000970
 %SKIP(2);                                                              00000980
 /*  0 I MELDINGSNUMMERNE I  SØKERDELEN   */                            00000990
 %SKIP(2);                                                              00001000
      F7S.REGDATONR = 0;                                                00001010
      F7S.TERMIDNR = 0;                                                 00001020
      F7S.FNRNR = 0;                                                    00001030
      F7S.TKNRNR = 0;                                                   00001040
      F7S.TILL_EKNR = 0;                                                00001050
      F7S.BT_ANTNR = 0;                                                 00001060
      F7S.VIRK_DATO_MÅNR = 0;                                           00001070
      F7S.FNR_EKNR = 0;                                                 00001080
      F7S.PENSJONSINNTEKTNR = 0;                                        00001090
      F7S.ARBEIDSINNTEKTNR = 0;                                         00001100
      F7S.PENSJONSINNTEKT_EKNR = 0;                                     00001110
      F7S.ARBEIDSINNTEKT_EKNR = 0;                                      00001120
 %SKIP(2);                             /*  */                           00001130
 /*  0 I MELDINGSNUMMERNE I  BARNEDELEN   */                            00001140
 %SKIP(2);                                                              00001150
      DO ANT_BARN = 1 TO 12;                                            00001160
         F7B.FNR_BARNNR(ANT_BARN) = 0;                                  00001170
         F7B.FELLES_BARNNR(ANT_BARN) = 0;                               00001180
      END;                                                              00001190
   END BLANK_F7_MELDNR;                                                 00001200
