 /*       SIST ENDRET 07/02-89 13.10.23 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 01/03-88 09.48.45 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 17/02-88          AV   HERMAN                   */00000020
 %SKIP;                                /*  */                           00000030
 /* ***************************************************************** */00000040
 /*                                                                   */00000050
 /* ***************************************************************** */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /* **********************                                            */00000080
 /*  PROGRAM-IDENT : R0019964   F_6MDR                FUNKSJON        */00000090
 /*  PROGRAM-SPRÅK : PLI                                              */00000100
 /*  PROGRAMMERER  : HERMAN LARSSEN                                   */00000110
 /*  PROGRAMMET BLE LAGET : FEB 88                                    */00000120
 /*                                                                   */00000130
 /* ***************************************************************** */00000140
 /*HENSIKT:                                                           */00000150
 /* **********                                                        */00000160
 /* MOTTAR VIRKNINGSDATO_ÅM                                           */00000170
 /* TESTER PÅ OM DETTE ER 6 MÅNEDER ETTER VIRKMÅNEDEN.                */00000180
 /* RETURNERER BIT = 1 HVIS JA   -  ELLERS '0'                        */00000190
 /*                                                                   */00000200
 /*   BRUK :                                                          */00000210
 /*     IF ^F_6MDR          THEN                                      */00000220
 /*        FEIL                                                       */00000230
 /*                                                                   */00000240
 /* ***************************************************************** */00000250
 /*PROGRAMTILKNYTTING:                                                */00000260
 /* ********************                                              */00000270
 /*  PROGRAMMET CALLES AV DIVERSE PROGRAM                             */00000280
 /*  PROGRAMMET BRUKER BUILTIN FUNKSJON  'DATE'.                      */00000290
 /*                                                                   */00000300
 /* ***************************************************************** */00000310
 /*ENDRINGER:                                                         */00000320
 /* ***************************************************************** */00000330
 F_6MDR:                                                                00000340
   PROC (VIRKDATO_ÅM) RETURNS(BIT (1));                                 00000350
 %SKIP(2);                                                              00000360
   DCL                                                                  00000370
      DATE BUILTIN;                                                     00000380
   DCL                                                                  00000390
      VIRKDATO_ÅM            PIC '9999',                                00000400
      VIRK_ÅR DEF VIRKDATO_ÅM POS (1) PIC '99',                         00000410
      VIRK_MD DEF VIRKDATO_ÅM POS (3) PIC '99';                         00000420
   DCL                                                                  00000430
      DATO_ÅMD CHAR (6),                                                00000440
      DATO_PIC           PIC '999999',                                  00000450
      ÅR DEF DATO_PIC POS(1) PIC '99',                                  00000460
      MD DEF DATO_PIC POS(3) PIC '99';                                  00000470
   DCL                                                                  00000480
      KODE BIT (1) INIT ('1'B);                                         00000490
 %SKIP(2);                                                              00000500
      DATO_ÅMD = DATE;                                                  00000510
      DATO_PIC = DATO_ÅMD;                                              00000520
      MD = MD + 6;                                                      00000530
      IF MD > 12             THEN                                       00000540
         DO;                                                            00000550
            ÅR = ÅR + 1;                                                00000560
            MD = MD - 12;                                               00000570
         END;                                                           00000580
      IF VIRK_ÅR > ÅR        THEN                                       00000590
         KODE = '0'B;                                                   00000600
      ELSE                                                              00000610
         IF VIRK_ÅR = ÅR     THEN                                       00000620
            IF VIRK_MD > MD  THEN                                       00000630
               KODE = '0'B;                                             00000640
      RETURN(KODE);                                                     00000650
   END F_6MDR;                                                          00000660
