 /*       SIST ENDRET 20/12-82 18.38.40 AV   GRAESMO                  */00000000
 /*       SIST ENDRET 20/12-82 18.11.35 AV   GRAESMO                  */00000010
 /*       SIST ENDRET 14/10-82 13.59.35 AV   GRAESMO                  */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0019946 PLI                                                   */00000040
 /*    PROC       ER LAGET I OKTOBER 1982 AV GRÆSMO.                  */00000050
 /*HENSIKT:                                                           */00000060
 /*    SØKER PÅ CHAR DEFINERT LINJE ETTER OPPGITT VARIABEL            */00000070
 /*    OG ENDRER DETTE TIL PARAMETERGITT VERDI.                       */00000080
 /*BRUKES:                                                            */00000090
 /*    LINJE = SUBSTITUTE(LINJE,GAMMEL_VERDI,NY_VERDI)                */00000100
 /*PARAMETRE INN:                                                     */00000110
 /*    1 LINJEN SOM SKAL ENDRE NOE AV INNHOLDET                       */00000120
 /*    2 VARIABEL SOM SKAL ENDRES                                     */00000130
 /*    3 FELTET SOM SKAL ERSTATTE DEN GAMLE VERDI                     */00000140
 /*PARAMETRE UT :                                                     */00000150
 /*    SVAR                                                           */00000160
 /* ***************************************************************** */00000170
 %PAGE;                                /*   */                          00000180
 SUBSTITUTE:                                                            00000190
    PROC (X1,X2,X3)  RETURNS (CHAR (255) VARYING );                     00000200
    /*                                                               */ 00000210
    /* ************************************************************* */ 00000220
    /*                                                               */ 00000230
    /* ENDRER VARIABLE TEKST DATA  A_1                               */ 00000240
    /*                                                               */ 00000250
    /* ************************************************************* */ 00000260
    /*                                                               */ 00000270
    DCL    (X1,X2,X3)         CHAR (*);                                 00000280
    DCL    SVAR               CHAR (255)  VARYING;                      00000290
    DCL    (L1,L2,L3)    FIXED BIN (15) STATIC;                         00000300
                                                                        00000310
    L1                       =     LENGTH(X1);                          00000320
    L2                       =     LENGTH(X2);                          00000330
    L3                       =     LENGTH(X3);                          00000340
                                                                        00000350
    IF  L1  >  0  &                                                     00000360
        L2  >  0  &                                                     00000370
        L3  >  0  THEN                                                  00000380
       DO;                                                              00000390
          IF  INDEX (X1,X2) > 0    THEN                                 00000400
             SVAR            =     SUBSTR (X1,1,INDEX(X1,X2) - 1) !!    00000410
                                   X3 !!                                00000420
                                   SUBSTR                               00000430
                                     (X1,                               00000440
                                      INDEX(X1,X2) +  L2,               00000450
                                      L1 - (INDEX(X1,X2) - L2));        00000460
          ELSE                                                          00000470
            SVAR            =     X1;                                   00000480
                                                                        00000490
       END;                                                             00000500
    ELSE                                                                00000510
       SVAR = '';                                                       00000520
   RETURN (SVAR);                                                       00000530
 END SUBSTITUTE;                                                        00000540
