 /*       SIST ENDRET 14/12-88 14.39.49 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 04/08-83 09.22.58 AV   LUNDEBY                  */00000010
 /*       SIST ENDRET 13/04-83 09.39.37 AV   LUNDEBY                  */00000020
 /*       SIST ENDRET 11/04-83 15.00.13 AV   LUNDEBY                  */00000030
                                                                        00000040
                                                                        00000050
  /* **************************************************************** */00000060
  /*IDENTIFIKASJON:                                                   */00000070
  /*    R0019H50 - HOVEDPROGRAM I PLI                                 */00000080
  /*    PROGRAMMERER: LUNDEBY FEBRUAR  1982                           */00000090
  /*                                                                  */00000100
  /*HENSIKT:                                                          */00000110
  /*    SKRIVER STATUS TIL DATABASEN .BENYTTER REPLACE .              */00000120
  /*                                                                  */00000130
  /*PROGRAMTILKNYTNING:                                               */00000140
  /*    R005430  -->  SKRIVER  ENDRET SISTE STATUS                    */00000150
  /*                                                                  */00000160
  /*BRUK:                                                             */00000170
  /*                                                                  */00000180
  /* **************************************************************** */00000190
                                                                        00000200
  R0019H5 :                                                             00000210
    PROC            (COMMAREA_PEKER)                                    00000220
           OPTIONS  (MAIN);                                             00000230
                                                                        00000240
                                                                        00000250
    %PAGE;                                                              00000260
    %INCLUDE P0019908;                            /* KOM_OMR        */  00000270
                                                                        00000280
    %PAGE;                                                              00000290
    %INCLUDE P0019910;                            /* STYRINGS_OMR   */  00000300
                                                                        00000310
    %PAGE;                                                              00000320
    %INCLUDE P0019912;                            /* DIV_PARAM_OMR  */  00000330
                                                                        00000340
    %PAGE;                                                              00000350
       DCL 1  B02              BASED (B02_PEKER),                       00000360
    %INCLUDE P0019921;                            /* B02            */  00000370
                                                                        00000380
                                                                        00000390
    %PAGE;                                                              00000400
    /* ************************************************************ */  00000410
    /*                                                              */  00000420
    /*     INNEBYGDE PLI-FUNKSJONER                                 */  00000430
    /*                                                              */  00000440
    /* ************************************************************ */  00000450
                                                                        00000460
     DCL                                                                00000470
        ( ADDR , LOW , CSTG , DATE )  BUILTIN;                          00000480
     DCL                                                                00000490
          PLITDLI ENTRY;                                                00000500
     DCL                                                                00000510
         COMMAREA_PEKER            POINTER;                             00000520
     DCL                                                                00000530
         W01_HJELPE_PTR            POINTER;                             00000540
                                                                        00000550
    /* ************************************************************ */  00000560
    /*                                                              */  00000570
    /* HJELPE-OMR. FOR BUILTIN-FUNC.     :    DATE                  */  00000580
    /*                                                              */  00000590
    /* ************************************************************ */  00000600
                                                                        00000610
     DCL    W01_DATE                         CHAR (6) INIT ('');        00000620
                                                                        00000630
     DCL    W01_ÅR  DEF     W01_DATE         PIC '99' ;                 00000640
                                                                        00000650
    /* ************************************************************ */  00000660
    /*                                                              */  00000670
    /* OPPTELINGS- OG LOOP-PARAMETRE M.M                            */  00000680
    /*                                                              */  00000690
    /* ************************************************************ */  00000700
                                                                        00000710
     DCL 1  W01_OPPTELL_OMR,                                            00000720
            2   W02_I              FIXED    BIN   (15)   INIT ( 0 ),    00000730
            2   W02_ÅR             FIXED    BIN   (15)   INIT ( 0 ),    00000740
            2   I                  FIXED    BIN   (15)   INIT ( 0 ),    00000750
            2   J                  FIXED    BIN   (15)   INIT ( 0 ),    00000760
            2   B                           CHAR  (1)    INIT (' ');    00000770
                                                                        00000780
    /* ************************************************************ */  00000790
    /*                                                              */  00000800
    /* DLI CALL-PARAMETRE                                           */  00000810
    /*                                                              */  00000820
    /* ************************************************************ */  00000830
                                                                        00000840
     DCL 1  W01_DLI_PARAM,                                              00000850
            2   W02_DLI_FUNC       CHAR (4)       INIT('    '),         00000860
            2   W02_GN             CHAR (4)       INIT('GN  '),         00000870
            2   W02_GU             CHAR (4)       INIT('GU  '),         00000880
            2   W02_GHNP           CHAR (4)       INIT('GHNP'),         00000890
            2   W02_GHU            CHAR (4)       INIT('GHU '),         00000900
            2   W02_DLET           CHAR (4)       INIT('DLET'),         00000910
            2   W02_REPL           CHAR (4)       INIT('REPL'),         00000920
            2   W02_ISRT           CHAR (4)       INIT ('ISRT'),        00000930
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT (3),             00000940
            2   W02_PARM_CT_4      FIXED BIN(31)  INIT (4),             00000950
            2   W02_PARM_CT_5      FIXED BIN(31)  INIT (5),             00000960
            2   W02_PARM_CT_6      FIXED BIN(31)  INIT (6),             00000970
            2   W02_PARM_CT_7      FIXED BIN(31)  INIT (7),             00000980
            2   W02_OUT_FELT       PIC '(11)9'    INIT (''),            00000990
            2   W02_DATO           PIC '(4)9'     INIT (''),            00001000
            2   W02_ST_OK          BIT (1)        INIT (''),            00001010
            2   NEI                BIT (1)        INIT ('0'B),          00001020
            2   W02_OUT2           CHAR (20)      INIT ('');            00001030
                                                                        00001040
     DCL    W01_IO                 CHAR (150)    INIT  ('');            00001050
     DCL    W01_HJELPE_IO          CHAR (150)    BASED (W01_HJELPE_PTR);00001060
                                                                        00001070
    %PAGE;                                                              00001080
    /* ************************************************************ */  00001090
    /*                                                              */  00001100
    /* DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */  00001110
    /*                                                              */  00001120
    /* ************************************************************ */  00001130
                                                                        00001140
     DCL    SSA_UQUAL                            CHAR (9) INIT ((9)' ');00001150
                                                                        00001160
     DCL 1  SSA1_RF0PERSN          UNALIGNED,                           00001170
            2    HDEL                            CHAR (17)  INIT        00001180
                 ('RF0PERSN(FNR     '),                                 00001190
            2    REL_OP                          CHAR (2)   INIT (' ='),00001200
            2    PKEY               FIXED        DEC  (11)  INIT ( 0 ), 00001210
            2    HP                              CHAR (1)   INIT (')'); 00001220
                                                                        00001230
     DCL 1  SSA1_STATUS            UNALIGNED,                           00001240
            2    HDEL                            CHAR (17)  INIT        00001250
                 ('STATUS  (STATKODE'),                                 00001260
            2    REL_OP                          CHAR (2)   INIT (' ='),00001270
            2    KODE                            CHAR (1)   INIT ('S'), 00001280
            2    HP                              CHAR (1)   INIT (')'); 00001290
                                                                        00001300
                                                                        00001310
    /* ************************************************************ */  00001320
    /*                                                              */  00001330
    /* ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */  00001340
    /*                                                              */  00001350
    /* ************************************************************ */  00001360
                                                                        00001370
    %INCLUDE DLIUIB;                                                    00001380
                                                                        00001390
     DCL                                                                00001400
         UIB_RC_OK                 BIT (8)       INIT( 0 );             00001410
                                                                        00001420
                                                                        00001430
    /* ************************************************************ */  00001440
    /*                                                              */  00001450
    /* PCB- OG UIB-OMR .                                            */  00001460
    /*                                                              */  00001470
    /* ************************************************************ */  00001480
                                                                        00001490
     %INCLUDE   P0012002;                /* PCB_UIB_PEKER_OMR BASED */  00001500
                                                                        00001510
     DCL 1  RF1                     BASED (RF1_PCB_PEKER),              00001520
     %INCLUDE   P0012003;                /*    PCB                 */   00001530
                                                                        00001540
                                                                        00001550
                                                                        00001560
    %PAGE;                                                              00001570
    /* ************************************************************ */  00001580
    /*                                                              */  00001590
    /*        SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .     */  00001600
    /*       ---------------------------------------------------    */  00001610
    /*                                                              */  00001620
    /*                                                              */  00001630
    /*        INITIERER FORSKJELLIGE PARAMETRE .                    */  00001640
    /*                                                              */  00001650
    /* ************************************************************ */  00001660
                                                                        00001670
    W01_DATE                             =       DATE;                  00001680
    PROGRAM_ID                           =      'R0019H50';             00001690
    UIBPTR                               =       UIB_PEKER;             00001700
                                                                        00001710
                                                                        00001720
    DO   W02_I  =  1  TO  14;                                           00001730
                                                                        00001740
      IF B02.FNR  (W02_I)           >    0                  THEN        00001750
         DO;                                                            00001760
            SSA1_RF0PERSN.PKEY      =    B02.FNR (W02_I);               00001770
                                                                        00001780
            IF B02.SPERRE (W02_I)   =    'J'                THEN        00001790
               DO;                                                      00001800
                  /* ********************************************* */   00001810
                  /*  NYE OPPLYSNINGER LEGGES INN I :  RF0PERSN    */   00001820
                  /* ********************************************* */   00001830
                                                                        00001840
                  CALL PLITDLI              (W02_PARM_CT_4,             00001850
                                             W02_GHU,                   00001860
                                             RF1,                       00001870
                                             W01_IO,                    00001880
                                             SSA1_RF0PERSN);            00001890
                                                                        00001900
                  IF UIBFCTR         ^=      UIB_RC_OK         THEN     00001910
                     DO;                                                00001920
                       /* ****************************************** */ 00001930
                       /*   UAKSEPTABEL KODE FRA :    UIB            */ 00001940
                       /* ****************************************** */ 00001950
  L100:                                                                 00001960
                       FEIL_MELD_NR     =     500;                      00001970
                       FEIL_VED_LABEL   =    '100';                     00001980
                       GO TO    L999;                                   00001990
                     END;                                               00002000
                                                                        00002010
                  W01_HJELPE_PTR  =  ADDR (B02.RF0PERSN (W02_I)) ;      00002020
                  W01_IO          =  W01_HJELPE_IO               ;      00002030
                                                                        00002040
                  SELECT (RF1.STATUS_KODE);                             00002050
                                                                        00002060
                    WHEN ('  ')                                         00002070
                      DO;                                               00002080
                        CALL PLITDLI              (W02_PARM_CT_3,       00002090
                                                   W02_REPL,            00002100
                                                   RF1,                 00002110
                                                   W01_IO);             00002120
                                                                        00002130
                        IF  UIBFCTR          ^=   UIB_RC_OK             00002140
                          ! RF1.STATUS_KODE  ^=   '  '        THEN      00002150
                          DO;                                           00002160
                            /* ********************************** */    00002170
                            /* UAKSEPTABEL KODE FRA :  UIB        */    00002180
                            /*                 RF1.STATUS_KODE    */    00002190
                            /* ********************************** */    00002200
  L110:                                                                 00002210
                            FEIL_MELD_NR    =     500;                  00002220
                            FEIL_VED_LABEL  =    '110';                 00002230
                            DB_STATUS_KODE  =     RF1.STATUS_KODE;      00002240
                            GO TO     L999;                             00002250
                          END;                                          00002260
                       END;                                             00002270
                                                                        00002280
                    WHEN ('GE')                                         00002290
                       DO;                                              00002300
                         /* **************************************** */ 00002310
                         /* EN DUMMY-ROT SKULLE EKSISTERT            */ 00002320
                         /* **************************************** */ 00002330
  L120:                                                                 00002340
                         FEIL_MELD_NR            =    501;              00002350
                         FEIL_VED_LABEL          =   '120';             00002360
                         DB_STATUS_KODE          =    RF1.STATUS_KODE;  00002370
                         GO TO     L999;                                00002380
                       END;                                             00002390
                                                                        00002400
                    OTHERWISE                                           00002410
                       DO;                                              00002420
                         /* ************************************* */    00002430
                         /*  UGYLDIG STATUSKODE FRA DLI           */    00002440
                         /* ************************************* */    00002450
  L130:                                                                 00002460
                         FEIL_MELD_NR            =    500;              00002470
                         FEIL_VED_LABEL          =   '130';             00002480
                         DB_STATUS_KODE          =    RF1.STATUS_KODE;  00002490
                         GO TO     L999;                                00002500
                      END;                                              00002510
                                                                        00002520
                  END;   /*     SELECT  :   RF1.STATUS_KODE     */      00002530
                                                                        00002540
               END;      /*     IF      :   B02.SPERRE (W02_I)  */      00002550
                                                                        00002560
                                                                        00002570
            /* ************************************************ */      00002580
            /* SKRIVER UT :    S I S T E   S T A T U S          */      00002590
            /* **************************************************/      00002600
                                                                        00002610
            B02.STATUS_KODE (W02_I)        =   'S';                     00002620
            SSA1_STATUS.KODE               =   'S';                     00002630
                                                                        00002640
            IF  B02.VIRK_DATO_ÅM(W02_I)    >    0    THEN               00002650
              DO;                                                       00002660
                CALL   P_SKRIV_STATUS_YTELSER;                          00002670
                                                                        00002680
                IF FEIL_MELD_NR         >    0    THEN                  00002690
                   GO TO L999;                                          00002700
              END;                                                      00002710
                                                                        00002720
         END;      /*   IF    FNR   >   0                  */           00002730
                                                                        00002740
    END;          /*   DO    I = 1  TO   14               */            00002750
                                                                        00002760
                                                                        00002770
                                                                        00002780
                                                                        00002790
    /* ************************************************************** */00002800
    /* ************************************************************** */00002810
    /* ********                                      **************** */00002820
    /* ********     INTERNE    PROCEDURER            **************** */00002830
    /* ********                                      **************** */00002840
    /* ************************************************************** */00002850
    /* ************************************************************** */00002860
                                                                        00002870
                                                                        00002880
                                                                        00002890
                                                                        00002900
    %PAGE;                                                              00002910
    /* ************************************************************** */00002920
    /*                                                                */00002930
    /* PROCEDURE FOR Å REPLACE             :  STATUS                  */00002940
    /*                                                                */00002950
    /* ************************************************************** */00002960
                                                                        00002970
    P_SKRIV_BARN_AV_ROT:                                                00002980
      PROC;                                                             00002990
                                                                        00003000
      CALL PLITDLI                              (W02_PARM_CT_5,         00003010
                                                 W02_GHU,               00003020
                                                 RF1,                   00003030
                                                 W01_IO,                00003040
                                                 SSA1_RF0PERSN,         00003050
                                                 SSA1_STATUS);          00003060
                                                                        00003070
      IF  UIBFCTR                          ^=   UIB_RC_OK  THEN         00003080
        DO;                                                             00003090
          /* ******************************************************** */00003100
          /*  UAKSEPTABEL KODE FRA  :   UIB                           */00003110
          /* ******************************************************** */00003120
  L140:                                                                 00003130
          FEIL_MELD_NR                      =   500;                    00003140
          FEIL_VED_LABEL                    =  '140';                   00003150
          GO   TO  RETUR;                                               00003160
        END;                                                            00003170
                                                                        00003180
      W01_IO                                =    W01_HJELPE_IO;         00003190
                                                                        00003200
      IF RF1.STATUS_KODE                    =    '  '             THEN  00003210
        DO;                                                             00003220
          /* ******************************************************** */00003230
          /*  STATUS FANTES FRA FØR . NY OPPLYSNINGER LEGGES INN .    */00003240
          /* ******************************************************** */00003250
                                                                        00003260
          CALL PLITDLI                          (W02_PARM_CT_3,         00003270
                                                 W02_REPL,              00003280
                                                 RF1,                   00003290
                                                 W01_IO);               00003300
                                                                        00003310
          IF  RF1.STATUS_KODE              ^=    '  '                   00003320
            ! UIBFCTR                      ^=   UIB_RC_OK  THEN         00003330
            DO;                                                         00003340
            /* **************************************************** */  00003350
            /*  UAKSEPTABEL KODE FRA  :   UIB                       */  00003360
            /*                            RF1.STATUS_KODE           */  00003370
            /* **************************************************** */  00003380
  L150:                                                                 00003390
            FEIL_MELD_NR              =   500;                          00003400
            FEIL_VED_LABEL            =  '150';                         00003410
            DB_STATUS_KODE            =   RF1.STATUS_KODE;              00003420
            GO TO     RETUR;                                            00003430
            END;                                                        00003440
        END;                                                            00003450
      ELSE                                                              00003460
        DO;                                                             00003470
          /* **************************************************** */    00003480
          /*  FEIL KODE VED KALL :   GHU                          */    00003490
          /* **************************************************** */    00003500
  L160:                                                                 00003510
          FEIL_MELD_NR              =   500;                            00003520
          FEIL_VED_LABEL            =  '160';                           00003530
          DB_STATUS_KODE            =   RF1.STATUS_KODE;                00003540
          GO TO     RETUR;                                              00003550
        END;                                                            00003560
                                                                        00003570
  RETUR:                                                                00003580
    END P_SKRIV_BARN_AV_ROT;                                            00003590
                                                                        00003600
                                                                        00003610
                                                                        00003620
    %PAGE;                                                              00003630
    /* ************************************************************** */00003640
    /*                                                                */00003650
    /* PROCEDURE FOR Å REPLACE             :  UNDERSEGM. TIL STATUS   */00003660
    /*                                                                */00003670
    /* ************************************************************** */00003680
                                                                        00003690
    P_SKRIV_BARN_AV_STATUS :                                            00003700
      PROC;                                                             00003710
                                                                        00003720
      CALL PLITDLI                              (W02_PARM_CT_4,         00003730
                                                 W02_GHNP,              00003740
                                                 RF1,                   00003750
                                                 W01_IO,                00003760
                                                 SSA_UQUAL);            00003770
                                                                        00003780
      IF  UIBFCTR                          ^=   UIB_RC_OK  THEN         00003790
        DO;                                                             00003800
          /* ******************************************************** */00003810
          /*  UAKSEPTABEL KODE FRA  :   UIB                           */00003820
          /* ******************************************************** */00003830
  L170:                                                                 00003840
          FEIL_MELD_NR                      =   500;                    00003850
          FEIL_VED_LABEL                    =  '170';                   00003860
          GO   TO  RETUR;                                               00003870
        END;                                                            00003880
                                                                        00003890
      W01_IO                                =    W01_HJELPE_IO;         00003900
                                                                        00003910
      SELECT   ( RF1.STATUS_KODE );                                     00003920
         WHEN  ( '  '            )                                      00003930
            DO;                                                         00003940
               /* ************************************************** */ 00003950
               /* SEGM.FANTES FRA FØR . NY OPPLYSNINGER LEGGES INN . */ 00003960
               /* ************************************************** */ 00003970
                                                                        00003980
               CALL PLITDLI                     (W02_PARM_CT_3,         00003990
                                                 W02_REPL,              00004000
                                                 RF1,                   00004010
                                                 W01_IO);               00004020
                                                                        00004030
               IF  RF1.STATUS_KODE         ^=    '  '                   00004040
                 ! UIBFCTR                 ^=    UIB_RC_OK  THEN        00004050
                 DO;                                                    00004060
                   /* ******************************************* */    00004070
                   /*  FEIL I KALL MOT DB                         */    00004080
                   /* ******************************************* */    00004090
  L180:                                                                 00004100
                   FEIL_MELD_NR             =   500;                    00004110
                   FEIL_VED_LABEL           =  '180';                   00004120
                   DB_STATUS_KODE           =   RF1.STATUS_KODE;        00004130
                   GO TO     RETUR;                                     00004140
                 END;                                                   00004150
            END;                                                        00004160
                                                                        00004170
        WHEN  ( 'GE')                                                   00004180
           DO;                                                          00004190
              /* **************************************************** */00004200
              /*  SEGM FANTES IKKE FRA FØR . NYTT LEGGES INN .        */00004210
              /* **************************************************** */00004220
                                                                        00004230
              CALL P_SKRIV_SEGM;                                        00004240
                                                                        00004250
              IF FEIL_MELD_NR          >   0                       THEN 00004260
                 GO TO     RETUR;                                       00004270
           END;                                                         00004280
                                                                        00004290
        OTHERWISE                                                       00004300
           DO;                                                          00004310
             /* **************************************************** */ 00004320
             /*  FEIL KODE VED KALL :   GHU                          */ 00004330
             /* **************************************************** */ 00004340
  L190:                                                                 00004350
             FEIL_MELD_NR              =   500;                         00004360
             FEIL_VED_LABEL            =  '190';                        00004370
             DB_STATUS_KODE            =   RF1.STATUS_KODE;             00004380
             GO TO     RETUR;                                           00004390
           END;                                                         00004400
     END;/*       SELECT   ( RF1:STATUS_KODE )                     */   00004410
                                                                        00004420
  RETUR:                                                                00004430
    END P_SKRIV_BARN_AV_STATUS;                                         00004440
                                                                        00004450
                                                                        00004460
                                                                        00004470
    %PAGE;                                                              00004480
    /* ************************************************************ */  00004490
    /*                                                              */  00004500
    /* PROCEDURE FOR A SKRIVE UNDERLIGGENDE SEGMENTER TIL           */  00004510
    /*                                                              */  00004520
    /* STATUS-SEGM.                                                 */  00004530
    /*                                                              */  00004540
    /* ************************************************************ */  00004550
                                                                        00004560
    P_SKRIV_SEGM:                                                       00004570
      PROC;                                                             00004580
                                                                        00004590
      CALL PLITDLI                         (W02_PARM_CT_6,              00004600
                                            W02_ISRT,                   00004610
                                            RF1,                        00004620
                                            W01_IO,                     00004630
                                            SSA1_RF0PERSN,              00004640
                                            SSA1_STATUS,                00004650
                                            SSA_UQUAL);                 00004660
                                                                        00004670
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=    UIB_RC_OK                   00004680
        !  RF1.STATUS_KODE            ^=   '  '    THEN                 00004690
        DO;                                                             00004700
           /* ******************************************************* */00004710
           /* UAKSEPTABEL KODE FRA   :      UIB                       */00004720
           /*                               RF1.STATUS_KODE           */00004730
           /* ******************************************************* */00004740
  L200:                                                                 00004750
           FEIL_MELD_NR                     =     500;                  00004760
           FEIL_VED_LABEL                   =    '200';                 00004770
           DB_STATUS_KODE                   =     RF1.STATUS_KODE;      00004780
        END;                                                            00004790
    END P_SKRIV_SEGM;                                                   00004800
                                                                        00004810
                                                                        00004820
    %PAGE;                                                              00004830
    %INCLUDE R0019H55; /* PROC. FOR Å SKRIVE : SISTE STATUS YTELSER  */ 00004840
                                                                        00004850
                                                                        00004860
  L999:                                                                 00004870
                                                                        00004880
    EXEC CICS RETURN;                                                   00004890
  END  R0019H5;                                                         00004900
