 /*       SIST ENDRET 11/02-97 10.43.35 AV   JDA7339                  */00000000
 /*       SIST ENDRET 07/11-95 11.05.25 AV   JDA0310                  */00000010
 /*       SIST ENDRET 13/10-95 12.25.52 AV   JDA0310                  */00000020
 /*       SIST ENDRET 12/10-95 14.05.08 AV   JDA0310                  */00000030
 /*       SIST ENDRET 27/06-95 16.51.28 AV   TSB0310                  */00000040
 /*       SIST ENDRET 31/10-94 15.32.48 AV   HLB0310                  */00000050
 /*       SIST ENDRET 25/07-94 13.53.28 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 16/03-94 07.14.53 AV   HERMAN                   */00000070
 /*       SIST ENDRET 25/02-94 12.57.50 AV   HERMAN                   */00000080
 /*       SIST ENDRET 22/11-91 08.45.54 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 13/11-91 13.46.04 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 26/04-91 13.10.33 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 06/03-91 14.11.24 AV   DYBVIK                   */00000120
 R00104:                                                                00000130
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000140
 %SKIP;                                /*  */                           00000150
 /******************************************************************* */00000160
 /*IDENTIFIKASJON:                                                    */00000170
 /************************                                            */00000180
 /*  PROGRAM-IDENT : R0010401-REGISTRERING NYE BLANKETTER-HOVEDPROGR. */00000190
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000200
 /*  PROGRAMMERER  : ?                                                */00000210
 /*  PROGRAMMET BLE LAGET  ?                                          */00000220
 /*  ENDRINGERSDATO : PROGRAMMET ER SPLITTET, SLIK AT DET LINKER      */00000230
 /*                   A401, B401 OG C401                              */00000240
 /******************************************************************* */00000250
 /*HENSIKT:*/                                                           00000260
 /************                                                        */00000270
 /*  PROGRAMMET ER MED I STYRINGEN AV MENYEN VED OPPSTARTINGEN        */00000280
 /*  AV FOLKETRYGDSYSTEMET OG ER DET FØRSTE PROGRAMMET UNDER          */00000290
 /*  REGISTRERING. PROGRAMMETS TRANSKODE ER R040 OG R041.             */00000300
 /*  PROGRAMMET BLIR AKTIVISERT NÅR OPERATØREN TASTER INN 'R' I       */00000310
 /*  FUNKSJONSKODE (MAP S001014 MAPSET S001013)                       */00000320
 /*  PROGRAMMET LESER INN STYRINGSKODEN, KONTROLLERER DEN             */00000330
 /*  OG SENDER UT DET FØRSTE BILDET AV DEN BLANKETTEN SOM SKAL        */00000340
 /*  REGISTRERES.                                                     */00000350
 /******************************************************************* */00000360
 /*PROGRAMTILKNYTTING:*/                                                00000370
 /**********************                                              */00000380
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSID = R040 OG R041.  */00000390
 /*  R040: KONTROLLEN KOMMER FRA R0010301                             */00000400
 /*  R041: KONTROLLEN KOMMER FRA                                      */00000410
 /*  PROGRAMMET GÅR VIA CICS TIL FORSKJELLIGE PROGRAMMER AVHENGIG     */00000420
 /*  HVILKEN STYRINGSKODE SOM BLIR SATT AV OPERATØREN ELLER           */00000430
 /*  ETTER BLANKETTKONTROLLEN TRANSKODE SATT AV PROGRAMMENE:          */00000440
 /*  AP - ALDERSPENSJON    - R050 - R0010501                          */00000450
 /*  A1 - ALDERSPENSJON                                               */00000460
 /*  UP - UFØREPENSJON     - R060 - R0010601                          */00000470
 /*  U2 - UFØREPENSJON     -                                          */00000480
 /*  U3 - UFØREPENSJON     -                                          */00000490
 /*  US - GR/HJ STØNAD     - R070 - R0010701                          */00000500
 /*  EP - ETTERLATT EK     - R080 - R0010801                          */00000510
 /*  E3 - ETTERLATT EK     -                                          */00000520
 /*  EF - ETTERLATT FP     - R090 - R0010901                          */00000530
 /*  E4 - ETTERLATT FP     -                                          */00000540
 /*  FB - FORELDRELØSE BARN- R100 - R0011001                          */00000550
 /*  F5 - FORELDRELØSE BARN-                                          */00000560
 /*  BP - ETTERLATTE  BARN - R110 - R0011101                          */00000570
 /*  B6 - ETTERLATTE  BARN -                                          */00000580
 /*  FT - FORSØRGINGSTILL. - R120 - R0011201                          */00000590
 /*  F7 - FORSØRGINGSTILL. -                                          */00000600
 /*  FO - FORSØRGINGSTILL. -                                          */00000610
 /*  TG - TILLEGGSBLANKETT - R130 - R0011301                          */00000620
 /*  E1 - ENDRINGSBLANK-1  - R140 - R0011401                          */00000630
 /*  EN - ENDRINGSBLANK-1  -                                          */00000640
 /*  E2 - ENDRINGSBLANK-2  - R150 - R0011501                          */00000650
 /*  O1 - OPPHØRSBLANK-1   - R160 - R0011601                          */00000660
 /*  O2 - OPPHØRSBLANK-2   - R170 - R0011701                          */00000670
 /*  AU - STYRT AUTOHEND   - R180 - R0011801                          */00000680
 /*  NI - NYE INNTEKTER    - R0I4 - R001????                          */00000690
 /*  MK - MEDISINSK KODE   - RB00 - R001B001                          */00000700
 /*  AF -AFP               - R190 - R0011901                          */00000710
 /*  UF -UNGE UFØRE FØR 1967 R183 - R0011831                          */00000720
 /*  UF - UNGE UF   FØR 1967 R183 - R0011831                          */00000730
 /*  XX - NY FUNKSJONSKODE - R030 - R0010301                          */00000740
 /*                          R042 - R0012001 -FEILFRI BLANKETT        */00000750
 /*                                                                   */00000760
 /******************************************************************* */00000770
 /*DATASETTOPPLYSNINGER:                                              */00000780
 /*************************                                           */00000790
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000800
 /*                                                                   */00000810
 /******************************************************************* */00000820
 /*FEILMELDINGER:*/                                                     00000830
 /*********************                                               */00000840
 /* 'UGYLDIG STYREKODE' BLIR SKREVET PÅ SKJERMBILDET NÅR STYRINGSKODE */00000850
 /*  IKKE HAR GYLDIG VERDI                                            */00000860
 /*                                                                   */00000870
 /* ***************************************************************** */00000880
 %PAGE;                                                                 00000890
      %INCLUDE S00101;     /*  MENY MAPSETTET  */                       00000900
 %PAGE;                                                                 00000910
 %PAGE;                                                                 00000920
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */            00000930
 %PAGE;                                                                 00000940
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                    00000950
 %PAGE;                                                                 00000960
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */               00000970
 %PAGE;                                                                 00000980
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */              00000990
 %PAGE;                                                                 00001000
      %INCLUDE P0019959;   /*  OMRAADE FOR FUNKTAB      */              00001010
 %PAGE;                                                                 00001020
      %INCLUDE DFHBMSCA;   /*  MAP HJELPEFELT           */              00001030
 %PAGE;                                                                 00001040
   DCL                                                                  00001050
      (COMMAREA_PEKER,IDENT_PEKER,                                      00001060
      BMSMAPBR)      PTR;                                               00001070
   DCL                                                                  00001080
      IDENT_BIT BIT(32) BASED (IDENT_PEKER);                            00001090
   DCL                                                                  00001100
      (DATE,NULL,CSTG,ADDR,SUBSTR,STG) BUILTIN;                         00001110
   DCL DATO     PIC '(6)9' INIT (0);                                    00001120
   DCL                                                                  00001130
      HJ2_DATO_ÅMD   PIC '(6)9',                                        00001140
                                                                        00001150
      HJ2_ÅR DEF HJ2_DATO_ÅMD  POS (1) PIC '(2)9',                      00001160
                                                                        00001170
      HJ1_DATO_MÅ    PIC '(6)9',                                        00001180
                                                                        00001190
      HJ1_ÅR DEF HJ1_DATO_MÅ   POS (3) PIC '(2)9';                      00001200
                                                                        00001210
                                                                        00001220
  KOM_OMR.PEKER_LISTE.STYRINGS_PEKER    = ADDR(KOM_OMR.STYRINGS_OMR)   ;00001230
  KOM_OMR.PEKER_LISTE.TRANS_PEKER       = ADDR(KOM_OMR.TRANS_OMR)      ;00001240
  KOM_OMR.PEKER_LISTE.TRANS_LISTE_PEKER = ADDR(KOM_OMR.TRANS_LISTE_OMR);00001250
  KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER   = ADDR(KOM_OMR.DIV_PARAM_OMR)  ;00001260
  KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER  = ADDR(KOM_OMR.TRANS_OPPL_OMR) ;00001270
                                                                        00001280
                                                                        00001290
  EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                            00001300
  DATO        = DATE;                                                   00001310
                                                                        00001320
                                                                        00001330
  IF TRANSKODE = 'R040' THEN                                            00001340
     DO;                                                                00001350
         EXEC CICS RECEIVE MAP('S001014') MAPSET ('S001013')            00001360
                                                   SET(BMSMAPBR);       00001370
                                                                        00001380
            /* LESER SKJERMBILDE MED STYRINGSKODE  */                   00001390
                                                                        00001400
            IF S001014I.STYRE_KODEL > 0 THEN                            00001410
               STYREKODE = S001014I.STYRE_KODEI;                        00001420
     END;                                                               00001430
  SELECT(TRANSKODE);                                                    00001440
    WHEN('R040','R041')                                                 00001450
    DO;                                                                 00001460
            /* INITIERING AV DIV STYREPARAMETRE     */                  00001470
                                                                        00001480
       DIV_PERIODE                   = '' ;                             00001490
       DIV_PARAM_OMR.FRA_CICS        = '1'B;                            00001500
       DIV_PARAM_OMR.HENT_FRAM_MAP   = '0'B;                            00001510
       DIV_PARAM_OMR.FRA_MED_DIALOG  = '0'B;                            00001520
       DIV_PARAM_OMR.FRA_UTEN_DIALOG = '0'B;                            00001530
       STYRINGS_OMR.FUNKSJONSKODE    = 'R';                             00001540
                                                                        00001550
       KOM_OMR.PCB_UIB_PEKER = NULL;                                    00001560
                                                                        00001570
                                                                        00001580
       IF SUBSTR(DIV_PARAM_OMR.CICS_NAVN,1,4) =   'HELP'     THEN       00001590
          DO;                                                           00001600
             IF STYREKODE = 'US'  THEN                                  00001610
                    EXEC CICS XCTL PROGRAM('R001A401')                  00001620
                                                    COMMAREA (KOM_OMR); 00001630
             ELSE                                                       00001640
             IF STYREKODE = 'XX'  THEN                                  00001650
                  DO;                                                   00001660
                     TRANSKODE = 'R030';                                00001670
                     ALLOCATE S001013O ;                                00001680
                     S001013O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;    00001690
                                                                        00001700
                     /* SKRIVER SKJERMBILDET FOR REGISTRERING AV NY  */ 00001710
                     /* FUNKSJONSKODE                                */ 00001720
                                                                        00001730
                     EXEC CICS SEND MAP('S001013') MAPSET('S001013')    00001740
                                                   ERASE ;              00001750
                  END;                                                  00001760
             ELSE                                                       00001770
                DO;                                                     00001780
                   S001014O.CICS_INFOO =  DIV_PARAM_OMR.CICS_NAVN ;     00001790
                   S001014O.MELDINGO    =                               00001800
                       ' BLANKET KAN IKKE  REGISTERE MED *HELP* KODE';  00001810
                   S001014O.STYRE_KODEO = STYREKODE;                    00001820
                   EXEC CICS SEND MAP('S001014')                        00001830
                                          MAPSET('S001013')  ERASE;     00001840
                                                                        00001850
                   TRANSKODE = 'R040';                                  00001860
                END;                                                    00001870
                                                                        00001880
          END;                                                          00001890
                                                                        00001900
       ELSE                                                             00001910
          DO;                                                           00001920
            SELECT(STYREKODE);                                          00001930
                                                                        00001940
               WHEN('US')                                               00001950
                  DO;                                                   00001960
                      S001014O.CICS_INFOO =                             00001970
                                         DIV_PARAM_OMR.CICS_NAVN ;      00001980
                      S001014O.MELDINGO    =                            00001990
                       ' US BLANKET MÅ REGISTERE MED *HELP* KODE';      00002000
                      S001014O.STYRE_KODEO = STYREKODE;                 00002010
                      EXEC CICS SEND MAP('S001014')                     00002020
                                          MAPSET('S001013')  ERASE;     00002030
                                                                        00002040
                      TRANSKODE = 'R040';                               00002050
                                                                        00002060
                  END;                                                  00002070
                                                                        00002080
               WHEN('AP','US','EP','EF','FB','BP','FT','TG',            00002090
                    'E1','E2','O1','O2','AU','NI','MK','AF','UF','UP')  00002100
                  DO;                                                   00002110
                     EXEC CICS XCTL PROGRAM('R001A401')                 00002120
                                                    COMMAREA (KOM_OMR); 00002130
                                                                        00002140
                  END;                                                  00002150
               WHEN('A1','U2','E3','E4','B6','F5','F7')                 00002160
                  DO;                                                   00002170
                     EXEC CICS XCTL PROGRAM('R001B401')                 00002180
                                                    COMMAREA (KOM_OMR); 00002190
                                                                        00002200
                  END;                                                  00002210
         /*    WHEN('U3','FO','EN','EE','KF')      */                   00002220
               WHEN('U3','FO','EN','KF')                                00002220
                  DO;                                                   00002230
                     EXEC CICS XCTL PROGRAM('R001C401')                 00002240
                                                    COMMAREA (KOM_OMR); 00002250
                                                                        00002260
                  END;                                                  00002270
               WHEN('XX')                                               00002280
                  DO;                                                   00002290
                     TRANSKODE = 'R030';                                00002300
                     ALLOCATE S001013O ;                                00002310
                     S001013O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;    00002320
                                                                        00002330
                     /* SKRIVER SKJERMBILDET FOR REGISTRERING AV NY  */ 00002340
                     /* FUNKSJONSKODE                                */ 00002350
                                                                        00002360
                     EXEC CICS SEND MAP('S001013') MAPSET('S001013')    00002370
                                                   ERASE ;              00002380
                  END;                                                  00002390
               OTHERWISE                                                00002400
                  DO;                                                   00002410
                     /* FEILMELDING 'UGYLDIG STYREKODE' SKRIVES */      00002420
                     IF TRANSKODE > 'R040' THEN                         00002430
                       DO;                                              00002440
                         EXEC CICS SEND MAP ('S001014') MAPSET          00002450
                         ('S001013') MAPONLY SET(BMSMAPBR);             00002460
                         ALLOCATE S001014O;                             00002470
                       END;                                             00002480
                     S001014O.CICS_INFOO  = DIV_PARAM_OMR.CICS_NAVN ;   00002490
                     S001014O.MELDINGO    = 'UGYLDIG STYREKODE';        00002500
                     S001014O.STYRE_KODEO = STYREKODE;                  00002510
                     EXEC CICS SEND MAP('S001014') MAPSET('S001013')    00002520
                     ERASE;                                             00002530
                     TRANSKODE = 'R040';                                00002540
                  END;                                                  00002550
                                                                        00002560
            END;                   /* END  SELECT                    */ 00002570
                                                                        00002580
          END;                   /* END ELSE DO                      */ 00002590
                                                                        00002600
    END;                  /*  END      TRANSKODE  'R040','R041'      */ 00002610
                                                                        00002620
    WHEN('R042')                                                        00002630
    DO;                                                                 00002640
               IF STYREKODE ^= 'E2' &                                   00002650
                  STYREKODE ^= 'NI' THEN                                00002660
                  DO;                                                   00002670
                     HJ1_DATO_MÅ  = VIRKNINGSDATO;                      00002680
                     HJ2_DATO_ÅMD = DATE;                               00002690
                                                                        00002700
                     IF (HJ2_ÅR - HJ1_ÅR) > 8 THEN                      00002710
                        TRANSKODE = 'R201';                             00002720
                     ELSE                                               00002730
                        TRANSKODE = 'R200';                             00002740
                  END;                                                  00002750
               ELSE                                                     00002760
                  TRANSKODE = 'R200';                                   00002770
                                                                        00002780
               EXEC CICS XCTL PROGRAM('R0012001') COMMAREA(KOM_OMR);    00002790
                                                                        00002800
               /* VIA CICS TIL STYRING-AV-BEHANDLE-TRANS  */            00002810
    END;                                                                00002820
   OTHERWISE                                                            00002830
    DO;                                                                 00002840
               /* FEILMELDING 'UGYLDIG TRANSKODE' SKRIVES */            00002850
               EXEC CICS SEND MAP ('S001014') MAPSET                    00002860
                                    ('S001013') MAPONLY SET(BMSMAPBR);  00002870
               ALLOCATE S001014O;                                       00002880
               S001014O.MELDINGO = 'UGYLDIG TRANSKODE: ' !! TRANSKODE;  00002890
               S001014O.STYRE_KODEO = STYREKODE;                        00002900
               S001014O.CICS_INFOO  = DIV_PARAM_OMR.CICS_NAVN;          00002910
                                                                        00002920
               EXEC CICS SEND MAP('S001014') MAPSET('S001013')          00002930
                                                                ERASE;  00002940
               TRANSKODE = 'R040';                                      00002950
    END;                                                                00002960
 END;                   /* * * * * END SELECT STYREKODE    */           00002970
                                                                        00002980
      EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);            00002990
                                                                        00003000
   FEILBEH:                                                             00003010
      TRANSKODE = 'R030';                                               00003020
      ALLOCATE S001013O ;                                               00003030
      S001013O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                   00003040
                                                                        00003050
      EXEC CICS SEND MAP('S001013') MAPSET('S001013')                   00003060
                                                    MAPONLY ERASE;      00003070
                                                                        00003080
      /* SKRIVER SKJERMBILDET FOR REGISTRERING AV NY  */                00003090
      /* FUNKSJONSKODE                                */                00003100
                                                                        00003110
      EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);            00003120
                                                                        00003130
 %INCLUDE R0019960;   /*  F_CICSINFO   */                               00003140
 %PAGE;                                                                 00003150
 END R00104;                                                            00003160
