 /*       SIST ENDRET 12/07-91 12.32.54 AV   DYBVIK                   */00000000
 /*-------------------------------------------------------*/            00000010
 /* PROGRAM OPPDATERER FILEN P266.ARSKTR.TKREG89 I BATCH  */            00000020
 /*-------------------------------------------------------*/            00000030
                                                                        00000040
 R001TKO: PROC OPTIONS (MAIN);                                          00000050
                                                                        00000060
                                                                        00000070
    DCL (VERIFY , SUBSTR , MAX , INDEX , ADDR , DATE, ONCODE) BUILTIN;  00000080
                                                                        00000090
    DCL TKREG89 FILE RECORD OUTPUT;                                     00000100
                                                                        00000110
    DCL 1 TKREG89_REC,                                                  00000120
          5 TKNR        PIC '( 4)9',                                    00000130
          5 POSTADR     CHAR (20),                                      00000140
          5 P_POSTNR    PIC '( 4)9',                                    00000150
          5 BL1         CHAR (26),                                      00000160
          5 TLF         CHAR (14),                                      00000170
          5 BL2         CHAR (12);                                      00000180
                                                                        00000190
    DCL TKLISTE FILE RECORD SEQUENTIAL INPUT ENV (VSAM);                00000200
                                                                        00000210
    DCL 1 TKLISTE_REC,                                                  00000220
          5 TKNR        PIC '( 4)9',                                    00000230
          5 TKNAVN      CHAR (23),                                      00000240
          5 ADR1        CHAR (20),                                      00000250
          5 POSTNR      PIC '( 4)9',                                    00000260
          5 POSTNAVN    CHAR (17),                                      00000270
          5 TK_SJEF     CHAR (25),                                      00000280
          5 TLF         CHAR (12),                                      00000290
          5 TELEFAX     CHAR (13),                                      00000300
          5 INNBYGG     PIC '( 6)9',                                    00000310
          5 MÅLFORM     CHAR ( 1);                                      00000320
                                                                        00000330
    DCL EOF   BIT (1) INIT ('0'B);                                      00000340
                                                                        00000350
                                                                        00000360
 /* SLUTT PÅ DEKLARASJON */                                             00000370
 /*----------------------*/                                             00000380
                                                                        00000390
    ON ERROR BEGIN;                                                     00000400
       ON ERROR SYSTEM;                                                 00000410
          PUT SKIP LIST('FEIL I BEHANDLING TK: ', TKLISTE_REC.TKNR);    00000420
       END;                                                             00000430
                                                                        00000440
    ON ENDFILE (TKLISTE)                                                00000450
       EOF = '1'B;                                                      00000460
                                                                        00000470
    OPEN FILE (TKLISTE);                                                00000480
    OPEN FILE (TKREG89);                                                00000490
                                                                        00000500
    TKLISTE_REC = '';                                                   00000510
                                                                        00000520
    READ FILE (TKLISTE) INTO (TKLISTE_REC);                             00000530
                                                                        00000540
    DO WHILE (^EOF);                                                    00000550
                                                                        00000560
      IF (TKLISTE_REC.TKNR >= 0101) & (TKLISTE_REC.TKNR <= 2101) THEN   00000570
         DO;                                                            00000580
            TKREG89_REC          = '';                                  00000590
                                                                        00000600
            TKREG89_REC.TKNR     = TKLISTE_REC.TKNR;                    00000610
            TKREG89_REC.POSTADR  = TKLISTE_REC.ADR1;                    00000620
            TKREG89_REC.P_POSTNR = TKLISTE_REC.POSTNR;                  00000630
                                                                        00000640
            IF SUBSTR (TKLISTE_REC.TLF,3,1) = ' ' THEN                  00000650
               TKREG89_REC.TLF   = '('                         !!       00000660
                                   SUBSTR(TKLISTE_REC.TLF,1,2) !!       00000670
                                   ')'                         !!       00000680
                                   SUBSTR(TKLISTE_REC.TLF,3,9)   ;      00000690
            ELSE                                                        00000700
               TKREG89_REC.TLF   = '('                         !!       00000710
                                   SUBSTR(TKLISTE_REC.TLF,1,3) !!       00000720
                                   ')'                         !!       00000730
                                   SUBSTR(TKLISTE_REC.TLF,4,7)   ;      00000740
                                                                        00000750
            WRITE FILE (TKREG89) FROM (TKREG89_REC);                    00000760
                                                                        00000770
         END;                                                           00000780
                                                                        00000790
      TKLISTE_REC = '';                                                 00000800
                                                                        00000810
      READ FILE (TKLISTE) INTO (TKLISTE_REC);                           00000820
                                                                        00000830
    END; /*  OF WHILE  */                                               00000840
                                                                        00000850
                                                                        00000860
    CLOSE FILE (TKLISTE);                                               00000870
    CLOSE FILE (TKREG89);                                               00000880
                                                                        00000890
                                                                        00000900
 END;                                                                   00000910
