 /*       SIST ENDRET 28/07-98 12.50.50 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/07-98 12.27.24 AV   JDA7339                  */00000010
 /*       SIST ENDRET 13/03-98 13.34.44 AV   JDA7339                  */00000020
 /*       SIST ENDRET 13/03-98 13.19.51 AV   JDA7339                  */00000030
 /*       SIST ENDRET 05/12-97 12.38.53 AV   JDA7339                  */00000040
 /*       SIST ENDRET 27/11-97 11.46.44 AV   JDA7339                  */00000050
 /*       SIST ENDRET 28/07-97 12.31.13 AV   HLA7339                  */00000060
 /*       SIST ENDRET 09/01-96 08.47.41 AV   JDA0310                  */00000070
 /*       SIST ENDRET 18/07-95 14.22.33 AV   HLB0310                  */00000080
 /*       SIST ENDRET 26/09-94 11.12.11 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 05/09-94 10.01.24 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 28/07-94 13.21.28 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 25/02-94 13.05.35 AV   HERMAN                   */00000120
 /*       SIST ENDRET 26/04-91 12.29.59 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 21/01-91 14.07.38 AV   DYBVIK                   */00000140
 /* **************************************************************** */ 00000150
 /*IDENTIFIKASJON:                                                   */ 00000160
 /*    R001N520 - PROSEDYRE I PLI   - HOVEDPROGRAM                   */ 00000170
 /*                                                                  */ 00000180
 /* **************************************************************** */ 00000190
 /* **************************************************************** */ 00000200
 /*HENSIKT:                                                          */ 00000210
 /*    KONTROLLERE A1TRANS MOT STATUS FAMILIEFORHOLD.                */ 00000220
 /*    RUTINEN KONTROLLERER ALLE PERSONER I TRANSAKSJONEN MOT        */ 00000230
 /*    INFORMASJON I REGISTERET. FOR HVER FAMILIEPERSON SOM GÅR      */ 00000240
 /*    FEILFRI GJENNOM KONTROLLENE BLIR DET OPPRETTET NY STATUS      */ 00000250
 /*    FOR PERSONEN, OG SØKERENS STATUS OPPDATERES.                  */ 00000260
 /*PROGRAMTILKNYTNING:                                               */ 00000270
 /*    KALLES OPP AV PROGRAM R0013520                                */ 00000280
 /*BRUK:                                                             */ 00000290
 /*    EXEC CICS XCTL PROGRAM ('R001N520') COMMAREA (KOM_OMR)        */ 00000300
 /*                                                                  */ 00000310
 /* **************************************************************** */ 00000320
 %PAGE;                                                                 00000330
  KON_A1:                                                               00000340
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000350
 %SKIP;                                                                 00000360
      %INCLUDE P0019908;                                                00000370
      %INCLUDE P0019906;                                                00000380
      %INCLUDE P001N501;                                                00000390
      %INCLUDE P0019910;                                                00000400
      %INCLUDE P0019912;                                                00000410
 %PAGE;                                                                 00000420
      DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                    00000430
      DCL  COMMAREA_PEKER PTR;                                          00000440
 %PAGE;                                                                 00000450
      DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                    00000460
 %PAGE;                                                                 00000470
   DCL                                                                  00000480
      BARN_IND            FIXED BIN          (15),                      00000490
      IND                 FIXED BIN          (15),                      00000500
      I                   FIXED BIN          (15),                      00000510
      J                   FIXED BIN          (15),                      00000520
      ( DATE , CSTG  )    BUILTIN,                                      00000530
      DATO_ÅMD            CHAR                 (6),                     00000540
      DAGENS_DATO_ÅM DEF DATO_ÅMD POS(1) PIC '9999',                    00000550
      DAGENS_DATO_DAG DEF DATO_ÅMD POS(5) PIC '99',                     00000560
      DAGENS_DATO_1MND DEF DATO_ÅMD POS(3) PIC'99',                     00000570
      DAGENS_DATO_1ÅR  DEF DATO_ÅMD POS(1) PIC'99',                     00000580
      TILLEGG             PIC                  '9',                     00000590
      SISTE_UTTAKSDATO_ÅM DEC FIXED            (4),                     00000600
      HJ_VIRK_DATO_ÅM     PIC               '(4)9',                     00000610
      MAX BUILTIN;                                                      00000620
   DCL                                                                  00000630
      T_FNR               PIC              '(11)9';                     00000640
   DCL                                                                  00000650
      1 NR DEF T_FNR,                                                   00000660
         2 DG             PIC                 '99',                     00000670
         2 MN             PIC                 '99',                     00000680
         2 ÅR             PIC                 '99',                     00000690
         2 PERSNR,                                                      00000700
            3 ÅRHUNDRE    PIC                '999',                     00000710
            3 REST        PIC                 '99';                     00000720
   DCL                                                                  00000730
      SEKSTISJU_ÅRSDATO   PIC               '(4)9';                     00000740
   DCL                                                                  00000750
      SEKSTISJU_ÅR DEF                                                  00000760
      SEKSTISJU_ÅRSDATO POS(1)      PIC     '(2)9';                     00000770
   DCL                                                                  00000780
      SEKSTISJU_MN DEF                                                  00000790
      SEKSTISJU_ÅRSDATO POS(3)      PIC     '(2)9';                     00000800
   DCL                                                                  00000810
      STATUS_TYPE_SØKER   CHAR(1);                                      00000820
 %PAGE;                                /*    */                         00000830
                                                                        00000840
 /* **************************************************************** */ 00000850
 /* PROGRAMMET STARTER HER.                                          */ 00000860
 /* **************************************************************** */ 00000870
                                                                        00000880
      PROGRAM_ID = 'R001N520';                                          00000890
      IND        = 0;                                                   00000900
      T_FNR           = A1S.FNR;                                        00000910
      HJ_VIRK_DATO_ÅM = F_SNU_DATO(TRANS_OMR.VIRK_DATO_MÅ);             00000920
 %SKIP;                                                                 00000930
                                                                        00000940
  /*TEST*/                                                              00000950
  DCL PRETT20   CHAR (1);                                               00000960
  PRETT20 = B01.PENSJONSRETT_FØR_91(SØKER_IND);                         00000970
  PRETT20 = ' ';                                                        00000980
  PRETT20 = B02.PENSJONSRETT_FØR_91(SØKER_IND);                         00000990
  /*TEST TIL HIT TRUDE */                                               00001000
 /* **************************************************************** */ 00001010
 /*  REGNER UT ÅR OG MND VEDKOMMENDE FYLLER 67 ÅR (ÅÅMM). SIFFER     */ 00001020
 /*  7-9 ANGIR ÅRHUNDRE: 1800-TALLET 500-749, 1900-TALLET 000-499    */ 00001030
 /* **************************************************************** */ 00001040
                                                                        00001050
      IF ÅRHUNDRE <= '499' THEN                                         00001060
         DO;                                                            00001070
            SEKSTISJU_ÅRSDATO = (ÅR + 67) * 100 + MN;                   00001080
            IF HJ_VIRK_DATO_ÅM > 9100 THEN                              00001090
               DO;                                                      00001100
                  IF SEKSTISJU_MN = 12      &                           00001110
                     HJ_VIRK_DATO_ÅM < 9810 THEN    /*9807*/            00001120
  /*FOR NYE SAKER SKAL OPPHØRSDATO I UP IKKE VÆRE JANUAR */             00001130
                     DO;                                                00001140
                        SEKSTISJU_MN = 1;                               00001150
                        SEKSTISJU_ÅR = SEKSTISJU_ÅR + 1;                00001160
                     END;                                               00001170
                  ELSE                                                  00001180
                     SEKSTISJU_MN = SEKSTISJU_MN + 1;                   00001190
               END;                                                     00001200
         END;                                                           00001210
      ELSE                                                              00001220
         SEKSTISJU_ÅRSDATO = ((ÅR + 67) - 100) * 100 + MN;              00001230
                                                                        00001240
 %SKIP(2);                                                              00001250
      SISTE_UTTAKSDATO_ÅM =                                             00001260
      MAX(B01.ALDERSP.UTTAKSDATO_ÅM(SØKER_IND),                         00001270
                       B01.VENTØVR.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,1),   00001280
                       B01.VENTØVR.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,2),   00001290
                       B01.VENTØVR.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,3),   00001300
                       B01.VENTØVR.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,4),   00001310
                       B01.VENTØVR.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,5));  00001320
 %PAGE;                                /*     */                        00001330
      TRANSTYPE = 1;                                                    00001340
      DATO_ÅMD  = DATE;                                                 00001350
 /*   IF DAGENS_DATO_DAG > 19 THEN            */                        00001360
         TILLEGG = 2;                                                   00001370
 /*   ELSE                                    */                        00001380
 /*      TILLEGG = 1;                         */                        00001390
      DAGENS_DATO_1MND = DAGENS_DATO_1MND + TILLEGG;                    00001400
      IF DAGENS_DATO_1MND > 12 THEN                                     00001410
         DO;                                                            00001420
             DAGENS_DATO_1MND = DAGENS_DATO_1MND - 12;                  00001430
             DAGENS_DATO_1ÅR  = DAGENS_DATO_1ÅR  + 1;                   00001440
         END;                                                           00001450
      IF HJ_VIRK_DATO_ÅM > DAGENS_DATO_ÅM THEN                          00001460
        DO;                                                             00001470
  L100:                                                                 00001480
           FEIL_VED_LABEL = '100';                                      00001490
           FEIL_MELD_NR   = 10;                                         00001500
           GO TO L999;                                                  00001510
        END;                                                            00001520
                                                                        00001530
                                                                        00001540
 /* **************************************************************** */ 00001550
 /* DERSOM SØKER HAR PENSJONSSTATUS.                                 */ 00001560
 /* **************************************************************** */ 00001570
                                                                        00001580
                                                                        00001590
 /* 9/1-85      KARIN     */                                            00001600
                                                                        00001610
      STATUS_TYPE_SØKER = STATUS_TYPE;                                  00001620
                                                                        00001630
 /* 9/1-85      KARIN     */                                            00001640
      IF STATUS_TYPE_SØKER  = 'B' !                                     00001650
         STATUS_TYPE_SØKER  = 'D' !                                     00001660
         STATUS_TYPE_SØKER  = 'G' THEN                                  00001670
         DO;                                                            00001680
            /* *********************************************** */       00001690
            /* ETTERFØLGENDE TESTER GJELDER DISSE STATUS-TYPER */       00001700
            /* - B - BYGGER PÅ SISTE STATUS                    */       00001710
            /* - D - BYGGER PÅ NEST SISTE STATUS               */       00001720
            /* - G - BYGGER PÅ NEST SISTE STATUS, ER OPPHØRT   */       00001730
            /*       I SISTE STATUS MED X (IKKE DØD)           */       00001740
            /* *********************************************** */       00001750
            IF B01.TKNR(SØKER_IND) > 0 THEN                             00001760
               IF B01.TKNR(SØKER_IND) ^= A1S.TKNR &                     00001770
                  B01.SIVILSTAND(SØKER_IND) ^= 'A' THEN                 00001780
                  DO;                                                   00001790
  L110:                                                                 00001800
                     FEIL_VED_LABEL = '110';                            00001810
                     FEIL_MELD_NR   = 1702;                             00001820
                     GO TO L999;                                        00001830
                  END;                                                  00001840
            IF SISTE_UTTAKSDATO_ÅM > HJ_VIRK_DATO_ÅM THEN               00001850
               DO;                                                      00001860
  L120:                                                                 00001870
                  FEIL_VED_LABEL = '120';                               00001880
                  FEIL_MELD_NR   = 1703;                                00001890
                  GO TO L999;                                           00001900
               END;                                                     00001910
 /*         IF HJ_VIRK_DATO_ÅM > SEKSTISJU_ÅRSDATO THEN                 00001920
               IF B01.PENSJONSTYPE1(SØKER_IND)    ^= 'A' &              00001930
                  B01.PENSJONSTYPE1(SØKER_IND)    ^= 'G'    THEN        00001940
                  DO                                                    00001950
  L130:                                                                 00001960
                     FEIL_VED_LABEL = '130'                             00001970
                     FEIL_MELD_NR   = 1704                              00001980
                     GO TO L999                                         00001990
                  END                                                   00002000
 */                                                                     00002010
                                                                        00002020
 /* *************************************************************** */  00002030
 /* DERSOM DET ER EN EKTEFELLE I TRANSEN.                           */  00002040
 /* *************************************************************** */  00002050
                                                                        00002060
            IF A1S.FNR_EK > 0 THEN                                      00002070
               DO;                                                      00002080
                  SELECT ( B01.SIVILSTAND(SØKER_IND));                  00002090
                                                                        00002100
 /* *************************************************************** */  00002110
 /* DERSOM SØKERS SIVILSTAND ER UGIFT.                              */  00002120
 /* *************************************************************** */  00002130
                                                                        00002140
                     WHEN ('U')                                         00002150
                        DO;                                             00002160
  L140:                                                                 00002170
                           FEIL_VED_LABEL = '140';                      00002180
                           FEIL_MELD_NR   = 1001;                       00002190
                           GO TO L999;                                  00002200
                        END;                                            00002210
                                                                        00002220
 /* *************************************************************** */  00002230
 /* DERSOM SØKER ER SKILT.                                          */  00002240
 /* *************************************************************** */  00002250
                                                                        00002260
                     WHEN ('S')                                         00002270
                        DO;                                             00002280
  L150:                                                                 00002290
                           FEIL_VED_LABEL = '150';                      00002300
                           FEIL_MELD_NR   = 1002;                       00002310
                           GO TO L999;                                  00002320
                        END;                                            00002330
                                                                        00002340
 /* *************************************************************** */  00002350
 /* DERSOM SØKER ER ETTERLATT.                                      */  00002360
 /* *************************************************************** */  00002370
                                                                        00002380
                     WHEN ('E')                                         00002390
                        DO;                                             00002400
  L160:                                                                 00002410
                           FEIL_VED_LABEL = '160';                      00002420
                           FEIL_MELD_NR   = 1003;                       00002430
                           GO TO L999;                                  00002440
                        END;                                            00002450
                                                                        00002460
 /* *************************************************************** */  00002470
 /* ELLERS ER SØKEREN GIFT.                                         */  00002480
 /* *************************************************************** */  00002490
                                                                        00002500
                     OTHERWISE                                          00002510
                        DO;                                             00002520
                                                                        00002530
 /* *************************************************************** */  00002540
 /* DERSOM DET ER EN ANNEN EKTEFELLE I SØKERENS PESTATUS.           */  00002550
 /* *************************************************************** */  00002560
                                                                        00002570
                           IF B01.FNR(EKTEF_IND) ^= A1S. FNR_EK         00002580
                           THEN                                         00002590
                              DO;                                       00002600
  L170:                                                                 00002610
                                 FEIL_VED_LABEL = '170';                00002620
                                 FEIL_MELD_NR   = 1004;                 00002630
                                 GO TO L999;                            00002640
                              END;                                      00002650
                           ELSE                                         00002660
                                                                        00002670
 /* *************************************************************** */  00002680
 /* NÅ FORUTSETTES DET AT EKTEFELLEN ER I SØKERS PESTATUS.          */  00002690
 /* *************************************************************** */  00002700
                                                                        00002710
                              DO;                                       00002720
                                                                        00002730
 /* *************************************************************** */  00002740
 /* DERSOM DET SØKES OM EKTEFELLETILLEGG.                           */  00002750
 /* *************************************************************** */  00002760
                                                                        00002770
                                 IF A1S.TILL_EK = 'J' THEN              00002780
                                    DO;                                 00002790
                                                                        00002800
 /* *************************************************************** */  00002810
 /* DERSOM EKTEFELLEN HAR PENSJON.                                  */  00002820
 /* *************************************************************** */  00002830
                                                                        00002840
                                       IF (                             00002850
                                        B01.PENSJONSTYPE1 (EKTEF_IND)   00002860
                                                             = 'A' !    00002870
                                        B01.PENSJONSTYPE1 ( EKTEF_IND)  00002880
                                                             = 'U' !    00002890
 /*YS*/                                 B01.PENSJONSTYPE1 ( EKTEF_IND)  00002900
 /*YS*/                                                      = 'Y' !    00002910
 /*AFP*/                                B01.PENSJONSTYPE1 ( EKTEF_IND)  00002920
 /*AFP*/                                                     = 'K'  )   00002930
                                                                        00002940
                                       THEN                             00002950
                                       DO;                              00002960
  L180:                                                                 00002970
                                          FEIL_VED_LABEL = '180';       00002980
                                          FEIL_MELD_NR   = 1011;        00002990
                                          GO TO L999;                   00003000
                                       END;                             00003010
                                                                        00003020
 /* **************************************************************** */ 00003030
 /* EKTEFELLEN HAR IKKE PENSJON.                                     */ 00003040
 /* **************************************************************** */ 00003050
                                                                        00003060
                                       ELSE                             00003070
                                       DO;                              00003080
                                       CALL                             00003090
                                       FLYTT_B01_TIL_B02( SØKER_IND);   00003100
                                       IF FEIL_MELD_NR > 0 THEN         00003110
                                          GO TO L999;                   00003120
                                       ELSE                             00003130
                                          PROGRAM_ID='R001N520';        00003140
                                       CALL                             00003150
                                       FLYTT_B01_TIL_B02( EKTEF_IND);   00003160
                                       IF FEIL_MELD_NR > 0 THEN         00003170
                                          GO TO L999;                   00003180
                                       ELSE                             00003190
                                          PROGRAM_ID='R001N520';        00003200
                                       CALL                             00003210
                                            AJOURFØR_B02_MED_A1TRANS;   00003220
                                       END;                             00003230
                                    END;                                00003240
                                                                        00003250
 /* *************************************************************** */  00003260
 /* DET SØKES IKKE OM EKTEFELLETILLEGG.                             */  00003270
 /* *************************************************************** */  00003280
                                                                        00003290
                                 ELSE                                   00003300
                                    DO;                                 00003310
                                       CALL                             00003320
                                       FLYTT_B01_TIL_B02( SØKER_IND);   00003330
                                       IF FEIL_MELD_NR > 0 THEN         00003340
                                          GO TO L999;                   00003350
                                       ELSE                             00003360
                                          PROGRAM_ID='R001N520';        00003370
                                       CALL                             00003380
                                       FLYTT_B01_TIL_B02( EKTEF_IND);   00003390
                                       IF FEIL_MELD_NR > 0 THEN         00003400
                                          GO TO L999;                   00003410
                                       ELSE                             00003420
                                          PROGRAM_ID='R001N520';        00003430
                                       CALL                             00003440
                                       AJOURFØR_B02_MED_A1TRANS;        00003450
                                    END;                                00003460
                              END;                                      00003470
                        END;                                            00003480
                  END;                                                  00003490
               END;                                                     00003500
            ELSE                                                        00003510
                                                                        00003520
 /* ************************************************************ */     00003530
 /* INGEN EKTEFELLE I TRANSEN.                                   */     00003540
 /* ************************************************************ */     00003550
                                                                        00003560
               DO;                                                      00003570
                                                                        00003580
 /* *************************************************************** */  00003590
 /* DERSOM SØKERS SIVILSTAND ER G ELLER A ELLER P                   */  00003600
 /* *************************************************************** */  00003610
                                                                        00003620
                 IF  B01.SIVILSTAND(SØKER_IND) = 'P' THEN               00003630
                     DO;                                                00003640
  L185:                                                                 00003650
                        FEIL_VED_LABEL = '185';                         00003660
                        FEIL_MELD_NR   = 1105;                          00003670
                        GO TO L999;                                     00003680
                     END;                                               00003690
                                                                        00003700
                 IF  B01.SIVILSTAND(SØKER_IND) = 'W'   !                00003710
                     B01.SIVILSTAND(SØKER_IND) = 'V' THEN               00003720
                     DO;                                                00003730
  L187:                                                                 00003740
                        FEIL_VED_LABEL = '187';                         00003750
                        FEIL_MELD_NR   = 1106;                          00003760
                        GO TO L999;                                     00003770
                     END;                                               00003780
                                                                        00003790
                                                                        00003800
                  IF (                                                  00003810
                   B01.SIVILSTAND(SØKER_IND) = 'G' !                    00003820
                   B01.SIVILSTAND(SØKER_IND) = 'A') THEN                00003830
                     DO;                                                00003840
  L190:                                                                 00003850
                        FEIL_VED_LABEL = '190';                         00003860
                        FEIL_MELD_NR   = 1102;                          00003870
                        GO TO L999;                                     00003880
                     END;                                               00003890
                  ELSE                                                  00003900
                     DO;                                                00003910
                        CALL FLYTT_B01_TIL_B02(SØKER_IND);              00003920
                        IF B01.PENSJONSTYPE2(SØKER_IND) = 'E'  !        00003930
  /*0795 HL*/              B01.PENSJONSTYPE1(SØKER_IND) = 'E' THEN      00003940
                           B02.PERSON(EKTEF_IND) =                      00003950
                                            B01.PERSON(EKTEF_IND);      00003960
                        IF FEIL_MELD_NR > 0 THEN                        00003970
                           GO TO L999;                                  00003980
                        ELSE                                            00003990
                           PROGRAM_ID='R001N520';                       00004000
                        CALL AJOURFØR_B02_MED_A1TRANS;                  00004010
                     END;                                               00004020
               END;                                                     00004030
         END;                                                           00004040
      ELSE                                                              00004050
                                                                        00004060
 /* 9/1-85 KARIN */                                                     00004070
 /* *************************************************************** */  00004080
 /* SØKEREN ER IKKE I PENSJONSDELEN ELLER                           */  00004090
 /* HAR EN OPPHØRT PENSJONSSTATUS (STATUS-KODE-HIST = O / X)        */  00004100
 /* *************************************************************** */  00004110
                                                                        00004120
         DO;                                                            00004130
            /* 9/1-85 KARIN */                                          00004140
            /* ************************************************/        00004150
            /* DET ETTERFØLGENDE GJELDER DISSE STATUS-TYPER:   */       00004160
            /* - A - IKKE STATUS-SEGMENT ELLER STATUS-SEGMENT  */       00004170
            /*       SOM ER OPPHØRT, STATUS_KODE-HIST = 'O',   */       00004180
            /*       INGEN OPPLYSNINGER FRA STATUS SKAL MED I  */       00004190
            /*       B02.                                      */       00004200
            /* - C - IKKE STATUS-SEGMENT                       */       00004210
            /* - I - HAR STATUS-SEGMENT (SS) SOM ER HISTORISK, */       00004220
            /*       STATUS-KODE-HIST = 'X', UFØREHISTORIKKEN  */       00004230
            /*       SKAL VÆRE MED OVER TIL B02.               */       00004240
            /* - K - HAR STATUS-SEGMENT (NS) SOM ER HISTORISK, */       00004250
            /*       STATUS-KODE-HIST = 'X', UFØREHISTORIKKEN  */       00004260
            /*       SKAL VÆRE MED OVER TIL B02.               */       00004270
            /* *********************************************** */       00004280
                                                                        00004290
 /* *************************************************************** */  00004300
 /* BARE NÅR DET LIGGER NOE I B01.                                  */  00004310
 /* *************************************************************** */  00004320
                                                                        00004330
            IF B01.FNR(SØKER_IND) > 0 THEN                              00004340
               DO;                                                      00004350
                  CALL FLYTT_B01_TIL_B02(SØKER_IND);                    00004360
                  IF FEIL_MELD_NR > 0 THEN                              00004370
                     GO TO L999;                                        00004380
                  ELSE                                                  00004390
                     PROGRAM_ID='R001N520';                             00004400
                  B02.NAVN(SØKER_IND)  = A1S.NAVN;                      00004410
               END;                                                     00004420
            ELSE                                                        00004430
                                                                        00004440
 /* *************************************************************** */  00004450
 /* OPPLYSNINGER FOR OPPRETTELSE AV ROTSEGMENT.                     */  00004460
 /* *************************************************************** */  00004470
                                                                        00004480
               DO;                                                      00004490
                  B02.FNR(SØKER_IND)   = A1S.FNR;                       00004500
                  B02.NAVN(SØKER_IND)  = A1S.NAVN;                      00004510
                  B02.TKNR(SØKER_IND)  = A1S.TKNR;                      00004520
                  B02.SPRÅK(SØKER_IND) = A1S.SPRÅK;                     00004530
               END;                                                     00004540
                                                                        00004550
 /* *************************************************************** */  00004560
 /* DERSOM DET ER EKTEFELLE I TRANSEN.                              */  00004570
 /* *************************************************************** */  00004580
                                                                        00004590
            IF A1S.FNR_EK > 0 THEN                                      00004600
               DO;                                                      00004610
                  SEARCH_FNR = A1S.FNR_EK;                              00004620
                  POS_I_B01  = EKTEF_IND;                               00004630
                  EXEC CICS LINK PROGRAM ('R0019928') COMMAREA          00004640
                                                        (KOM_OMR);      00004650
                  IF FEIL_MELD_NR > 0 THEN                              00004660
                     GO TO L999;                                        00004670
                  ELSE                                                  00004680
                     PROGRAM_ID='R001N520';                             00004690
                                                                        00004700
 /* ************************************************************** */   00004710
 /* DERSOM EKTEFELLEN IKKE HAR PESTATUS.                           */   00004720
 /* ************************************************************** */   00004730
                                                                        00004740
                  IF STATUS_TYPE  = 'A' !                               00004750
                     STATUS_TYPE  = 'I' !                               00004760
                     STATUS_TYPE  = 'K' !   /* 9/1-85 */                00004770
                     STATUS_TYPE  = 'C' THEN                            00004780
                     DO;                                                00004790
                                                                        00004800
 /* ************************************************************** */   00004810
 /* DERSOM EKTEFELLEN ER I BASEN (MEN IKKE HAR PENSJONSSTATUS).    */   00004820
 /* ************************************************************** */   00004830
                                                                        00004840
                        IF B01.FNR(EKTEF_IND) > 0 THEN                  00004850
                           DO;                                          00004860
                              CALL FLYTT_B01_TIL_B02(EKTEF_IND);        00004870
                              IF FEIL_MELD_NR > 0 THEN                  00004880
                                 GO TO L999;                            00004890
                              ELSE                                      00004900
                                 PROGRAM_ID='R001N520';                 00004910
                              B02.NAVN(EKTEF_IND)  = A1S.NAVN_EK;       00004920
                              B02.TKNR(EKTEF_IND)  = A1S.TKNR;          00004930
                           END;                                         00004940
                        ELSE                                            00004950
                                                                        00004960
 /* *************************************************************** */  00004970
 /* OPPLYSNINGER FOR OPPRETTELSE AV ROTSEGMENT.                     */  00004980
 /* *************************************************************** */  00004990
                                                                        00005000
                           DO;                                          00005010
                              B02.FNR(EKTEF_IND)   = A1S.FNR_EK;        00005020
                              B02.NAVN(EKTEF_IND)  = A1S.NAVN_EK;       00005030
                              B02.TKNR(EKTEF_IND)  = A1S.TKNR;          00005040
                              B02.SPRÅK(EKTEF_IND) = A1S.SPRÅK;         00005050
                           END;                                         00005060
                           /* R0010521 ENDRET 9/1-85 AV KARIN */        00005070
                           CALL                                         00005080
                               OPPRETT_STATUS_A1_SØKER; /*R001N521*/    00005090
                           CALL KOBLE_TO_PERSONER (                     00005100
                                                 SØKER_IND,EKTEF_IND);  00005110
                     END;                                               00005120
                  ELSE                                                  00005130
                     DO;                                                00005140
                                                                        00005150
 /* *************************************************************** */  00005160
 /* EKTEFELLEN HAR PENSJONSSTATUS.                                  */  00005170
 /* *************************************************************** */  00005180
                                                                        00005190
 /* ENDRET AV KARIN 9/1-85 */                                           00005200
                        IF STATUS_TYPE = 'F' !                          00005210
                           STATUS_TYPE = 'H'  THEN                      00005220
                           DO;                                          00005230
  L195:                                                                 00005240
                              FEIL_VED_LABEL = '195';                   00005250
                              FEIL_MELD_NR   = 1716;                    00005260
                              GO TO L999;                               00005270
                           END;                                         00005280
                        ELSE                                            00005290
                           DO;                                          00005300
  L200:                                                                 00005310
                              FEIL_VED_LABEL = '200';                   00005320
                              FEIL_MELD_NR   = 1008;                    00005330
                              GO TO L999;                               00005340
                           END;                                         00005350
                     END;                                               00005360
               END;                                                     00005370
            ELSE                                                        00005380
                                                                        00005390
 /* ************************************************************** */   00005400
 /* DET ER IKKE EKTEFELLE I TRANSEN.                               */   00005410
 /* *************************************************************  */   00005420
                                                                        00005430
                  CALL OPPRETT_STATUS_A1_SØKER;                         00005440
         END;                                                           00005450
                                                                        00005460
 /* *************************************************************** */  00005470
 /*         BARNEDELEN                                              */  00005480
 /* *************************************************************** */  00005490
                                                                        00005500
      DO I = 1 TO A1S.BT_ANT;                                           00005510
         BARN_IND = 0;                                                  00005520
         DO J = 3 TO 14 WHILE (B02.FNR(J) > 0);                         00005530
            IF A1B.FNR_BARN(I) = B02.FNR(J) THEN                        00005540
               DO;                                                      00005550
                  BARN_IND = J;                                         00005560
                  J = 14;                                               00005570
               END;                                                     00005580
         END;                                                           00005590
 %PAGE;                                /* */                            00005600
                                                                        00005610
 /* ***************************************************************** */00005620
 /* BARNET ER IKKE I B01, IKKE TILKNYTTET SØKER ELLER SØKERS EKTEFELLE*/00005630
 /* ***************************************************************** */00005640
                                                                        00005650
         IF BARN_IND = 0 THEN                                           00005660
            DO;                                                         00005670
               BARN_IND        = J;                                     00005680
               SEARCH_FNR      = A1B.FNR_BARN(I);                       00005690
               POS_I_B01       = BARN_IND;                              00005700
               EXEC CICS LINK PROGRAM ('R0019928') COMMAREA             00005710
                                                         (KOM_OMR);     00005720
               IF FEIL_MELD_NR > 0 THEN                                 00005730
                  GO TO L999;                                           00005740
               ELSE                                                     00005750
                  PROGRAM_ID = 'R001N520';                              00005760
                                                                        00005770
 /* *************************************************************** */  00005780
 /* DERSOM BARNET IKKE HAR PENSJONSSTATUS.                          */  00005790
 /* *************************************************************** */  00005800
                                                                        00005810
                /* 9/1-85 AV KARIN */                                   00005820
               IF STATUS_TYPE = 'A' !                                   00005830
                  STATUS_TYPE = 'I' !                                   00005840
                  STATUS_TYPE = 'C' THEN                                00005850
                  DO;                                                   00005860
                                                                        00005870
 /* *************************************************************** */  00005880
 /* DERSOM BARNET ER I BASEN.                                       */  00005890
 /* *************************************************************** */  00005900
                                                                        00005910
                     IF B01.FNR(BARN_IND) > 0 THEN                      00005920
                        DO;                                             00005930
                           CALL FLYTT_B01_TIL_B02(BARN_IND);            00005940
                           IF FEIL_MELD_NR > 0 THEN                     00005950
                              GO TO L999;                               00005960
                           ELSE                                         00005970
                              PROGRAM_ID = 'R001N520';                  00005980
                        END;                                            00005990
                                                                        00006000
 /* *************************************************************** */  00006010
 /* BARNET ER IKKE I BASEN.                                         */  00006020
 /* *************************************************************** */  00006030
                                                                        00006040
                     ELSE                                               00006050
                                                                        00006060
 /* *************************************************************** */  00006070
 /* OPPLYSNINGER FOR OPPRETTELSE AV ROTSEGMENT.                     */  00006080
 /* *************************************************************** */  00006090
                                                                        00006100
                         DO;                                            00006110
                            B02.FNR(BARN_IND)   = A1B.FNR_BARN (I);     00006120
                            B02.NAVN(BARN_IND)  = (25)' ';              00006130
                            B02.TKNR(BARN_IND)  = A1S.TKNR;             00006140
                            B02.SPRÅK(BARN_IND) = A1S.SPRÅK;            00006150
                         END;                                           00006160
 /* KS 4/6-84 */                                                        00006170
            /*       IF A1B.RBT_BARN(I) = 'J' THEN                      00006180
                        B02.PENSJONSTYPE2(BARN_IND) = 'R';              00006190
                     ELSE                                   */          00006200
                        B02.PENSJONSTYPE2(BARN_IND) = ' ';              00006210
                     CALL                                               00006220
                     OPPRETT_STATUS_FORS_BARN(BARN_IND,SØKER_IND);      00006230
                     CALL KOBLE_TO_PERSONER(SØKER_IND,BARN_IND);        00006240
                  END;                                                  00006250
               ELSE                                                     00006260
                                                                        00006270
 /* ************************************************************** */   00006280
 /* BARNET HAR PESTATUS.                                           */   00006290
 /* ************************************************************** */   00006300
                                                                        00006310
                  DO;                                                   00006320
                     IF STATUS_TYPE ^= 'F'                              00006330
                                                      THEN              00006340
                        DO;                                             00006350
                                                                        00006360
 /* ************************************************************** */   00006370
 /* BARNET ER FORSØRGET AV ANDRE.                                  */   00006380
 /* ************************************************************** */   00006390
                                                                        00006400
                           IF B01.                                      00006410
                                  PENSJONSTYPE1(BARN_IND) = 'L' THEN    00006420
                              DO;                                       00006430
  L210:                                                                 00006440
                                 FEIL_VED_LABEL = '210';                00006450
                                 FEIL_MELD_NR   = 1203;                 00006460
                                 GO TO L999;                            00006470
                              END;                                      00006480
                           ELSE                                         00006490
                                                                        00006500
 /* ************************************************************** */   00006510
 /* BARNET ER TILKNYTTET ANDRE PÅ EN ANNEN MÅTE.                   */   00006520
 /* ************************************************************** */   00006530
                                                                        00006540
                              IF B01.                                   00006550
                                     FNR_TILKN(BARN_IND,1) > 0 THEN     00006560
                                 DO;                                    00006570
  L230:                                                                 00006580
                                    FEIL_VED_LABEL = '220';             00006590
                                    FEIL_MELD_NR   = 1206;              00006600
                                    GO TO L999;                         00006610
                                 END;                                   00006620
                              ELSE                                      00006630
                                                                        00006640
 /* ************************************************************** */   00006650
 /* BARNET HAR PENSJON.                                            */   00006660
 /* ************************************************************** */   00006670
                                                                        00006680
                                 DO;                                    00006690
  L240:                                                                 00006700
                                    FEIL_VED_LABEL = '240';             00006710
                                    FEIL_MELD_NR   = 1204;              00006720
                                    GO TO L999;                         00006730
                                 END;                                   00006740
                        END;                                            00006750
                     ELSE                                               00006760
                        DO;                                             00006770
  L245:                                                                 00006780
                           FEIL_VED_LABEL = '245';                      00006790
                           FEIL_MELD_NR   = 0601;                       00006800
                           GO TO L999;                                  00006810
                        END;                                            00006820
                  END;                                                  00006830
            END;                                                        00006840
                                                                        00006850
                                                                        00006860
 /* ************************************************************** */   00006870
 /* BARNET ER TILKNYTTET SØKERENS FAMILIE.                         */   00006880
 /* ************************************************************** */   00006890
                                                                        00006900
         ELSE                                                           00006910
            DO;                                                         00006920
                                                                        00006930
 /* ************************************************************** */   00006940
 /* DERSOM BARNET IKKE ER TILKNYTTET SØKER.                        */   00006950
 /* ************************************************************** */   00006960
                                                                        00006970
               IF B01.FNR_TILKN(BARN_IND,1) ^= B01.FNR(SØKER_IND)       00006980
                                                                 THEN   00006990
                  DO;                                                   00007000
  L250:                                                                 00007010
                     FEIL_VED_LABEL = '250';                            00007020
                     FEIL_MELD_NR   = 1201;                             00007030
                     GO TO L999;                                        00007040
                  END;                                                  00007050
               ELSE                                                     00007060
                  DO;                                                   00007070
                                                                        00007080
 /* ************************************************************** */   00007090
 /* IKKE FORSØRGET BARN.                                           */   00007100
 /* ************************************************************** */   00007110
                                                                        00007120
                     IF B01.PENSJONSTYPE1(BARN_IND) ^= 'L' THEN         00007130
                        DO;                                             00007140
  L260:                                                                 00007150
                           FEIL_VED_LABEL = '260';                      00007160
                           FEIL_MELD_NR   = 1207;                       00007170
                           GO TO L999;                                  00007180
                        END;                                            00007190
                  END;                                                  00007200
            END;                                                        00007210
      END;                                                              00007220
                                                                        00007230
 /* ************************************************************* */    00007240
 /* BARN TILKNYTTET SØKER MED L (FORSØRGEDE BARN)                 */    00007250
 /* ************************************************************* */    00007260
                                                                        00007270
  B02.ANTALL_BARN(SØKER_IND) = 0;                                       00007280
  DO I = 1 TO 13 WHILE                                                  00007290
         (B02.TILKN.FNR_TILKN(SØKER_IND,I) > 0 );                       00007300
     IF B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'L'   !               00007310
        B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'V'   !   /*HL*/      00007320
        B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'W'   THEN            00007330
        B02.ANTALL_BARN(SØKER_IND) =                                    00007340
                                    B02.ANTALL_BARN(SØKER_IND) + 1;     00007350
  END;                                                                  00007360
                                                                        00007370
 /* **************************************************************** */ 00007380
 /*YS - VI SKAL AVSLUTTE EN EVT. UFØREPERIODE V/ENGANGSUTLØSNING*/      00007390
 /* **************************************************************** */ 00007400
                                                                        00007410
                                                                        00007420
  PRETT20 = B01.PENSJONSRETT_FØR_91(SØKER_IND);                         00007430
  PRETT20 = ' ';                                                        00007440
  PRETT20 = B02.PENSJONSRETT_FØR_91(SØKER_IND);                         00007450
 /*YS*/  IF B02.UFØRHIST.UFT_ÅM(SØKER_IND,1) > 0     THEN               00007460
 /*YS*/  DO;                                                            00007470
 /*YS*/     DCL SISTE  FIXED BIN(15);                                   00007480
           /*0697 HL:*/                                                 00007490
 /*YS*/     DO J = 7 TO 1 BY -1 UNTIL(B02.UFØRHIST.UFT_ÅM(SØKER_IND,    00007500
 /*YS*/                                                   J) > 0);      00007510
 /*YS*/        SISTE = J;                                               00007520
 /*YS*/     END;                                                        00007530
 /*YS*/                                                                 00007540
 /*YS*/     IF B02.UFØRHIST.OPPHØRSDATO_ÅM(SØKER_IND,SISTE) = 0 THEN    00007550
 /*YS*/                                                                 00007560
 /*YS*/     DO;                                                         00007570
 /*YS*/        B02.UFØRHIST.OPPHØRSDATO_ÅM(SØKER_IND,SISTE) =           00007580
 /*YS*/                                      SEKSTISJU_ÅRSDATO;         00007590
 /*YS*/        B02.UFØRHIST.OPPHØRSKODE(SØKER_IND,SISTE) = 'A';         00007600
 /*TS*/        B02.ALDERSP.KONV_P_KODE(SØKER_IND)        = 'U';         00007610
 /*YS*/                                                                 00007620
 /*YS*/        DO J = 5 TO 1 BY -1 UNTIL(B02.YRKEHIST.YUFT_ÅM           00007630
 /*YS*/                                         (SØKER_IND,J) > 0);     00007640
 /*YS*/           SISTE = J;                                            00007650
 /*YS*/        END;                                                     00007660
 /*YS*/                                                                 00007670
 /*YS*/        IF B02.YRKEHIST.OPPH_DATO_ÅM(SØKER_IND,SISTE) = 0 THEN   00007680
 /*YS*/                                                                 00007690
 /*YS*/        DO;                                                      00007700
 /*YS*/           B02.YRKEHIST.OPPH_DATO_ÅM(SØKER_IND,SISTE) =          00007710
 /*YS*/                                        SEKSTISJU_ÅRSDATO;       00007720
 /*YS*/           B02.YRKEHIST.OPPH_KODE(SØKER_IND,SISTE) = 'A';        00007730
 /*YS*/        END;                                                     00007740
 /*YS*/     END;                                                        00007750
 /*YS*/  END;                                                           00007760
 /*YS*/                                                                 00007770
  L999:                                                                 00007780
                                                                        00007790
  EXEC CICS RETURN;                                                     00007800
                                                                        00007810
  %PAGE;                                                                00007820
      %INCLUDE R001N521;                                                00007830
      %INCLUDE R001N522;                                                00007840
      %INCLUDE R0019905;                                                00007850
      %INCLUDE R0019913;                                                00007860
      %INCLUDE R0019923;                                                00007870
      %INCLUDE R0019924;                                                00007880
      %INCLUDE R0019926;                                                00007890
      %INCLUDE R0019929;                                                00007900
      %INCLUDE R0019954;   /*RULL_FORVENTET*/                           00007910
      %INCLUDE R0019967;   /*RULL_FAI*/                                 00007920
      %INCLUDE R0019968;   /*F_RULL_FORSI*/                             00007930
   END KON_A1;                                                          00007940
