 /*       SIST ENDRET 06/03-91 11.49.50 AV   DYBVIK                   */00000000
 /*IDENTIFIKASJON:                                                    */00000010
 /*    R001N807 - PROGRAM I PLI                                       */00000020
 /*    PROGRAMMERT AV :                                               */00000030
 /*HENSIKT:                                                           */00000040
 /*    SKRIVE PROSEDYRER FOR INNSETTING AV FORTEKSTER OG ATTRIBUTTER  */00000050
 /*TEKST_SPES_SØKER:                                                  */00000060
 /*    SETTER FORTEKSTER, ATTRIBUTTER I SPESIELL DEL SØKER.           */00000070
 /*FJERN_TEKST_SPES_SØKER:                                            */00000080
 /*    SETTER 0 I LENGDEKODE FOR TEKSTER SPESIELL DEL SØKER OG        */00000090
 /*    BLANKE I TEKSTFELTET.                                          */00000100
 /*TEKST_SPES_AVDØDE:                                                 */00000110
 /*    SETTER INN FORTEKSTER OG ATTRIBUTTER I SPESIELL DEL AVDØDE     */00000120
 /*FJERN_TEKST_SPES_AVDØDE:                                           */00000130
 /*    SETTER 0 I LENGDEKODE FOR TEKSTER SPESIELL DEL AVDØDE OG       */00000140
 /*    BLANKE I TEKSTFELTET.                                          */00000150
 %SKIP(3);                         /*SETTER FORTEKSTER,                 00000160
                                   ATTRIBUTTER I SPESIELL DEL SØKER*/   00000170
 TEKST_SPES_SØKER:                                                      00000180
   PROC;                                                                00000190
      DCL                                                               00000200
        NOR_NUM   CHAR(1) INIT('&');                                    00000210
                                                                        00000220
      S001N81O.TFSO   = 'SPES.';                                        00000230
      S001N81O.TFS2O  = 'STATSBORGER';                                  00000240
      S001N81O.TFS3O  = 'BOSATT';                                       00000250
      S001N81O.TFS4O  = 'PENSJTRYGD';                                   00000260
      S001N81O.TFS5O  = 'M_20ÅR';                                       00000270
      S001N81O.TFS6O  = 'FRAVIK KONV.';                                 00000280
      S001N81O.TFS0O  = 'OPPL.';                                        00000290
      S001N81O.TFS1O  = 'SØKER';                                        00000300
      S001N81O.TFS10O = 'FRAVIK FLYKT';                                 00000310
      S001N81O.TFS11O = 'OVERKOMP UTL';                                 00000320
      S001N81O.TFS12O = 'IKKE GP';                                      00000330
      S001N81O.TFS13O = 'BEREGN KONV';                                  00000340
      S001N81O.TFS14O = 'SAMLET TT';                                    00000350
      S001N81O.TFS15O = 'MND';                                          00000360
      S001N81O.TFS16O = 'TT 1937 ÅR ';                                  00000370
      S001N81O.TFS17O = 'TT_NORDEN';                                    00000380
      S001N81O.TFS18O = 'VILKÅR_10_5 ';                                 00000390
      S001N81O.TFS19O = 'INNTR.MÅ';                                     00000400
                                                                        00000410
      IF ^ FEIL_FUNNET & TRANS_OPPL_OMR.TRANSKODE ^=                    00000420
                         TRANS_OPPL_OMR.TRANS_RETURKODE THEN            00000430
         S001N81I.STATSBORGERL = CURSOR_POS;                            00000440
                                                                        00000450
      S001N81O.STATSBORGERA   = NOR_NUM;                                00000460
      S001N81O.BOSATTA        = NOR_NUM;                                00000470
      S001N81O.PENSJONSTRYGDETA = DFHBMUNP;                             00000480
      S001N81O.MINST_20ÅRA    = DFHBMUNP;                               00000490
      S001N81O.FRAVIK_KONVA   = DFHBMUNP;                               00000500
      S001N81O.FRAVIK_FLYKTA  = DFHBMUNP;                               00000510
      S001N81O.OVERKOMP_UTLA  = DFHBMUNP;                               00000520
      S001N81O.IKKE_GPA       = DFHBMUNP;                               00000530
      S001N81O.BEREGNING_KONVA = DFHBMUNP;                              00000540
      S001N81O.TT_KONV_ÅRA    = NOR_NUM;                                00000550
      S001N81O.TT_FRA_1937ÅRA = NOR_NUM;                                00000560
      S001N81O.TT_FRA_1937MNDA = NOR_NUM;                               00000570
      S001N81O.TT_NORDEN_ANNETA = DFHBMUNP;                             00000580
      S001N81O.VILKÅR_10_5_NR2A = DFHBMUNP;                             00000590
      S001N81O.STIA           = NOR_NUM;                                00000600
   END TEKST_SPES_SØKER;                                                00000610
 %PAGE;                                                                 00000620
                                                                        00000630
                                       /* BLANKE I TEKSTFELTET*/        00000640
 FJERN_TEKST_SPES_SØKER:                                                00000650
   PROC;                                                                00000660
      S001N81O.TFSO   = '';                                             00000670
      S001N81O.TFS2O  = '';                                             00000680
      S001N81O.TFS3O  = '';                                             00000690
      S001N81O.TFS4O  = '';                                             00000700
      S001N81O.TFS5O  = '';                                             00000710
      S001N81O.TFS6O  = '';                                             00000720
      S001N81O.TFS0O  = '';                                             00000730
      S001N81O.TFS1O  = '';                                             00000740
      S001N81O.TFS10O = '';                                             00000750
      S001N81O.TFS11O = '';                                             00000760
      S001N81O.TFS12O = '';                                             00000770
      S001N81O.TFS13O = '';                                             00000780
      S001N81O.TFS14O = '';                                             00000790
      S001N81O.TFS15O = '';                                             00000800
      S001N81O.TFS16O = '';                                             00000810
      S001N81O.TFS17O = '';                                             00000820
      S001N81O.TFS18O = '';                                             00000830
      S001N81O.TFS19O = '';                                             00000840
   END FJERN_TEKST_SPES_SØKER;                                          00000850
                                                                        00000860
 BLOKKERE_E3SPES_SØKER:      /* BLOKKERER MED ASKIP OG PROTECT */       00000870
   PROC;                                                                00000880
      S001N81O.STATSBORGERA   = DFHBMASK;                               00000890
      S001N81O.BOSATTA        = DFHBMASK;                               00000900
      S001N81O.PENSJONSTRYGDETA = DFHBMASK;                             00000910
      S001N81O.MINST_20ÅRA   = DFHBMASK;                                00000920
      S001N81O.FRAVIK_KONVA   = DFHBMASK;                               00000930
      S001N81O.FRAVIK_FLYKTA  = DFHBMASK;                               00000940
      S001N81O.OVERKOMP_UTLA  = DFHBMASK;                               00000950
      S001N81O.IKKE_GPA       = DFHBMASK;                               00000960
      S001N81O.BEREGNING_KONVA = DFHBMASK;                              00000970
      S001N81O.TT_KONV_ÅRA    = DFHBMASK;                               00000980
      S001N81O.TT_FRA_1937ÅRA = DFHBMASK;                               00000990
      S001N81O.TT_FRA_1937MNDA = DFHBMASK;                              00001000
      S001N81O.TT_NORDEN_ANNETA = DFHBMASK;                             00001010
      S001N81O.VILKÅR_10_5_NR2A = DFHBMASK;                             00001020
      S001N81O.STIA             = DFHBMASK;                             00001030
   END BLOKKERE_E3SPES_SØKER;                                           00001040
                                                                        00001050
 %PAGE;                            /*SETTER FORTEKSTER, ATTRIBUTTER I   00001060
                                     SPESIELL DEL AVDØDE*/              00001070
 TEKST_SPES_AVDØDE:                                                     00001080
   PROC;                                                                00001090
      DCL                                                               00001100
        NOR_NUM   CHAR(1) INIT('&');                                    00001110
                                                                        00001120
      S001N81O.TFSAO   = 'SPES.';                                       00001130
      S001N81O.TFSA2O  = 'STATSBORGER';                                 00001140
      S001N81O.TFSA3O  = 'BOSATT DØDSTPKT';                             00001150
      S001N81O.TFSA0O  = 'OPPL.';                                       00001160
      S001N81O.TFSA5O  = 'FRAVIK FLYKT ';                               00001170
      S001N81O.TFSA6O  = 'TT FRA 1937  ÅR';                             00001180
      S001N81O.TFSA1O  = 'AVDØD';                                       00001190
      S001N81O.TFSA7O  = 'MND';                                         00001200
      S001N81O.TFSA8O  = 'OVERKOMP ';                                   00001210
      S001N81O.TFSA9O  = 'TT NORDEN';                                   00001220
                                                                        00001230
      IF ^ FEIL_FUNNET & TRANS_OPPL_OMR.TRANSKODE ^=                    00001240
                         TRANS_OPPL_OMR.TRANS_RETURKODE THEN            00001250
        S001N81I.STATSBORGER_EKL = CURSOR_POS;                          00001260
                                                                        00001270
      S001N81O.STATSBORGER_EKA  = NOR_NUM;                              00001280
      S001N81O.BOSATT_EKA       = NOR_NUM;                              00001290
      S001N81O.FRAVIK_FLYKT_EKA = DFHBMUNP;                             00001300
      S001N81O.TT_1937_ÅR_EKA   = NOR_NUM;                              00001310
      S001N81O.TT_1937_MND_EKA   = NOR_NUM;                             00001320
      S001N81O.TT_NORD_ANNET_EA = DFHBMUNP;                             00001330
      S001N81O.OVERKOMP_UTL_EKA = DFHBMUNP;                             00001340
   END TEKST_SPES_AVDØDE;                                               00001350
 %PAGE;                                                                 00001360
                                                                        00001370
                                /* BLANKE I TEKSTFELTET*/               00001380
 FJERN_TEKST_SPES_AVDØDE:                                               00001390
   PROC;                                                                00001400
      S001N81O.TFSAO   = '';                                            00001410
      S001N81O.TFSA2O  = '';                                            00001420
      S001N81O.TFSA3O  = '';                                            00001430
      S001N81O.TFSA0O  = '';                                            00001440
      S001N81O.TFSA5O  = '';                                            00001450
      S001N81O.TFSA6O  = '';                                            00001460
      S001N81O.TFSA1O  = '';                                            00001470
      S001N81O.TFSA7O  = '';                                            00001480
      S001N81O.TFSA8O  = '';                                            00001490
      S001N81O.TFSA9O  = '';                                            00001500
   END FJERN_TEKST_SPES_AVDØDE;                                         00001510
                                                                        00001520
 BLOKKERE_E3SPES_AVDØDE:         /* BLOKKERER MED ASKIP OG PROT */      00001530
   PROC;                                                                00001540
      S001N81O.STATSBORGER_EKA  = DFHBMASK;                             00001550
      S001N81O.BOSATT_EKA       = DFHBMASK;                             00001560
      S001N81O.FRAVIK_FLYKT_EKA = DFHBMASK;                             00001570
      S001N81O.TT_1937_ÅR_EKA   = DFHBMASK;                             00001580
      S001N81O.TT_1937_MND_EKA  = DFHBMASK;                             00001590
      S001N81O.TT_NORD_ANNET_EA = DFHBMASK;                             00001600
      S001N81O.OVERKOMP_UTL_EKA = DFHBMASK;                             00001610
   END BLOKKERE_E3SPES_AVDØDE;                                          00001620
