 /*       SIST ENDRET 24/08-88 09.30.21 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 09/02-88 13.21.44 AV   DYBVIK                   */00000010
 %SKIP(3);                                                              00000020
 /* ***************************************************************** */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /* **********************                                            */00000050
 /*  PROGRAM-IDENT : R001NO13  UNDERPROGRAM SOM BRUKES AV R001NO10.   */00000060
 /*                            KONTROLL EP-BLANKETT.                  */00000070
 /*  PROGRAM-SPRÅK : PLI                                              */00000080
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */00000090
 /*  PROGRAMMET BLE LAGET : OKTOBER 1986                              */00000100
 /* ***************************************************************** */00000110
 /*  ENDRINGERSDATO :   230888                                        */00000120
 /*  ENDRINGEN GJELDER: LAGT INN CALL TIL BLANK_EP_SPES_SØKER OG      */00000130
 /*                     BLANK_EP_SPES_AVDØDE.  UGYLDIGE VERDIER I     */00000140
 /*                     EPSP FORÅRSAKET ABENDER I GRUNNBL.RUTINA.     */00000150
 /*  ENDRINGEN BLE UTFØRT AV :     BRITT                              */00000160
 /*                                                                   */00000170
 /* ***************************************************************** */00000180
 /*BRUK:                                                              */00000190
 /* ********                                                          */00000200
 /*                                                                   */00000210
 /*  %INCLUDE R001NO13                                                */00000220
 /*                                                                   */00000230
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */00000240
 /*                                                                   */00000250
 /*    R0010802   BLANK EP TRANSOMR                                   */00000260
 /*    R0010803   KONTR EP SØKER                                      */00000270
 /*    FUNKSJONER SOM BRUKES ER INCLUDET I HOVEDPROGRAMMET.           */00000280
 /*                                                                   */00000290
 /* ***************************************************************** */00000300
 /*                                                                   */00000310
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR EP OG FLYTTER DERETTER        */00000320
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */00000330
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */00000340
 /*  NUMRE TATT VARE PÅ.                                              */00000350
 /*                                                                   */00000360
 /* ***************************************************************** */00000370
                                                                        00000380
 P108_BEHANDLE_EP: PROC;                                                00000390
                                                                        00000400
                                                                        00000410
 %INCLUDE P0010801;                               /* TRANSOMR EP */     00000420
                                                                        00000430
                                                                        00000440
          CALL BLANK_EP_SØKER;                         /* R0010802 */   00000450
          CALL BLANK_EP_MELDNR;                        /* R0010802 */   00000460
          CALL BLANK_EP_SPES_SØKER;                    /* R0010802 */   00000470
          CALL BLANK_EP_SPES_AVDØDE;                   /* R0010802 */   00000480
          CALL OVERF_EP_BLANKETT;                                       00000490
          CALL KONTROLL_EP_SØKER(FEIL_FUNNET);         /* R0010803 */   00000500
                                                                        00000510
          IF EPS.NORSK_BOSATT = 'N'   THEN                              00000520
             DO;                                                        00000530
                FEIL_I_BOSATT = TRUE;                                   00000540
                FEIL_FUNNET   = TRUE;                                   00000550
             END;                                                       00000560
                                                                        00000570
          IF FEIL_FUNNET      THEN                                      00000580
             CALL FINN_FEIL_EP;                                         00000590
                                                                        00000600
                                                                        00000610
 /* ***************************************************************** */00000620
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */00000630
 /*    RECORDEN TIL EP TRANSOMRÅDE FOR EP-BLANKETT.                   */00000640
 /* ***************************************************************** */00000650
 OVERF_EP_BLANKETT:PROC;                                                00000660
                                                                        00000670
          EPS.REGDATO       =  BLANKETT_RECORD.TRANS_DATO_ÅMD;          00000680
          EPS.TERMID        = 'NORT';                                   00000690
          EPS.FNR           =  BLANKETT_RECORD.FNR;                     00000700
          EPS.NAVN          =  BLANKETT_RECORD.NAVN;                    00000710
          EPS.TKNR          =  BLANKETT_RECORD.TKNR;                    00000720
          EPS.SPRÅK         =  EP_BLANKETT.SPRÅK;                       00000730
          EPS.SIVILSTAND    =  EP_BLANKETT.SIVILSTAND;                  00000740
          EPS.NORSK_BOSATT  =  EP_BLANKETT.NORSK_BOSATT;                00000750
                                                                        00000760
          IF F_FELT_PIC_CHAR3 (EP_BLANKETT.TP_PROSENT) ^= '   '   THEN  00000770
             EPS.TP_PROSENT =  EP_BLANKETT.TP_PROSENT;                  00000780
                                                                        00000790
          EPS.VILKÅR_10_5   =  EP_BLANKETT.VILKÅR_10_5;                 00000800
          EPS.OMSORG_AVD_BA =  EP_BLANKETT.OMSORG_AVD_BA;               00000810
                                                                        00000820
          IF F_FELT_PIC_CHAR5 (EP_BLANKETT.FORVENTET) ^= '     ' THEN   00000830
             EPS.FORVENTET  =  EP_BLANKETT.FORVENTET * 100;             00000840
                                                                        00000850
          IF F_FELT_PIC_CHAR5 (EP_BLANKETT.FAI) ^= '     '        THEN  00000860
             EPS.FAI        =  EP_BLANKETT.FAI * 100;                   00000870
                                                                        00000880
          EPS.GP_OS_KODE    =  EP_BLANKETT.GP_OS_KODE;                  00000890
          EPS.HJEMMEL_10_8  =  EP_BLANKETT.HJEMMEL_10_8;                00000900
                                                                        00000910
          IF F_FELT_PIC_CHAR4 (EP_BLANKETT.FRAMLEGGSDATO_MÅ) ^=         00000920
                                                            '    ' THEN 00000930
             EPS.FRAMLEGGSDATO_MÅ = EP_BLANKETT.FRAMLEGGSDATO_MÅ;       00000940
                                                                        00000950
          EPS.FRAMLEGGSKODE =  EP_BLANKETT.FRAMLEGGSKODE;               00000960
          EPS.VIRK_DATO_MÅ  =  EP_BLANKETT.VIRK_DATO_MÅ;                00000970
                                                                        00000980
          IF F_FELT_PIC_CHAR11 (EP_BLANKETT.FNR_AVD) ^= (11)' '   THEN  00000990
             EPS.FNR_EK     =  EP_BLANKETT.FNR_AVD;                     00001000
                                                                        00001010
          EPS.NAVN_EK         =  EP_BLANKETT.NAVN_AVD;                  00001020
          EPS.NORSK_BOSATT_EK =  EP_BLANKETT.NORSK_BOSATT_EK;           00001030
          EPS.DØDSDATO_EK     =  EP_BLANKETT.DØDSDATO_EK;               00001040
          EPS.VILKÅR_8_4_EK   =  EP_BLANKETT.VILKÅR_8_4_EK;             00001050
                                                                        00001060
          IF F_FELT_PIC_CHAR5 (EP_BLANKETT.PI_EK) ^= '     '      THEN  00001070
             EPS.PI_EK        =  EP_BLANKETT.PI_EK * 100;               00001080
                                                                        00001090
          DO I = 1 TO 4;                                                00001100
             IF F_FELT_PIC_CHAR2 (EP_BLANKETT.VP_ÅR_EK(I)) ^=           00001110
                                                           '  ' THEN    00001120
                EPS.VP_ÅR_EK(I) = EP_BLANKETT.VP_ÅR_EK(I);              00001130
          END;                                                          00001140
                                                                        00001150
                                                                        00001160
    END OVERF_EP_BLANKETT;                                              00001170
                                                                        00001180
                                                                        00001190
                                                                        00001200
 /* ***************************************************************** */00001210
 /*    PROCEDURE SOM FINNER OG TAR VARE PÅ FEIL_MELD_NR NÅR DET ER    */00001220
 /*    FEIL I DEN OVERFØRTE RECORDEN.                                 */00001230
 /* ***************************************************************** */00001240
 FINN_FEIL_EP:PROC;                                                     00001250
                                                                        00001260
                                                                        00001270
          FEIL_IND = 1;                                                 00001280
                                                                        00001290
          IF EPS.FNRNR ^= 0 &                                           00001300
             EPS.FNRNR ^= 999 THEN                                      00001310
             DO;                                                        00001320
                W01_FEIL_NR(FEIL_IND) = EPS.FNRNR;                      00001330
                FEIL_IND = FEIL_IND + 1;                                00001340
             END;                                                       00001350
                                                                        00001360
          IF EPS.NAVNNR ^= 0 &                                          00001370
             EPS.NAVNNR ^= 999 THEN                                     00001380
             DO;                                                        00001390
                W01_FEIL_NR(FEIL_IND) = EPS.NAVNNR;                     00001400
                FEIL_IND = FEIL_IND + 1;                                00001410
             END;                                                       00001420
                                                                        00001430
          IF EPS.TKNRNR ^= 0 &                                          00001440
             EPS.TKNRNR ^= 999 THEN                                     00001450
             DO;                                                        00001460
                W01_FEIL_NR(FEIL_IND) = EPS.TKNRNR;                     00001470
                IF FEIL_IND ^= 3 THEN                                   00001480
                   FEIL_IND  = FEIL_IND + 1;                            00001490
             END;                                                       00001500
                                                                        00001510
          IF EPS.SIVILSTANDNR ^= 0 &                                    00001520
             EPS.SIVILSTANDNR ^= 999 THEN                               00001530
             DO;                                                        00001540
                W01_FEIL_NR(FEIL_IND) = EPS.SIVILSTANDNR;               00001550
                IF FEIL_IND ^= 3 THEN                                   00001560
                   FEIL_IND  = FEIL_IND + 1;                            00001570
             END;                                                       00001580
                                                                        00001590
          IF EPS.SPRÅKNR ^= 0 &                                         00001600
             EPS.SPRÅKNR ^= 999 THEN                                    00001610
             DO;                                                        00001620
                W01_FEIL_NR(FEIL_IND) = EPS.SPRÅKNR;                    00001630
                IF FEIL_IND ^= 3 THEN                                   00001640
                   FEIL_IND  = FEIL_IND + 1;                            00001650
             END;                                                       00001660
                                                                        00001670
          IF EPS.NORSK_BOSATTNR ^= 0 &                                  00001680
             EPS.NORSK_BOSATTNR ^= 999 THEN                             00001690
             DO;                                                        00001700
                W01_FEIL_NR(FEIL_IND) = EPS.NORSK_BOSATTNR;             00001710
                IF FEIL_IND ^= 3 THEN                                   00001720
                   FEIL_IND  = FEIL_IND + 1;                            00001730
             END;                                                       00001740
                                                                        00001750
          IF EPS.TP_PROSENTNR ^= 0 &                                    00001760
             EPS.TP_PROSENTNR ^= 999 THEN                               00001770
             DO;                                                        00001780
                W01_FEIL_NR(FEIL_IND) = EPS.TP_PROSENTNR;               00001790
                IF FEIL_IND ^= 3 THEN                                   00001800
                   FEIL_IND  = FEIL_IND + 1;                            00001810
             END;                                                       00001820
                                                                        00001830
          IF EPS.VILKÅR_10_5NR ^= 0 &                                   00001840
             EPS.VILKÅR_10_5NR ^= 999 THEN                              00001850
             DO;                                                        00001860
                W01_FEIL_NR(FEIL_IND) = EPS.VILKÅR_10_5NR;              00001870
                IF FEIL_IND ^= 3 THEN                                   00001880
                   FEIL_IND  = FEIL_IND + 1;                            00001890
             END;                                                       00001900
                                                                        00001910
          IF EPS.OMSORG_AVD_BANR ^= 0 &                                 00001920
             EPS.OMSORG_AVD_BANR ^= 999 THEN                            00001930
             DO;                                                        00001940
                W01_FEIL_NR(FEIL_IND) = EPS.OMSORG_AVD_BANR;            00001950
                IF FEIL_IND ^= 3 THEN                                   00001960
                   FEIL_IND  = FEIL_IND + 1;                            00001970
             END;                                                       00001980
                                                                        00001990
          IF EPS.FORVENTETNR ^= 0 &                                     00002000
             EPS.FORVENTETNR ^= 999 THEN                                00002010
             DO;                                                        00002020
                W01_FEIL_NR(FEIL_IND) = EPS.FORVENTETNR;                00002030
                IF FEIL_IND ^= 3 THEN                                   00002040
                   FEIL_IND  = FEIL_IND + 1;                            00002050
             END;                                                       00002060
                                                                        00002070
          IF EPS.FAINR ^= 0 &                                           00002080
             EPS.FAINR ^= 999 THEN                                      00002090
             DO;                                                        00002100
                W01_FEIL_NR(FEIL_IND) = EPS.FAINR;                      00002110
                IF FEIL_IND ^= 3 THEN                                   00002120
                   FEIL_IND  = FEIL_IND + 1;                            00002130
             END;                                                       00002140
                                                                        00002150
          IF EPS.GP_OS_KODENR ^= 0 &                                    00002160
             EPS.GP_OS_KODENR ^= 999 THEN                               00002170
             DO;                                                        00002180
                W01_FEIL_NR(FEIL_IND) = EPS.GP_OS_KODENR;               00002190
                IF FEIL_IND ^= 3 THEN                                   00002200
                   FEIL_IND  = FEIL_IND + 1;                            00002210
             END;                                                       00002220
                                                                        00002230
          IF EPS.HJEMMEL_10_8NR ^= 0 &                                  00002240
             EPS.HJEMMEL_10_8NR ^= 999 THEN                             00002250
             DO;                                                        00002260
                W01_FEIL_NR(FEIL_IND) = EPS.HJEMMEL_10_8NR;             00002270
                IF FEIL_IND ^= 3 THEN                                   00002280
                   FEIL_IND  = FEIL_IND + 1;                            00002290
             END;                                                       00002300
                                                                        00002310
          IF EPS.FRAMLEGGSDATO_MÅNR ^= 0 &                              00002320
             EPS.FRAMLEGGSDATO_MÅNR ^= 999 THEN                         00002330
             DO;                                                        00002340
                W01_FEIL_NR(FEIL_IND) = EPS.FRAMLEGGSDATO_MÅNR;         00002350
                IF FEIL_IND ^= 3 THEN                                   00002360
                   FEIL_IND  = FEIL_IND + 1;                            00002370
             END;                                                       00002380
                                                                        00002390
          IF EPS.FRAMLEGGSKODENR ^= 0 &                                 00002400
             EPS.FRAMLEGGSKODENR ^= 999 THEN                            00002410
             DO;                                                        00002420
                W01_FEIL_NR(FEIL_IND) = EPS.FRAMLEGGSKODENR;            00002430
                IF FEIL_IND ^= 3 THEN                                   00002440
                   FEIL_IND  = FEIL_IND + 1;                            00002450
             END;                                                       00002460
                                                                        00002470
          IF EPS.VIRK_DATO_MÅNR ^= 0 &                                  00002480
             EPS.VIRK_DATO_MÅNR ^= 999 THEN                             00002490
             DO;                                                        00002500
                W01_FEIL_NR(FEIL_IND) = EPS.VIRK_DATO_MÅNR;             00002510
                IF FEIL_IND ^= 3 THEN                                   00002520
                   FEIL_IND  = FEIL_IND + 1;                            00002530
             END;                                                       00002540
                                                                        00002550
          IF EPS.FNR_EKNR ^= 0 &                                        00002560
             EPS.FNR_EKNR ^= 999 THEN                                   00002570
             DO;                                                        00002580
                W01_FEIL_NR(FEIL_IND) = EPS.FNR_EKNR;                   00002590
                IF FEIL_IND ^= 3 THEN                                   00002600
                   FEIL_IND  = FEIL_IND + 1;                            00002610
             END;                                                       00002620
                                                                        00002630
          IF EPS.NAVN_EKNR ^= 0 &                                       00002640
             EPS.NAVN_EKNR ^= 999 THEN                                  00002650
             DO;                                                        00002660
                W01_FEIL_NR(FEIL_IND) = EPS.NAVN_EKNR;                  00002670
                IF FEIL_IND ^= 3 THEN                                   00002680
                   FEIL_IND  = FEIL_IND + 1;                            00002690
             END;                                                       00002700
                                                                        00002710
          IF EPS.NORSK_BOSATT_EKNR ^= 0 &                               00002720
             EPS.NORSK_BOSATT_EKNR ^= 999 THEN                          00002730
             DO;                                                        00002740
                W01_FEIL_NR(FEIL_IND) = EPS.NORSK_BOSATT_EKNR;          00002750
                IF FEIL_IND ^= 3 THEN                                   00002760
                   FEIL_IND  = FEIL_IND + 1;                            00002770
             END;                                                       00002780
                                                                        00002790
          IF EPS.DØDSDATO_EKNR ^= 0 &                                   00002800
             EPS.DØDSDATO_EKNR ^= 999 THEN                              00002810
             DO;                                                        00002820
                W01_FEIL_NR(FEIL_IND) = EPS.DØDSDATO_EKNR;              00002830
                IF FEIL_IND ^= 3 THEN                                   00002840
                   FEIL_IND  = FEIL_IND + 1;                            00002850
             END;                                                       00002860
                                                                        00002870
          IF EPS.VILKÅR_8_4_EKNR ^= 0 &                                 00002880
             EPS.VILKÅR_8_4_EKNR ^= 999 THEN                            00002890
             DO;                                                        00002900
                W01_FEIL_NR(FEIL_IND) = EPS.VILKÅR_8_4_EKNR;            00002910
                IF FEIL_IND ^= 3 THEN                                   00002920
                   FEIL_IND  = FEIL_IND + 1;                            00002930
             END;                                                       00002940
                                                                        00002950
          IF EPS.PI_EKNR ^= 0 &                                         00002960
             EPS.PI_EKNR ^= 999 THEN                                    00002970
             DO;                                                        00002980
                W01_FEIL_NR(FEIL_IND) = EPS.PI_EKNR;                    00002990
                IF FEIL_IND ^= 3 THEN                                   00003000
                   FEIL_IND  = FEIL_IND + 1;                            00003010
             END;                                                       00003020
                                                                        00003030
          DO I = 1 TO 4;                                                00003040
             IF EPS.VP_ÅR_EKNR(I) ^= 0 &                                00003050
                EPS.VP_ÅR_EKNR(I) ^= 999 THEN                           00003060
                DO;                                                     00003070
                   W01_FEIL_NR(FEIL_IND) = EPS.VP_ÅR_EKNR(I);           00003080
                   IF FEIL_IND ^= 3 THEN                                00003090
                      FEIL_IND = FEIL_IND + 1;                          00003100
                END;                                                    00003110
          END;                                                          00003120
                                                                        00003130
                                                                        00003140
                                                                        00003150
    END FINN_FEIL_EP;                                                   00003160
                                                                        00003170
                                                                        00003180
 %PAGE;                                                                 00003190
 /* ***************************************************************** */00003200
 /*          E K S T E R N E    P R O C E D U R E R                   */00003210
 /* ***************************************************************** */00003220
                                                                        00003230
 %PAGE;                                                                 00003240
 %INCLUDE R0010802;          /*     BLANK EP TRANSOMR   */              00003250
 %PAGE;                                                                 00003260
 %INCLUDE R0010803;          /*     KONTR EP SØKER      */              00003270
                                                                        00003280
                                                                        00003290
 END P108_BEHANDLE_EP;                                                  00003300
                                                                        00003310
                                                                        00003320
