 /*       SIST ENDRET 12/06-98 13.36.30 AV   SPA7339                  */00000000
 /*       SIST ENDRET 24/10-97 11.57.29 AV   JDA7339                  */00000010
 /*       SIST ENDRET 28/08-97 08.56.15 AV   SPA7339                  */00000020
 /*       SIST ENDRET 20/08-97 15.22.19 AV   HLA7339                  */00000030
 /*       SIST ENDRET 20/08-97 08.51.56 AV   HLA7339                  */00000040
 /*       SIST ENDRET 19/08-97 14.36.50 AV   TSB7339                  */00000050
 /*       SIST ENDRET 14/08-97 15.13.56 AV   HLA7339                  */00000060
 /*       SIST ENDRET 04/08-97 14.37.14 AV   SPA7339                  */00000070
 /*       SIST ENDRET 11/11-96 12.14.35 AV   JDA0310                  */00000080
 /*       SIST ENDRET 18/10-94 15.13.15 AV   JDA0310                  */00000090
 /*       SIST ENDRET 08/10-93 09.17.58 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 01/10-92 13.22.44 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 05/03-92 15.55.58 AV   HERMAN                   */00000120
 /*       SIST ENDRET 03/02-92 14.04.35 AV   DYBVIK                   */00000130
 /* *************************************************************** */  00000140
 /* IDENTIFIKASJON:  R0017001                                       */  00000150
 /* PROGRAMMERER:    HELEN  JULI, 1982.                             */  00000160
 /* HENSIKT:                                                        */  00000170
 /*        SENDER DATA TIL STØNADSBREV BASEN. FOR HVER TRANSAKSJON  */  00000180
 /*        HVOR ET STØNADSBREV ØNSKES, LAGES ET ROT_SEGMENT OG ET   */  00000190
 /*        HENDELSE_SEGMENT I STØNADSBREV BASEN. ROT_SEGMENTET      */  00000200
 /*        OPPDATERES NÅR ALLE TRANSAKSJONER ER FERDIG BEHANDLET.   */  00000210
 /*        ET NYTT HENDELSE_SEGMENT SKRIVES FOR HVER TRANSAKSJON.   */  00000220
 /*        FNR TIL ALLE SOM SKAL FÅ STØNADSBREV BLIR OPPBEVART I    */  00000230
 /*        FNR_TABELL FOR Å SIKRE AT ALLE FÅR OPPDATERT ROTEN       */  00000240
 /*        TIL SLUTT.                                               */  00000250
 /* PROGRAM_TILKNYTNING:  KALLES OPP I BEHANDLE_TRANS.              */  00000260
 /* *************************************************************** */  00000270
 /* PROGRAM SOM BRUKES I R0017001                                   */  00000280
 /* *************************************************************** */  00000290
 /*     R0017021      OPPRETT_SB_ROT_SEGMENT                        */  00000300
 /*     R0017025      LAG_FNR_TAB                                   */  00000310
 /*     R0017022      LAG_BARNEP_EN_HEND                            */  00000320
 /*         R0017041      PLASSER_TEKSTTYPE_A_KODE                  */  00000330
 /*         R0017042      PLASSER_TEKSTTYPE_M_KODE                  */  00000340
 /*         R0017043      PLASSER_TEKSTTYPE_O_KODE                  */  00000350
 /*         R0017044      PLASSER_TEKSTTYPE_U_KODE                  */  00000360
 /*         R0017045      PLASSER_TEKSTTYPE_V_KODE                  */  00000370
 /*     R0017023      LAG_BARNEP_BEGGE_HEND                         */  00000380
 /*         R0017048      BYGG_OPP_BERGRUNL_DØD                     */  00000390
 /*     R0017031      LAG_ALDERSP_HEND                              */  00000400
 /*         R0017047      BYGG_OPP_BERGRUNL_SEGMENT                 */  00000410
 /*     R0017032      LAG_UFØRPENS_HEND                             */  00000420
 /*     R0017033      LAG_ETTERL_HEND                               */  00000430
 /*     R0017034      LAG_ETTERL_FAM_HEND                           */  00000440
 /*     R0017035      LAG_ETTERL_ALDERSP_HEND                       */  00000450
 /*     R0017036      LAG_ETTERL_UFØRPENS_HEND                      */  00000460
 /* YS  R0017037      LAG_YRKEPENS_HEND                             */  00000470
 /* *************************************************************** */  00000480
 /* DIVERSE FELLES PROGRAM                                          */  00000490
 /* *************************************************************** */  00000500
 /* R0019905  F_ALDER   (REGNER UT ALDER VED VIRKNINGSDATO)         */  00000510
 /* R0019913  F_SNU_DATO(SNUR DATO FRA MÅNED-ÅR TIL ÅR-MÅNED)       */  00000520
 /* *************************************************************** */  00000530
 LAG_SB:                                                                00000540
     PROC(COMMAREA_PEKER)   OPTIONS (MAIN);                             00000550
                                                                        00000560
 PROGRAM_ID = 'R0017001';                                               00000570
                                                                        00000580
 DCL 1    B01 BASED(B01_PEKER),  %INCLUDE P0019921;                     00000590
 DCL 1    B02 BASED(B02_PEKER),  %INCLUDE P0019921;                     00000600
 DCL      COMMAREA_PEKER         POINTER;                               00000610
                                                                        00000620
  /* **************************************************************** */00000630
  /*                                                                  */00000640
  /*     DLI CALL-PARAMETRE                                           */00000650
  /*                                                                  */00000660
  /* **************************************************************** */00000670
                                                                        00000680
     DCL 1  W001_DLI               UNALIGNED,                           00000690
            2   GU                 CHAR     (4)   INIT('GU  '),         00000700
            2   GN                 CHAR     (4)   INIT('GN  '),         00000710
            2   ISRT               CHAR     (4)   INIT('ISRT'),         00000720
            2   PARM_CT_3          FIXED BIN(31)  INIT(3),              00000730
            2   PARM_CT_4          FIXED BIN(31)  INIT(4),              00000740
            2   PARM_CT_5          FIXED BIN(31)  INIT(5);              00000750
                                                                        00000760
  /* **************************************************************** */00000770
  /*                                                                  */00000780
  /*     DL1 SSA-OMRÅDER FOR  ROT OG STATUS-SEGMENTER.                */00000790
  /*                                                                  */00000800
  /* **************************************************************** */00000810
                                                                        00000820
     DCL 1  SSA1_SB0PERSN          UNALIGNED,                           00000830
            2    HDEL                            CHAR (17)  INIT        00000840
                 ('SB0PERSN(FNR     '),                                 00000850
            2    REL_OP                          CHAR (2)   INIT (' ='),00000860
            2    PKEY               FIXED        DEC  (11)  INIT ( 0 ), 00000870
            2    HP                              CHAR (1)   INIT (')'); 00000880
                                                                        00000890
  /* **************************************************************** */00000900
  /*                                                                  */00000910
  /*     PCB-OMRÅDET FOR FOLKETRYGD-DB.                               */00000920
  /*                                                                  */00000930
  /* **************************************************************** */00000940
                                                                        00000950
  %INCLUDE  DLIUIB;                                                     00000960
                                                                        00000970
 /* ***************************************************************** */00000980
 /* HER INCLUDERES DIVERSR COPY-OMRÅDER                               */00000990
 /* ***************************************************************** */00001000
                                                                        00001010
                                                                        00001020
  %INCLUDE  P0012002; /* DCL AV PCB PEKERE                            */00001030
                                                                        00001040
     DCL 1  PCB_SB1       BASED        (SB1_PCB_PEKER),                 00001050
  %INCLUDE  P0012003;                  /* DCL AV SSA                  */00001060
                                                                        00001070
     DCL    SSA_UQUAL                             CHAR  (9);            00001080
 %PAGE;                                                                 00001090
 %INCLUDE P0019906; /* DCL AV TRANS_OPPL_OMR                       */   00001100
 %PAGE;                                                                 00001110
 %INCLUDE P0019908; /* DCL AV KOM_OMR                              */   00001120
 %PAGE;                                                                 00001130
 %INCLUDE P0019910; /* DCL AV STYRINGS_OMR                         */   00001140
 %PAGE;                                                                 00001150
 %INCLUDE P0019912; /* DIV_PARAM_OMR                               */   00001160
 %PAGE;                                                                 00001170
 %INCLUDE P0019924; /* GRUNNBELØP VEIET GJENNOMSNITT               */   00001180
 %PAGE;                                                                 00001190
 %INCLUDE P0019925; /* GRUNNBELØPSTABELL                           */   00001200
 %PAGE;                                                                 00001210
 %INCLUDE P0019014; /* FNRTAB FOR R0017001/R0017101                */   00001220
 %PAGE;                                                                 00001230
 %INCLUDE P0019001; /* DCL AV W_ROT,W_HENDELSE OG W_BERGR          */   00001240
 %PAGE;                                                                 00001250
 %INCLUDE P0014003; /* DCL AV POENGREKKER                          */   00001260
 %PAGE;                                                                 00001270
 %INCLUDE P0014009; /* DCL AV POENGREKKER                          */   00001280
 %PAGE;                                                                 00001290
 DCL  1  TRANS_LISTE_OMR   UNAL  BASED (TRANS_LISTE_PEKER),             00001300
         3 TRANS_LISTE_LINJE(5),                                        00001310
                                                                        00001320
 %INCLUDE P0019911; /* DCL AV FAST DEL OG VARIABEL DEL             */   00001330
                                                                        00001340
 DCL  SBROT_FNR              FIXED DEC (11);                            00001350
 DCL  FORSØRG_FNR            FIXED DEC (11);                            00001360
 DCL  SB_IND                 FIXED BIN (15);                            00001370
 DCL  EKT_IND                FIXED BIN (15);                            00001380
 DCL  AVDIND                 FIXED BIN (15);                            00001390
 DCL (I,                                                                00001400
      J,                                                                00001410
      K,                                                                00001420
      L,                                                                00001430
      M)                     FIXED BIN (15);                            00001440
 DCL  PLITDLI                ENTRY;                                     00001450
 DCL (ADDR,                                                             00001460
      ROUND,                                                            00001470
      SUBSTR,                                                           00001480
      VERIFY)                BUILTIN;                                   00001490
 DCL  UIB_RC_OK              BIT(8)  INIT('00000000'B);                 00001500
                                                                        00001510
 DCL 1 W_FNR PIC '(11)9';                                               00001520
                                                                        00001530
 DCL                                                                    00001540
     1 FNR_R DEF W_FNR,                                                 00001550
       2 DAG      PIC '99',                                             00001560
       2 MND      PIC '99',                                             00001570
       2 ÅR       PIC '99',                                             00001580
       2 ÅRHUNDRE PIC '9',                                              00001590
       2 FILLER   PIC '9999';                                           00001600
                                                                        00001610
 DCL                                                                    00001620
     1 W_FNR_R DEF W_FNR,                                               00001630
       2 DAG      PIC '99',                                             00001640
       2 MND      PIC '99',                                             00001650
       2 ÅR       PIC '99',                                             00001660
       2 ÅRHUNDRE PIC '9',                                              00001670
       2 FILLER   PIC '9999';                                           00001680
                                                                        00001690
  DCL W_FNR_ÅM   PIC '9999';                   /*NY92*/                 00001700
 /* *************************************************************** */  00001710
 /* REDEFINERER OG OMPLASSERER HENDDATO OG FRAMLEGGSDATO FRA B02    */  00001720
 /* *************************************************************** */  00001730
                                                                        00001740
 DCL                                                                    00001750
     1 R_HENDDATO,                                                      00001760
       2 BLANKE1     CHAR (3),                                          00001770
       2 AAR         CHAR (2),                                          00001780
       2 MND         CHAR (2),                                          00001790
       2 BLANKE3     CHAR (1);                                          00001800
 DCL R_HENDDATO_D DEF R_HENDDATO CHAR (8);                              00001810
 DCL                                                                    00001820
     1 R_FRAMDATO,                                                      00001830
       2 BLANKE1     CHAR (3),                                          00001840
       2 AAR         CHAR (2),                                          00001850
       2 MND         CHAR (2),                                          00001860
       2 BLANKE3     CHAR (1);                                          00001870
 DCL R_FRAMDATO_D DEF R_FRAMDATO CHAR (8);                              00001880
 DCL OMR_DATO        PIC '9999';                                        00001890
                                                                        00001900
 /*                                                                     00001910
 DCL HLB02 LIKE B02;                                                    00001920
     HLB02 = B02;                                                       00001930
 */                                                                     00001940
 %PAGE;                                                                 00001950
                                                                        00001960
 /* *************************************************************** */  00001970
 /*                                                                 */  00001980
 /*   HER BEGYNNER PROGRAMMET.                                      */  00001990
 /*                                                                 */  00002000
 /*                                                                 */  00002010
 /* *************************************************************** */  00002020
                                                                        00002030
                                                                        00002040
 UIBPTR       =       UIB_PEKER;                                        00002050
                                                                        00002060
 /* *************************************************************** */  00002070
 /* VI FINNER HVEM SOM SKAL FÅ ST_BREV.(SB_IND)                     */  00002080
 /* *************************************************************** */  00002090
                                                                        00002100
                                                                        00002110
    DCL TRANSDATO   PIC '9999' INIT (0);                                00002120
    DCL VDATOK  PIC '9999' INIT (0);                                    00002130
    DCL VDATOM  PIC '9999' INIT (0);                                    00002140
   TRANSDATO   =    TRANS_OPPL_OMR.VIRKNINGSDATO;                       00002150
   VDATOK      =    B02.VIRK_DATO_ÅM(1);                                00002160
   VDATOM      =    B02.VIRK_DATO_ÅM(2);                                00002170
                                                                        00002180
                                                                        00002190
  SELECT (TRANS_OPPL_OMR.TRANSTYPE);                                    00002200
                                                                        00002210
          WHEN   (17)                                                   00002220
 /* *************************************************************** */  00002230
 /*  SØKEREN ER FORSØRGET EKTEFELLE.PENSJONISTEN FÅR ST-BREV.       */  00002240
 /* *************************************************************** */  00002250
                                                                        00002260
             SB_IND = EKTEF_IND;                                        00002270
                                                                        00002280
                                                                        00002290
          WHEN   (19)                                                   00002300
 /* *************************************************************** */  00002310
 /*  SØKEREN ER ET FORSØRGET BARN . FORSØRGEREN FÅR ST-BREV.        */  00002320
 /* *************************************************************** */  00002330
                                                                        00002340
             DO;                                                        00002350
                FORSØRG_FNR = B01.TILKN.FNR_TILKN(SØKER_IND,1);         00002360
                IF B02.RF0PERSN.FNR(1) = FORSØRG_FNR  THEN              00002370
                   SB_IND = 1;                                          00002380
                ELSE                                                    00002390
                    SB_IND = 2;                                         00002400
             END;                                                       00002410
                                                                        00002420
                                                                        00002430
                                                                        00002440
          WHEN   (35,37)                                                00002450
 /* *************************************************************** */  00002460
 /*  SØKEREN ER BARNEPENSJONIST MED SØSKEN.                         */  00002470
 /* *************************************************************** */  00002480
                                                                        00002490
             DO;                                                        00002500
                                                                        00002510
                DO I = 3 TO 14;                                         00002520
                   IF B02.PENSJONSTYPE2(I) = 'P'    THEN                00002530
                      DO;                                               00002540
                         SB_IND = I;                                    00002550
                         I = 14;                                        00002560
                      END;                                              00002570
                END;                                                    00002580
                                                                        00002590
             END;                                                       00002600
                                                                        00002610
          OTHERWISE                                                     00002620
                                                                        00002630
             SB_IND = SØKER_IND;                                        00002640
                                                                        00002650
                                                                        00002660
 END;      /* SELECT */                                                 00002670
                                                                        00002680
                                                                        00002690
 IF SB_IND < 3  THEN                                                    00002700
                                                                        00002710
 /* *************************************************************** */  00002720
 /*  PERSONEN ER IKKE BARNEPENSJONIST                               */  00002730
 /* *************************************************************** */  00002740
                                                                        00002750
    EKT_IND = 3 - SB_IND;                                               00002760
                                                                        00002770
  SSA1_SB0PERSN.PKEY       = B02.RF0PERSN.FNR(SB_IND);                  00002780
  CALL FINN_NR;                                                         00002790
                                                                        00002800
                                                                        00002810
 IF (TRANS_OPPL_OMR.TRANSTYPE = 18 !                                    00002820
     TRANS_OPPL_OMR.TRANSTYPE = 54 !                                    00002830
     TRANS_OPPL_OMR.TRANSTYPE = 36 !                                    00002840
     TRANS_OPPL_OMR.TRANSTYPE = 55) THEN                                00002850
                                                                        00002860
  IF W_ROT.NESTE_SB_VERSJON_NR = 1    THEN                              00002870
                                                                        00002880
     IF (TRANS_OPPL_OMR.TRANSTYPE = 18 !                                00002890
         TRANS_OPPL_OMR.TRANSTYPE = 36) THEN                            00002900
           CALL LAG_EKTEF_SB;                                           00002910
      ELSE                                                              00002920
           GO TO L999;                                                  00002930
  ELSE                                                                  00002940
    IF (B02.STATUS_KODE_HIST(SB_IND) ='O' !                             00002950
        B02.STATUS_KODE_HIST(SB_IND) ='X' !                             00002960
        B02.PENSJONSTYPE1(SB_IND) ='G' ) THEN                           00002970
       DO;                                                              00002980
          SBROT_FNR  =  B02.RF0PERSN.FNR(SB_IND);                       00002990
          CALL OPPRETT_SB_ROT_SEGMENT(SBROT_FNR,SB_IND);                00003000
          IF FEIL_MELD_NR > 0 THEN                                      00003010
             GO TO L999;                                                00003020
          CALL LAG_FNR_TAB(SB_IND);                                     00003030
          W_HENDELSE          = '';                                     00003040
          IF (TRANS_OPPL_OMR.TRANSTYPE = 18 !                           00003050
              TRANS_OPPL_OMR.TRANSTYPE = 54) THEN                       00003060
                R_HENDDATO_D        = B02.STATUS.DØDSDATO_ÅMD(SB_IND);  00003070
          ELSE                                                          00003080
                R_HENDDATO_D        = B02.STATUS.VIRK_DATO_ÅM(SB_IND);  00003090
          HENDDATO            = R_HENDDATO.AAR !!R_HENDDATO.MND;        00003100
          W_HENDELSE.VERSJON  =  W_ROT.NESTE_SB_VERSJON_NR;             00003110
          W_HENDELSE.TERMINAL      = EIBTRMID;                          00003120
          W_HENDELSE.PENSJONSTYPE1 = B01.PENSJONSTYPE1(SB_IND);         00003130
          W_HENDELSE.PENSJONSTYPE2 = B01.PENSJONSTYPE2(SB_IND);         00003140
          W_HENDELSE.PENSJONSTYPE3 = B01.PENSJONSTYPE3(SB_IND);         00003150
                                                                        00003160
                                                                        00003170
          W_HENDELSE.FNR_EKTEF     = B01.FNR       (EKTEF_IND);         00003180
          W_HENDELSE.NAVN_EKTEF    = B01.NAVN      (EKTEF_IND);         00003190
 /* ***************************************************************** */00003200
 /* OPPHØRSKODE OG OPPHØRSDATO ER LAGT INN 21.1 85                    */00003210
 /* ***************************************************************** */00003220
                                                                        00003230
          IF (TRANS_OPPL_OMR.TRANSTYPE = 18 !                           00003240
              TRANS_OPPL_OMR.TRANSTYPE = 54) THEN                       00003250
               W_HENDELSE.OPPHØRS_KODE = B02.PENSJONSTYPE1(SB_IND);     00003260
          ELSE                                                          00003270
             IF B02.PENSJONSTYPE1(SB_IND) ='G' THEN                     00003280
                W_HENDELSE.OPPHØRS_KODE = 'O';                          00003290
             ELSE                                                       00003300
                W_HENDELSE.OPPHØRS_KODE = B02.STATUS_KODE_HIST(SB_IND); 00003310
          W_HENDELSE.OPPHØRS_DATO = R_HENDDATO.AAR !!R_HENDDATO.MND;    00003320
          CALL INSERT_HENDELSE;                                         00003330
          IF (TRANS_OPPL_OMR.TRANSTYPE = 18 !                           00003340
              TRANS_OPPL_OMR.TRANSTYPE = 36) THEN                       00003350
             CALL LAG_EKTEF_SB;                                         00003360
          GO TO L999;                                                   00003370
       END;                                                             00003380
     ELSE                                                               00003390
          GO TO L999;                                                   00003400
                                                                        00003410
 IF SB_IND < 3  THEN                                                    00003420
    DO;                                                                 00003430
    /*  BARE FOR TEST                                                   00003440
       DCL HL_TRANSTYPE  CHAR(2);                                       00003450
       DCL HL_B02_SUM  FIXED DEC (7);                                   00003460
       DCL HL_B01_SUM  FIXED DEC (7);                                   00003470
       DCL HL_B02_APTP FIXED DEC (7);                                   00003480
       DCL HL_B01_APTP FIXED DEC (7);                                   00003490
       DCL HL_B02_GT   FIXED DEC (7);                                   00003500
       DCL HL_B01_GT   FIXED DEC (7);                                   00003510
       DCL HL_B02_TPNETTO  FIXED DEC (7);                               00003520
       DCL HL_B01_TPNETTO  FIXED DEC (7);                               00003530
       HL_TRANSTYPE = TRANS_OPPL_OMR.TRANSTYPE;                         00003540
       HL_B02_SUM   = B02.SUM_YTELSE(SB_IND);                           00003550
       HL_B01_SUM   = B01.SUM_YTELSE(SB_IND);                           00003560
       HL_B02_APTP  = B02.ALDERSP.AP_TP_NETTO(SB_IND);                  00003570
       HL_B01_APTP  = B01.ALDERSP.AP_TP_NETTO(SB_IND);                  00003580
       HL_B02_GT    = B02.GT_TILLEGG_LOV92(SB_IND);                     00003590
       HL_B01_GT    = B01.GT_TILLEGG_LOV92(SB_IND);                     00003600
       HL_B02_TPNETTO = B02.ETTEPENS.TP_NETTO(SB_IND);                  00003610
       HL_B01_TPNETTO = B01.ETTEPENS.TP_NETTO(SB_IND);                  00003620
                                                                        00003630
       BARE TEST     */                                                 00003640
 IF  TRANS_OPPL_OMR.TRANSTYPE = 26  &                                   00003650
    (B02.SUM_YTELSE(SB_IND)   =                                         00003660
     B01.SUM_YTELSE(SB_IND)) &                                          00003670
                                                                        00003680
                                                                        00003690
    (B02.SUM_YTELSE(SB_IND) ^= 0) &                                     00003700
                                                                        00003710
    (B02.ALDERSP.AP_TP_NETTO(SB_IND)   =                                00003720
     B01.ALDERSP.AP_TP_NETTO(SB_IND))      &                            00003730
    (B02.GT_TILLEGG_LOV92(SB_IND)  =                                    00003740
     B01.GT_TILLEGG_LOV92(SB_IND))       &                              00003750
                                                                        00003760
                                                                        00003770
    (B02.ETTEPENS.TP_NETTO(SB_IND)   =                                  00003780
     B01.ETTEPENS.TP_NETTO(SB_IND))      THEN                           00003790
                                                                        00003800
                                                                        00003810
       DO;                                                              00003820
          IF B02.PENSJONSTYPE2(EKT_IND) = 'P'        !                  00003830
             B02.PENSJONSTYPE2(EKT_IND) = 'N'        !                  00003840
             B02.PENSJONSTYPE2(EKT_IND) = 'S'        THEN               00003850
             CALL LAG_EKTEF_SB;                                         00003860
          GO TO L999;                                                   00003870
       END;                                                             00003880
                                                                        00003890
  END;                                                                  00003900
                                                                        00003910
                                                                        00003920
                                                                        00003930
                                                                        00003940
 IF (TRANS_OPPL_OMR.TRANSTYPE = 43 !  /* INNTEKTSRAPPORT FOR 66-ÅRET */ 00003950
     TRANS_OPPL_OMR.TRANSTYPE = 44) & /* INNTEKTSRAPPORT FOR 69-ÅRET */ 00003960
    (B01.ALDERSP.TP(SB_IND)   = 0)  &                                   00003970
    (B02.ALDERSP.TP(SB_IND)   = 0)   THEN                               00003980
     GO TO L999;                                                        00003990
                                                                        00004000
       SBROT_FNR  =  B02.RF0PERSN.FNR(SB_IND);                          00004010
       CALL OPPRETT_SB_ROT_SEGMENT(SBROT_FNR,SB_IND);                   00004020
       IF FEIL_MELD_NR > 0 THEN                                         00004030
          GO TO L999;                                                   00004040
       CALL LAG_FNR_TAB(SB_IND);                                        00004050
                                                                        00004060
 SELECT (B02.STATUS.PENSJONSTYPE1(SB_IND));                             00004070
    WHEN   ('N')                                                        00004080
     DO;                                                                00004090
                                                                        00004100
                                                                        00004110
       IF TRANS_OPPL_OMR.TRANSTYPE = 2 THEN                             00004120
          DO;                                                           00004130
             SBROT_FNR  =  B02.RF0PERSN.FNR(SB_IND);                    00004140
             CALL OPPRETT_SB_ROT_SEGMENT(SBROT_FNR,SB_IND);             00004150
             IF FEIL_MELD_NR > 0 THEN                                   00004160
                GO TO L999;                                             00004170
             CALL LAG_FNR_TAB(SB_IND);                                  00004180
             CALL LAG_BARNEP_EN_HEND(SB_IND);                           00004190
          END;                                                          00004200
       ELSE                                                             00004210
                                                                        00004220
 /* ***************************************************************** */00004230
 /* PERSONEN ER BARNEPENSJONIST. ALLE BARNA FÅR ST_BREV.              */00004240
 /* ***************************************************************** */00004250
                                                                        00004260
          DO SB_IND = 3 TO 14 ;                                         00004270
             IF B02.STATUS.PENSJONSTYPE1   (SB_IND) = 'N' &             00004280
                B02.STATUS.STATUS_KODE_HIST(SB_IND) = ' '    THEN       00004290
                DO;                                                     00004300
                   SBROT_FNR  =  B02.RF0PERSN.FNR(SB_IND);              00004310
                   CALL OPPRETT_SB_ROT_SEGMENT(SBROT_FNR,SB_IND);       00004320
                   IF FEIL_MELD_NR > 0 THEN                             00004330
                      GO TO L999;                                       00004340
                   CALL LAG_FNR_TAB(SB_IND);                            00004350
                   CALL LAG_BARNEP_EN_HEND(SB_IND);                     00004360
                END;                                                    00004370
         END;                                                           00004380
     END;                                                               00004390
    WHEN   ('B')                                                        00004400
                                                                        00004410
 /* ***************************************************************** */00004420
 /* PERSONEN ER ET FORELDRELØST BARN. ALLE BARNA FÅR ST_BREV.         */00004430
 /* ***************************************************************** */00004440
                                                                        00004450
       DO SB_IND = 3 TO 14 ;                                            00004460
          IF B02.STATUS.PENSJONSTYPE1   (SB_IND) = 'B'  &               00004470
             B02.STATUS.STATUS_KODE_HIST(SB_IND) = ' '    THEN          00004480
             DO;                                                        00004490
                SBROT_FNR  =  B02.RF0PERSN.FNR(SB_IND);                 00004500
                CALL OPPRETT_SB_ROT_SEGMENT(SBROT_FNR,SB_IND);          00004510
                IF FEIL_MELD_NR > 0 THEN                                00004520
                   GO TO L999;                                          00004530
                CALL LAG_FNR_TAB(SB_IND);                               00004540
                CALL LAG_BARNEP_BEGGE_HEND(SB_IND);                     00004550
             END;                                                       00004560
       END;                                                             00004570
                                                                        00004580
 /* ***************************************************************** */00004590
 /* PERSONEN ER ALDERSPENSJONIST.                                     */00004600
 /* ***************************************************************** */00004610
                                                                        00004620
    WHEN   ('A')                                                        00004630
       DO;                                                              00004640
                                                                        00004650
 /* ***************************************************************** */00004660
 /* PERSONEN HAR ETTERLATTE RETTIGHETER.                              */00004670
 /* ***************************************************************** */00004680
                                                                        00004690
          IF B02.PENSJONSTYPE2(SB_IND) = 'E' &                          00004700
             B02.ETTEPENS.TP_BRUTTO(SB_IND) > 0     THEN                00004710
             DO;                                                        00004720
                CALL LAG_ETTERL_ALDERSP_HEND(SB_IND);                   00004730
             END;                                                       00004740
          ELSE                                                          00004750
             DO;                                                        00004760
                CALL LAG_ALDERSP_HEND(SB_IND,EKT_IND);                  00004770
                                                                        00004780
                IF B02.RF0PERSN.FNR         (EKT_IND)  >  0   &         00004790
                   (B02.STATUS.PENSJONSTYPE2(EKT_IND)  = 'P'  !         00004800
                    B02.STATUS.PENSJONSTYPE2(EKT_IND)  = 'N'  !         00004810
                    B02.STATUS.PENSJONSTYPE2(EKT_IND)  = 'S')   THEN    00004820
                                                                        00004830
 /* *************************************************************** */  00004840
 /*  SØKERENS EKTEFELLE SKAL OGSÅ FÅ STØNADSBREV.                   */  00004850
 /* *************************************************************** */  00004860
                                                                        00004870
                    CALL LAG_EKTEF_SB;                                  00004880
             END;                                                       00004890
                                                                        00004900
       END;                                                             00004910
                                                                        00004920
 /* ***************************************************************** */00004930
 /* AFP                         .                                     */00004940
 /* ***************************************************************** */00004950
                                                                        00004960
    WHEN   ('K')                                                        00004970
       DO;                                                              00004980
                                                                        00004990
           CALL LAG_ALDERSP_HEND(SB_IND,EKT_IND);                       00005000
                                                                        00005010
           IF B02.RF0PERSN.FNR         (EKT_IND)  >  0   &              00005020
             (B02.STATUS.PENSJONSTYPE2(EKT_IND)  = 'P'  !               00005030
              B02.STATUS.PENSJONSTYPE2(EKT_IND)  = 'N'  !               00005040
              B02.STATUS.PENSJONSTYPE2(EKT_IND)  = 'S')   THEN          00005050
                                                                        00005060
 /* *************************************************************** */  00005070
 /*  SØKERENS EKTEFELLE SKAL OGSÅ FÅ STØNADSBREV.                   */  00005080
 /* *************************************************************** */  00005090
                                                                        00005100
               CALL LAG_EKTEF_SB;                                       00005110
                                                                        00005120
       END;                                                             00005130
 /* ***************************************************************** */00005140
 /* PERSONEN ER UFØREPENSJONIST.                                      */00005150
 /* ***************************************************************** */00005160
                                                                        00005170
    WHEN   ('U')                                                        00005180
       DO;                                                              00005190
                                                                        00005200
 /* ***************************************************************** */00005210
 /* PERSONEN HAR ETTERLATTE RETTIGHETER.                              */00005220
 /* ***************************************************************** */00005230
                                                                        00005240
           IF B02.PENSJONSTYPE2(SB_IND) = 'E' &                         00005250
             (B02.ETTEPENS.TP_BRUTTO(SB_IND) +                          00005260
              B02.ETTEPENS.GP_BRUTTO(SB_IND) > 0)  THEN                 00005270
              DO;                                                       00005280
                 CALL LAG_ETTERL_UFØRPENS_HEND(SB_IND);                 00005290
              END;                                                      00005300
           ELSE                                                         00005310
              DO;                                                       00005320
                                                                        00005330
 /* *************************************************************** */  00005340
 /* KONVERTERT FRA BP/UP TIL UP                                     */  00005350
 /* *************************************************************** */  00005360
                                                                        00005370
                 IF SB_IND > 2 THEN                                     00005380
                    DO;                                                 00005390
                       EKT_IND    =  EKTEF_IND;                         00005400
                       SBROT_FNR  =  B02.RF0PERSN.FNR(SB_IND);          00005410
                       CALL OPPRETT_SB_ROT_SEGMENT(SBROT_FNR,SB_IND);   00005420
                       IF FEIL_MELD_NR > 0 THEN                         00005430
                          GO TO L999;                                   00005440
                       CALL LAG_FNR_TAB(SB_IND);                        00005450
                       CALL LAG_UFØRPENS_HEND(SB_IND,EKT_IND);          00005460
                    END;                                                00005470
                 ELSE                                                   00005480
                    DO;                                                 00005490
                       CALL LAG_UFØRPENS_HEND(SB_IND,EKT_IND);          00005500
                    END;                                                00005510
              END;                                                      00005520
                                                                        00005530
 /* *************************************************************** */  00005540
 /*  SØKERENS EKTEFELLE SKAL OGSÅ FÅ STØNADSBREV.                   */  00005550
 /* *************************************************************** */  00005560
                                                                        00005570
              IF  EKT_IND > 0 & SB_IND > 0  THEN                        00005580
                 DO;                                                    00005590
                    IF B02.RF0PERSN.FNR         (EKT_IND)  >  0   &     00005600
                       (B02.STATUS.PENSJONSTYPE2(EKT_IND)  = 'P'  !     00005610
                        B02.STATUS.PENSJONSTYPE2(EKT_IND)  = 'N'  !     00005620
                        B02.STATUS.PENSJONSTYPE2(EKT_IND)  = 'S') THEN  00005630
                       DO;                                              00005640
                          CALL LAG_EKTEF_SB;                            00005650
                       END;                                             00005660
                  END;                                                  00005670
       END;                                                             00005680
                                                                        00005690
 /* ***************************************************************** */00005700
 /* PERSONEN ER ETTERLATT EKTEFELLE.                                  */00005710
 /* ***************************************************************** */00005720
                                                                        00005730
    WHEN   ('E')                                                        00005740
       DO;                                                              00005750
          CALL LAG_ETTERLATT_HEND(SB_IND);                              00005760
       END;                                                             00005770
                                                                        00005780
 /* ***************************************************************** */00005790
 /* PERSONEN ER YRKESSKADEPENSJONIST                                  */00005800
 /* ***************************************************************** */00005810
                                                                        00005820
    WHEN   ('Y')                                                        00005830
       DO;                                                              00005840
                                                                        00005850
 /* ***************************************************************** */00005860
 /* PERSONEN HAR ETTERLATTE RETTIGHETER.                              */00005870
 /* ***************************************************************** */00005880
                                                                        00005890
           IF B02.PENSJONSTYPE2(SB_IND) = 'E' &                         00005900
             (B02.ETTEPENS.TP_BRUTTO(SB_IND) +                          00005910
              B02.ETTEPENS.GP_BRUTTO(SB_IND) > 0)  THEN                 00005920
              DO;                                                       00005930
                 CALL LAG_ETTERL_UFØRPENS_HEND(SB_IND);                 00005940
              END;                                                      00005950
          ELSE                                                          00005960
              DO;                                                       00005970
                                                                        00005980
 /* *************************************************************** */  00005990
 /* KONVERTERT FRA BP/UP TIL YP                                     */  00006000
 /* *************************************************************** */  00006010
                                                                        00006020
                 IF SB_IND > 2 THEN                                     00006030
                    DO;                                                 00006040
                       EKT_IND    =  EKTEF_IND;                         00006050
                       SBROT_FNR  =  B02.RF0PERSN.FNR(SB_IND);          00006060
                       CALL OPPRETT_SB_ROT_SEGMENT(SBROT_FNR,SB_IND);   00006070
                       IF FEIL_MELD_NR > 0 THEN                         00006080
                          GO TO L999;                                   00006090
                       CALL LAG_FNR_TAB(SB_IND);                        00006100
                       CALL LAG_YRKEPENS_HEND(SB_IND,EKT_IND);          00006110
                    END;                                                00006120
                 ELSE                                                   00006130
                    DO;                                                 00006140
                      CALL LAG_YRKEPENS_HEND(SB_IND,EKT_IND);           00006150
                    END;                                                00006160
             END;                                                       00006170
          IF B02.RF0PERSN.FNR         (EKT_IND)  >  0   &               00006180
             (B02.STATUS.PENSJONSTYPE2(EKT_IND)  = 'P'  !               00006190
 /*16.3.90 HL*/  B02.STATUS.PENSJONSTYPE2(EKT_IND)  = 'N'  !            00006200
              B02.STATUS.PENSJONSTYPE2(EKT_IND)  = 'S')   THEN          00006210
                                                                        00006220
 /* *************************************************************** */  00006230
 /*  SØKERENS EKTEFELLE SKAL OGSÅ FÅ STØNADSBREV.                   */  00006240
 /* *************************************************************** */  00006250
                                                                        00006260
                    CALL LAG_EKTEF_SB;                                  00006270
       END;                                                             00006280
                                                                        00006290
 /* ***************************************************************** */00006300
 /* PERSONEN ER ETTERLATT FAMILIE PERSON.(PENSJONSTYPE1 = 'J')        */00006310
 /* ***************************************************************** */00006320
                                                                        00006330
    WHEN   ('J')                                                        00006340
       DO;                                                              00006350
          CALL LAG_ETTERL_FAM_HEND(SB_IND);                             00006360
       END;                                                             00006370
    OTHERWISE;                                                          00006380
    END;                                                                00006390
                                                                        00006400
 %PAGE;                                                                 00006410
                                                                        00006420
                                                                        00006430
 LAG_EKTEF_SB:                                                          00006440
    PROC;                                                               00006450
       IF B01.SUM_YTELSE( EKT_IND) ^=                                   00006460
          B02.SUM_YTELSE( EKT_IND)    !                                 00006470
                                                                        00006480
          (B01.ALDERSP.AP_TP_NETTO( EKT_IND)                            00006490
                     + B01.UFØRPENS.TP(EKT_IND)) ^=                     00006500
          (B02.ALDERSP.AP_TP_NETTO( EKT_IND)                            00006510
                            + B02.UFØRPENS.TP(EKT_IND))  THEN           00006520
                                                                        00006530
          DO;                                                           00006540
             SBROT_FNR  =  B02.RF0PERSN.FNR(EKT_IND);                   00006550
             CALL OPPRETT_SB_ROT_SEGMENT(SBROT_FNR,EKT_IND);            00006560
             IF FEIL_MELD_NR > 0 THEN                                   00006570
                GO TO L999;                                             00006580
             CALL LAG_FNR_TAB(EKT_IND);                                 00006590
             IF B02.STATUS.PENSJONSTYPE1(EKT_IND) = 'A' THEN            00006600
                DO;                                                     00006610
                                                                        00006620
 /* ***************************************************************** */00006630
 /* PERSONEN HAR ETTERLATTE RETTIGHETER.TEST ETTERL AP 15.2 85 J.D    */00006640
 /* ***************************************************************** */00006650
                                                                        00006660
                  IF B02.PENSJONSTYPE2(EKT_IND) = 'E' &                 00006670
                     B02.ETTEPENS.TP_BRUTTO(EKT_IND) > 0     THEN       00006680
                     DO;                                                00006690
                        CALL LAG_ETTERL_ALDERSP_HEND(EKT_IND);          00006700
                     END;                                               00006710
                  ELSE                                                  00006720
                     DO;                                                00006730
                        CALL LAG_ALDERSP_HEND(EKT_IND,SB_IND);          00006740
                     END;                                               00006750
                END;                                                    00006760
                                                                        00006770
             IF B02.STATUS.PENSJONSTYPE1(EKT_IND) = 'K' THEN            00006780
                        CALL LAG_ALDERSP_HEND(EKT_IND,SB_IND);          00006790
                                                                        00006800
             IF B02.STATUS.PENSJONSTYPE1(EKT_IND) = 'U' THEN            00006810
                DO;                                                     00006820
                                                                        00006830
 /* ***************************************************************** */00006840
 /* PERSONEN HAR ETTERLATTE RETTIGHETER.TEST ETTERL UP 15.2 85 J.D.   */00006850
 /* ***************************************************************** */00006860
                                                                        00006870
                   IF B02.PENSJONSTYPE2(EKT_IND) = 'E' &                00006880
                     (B02.ETTEPENS.TP_BRUTTO(EKT_IND) +                 00006890
                      B02.ETTEPENS.GP_BRUTTO(EKT_IND) > 0)  THEN        00006900
                      DO;                                               00006910
                         CALL LAG_ETTERL_UFØRPENS_HEND(EKT_IND);        00006920
                      END;                                              00006930
                   ELSE                                                 00006940
                      DO;                                               00006950
                         CALL LAG_UFØRPENS_HEND(EKT_IND,SB_IND);        00006960
                      END;                                              00006970
                END;                                                    00006980
             IF B02.STATUS.PENSJONSTYPE1(EKT_IND) = 'Y' THEN            00006990
                DO;                                                     00007000
                                                                        00007010
 /* ***************************************************************** */00007020
 /* PERSONEN HAR YRKESSKADEPENSJON                                .   */00007030
 /* ***************************************************************** */00007040
                                                                        00007050
                         CALL LAG_YRKEPENS_HEND(EKT_IND,SB_IND);        00007060
                END;                                                    00007070
          END;                                                          00007080
  END LAG_EKTEF_SB;                                                     00007090
                                                                        00007100
 %PAGE;                                                                 00007110
                                                                        00007120
 INSERT_HENDELSE:    PROC;                                              00007130
                                                                        00007140
   /* *************************************************************** */00007150
   /*       RUTINEN SKAL INSERTE HENDELSESSEGMENT                     */00007160
   /* *************************************************************** */00007170
                                                                        00007180
     SSA_UQUAL   =    'HENDELSE ';                                      00007190
     CALL              PLITDLI (PARM_CT_5,                              00007200
                                ISRT,                                   00007210
                                PCB_SB1,                                00007220
                                W_HENDELSE,                             00007230
                                SSA1_SB0PERSN,                          00007240
                                SSA_UQUAL);                             00007250
                                                                        00007260
                                                                        00007270
                                                                        00007280
     IF PCB_SB1.STATUS_KODE  ^=  '  '  !                                00007290
        DLIUIB.UIBFCTR ^= UIB_RC_OK   THEN                              00007300
           DO;                                                          00007310
 L130:                                                                  00007320
             FEIL_MELD_NR = 500;                                        00007330
             FEIL_VED_LABEL = 'L130';                                   00007340
             DB_STATUS_KODE  = PCB_SB1.STATUS_KODE;                     00007350
             GO TO L999;                                                00007360
           END;                                                         00007370
                                                                        00007380
     END INSERT_HENDELSE;                                               00007390
                                                                        00007400
 INSERT_BERGR:    PROC;                                                 00007410
                                                                        00007420
   /* *************************************************************** */00007430
   /*       RUTINEN SKAL INSERTE BEREGNINGSGRUNNLAGSEGMENT            */00007440
   /* *************************************************************** */00007450
                                                                        00007460
     SSA_UQUAL   =    'BERGR    ';                                      00007470
     CALL              PLITDLI (PARM_CT_5,                              00007480
                                ISRT,                                   00007490
                                PCB_SB1,                                00007500
                                W_BERGRUNL,                             00007510
                                SSA1_SB0PERSN,                          00007520
                                SSA_UQUAL);                             00007530
     IF PCB_SB1.STATUS_KODE  ^=  '  '  !                                00007540
        DLIUIB.UIBFCTR ^= UIB_RC_OK   THEN                              00007550
           DO;                                                          00007560
 L150:                                                                  00007570
             FEIL_MELD_NR   = 500;                                      00007580
             FEIL_VED_LABEL = 'L150';                                   00007590
             GO TO L999;                                                00007600
           END;                                                         00007610
                                                                        00007620
     END INSERT_BERGR;                                                  00007630
                                                                        00007640
 INSERT_BERGRAVD:  PROC;                                                00007650
                                                                        00007660
   /* *************************************************************** */00007670
   /*       RUTINEN SKAL INSERTE BEREGNINGSGRUNNLAGSEGMENT_AVDØD      */00007680
   /* *************************************************************** */00007690
                                                                        00007700
     SSA_UQUAL   =    'BERGRAVD ';                                      00007710
     CALL              PLITDLI (PARM_CT_5,                              00007720
                                ISRT,                                   00007730
                                PCB_SB1,                                00007740
                                W_BERGRUNL_AVDØD,                       00007750
                                SSA1_SB0PERSN,                          00007760
                                SSA_UQUAL);                             00007770
     IF PCB_SB1.STATUS_KODE  ^=  '  '  !                                00007780
        DLIUIB.UIBFCTR ^= UIB_RC_OK   THEN                              00007790
           DO;                                                          00007800
 L160:                                                                  00007810
             FEIL_MELD_NR   = 500;                                      00007820
             FEIL_VED_LABEL = 'L160';                                   00007830
             GO TO L999;                                                00007840
           END;                                                         00007850
                                                                        00007860
     END INSERT_BERGRAVD;                                               00007870
                                                                        00007880
   /* ************************************************************** */ 00007890
   /*                                                                */ 00007900
   /* HER LESES ROT-SEGMENTET FOR Å FINNE SISTE VERSJON-NR.          */ 00007910
   /* DETTE OPPDATERES MED 1 FOR Å GI NESTE NR. TIL HENDELSENE .     */ 00007920
   /*                                                                */ 00007930
   /* ************************************************************** */ 00007940
                                                                        00007950
   FINN_NR:                                                             00007960
    PROC;                                                               00007970
                                                                        00007980
        DCL 1 SB0PERSN,                                                 00007990
            2 FNR       FIXED DEC      (11)      INIT (   0 )       ,   00008000
            2 VERS_NR   PIC            'ZZ9'     INIT ('000')       ,   00008010
            2 REST      CHAR           (136)     INIT (   '')       ;   00008020
                                                                        00008030
        CALL            PLITDLI        (PARM_CT_4,                      00008040
                                       GU,                              00008050
                                       PCB_SB1,                         00008060
                                       SB0PERSN,                        00008070
                                       SSA1_SB0PERSN);                  00008080
                                                                        00008090
        IF PCB_SB1.STATUS_KODE     =  'GE'  THEN                        00008100
                 W_ROT.NESTE_SB_VERSJON_NR = 1;                         00008110
       ELSE                                                             00008120
                                                                        00008130
                                                                        00008140
            IF PCB_SB1.STATUS_KODE    ^=  '  '            !             00008150
               DLIUIB.UIBFCTR         ^=   UIB_RC_OK          THEN      00008160
                 DO;                                                    00008170
 L165:                                                                  00008180
                    FEIL_MELD_NR      =   500;                          00008190
                    FEIL_VED_LABEL    =  'L165';                        00008200
                    DB_STATUS_KODE    =   PCB_SB1.STATUS_KODE;          00008210
                 END;                                                   00008220
            ELSE                                                        00008230
               W_ROT.NESTE_SB_VERSJON_NR = SB0PERSN.VERS_NR  ;          00008240
                                                                        00008250
   END FINN_NR;                                                         00008260
                                                                        00008270
 PLASSER_TEKST:   PROC(TEXT_IND,TEXT_EK_IND);                           00008280
                                                                        00008290
   DCL TEXT_IND                FIXED BIN(15),                           00008300
       TEXT_EK_IND             FIXED BIN(15);                           00008310
                                                                        00008320
                                                                        00008330
                                                                        00008340
   /* *************************************************************** */00008350
   /*       RUTINEN SKAL PLASSERE TEKSTTYPE KODER.                    */00008360
   /* *************************************************************** */00008370
                                                                        00008380
    CALL  PLASSER_TEKSTTYPE_A_KODE(TEXT_IND,TEXT_EK_IND);               00008390
                                                                        00008400
    /*AFP_BREV TIL STAT OG KLP SKAL IKKE HA M-TEXT J.D 10.96 */         00008410
    IF B02.PENSJONSTYPE2(TEXT_IND) ^= 'N' THEN                          00008420
       CALL  PLASSER_M_KODE_TABELL(TEXT_IND,TEXT_EK_IND);               00008430
                                                                        00008440
    CALL  PLASSER_TEKSTTYPE_O_KODE(TEXT_IND);                           00008450
                                                                        00008460
    CALL  PLASSER_TEKSTTYPE_U_KODE(TEXT_IND,TEXT_EK_IND);               00008470
                                                                        00008480
        /* TEST På TRANSTYPE 26 LAGT INN 18.8.86 J.D */                 00008490
                                                                        00008500
    IF TRANS_OPPL_OMR.TRANSTYPE          = 27 !                         00008510
      (TRANS_OPPL_OMR.TRANSTYPE          = 26 &                         00008520
      (B02.STATUS.VIRK_DATO_ÅM(TEXT_IND) =                              00008530
       B02.STATUS.G_DATO_ÅM   (TEXT_IND))     &                         00008540
      (B02.ALDERSP.PÅ         (TEXT_IND) =                              00008550
       B02.ALDERSP.VT_PÅ      (TEXT_IND)))    THEN                      00008560
                                                                        00008570
          CALL PLASSER_TEKSTTYPE_V_KODE(TEXT_IND);                      00008580
    ELSE                                                                00008590
         CALL YRKE_TEKSTTYPE_V_KODE(TEXT_IND);                          00008600
                                                                        00008610
 END PLASSER_TEKST;                                                     00008620
                                                                        00008630
 L999:                                                                  00008640
                                                                        00008650
                                                                        00008660
                                                                        00008670
                                                                        00008680
                                                                        00008690
   RETURN;                                                              00008700
                                                                        00008710
 %PAGE;                                                                 00008720
 %INCLUDE R0017021;  /* OPPRETT_SB_ROT_SEGMENT                */        00008730
 %PAGE;                                                                 00008740
 %INCLUDE R0017022;  /* LAG_BARNEP_EN_HEND                    */        00008750
 %PAGE;                                                                 00008760
 %INCLUDE R0017023;  /* LAG_BARNEP_BEGGE_HEND                 */        00008770
 %PAGE;                                                                 00008780
 %INCLUDE R0017031;  /* LAG_ALDERSP_HEND                      */        00008790
 %PAGE;                                                                 00008800
 %INCLUDE R0017032;  /* LAG_UFØRPENS_HEND                     */        00008810
 %PAGE;                                                                 00008820
 %INCLUDE R0017033;  /* LAG_ETTERL_HEND                       */        00008830
 %PAGE;                                                                 00008840
 %INCLUDE R0017034;  /* LAG_ETTERL_FAM_HEND                   */        00008850
 %PAGE;                                                                 00008860
 %INCLUDE R0017035;  /* LAG_ETTERL_ALDERSP_HEND               */        00008870
 %PAGE;                                                                 00008880
 %INCLUDE R0017036;  /* LAG_ETTERL_UFØRPENS_HEND              */        00008890
 %PAGE;                                                                 00008900
 %INCLUDE R0017037;  /* LAG_YRKEPENS_HEND    YS               */        00008910
 %PAGE;                                                                 00008920
 %INCLUDE R0017025;  /* LAG_FNR_TAB                           */        00008930
 %PAGE;                                                                 00008940
 %INCLUDE R0017041;  /* PLASSER_TEKSTTYPE_U_KODE              */        00008950
 %PAGE;                                                                 00008960
 /*NCLUDE R0017042;  /* PLASSER_TEKSTTYPE_M_KODE              */        00008970
 %PAGE;                                                                 00008980
 %INCLUDE R0017043;  /* PLASSER_TEKSTTYPE_O_KODE              */        00008990
 %PAGE;                                                                 00009000
 %INCLUDE R0017044;  /* PLASSER_TEKSTTYPE_U_KODE              */        00009010
 %PAGE;                                                                 00009020
 %INCLUDE R0017045;  /* PLASSER_TEKSTTYPE_V_KODE              */        00009030
 %PAGE;                                                                 00009040
 %INCLUDE R0017049;  /* YRKE_TEKSTTYPE_V_KODE          YS     */        00009050
 %PAGE;                                                                 00009060
 %INCLUDE R0017047;  /* BYGG_OPP_BERGRUNL_SEGMENT             */        00009070
 %PAGE;                                                                 00009080
 %INCLUDE R0017048;  /* BYGG_OPP_BERGRUNL_DØD                 */        00009090
 %PAGE;                                                                 00009100
 %INCLUDE R0014135;  /* TIDLIGERE_ARBEIDSINNTEKT              */        00009110
 %PAGE;                                                                 00009120
 %INCLUDE R0014146;  /* FAI_GRENSER                           */        00009130
 %PAGE;                                                                 00009140
 %INCLUDE R0014151;      /* KLAGJØR_TAB            NY92 */              00009150
 %PAGE;                                                                 00009160
 %INCLUDE R0014161;      /* LEGG_UFØREHIST_I_TAB    NY92 */             00009170
 %PAGE;                                                                 00009180
 %INCLUDE R0014155;  /* FAI_GRENSER_FRAVIK                    */        00009190
 %PAGE;                                                                 00009200
 %INCLUDE R0014427;  /* LOVLIG INNTEKT                        */        00009210
 %PAGE;                                                                 00009220
 %INCLUDE R0019905;  /* F_ALDER                               */        00009230
 %PAGE;                                                                 00009240
 %INCLUDE R0019913;  /* F_SNU_DATO                            */        00009250
 %PAGE;                                                                 00009260
 %INCLUDE R0017050;  /* PLASSER_M_KODE_TABELL                 */        00009270
                                                                        00009280
  END  LAG_SB;                                                          00009290
