 /*       SIST ENDRET 12/06-98 13.34.22 AV   SPA7339                  */00000000
 /*       SIST ENDRET 25/05-98 12.52.23 AV   SPA7339                  */00000010
 /*       SIST ENDRET 20/09-94 09.42.37 AV   HERMAN                   */00000020
 /*       SIST ENDRET 02/06-94 14.57.25 AV   HERMAN                   */00000030
 /*       SIST ENDRET 17/02-92 13.43.54 AV   DYBVIK                   */00000040
 /* ***************************************************************** */00000050
 /*IDENTIFIKASJON:                                                    */00000060
 /*    R0014148 - F_TP92            - INTERN FUNKSJON I PLI           */00000070
 /*    PROGRAMMERER: HERMAN -DES. 91                                  */00000080
 /*HENSIKT:                                                           */00000090
 /*    REGNER TP MED POENGÅR FØR 1992 OG ETTER 1991  (45 OG 42 %)     */00000100
 /*PROGRAMTILKNYTNING:                                                */00000110
 /*                                                                   */00000120
 /*BRUK:                                                              */00000130
 /*    TP=F_TP92(FÅ,SPT,OPT,PÅ,PÅ_ETTER91,UFG,TP_PROSENT,FORHØY_IND); */00000140
 /* ***************************************************************** */00000150
 F_TP92 :                                                               00000160
  PROC(FÅ,G,SPT,OPT,PÅ,PÅ_ETTER91,UFG,TP_PROSENT,FORHØY_IND)            00000170
        RETURNS(DEC FIXED(5));                                          00000180
  DCL                                                                   00000190
     FÅ                 PIC '99',                                       00000200
     G                  FIXED DEC(5),                                   00000210
     SPT                FIXED DEC(3,2),                                 00000220
     OPT                FIXED DEC(3,2),                                 00000230
     PÅ                 FIXED DEC(3),                                   00000240
     PÅ_FØR92           FIXED DEC(3),                                   00000250
     PÅ_ETTER91         FIXED DEC(3),                                   00000260
     UFG                FIXED DEC(5,2),                                 00000270
     TP_PROSENT         FIXED DEC(3),                                   00000280
     OÅ                 FIXED DEC(3),                                   00000290
     FORHØY_IND         CHAR(1),                                        00000300
     TP_WORK            FIXED DEC(11,4),                                00000310
     TP_WORK_2          FIXED DEC(11,4),                                00000320
     TP2_WORK           FIXED DEC(11,4),                                00000330
     TP_WORK_92         FIXED DEC(11,4),                                00000340
     GAMMEL             FIXED DEC(11,4),                                00000350
     NY                 FIXED DEC(11,4),                                00000360
     TP                 FIXED DEC(5);                                   00000370
                                                                        00000380
   DCL PGNAVN         CHAR (8);                                         00000390
   PGNAVN = 'R0014148';                                                 00000400
                                                                        00000410
   IF PÅ_ETTER91 = 0           THEN                                     00000420
      DO;                                                               00000430
         CALL GAMLE_REGLER;                                             00000440
         GOTO SLUTT;                                                    00000450
      END;                                                              00000460
                                                                        00000470
   PÅ_FØR92 = PÅ - PÅ_ETTER91;                                          00000480
   GAMMEL = G * 45 /100;                                                00000490
   NY     = G * 42 /100;                                                00000500
                                                                        00000510
 /*F ( PÅ < 3               &                                           00000520
       B02.KONVENSJON(BER_SØ_IND)  = 'J') !      */                     00000530
                                                                        00000540
  IF   B02.FRAVIK_BOSATT_KONVENSJON(BER_SØ_IND) = 'J'      !            00000550
       B02.KONVENSJON(BER_SØ_IND)  = 'J'  !       /* PENSJON UTLAND  */ 00000560
       PÅ > 2               !                                           00000570
     (FÅ = 99 & PÅ = 2)   !                                             00000580
     (FÅ = 98 & PÅ = 1)         THEN                                    00000590
     DO;                                                                00000600
        IF FÅ > 36 & FÅ < 98        THEN                                00000610
           DO;                                                          00000620
                                                                        00000630
              TP_WORK = GAMMEL * PÅ_FØR92 / 40;                         00000640
              TP_WORK_92 = NY * PÅ_ETTER91 / 40;                        00000650
              TP_WORK = (TP_WORK + TP_WORK_92) * SPT;                   00000660
              TP_WORK = TP_WORK * UFG /100;                             00000670
              TP_WORK = TP_WORK * TP_PROSENT / 100;                     00000680
              IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN               00000690
 /*9804*/        DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = TP_WORK + 0.5;     00000700
              TP_WORK = TP_WORK / 12;                                   00000710
           END;                                                         00000720
        ELSE                                                            00000730
           DO;                                                          00000740
              IF FÅ > 17 & FÅ < 98     THEN                             00000750
                 OÅ = 20 + FÅ - 17;                                     00000760
              ELSE                                                      00000770
                 OÅ = 20;                                               00000780
              IF SPT > OPT THEN                                         00000790
                 DO;                                                    00000800
                                                                        00000810
                    TP_WORK = GAMMEL * PÅ_FØR92 / OÅ;                   00000820
                    TP_WORK_92 = NY * PÅ_ETTER91 / OÅ;                  00000830
                    TP_WORK = (TP_WORK + TP_WORK_92) * OPT;             00000840
                                                                        00000850
                    TP2_WORK = GAMMEL * PÅ_FØR92 / 40;                  00000860
                    TP_WORK_92 = NY * PÅ_ETTER91 / 40;                  00000870
                    TP2_WORK = (TP2_WORK + TP_WORK_92) * (SPT - OPT);   00000880
                    TP_WORK = (TP_WORK + TP2_WORK) * UFG /100;          00000890
                    TP_WORK = TP_WORK * TP_PROSENT / 100;               00000900
              IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN               00000910
 /*9804*/        DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = TP_WORK + 0.5;     00000920
                    TP_WORK = TP_WORK / 12;                             00000930
                 END;                                                   00000940
              ELSE                                                      00000950
                 DO;                                                    00000960
                                                                        00000970
                    TP_WORK = GAMMEL * PÅ_FØR92 / OÅ;                   00000980
                    TP_WORK_92 = NY * PÅ_ETTER91 / OÅ;                  00000990
                    TP_WORK = (TP_WORK + TP_WORK_92) * SPT;             00001000
                    TP_WORK = TP_WORK * UFG /100;                       00001010
                    TP_WORK = TP_WORK * TP_PROSENT / 100;               00001020
              IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN               00001030
 /*9804*/        DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = TP_WORK + 0.5;     00001040
                    TP_WORK = TP_WORK / 12;                             00001050
                 END;                                                   00001060
           END;                                                         00001070
        IF FORHØY_IND ^= 'N' THEN                                       00001080
           TP_WORK = TP_WORK + 0.5;                                     00001090
     END;                                                               00001100
  ELSE                                                                  00001110
     TP_WORK = 0;                                                       00001120
  TP = TP_WORK;                                                         00001130
                                                                        00001140
 GAMLE_REGLER: PROC;                                                    00001150
                                                                        00001160
 /*F ( PÅ < 3               &                                           00001170
       B02.KONVENSJON(BER_SØ_IND)  = 'J') !                          */ 00001180
                                                                        00001190
 /*ENDRET 2.6.94 HL */                                                  00001200
                                                                        00001210
  IF   B02.FRAVIK_BOSATT_KONVENSJON(BER_SØ_IND) = 'J'      !            00001220
       B02.KONVENSJON(BER_SØ_IND)  = 'J'  !       /* PENSJON UTLAND  */ 00001230
       PÅ > 2               !                                           00001240
     (FÅ = 99 & PÅ = 2)   !                                             00001250
     (FÅ = 98 & PÅ = 1)         THEN                                    00001260
     DO;                                                                00001270
        IF FÅ > 36 & FÅ < 98        THEN                                00001280
           DO;                                                          00001290
            /* TP_WORK = G * 0.45 * SPT * (PÅ / 40) * (UFG / 100)       00001300
                           * (TP_PROSENT / 100) / 12              */    00001310
              TP_WORK = G * 45 /100;                                    00001320
              TP_WORK = TP_WORK * SPT;                                  00001330
              TP_WORK = TP_WORK * PÅ / 40;                              00001340
              TP_WORK = TP_WORK * UFG /100;                             00001350
              TP_WORK = TP_WORK * TP_PROSENT / 100;                     00001360
              IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN               00001370
 /*9804*/        DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = TP_WORK + 0.5;     00001380
              TP_WORK = TP_WORK / 12;                                   00001390
           END;                                                         00001400
        ELSE                                                            00001410
           DO;                                                          00001420
              IF FÅ > 17 & FÅ < 98     THEN                             00001430
                 OÅ = 20 + FÅ - 17;                                     00001440
              ELSE                                                      00001450
                 OÅ = 20;                                               00001460
              IF SPT > OPT THEN                                         00001470
                 DO;                                                    00001480
                /* TP_WORK = ((G * 0.45 * OPT * (PÅ / OÅ)) +            00001490
                              (G * 0.45 * (SPT - OPT) * (PÅ / 40))) *   00001500
                               (UFG / 100) *                            00001510
                               (TP_PROSENT / 100) / 12                */00001520
                    TP_WORK = G * 45 /100;                              00001530
                    TP_WORK = TP_WORK * OPT;                            00001540
                    TP_WORK = TP_WORK * PÅ / OÅ;                        00001550
                    TP_WORK_2 = G * 45 / 100;                           00001560
                    TP_WORK_2 = TP_WORK_2 * (SPT - OPT);                00001570
                    TP_WORK_2 = TP_WORK_2 * PÅ / 40;                    00001580
                    TP_WORK = (TP_WORK + TP_WORK_2) * UFG /100;         00001590
                    TP_WORK = TP_WORK * TP_PROSENT / 100;               00001600
              IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN               00001610
 /*9804*/        DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = TP_WORK + 0.5;     00001620
                    TP_WORK = TP_WORK / 12;                             00001630
                 END;                                                   00001640
              ELSE                                                      00001650
                 DO;                                                    00001660
                 /* TP_WORK = G * 0.45 * SPT * (PÅ / OÅ) * (UFG / 100)  00001670
                               * (TP_PROSENT / 100) / 12              */00001680
                    TP_WORK = G * 45 / 100;                             00001690
                    TP_WORK = TP_WORK * SPT;                            00001700
                    TP_WORK = TP_WORK * PÅ / OÅ;                        00001710
                    TP_WORK = TP_WORK * UFG /100;                       00001720
                    TP_WORK = TP_WORK * TP_PROSENT / 100;               00001730
              IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN               00001740
 /*9804*/        DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = TP_WORK + 0.5;     00001750
                    TP_WORK = TP_WORK / 12;                             00001760
                 END;                                                   00001770
           END;                                                         00001780
        IF FORHØY_IND ^= 'N' THEN                                       00001790
           TP_WORK = TP_WORK + 0.5;                                     00001800
     END;                                                               00001810
  ELSE                                                                  00001820
     TP_WORK = 0;                                                       00001830
  TP = TP_WORK;                                                         00001840
                                                                        00001850
                                                                        00001860
 END GAMLE_REGLER;                                                      00001870
                                                                        00001880
 SLUTT :                                                                00001890
   /* IKKE GI KONV 'F' TILLEGGSPENSJON, TRUDE 060192  */                00001900
                                                                        00001910
   IF B02.BOSATT(BER_SØ_IND)  = 000  &                                  00001920
      B02.TT_16_66(BER_SØ_IND) = 0     &                                00001930
      B02.TT_ETTER_1966(BER_SØ_IND) = 0 &                               00001940
      B02.TT_FØR_1967(BER_SØ_IND)   = 0 &                               00001950
      B02.ALDERSP.KONV_P_KODE(BER_SØ_IND)  = 'F'     &                  00001960
      B02.ALDERSP.KONV_GRAD(BER_SØ_IND)  = 0     THEN                   00001970
        TP  = 0 ;                                                       00001980
        /* TRUDE 060192 HIT */                                          00001990
                                                                        00002000
  RETURN(TP);                                                           00002010
                                                                        00002020
 END F_TP92;                                                            00002030
