 /*       SIST ENDRET 24/10-97 11.55.35 AV   JDA7339                  */00000000
 /*       SIST ENDRET 25/09-97 10.53.05 AV   HLA7339                  */00000010
 /*       SIST ENDRET 14/08-97 07.29.51 AV   HLA7339                  */00000020
 /*       SIST ENDRET 04/08-97 14.09.06 AV   JDA7339                  */00000030
 /*       SIST ENDRET 11/02-97 10.34.57 AV   JDA7339                  */00000040
 /*       SIST ENDRET 15/03-94 13.50.03 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 25/02-94 12.33.52 AV   HERMAN                   */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /*    R001UE05 - UNDERPROG  I PLI                                    */00000080
 /*    PROGRAMMERER: HERMAN, FEB 94                                   */00000090
 /*HENSIKT:                                                           */00000100
 /*    PROSEDYRENE FORETAR KONTROLL AV DATA FOR EN_KAP7,EN_KAP8 OG    */00000110
 /*    EN_KAP10 OG EN_KAP11 OG EN_SPES FRA ENDRINGSBLANKETT           */00000120
 /*PROGRAMTILKNYTNING:                                                */00000130
 /*    PROSEDYRENE INNGÅR SOM EN DEL AV BEHANDLINGEN AV ENDRINGS-     */00000140
 /*    BLANKETTEN.                                                    */00000150
 /*    INCLUDES I  R001UE01.                                          */00000160
 /*BRUK:                                                              */00000170
 /*    CALL KONTROLL_EN_KAP7 (FEIL_I_EN_KAP7);                        */00000180
 /*    CALL KONTROLL_EN_KAP8 (FEIL_I_EN_KAP8);                        */00000190
 /*    CALL KONTROLL_EN_KAP10(FEIL_I_EN_KAP10);                       */00000200
 /*    CALL KONTROLL_EN_KAP11(FEIL_I_EN_KAP11);                       */00000210
 /*    CALL KONTROLL_EN_SPES (FEIL_I_EN_SPES );                       */00000220
 /******************************************************************* */00000230
 /*DATASETTOPPLYSNINGER:                                              */00000240
 /* ***********************                                           */00000250
 /*   STATTAB - STATSBORGERSKAPSTABELL - EXEC CICS READ DATASET       */00000260
 /*                                      ('STATTAB')........          */00000270
 /* ***************************************************************** */00000280
 /*                                                                   */00000290
 /*   MODULEN KONTROLLERER EN_KAP7 (ENDRING I INNTEKT                 */00000300
 /*         OG RETURNERER MED FEIL_FUNNET= '1'B HVIS FEIL, '0'B       */00000310
 /*   HVIS RIKTIG                                                     */00000320
 /*                                                                   */00000330
 /* ***************************************************************** */00000340
 %SKIP(2);                                                              00000350
 KONTROLL_EN_KAP7:                                                      00000360
   PROC (FEIL_FUNNET);                                                  00000370
   DCL                                                                  00000380
      FEIL_FUNNET BIT (1);                                              00000390
                                                                        00000400
      IF ENK7.FAI > 0 THEN                                              00000410
         IF ^ F_NUMERISK(ENK7.FAI)  THEN                                00000420
            DO;                                                         00000430
               FEIL_FUNNET = '1'B;                                      00000440
               ENK7.FAINR = 200;                                        00000450
            END;                                                        00000460
                                                                        00000470
 END KONTROLL_EN_KAP7;                                                  00000480
 /* ================================================================= */00000490
 KONTROLL_EN_KAP8:                                                      00000500
    PROC (FEIL_FUNNET);                                                 00000510
    /* ************************************************************** */00000520
    /*                                                                */00000530
    /*   MODULEN KONTROLLERER EN_KAP8(REDUKSJON AV UFØREGRAD) OG      */00000540
    /*   RETURNERER MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B ELLERS     */00000550
    /*                                                                */00000560
    /* ************************************************************** */00000570
                                                                        00000580
    DCL                                                                 00000590
        FEIL_FUNNET BIT (1);                                            00000600
                                                                        00000610
    /* -------------------------------------------------------------- */00000620
    /* TIDSBEGRENSET ATTFØRING TESTES I R0019803                      */00000630
    /* -------------------------------------------------------------- */00000640
 /* ************************************                                00000650
    ENK8.TIDSBEGR_ATTFNR = FK_TIDSBEGR_ATTF(ENK8.TIDSBEGR_ATTF);        00000660
    IF   (ENK8.TIDSBEGR_ATTFNR > 0 )                                    00000670
    THEN FEIL_FUNNET = '1'B;                                            00000680
 *********************************************** */                     00000690
    IF   (VERIFY(ENK8.TIDSBEGR_ATTF,'SX ') ^=0)     THEN                00000700
       DO;                                                              00000710
          FEIL_FUNNET = '1'B;                                           00000720
          ENK8.TIDSBEGR_ATTFNR = 429;                                   00000730
       END;                                                             00000740
                                                                        00000750
    /* -------------------------------------------------------------- */00000760
    /* SKJERMET ATTFØRING TESTES I R0019804                           */00000770
    /* -------------------------------------------------------------- */00000780
 /* **********************************************************          00000790
    ENK8.SKJERM_ATTFNR = FK_SKJERM_ATTF(ENK8.SKJERM_ATTF);              00000800
    IF   (ENK8.SKJERM_ATTFNR > 0 )                                      00000810
    THEN FEIL_FUNNET = '1'B;                                            00000820
 ********************************************************** */          00000830
                                                                        00000840
    IF   (VERIFY(ENK8.SKJERM_ATTF,'SX ') ^=0)     THEN                  00000850
       DO;                                                              00000860
          FEIL_FUNNET = '1'B;                                           00000870
          ENK8.SKJERM_ATTFNR = 429;                                     00000880
       END;                                                             00000890
                                                                        00000900
    IF ENK8.TIDSBEGR_ATTF = 'S'         &                               00000910
       ENK8.SKJERM_ATTF = 'S'                   THEN                    00000920
       DO;                                                              00000930
          FEIL_FUNNET = '1'B;                                           00000940
          ENK8.TIDSBEGR_ATTFNR = 442;                                   00000950
       END;                                                             00000960
                                                                        00000970
    IF ENK8.TIDSBEGR_ATTF = 'X'         &                               00000980
       ENK8.SKJERM_ATTF = 'X'                   THEN                    00000990
       DO;                                                              00001000
          FEIL_FUNNET = '1'B;                                           00001010
          ENK8.TIDSBEGR_ATTFNR = 442;                                   00001020
       END;                                                             00001030
                                                                        00001040
    /* -------------------------------------------------------------- */00001050
    /* UFØREGRAD UFØREPENSJON TESTES FORELØPIG HER                    */00001060
    /* -------------------------------------------------------------- */00001070
    IF   ENK8.UFG > 0           &                                       00001080
         ENK8.UFG < 999                   THEN                          00001090
       DO;                                                              00001100
          IF   (^ F_NUMERISK(F_FELT_PIC_CHAR3(ENK8.UFG)))  THEN         00001110
             DO;                                                        00001120
                 FEIL_FUNNET = '1'B;                                    00001130
                 ENK8.UFGNR  = 200;                                     00001140
             END;                                                       00001150
          ELSE                                                          00001160
          IF   ^(ENK8.UFG = 15 ! ENK8.UFG = 20 ! ENK8.UFG = 25 !        00001170
                 ENK8.UFG = 30 ! ENK8.UFG = 35 ! ENK8.UFG = 40 !        00001180
                 ENK8.UFG = 45 ! ENK8.UFG = 50 ! ENK8.UFG = 55 !        00001190
                 ENK8.UFG = 60 ! ENK8.UFG = 65 ! ENK8.UFG = 70 !        00001200
                 ENK8.UFG = 75 ! ENK8.UFG = 80 ! ENK8.UFG = 85 !        00001210
                 ENK8.UFG = 100 !                                       00001220
                 ENK8.UFG = 90 ! ENK8.UFG = 95 ! ENK8.UFG = 999 ) THEN  00001230
              DO;                                                       00001240
                 FEIL_FUNNET = '1'B;                                    00001250
                   /* ----------------------------------------------- */00001260
                   /* FEILMELD 38: UGYLDIG UFØREGRAD                    00001270
                   /* ----------------------------------------------- */00001280
                 ENK8.UFGNR = 38;                                       00001290
              END;                                                      00001300
         END;                                                           00001310
                                                                        00001320
    /* -------------------------------------------------------------- */00001330
    /* TRE ÅRS FRYSPERIODE VED ARBEIDSFØRSØK                          */00001340
    /* -------------------------------------------------------------- */00001350
                                                                        00001360
    IF   (VERIFY(ENK8.FRYSP_3ÅR_ARB,'SX ') ^=0)     THEN                00001370
       DO;                                                              00001380
          FEIL_FUNNET = '1'B;                                           00001390
          ENK8.FRYSP_3ÅR_ARBNR = 429;                                   00001400
       END;                                                             00001410
                                                                        00001420
    /* -------------------------------------------------------------- */00001430
    /* FRYSPERIODE VED TIDSBEGRENSET ARBEIDSFORSØK                    */00001440
    /* -------------------------------------------------------------- */00001450
                                                                        00001460
    IF   (VERIFY(ENK8.FRYSP_TIDSB,'SX ') ^=0)     THEN                  00001470
       DO;                                                              00001480
          FEIL_FUNNET = '1'B;                                           00001490
          ENK8.FRYSP_TIDSBNR = 429;                                     00001500
       END;                                                             00001510
                                                                        00001520
    /* -------------------------------------------------------------- */00001530
    /* DET KAN IKKE VÆRE LIKE KODER I FRYS-FELTENE                    */00001540
    /* -------------------------------------------------------------- */00001550
    IF   ENK8.FRYSP_TIDSB = ENK8.FRYSP_3ÅR_ARB     &                    00001560
        (ENK8.FRYSP_TIDSB ^= ' ')                      THEN             00001570
       DO;                                                              00001580
          FEIL_FUNNET = '1'B;                                           00001590
          ENK8.FRYSP_3ÅR_ARBNR = 437;                                   00001600
       END;                                                             00001610
                                                                        00001620
                                                                        00001630
    /* -------------------------------------------------------------- */00001640
    /* FRYSP_3ÅR_ARB KAN IKKE OPPHØRES                                */00001650
    /*   (OPPHØR SKJER VED AT UP FÅR MINST GARANTIGRAD)               */00001660
    /* -------------------------------------------------------------- */00001670
    IF   ENK8.FRYSP_3ÅR_ARB  = 'X'  &                                   00001680
         ENK8.FRYSP_TIDSB   ^= 'S'             THEN                     00001690
       DO;                                                              00001700
          FEIL_FUNNET = '1'B;                                           00001710
          ENK8.FRYSP_3ÅR_ARBNR = 443;                                   00001720
       END;                                                             00001730
                                                                        00001740
    /* -------------------------------------------------------------- */00001750
    /* KONTROLL AV INNTEKT-FØR-UP                                     */00001760
    /* -------------------------------------------------------------- */00001770
    IF ENK8.INNTEKT_FØR_UP > 0  THEN                                    00001780
       DO;                                                              00001790
          IF SUBSTR(ENK8.INNT_DATO_MÅ, 3,2) < 65 THEN                   00001800
           DO;                                                          00001810
              FEIL_FUNNET =    '1'B;                                    00001820
              ENK8.INNT_DATO_MÅNR = 040;                                00001830
           END;                                                         00001840
       END;                                                             00001850
 END KONTROLL_EN_KAP8;                                                  00001860
                                                                        00001870
 /* ***************************************************************** */00001880
 /*                                                                   */00001890
 /*   MODULEN KONTROLLERER EN_KAP10 (DIVERSE ENDRINGER) OG RETURNERER */00001900
 /*   MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG              */00001910
 /*                                                                   */00001920
 /* ***************************************************************** */00001930
                                                                        00001940
 KONTROLL_EN_KAP10:                                                     00001950
   PROC (FEIL_FUNNET);                                                  00001960
   DCL                                                                  00001970
      FEIL_FUNNET     BIT (1);                                          00001980
                                                                        00001990
   DCL                                                                  00002000
      DAGENS_DATO_ÅMD PIC '999999',                                     00002010
      DAGENS_DATO_ÅM  DEF DAGENS_DATO_ÅMD PIC '9999',                   00002020
      DAGENS_DATO_Å   DEF DAGENS_DATO_ÅMD PIC '99';                     00002030
                                                                        00002040
 /* ***************************************************************** */00002050
 /*  HJELPE DCL FOR Å SNU DATO                                        */00002060
 /* ***************************************************************** */00002070
                                                                        00002080
 %SKIP(1);                                                              00002090
   DCL                                                                  00002100
      HJ_FRAML_DATO_ÅM PIC '9999',                                      00002110
      FRAML_DATO_Å     DEF HJ_FRAML_DATO_ÅM POS(1) PIC '99',            00002120
      FRAML_DATO_M     DEF HJ_FRAML_DATO_ÅM POS(3) PIC '99';            00002130
 %SKIP;                                                                 00002140
   DCL                                                                  00002150
      HJ_FRAML_DATO_MÅ PIC '9999',                                      00002160
      HJ_FRAML_DATO_M  DEF HJ_FRAML_DATO_MÅ POS(1) PIC '99',            00002170
      HJ_FRAML_DATO_Å  DEF HJ_FRAML_DATO_MÅ POS(3) PIC '99';            00002180
 %PAGE;                                                                 00002190
                                                                        00002200
      DAGENS_DATO_ÅMD = DATE ();                                        00002210
      IF ENK10.FORVENTET_INNT > 0 THEN                                  00002220
         IF ^ F_NUMERISK(ENK10.FORVENTET_INNT) THEN                     00002230
            DO;                                                         00002240
               FEIL_FUNNET       = '1'B;                                00002250
               ENK10.FORVENTET_INNTNR = 200;                            00002260
            END;                                                        00002270
      IF ^(ENK10.O_TIL_PENSJON = 'X' ! ENK10.O_TIL_PENSJON = ' ') THEN  00002280
         DO;                                                            00002290
            FEIL_FUNNET           = '1'B;                               00002300
                                                                        00002310
 /* **************************************************************** */ 00002320
 /*   FEILMELD 150: FEIL I OVEGANG TIL PENSJON                       */ 00002330
 /* **************************************************************** */ 00002340
                                                                        00002350
            ENK10.O_TIL_PENSJONNR =150;                                 00002360
         END;                                                           00002370
      IF ENK10.TP_PROSENT > 0 THEN                                      00002380
         IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(ENK10.TP_PROSENT)) THEN       00002390
            DO;                                                         00002400
               FEIL_FUNNET        = '1'B;                               00002410
               ENK10.TP_PROSENTNR = 200;                                00002420
            END;                                                        00002430
         ELSE                                                           00002440
            IF ENK10.TP_PROSENT > 55 &                                  00002450
               ENK10.TP_PROSENT < 999 THEN                              00002460
               DO;                                                      00002470
                  FEIL_FUNNET        = '1'B;                            00002480
                                                                        00002490
 /* **************************************************************** */ 00002500
 /*         FEILMELD 64: FEIL I TP-PROSENT                           */ 00002510
 /* **************************************************************** */ 00002520
                                                                        00002530
                  ENK10.TP_PROSENTNR = 64;                              00002540
               END;                                                     00002550
      IF ENK10.FRAML_DATO_MÅ > 0 THEN                                   00002560
         IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(ENK10.FRAML_DATO_MÅ)) THEN    00002570
            DO;                                                         00002580
               FEIL_FUNNET           = '1'B;                            00002590
               ENK10.FRAML_DATO_MÅNR = 200;                             00002600
            END;                                                        00002610
         ELSE                                                           00002620
            IF ENK10.FRAML_DATO_MÅ > 0 THEN                             00002630
                                                                        00002640
 /* **************************************************************** */ 00002650
 /*            FUNKSJONEN F_GYLDIG_DATO KONTROLLERER OM EN DATO(ÅR/  */ 00002660
 /*            MND) ER GYLDIG. HVIS GYLDIG RETURNERES '1'B, HVIS     */ 00002670
 /*            IKKE GYLDIG '0'B.                                     */ 00002680
 /* **************************************************************** */ 00002690
                                                                        00002700
               IF ^ F_GYLDIG_DATO(ENK10.FRAML_DATO_MÅ) THEN             00002710
                  DO;                                                   00002720
                     FEIL_FUNNET           = '1'B;                      00002730
                                                                        00002740
 /* **************************************************************** */ 00002750
 /*            FEILMELD 71: UGYLDIG FRAMLEGGSDATO                    */ 00002760
 /* **************************************************************** */ 00002770
                                                                        00002780
                     ENK10.FRAML_DATO_MÅNR = 71;                        00002790
                  END;                                                  00002800
      IF (VERIFY (ENK10.OPPHØR_EO,'JN ') ^= 0)  THEN                    00002810
         DO;                                                            00002820
            FEIL_FUNNET       = '1'B;                                   00002830
                                                                        00002840
 /* **************************************************************** */ 00002850
 /*   FEILMELD 151: FEIL I OPPHØR-EO                                 */ 00002860
 /* **************************************************************** */ 00002870
                                                                        00002880
            ENK10.OPPHØR_EONR = 151;                                    00002890
         END;                                                           00002900
      ELSE                                                              00002910
         IF ENK10.OPPHØR_EO ^= ' ' & ENK10.FRAML_DATO_MÅ = 0 THEN       00002920
            DO;                                                         00002930
               FEIL_FUNNET       = '1'B;                                00002940
                                                                        00002950
 /* **************************************************************** */ 00002960
 /*      FEILMELD 184: OPPHØR-EO ER UTFYLT,FRAMLEGGSDATO IKKE UTFYLT */ 00002970
 /* **************************************************************** */ 00002980
                                                                        00002990
               ENK10.OPPHØR_EONR = 184;                                 00003000
            END;                                                        00003010
         ELSE                                                           00003020
            IF ENK10.OPPHØR_EO = ' ' & ENK10.FRAML_DATO_MÅ > 0 THEN     00003030
               DO;                                                      00003040
                  FEIL_FUNNET       = '1'B;                             00003050
                                                                        00003060
 /* **************************************************************** */ 00003070
 /*         FEILMELD 187: OPPHØR_EO IKKE UTFYLT,FRAML_DATO ER UTFYLT */ 00003080
 /* **************************************************************** */ 00003090
                                                                        00003100
                  ENK10.OPPHØR_EONR = 187;                              00003110
               END;                                                     00003120
                                                                        00003130
 /* ***************************************************************** */00003140
 /*   KRYSS KONTROLLER                                                */00003150
 /* ***************************************************************** */00003160
                                                                        00003170
      IF ^ FEIL_FUNNET THEN                                             00003180
         DO;                                                            00003190
            HJ_FRAML_DATO_MÅ = ENK10.FRAML_DATO_MÅ;                     00003200
            FRAML_DATO_Å     = HJ_FRAML_DATO_Å;                         00003210
            FRAML_DATO_M     = HJ_FRAML_DATO_M;                         00003220
                                                                        00003230
            IF (ENK10.FRAML_DATO_MÅ > 0 ! ENK10.OPPHØR_EO ^= ' ' !      00003240
                ENK10.TP_PROSENT    < 999 !                             00003250
                ENK10.O_TIL_PENSJON ^= ' ') &                           00003260
                ENK10.FORVENTET_INNT = 9999999   THEN                   00003270
                  DO;                                                   00003280
                     FEIL_FUNNET           = '1'B;                      00003290
                     ENK10.FORVENTET_INNTNR     = 88;                   00003300
                  END;                                                  00003310
            IF ENK10.FRAML_DATO_MÅ > 0 THEN                             00003320
               IF HJ_FRAML_DATO_ÅM < DAGENS_DATO_ÅM THEN                00003330
                  DO;                                                   00003340
                     FEIL_FUNNET           = '1'B;                      00003350
                     ENK10.FRAML_DATO_MÅNR = 72;                        00003360
                  END;                                                  00003370
         END;                                                           00003380
   END KONTROLL_EN_KAP10;                                               00003390
                                                                        00003400
 KONTROLL_EN_KAP11:                                                     00003410
   PROC (FEIL_FUNNET);                                                  00003420
   DCL                                                                  00003430
      FEIL_FUNNET BIT (1);                                              00003440
                                                                        00003450
      IF ENK11.YUG > 0       &                                          00003460
         ENK11.YUG < 999 THEN                                           00003470
         DO;                                                            00003480
            IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(ENK11.YUG)) THEN           00003490
               DO;                                                      00003500
                  FEIL_FUNNET = '1'B;                                   00003510
                  ENK11.YUGNR = 200;                                    00003520
               END;                                                     00003530
            ELSE                                                        00003540
             IF ^(ENK11.YUG = 15 ! ENK11.YUG = 20 !                     00003550
                  ENK11.YUG = 25 ! ENK11.YUG = 30 !                     00003560
                  ENK11.YUG = 35 ! ENK11.YUG = 40 !                     00003570
                  ENK11.YUG = 45 ! ENK11.YUG = 50 !                     00003580
                  ENK11.YUG = 55 ! ENK11.YUG = 60 !                     00003590
                  ENK11.YUG = 65 ! ENK11.YUG = 70 !                     00003600
                  ENK11.YUG = 75 ! ENK11.YUG = 80 !                     00003610
                  ENK11.YUG = 85 ! ENK11.YUG = 90 !                     00003620
                  ENK11.YUG = 95 ! ENK11.YUG = 999)  THEN               00003630
                                                                        00003640
                  DO;                                                   00003650
                     FEIL_FUNNET = '1'B;                                00003660
                                                                        00003670
 /* *********************************************************** */      00003680
 /*            FEILMELD 307: UGYLDIG UFØREGRAD                  */      00003690
 /* *********************************************************** */      00003700
                                                                        00003710
                     ENK11.YUGNR = 307;                                 00003720
                  END;                                                  00003730
             ELSE                                                       00003740
                IF ENK8.UFG > 0  &                                      00003750
                   ENK8.UFG < 999  THEN                                 00003760
                   DO;                                                  00003770
                      IF ENK8.UFG  < 50        &                        00003780
                         ENK8.UFG ^= ENK11.YUG    THEN                  00003790
                         DO;                                            00003800
                            FEIL_FUNNET = '1'B;                         00003810
                            ENK8.UFGNR  = 311;                          00003820
                            ENK11.YUGNR = 999;                          00003830
                         END;                                           00003840
                      IF ENK8.UFG < ENK11.YUG    THEN                   00003850
                         DO;                                            00003860
                            FEIL_FUNNET = '1'B;                         00003870
                            ENK8.UFGNR  = 317;                          00003880
                            ENK11.YUGNR = 999;                          00003890
                         END;                                           00003900
                                                                        00003910
                   END;                                                 00003920
         END;                                                           00003930
   END KONTROLL_EN_KAP11;                                               00003940
   KONTROLL_EN_SPES:                                                    00003950
   PROC (FEIL_FUNNET);                                                  00003960
   DCL                                                                  00003970
      FEIL_FUNNET BIT (1);                                              00003980
   DCL                                                                  00003990
      KEY_BIT1                   BIT(32) BASED (KEY_PEKER1),            00004000
      KEY_BIT2                   BIT(32) BASED (KEY_PEKER2),            00004010
      KEY_PEKER1                 POINTER,                               00004020
      KEY_PEKER2                 POINTER,                               00004030
      ST_RECL                    CHAR (35);                             00004040
    KEY_PEKER1  = ADDR(EN_SPES.STATSBORGER);                            00004050
    KEY_PEKER2  = ADDR(EN_SPES.BOSTED);                                 00004060
  /*                                                                    00004070
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(EN_SPES.STATSBORGER)) THEN         00004080
       DO;                                                              00004090
          FEIL_FUNNET = '1'B;                                           00004100
          EN_SPES.STATSBORGERNR = 200;                                  00004110
       END;                                                             00004120
  */                                                                    00004130
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(EN_SPES.BOSTED)) THEN              00004140
       DO;                                                              00004150
          FEIL_FUNNET = '1'B;                                           00004160
          EN_SPES.BOSTEDNR = 200;                                       00004170
       END;                                                             00004180
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(EN_SPES.TP_NORDISK)) THEN          00004190
       DO;                                                              00004200
          FEIL_FUNNET = '1'B;                                           00004210
          EN_SPES.TP_NORDISKNR = 200;                                   00004220
       END;                                                             00004230
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(EN_SPES.TP_NORDISK_LAND)) THEN     00004240
       DO;                                                              00004250
          FEIL_FUNNET = '1'B;                                           00004260
          EN_SPES.TP_NORDISK_LANDNR = 200;                              00004270
       END;                                                             00004280
    IF ^FEIL_FUNNET THEN                                                00004290
      DO;                                                               00004300
                                                                        00004310
 /* ***************************************************************** */00004320
 /* FELTKONTROLLER........                                            */00004330
 /* ***************************************************************** */00004340
                                                                        00004350
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND1);               00004360
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT1)       00004370
                                               INTO(ST_RECL);           00004380
              GOTO STAT_UT;                                             00004390
          NOTFND1:                                                      00004400
             IF EN_SPES.STATSBORGER ^= 999     THEN                     00004410
                DO;                                                     00004420
                   FEIL_FUNNET        = '1'B;                           00004430
                   EN_SPES.STATSBORGERNR = 24;                          00004440
                END;                                                    00004450
             GOTO STAT_UT;                                              00004460
          STAT_UT:                                                      00004470
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND2);               00004480
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT2)       00004490
                                               INTO(ST_RECL);           00004500
              GOTO BO_UT;                                               00004510
          NOTFND2:                                                      00004520
             IF EN_SPES.BOSTED      ^= 999     THEN                     00004530
                DO;                                                     00004540
                   FEIL_FUNNET   = '1'B;                                00004550
                   EN_SPES.BOSTEDNR = 25;                               00004560
                END;                                                    00004570
             GOTO BO_UT;                                                00004580
          BO_UT:                                                        00004590
      END;                                                              00004600
                                                                        00004610
      IF EN_SPES.TP_NORDISK > 0       &                                 00004620
         EN_SPES.TP_NORDISK < 99999        THEN                         00004630
         IF EN_SPES.TP_NORDISK_LAND = 0 !                               00004640
            EN_SPES.TP_NORDISK_LAND = 999  THEN                         00004650
            DO;                                                         00004660
               FEIL_FUNNET = '1'B;                                      00004670
               EN_SPES.TP_NORDISKNR = 460;                              00004680
            END;                                                        00004690
      IF EN_SPES.TP_NORDISK_LAND > 0   &                                00004700
         EN_SPES.TP_NORDISK_LAND < 999      THEN                        00004710
         IF EN_SPES.TP_NORDISK_LAND < 101     !                         00004720
            EN_SPES.TP_NORDISK_LAND > 107   THEN                        00004730
            DO;                                                         00004740
               FEIL_FUNNET = '1'B;                                      00004750
               EN_SPES.TP_NORDISK_LANDNR = 485;                         00004760
            END;                                                        00004770
         ELSE                                                           00004780
         IF EN_SPES.TP_NORDISK = 0       !                              00004790
            EN_SPES.TP_NORDISK = 99999      THEN                        00004800
            DO;                                                         00004810
               FEIL_FUNNET = '1'B;                                      00004820
               EN_SPES.TP_NORDISKNR = 486;                              00004830
            END;                                                        00004840
      IF EN_SPES.PENSJON_EØS > 0 THEN                                   00004850
         IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(EN_SPES.PENSJON_EØS)) THEN    00004860
            DO;                                                         00004870
               FEIL_FUNNET = '1'B;                                      00004880
               EN_SPES.PENSJON_EØSNR = 200;                             00004890
            END;                                                        00004900
   END KONTROLL_EN_SPES;                                                00004910
