 /*       SIST ENDRET 22/07-98 14.07.47 AV   JDA7339                  */00000000
 /*       SIST ENDRET 22/07-98 14.01.24 AV   MHA7339                  */00000010
 /*       SIST ENDRET 07/02-89 13.09.36 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 30/06-83 12.27.33 AV   FARVIK                   */00000030
 /* ***************************************************************** */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /*    R0019912 PLI         PER F.BERGESTAD                           */00000060
 /*    FUNKSJONEN ER LAGET I JUNI 1981.                               */00000070
 /*HENSIKT:                                                           */00000080
 /*    KONVERTERE CHAR-FELT TIL PIC, OG PIC-FELT TIL CHAR             */00000090
 /*BRUKES:                                                            */00000100
 /*    WORKAREA_FELT = F_CHAR_PIC1(MAP_FELTI)                         */00000110
 /*PARAMETRE INN:                                                     */00000120
 /*    INPUT-FELT FRA MAP'EN                                          */00000130
 /*PARAMETRE UT :                                                     */00000140
 /*    DET KONVERTERTE FELTET                                         */00000150
 /* ***************************************************************** */00000160
 %PAGE;                                /*  */                           00000170
 /* ***************************************************************** */00000180
 /*         KONVERTERER FRA CHAR TIL PIC                              */00000190
 /* ***************************************************************** */00000200
 %SKIP(2);                                                              00000210
 F_FELT_CHAR_PIC1:                                                      00000220
   PROC(FELT_CH1) RETURNS(PIC'9');                                      00000230
   DCL                                                                  00000240
      FELT_CH1 CHAR(1),                                                 00000250
      FELT_PIC1 DEF FELT_CH1 PIC'9';                                    00000260
      RETURN(FELT_PIC1);                                                00000270
   END F_FELT_CHAR_PIC1;                                                00000280
 F_FELT_CHAR_PIC2:                                                      00000290
   PROC(FELT_CH2) RETURNS(PIC'(2)9');                                   00000300
   DCL                                                                  00000310
      FELT_CH2 CHAR(2),                                                 00000320
      FELT_PIC2 DEF FELT_CH2 PIC'(2)9';                                 00000330
      RETURN(FELT_PIC2);                                                00000340
   END F_FELT_CHAR_PIC2;                                                00000350
 %PAGE;                                                                 00000360
 F_FELT_CHAR_PIC3:                                                      00000370
   PROC(FELT_CH3) RETURNS(PIC'(3)9');                                   00000380
   DCL                                                                  00000390
      FELT_CH3 CHAR(3),                                                 00000400
      FELT_PIC3 DEF FELT_CH3 PIC'(3)9';                                 00000410
      RETURN(FELT_PIC3);                                                00000420
   END F_FELT_CHAR_PIC3;                                                00000430
 F_FELT_CHAR_PIC4:                                                      00000440
   PROC(FELT_CH4) RETURNS(PIC'(4)9');                                   00000450
   DCL                                                                  00000460
      FELT_CH4 CHAR(4),                                                 00000470
      FELT_PIC4 DEF FELT_CH4 PIC'(4)9';                                 00000480
      RETURN(FELT_PIC4);                                                00000490
   END F_FELT_CHAR_PIC4;                                                00000500
 F_FELT_CHAR_PIC5:                                                      00000510
   PROC(FELT_CH5) RETURNS(PIC'(5)9');                                   00000520
   DCL                                                                  00000530
      FELT_CH5 CHAR(5),                                                 00000540
      FELT_PIC5 DEF FELT_CH5 PIC'(5)9';                                 00000550
      RETURN(FELT_PIC5);                                                00000560
   END F_FELT_CHAR_PIC5;                                                00000570
 F_FELT_CHAR_PIC6:                                                      00000580
   PROC(FELT_CH6) RETURNS(PIC'(6)9');                                   00000590
   DCL                                                                  00000600
      FELT_CH6 CHAR(6),                                                 00000610
      FELT_PIC6 DEF FELT_CH6 PIC'(6)9';                                 00000620
      RETURN(FELT_PIC6);                                                00000630
   END F_FELT_CHAR_PIC6;                                                00000640
 F_FELT_CHAR_PIC7:                                                      00000650
   PROC(FELT_CH7) RETURNS(PIC'(7)9');                                   00000660
   DCL                                                                  00000670
      FELT_CH7 CHAR(7),                                                 00000680
      FELT_PIC7 DEF FELT_CH7 PIC'(7)9';                                 00000690
      RETURN(FELT_PIC7);                                                00000700
   END F_FELT_CHAR_PIC7;                                                00000710
 F_FELT_CHAR_PIC8:                                                      00000720
   PROC(FELT_CH8) RETURNS(PIC'(8)9');                                   00000730
   DCL                                                                  00000740
      FELT_CH8 CHAR(8),                                                 00000750
      FELT_PIC8 DEF FELT_CH8 PIC'(8)9';                                 00000760
      RETURN(FELT_PIC8);                                                00000770
   END F_FELT_CHAR_PIC8;                                                00000780
 F_FELT_CHAR_PIC9:                                                      00000790
   PROC(FELT_CH9) RETURNS(PIC'(9)9');                                   00000800
   DCL                                                                  00000810
      FELT_CH9 CHAR(9),                                                 00000820
      FELT_PIC9 DEF FELT_CH9 PIC'(9)9';                                 00000830
      RETURN(FELT_PIC9);                                                00000840
   END F_FELT_CHAR_PIC9;                                                00000850
 F_FELT_CHAR_PIC11:                                                     00000860
   PROC(FELT_CH11) RETURNS(PIC'(11)9');                                 00000870
   DCL                                                                  00000880
      FELT_CH11 CHAR(11),                                               00000890
      FELT_PIC11 DEF FELT_CH11 PIC'(11)9';                              00000900
      RETURN(FELT_PIC11);                                               00000910
   END F_FELT_CHAR_PIC11;                                               00000920
 %PAGE;                                /*   */                          00000930
 /* ***************************************************************** */00000940
 /*         KONVERTERER FRA PIC TIL CHAR                              */00000950
 /* ***************************************************************** */00000960
 %SKIP(2);                                                              00000970
 F_FELT_PIC_CHAR1:                                                      00000980
   PROC(FELT_PIC1) RETURNS(CHAR(1));                                    00000990
   DCL                                                                  00001000
      FELT_PIC1 PIC'9',                                                 00001010
      FELT_CH1 DEF FELT_PIC1 CHAR(1);                                   00001020
      RETURN(FELT_CH1);                                                 00001030
   END F_FELT_PIC_CHAR1;                                                00001040
 F_FELT_PIC_CHAR2:                                                      00001050
   PROC(FELT_PIC2) RETURNS(CHAR(2));                                    00001060
   DCL                                                                  00001070
      FELT_PIC2 PIC'(2)9',                                              00001080
      FELT_CH2 DEF FELT_PIC2 CHAR(2);                                   00001090
      RETURN(FELT_CH2);                                                 00001100
   END F_FELT_PIC_CHAR2;                                                00001110
 F_FELT_PIC_CHAR3:                                                      00001120
   PROC(FELT_PIC3) RETURNS(CHAR(3));                                    00001130
   DCL                                                                  00001140
      FELT_PIC3 PIC'(3)9',                                              00001150
      FELT_CH3 DEF FELT_PIC3 CHAR(3);                                   00001160
      RETURN(FELT_CH3);                                                 00001170
   END F_FELT_PIC_CHAR3;                                                00001180
 F_FELT_PIC_CHAR4:                                                      00001190
   PROC(FELT_PIC4) RETURNS(CHAR(4));                                    00001200
   DCL                                                                  00001210
      FELT_PIC4 PIC'(4)9',                                              00001220
      FELT_CH4 DEF FELT_PIC4 CHAR(4);                                   00001230
      RETURN(FELT_CH4);                                                 00001240
   END F_FELT_PIC_CHAR4;                                                00001250
 F_FELT_PIC_CHAR5:                                                      00001260
   PROC(FELT_PIC5) RETURNS(CHAR(5));                                    00001270
   DCL                                                                  00001280
      FELT_PIC5 PIC'(5)9',                                              00001290
      FELT_CH5 DEF FELT_PIC5 CHAR(5);                                   00001300
      RETURN(FELT_CH5);                                                 00001310
   END F_FELT_PIC_CHAR5;                                                00001320
 %PAGE;                                                                 00001330
 F_FELT_PIC_CHAR6:                                                      00001340
   PROC(FELT_PIC6) RETURNS(CHAR(6));                                    00001350
   DCL                                                                  00001360
      FELT_PIC6 PIC'(6)9',                                              00001370
      FELT_CH6 DEF FELT_PIC6 CHAR(6);                                   00001380
      RETURN(FELT_CH6);                                                 00001390
   END F_FELT_PIC_CHAR6;                                                00001400
 F_FELT_PIC_CHAR7:                                                      00001410
   PROC(FELT_PIC7) RETURNS(CHAR(7));                                    00001420
   DCL                                                                  00001430
      FELT_PIC7 PIC'(7)9',                                              00001440
      FELT_CH7 DEF FELT_PIC7 CHAR(7);                                   00001450
      RETURN(FELT_CH7);                                                 00001460
   END F_FELT_PIC_CHAR7;                                                00001470
 F_FELT_PIC_CHAR9:                                                      00001480
   PROC(FELT_PIC9) RETURNS(CHAR(9));                                    00001490
   DCL                                                                  00001500
      FELT_PIC9 PIC'(9)9',                                              00001510
      FELT_CH9 DEF FELT_PIC9 CHAR(9);                                   00001520
      RETURN(FELT_CH9);                                                 00001530
   END F_FELT_PIC_CHAR9;                                                00001540
 F_FELT_PIC_CHAR11:                                                     00001550
   PROC(FELT_PIC11) RETURNS(CHAR(11));                                  00001560
   DCL                                                                  00001570
      FELT_PIC11 PIC'(11)9',                                            00001580
      FELT_CH11 DEF FELT_PIC11 CHAR(11);                                00001590
      RETURN(FELT_CH11);                                                00001600
   END F_FELT_PIC_CHAR11;                                               00001610
