 /*       SIST ENDRET 27/04-89 14.44.15 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 19/09-85 08.09.28 AV   FARVIK                   */00000010
 /*       SIST ENDRET 22/08-84 11.33.00 AV   FARVIK                   */00000020
 /*       SIST ENDRET 15/11-82 12.03.35 AV   JANKR                    */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /*    R0011809 - PROCEDYRE I PLI                                     */00000050
 /*    PROGRAMMERER:  KRISTENSEN, NOVEMBER 1982                       */00000060
 /*HENSIKT:                                                           */00000070
 /*    PROGRAMMET INNEHOLDER:                                         */00000080
 /*        PROSEDYRE FOR BLANKING AV MAPEN                            */00000090
 /*        PROSEDYRE FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL       */00000100
 /*            AU_TRANS_OMRÅDE.                                       */00000110
 /*BRUK:                                                              */00000120
 /*%INCLUDE R0011809;                                                 */00000130
 /*    BLANK_AU_MAP:           SETTER LOW VALUES TIL MAP              */00000140
 /*    OVERFØR_AU_SØKER:       OVERFØRER MAP -< ARBEIDSOMRÅDE         */00000150
 /*                                                                   */00000160
 /* ***************************************************************** */00000170
 /*  ENDRINGERSDATO :          240489                                 */00000180
 /*  ENDRINGEN GJELDER :       PROSEDYRENE ER FLYTTET FRA R0011802.   */00000190
 /*  ENDRINGEN BLE UTFØRT AV : BRITT                                  */00000200
 /*                                                                   */00000210
 /* ***************************************************************** */00000220
 %PAGE;                                /*   */                          00000230
 /* ***************************************************************** */00000240
 /*                                                                   */00000250
 /*   PROSEDYRE FOR Å BLANKE MAPEN S001181O                           */00000260
 /*                                                                   */00000270
 /*                                                                   */00000280
 /* ***************************************************************** */00000290
 %SKIP(2);                                                              00000300
 BLANK_AU_MAP:                                                          00000310
   PROC;                                                                00000320
                                                                        00000330
     DCL                                                                00000340
        LOW BUILTIN;                                                    00000350
                                                                        00000360
     FNRO       = LOW(11);                                              00000370
     STBREVO    = LOW( 1);                                              00000380
     TRANSTYPEO = LOW( 1);                                              00000390
     MELDING1O  = (78)' ';                                              00000400
     MELDING2O  = (78)' ';                                              00000410
     MELDING3O  = (78)' ';                                              00000420
     MELDING4O  = (78)' ';                                              00000430
     MELDING5O  = (78)' ';                                              00000440
     MELDING6O  = (78)' ';                                              00000450
                                                                        00000460
 END BLANK_AU_MAP;                                                      00000470
                                                                        00000480
                                                                        00000490
 /* ***************************************************************** */00000500
 /*                                                                   */00000510
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT, EVENTUELT ENDRET   */00000520
 /*   PÅ SKJERMBILDET TIL AU_TRANS_OMR.                               */00000530
 /*          MAPSET : S001183     MAP: S001181                        */00000540
 /*                                                                   */00000550
 /* ***************************************************************** */00000560
 %SKIP(2);                                                              00000570
 OVERFØR_AU_SØKER:                                                      00000580
   PROC;                                                                00000590
                                                                        00000600
     IF FNRL > 0 THEN                                                   00000610
        AUS.FNR    = F_FELT_CHAR_PIC11(FNRI);                           00000620
     IF STBREVL > 0 THEN                                                00000630
        AUS.STBREV = STBREVI;                                           00000640
     IF TRANSTYPEL > 0 THEN                                             00000650
        AUS.TRANSTYPE = TRANSTYPEI;                                     00000660
                                                                        00000670
 END OVERFØR_AU_SØKER;                                                  00000680
