 /*       SIST ENDRET 06/04-94 14.53.11 AV   DYBVIK                   */00000000
 KONTROLL_OO_SØKER:                                                     00000010
   PROC (FEIL_FUNNET);                                                  00000020
   DCL                                                                  00000030
      FEIL_FUNNET     BIT (1);                                          00000040
                                                                        00000050
   DCL       W_FNR                                 PIC'(11)9';          00000060
   DCL  1 FNR DEF W_FNR,                                                00000070
          2 DAG                                   PIC'(2)9',            00000080
          2 MND                                   PIC'(2)9',            00000090
          2 AAR                                   PIC'(2)9',            00000100
          2 ÅRHUNDRE                              PIC'9',               00000110
          2 REST                                  PIC'(4)9';            00000120
   DCL                                                                  00000130
      DATE            BUILTIN;                                          00000140
 /*  HJELPE DCL FOR Å SNU DATO           */                             00000150
                                                                        00000160
                                                                        00000170
                                                                        00000180
   DCL                                                                  00000190
      (FEIL19,                                                          00000200
      FEIL20,                                                           00000210
      FEIL21,                                                           00000220
      FEIL22) BIT (1);                                                  00000230
                                                                        00000240
                                                                        00000250
   DCL                                                                  00000260
      ANT_BARN          FIXED BIN(15),                                  00000270
      TELL_BARN         FIXED BIN(15),                                  00000280
      TELL              FIXED BIN(15);                                  00000290
                                                                        00000300
                                                                        00000310
   DCL                                                                  00000320
      1 FNR_REG,                                                        00000330
        2 FNR1      FIXED DEC(11),                                      00000340
        2 FNR2      FIXED DEC(11),                                      00000350
        2 BRUKERID  CHAR     ( 4);                                      00000360
                                                                        00000370
    FNR_REG.BRUKERID =  DIV_PARAM_OMR.CICS_IND;                         00000380
                                                                        00000390
                                                                        00000400
      FEIL19 = '0'B;                                                    00000410
      FEIL20 = '0'B;                                                    00000420
      FEIL21 = '0'B;                                                    00000430
      FEIL22 = '0'B;                                                    00000440
      FEIL_FUNNET = '0'B;                                               00000450
                                                                        00000460
                                                                        00000470
       IF ^F_GYLDIG_FNR(OOS.FRA_FNR) THEN                               00000480
          DO;                                                           00000490
             FEIL_FUNNET = '1'B;                                        00000500
             OOS.FRA_FNRNR = 1;                                         00000510
          END;                                                          00000520
    ELSE                                                                00000530
          DO;                                                           00000540
             FNR_REG.FNR1 = OOS.FRA_FNR;                                00000550
             W_FNR    = OOS.FRA_FNR;                                    00000560
             EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);      00000570
             IF FNR_REG.FNR2 > 0 THEN                                   00000580
                DO;                                                     00000590
                   OOS.FRA_FNRNR = 203;                                 00000600
                   OOS.FRA_FNR_GML = OOS.FRA_FNR;                       00000610
                   OOS.FRA_FNR = FNR_REG.FNR2;                          00000620
                END;                                                    00000630
          END;                                                          00000640
                                                                        00000650
       IF ^F_GYLDIG_FNR(OOS.TIL_FNR) THEN                               00000660
          DO;                                                           00000670
             FEIL_FUNNET = '1'B;                                        00000680
             OOS.TIL_FNRNR = 1;                                         00000690
          END;                                                          00000700
       ELSE                                                             00000710
          DO;                                                           00000720
             FNR_REG.FNR1 = OOS.TIL_FNR;                                00000730
             W_FNR    = OOS.TIL_FNR;                                    00000740
             EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);      00000750
             IF FNR_REG.FNR2 > 0 THEN                                   00000760
                DO;                                                     00000770
                   OOS.TIL_FNRNR = 203;                                 00000780
                   OOS.TIL_FNR_GML = OOS.TIL_FNR;                       00000790
                   OOS.TIL_FNR = FNR_REG.FNR2;                          00000800
                END;                                                    00000810
          END;                                                          00000820
                                                                        00000830
    IF OOS.START_ÅR  <  '92'    THEN                                    00000840
       DO;                                                              00000850
          FEIL_FUNNET = '1'B;                                           00000860
          OOS.START_ÅRNR    = 140;                                      00000870
       END;                                                             00000880
                                                                        00000890
    IF OOS.BARN_ANTTAL > 12     THEN                                    00000900
       DO;                                                              00000910
          FEIL_FUNNET = '1'B;                                           00000920
          OOS.BARN_ANTTALNR = 214;                                      00000930
       END;                                                             00000940
                                                                        00000950
 /* ***************************************************************** */00000960
 /*                                                                   */00000970
 /*    KONTROLL AV OO_BARN.                                           */00000980
 /*                                                                   */00000990
 /* ***************************************************************** */00001000
 %SKIP(2);                                                              00001010
      TELL_BARN = 0;                                                    00001020
                                                                        00001030
                                                                        00001040
  DO K = 1 TO 12;                                                       00001050
     IF OOB.FNR_BARN(K) >   0   THEN                                    00001060
        TELL_BARN = TELL_BARN + 1;                                      00001070
  END;                                                                  00001080
                                                                        00001090
  IF OOS.BARN_ANTTAL ^= TELL_BARN     THEN                              00001100
     DO;                                                                00001110
         FEIL_FUNNET = '1'B;                                            00001120
         OOS.BARN_ANTTALNR = 282;                                       00001130
     END;                                                               00001140
                                                                        00001150
  DO K = 1 TO 12 WHILE( OOB.FNR_BARN(K) > 0);                           00001160
     IF ^ F_GYLDIG_FNR(OOB.FNR_BARN(K)) THEN                            00001170
          DO;                                                           00001180
         IF ^FEIL20 THEN                                                00001190
             DO;                                                        00001200
                FEIL20 = '1'B;                                          00001210
                OOB.FNR_BARNNR(K) = 20;                                 00001220
             END;                                                       00001230
          ELSE                                                          00001240
                OOB.FNR_BARNNR(K) = 999;                                00001250
       END;                                                             00001260
     ELSE                                                               00001270
     IF OOB.FNR_BARN(K) =          OOS.FRA_FNR  THEN                    00001280
        DO;                                                             00001290
          FEIL_FUNNET = '1'B;                                           00001300
          OOB.FNR_BARNNR(K) = 165;                                      00001310
        END;                                                            00001320
     ELSE                                                               00001330
     IF OOB.FNR_BARN(K)         =  OOS.TIL_FNR  THEN                    00001340
        DO;                                                             00001350
           FEIL_FUNNET = '1'B;                                          00001360
           OOB.FNR_BARNNR(K) = 165;                                     00001370
         END;                                                           00001380
                                                                        00001390
                                                                        00001400
  END;                                                                  00001410
                                                                        00001420
      FEIL_FUNNET = FEIL_FUNNET ! FEIL21 ! FEIL22 ! FEIL19 ! FEIL20;    00001430
                                                                        00001440
   END KONTROLL_OO_SØKER;                                               00001450
                                                                        00001460
