 /*       SIST ENDRET 08/05-98 12.37.39 AV   JDA7339                  */00000000
 /*       SIST ENDRET 30/03-98 12.56.28 AV   JDA7339                  */00000010
 /*       SIST ENDRET 05/12-97 12.18.16 AV   JDA7339                  */00000020
 /*       SIST ENDRET 27/11-97 10.42.30 AV   JDA7339                  */00000030
 /*       SIST ENDRET 31/10-97 12.18.59 AV   JDA7339                  */00000040
 /*       SIST ENDRET 04/08-97 14.09.37 AV   JDA7339                  */00000050
 /*       SIST ENDRET 17/11-94 12.06.42 AV   JDA0310                  */00000060
 /*       SIST ENDRET 25/02-94 14.11.51 AV   HERMAN                   */00000070
 /* ***************************************************************** */00000080
 /*IDENTIFIKASJON:                                                    */00000090
 /* **********************                                            */00000100
 /*  PROGRAM-IDENT : R001NU12  UNDERPROGRAM SOM BRUKES AV R001NO10    */00000110
 /*                            KONTROLL U3-BLANKETT.                  */00000120
 /*  PROGRAM-SPRÅK : PLI                                              */00000130
 /*  PROGRAMMERER  : HERMAN                                           */00000140
 /*  PROGRAMMET BLE LAGET : FEB 1994                                  */00000150
 /* ***************************************************************** */00000160
 /*  ENDRINGERSDATO :                                                 */00000170
 /*  ENDRINGEN GJELDER:                                               */00000180
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000190
 /*                                                                   */00000200
 /* ***************************************************************** */00000210
 /*BRUK:                                                              */00000220
 /* ********                                                          */00000230
 /*                                                                   */00000240
 /*  %INCLUDE R001NU12                                                */00000250
 /*                                                                   */00000260
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */00000270
 /*                                                                   */00000280
 /*    R001U602   BLANK TRANSOMR                                      */00000290
 /*    R001U603   KONTR U3 SØKER                                      */00000300
 /*    FUNKSJONER SOM BRUKES ER INCLUDET I HOVEDPROGRAMMET.           */00000310
 /*                                                                   */00000320
 /* ***************************************************************** */00000330
 /*                                                                   */00000340
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR U3 OG FLYTTER DERETTER        */00000350
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */00000360
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */00000370
 /*  NUMRE TATT VARE PÅ.                                              */00000380
 /*                                                                   */00000390
 /* ***************************************************************** */00000400
                                                                        00000410
 P106_BEHANDLE_U3: PROC;                                                00000420
                                                                        00000430
                                                                        00000440
 %INCLUDE P001U601;                      /* TRANSOMRÅDE U3 */           00000450
                                                                        00000460
                                                                        00000470
          CALL BLANK_U3_SØKER;                         /* R001U602 */   00000480
          CALL BLANK_U3_MELDNR;                        /* R001U602 */   00000490
          CALL BLANK_U3_SPES;                          /* R001U602 */   00000500
          CALL BLANK_U3_YP  ;                          /* R001U602 */   00000510
          CALL OVERF_U3_BLANKETT;                                       00000520
          CALL KONTROLL_U3_SØKER(FEIL_FUNNET);         /* R001U603 */   00000530
                                                                        00000540
          IF U3S.NORSK_BOSATT = 'N'   THEN                              00000550
             DO;                                                        00000560
                FEIL_I_BOSATT = TRUE;                                   00000570
                FEIL_FUNNET   = TRUE;                                   00000580
             END;                                                       00000590
                                                                        00000600
          IF FEIL_FUNNET      THEN                                      00000610
             CALL FINN_FEIL_U3;                                         00000620
                                                                        00000630
                                                                        00000640
                                                                        00000650
                                                                        00000660
 /* ***************************************************************** */00000670
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */00000680
 /*    RECORDEN TIL U3 TRANSOMRÅDE FOR U3 SØKER.                      */00000690
 /* ***************************************************************** */00000700
 OVERF_U3_BLANKETT:PROC;                                                00000710
                                                                        00000720
          U3S.ATT_UF       =  U3_BLANKETT.YTELSE;                       00000730
          U3S.REGDATO      =  BLANKETT_RECORD.TRANS_DATO_ÅMD;           00000740
          U3S.TERMID       = 'NORT';                                    00000750
          U3S.FNR          =  BLANKETT_RECORD.FNR;                      00000760
          U3S.NAVN         =  BLANKETT_RECORD.NAVN;                     00000770
          U3S.SPRÅK        =  U3_BLANKETT.SPRÅK;                        00000780
          U3S.TKNR         =  BLANKETT_RECORD.TKNR;                     00000790
          U3S.SIVILSTAND   =  U3_BLANKETT.SIVILSTAND;                   00000800
          U3S.TILL_EK      =  U3_BLANKETT.EKTEFELLETILLEGG;             00000810
          U3S.TILL_BARN    =  ' ';                                      00000820
          U3S.VIRK_DATO_MÅ =  U3_BLANKETT.VIRK_DATO_MÅ;                 00000830
                                                                        00000840
          U3S.NORSK_BOSATT =  U3_BLANKETT.NORSK_BOSATT;                 00000850
                                                                        00000860
          DO I = 1 TO 4;                                                00000870
             IF F_FELT_PIC_CHAR2 (U3_BLANKETT.VP_ÅR(I)) ^= '  ' THEN    00000880
                U3S.VP_ÅR(I) =  U3_BLANKETT.VP_ÅR(I);                   00000890
          END;                                                          00000900
                                                                        00000910
          U3S.UTDANNING      =  U3_BLANKETT.UTDANNING;                  00000920
          U3S.VILKÅR_8_4_3A  =  U3_BLANKETT.VILKÅR_8_4_3A;              00000930
          U3S.YRKESM_ATTF    =  U3_BLANKETT.YRKESM_ATTF;                00000940
                                                                        00000950
          IF F_FELT_PIC_CHAR3 (U3_BLANKETT.UFG) ^= '   '         THEN   00000960
             U3S.UFG       =  U3_BLANKETT.UFG;                          00000970
                                                                        00000980
          IF F_FELT_PIC_CHAR4 (U3_BLANKETT.UFT) ^= (4)' '   THEN        00000990
             U3S.UFT_MÅ    =  U3_BLANKETT.UFT;                          00001000
                                                                        00001010
          IF F_FELT_PIC_CHAR5 (U3_BLANKETT.PI) ^= (5)' '   THEN         00001020
             U3S.PI        =  U3_BLANKETT.PI * 100;                     00001030
          ELSE                                                          00001040
             U3S.PI        = 0;                                         00001050
                                                                        00001060
          IF F_FELT_PIC_CHAR2 (U3_BLANKETT.YNGSTE_BARN_FÅR) ^= '  '     00001070
             THEN U3S.YNGSTE_BARN_FÅR =  U3_BLANKETT.YNGSTE_BARN_FÅR;   00001080
                                                                        00001090
                                                                        00001100
          IF F_FELT_PIC_CHAR2 (U3_BLANKETT.YRKE) ^= '  '   THEN         00001110
             U3S.YRKE      =  U3_BLANKETT.YRKE;                         00001120
                                                                        00001130
          IF F_FELT_PIC_CHAR11 (U3_BLANKETT.FNR_EK) ^= (11)' '   THEN   00001140
             U3S.FNR_EK    =  U3_BLANKETT.FNR_EK;                       00001150
                                                                        00001160
          U3S.NAVN_EK      =  U3_BLANKETT.NAVN_EK;                      00001170
                                                                        00001180
                                                                        00001190
      IF F_FELT_PIC_CHAR7 (U3_BLANKETT.INNTEKT_FØR_UFØR) ^= (7)' ' THEN 00001200
             U3S.INNTEKT_FØR_UP = U3_BLANKETT.INNTEKT_FØR_UFØR;         00001210
                                                                        00001220
      U3S.TIDSBEGR_ATTF = U3_BLANKETT.TIDSBEGR_ATTF;  /*0797HL*/        00001230
      U3S.SKJERM_ATTF   = U3_BLANKETT.SKJERM_ATTF;    /*0797HL*/        00001240
      U3S.EK_INNT_OVER_2G  = U3_BLANKETT.EK_INNT_OVER_2G; /*1197*/      00001250
      U3S.GARANTERT_TP  = U3_BLANKETT.GARANTERT_TP;       /*9803*/      00001260
      U3S.FRYSP_3ÅR_ARB = U3_BLANKETT.FRYSP_3ÅR_ARB;      /*9803*/      00001270
      U3S.FRYSP_TIDSB   = U3_BLANKETT.FRYSP_TIDSB  ;      /*9803*/      00001280
                                                                        00001290
    END OVERF_U3_BLANKETT;                                              00001300
                                                                        00001310
                                                                        00001320
 /* ***************************************************************** */00001330
 /*    PROCEDURE SOM FINNER OG TAR VARE PÅ FEIL_MELD_NR NÅR DET ER    */00001340
 /*    FEIL I DEN OVERFØRTE RECORDEN.                                 */00001350
 /* ***************************************************************** */00001360
 FINN_FEIL_U3:PROC;                                                     00001370
                                                                        00001380
          FEIL_IND = 1;                                                 00001390
                                                                        00001400
          IF U3S.ATT_UFNR ^= 0 &                                        00001410
             U3S.ATT_UFNR ^= 999 THEN                                   00001420
             DO;                                                        00001430
                W01_FEIL_NR(FEIL_IND) = U3S.ATT_UFNR;                   00001440
                FEIL_IND = FEIL_IND + 1;                                00001450
             END;                                                       00001460
                                                                        00001470
          IF U3S.FNRNR ^= 0 &                                           00001480
             U3S.FNRNR ^= 999 THEN                                      00001490
             DO;                                                        00001500
                W01_FEIL_NR(FEIL_IND) = U3S.FNRNR;                      00001510
                FEIL_IND = FEIL_IND + 1;                                00001520
             END;                                                       00001530
                                                                        00001540
          IF U3S.TKNRNR ^= 0 &                                          00001550
             U3S.TKNRNR ^= 999 THEN                                     00001560
             DO;                                                        00001570
                W01_FEIL_NR(FEIL_IND) = U3S.TKNRNR;                     00001580
                IF FEIL_IND ^= 3 THEN                                   00001590
                   FEIL_IND = FEIL_IND + 1;                             00001600
             END;                                                       00001610
                                                                        00001620
          IF U3S.NAVNNR ^= 0 &                                          00001630
             U3S.NAVNNR ^= 999 THEN                                     00001640
             DO;                                                        00001650
                W01_FEIL_NR(FEIL_IND) = U3S.NAVNNR;                     00001660
                IF FEIL_IND ^= 3 THEN                                   00001670
                   FEIL_IND  = FEIL_IND + 1;                            00001680
             END;                                                       00001690
                                                                        00001700
          IF U3S.SPRÅKNR ^= 0 &                                         00001710
             U3S.SPRÅKNR ^= 999 THEN                                    00001720
             DO;                                                        00001730
                W01_FEIL_NR(FEIL_IND) = U3S.SPRÅKNR;                    00001740
                IF FEIL_IND ^= 3 THEN                                   00001750
                   FEIL_IND  = FEIL_IND + 1;                            00001760
             END;                                                       00001770
                                                                        00001780
          IF U3S.SIVILSTANDNR ^= 0 &                                    00001790
             U3S.SIVILSTANDNR ^= 999 THEN                               00001800
             DO;                                                        00001810
                W01_FEIL_NR(FEIL_IND) = U3S.SIVILSTANDNR;               00001820
                IF FEIL_IND ^= 3 THEN                                   00001830
                   FEIL_IND  = FEIL_IND + 1;                            00001840
             END;                                                       00001850
                                                                        00001860
          IF U3S.TILL_EKNR ^= 0 &                                       00001870
             U3S.TILL_EKNR ^= 999 THEN                                  00001880
             DO;                                                        00001890
                W01_FEIL_NR(FEIL_IND) = U3S.TILL_EKNR;                  00001900
                IF FEIL_IND ^= 3 THEN                                   00001910
                   FEIL_IND  = FEIL_IND + 1;                            00001920
             END;                                                       00001930
                                                                        00001940
          IF U3S.TILL_BARNNR ^= 0 &                                     00001950
             U3S.TILL_BARNNR ^= 999 THEN                                00001960
             DO;                                                        00001970
                W01_FEIL_NR(FEIL_IND) = U3S.TILL_BARNNR;                00001980
                IF FEIL_IND ^= 3 THEN                                   00001990
                   FEIL_IND  = FEIL_IND + 1;                            00002000
             END;                                                       00002010
                                                                        00002020
          IF U3S.YNGSTE_BARN_FÅRNR ^= 0 &                               00002030
             U3S.YNGSTE_BARN_FÅRNR ^= 999 THEN                          00002040
             DO;                                                        00002050
                W01_FEIL_NR(FEIL_IND) = U3S.YNGSTE_BARN_FÅRNR;          00002060
                IF FEIL_IND ^= 3 THEN                                   00002070
                   FEIL_IND  = FEIL_IND + 1;                            00002080
             END;                                                       00002090
                                                                        00002100
          IF U3S.NORSK_BOSATTNR ^= 0 &                                  00002110
             U3S.NORSK_BOSATTNR ^= 999 THEN                             00002120
             DO;                                                        00002130
                W01_FEIL_NR(FEIL_IND) = U3S.NORSK_BOSATTNR;             00002140
                IF FEIL_IND ^= 3 THEN                                   00002150
                   FEIL_IND  = FEIL_IND + 1;                            00002160
             END;                                                       00002170
                                                                        00002180
          DO I = 1 TO 4;                                                00002190
             IF U3S.VP_ÅRNR(I) ^= 0 &                                   00002200
                U3S.VP_ÅRNR(I) ^= 999 THEN                              00002210
                DO;                                                     00002220
                   W01_FEIL_NR(FEIL_IND) = U3S.VP_ÅRNR(I);              00002230
                   IF FEIL_IND ^= 3 THEN                                00002240
                      FEIL_IND = FEIL_IND + 1;                          00002250
                END;                                                    00002260
          END;                                                          00002270
                                                                        00002280
                                                                        00002290
          IF U3S.UTDANNINGNR ^= 0 &                                     00002300
             U3S.UTDANNINGNR ^= 999 THEN                                00002310
             DO;                                                        00002320
                W01_FEIL_NR(FEIL_IND) = U3S.UTDANNINGNR;                00002330
                IF FEIL_IND ^= 3 THEN                                   00002340
                   FEIL_IND  = FEIL_IND + 1;                            00002350
             END;                                                       00002360
                                                                        00002370
          IF U3S.YRKESM_ATTFNR ^= 0 &                                   00002380
             U3S.YRKESM_ATTFNR ^= 999 THEN                              00002390
             DO;                                                        00002400
                W01_FEIL_NR(FEIL_IND) = U3S.YRKESM_ATTFNR;              00002410
                IF FEIL_IND ^= 3 THEN                                   00002420
                   FEIL_IND  = FEIL_IND + 1;                            00002430
             END;                                                       00002440
                                                                        00002450
          IF U3S.VILKÅR_8_4_3ANR ^= 0 &                                 00002460
             U3S.VILKÅR_8_4_3ANR ^= 999 THEN                            00002470
             DO;                                                        00002480
                W01_FEIL_NR(FEIL_IND) = U3S.VILKÅR_8_4_3ANR;            00002490
                IF FEIL_IND ^= 3 THEN                                   00002500
                   FEIL_IND  = FEIL_IND + 1;                            00002510
             END;                                                       00002520
                                                                        00002530
          IF U3S.UFGNR ^= 0 &                                           00002540
             U3S.UFGNR ^= 999 THEN                                      00002550
             DO;                                                        00002560
                W01_FEIL_NR(FEIL_IND) = U3S.UFGNR;                      00002570
                IF FEIL_IND ^= 3 THEN                                   00002580
                   FEIL_IND  = FEIL_IND + 1;                            00002590
             END;                                                       00002600
                                                                        00002610
          IF U3S.UFT_MÅNR ^= 0 &                                        00002620
             U3S.UFT_MÅNR ^= 999 THEN                                   00002630
             DO;                                                        00002640
                W01_FEIL_NR(FEIL_IND) = U3S.UFT_MÅNR;                   00002650
                IF FEIL_IND ^= 3 THEN                                   00002660
                   FEIL_IND  = FEIL_IND + 1;                            00002670
             END;                                                       00002680
                                                                        00002690
          IF U3S.PINR ^= 0 &                                            00002700
             U3S.PINR ^= 999 THEN                                       00002710
             DO;                                                        00002720
                W01_FEIL_NR(FEIL_IND) = U3S.PINR;                       00002730
                IF FEIL_IND ^= 3 THEN                                   00002740
                   FEIL_IND  = FEIL_IND + 1;                            00002750
             END;                                                       00002760
                                                                        00002770
          IF U3S.YRKENR ^= 0 &                                          00002780
             U3S.YRKENR ^= 999 THEN                                     00002790
             DO;                                                        00002800
                W01_FEIL_NR(FEIL_IND) = U3S.YRKENR;                     00002810
                IF FEIL_IND ^= 3 THEN                                   00002820
                   FEIL_IND  = FEIL_IND + 1;                            00002830
             END;                                                       00002840
                                                                        00002850
          IF U3S.VIRK_DATO_MÅNR ^= 0 &                                  00002860
             U3S.VIRK_DATO_MÅNR ^= 999 THEN                             00002870
             DO;                                                        00002880
                W01_FEIL_NR(FEIL_IND) = U3S.VIRK_DATO_MÅNR;             00002890
                IF FEIL_IND ^= 3 THEN                                   00002900
                   FEIL_IND  = FEIL_IND + 1;                            00002910
             END;                                                       00002920
                                                                        00002930
          IF U3S.FNR_EKNR ^= 0 &                                        00002940
             U3S.FNR_EKNR ^= 999 THEN                                   00002950
             DO;                                                        00002960
                W01_FEIL_NR(FEIL_IND) = U3S.FNR_EKNR;                   00002970
                IF FEIL_IND ^= 3 THEN                                   00002980
                   FEIL_IND  = FEIL_IND + 1;                            00002990
             END;                                                       00003000
                                                                        00003010
          IF U3S.NAVN_EKNR ^= 0 &                                       00003020
             U3S.NAVN_EKNR ^= 999 THEN                                  00003030
             DO;                                                        00003040
                W01_FEIL_NR(FEIL_IND) = U3S.NAVN_EKNR;                  00003050
                IF FEIL_IND ^= 3 THEN                                   00003060
                   FEIL_IND  = FEIL_IND + 1;                            00003070
             END;                                                       00003080
                                                                        00003090
          IF U3S.INNTEKT_FØR_UPNR ^= 0 &                                00003100
             U3S.INNTEKT_FØR_UPNR ^= 999 THEN                           00003110
             DO;                                                        00003120
                W01_FEIL_NR(FEIL_IND) = U3S.INNTEKT_FØR_UPNR;           00003130
                IF FEIL_IND ^= 3 THEN                                   00003140
                   FEIL_IND  = FEIL_IND + 1;                            00003150
             END;                                                       00003160
          IF U3S.TIDSBEGR_ATTFNR ^= 0 &                                 00003170
             U3S.TIDSBEGR_ATTFNR ^= 999 THEN                            00003180
             DO;                                                        00003190
                W01_FEIL_NR(FEIL_IND) = U3S.TIDSBEGR_ATTFNR;            00003200
                IF FEIL_IND ^= 3 THEN                                   00003210
                   FEIL_IND  = FEIL_IND + 1;                            00003220
             END;                                                       00003230
          IF U3S.SKJERM_ATTFNR ^= 0 &                                   00003240
             U3S.SKJERM_ATTFNR ^= 999 THEN                              00003250
             DO;                                                        00003260
                W01_FEIL_NR(FEIL_IND) = U3S.SKJERM_ATTFNR;              00003270
                IF FEIL_IND ^= 3 THEN                                   00003280
                   FEIL_IND  = FEIL_IND + 1;                            00003290
             END;                                                       00003300
          IF U3S.EK_INNT_OVER_2GNR ^= 0 &                               00003310
             U3S.EK_INNT_OVER_2GNR ^= 999 THEN                          00003320
             DO;                                                        00003330
                W01_FEIL_NR(FEIL_IND) = U3S.EK_INNT_OVER_2GNR;          00003340
                IF FEIL_IND ^= 3 THEN                                   00003350
                   FEIL_IND  = FEIL_IND + 1;                            00003360
             END;                                                       00003370
          IF U3S.GARANTERT_TPNR ^= 0 &                                  00003380
             U3S.GARANTERT_TPNR ^= 999 THEN                             00003390
             DO;                                                        00003400
                W01_FEIL_NR(FEIL_IND) = U3S.GARANTERT_TPNR;             00003410
                IF FEIL_IND ^= 3 THEN                                   00003420
                   FEIL_IND  = FEIL_IND + 1;                            00003430
             END;                                                       00003440
          IF U3S.FRYSP_3ÅR_ARBNR ^= 0 &                                 00003450
             U3S.FRYSP_3ÅR_ARBNR ^= 999 THEN                            00003460
             DO;                                                        00003470
                W01_FEIL_NR(FEIL_IND) = U3S.FRYSP_3ÅR_ARBNR;            00003480
                IF FEIL_IND ^= 3 THEN                                   00003490
                   FEIL_IND  = FEIL_IND + 1;                            00003500
             END;                                                       00003510
          IF U3S.FRYSP_TIDSBNR ^= 0 &                                   00003520
             U3S.FRYSP_TIDSBNR ^= 999 THEN                              00003530
             DO;                                                        00003540
                W01_FEIL_NR(FEIL_IND) = U3S.FRYSP_TIDSBNR;              00003550
                IF FEIL_IND ^= 3 THEN                                   00003560
                   FEIL_IND  = FEIL_IND + 1;                            00003570
             END;                                                       00003580
                                                                        00003590
    END FINN_FEIL_U3;                                                   00003600
                                                                        00003610
 %PAGE;                                                                 00003620
 /* ***************************************************************** */00003630
 /*          E K S T E R N E    P R O C E D U R E R                   */00003640
 /* ***************************************************************** */00003650
                                                                        00003660
 %PAGE;                                                                 00003670
 %INCLUDE R001U602;          /*     BLANK U3 TRANSOMR   */              00003680
 %PAGE;                                                                 00003690
 %INCLUDE R001U603;          /*     KONTR U3 SØKER      */              00003700
                                                                        00003710
 END P106_BEHANDLE_U3;                                                  00003720
                                                                        00003730
                                                                        00003740
