 /*       SIST ENDRET 25/06-96 12.59.08 AV   JDA0310                  */00000000
 /*       SIST ENDRET 06/01-93 12.30.32 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 24/01-92 15.25.02 AV   TRUDE                    */00000020
 /*       SIST ENDRET 10/10-91 13.58.04 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 22/05-90 10.06.07 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 16/05-88 12.29.12 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 07/02-86 11.39.09 AV   FARVIK                   */00000060
 /*       SIST ENDRET 11/10-85 13.07.21 AV   FARVIK                   */00000070
 /*       SIST ENDRET 31/01-85 09.43.05 AV   HERMAN                   */00000080
 /*       SIST ENDRET 15/01-85 11.05.02 AV   HERMAN                   */00000090
 /*       SIST ENDRET 01/11-84 14.28.05 AV   FARVIK                   */00000100
 /*       SIST ENDRET 26/03-84 11.20.46 AV   FARVIK                   */00000110
 /* **************************************************************** */ 00000120
 /*IDENTIFIKASJON:                                                   */ 00000130
 /*    R0011703 - PROSEDYRE I PLI                                    */ 00000140
 /*    PROGRAMMERER: GEIR, SEPTEMBER 1981                            */ 00000150
 /*HENSIKT:                                                          */ 00000160
 /*    PROSEDYREN FORETAR KONTROLL AV DATA VEDRØRENDE                */ 00000170
 /*    OPPHØRSBLANKETT 2.                                            */ 00000180
 /*PROGRAMTILKNYTNING:                                               */ 00000190
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV                */ 00000200
 /*    OPPHØRSBLANKETT 2, INCLUDES I R0011701.                       */ 00000210
 /*BRUK:                                                             */ 00000220
 /*    CALL KONTROLL_O2                                              */ 00000230
 /* **************************************************************** */ 00000240
 /*                                                                  */ 00000250
 /*ENDRET: 14.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S            */ 00000260
 /* ******                                                           */ 00000270
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ     */ 00000280
 /*    OM FNR ER ENDRET (R0019906).                                  */ 00000290
 /* **************************************************************** */ 00000300
 /*    MODULEN KONTROLLERER OPPHØRSBLANKETT NR 2 OG RETURNERER       */ 00000310
 /*    MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG.           */ 00000320
 /* **************************************************************** */ 00000330
 %SKIP(2);                                                              00000340
 KONTROLL_O2:                                                           00000350
   PROC (FEIL_FUNNET);                                                  00000360
   DCL                                                                  00000370
      I           FIXED BIN (15),                                       00000380
      FEIL_FUNNET BIT (1);                                              00000390
   DCL                                                                  00000400
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00000410
      KEY_PEKER                  POINTER,                               00000420
      TK_RECL                    CHAR (101);                            00000430
   DCL                                                                  00000440
      1 FNR_REG,                                                        00000450
        2 FNR1         FIXED DEC(11),                                   00000460
        2 FNR2         FIXED DEC(11),                                   00000470
        2 BRUKERID     CHAR     ( 4);                                   00000480
                                                                        00000490
                                                                        00000500
   DCL                                                                  00000510
      HJ_VIRK_DATO_ÅM PIC '9999',                                       00000520
      VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅM POS(1) PIC '99',                  00000530
      VIRK_DATO_M DEF HJ_VIRK_DATO_ÅM POS(3) PIC '99';                  00000540
                                                                        00000550
   DCL                                                                  00000560
      HJ_VIRK_DATO_MÅ PIC '9999',                                       00000570
      HJ_VIRK_DATO_M DEF HJ_VIRK_DATO_MÅ POS(1) PIC '99',               00000580
      HJ_VIRK_DATO_Å DEF HJ_VIRK_DATO_MÅ POS(3) PIC '99';               00000590
      FNR_REG.BRUKERID =  DIV_PARAM_OMR.CICS_IND;                       00000600
      FEIL_FUNNET      = '0'B;                                          00000610
      ANT_FEIL_SKREVET =  0;                                            00000620
      KEY_PEKER        =  ADDR(O2.TKNR);                                00000630
                                                                        00000640
 /* BLANKETTER MED VIRK FRAM I TID AVVISES FRA 01.92  SP 1191 */        00000650
    HJ_VIRK_DATO_MÅ  = O2.VIRK_DATO_MÅ;                                 00000660
    VIRK_DATO_Å      = HJ_VIRK_DATO_Å;                                  00000670
    VIRK_DATO_M      = HJ_VIRK_DATO_M;                                  00000680
                                                                        00000690
                                                                        00000700
 /*IF HJ_VIRK_DATO_ÅM > 9201  THEN  FJERNET 230192  TRUDE               00000710
      DO;                                                               00000720
         FEIL_FUNNET = '1'B;                                            00000730
         O2.VIRK_DATO_MÅNR = 299;                                       00000740
      END;                                                              00000750
         HIT SP 11.91  *********    */                                  00000760
                                                                        00000770
      IF ^F_NUMERISK(F_FELT_PIC_CHAR11(O2.FNR)) THEN                    00000780
         DO;                                                            00000790
            FEIL_FUNNET = '1'B;                                         00000800
            O2.FNRNR    = 200;                                          00000810
         END;                                                           00000820
      ELSE                                                              00000830
         IF ^F_GYLDIG_FNR(O2.FNR) THEN                                  00000840
            DO;                                                         00000850
               FEIL_FUNNET = '1'B;                                      00000860
               O2.FNRNR    = 1;                                         00000870
            END;                                                        00000880
         ELSE                                                           00000890
            DO;                                                         00000900
               FNR_REG.FNR1 = O2.FNR;                                   00000910
               EXEC CICS LINK PROGRAM ('R0019906') COMMAREA (FNR_REG);  00000920
               IF FNR_REG.FNR2 > 0 THEN                                 00000930
                  DO;                                                   00000940
                     O2.FNRNR   = 203;                                  00000950
                     O2.FNR_GML = O2.FNR;                               00000960
                     O2.FNR     = FNR_REG.FNR2;                         00000970
                  END;                                                  00000980
            END;                                                        00000990
      IF ^F_NUMERISK(F_FELT_PIC_CHAR4(O2.TKNR)) THEN                    00001000
         DO;                                                            00001010
            FEIL_FUNNET = '1'B;                                         00001020
            O2.TKNRNR   = 200;                                          00001030
         END;                                                           00001040
      ELSE                                                              00001050
         DO;                                                            00001060
                  EXEC CICS HANDLE CONDITION NOTFND(NOTFND);            00001070
                  EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)    00001080
                                                     INTO(TK_RECL);     00001090
                  GOTO TKNR_UT;                                         00001100
              NOTFND:                                                   00001110
                  FEIL_FUNNET = '1'B;                                   00001120
                  O2.TKNRNR   = 3;                                      00001130
                  LEAVE;                                                00001140
              TKNR_UT:                                                  00001150
               DIV_PARAM_OMR.DIV_TKNR = SUBSTR(TK_RECL,1,4);            00001160
          END;                                                          00001170
      IF ^F_NUMERISK(F_FELT_PIC_CHAR4(O2.VIRK_DATO_MÅ)) THEN            00001180
         DO;                                                            00001190
            FEIL_FUNNET       = '1'B;                                   00001200
            O2.VIRK_DATO_MÅNR = 200;                                    00001210
         END;                                                           00001220
      ELSE                                                              00001230
         IF ^F_GYLDIG_DATO(O2.VIRK_DATO_MÅ) THEN                        00001240
            DO;                                                         00001250
               FEIL_FUNNET       = '1'B;                                00001260
               O2.VIRK_DATO_MÅNR = 9;                                   00001270
            END;                                                        00001280
      ELSE                                                              00001290
         IF ^F_6MDR(HJ_VIRK_DATO_ÅM) THEN                               00001300
            DO;                                                         00001310
               FEIL_FUNNET       = '1'B;                                00001320
               O2.VIRK_DATO_MÅNR = 205;                                 00001330
            END;                                                        00001340
      IF VERIFY(O2.EK_TILL,'X ') ^= 0 THEN                              00001350
         DO;                                                            00001360
            FEIL_FUNNET  = '1'B;                                        00001370
            O2.EK_TILLNR = 166;                                         00001380
         END;                                                           00001390
      DO I = 1 TO 5 WHILE(F_FELT_PIC_CHAR11(O2.FNR_BARN(I)) ^= (11)'0');00001400
         IF ^F_NUMERISK(F_FELT_PIC_CHAR11(O2.FNR_BARN(I))) THEN         00001410
            DO;                                                         00001420
               FEIL_FUNNET      = '1'B;                                 00001430
               O2.FNR_BARNNR(I) = 200;                                  00001440
            END;                                                        00001450
         ELSE                                                           00001460
            IF ^F_GYLDIG_FNR(O2.FNR_BARN(I)) THEN                       00001470
               DO;                                                      00001480
                  FEIL_FUNNET      = '1'B;                              00001490
                  O2.FNR_BARNNR(I) = 1;                                 00001500
               END;                                                     00001510
            ELSE                                                        00001520
               DO;                                                      00001530
                  FNR_REG.FNR1 = O2.FNR_BARN(I);                        00001540
                  EXEC CICS LINK PROGRAM ('R0019906') COMMAREA (        00001550
                   FNR_REG);                                            00001560
                  IF FNR_REG.FNR2 > 0 THEN                              00001570
                     DO;                                                00001580
                        O2.FNR_BARNNR(I) = 203;                         00001590
                        O2.FNR_GML       = O2.FNR_BARN(I);              00001600
                        O2.FNR_BARN(I)   = FNR_REG.FNR2;                00001610
                     END;                                               00001620
               END;                                                     00001630
      END;                                                              00001640
                                                                        00001650
 /* ENDRET 15.1.85  HL  - OPPHØR BARNEPENSJON ER ENDRET FRA  */         00001660
 /*        'G' TIL 'F'. 'G' SKAL GI MELDING OM DETTE         */         00001670
 /* ENDRET 31.1.85  HL  - KODENE 'C' OG 'D' SKAL GODTAS      */         00001680
 /*                       OG TRANSTYPE SETTES = 68           */         00001690
                                                                        00001700
      IF VERIFY(O2.OPPHØR_KODE,'ABCDEF ') ^= 0 THEN                     00001710
         DO;                                                            00001720
            FEIL_FUNNET      = '1'B;                                    00001730
            IF O2.OPPHØR_KODE  = 'G'       THEN                         00001740
               O2.OPPHØR_KODENR = 279;                                  00001750
            ELSE                                                        00001760
               O2.OPPHØR_KODENR = 167;                                  00001770
                                                                        00001780
         END;                                                           00001790
                                                                        00001800
      IF O2.OPPHØR_KODE = 'C'     !                                     00001810
         O2.OPPHØR_KODE = 'D'              THEN                         00001820
                                                                        00001830
         TRANSTYPE = 68;                                                00001840
      ELSE                                                              00001850
         TRANSTYPE = 0;                                                 00001860
                                                                        00001870
 /* HIT 31.1.85  HL                                            */       00001880
                                                                        00001890
      FØDSNUMMER    =  O2.FNR;                                          00001900
      VIRKNINGSDATO =  O2.VIRK_DATO_MÅ;                                 00001910
 % PAGE;                               /*     */                        00001920
 /* **************************************************************** */ 00001930
 /*                                                                  */ 00001940
 /*    KRYSSKONTROLLER                                               */ 00001950
 /* **************************************************************** */ 00001960
 %SKIP;                                                                 00001970
      IF ^FEIL_FUNNET THEN                                              00001980
         DO;                                                            00001990
            IF (O2.FNR > 0 & O2.TKNR > 0 & O2.                          00002000
                                                 VIRK_DATO_MÅ > 0) THEN 00002010
               DO;                                                      00002020
                  IF (O2.EK_TILL   = ' ' & O2.FNR_BARN(1) = 0 &         00002030
                      O2.OPPHØR_KODE = ' ')  THEN                       00002040
                      DO;                                               00002050
                         FEIL_FUNNET          = '1'B;                   00002060
                         O2.EK_TILLNR         = 181;                    00002070
                         O2.FNR_BARNNR(1)     = 999;                    00002080
                         O2.OPPHØR_KODENR     = 999;                    00002090
                         O2.FNRNR             = 999;                    00002100
                         O2.TKNRNR            = 999;                    00002110
                         O2.VIRK_DATO_MÅNR    = 999;                    00002120
                       END;                                             00002130
                  IF (O2.EK_TILL = 'X' ! O2.FNR_BARN(1) > 0) THEN       00002140
                     DO;                                                00002150
                        IF (                                            00002160
                            O2.OPPHØR_KODE ^= ' ') THEN                 00002170
                           DO;                                          00002180
                              FEIL_FUNNET          = '1'B;              00002190
                              O2.OPPHØR_KODENR     = 180;               00002200
                              O2.EK_TILLNR         = 999;               00002210
                              O2.FNR_BARNNR(1)     = 999;               00002220
                           END;                                         00002230
                     END;                                               00002240
               END;                                                     00002250
         END;                                                           00002260
   END KONTROLL_O2;                                                     00002270
