 /*       SIST ENDRET 17/02-92 13.45.45 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 29/06-90 08.39.58 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 26/01-90 15.04.54 AV   HERMAN                   */00000020
 /*       SIST ENDRET 01/12-89 10.09.56 AV   DYBVIK                   */00000030
 /* *************************************************************** */  00000040
 /*IDENTIFIKASJON:                                                  */  00000050
 /*    R0014326 - PROSEDYRE I PLI                                   */  00000060
 /*HENSIKT:                                                         */  00000070
 /*                                                                 */  00000080
 /*  1. FINNE BESTE YRKEPENS.YPT FOR AVDØD.                         */  00000090
 /*                                                                 */  00000100
 /*  2. OPPDATERE YRKEPENS.YPT OG YRKEPENS YPT_KODE (V), DERSOM     */  00000110
 /*       SPT GIR HØYEST POENG.                                     */  00000120
 /*       SETTE DIV_PARAM_OMR.BEREGNINGS_ALT_AVD = 3, DERSOM DET    */  00000130
 /*       LØNNER SEG Å BRUKE Y-FORDELENE VED BEREGNING AV EP.       */  00000140
 /*                                                                 */  00000150
 /*  3. BEREGNE OG OPPDATERE ETTEPENS : GP_BRUTTO                   */  00000160
 /*                                     TP_BRUTTO                   */  00000170
 /*                                                                 */  00000180
 /*                                                                 */  00000190
 /*PROGRAMTILKNYTNING:                                              */  00000200
 /*    INCLUDES I R0014301                                          */  00000210
 /*BRUK:                                                            */  00000220
 /*    CALL BEREGN_ETTERLATT_YP                                     */  00000230
 /*                                                                 */  00000240
 /* *************************************************************** */  00000250
 /*   */                                                                00000260
 BEREGN_ETTERLATT_YP :                                                  00000270
   PROC;                                                                00000280
                                                                        00000290
  DCL      W_TP_PROSENT      FIXED DEC    (3);                          00000300
                                                                        00000310
  DCL    1 KAP11,                                                       00000320
          2  GP_BRUTTO         FIXED DEC (5),                           00000330
          2  TP_BRUTTO         FIXED DEC (5);                           00000340
                                                                        00000350
  DCL    1 VANLIG,                                                      00000360
          2  GP_BRUTTO         FIXED DEC (5),                           00000370
          2  TP_BRUTTO         FIXED DEC (5);                           00000380
                                                                        00000390
  DCL        TP_WORK           FIXED DEC (13,4);                        00000400
  DCL        FAKTOR1           FIXED DEC (13,4);                        00000410
  DCL        FAKTOR2           FIXED DEC (13,4);                        00000420
                                                                        00000430
    IF (B02.YRKEPENS.YUG(BER_EK_IND) = 100 )      &                     00000440
       (B01.YRKEPENS.YUG(BER_EK_IND) < 100 )      &  /*26.1.90 HL*/     00000450
       (B02.YRKEPENS.YPT(BER_EK_IND) < B02.SPT_AVD(BER_SØ_IND)) THEN    00000460
                                                                        00000470
       DO;                                                              00000480
                                                                        00000490
          B02.YRKEPENS.YPT(BER_EK_IND) = B02.SPT_AVD(BER_SØ_IND);       00000500
                                                                        00000510
          B02.YPT_KODE(BER_EK_IND)     = 'V'; /*VANLIGE REGLER    */    00000520
                                              /*GIR BEST SPT      */    00000530
       END;                                                             00000540
                                                                        00000550
    IF B02.SIVILSTAND(BER_SØ_IND)   = 'E'   !                           00000560
       B02.SIVILSTAND(BER_SØ_IND)   = 'U'   THEN                        00000570
           W_TP_PROSENT             = 55;                               00000580
    ELSE                                                                00000590
           W_TP_PROSENT             = B02.TP_PROSENT(BER_SØ_IND);       00000600
                                                                        00000610
                                                                        00000620
 /* *************************************************************** */  00000630
 /* REGN GP MED KAP11-FORDELER                                      */  00000640
 /* *************************************************************** */  00000650
                                                                        00000660
    KAP11.GP_BRUTTO = G*B02.YRKEPENS.YUG(BER_EK_IND)/(100*12) + 0.5;    00000670
                                                                        00000680
 /* *************************************************************** */  00000690
 /* REGN TP MED KAP11-FORDELER                                      */  00000700
 /* *************************************************************** */  00000710
                                                                        00000720
                                                                        00000730
  TP_WORK  = G * B02.YRKEPENS.YPT(BER_EK_IND);                          00000740
  TP_WORK  = TP_WORK * B02.YRKEPENS.YUG(BER_EK_IND) /100;               00000750
  TP_WORK  = TP_WORK * W_TP_PROSENT/100 ;                               00000760
  TP_WORK  = TP_WORK / 12;                                              00000770
  IF B02.YRKEPENS.PÅ_ETTER91(BER_EK_IND) = 0    THEN                    00000780
     KAP11.TP_BRUTTO = TP_WORK * 0.45 + 0.5;                            00000790
                                                                        00000800
  ELSE                                                                  00000810
     DO;                                                                00000820
        FAKTOR1 = (B02.YRKEPENS.PÅ(BER_EK_IND)                          00000830
                   - B02.YRKEPENS.PÅ_ETTER91(BER_EK_IND) )              00000840
                   / B02.YRKEPENS.PÅ(BER_EK_IND) * 0.45;                00000850
        FAKTOR2 = B02.YRKEPENS.PÅ_ETTER91(BER_EK_IND)                   00000860
                  / B02.YRKEPENS.PÅ(BER_EK_IND) * 0.42;                 00000870
        KAP11.TP_BRUTTO = TP_WORK * (FAKTOR1 + FAKTOR2 + 0.00005) + 0.5;00000880
     END;                                                               00000890
                                                                        00000900
 /* TP_WORK  = G * 45 /100;                                             00000910
    TP_WORK  = TP_WORK * B02.YRKEPENS.YPT(BER_EK_IND);                  00000920
    TP_WORK  = TP_WORK * B02.YRKEPENS.YUG(BER_EK_IND) /100;             00000930
    TP_WORK  = TP_WORK / 12;                                            00000940
    TP_WORK  = TP_WORK * W_TP_PROSENT/100 ;                             00000950
    KAP11.TP_BRUTTO = TP_WORK + 0.5;                  */                00000960
                                                                        00000970
                                                                        00000980
 /*FJERNET 29.6.90 HL :                                                 00000990
                                                                        00001000
                                                                        00001010
  IF B02.YRKEPENS.YUG(BER_EK_IND) = 100         THEN                    00001020
     DO;                                                                00001030
        DIV_PARAM_OMR.BEREGNINGS_ALT_AVD = '3';                         00001040
        B02.GP_BRUTTO(BER_SØ_IND)   = KAP11.GP_BRUTTO;                  00001050
        B02.TP_BRUTTO(BER_SØ_IND)   = KAP11.TP_BRUTTO;                  00001060
     END;                                                               00001070
                                                                        00001080
  ELSE                                                                  00001090
                                                                        00001100
 HIT 29.6.90 HL */                                                      00001110
                                                                        00001120
     DO;                                                                00001130
                                                                        00001140
 /* *************************************************************** */  00001150
 /* REGN PENSJON   ETTER VANLIGE REGLER, MEN YUG-PROSENT            */  00001160
 /* *************************************************************** */  00001170
                                                                        00001180
        VANLIG.GP_BRUTTO = B02.GP_BRUTTO(BER_SØ_IND)   *                00001190
                         B02.YRKEPENS.YUG(BER_EK_IND) /100 + 0.5;       00001200
                                                                        00001210
        VANLIG.TP_BRUTTO = B02.TP_BRUTTO(BER_SØ_IND)   *                00001220
                         B02.YRKEPENS.YUG(BER_EK_IND) /100 + 0.5;       00001230
                                                                        00001240
        IF (KAP11.GP_BRUTTO + KAP11.TP_BRUTTO) >                        00001250
           (VANLIG.GP_BRUTTO + VANLIG.TP_BRUTTO)      THEN              00001260
                                                                        00001270
           DO;                                                          00001280
                                                                        00001290
 /* *************************************************************** */  00001300
 /* BYTT UT VANLIG BEREGNING MED KAP11-BEREGNING                    */  00001310
 /* *************************************************************** */  00001320
                                                                        00001330
              DIV_PARAM_OMR.BEREGNINGS_ALT_AVD = '3';                   00001340
                                                                        00001350
              B02.GP_BRUTTO(BER_SØ_IND) = B02.GP_BRUTTO(BER_SØ_IND) +   00001360
                                  KAP11.GP_BRUTTO - VANLIG.GP_BRUTTO;   00001370
                                                                        00001380
              B02.TP_BRUTTO(BER_SØ_IND) = B02.TP_BRUTTO(BER_SØ_IND) +   00001390
                                  KAP11.TP_BRUTTO - VANLIG.TP_BRUTTO;   00001400
                                                                        00001410
           END;                                                         00001420
     END;                                                               00001430
                                                                        00001440
                                                                        00001450
                                                                        00001460
                                                                        00001470
     RETUR:                                                             00001480
                                                                        00001490
   END BEREGN_ETTERLATT_YP;                                             00001500
                                                                        00001510
