 /*       SIST ENDRET 05/11-98 13.27.21 AV   JDA7339                  */00000000
 /*       SIST ENDRET 05/11-98 13.26.11 AV   JDA7339                  */00000010
 /*       SIST ENDRET 09/10-98 11.51.43 AV   JDA7339                  */00000020
 /*       SIST ENDRET 09/10-98 11.47.10 AV   JDA7339                  */00000030
 /*       SIST ENDRET 14/09-98 11.58.35 AV   JDA7339                  */00000040
 /*       SIST ENDRET 14/09-98 11.55.54 AV   JDA7339                  */00000050
 /*       SIST ENDRET 15/05-98 08.41.23 AV   JDA7339                  */00000060
 /*       SIST ENDRET 15/05-98 08.39.21 AV   JDA7339                  */00000070
 /*       SIST ENDRET 13/03-98 13.37.08 AV   JDA7339                  */00000080
 /*       SIST ENDRET 13/03-98 13.21.35 AV   JDA7339                  */00000090
 /*       SIST ENDRET 05/12-97 12.43.14 AV   JDA7339                  */00000100
 /*       SIST ENDRET 27/11-97 11.49.26 AV   JDA7339                  */00000110
 /*       SIST ENDRET 24/10-97 11.59.20 AV   JDA7339                  */00000120
 /*       SIST ENDRET 03/09-97 11.31.43 AV   HLA7339                  */00000130
 /*       SIST ENDRET 14/08-97 07.30.53 AV   HLA7339                  */00000140
 /*       SIST ENDRET 13/08-97 12.43.32 AV   HLA7339                  */00000150
 /*       SIST ENDRET 04/08-97 13.37.14 AV   SPA7339                  */00000160
 /*       SIST ENDRET 16/07-97 14.23.12 AV   HLA7339                  */00000170
 /*       SIST ENDRET 11/02-97 10.56.08 AV   JDA7339                  */00000180
 /*       SIST ENDRET 08/09-95 09.55.27 AV   TSB0310                  */00000190
 /*       SIST ENDRET 01/08-95 13.30.32 AV   TSB0310                  */00000200
 /*       SIST ENDRET 23/06-95 12.00.31 AV   JDA0310                  */00000210
 /*       SIST ENDRET 23/12-94 08.19.47 AV   HLB0310                  */00000220
 /*       SIST ENDRET 31/10-94 09.49.16 AV   JDA0310                  */00000230
 /*       SIST ENDRET 29/09-94 09.54.34 AV   JDA0310                  */00000240
 /*       SIST ENDRET 25/07-94 13.53.54 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 15/03-94 13.51.42 AV   DYBVIK                   */00000260
 /* ***************************************************************** */00000270
 /* IDENTIFIKASJON:                                                   */00000280
 /*     R001UE20 - PROSEDYRE I PLI           HOVEDRUTINE              */00000290
 /*     PROGRAMMERER: HERMAN FEB 94                                   */00000300
 /* HENSIKT:                                                          */00000310
 /*     RUTINEN KONTROLLERER TRANSAKSJONEN MOT OPPLYSNINGER I         */00000320
 /*     REGISTERET.NÅR DET OPPDAGES UOVERENSTEMMELSER BLIR FEIL       */00000330
 /*     MERKET AV I FEIL-MELD-ARRAY.                                  */00000340
 /*     STATUS OPPDATERES (B02).                                      */00000350
 /*     TRANSTYPE SETTES I TRANSAKSJONEN.                             */00000360
 /*     RUTINEN KALLER OPP RUTINER FOR:                               */00000370
 /*     GIFTEMÅL........................UE30                          */00000380
 /*     SKILSMISSE......................1440                          */00000390
 /*     FLYTTE SAMMEN...................1450                          */00000400
 /*     FLYTTE FRA HVERANDRE............1460                          */00000410
 /*     DISSE RUTINENE BRUKER DET SAMME ARBEIDSOMRÅDE SOM HOVED-      */00000420
 /*     RUTINEN.                                                      */00000430
 /*  ***************************************************************  */00000440
 /* ***************************************************************   */00000450
 /* PROGRAMTILKNYTNING:                                               */00000460
 /*     KALLES OPP AV PROGRAM R0013520                                */00000470
 /* BRUK:                                                             */00000480
 /*     EXEC CICS XCTL PROGRAM ('R001UE20') COMMAREA (KOM_OMR)        */00000490
 /* ***************************************************************** */00000500
                                                                        00000510
                                                                        00000520
 R01UE20:                                                               00000530
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000540
                                                                        00000550
                                                                        00000560
      %INCLUDE P001UE01;  /* TRANS_OMR TIL EN BLANKETTEN              */00000570
      %INCLUDE P0019906;  /* TRANS_OPPL_OMR  BASED(TRANS_OPPL_PEKER)  */00000580
      %INCLUDE P0019908;  /* KOM_OMR  BASED(COMMAREA_PEKER)           */00000590
      %INCLUDE P0019910;  /* STYRINGS_OMR  BASED(STYRINGS_PEKER)      */00000600
      %INCLUDE P0019912;  /* DIV_PARAM_OMR  BASED(DIV_PARAM_PEKER)    */00000610
                                                                        00000620
   DCL 1 B01   BASED    (B01_PEKER),                                    00000630
      %INCLUDE P0019921;                                                00000640
                                                                        00000650
   DCL 1 B02   BASED    (B02_PEKER),                                    00000660
      %INCLUDE P0019921;                                                00000670
                                                                        00000680
   DCL                                                                  00000690
      COMMAREA_PEKER      PTR                ,                          00000700
      HJ_VIRKDATO_ÅM      PIC          '9999',                          00000710
      FELT_UTFYLT         PIC             '9',                          00000720
     (I , J, K ,BARN_IND)     FIXED      BIN (15),                      00000730
     (ADDR , CSTG)        BUILTIN            ;                          00000740
                                                                        00000750
      DCL W_FNR      PIC '(11)9';                                       00000760
      DCL ALDER      FIXED DEC (5) INIT (0);                            00000770
                                                                        00000780
      DCL  1 FNR_R  DEF W_FNR,                                          00000790
             2 DAG   PIC   '99',                                        00000800
             2 MND   PIC   '99',                                        00000810
             2 ÅR    PIC   '99',                                        00000820
             2 PERSNR,                                                  00000830
               3 ÅRHUNDRE PIC '999',                                    00000840
               3 REST     PIC '99';                                     00000850
      DCL SISTE_UTFYLTE              FIXED BIN (15);                    00000860
      DCL W_HJELP                    FIXED DEC (7) INIT (0);            00000870
      DCL UFG_OPPDATER       FIXED DEC (3) INIT (0);  /*0797 HL*/       00000880
                                                                        00000890
 /* ***************************************************************** */00000900
 /* PROGRAMMET STARTER HER                                            */00000910
 /* ***************************************************************** */00000920
                                                                        00000930
      W_FNR  = ENS.FNR;                                                 00000940
      PROGRAM_ID                      = 'R001UE20';                     00000950
      HJ_VIRKDATO_ÅM  = F_SNU_DATO(ENS.VIRK_DATO_MÅ);    /* 9913 */     00000960
                                                                        00000970
 /* ***************************************************************** */00000980
 /* DERSOM PERSONEN ER ET FORSØRGET BARN AVVISES ENDRINGSMELDINGEN    */00000990
 /* ***************************************************************** */00001000
                                                                        00001010
      IF B01.PENSJONSTYPE1(SØKER_IND) = 'L'  THEN                       00001020
         DO;                                                            00001030
 L099:                                                                  00001040
            FEIL_VED_LABEL = '099';                                     00001050
            FEIL_MELD_NR   = 1014;                                      00001060
            GO TO L999;                                                 00001070
         END;                                                           00001080
                                                                        00001090
                                                                        00001100
 /* ***************************************************************** */00001110
 /* DERSOM PERSONEN IKKE FINNES I BASEN                               */00001120
 /* ***************************************************************** */00001130
                                                                        00001140
      IF B01.FNR(SØKER_IND) = 0 THEN                                    00001150
         DO;                                                            00001160
 L100:                                                                  00001170
            FEIL_VED_LABEL = '100';                                     00001180
            FEIL_MELD_NR   = 1713;                                      00001190
            GO TO L999;                                                 00001200
         END;                                                           00001210
                                                                        00001220
 /* ***************************************************************** */00001230
 /* PERSONEN ER I BASEN                                               */00001240
 /* ***************************************************************** */00001250
                                                                        00001260
      IF STATUS_TYPE = 'A' !                                            00001270
         STATUS_TYPE = 'I' !        /* TEST PÅ 'I' OG 'K' ER LAGT    */ 00001280
         STATUS_TYPE = 'K' THEN     /* INN 28.2.85  HL               */ 00001290
         DO;                                                            00001300
 L105:                                                                  00001310
                                                                        00001320
 /* STATUS_TYPE 'A', 'I' OG 'K' FORTELLER AT PERSONEN IKKE HAR       */ 00001330
 /* EN AKTUELL PENSJONSSTATUS PÅ DETTE TIDSPUNKT                     */ 00001340
                                                                        00001350
            FEIL_VED_LABEL = '105';                                     00001360
            FEIL_MELD_NR   = 1503;                                      00001370
            GO TO L999;                                                 00001380
         END;                                                           00001390
                                                                        00001400
 /*-------------------------------------------------------------------*/00001410
 /* DERSOM SØKER ER REGISTRERT MED ET ANNET TKNR I STATUS ENN I TRANS */00001420
 /*-------------------------------------------------------------------*/00001430
                                                                        00001440
      IF B01.TKNR(SØKER_IND) ^= ENS.TKNR THEN                           00001450
         DO;                                                            00001460
 L110:                                                                  00001470
            FEIL_VED_LABEL = '110';                                     00001480
            FEIL_MELD_NR   = 1702;                                      00001490
            GO TO L999;                                                 00001500
         END;                                                           00001510
                                                                        00001520
 /*-------------------------------------------------------------------*/00001530
 /* ENDRINGEN ER PÅ ET ØVRIGE BARN OG VI MÅ FLYTTE ALLE               */00001540
 /*-------------------------------------------------------------------*/00001550
                                                                        00001560
      IF SØKER_IND > 3 THEN                                             00001570
         CALL FLYTT_B01_TIL_B02(3);                         /* 9926 */  00001580
      ELSE                                                              00001590
         CALL FLYTT_B01_TIL_B02(SØKER_IND);                 /* 9926 */  00001600
                                                                        00001610
      DO I = 1 TO 14;                                                   00001620
         IF B02.FNR(I) > 0         THEN                                 00001630
            B02.FØRSTE_GANG_REG(I) = 'N';                               00001640
      END;                                                              00001650
                                                                        00001660
      IF SØKER_IND < 3 THEN                                             00001670
         DO;                                                            00001680
            IF B01.DØDSDATO_ÅMD(EKTEF_IND) = 0 THEN                     00001690
               CALL FLYTT_B01_TIL_B02(EKTEF_IND);           /* 9926 */  00001700
            ELSE                                                        00001710
               B02.PERSON(EKTEF_IND) = B01.PERSON(EKTEF_IND);           00001720
                                                                        00001730
            B02.FØRSTE_GANG_REG(SØKER_IND) = 'N';                       00001740
            B02.FØRSTE_GANG_REG(EKTEF_IND) = 'N';                       00001750
         END;                                                           00001760
      ELSE                                                              00001770
         DO;                                                            00001780
            /*-------------------------------------*/                   00001790
            /* ENDRINGEN GJELDER ET ETTERLATT BARN */                   00001800
            /* AVDØDE MOR OG/ELLER FAR FLYTTES     */                   00001810
            /*-------------------------------------*/                   00001820
                                                                        00001830
            B02.FØRSTE_GANG_REG(3) = 'N'            ;                   00001840
            B02.PERSON         (1) = B01.PERSON (1) ;                   00001850
            B02.PERSON         (2) = B01.PERSON (2) ;                   00001860
         END;                                                           00001870
                                                                        00001880
      IF FEIL_MELD_NR > 0 THEN                                          00001890
         GO TO L999;                                                    00001900
      ELSE                                                              00001910
         PROGRAM_ID = 'R001UE20';                                       00001920
                                                                        00001930
      FELT_UTFYLT                    = 0;                               00001940
                                                                        00001950
 /* ***************************************************************** */00001960
 /* DERSOM DET ER ENDRING I SPRÅK                                     */00001970
 /* ***************************************************************** */00001980
                                                                        00001990
      IF ENS.SPRÅK                 ^= ' '   THEN                        00002000
         DO;                                                            00002010
            TRANSTYPE               = 61       ;                        00002020
            FELT_UTFYLT             =  1       ;                        00002030
            B02.SPRÅK(SØKER_IND)    = ENS.SPRÅK;                        00002040
         END;                                                           00002050
                                                                        00002060
 /* ***************************************************************** */00002070
 /* DERSOM NYTT NAVN ER UTFYLT                                        */00002080
 /* ***************************************************************** */00002090
                                                                        00002100
      IF ENS.NAVN_NYTT         ^= (25)' '   THEN                        00002110
         DO;                                                            00002120
            TRANSTYPE           = 63;                                   00002130
            FELT_UTFYLT         =  1           ;                        00002140
            B02.NAVN(SØKER_IND) = ENS.NAVN_NYTT;                        00002150
         END;                                                           00002160
                                                                        00002170
 /* ***************************************************************** */00002180
 /* DERSOM FRAMLEGGSDATO ER UTFYLT                                    */00002190
 /* ***************************************************************** */00002200
                                                                        00002210
      IF ENK10.FRAML_DATO_MÅ > 0 THEN                                   00002220
         DO;                                                            00002230
            TRANSTYPE = 62;                                             00002240
            FELT_UTFYLT             = 1;                                00002250
                                                                        00002260
            IF B01.PENSJONSTYPE2(SØKER_IND) ^= 'O'    THEN              00002270
               DO;                                                      00002280
 L120:                                                                  00002290
                  FEIL_VED_LABEL = '120';                               00002300
                  FEIL_MELD_NR   = 1521 ;                               00002310
                  GO TO L999;                                           00002320
               END;                                                     00002330
                                                                        00002340
 /* ***************************************************************** */00002350
 /* FEILMELD 1521: FRAMLEGG AVVIST. HAR IKKE OVERGANGSSTØNAD          */00002360
 /* ***************************************************************** */00002370
                                                                        00002380
            IF ENK10.OPPHØR_EO = 'J' THEN                               00002390
               DO;                                                      00002400
                  B02.FRAMLEGGSDATO_ÅM(SØKER_IND) =                     00002410
                       F_SNU_DATO(ENK10.FRAML_DATO_MÅ);      /* 9913 */ 00002420
                  B02.FRAMLEGGSKODE(SØKER_IND) = 'O';                   00002430
               END;                                                     00002440
            ELSE                                                        00002450
               DO;                                                      00002460
                  B02.FRAMLEGGSDATO_ÅM(SØKER_IND) =                     00002470
                        F_SNU_DATO(ENK10.FRAML_DATO_MÅ);     /* 9913 */ 00002480
                  B02.FRAMLEGGSKODE(SØKER_IND) = 'A';                   00002490
               END;                                                     00002500
                                                                        00002510
         END;                                                           00002520
                                                                        00002530
 /* ***************************************************************** */00002540
 /* DERSOM NYTT NAVN EKTEFELLE ER UTFYLT                              */00002550
 /* ***************************************************************** */00002560
                                                                        00002570
      IF ENS.NAVN_NYTT_EK ^= (25)' ' THEN                               00002580
         DO;                                                            00002590
            FELT_UTFYLT    =   1;                                       00002600
                                                                        00002610
 /* ***************************************************************** */00002620
 /* DERSOM EKTEFELLEN IKKE ER I BASEN                                 */00002630
 /* ***************************************************************** */00002640
                                                                        00002650
            IF B01.FNR(EKTEF_IND) = 0 THEN                              00002660
               DO;                                                      00002670
 L150:                                                                  00002680
                  FEIL_VED_LABEL  = '150';                              00002690
                  FEIL_MELD_NR    =  1005;                              00002700
                  GO TO L999;                                           00002710
               END;                                                     00002720
            ELSE                                                        00002730
               DO;                                                      00002740
                  TRANSTYPE           = 64              ;               00002750
                  B02.NAVN(EKTEF_IND) = ENS.NAVN_NYTT_EK;               00002760
               END;                                                     00002770
          END;                                                          00002780
                                                                        00002790
 /* ***************************************************************** */00002800
 /* DERSOM FORVENTET ERVERVSINNTEKT ER STØRRE ENN 0                   */00002810
 /* ***************************************************************** */00002820
                                                                        00002830
       IF ENK7.FAI = 9999999 THEN                                       00002840
          DO;                                                           00002850
             IF B02.ALDERSP.FAI(SØKER_IND) > 0   THEN                   00002860
                CALL RULL_FAI(B02.G_DATO_ÅM(SØKER_IND),                 00002870
                              B02.VIRK_DATO_ÅM(SØKER_IND),              00002880
                              B02.ALDERSP.FAI(SØKER_IND));              00002890
          END;                                                          00002900
       ELSE                                                             00002910
 /*    IF ENK7.FAI ^= 9999999 THEN        */                            00002920
          DO;                                                           00002930
             FELT_UTFYLT             = 1;                               00002940
             TRANSTYPE = 8;                                             00002950
                                                                        00002960
 /* ***************************************************************** */00002970
 /* DERSOM PERSONEN IKKE ER REGISTRERT MED ALDERSPENSJON              */00002980
 /* ELLER AVTALEFESTET PENSJON                                        */00002990
 /* ***************************************************************** */00003000
                                                                        00003010
             IF B01.PENSJONSTYPE1(SØKER_IND) ^= 'A' &                   00003020
                B01.PENSJONSTYPE1(SØKER_IND) ^= 'K' THEN                00003030
                DO;                                                     00003040
 L160:                                                                  00003050
                   FEIL_VED_LABEL  = '160';                             00003060
                   FEIL_MELD_NR    = 1509;                              00003070
                   GO TO L999;                                          00003080
                END;                                                    00003090
             ELSE                                                       00003100
                DO;                                                     00003110
                  IF  FNR_R.ÅR < 25     !                               00003120
                     (B01.PENSJONSTYPE1(SØKER_IND) = 'K' &              00003130
                      B01.UTTAKSDATO_ÅM(SØKER_IND) < 9200) THEN         00003140
                    DO;                                                 00003150
                     B02.FAI(SØKER_IND) = ENK7.FAI / 100;               00003160
                    END;                                                00003170
                  ELSE                                                  00003180
                  IF  ( FNR_R.ÅR > 24                 &                 00003190
                        B01.PENSJONSTYPE1(SØKER_IND) ^= 'K') !          00003200
                      ( B01.UTTAKSDATO_ÅM(SØKER_IND)  > 9200 &          00003210
                        B01.PENSJONSTYPE1(SØKER_IND)  = 'K') THEN       00003220
                   DO;                                                  00003230
                                                                        00003240
                     B02.FAI(SØKER_IND) = ENK7.FAI / 1000;/*HELE 1000*/ 00003250
                     B02.FAI(SØKER_IND) = B02.FAI(SØKER_IND) * 10;      00003260
                   END;                                                 00003270
                   B02.FAI_DATO_ÅM(SØKER_IND) = HJ_VIRKDATO_ÅM;         00003280
    /*TS 010895    B02.ARBEIDSINNTEKT(SØKER_IND) = B02.FAI(SØKER_IND);*/00003290
          /*TS 010895 ARBEIDSINNTEKT SKLA VÆRE I HELE 100 KR IKKE 1000*/00003300
                   B02.ARBEIDSINNTEKT(SØKER_IND) = ENK7.FAI / 100;      00003310
                END;                                                    00003320
          END;                                                          00003330
                                                                        00003340
                                                                        00003350
 /*YS ENDRET 25.5.89 HL - VI SKAL REGNE MED AT SAMLET GRAD */           00003360
 /*YS                     GÅR NED DERSOM KAP11-GRAD ER FYLT*/           00003370
 /*YS                     UT, MEN IKKE KAP8-GRAD           */           00003380
                                                                        00003390
        IF ENK11.YUG ^= 999                  THEN /*0797 HL*/           00003400
 /*           IF ENK8.UFG  = 0            THEN  */                      00003410
              IF ENK8.UFG  = 999          THEN                          00003420
                 ENK8.UFG  = ENK11.YUG;                                 00003430
                                                                        00003440
 /*YS HIT 25.5.89 HL */                                                 00003450
                                                                        00003460
 /* ***************************************************************** */00003470
 /* DERSOM UFØREGRADEN ER UTFYLT / ELLER ENDRING I FRYSKODER          */00003480
 /* ***************************************************************** */00003490
                                                                        00003500
    IF B01.PENSJONSTYPE3(SØKER_IND) = 'A'  THEN                         00003510
       IF ENK8.FRYSP_3ÅR_ARB ^= ' '   !                                 00003520
          ENK8.FRYSP_TIDSB   ^= ' '           THEN                      00003530
          DO;                                                           00003540
 L161:      /*IKKE FRYS FOR FORELØPIG/REHAB ***********9804** */        00003550
             FEIL_VED_LABEL  = '161';                                   00003560
             FEIL_MELD_NR    = 1546;                                    00003570
             GO TO L999;                                                00003580
          END;                                                          00003590
    IF ENK8.UFG      ^= 999  !                   /*0797 HL*/            00003600
       ENK8.FRYSP_3ÅR_ARB ^= ' '   !             /*0797 HL*/            00003610
       ENK8.FRYSP_TIDSB   ^= ' '           THEN  /*0797 HL*/            00003620
       DO;                                                              00003630
          IF ENK8.UFG = 999 THEN                                        00003640
             UFG_OPPDATER = 0;                                          00003650
          ELSE                                                          00003660
             UFG_OPPDATER = ENK8.UFG;            /*0797 HL*/            00003670
          TRANSTYPE   = 9;                                              00003680
          FELT_UTFYLT = 1;                                              00003690
                                                                        00003700
 /* ***************************************************************** */00003710
 /* DERSOM PERSONEN IKKE ER REGISTRERT MED UFØREPENSJON               */00003720
 /* ***************************************************************** */00003730
                                                                        00003740
          IF B01.PENSJONSTYPE1(SØKER_IND) ^= 'U' &                      00003750
             B01.PENSJONSTYPE1(SØKER_IND) ^= 'Y' THEN                   00003760
             DO;                                                        00003770
 L170:                                                                  00003780
                FEIL_VED_LABEL = '170';                                 00003790
                FEIL_MELD_NR   = 1512;                                  00003800
                GO TO L999;                                             00003810
             END;                                                       00003820
                                                                        00003830
          IF ENK8.UFG ^= 999        &                                   00003840
             ENK8.UFG         >  B01.UFØRPENS.UFG(SØKER_IND)  THEN      00003850
             DO;                                                        00003860
 L180:                                                                  00003870
                FEIL_VED_LABEL = '180';                                 00003880
                FEIL_MELD_NR   = 1513;                                  00003890
                GO TO L999;                                             00003900
             END;                                                       00003910
 /* ***************************************************************** */00003920
 /* TESTING I FORBINDELSE MED FRYSPERIODER-UFØREPENSJON-0797 HL       */00003930
 /*             FRYSKODE=1:3åR, FRYSKODE=2:UBEGRENSET                 */00003940
 /* ***************************************************************** */00003950
 /* 1. START FRYSPERIODE 3 ÅR:                                        */00003960
 /* ***************************************************************** */00003970
                                                                        00003980
          IF ENK8.FRYSP_3ÅR_ARB = 'S'           THEN                    00003990
             IF B01.FRYSKODE(SØKER_IND) = '1'      THEN                 00004000
                DO;                                                     00004010
 /*ALLEREDE REGISTRERT MED FRYSPERIODE 3 ÅR   *********************** */00004020
 L181:                                                                  00004030
                   FEIL_VED_LABEL = '181';                              00004040
                   FEIL_MELD_NR   =  432;                               00004050
                   GO TO L999;                                          00004060
                END;                                                    00004070
             ELSE                                                       00004080
             IF B01.FRYSKODE(SØKER_IND) = '2'      THEN                 00004090
                IF ENK8.FRYSP_TIDSB ^= 'X'                 THEN         00004100
                   DO;                                                  00004110
 /*VED OVERGANG TIL ANNEN TYPE FRYS SKAL DET SETTES 'X' FOR OPPHØR    */00004120
 L182:                                                                  00004130
                      FEIL_VED_LABEL = '182';                           00004140
                      FEIL_MELD_NR   =  434;                            00004150
                      GO TO L999;                                       00004160
                   END;                                                 00004170
                ELSE                                                    00004180
                DO;                                                     00004190
 /*OVERGANG FRA TYPE 2 TIL TYPE 1*/                                     00004200
                   B02.FRYSKODE(SØKER_IND) = '1';                       00004210
                   B02.FRYSDATO_ÅM(SØKER_IND) =                         00004220
                      F_SNU_DATO(ENS.VIRK_DATO_MÅ);                     00004230
                END;                                                    00004240
             ELSE   /*IKKE REGISTRERT MED FRYSKODE FRA FØR*/            00004250
                DO;                                                     00004260
                   IF ENK8.UFG ^< B01.UFØRPENS.UFG(SØKER_IND) THEN      00004270
                      DO;                                               00004280
 /*VED START AV FRYSPERIODE SKAL UFG SETTES NED                       */00004290
 L183:                                                                  00004300
                         FEIL_VED_LABEL = '183';                        00004310
                         FEIL_MELD_NR   =  433;                         00004320
                         GO TO L999;                                    00004330
                      END;                                              00004340
                   ELSE                                                 00004350
                      DO;                                               00004360
                         B02.FRYSKODE(SØKER_IND) = '1';                 00004370
                         B02.GARANTIGRAD(SØKER_IND) =                   00004380
                            B01.UFØRPENS.UFG(SØKER_IND);                00004390
                         B02.FRYSDATO_ÅM(SØKER_IND) =                   00004400
                            F_SNU_DATO(ENS.VIRK_DATO_MÅ);               00004410
                      END;                                              00004420
                END;                                                    00004430
          ELSE                                                          00004440
 /* ***************************************************************** */00004450
 /* 2. START FRYSPERIODE UTEN TIDSBEGRENSNING                         */00004460
 /* ***************************************************************** */00004470
          IF ENK8.FRYSP_TIDSB   = 'S'           THEN                    00004480
             IF B01.FRYSKODE(SØKER_IND) = '2'      THEN                 00004490
                DO;                                                     00004500
 /*ALLEREDE REGISTRERT MED UBEGRENSET FRYSPERIODE                     */00004510
 L184:                                                                  00004520
                   FEIL_VED_LABEL = '184';                              00004530
                   FEIL_MELD_NR   =  434;                               00004540
                   GO TO L999;                                          00004550
                END;                                                    00004560
             ELSE                                                       00004570
             IF B01.FRYSKODE(SØKER_IND) = '1'      THEN                 00004580
                IF ENK8.FRYSP_3ÅR_ARB ^= 'X'               THEN         00004590
                   DO;                                                  00004600
 /*VED OVERGANG TIL ANNEN TYPE FRYS SKAL DET SETTES 'X' FOR OPPHØR    */00004610
 L185:                                                                  00004620
                      FEIL_VED_LABEL = '185';                           00004630
                      FEIL_MELD_NR   =  432;                            00004640
                      GO TO L999;                                       00004650
                   END;                                                 00004660
                ELSE                                                    00004670
 /*OVERGANG FRA TYPE 1 TIL TYPE 2*/                                     00004680
                DO;                                                     00004690
                   B02.FRYSKODE(SØKER_IND) = '2';                       00004700
                   B02.FRYSDATO_ÅM(SØKER_IND) =                         00004710
                      F_SNU_DATO(ENS.VIRK_DATO_MÅ);                     00004720
                END;                                                    00004730
             ELSE                                                       00004740
                DO;                                                     00004750
                   IF ENK8.UFG ^< B01.UFØRPENS.UFG(SØKER_IND) THEN      00004760
                      DO;                                               00004770
 /*VED START AV FRYSPERIODE SKAL UFG SETTES NED                       */00004780
 L186:                                                                  00004790
                         FEIL_VED_LABEL = '186';                        00004800
                         FEIL_MELD_NR   =  433;                         00004810
                         GO TO L999;                                    00004820
                      END;                                              00004830
                   ELSE                                                 00004840
                      DO;                                               00004850
                         B02.FRYSKODE(SØKER_IND) = '2';                 00004860
                         B02.GARANTIGRAD(SØKER_IND) =                   00004870
                            B01.UFØRPENS.UFG(SØKER_IND);                00004880
                         B02.FRYSDATO_ÅM(SØKER_IND) =                   00004890
                            F_SNU_DATO(ENS.VIRK_DATO_MÅ);               00004900
                      END;                                              00004910
                END;                                                    00004920
          ELSE                                                          00004930
 /* ***************************************************************** */00004940
 /* 3. SLUTT FRYSPERIODE 3 ÅR KAN BARE FOREKOMME VED 'S' I FRYSP_TIDSB*/00004950
 /*    ANDRE OPPHØR BLIR AVVIST I UE05                                */00004960
 /* ***************************************************************** */00004970
 /* ***************************************************************** */00004980
 /* 4. SLUTT FRYSPERIODE UTEN TIDSBEGRENSNING                         */00004990
 /*          HVIS UFØREGRAD IKKE ER SATT, SÅ SKAL GARANTIGRADEN INN - */00005000
 /*          VI SETTER DA TRANSTYPE = 2 - FOR Å FÅ TEST PÅ OM DET SKAL*/00005010
 /*          VÆRE NYTT UFØRETIDSPUNKT                                 */00005020
 /* ***************************************************************** */00005030
          IF ENK8.FRYSP_TIDSB   = 'X'           THEN                    00005040
             IF B01.FRYSKODE(SØKER_IND) ^= '2'      THEN                00005050
                DO;                                                     00005060
 /*OPPHØR AVVVISES - HAR IKKE SLIK FRYS FRA FØR                       */00005070
 L188:                                                                  00005080
                   FEIL_VED_LABEL = '188';                              00005090
                   FEIL_MELD_NR   =  435;                               00005100
                   GO TO L999;                                          00005110
                END;                                                    00005120
             ELSE                                                       00005130
                DO;                                                     00005140
                   B02.FRYSKODE(SØKER_IND) = ' ' ;                      00005150
                   B02.FRYSDATO_ÅM(SØKER_IND) = 0;                      00005160
                   IF ENK8.UFG = 999                  THEN              00005170
                      DO;                                               00005180
                         UFG_OPPDATER = B01.GARANTIGRAD(SØKER_IND);     00005190
                         TRANSTYPE = 2;                                 00005200
                      END;                                              00005210
                   B02.GARANTIGRAD(SØKER_IND) = 0;                      00005220
                END;                                                    00005230
                                                                        00005240
   /*----------------------------------------------------------*/       00005250
   /*GARANTI_TP UFG REDUSERES. VI MÅ FORETA EN MANUELL BEH. AV */       00005260
   /*GARANTI_TP. TRUDE 0992                                    */       00005270
   /*----------------------------------------------------------*/       00005280
                                                                        00005290
          SISTE_UTFYLTE       = 0;                                      00005300
                                                                        00005310
          DO I = 1 TO 7;       /*0697 HL*/                              00005320
           IF B01.UFØRHIST.UFT_ÅM (SØKER_IND,I) = 0 THEN                00005330
            DO;                                                         00005340
              SISTE_UTFYLTE    = I - 1;                                 00005350
                                                                        00005360
              IF I             = 1               THEN                   00005370
                 SISTE_UTFYLTE = 1;                                     00005380
              I                = 7;       /*0697 HL*/                   00005390
            END;                                                        00005400
          END;                                                          00005410
                                                                        00005420
   L191:                                                                00005430
        IF B01.GARANTI_TP(SØKER_IND)  > 0  THEN                         00005440
          DO;                                                           00005450
            IF B01.UFØRHIST.UFG (SØKER_IND,SISTE_UTFYLTE) >             00005460
 /*0797 HL*/                     UFG_OPPDATER                   THEN    00005470
               DO;                                                      00005480
                 FEIL_VED_LABEL = '191';                                00005490
                 FEIL_MELD_NR   = 383;                                  00005500
                 GO TO L999;                                            00005510
               END;                                                     00005520
         END;                                                           00005530
  /* TIL HIT TRUDE 0992 */                                              00005540
                                                                        00005550
 /*ENDRING 9705 HL:*/                                                   00005560
     IF (HJ_VIRKDATO_ÅM > 9704)          THEN                           00005570
        DO;                                                             00005580
           IF (ENK8.UFG     < 50)   &    /*0797 HL*/                    00005590
              (B01.PENSJONSTYPE3(SØKER_IND) = 'A' )      THEN           00005600
              DO;                                                       00005610
   L192:                                                                00005620
                 FEIL_VED_LABEL = '192';                                00005630
                 FEIL_MELD_NR   = 427;                                  00005640
                 GO TO L999;                                            00005650
              END;                                                      00005660
           ELSE                                                         00005670
           IF (ENK8.UFG     < 20)  &    /*0797 HL*/                     00005680
              (ENK8.UFG     ^= 0)  &                                    00005690
              (B01.PENSJONSTYPE1(SØKER_IND) ^= 'Y' )     THEN           00005700
              DO;                                                       00005710
   L193:                                                                00005720
                 FEIL_VED_LABEL = '193';                                00005730
                 FEIL_MELD_NR   = 38;                                   00005740
                 GO TO L999;                                            00005750
              END;                                                      00005760
        END;                                                            00005770
     ELSE    /*DA ER VIRKDATO < 9705*/                                  00005780
     IF ENK8.UFG     < 50           THEN       /*0797 HL*/              00005790
          DO;                                                           00005800
             IF B01.PENSJONSTYPE1(SØKER_IND) ^= 'Y'  !                  00005810
                ENK8.UFG > B01.YRKEPENS.YUG(SØKER_IND) THEN             00005820
                DO;                                                     00005830
    L195:                                                               00005840
                    FEIL_VED_LABEL = '195';                             00005850
                    FEIL_MELD_NR   = 1535 ;                             00005860
                    GO TO L999;                                         00005870
                END;                                                    00005880
          END;                                                          00005890
                                                                        00005900
                                                                        00005910
          IF (ENK11.YUG = 0 !                                           00005920
              ENK11.YUG = 999)  &             /*9805 HL*/               00005930
             ENK8.UFG     < B01.YRKEPENS.YUG(SØKER_IND) THEN /*0797HL*/ 00005940
             DO;                                                        00005950
                                                                        00005960
                /* ENDRET 090589 BRITT: TILFELLET AVVISES IKKE, */      00005970
                /*                      KAP11-GRAD SETTES LIK   */      00005980
                /*                      KAP8-GRAD.              */      00005990
                                                                        00006000
                ENK11.YUG      = ENK8.UFG    ;              /*0797 HL*/ 00006010
                                                                        00006020
                /* HIT 090589 BRITT.                            */      00006030
                                                                        00006040
             END;                                                       00006050
                                                                        00006060
                                                                        00006070
 /* ***************************************************************** */00006080
 /* FEILMELD 1534: HØYERE YRKESSKADE-GRAD MÅ REGISTRERES MED          */00006090
 /*                GRUNNBLANKETT                                      */00006100
 /* ***************************************************************** */00006110
                                                                        00006120
          IF ENK8.UFG         =  B01.UFØRPENS.UFG(SØKER_IND)  &         00006130
             ENK11.YUG    >= B01.YRKEPENS.YUG(SØKER_IND)      &         00006140
             ENK8.FRYSP_3ÅR_ARB = ' '               &      /*0797 HL*/  00006150
             ENK8.FRYSP_TIDSB   = ' '             THEN     /*0797 HL*/  00006160
                DO;                                                     00006170
 L201:                                                                  00006180
                   FEIL_VED_LABEL = '201';                              00006190
                   FEIL_MELD_NR   = 1534;                               00006200
                   GO TO L999;                                          00006210
                END;                                                    00006220
                                                                        00006230
          ELSE              /*ENDRING I KAP8-GRAD */                    00006240
          IF (ENK8.UFG ^= 999)   !                                      00006250
             (UFG_OPPDATER > 0)                 THEN                    00006260
             DO I = 1 TO 7;        /*0697 HL*/                          00006270
                                                                        00006280
                IF B02.UFØRHIST.UFT_ÅM (SØKER_IND,I)   =  0       THEN  00006290
                   DO;                                                  00006300
 /*0797 HL*/          B02.UFØRPENS.UFG (SØKER_IND) = UFG_OPPDATER    ;  00006310
                      I                                =  I - 1      ;  00006320
                                                                        00006330
                      DO J = 1 TO 7;    /*0697 HL*/                     00006340
                                                                        00006350
                         IF B02.UFG_DATO_ÅM(SØKER_IND,I,J)    = 0 THEN  00006360
                            DO;                                         00006370
                                                                        00006380
                               IF (J = 1                            &   00006390
                                   B02.UFØRHIST.UFG (SØKER_IND,I)  ^=   00006400
                                   B02.UFØRPENS.UFG (SØKER_IND  ))   !  00006410
                                                                        00006420
                                  (J > 1                            &   00006430
                                   B02.UFG_ØVRIGE(SØKER_IND,I,J-1) ^=   00006440
                                   B02.UFØRPENS.UFG (SØKER_IND   )) THEN00006450
                                                                        00006460
                                   DO;                                  00006470
                                      B02.UFG_ØVRIGE  (SØKER_IND,I,J) = 00006480
                                          B02.UFØRPENS.UFG(SØKER_IND) ; 00006490
                                      B02.UFG_DATO_ÅM (SØKER_IND,I,J) = 00006500
                                          F_SNU_DATO(ENS.VIRK_DATO_MÅ); 00006510
                                                   /* 9913 */           00006520
                /*0797 HL*/           B02.FRYSP_3ÅR_ARB(SØKER_IND,I,J)= 00006530
                                          ENK8.FRYSP_3ÅR_ARB;           00006540
                                      B02.FRYSP_TIDSB  (SØKER_IND,I,J)= 00006550
                                          ENK8.FRYSP_TIDSB;             00006560
                                   END;                                 00006570
                                J = 7;     /*0697 HL*/                  00006580
                                I = 7;     /*0697 HL*/                  00006590
                            END;                                        00006600
                         ELSE                                           00006610
                            /*----------------------------------------*/00006620
                            /* UFØREPERIODENE ER BRUKT OPP - ): FEIL. */00006630
                            /*----------------------------------------*/00006640
                                                                        00006650
                            IF J = 7 THEN    /*0697 HL*/                00006660
                               DO;                                      00006670
  L205:                                                                 00006680
                                  FEIL_VED_LABEL = '205';               00006690
                                  FEIL_MELD_NR   = 1804;                00006700
                                  GO TO L999;                           00006710
                               END;                                     00006720
                      END;                                              00006730
                   END;                                                 00006740
             END;                                                       00006750
                                                                        00006760
              /*------------------------------------------------------*/00006770
              /* YRKEGRADEN ER GÅTT NED TIL 0, MEN HAR UP ETTER KAP 8 */00006780
              /* TRUDE 011189                                         */00006790
              /*------------------------------------------------------*/00006800
                                                                        00006810
           IF ENK11.YUG                     = 0  &                      00006820
              B01.PENSJONSTYPE1(SØKER_IND)  = 'Y'  THEN                 00006830
              DO;                                                       00006840
                 B02.YRKEPENS(SØKER_IND)   = '';                        00006850
                 DO I = 1 TO 5 ;                                        00006860
                    IF B01.YRKEHIST.YUFT_ÅM    (SØKER_IND,I)  > 0 &     00006870
                       B01.YRKEHIST.OPPH_DATO_ÅM(SØKER_IND,I) = 0 THEN  00006880
                       DO;                                              00006890
                          B02.YRKEHIST.OPPH_DATO_ÅM(SØKER_IND,I) =      00006900
                                          F_SNU_DATO(ENS.VIRK_DATO_MÅ); 00006910
                          B02.YRKEHIST.OPPH_KODE   (SØKER_IND,I) = 'J'; 00006920
                                                                        00006930
                          I       = 5;                                  00006940
                       END;                                             00006950
                 END;                                                   00006960
                 B02.PENSJONSTYPE1(BER_SØ_IND)    = 'U';                00006970
                                                                        00006980
                       /* VI MÅ ENDRE TILKNYTNINGSKODE FOR EKTEFELLE*/  00006990
                                                                        00007000
                 DO K = 1 TO 13 WHILE(B02.FNR_TILKN(EKTEF_IND,K) > 0);  00007010
                    IF B02.FNR_TILKN(EKTEF_IND,K) = B02.FNR(SØKER_IND)  00007020
                                                       THEN             00007030
                      DO;                                               00007040
                       B02.TILKNYTNINGSKODE(EKTEF_IND,K)  = 'U';        00007050
                      END;                                              00007060
                 END;                                                   00007070
                                                                        00007080
                       /* VI MÅ ENDRE TILKNYTNINGSKODE FOR BARN     */  00007090
                                                                        00007100
                 DO K = 1 TO 13 WHILE(B01.FNR_TILKN(SØKER_IND,K) > 0);  00007110
                    IF B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,K) = 'L' !  00007120
  /*HL*/               B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,K) = 'V' !  00007130
                       B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,K) = 'W'    00007140
                                                       THEN             00007150
                      DO;                                               00007160
                        DO BARN_IND = 3 TO 14 UNTIL(B01.FNR(BARN_IND) = 00007170
                                     B01.TILKN.FNR_TILKN(SØKER_IND,K)); 00007180
                        END;                                            00007190
                        B02.TILKN.TILKNYTNINGSKODE(BARN_IND,1)  = 'U';  00007200
                      END;                                              00007210
                 END;                                                   00007220
              END;   /*------------ TIL HIT TRUDE 021189-----------*/   00007230
                                                                        00007240
                                                                        00007250
                                                                        00007260
                                                                        00007270
                                                                        00007280
          /*----------------------------------------------------------*/00007290
          /* DET ER EN ENDRING I UFØRE-GRADEN . DETTE KAN ENDRE       */00007300
          /* PENSJONS-POENGET FOR DETTE ÅRET .                        */00007310
          /* FNR , TKNR , DAGENS DATO , KLOKKE-SLETTET LEGGES UT      */00007320
          /* PÅ EN FILE TIL BRUK I NORTRYGD HVIS DET ER ET NOR_KONTOR.*/00007330
          /*----------------------------------------------------------*/00007340
                                                                        00007350
 /*9957*/ CALL P900_NOR_DATA(B02.FNR(SØKER_IND),(B02.TKNR(SØKER_IND))); 00007360
       END;    /*SLUTT PÅ TEST OM UFG = 999 */                          00007370
                                                                        00007380
                                                                        00007390
                                                                        00007400
 /* ***************************************************************** */00007410
 /* DERSOM INNTEKT-FØR-UP  ER UTFYLT                                 */ 00007420
 /* ***************************************************************** */00007430
                                                                        00007440
    IF ENK8.INNTEKT_FØR_UP ^= 0 THEN                                    00007450
       DO;  /* INNTEKT FØR UP UTFYLT */                                 00007460
          TRANSTYPE   = 9;                                              00007470
          FELT_UTFYLT = 1;                                              00007480
          /* -------------------------------------------------------- */00007490
          /* DERSOM PERSONEN IKKE ER REGISTRERT MED UFØREPENSJON      */00007500
          /* -------------------------------------------------------- */00007510
                                                                        00007520
          IF B01.PENSJONSTYPE1(SØKER_IND) ^= 'U' &                      00007530
             B01.PENSJONSTYPE1(SØKER_IND) ^= 'Y' THEN                   00007540
             DO;                                                        00007550
 L206:                                                                  00007560
                FEIL_VED_LABEL = '206';                                 00007570
                FEIL_MELD_NR   = 1512;                                  00007580
                GO TO L999;                                             00007590
             END;                                                       00007600
          ELSE                                                          00007610
             DO; /* VEDKOMMENDE HAR UFØREPENSJON */                     00007620
                /* -------------------------------------------------- */00007630
                /* DERSOM PERSONEN HAR UFØREPENSJON, KONTROLLERES DET */00007640
                /* AT INNTEKTSDATO ER LIK FØRSTE UFØRETIDSPUNKT       */00007650
                /* -------------------------------------------------- */00007660
                IF ^(B01.UFØRHIST.UFT_ÅM(SØKER_IND,1) =                 00007670
                     F_SNU_DATO(ENK8.INNT_DATO_MÅ)    ) THEN            00007680
                   DO;  /* ULIKT UFØRETIDSPUNKT */                      00007690
 L207:                                                                  00007700
                      FEIL_VED_LABEL = '207';                           00007710
                      FEIL_MELD_NR   = 1740;                            00007720
                      GO TO L999;                                       00007730
                   END; /* ULIKT UFØRETIDSPUNKT */                      00007740
                ELSE                                                    00007750
                   DO; /* OPPDATER B02 MED INNTEKTSOPPLYSNINGER */      00007760
                      B02.UFØRPENS.INNTEKT_FØR_UP (SØKER_IND)           00007770
                         = ENK8.INNTEKT_FØR_UP / 100;                   00007780
                      B02.UFØRPENS.INNT_DATO_ÅM(SØKER_IND)              00007790
                         = F_SNU_DATO(ENK8.INNT_DATO_MÅ);               00007800
                   END;/* OPPDATER B02 MED INNTEKTSOPPLYSNINGER */      00007810
             END; /* VEDKOMMENDE HAR UFØREPENSJON */                    00007820
       END; /* INNTEKT FØR UP UTFYLT */                                 00007830
                                                                        00007840
 /*YS**** *********************************************************** */00007850
 /*YS**** DERSOM YRKEGRADEN ER UTFYLT                                 */00007860
 /*YS**** *********************************************************** */00007870
                                                                        00007880
        IF ENK11.YUG ^= 999 THEN     /*0797 HL*/                        00007890
           DO;                                                          00007900
              TRANSTYPE = 9;                                            00007910
              FELT_UTFYLT = 1;                                          00007920
                                                                        00007930
 /*YS**** *********************************************************** */00007940
 /*YS**** DERSOM PERSONEN IKKE ER REGISTRERT MED YRKESSKADE           */00007950
 /*YS**** *********************************************************** */00007960
                                                                        00007970
              IF B01.PENSJONSTYPE1(SØKER_IND) ^= 'Y' THEN               00007980
                 DO;                                                    00007990
         L210:                                                          00008000
                    FEIL_VED_LABEL = '210';                             00008010
                    FEIL_MELD_NR = 1533;                                00008020
                    GO TO L999;                                         00008030
                 END;                                                   00008040
                                                                        00008050
                                                                        00008060
 /*YS**** *********************************************************** */00008070
 /*YS**** FEILMELD 1534: ENDRING I UFØREPENSJON AVVISES. NY YRKEGRAD  */00008080
 /*YS**** ER IKKE LAVERE ENN REGISTRERT YRKEGRAD.                     */00008090
 /*YS**** *********************************************************** */00008100
                                                                        00008110
         /*   IF ENK11.YUG   >= B01.YRKEPENS.YUG(SØKER_IND) THEN */     00008120
              IF ENK11.YUG   >  B01.YRKEPENS.YUG(SØKER_IND) THEN        00008130
                 DO;                                                    00008140
         L212:                                                          00008150
                    FEIL_VED_LABEL = '212';                             00008160
                    FEIL_MELD_NR = 1534;                                00008170
                    GO TO L999;                                         00008180
                 END;                                                   00008190
              ELSE                                                      00008200
                 DO I = 1 TO 5;                                         00008210
                                                                        00008220
                    IF B02.YRKEHIST.YUFT_ÅM (SØKER_IND,I) = 0     THEN  00008230
                       DO;                                              00008240
                          B02.YRKEPENS.YUG (SØKER_IND) =  ENK11.YUG  ;  00008250
                          I                            =  I - 1      ;  00008260
                                                                        00008270
                          DO J = 1 TO 5;                                00008280
                                                                        00008290
                             IF B02.YUG_ØVRIGE(SØKER_IND,I,J) = 0 THEN  00008300
                                DO;                                     00008310
                                                                        00008320
                                   IF                                   00008330
                                     (J = 1                        &    00008340
                                      B02.YRKEHIST.YUG (SØKER_IND,I) ^= 00008350
                                      B02.YRKEPENS.YUG (SØKER_IND )) !  00008360
                                                                        00008370
                                     (J > 1                       &     00008380
                                      B02.YUG_ØVRIGE(SØKER_IND,I,J-1) ^=00008390
                                      B02.YRKEPENS.YUG (SØKER_IND ))    00008400
                                                                    THEN00008410
                                                                        00008420
                                       DO;                              00008430
                                          B02.YUG_ØVRIGE                00008440
                                                      (SØKER_IND,I,J) = 00008450
                                           B02.YRKEPENS.YUG(SØKER_IND); 00008460
                                          B02.YUG_DATO_ÅM               00008470
                                                      (SØKER_IND,I,J) = 00008480
                                           F_SNU_DATO(ENS.VIRK_DATO_MÅ);00008490
                                                       /* 9913 */       00008500
                                       END;                             00008510
                                    J = 5;                              00008520
                                    I = 5;                              00008530
                                END;                                    00008540
                             ELSE                                       00008550
                                /*------------------------------------*/00008560
                                /* YRKEPERIODENE ER BRUKT OPP - ):    */00008570
                                /* FEIL.                              */00008580
                                /*------------------------------------*/00008590
                                                                        00008600
                                IF J = 5 THEN                           00008610
                                   DO;                                  00008620
         L215:                                                          00008630
                                      FEIL_VED_LABEL = '215';           00008640
                                      FEIL_MELD_NR = 1810;              00008650
                                      GO TO L999;                       00008660
                                   END;                                 00008670
                          END;                                          00008680
                       END;                                             00008690
                 END;                                                   00008700
                                                                        00008710
              /*------------------------------------------------------*/00008720
              /* DET ER EN ENDRING I YRKE-GRADEN . DETTE KAN ENDRE    */00008730
              /* PENSJONS-POENGET FOR DETTE ÅRET .                    */00008740
              /* FNR , TKNR , DAGENS DATO , KLOKKE-SLETTET LEGGES UT  */00008750
              /* PÅ EN FILE TIL BRUK I NORTRYGD HVIS DET ER ET        */00008760
              /* NOR_KONTOR.                                          */00008770
              /*------------------------------------------------------*/00008780
                                                                        00008790
               CALL P900_NOR_DATA                          /*9957*/     00008800
                          (B02.FNR(SØKER_IND),(B02.TKNR(SØKER_IND)));   00008810
           END;                                                         00008820
                                                                        00008830
 /* ***************************************************************** */00008840
 /* TIDLIGERE FORSØRGET EKTEFELLE STOD IGJEN MED PENSJONSTYPE1 = 'F'  */00008850
 /* OGSÅ ETTER AT TOTALGRADEN BLE UNDER 50 PROSENT.  DET SOM ER       */00008860
 /* RIKTIG, ER AT EKTEFELLEN SKAL HA PENSJONSTYPE1 = 'G'.             */00008870
 /* PENSJONISTEN SELV SKAL HA PENSJONSTYPE2 = 'P'.                    */00008880
 /* ERIK, 11.1.1990.                                                  */00008890
 /* ***************************************************************** */00008900
                                                                        00008910
                                                                        00008920
        IF B01.PENSJONSTYPE1(SØKER_IND)  = 'Y' &                        00008930
           B01.PENSJONSTYPE2(SØKER_IND)  = 'F' &                        00008940
           HJ_VIRKDATO_ÅM                < 9705 &    /*HL*/             00008950
           B01.PENSJONSTYPE1(EKTEF_IND)  = 'F' &                        00008960
           ENK8.UFG                      < 50  &   /*0797 HL*/          00008970
           ENK11.YUG                     > 0  THEN                      00008980
             DO;                                                        00008990
                B02.PENSJONSTYPE2(SØKER_IND)     = 'P';                 00009000
                B02.PENSJONSTYPE1(EKTEF_IND)     = 'G';                 00009010
                B02.PENSJONSTYPE2(EKTEF_IND)     = ' ';                 00009020
             END;                                                       00009030
                                                                        00009040
     IF SØKER_IND < 3 THEN                 /* ENDERING FOR BARN  */     00009050
        DO;                                                             00009060
           DO I = 1 TO 13;                                              00009070
              IF (B02.FNR_TILKN(SØKER_IND,I) =                          00009080
                                 B02.FNR(EKTEF_IND)) THEN               00009090
                 DO;                                                    00009100
                    B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) =           00009110
                            B02.PENSJONSTYPE1(EKTEF_IND);               00009120
                    I = 13;                                             00009130
                END;                                                    00009140
           END;                                                         00009150
                                                                        00009160
           DO I = 1 TO 13;                                              00009170
              IF (B02.FNR_TILKN(EKTEF_IND,I) =                          00009180
                                 B02.FNR(SØKER_IND)) THEN               00009190
                 DO;                                                    00009200
                    B02.TILKN.TILKNYTNINGSKODE(EKTEF_IND,I) =           00009210
                            B02.PENSJONSTYPE1(SØKER_IND);               00009220
                    I = 13;                                             00009230
                 END;                                                   00009240
           END;                                                         00009250
        END;                                                            00009260
 /* ***************************************************************** */00009270
 /* TIL HIT.  ERIK 11.1.1990.                                         */00009280
 /* ***************************************************************** */00009290
                                                                        00009300
 /* ***************************************************************** */00009310
 /*   TO NYE FELT - HL 0797 :                                         */00009320
 /* **************************************************************** */ 00009330
                                                                        00009340
        IF ENK8.TIDSBEGR_ATTF = 'S'    THEN                             00009350
           IF B02.UFØRPENS.TIDSBEGR_ATTF(SØKER_IND) = 'J' THEN          00009360
              DO;                                                       00009370
 L216:                                                                  00009380
                 FEIL_VED_LABEL = '216';                                00009390
                 FEIL_MELD_NR   =  438;                                 00009400
                 GO TO L999;                                            00009410
              END;                                                      00009420
           ELSE                                                         00009430
           IF B02.UFØRPENS.SKJERM_ATTF(SØKER_IND) = 'J' THEN            00009440
              IF ENK8.SKJERM_ATTF ^= 'X'                  THEN          00009450
                 DO;                                                    00009460
 L217:                                                                  00009470
                    FEIL_VED_LABEL = '217';                             00009480
                    FEIL_MELD_NR   =  439;                              00009490
                    GO TO L999;                                         00009500
                 END;                                                   00009510
              ELSE                                                      00009520
                 DO;                                                    00009530
                    B02.UFØRPENS.TIDSBEGR_ATTF(SØKER_IND) = 'J';        00009540
                    FELT_UTFYLT     = 1;                                00009550
                 END;                                                   00009560
           ELSE                                                         00009570
              DO;                                                       00009580
                 B02.UFØRPENS.TIDSBEGR_ATTF(SØKER_IND) = 'J';           00009590
                 FELT_UTFYLT     = 1;                                   00009600
              END;                                                      00009610
        ELSE                                                            00009620
        IF ENK8.TIDSBEGR_ATTF = 'X'    THEN                             00009630
           IF B02.UFØRPENS.TIDSBEGR_ATTF(SØKER_IND) = ' ' THEN          00009640
              DO;                                                       00009650
 L218:                                                                  00009660
                 FEIL_VED_LABEL = '218';                                00009670
                 FEIL_MELD_NR   =  440;                                 00009680
                 GO TO L999;                                            00009690
              END;                                                      00009700
           ELSE                                                         00009710
              DO;                                                       00009720
                 B02.UFØRPENS.TIDSBEGR_ATTF(SØKER_IND) = ' ';           00009730
                 FELT_UTFYLT     = 1;                                   00009740
              END;                                                      00009750
        IF ENK8.SKJERM_ATTF   = 'S'    THEN                             00009760
           IF B02.UFØRPENS.SKJERM_ATTF(SØKER_IND) = 'J' THEN            00009770
              DO;                                                       00009780
 L219:                                                                  00009790
                 FEIL_VED_LABEL = '219';                                00009800
                 FEIL_MELD_NR   =  439;                                 00009810
                 GO TO L999;                                            00009820
              END;                                                      00009830
           ELSE                                                         00009840
           IF B02.UFØRPENS.TIDSBEGR_ATTF(SØKER_IND) = 'J' THEN          00009850
              IF ENK8.TIDSBEGR_ATTF ^= 'X'               THEN           00009860
                 DO;                                                    00009870
 L21A:                                                                  00009880
                    FEIL_VED_LABEL = '21A';                             00009890
                    FEIL_MELD_NR   =  438;                              00009900
                    GO TO L999;                                         00009910
                 END;                                                   00009920
              ELSE                                                      00009930
              DO;                                                       00009940
                 B02.UFØRPENS.SKJERM_ATTF(SØKER_IND) = 'J';             00009950
                 FELT_UTFYLT     = 1;                                   00009960
              END;                                                      00009970
           ELSE                                                         00009980
              DO;                                                       00009990
                 B02.UFØRPENS.SKJERM_ATTF(SØKER_IND) = 'J';             00010000
                 FELT_UTFYLT     = 1;                                   00010010
              END;                                                      00010020
        ELSE                                                            00010030
        IF ENK8.SKJERM_ATTF   = 'X'    THEN                             00010040
           IF  B02.UFØRPENS.SKJERM_ATTF(SØKER_IND) = ' '    THEN        00010050
                 DO;                                                    00010060
 L21B:                                                                  00010070
                    FEIL_VED_LABEL = '21B';                             00010080
                    FEIL_MELD_NR   =  441;                              00010090
                    GO TO L999;                                         00010100
                 END;                                                   00010110
           ELSE                                                         00010120
              DO;                                                       00010130
                 B02.UFØRPENS.SKJERM_ATTF(SØKER_IND) = ' ';             00010140
                 FELT_UTFYLT     = 1;                                   00010150
              END;                                                      00010160
                                                                        00010170
 /* ***************************************************************** */00010180
 /* DERSOM FORVENTET ARBEIDSINNTEKT ER UTFYLT                         */00010190
 /* ***************************************************************** */00010200
                                                                        00010210
    IF ENK10.FORVENTET_INNT  = 9999999 THEN                             00010220
       DO;                                                              00010230
          IF B02.ETTEPENS.FORVENTET(SØKER_IND) > 0   THEN               00010240
             CALL RULL_FORVENTET(B02.G_DATO_ÅM(SØKER_IND),              00010250
                           B02.VIRK_DATO_ÅM(SØKER_IND),                 00010260
                           B02.ETTEPENS.FORVENTET(SØKER_IND));          00010270
       END;                                                             00010280
    ELSE                                                                00010290
 /* IF ENK10.FORVENTET_INNT  ^= 9999999 THEN        */                  00010300
       DO;                                                              00010310
          TRANSTYPE                       = 11;                         00010320
          FELT_UTFYLT             = 1;                                  00010330
          IF STATUS_TYPE = 'C' THEN                                     00010340
             DO;                                                        00010350
 L220:                                                                  00010360
                                                                        00010370
 /* STATUS_TYPE 'C'             FORTELLER AT VIRKDATO I TRANS LIGGER */ 00010380
 /* FØR NEST-SISTE STATUS.   J.D 27.10.87              */               00010390
                                                                        00010400
                 FEIL_VED_LABEL = '220';                                00010410
                 FEIL_MELD_NR   = 0601;                                 00010420
                 GO TO L999;                                            00010430
             END;                                                       00010440
                                                                        00010450
          IF B01.PENSJONSTYPE1(SØKER_IND) ^= 'E' &                      00010460
             B01.PENSJONSTYPE1(SØKER_IND) ^= 'J' &                      00010470
             B01.PENSJONSTYPE2(SØKER_IND) ^= 'E' THEN                   00010480
             DO;                                                        00010490
 L230:                                                                  00010500
 /* ***************************************************************** */00010510
 /* FEILMELD 1514: ENDRING I FORVENTET INNTEKT AVVISES. PERSONEN ER   */00010520
 /* IKKE REGISTRERT MED PENSJON SOM ETTERLATT EKTEFELLE.              */00010530
 /* ***************************************************************** */00010540
                                                                        00010550
                FEIL_VED_LABEL = '230';                                 00010560
                FEIL_MELD_NR   = 1514;                                  00010570
                GO TO L999;                                             00010580
             END;                                                       00010590
          ELSE                                                          00010600
             B02.FORVENTET (SØKER_IND) = ENK10.FORVENTET_INNT/100;      00010610
       END;                                                             00010620
                                                                        00010630
 /* ***************************************************************** */00010640
 /* DERSOM OVERGANG TIL PENSJON ER UTFYLT                             */00010650
 /* ***************************************************************** */00010660
                                                                        00010670
    IF ENK10.O_TIL_PENSJON = 'X' THEN                                   00010680
       DO;                                                              00010690
          TRANSTYPE        = 11;                                        00010700
          FELT_UTFYLT      =  1;                                        00010710
                                                                        00010720
 /* ***************************************************************** */00010730
 /* DERSOM PERSONEN IKKE HAR OVERGANGSSTØNAD FRA FØR                  */00010740
 /* ELLER HAR OVERGANGSSTØNAD MED SIVILSTAND LIK ETTERLATT            */00010750
 /* ***************************************************************** */00010760
                                                                        00010770
          IF B01.PENSJONSTYPE2(SØKER_IND) ^= 'O'   !                    00010780
                                                                        00010790
            (B01.PENSJONSTYPE2(SØKER_IND)  = 'O'  &                     00010800
             B01.SIVILSTAND   (SØKER_IND)  = 'E'      )   THEN          00010810
             DO;                                                        00010820
 L240:                                                                  00010830
                FEIL_VED_LABEL = '240';                                 00010840
                FEIL_MELD_NR   = 1516;                                  00010850
                GO TO L999;                                             00010860
             END;                                                       00010870
          ELSE                                                          00010880
             B02.PENSJONSTYPE2(SØKER_IND) = 'P';                        00010890
       END;                                                             00010900
                                                                        00010910
 /* ***************************************************************** */00010920
 /* DERSOM TP-PROSENT ER UTFYLT                                       */00010930
 /* ***************************************************************** */00010940
                                                                        00010950
    IF ENK10.TP_PROSENT ^= 999 THEN                                     00010960
       DO;                                                              00010970
         FELT_UTFYLT     = 1;                                           00010980
         TRANSTYPE       = 11;                                          00010990
                                                                        00011000
         IF B01.PENSJONSTYPE1(SØKER_IND) ^= 'E'  &                      00011010
            B01.PENSJONSTYPE2(SØKER_IND) ^= 'E'      THEN               00011020
            DO;                                                         00011030
 L250:                                                                  00011040
              FEIL_VED_LABEL = '250';                                   00011050
              FEIL_MELD_NR   = 1520;                                    00011060
 /* ***************************************************************** */00011070
 /* FEILMELD 1520: ENDRING I PROSENT AV AVDØDS TILLEGSPENSJON AV-     */00011080
 /* VISES, PERSONEN ER IKKE REGISTRERT SOM ETTERLATTPENSJONIST.       */00011090
 /* ***************************************************************** */00011100
                                                                        00011110
              GO TO L999;                                               00011120
            END;                                                        00011130
                                                                        00011140
 /* ***************************************************************** */00011150
 /* FEILMELD 1518: ENDRING I PROSENT AV AVDØDES TILLEGSPENSJON AV-    */00011160
 /* VISES, DEN ETTERLATTES SIVILSTAND = 'E' (IKKE 'S')                */00011170
 /* ***************************************************************** */00011180
                                                                        00011190
        IF B01.SIVILSTAND(SØKER_IND) ^= 'S' THEN                        00011200
           DO;                                                          00011210
 L260:                                                                  00011220
              FEIL_VED_LABEL = '260';                                   00011230
              FEIL_MELD_NR   = 1518;                                    00011240
              GO TO L999;                                               00011250
           END;                                                         00011260
                                                                        00011270
 /* ***************************************************************** */00011280
 /* FEILMELD 1519: ENDRING I PROSENT AV AVDØDES TILLEGSPENSJON AV-    */00011290
 /* VISES, SAMME PROSENTSATS ER REGISTRERT FRA FØR.                   */00011300
 /* ***************************************************************** */00011310
                                                                        00011320
        IF B01.TP_PROSENT(SØKER_IND) = ENK10.TP_PROSENT         THEN    00011330
           DO;                                                          00011340
 L270:                                                                  00011350
              FEIL_VED_LABEL = '270';                                   00011360
              FEIL_MELD_NR   = 1519;                                    00011370
              GO TO L999;                                               00011380
           END;                                                         00011390
                                                                        00011400
        B02.TP_PROSENT(SØKER_IND) = ENK10.TP_PROSENT;                   00011410
     END;                                                               00011420
                                                                        00011430
    IF ENS.EK_INNT_OVER_2G ^= ' '        THEN                           00011440
       DO;   /*9710 HL*/                                                00011450
          IF  (B02.SIVILSTAND(SØKER_IND) = 'G'    !                     00011460
               B02.SIVILSTAND(SØKER_IND) = 'P'    !                     00011470
               B02.SIVILSTAND(SØKER_IND) = 'V'    !                     00011480
               B02.SIVILSTAND(SØKER_IND) = 'W' )        THEN            00011490
             DO;                                                        00011500
                B02.EK_INNT_OVER_2G(SØKER_IND) = ENS.EK_INNT_OVER_2G;   00011510
                IF B02.PENSJON_FØR_9802(SØKER_IND) = 'J'    THEN        00011520
                   TRANSTYPE = 51; /*IKKE BREV*/                        00011530
                FELT_UTFYLT = 1;                                        00011540
             END;                                                       00011550
       END;                                                             00011560
                                                                        00011570
 /* ***************************************************************** */00011580
 /* DERSOM EKTEFELLENS FØDSELSNUMMER ER UTFYLT.                       */00011590
 /* ***************************************************************** */00011600
                                                                        00011610
    IF ENS.FNR_EK > 0 THEN                                              00011620
       DO;                                                              00011630
          FELT_UTFYLT             = 1;                                  00011640
          IF B01.SIVILSTAND(SØKER_IND) = 'W' !                          00011650
             B01.SIVILSTAND(SØKER_IND) = 'V'   THEN                     00011660
             IF B01.FNR(EKTEF_IND) = ENS.FNR_EK   THEN                  00011670
                DO;    /*9710 HL : */                                   00011680
                   B02.SIVILSTAND(SØKER_IND) = ENS.SIVILSTAND;          00011690
                   B02.SIVILSTAND(EKTEF_IND) = ENS.SIVILSTAND;          00011700
                END;                                                    00011710
             ELSE                                                       00011720
                DO;                                                     00011730
 L271 :                                                                 00011740
                   FEIL_VED_LABEL = '271';                              00011750
                   FEIL_MELD_NR   = 1540 ;                              00011760
                   GO TO L999;                                          00011770
                END;                                                    00011780
          ELSE                                                          00011790
             DO;    /*9710 HL : */                                      00011800
                B02.SIVILSTAND(SØKER_IND) = ENS.SIVILSTAND;             00011810
                B02.SIVILSTAND(EKTEF_IND) = ENS.SIVILSTAND;             00011820
                CALL MELDING_OM_GIFTEMÅL;              /*UE30*/         00011830
                IF FEIL_MELD_NR > 0 THEN                                00011840
                   GOTO L999;                                           00011850
             END;                                                       00011860
       END;                                                             00011870
    ELSE                                                                00011880
       IF ENS.SKILSMISSE      = 'X' !                                   00011890
          ENS.FLYTTET_FRA     = 'X' !                                   00011900
          ENS.OPPHØR_SAMBO    = 'X' !                                   00011910
          ENS.FLYTTET_SAMMEN  = 'X' THEN                                00011920
          DO;                                                           00011930
                   FELT_UTFYLT             = 1;                         00011940
                   IF B01.PENSJONSTYPE1(SØKER_IND) = 'G' !              00011950
                      B01.PENSJONSTYPE1(SØKER_IND) = 'F' THEN           00011960
                     DO;                                                00011970
 L275:                                                                  00011980
                        FEIL_VED_LABEL = '275';                         00011990
                        FEIL_MELD_NR   = 1205;                          00012000
                        GO TO L999;                                     00012010
                     END;                                               00012020
 /* ***************************************************************** */00012030
 /* DERSOM EKTEFELLEN IKKE ER I BASEN                                 */00012040
 /* ***************************************************************** */00012050
                    IF (B01.FNR(EKTEF_IND) = 0                          00012060
 /* 18.10.84 HL */      & ENS.SKILSMISSE = ' ')    !                    00012070
                       B01.PENSJONSTYPE1(EKTEF_IND) = 'D' THEN          00012080
                       DO;                                              00012090
 L280:                                                                  00012100
                          FEIL_VED_LABEL = '280';                       00012110
                          FEIL_MELD_NR   = 1005;                        00012120
                          GO TO L999;                                   00012130
                       END;                                             00012140
                    ELSE                                                00012150
 /* ***************************************************************** */00012160
 /* DERSOM SKILSMISSE ER UTFYLT.                                      */00012170
 /* ***************************************************************** */00012180
                       IF ENS.SKILSMISSE = 'X' THEN                     00012190
                          DO;                                           00012200
                                                                        00012210
 /* TILLEGG 18.10.84  HL                                              */00012220
                                                                        00012230
                             IF B01.FNR(EKTEF_IND) = 0    THEN          00012240
                                DO;                                     00012250
                                   B02.SIVILSTAND(SØKER_IND) = 'S';     00012260
                                   TRANSTYPE = 52;                      00012270
                                END;                                    00012280
                             ELSE                                       00012290
                                                                        00012300
 /* HIT  HL                                                           */00012310
                                                                        00012320
                                CALL MELDING_OM_SKILSMISSE;   /* 1440 */00012330
                             IF FEIL_MELD_NR > 0 THEN                   00012340
                                GOTO L999;                              00012350
                          END;                                          00012360
                       ELSE                                             00012370
 /* ***************************************************************** */00012380
 /* DERSOM FLYTTET FRA HVERANDRE ER UTFYLT.                           */00012390
 /* ***************************************************************** */00012400
                          IF ENS.FLYTTET_FRA = 'X'  !                   00012410
                             ENS.OPPHØR_SAMBO= 'X' THEN                 00012420
                             DO;                                        00012430
                                IF B01.SIVILSTAND(SØKER_IND) = 'W' !    00012440
                                   B01.SIVILSTAND(SØKER_IND) = 'V' THEN 00012450
                                CALL MELDING_OM_SKILSMISSE; /* 1440 */  00012460
                                ELSE                                    00012470
                                CALL MELDING_OM_FLYTTET_FRA; /* 1460 */ 00012480
                                IF FEIL_MELD_NR > 0 THEN                00012490
                                GOTO L999;                              00012500
                             END;                                       00012510
                          ELSE                                          00012520
 /* ***************************************************************** */00012530
 /* DERSOM FLYTTET SAMMEN ER UTFYLT.                                  */00012540
 /* ***************************************************************** */00012550
                             IF ENS.FLYTTET_SAMMEN = 'X' THEN           00012560
                                DO;                                     00012570
 /* 1450 */                        CALL MELDING_OM_FLYTTET_SAMMEN;      00012580
                                   IF FEIL_MELD_NR > 0 THEN             00012590
                                      GOTO L999;                        00012600
                                END;                                    00012610
          END;                                                          00012620
                                                                        00012630
       IF ENS.OPPHØR_SAMBO    = 'X' THEN                                00012640
                   FELT_UTFYLT             = 1;                         00012650
                                                                        00012660
    IF EN_INNTEKT.MINST_4G = 'J' ! EN_INNTEKT.MINST_4G = 'N' THEN       00012670
       DO;                                                              00012680
          TRANSTYPE = 70;                                               00012690
                                                                        00012700
          /* TRANSTYPE = 70 : ENDRING I EK'S INNT - IKKE NYTT BREV */   00012710
          FELT_UTFYLT = 1;                                              00012720
                                                                        00012730
          IF B01.PENSJONSTYPE1(EKTEF_IND) ^= 'G'   THEN                 00012740
             DO;                                                        00012750
 L284:                                                                  00012760
                FEIL_VED_LABEL = '284';                                 00012770
                FEIL_MELD_NR = 1006;                                    00012780
                GO TO L999;                                             00012790
             END;                                                       00012800
          ELSE                                                          00012810
          IF EN_INNTEKT.MINST_4G = 'J' THEN                             00012820
             B02.PENSJONSTYPE2 (EKTEF_IND) = 'M';                       00012830
          ELSE                                                          00012840
             B02.PENSJONSTYPE2 (EKTEF_IND) = 'U';                       00012850
                                                                        00012860
          DO I = 3 TO 14 WHILE                                          00012870
             (B01.FNR(I) > 0);                                          00012880
                                                                        00012890
             IF B01.PENSJONSTYPE2(I) = 'R' THEN                         00012900
                TRANSTYPE = 48;                                         00012910
          END;                                                          00012920
       END;                                                             00012930
                                                                        00012940
                                                                        00012950
 /* ***************************************************************** */00012960
 /* OPPDATER INNTEKTER :                                              */00012970
 /* ***************************************************************** */00012980
                                                                        00012990
 /* FOR Å RETTE OPP AT FELTET HAR VÆRT FYLT UT MED 7*9-TALL */          00013000
 /* I STEDET FOR 6*9-TALL :       HL 23.12.94               */          00013010
                                                                        00013020
          IF EN_INNTEKT.PENSJONSINNT_SØKER = 9999999  THEN              00013030
             EN_INNTEKT.PENSJONSINNT_SØKER = 999999;                    00013040
          IF EN_INNTEKT.ARBEIDSINNT_SØKER = 9999999  THEN               00013050
             EN_INNTEKT.ARBEIDSINNT_SØKER = 999999;                     00013060
          IF EN_INNTEKT.PENSJONSINNT_EK      = 9999999  THEN            00013070
             EN_INNTEKT.PENSJONSINNT_EK      = 999999;                  00013080
          IF EN_INNTEKT.ARBEIDSINNT_EK    = 9999999  THEN               00013090
             EN_INNTEKT.ARBEIDSINNT_EK    = 999999;                     00013100
                                                                        00013110
            /* RETTER ALLE INNTEKT TIL HELE 100 ISEDET FOR HELE 1000*/  00013120
            /* NÅR DET GJELDER INNTEKTER TIL FORSØRGINGSTILLEGG.    */  00013130
            /* TRUDE 01.08.95  */                                       00013140
                                                                        00013150
    IF B02.FT_SKAL_BEREGNES (SØKER_IND) = 'J'       !                   00013160
       B02.FT_SKAL_BEREGNES (SØKER_IND) = 'N'      THEN                 00013170
       DO;                                                              00013180
  /*9802 HL F_RULL_FORSI : */                                           00013190
          IF EN_INNTEKT.PENSJONSINNT_SØKER = 999999   THEN              00013200
             DO;                                                        00013210
                IF B02.FORSI.PENSJONSINNTEKT(SØKER_IND) > 0  THEN       00013220
                   B02.FORSI.PENSJONSINNTEKT(SØKER_IND) =               00013230
                       F_RULL_FORSI(B02.G_DATO_ÅM(SØKER_IND),           00013240
                             B02.VIRK_DATO_ÅM(SØKER_IND),               00013250
                             B02.FORSI.PENSJONSINNTEKT(SØKER_IND));     00013260
             END;                                                       00013270
          ELSE                                                          00013280
  /*      IF EN_INNTEKT.PENSJONSINNT_SØKER ^= 999999   THEN  */         00013290
             DO;                                                        00013300
                W_HJELP = EN_INNTEKT.PENSJONSINNT_SØKER/100;            00013310
                B02.PENSJONSINNTEKT(SØKER_IND) = W_HJELP;               00013320
                TRANSTYPE = 6;                                          00013330
                FELT_UTFYLT = 1;                                        00013340
             END;                                                       00013350
          IF EN_INNTEKT.ARBEIDSINNT_SØKER = 999999   THEN               00013360
             IF ENK7.FAI                  = 9999999 THEN /*9809*/       00013370
                DO;                                                     00013380
                   IF B02.FORSI.ARBEIDSINNTEKT(SØKER_IND) > 0  THEN     00013390
                      B02.FORSI.ARBEIDSINNTEKT(SØKER_IND) =             00013400
                          F_RULL_FORSI(B02.G_DATO_ÅM(SØKER_IND),        00013410
                              B02.VIRK_DATO_ÅM(SØKER_IND),              00013420
                              B02.FORSI.ARBEIDSINNTEKT(SØKER_IND));     00013430
                END;                                                    00013440
             ELSE; /*HVIS FAI ER FYLT UT BLIR OPPDATERING GJORT*/       00013450
                   /*FORAN - DER FAI ER BEHANDLET              */       00013460
          ELSE  /*AI ER FYLT UT, FAI ER IKKE FYLT UT*/                  00013470
             DO;                                                        00013480
                W_HJELP = EN_INNTEKT.ARBEIDSINNT_SØKER/100;             00013490
                B02.ARBEIDSINNTEKT(SØKER_IND) = W_HJELP;                00013500
                TRANSTYPE = 6;                                          00013510
                FELT_UTFYLT = 1;                                        00013520
             END;                                                       00013530
          IF B02.PENSJONSTYPE2(SØKER_IND)  = 'F'   THEN                 00013540
             IF EN_INNTEKT.PENSJONSINNT_EK    ^= 999999    !            00013550
                EN_INNTEKT.ARBEIDSINNT_EK     ^= 999999     THEN        00013560
             DO;                                                        00013570
 L285:                                                                  00013580
                FEIL_VED_LABEL = '285';                                 00013590
                FEIL_MELD_NR = 1108;                                    00013600
                GO TO L999;                                             00013610
             END;                                                       00013620
          IF EN_INNTEKT.PENSJONSINNT_EK    = 999999   THEN              00013630
             DO;                                                        00013640
                IF B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND) > 0  THEN    00013650
                   B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND) =            00013660
                       F_RULL_FORSI(B02.G_DATO_ÅM(SØKER_IND),           00013670
                             B02.VIRK_DATO_ÅM(SØKER_IND),               00013680
                             B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND));  00013690
             END;                                                       00013700
          ELSE                                                          00013710
 /*       IF EN_INNTEKT.PENSJONSINNT_EK    ^= 999999   THEN */          00013720
             DO;                                                        00013730
                W_HJELP = EN_INNTEKT.PENSJONSINNT_EK /100;              00013740
                B02.PENSJONSINNTEKT_EK        = W_HJELP;                00013750
                TRANSTYPE = 6;                                          00013760
                FELT_UTFYLT = 1;                                        00013770
             END;                                                       00013780
          IF EN_INNTEKT.ARBEIDSINNT_EK    = 999999    THEN              00013790
             DO;                                                        00013800
                IF B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND) > 0  THEN     00013810
                   B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND) =             00013820
                       F_RULL_FORSI(B02.G_DATO_ÅM(SØKER_IND),           00013830
                             B02.VIRK_DATO_ÅM(SØKER_IND),               00013840
                             B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND));   00013850
             END;                                                       00013860
          ELSE                                                          00013870
 /*       IF EN_INNTEKT.ARBEIDSINNT_EK    ^= 999999    THEN   */        00013880
             DO;                                                        00013890
                W_HJELP = EN_INNTEKT.ARBEIDSINNT_EK /100;               00013900
                B02.ARBEIDSINNTEKT_EK        = W_HJELP;                 00013910
                TRANSTYPE = 6;                                          00013920
                FELT_UTFYLT = 1;                                        00013930
             END;                                                       00013940
      /*  IF W_HJELP > 0 THEN DVS MINST ETT AV FELTENE ER UTFYLT        00013950
             DO;                                                        00013960
               IF EN_INNTEKT.PENSJONSINNT_SØKER =  999999   THEN        00013970
                  B02.PENSJONSINNTEKT(SØKER_IND) = 0;                   00013980
               IF EN_INNTEKT.PENSJONSINNT_EK    =  999999   THEN        00013990
                  B02.PENSJONSINNTEKT_EK        = 0;                    00014000
               IF EN_INNTEKT.ARBEIDSINNT_SØKER  =  999999   THEN        00014010
                  B02.ARBEIDSINNTEKT(SØKER_IND) = 0;                    00014020
               IF EN_INNTEKT.ARBEIDSINNT_EK     =  999999   THEN        00014030
                  B02.ARBEIDSINNTEKT_EK         = 0;                    00014040
             END; */                                                    00014050
         /* TRUDE,280994 */                                             00014060
          IF B02.PENSJONSTYPE1(SØKER_IND)  = 'A' !                      00014070
             B02.PENSJONSTYPE1(SØKER_IND)  = 'K' THEN                   00014080
            DO;                                                         00014090
              ALDER = F_ALDER((B02.FNR(SØKER_IND)),ENS.VIRK_DATO_MÅ);   00014100
              IF ALDER < 7001    THEN                                   00014110
                DO;                                                     00014120
                   B02.FAI_DATO_ÅM(SØKER_IND) =                         00014130
                                          B02.VIRK_DATO_ÅM(SØKER_IND);  00014140
                   B02.FAI(SØKER_IND) =   B02.ARBEIDSINNTEKT(SØKER_IND);00014150
                END;                                                    00014160
            END;                                                        00014170
       END;                                                             00014180
    ELSE                                                                00014190
    IF EN_INNTEKT.PENSJONSINNT_SØKER ^=  999999     !                   00014200
       EN_INNTEKT.PENSJONSINNT_EK    ^=  999999      !                  00014210
       EN_INNTEKT.ARBEIDSINNT_SØKER ^=   999999      !                  00014220
       EN_INNTEKT.ARBEIDSINNT_EK    ^=   999999       THEN              00014230
             DO;                                                        00014240
 L286:                                                                  00014250
                FEIL_VED_LABEL = '286';                                 00014260
                FEIL_MELD_NR = 490;                                     00014270
                GO TO L999;                                             00014280
             END;                                                       00014290
                                                                        00014300
 /* ***************************************************************** */00014310
 /* OPPDATER SPESIELLE OPPLYSNINGER                                   */00014320
 /* ***************************************************************** */00014330
                                                                        00014340
    IF EN_SPES.STATSBORGER ^= '999' THEN                                00014350
       DO;                                                              00014360
          B02.STATSBORGER (SØKER_IND) = EN_SPES.STATSBORGER;            00014370
          TRANSTYPE = 74;                                               00014380
             FELT_UTFYLT = 1;                                           00014390
       END;                                                             00014400
    IF EN_SPES.BOSTED      ^= '999' THEN                                00014410
       DO;                                                              00014420
          IF B02.BOSATT(SØKER_IND) = 0        &                         00014430
             HJ_VIRKDATO_ÅM > 9212            &                         00014440
             B02.PENSJONSTRYGDET(SØKER_IND)   ^= 'J'   &                00014450
             B02.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1) ^= ' '  &           00014460
             B02.SPESOPPL.UNG_UFØR(SØKER_IND)  ^= 'J'      THEN         00014470
             DO;                                                        00014480
                DO M = 1 TO 7;              /*0997 HL*/                 00014490
                   B02.BUP_GAR_KODE(SØKER_IND,M) = ' ';                 00014500
                   B02.BUP_GARANTI(SØKER_IND,M)  = 0;                   00014510
                END;                                                    00014520
                B01.GT_LOV92(SØKER_IND) = 0;                            00014530
                B02.GT_LOV92(SØKER_IND) = 0;                            00014540
                DIV_PARAM_OMR.SISTE_UFTIDSPUNKT = 'J';                  00014550
                TRANSTYPE = 2;                                          00014560
             END;                                                       00014570
          ELSE                                                          00014580
             TRANSTYPE = 74;                                            00014590
          FELT_UTFYLT = 1;                                              00014600
          B02.BOSATT      (SØKER_IND) = EN_SPES.BOSTED;                 00014610
       END;                                                             00014620
    IF EN_SPES.TP_NORDISK  ^= '9999999'   THEN                          00014630
       IF EN_SPES.TP_NORDISK_LAND = '999'    &                          00014640
          B02.TP_NORDISK_LAND(SØKER_IND) = 0  THEN                      00014650
             DO;                                                        00014660
 L287:                                                                  00014670
                FEIL_VED_LABEL = '287';                                 00014680
                FEIL_MELD_NR = 488;                                     00014690
                GO TO L999;                                             00014700
             END;                                                       00014710
       ELSE                                                             00014720
          DO;                                                           00014730
             B02.TP_NORDISK(SØKER_IND) = EN_SPES.TP_NORDISK;            00014740
             B02.TP_NORDISK_LAND(SØKER_IND) = EN_SPES.TP_NORDISK_LAND;  00014750
             TRANSTYPE = 10;                                            00014760
             FELT_UTFYLT = 1;                                           00014770
          END;                                                          00014780
    IF EN_SPES.PENSJON_EØS ^= '9999999'        THEN                     00014790
       IF B02.PRO_RATA_BEREGNING(SØKER_IND) = ' '    THEN               00014800
             DO;                                                        00014810
 L288:                                                                  00014820
                FEIL_VED_LABEL = '288';                                 00014830
                FEIL_MELD_NR = 489;                                     00014840
                GO TO L999;                                             00014850
             END;                                                       00014860
       ELSE                                                             00014870
          DO;                                                           00014880
             B02.PENSJON_EØS(SØKER_IND) = EN_SPES.PENSJON_EØS;          00014890
             TRANSTYPE = 10;                                            00014900
             FELT_UTFYLT = 1;                                           00014910
          END;                                                          00014920
                                                                        00014930
    IF FELT_UTFYLT = 0 THEN                                             00014940
 L289:                                                                  00014950
       DO;                                                              00014960
          FEIL_VED_LABEL = '289';                                       00014970
          FEIL_MELD_NR   =  265;                                        00014980
       END;                                                             00014990
                                                                        00015000
 IF SØKER_IND < 3        THEN                                           00015010
   DO;                                                                  00015020
 /* RULLERING AV EKTEFELLES INNTEKTER - 9802 HL */                      00015030
    IF B02.ALDERSP.FAI(EKTEF_IND) > 0   THEN                            00015040
       CALL RULL_FAI(B02.G_DATO_ÅM(EKTEF_IND),                          00015050
                     B02.VIRK_DATO_ÅM(EKTEF_IND),                       00015060
                     B02.ALDERSP.FAI(EKTEF_IND));                       00015070
                                                                        00015080
    IF B02.FORSI.PENSJONSINNTEKT(EKTEF_IND) > 0  THEN                   00015090
       B02.FORSI.PENSJONSINNTEKT(EKTEF_IND) =                           00015100
           F_RULL_FORSI(B02.G_DATO_ÅM(EKTEF_IND),                       00015110
                 B02.VIRK_DATO_ÅM(EKTEF_IND),                           00015120
                 B02.FORSI.PENSJONSINNTEKT(EKTEF_IND));                 00015130
                                                                        00015140
    IF B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND) > 0  THEN                    00015150
       B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND) =                            00015160
           F_RULL_FORSI(B02.G_DATO_ÅM(EKTEF_IND),                       00015170
                 B02.VIRK_DATO_ÅM(EKTEF_IND),                           00015180
                 B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND));                  00015190
                                                                        00015200
    IF B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND) > 0  THEN                00015210
       B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND) =                        00015220
           F_RULL_FORSI(B02.G_DATO_ÅM(EKTEF_IND),                       00015230
                  B02.VIRK_DATO_ÅM(EKTEF_IND),                          00015240
                  B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND));             00015250
                                                                        00015260
    IF B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND) > 0  THEN                 00015270
       B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND) =                         00015280
           F_RULL_FORSI(B02.G_DATO_ÅM(EKTEF_IND),                       00015290
                 B02.VIRK_DATO_ÅM(EKTEF_IND),                           00015300
                 B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND));               00015310
    END;                                                                00015320
                                                                        00015330
 L999:                                                                  00015340
    EXEC CICS RETURN;                                                   00015350
                                                                        00015360
                                                                        00015370
 %PAGE;                                                                 00015380
    %INCLUDE R001UE30;  /* MELDING_OM_GIFTEMÅL                     */   00015390
    %INCLUDE R0011440;  /* MELDING_OM_SKILSMISSE                   */   00015400
    %INCLUDE R0011450;  /* MELDING_OM_FLYTTET_SAMMEN               */   00015410
    %INCLUDE R0011460;  /* MELDING_OM_FLYTTET_FRA                  */   00015420
    %INCLUDE R0019902;  /* F_KJØNN                                 */   00015430
    %INCLUDE R0019905;  /* F_ALDER                                 */   00015440
    %INCLUDE R0019913;  /* F_SNU_DATO                              */   00015450
    %INCLUDE R0019924;  /* KOBLE_TO_PERSONER                       */   00015460
    %INCLUDE R0019926;  /* FLYTT_B01_TIL_B02                       */   00015470
    %INCLUDE R0019936;  /* OPPHØR_KOBLING_SKILTE                   */   00015480
    %INCLUDE R0019957;  /* P900_NOR_DATA ( ..FNR.. , ..TKNR..)     */   00015490
    %INCLUDE R0019954;  /* RULL_FORVENTET                          */   00015500
    %INCLUDE R0019967;  /* RULL_FAI                                */   00015510
    %INCLUDE R0019968;  /* F_RULL_FORSI                            */   00015520
   END R01UE20;                                                         00015530
