 /*       SIST ENDRET 13/12-91 14.21.09 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 13/12-91 12.54.04 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 01/12-89 08.56.47 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 12/05-87 09.14.01 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 15/04-86 14.09.57 AV   ANNE                     */00000040
 /*       SIST ENDRET 21/01-86 10.04.59 AV   ANNE                     */00000050
 /*       SIST ENDRET 21/08-85 08.11.48 AV   FARVIK                   */00000060
 /*       SIST ENDRET 21/11-84 16.43.41 AV   FARVIK                   */00000070
 /*       SIST ENDRET 05/10-84 13.36.31 AV   FARVIK                   */00000080
 /*       SIST ENDRET 17/09-84 10.35.34 AV   FARVIK                   */00000090
 /*       SIST ENDRET 11/09-84 14.30.29 AV   FARVIK                   */00000100
 /*       SIST ENDRET 30/08-84 11.30.02 AV   FARVIK                   */00000110
                                                                        00000120
 R00110:                                                                00000130
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000140
 %PAGE;                                                                 00000150
 %INCLUDE S00110;    /*  FB-MAPSETTET                                 */00000160
 %PAGE;                                                                 00000170
 %INCLUDE S00120;    /*  YRKESSKADE-MAPSETTET                 */ /*YS*/ 00000180
 %PAGE;                                                                 00000190
 %INCLUDE P0011001;  /*  TRANS-OMRÅDE FOR FB_PENSJON                  */00000200
 %PAGE;                                                                 00000210
 %INCLUDE P0019906;  /*  TRANS-OPPL-OMRÅDE (BASED)                    */00000220
 %PAGE;                                                                 00000230
 %INCLUDE P0019908;  /*  KOM-OMRÅDE (BASED)                           */00000240
 %PAGE;                                                                 00000250
 %INCLUDE P0019910;  /*  STYRINGS-OMRÅDE (BASED)                      */00000260
 %PAGE;                                                                 00000270
 %INCLUDE P0019912;  /*  DIV_PARAM_OMRÅDE (BASED)                     */00000280
 %PAGE;                                                                 00000290
 %INCLUDE DFHAID;                                                       00000300
 %PAGE;                                                                 00000310
 %INCLUDE DFHBMSCA;                                                     00000320
 %PAGE;                                                                 00000330
   DCL                                                                  00000340
      (BMSMAPBR,COMMAREA_PEKER)        PTR;                             00000350
   DCL                                                                  00000360
      (ADDR,UNSPEC,CSTG,ONCODE,VERIFY,SUBSTR) BUILTIN;                  00000370
   DCL                                                                  00000380
      FØRSTE_GANG      BIT (1)       INIT('1'B),                        00000390
      FEIL_FUNNET      BIT (1),                                         00000400
      ONKODE           PIC'9999',                                       00000410
      CURSOR_POS       FIXED BIN(15) INIT(-1),                          00000420
      ONK DEF ONKODE   CHAR(4),                                         00000430
      FEILKODE         CHAR(4),                                         00000440
      DSNAVN           CHAR(8),                                         00000450
 /*YS*/ HJELPE_MELDING CHAR(78),                                        00000460
      ANT_FEIL_SKREVET FIXED DEC (3);                                   00000470
  %PAGE;                                                                00000480
      ON ERROR SNAP BEGIN       ;                                       00000490
         ON ERROR SYSTEM        ;                                       00000500
         ONKODE   = ONCODE      ;                                       00000510
         FEILKODE = ONK         ;                                       00000520
         DSNAVN   = EIBDS       ;                                       00000530
         GO TO FEILBEH          ;                                       00000540
      END;                                                              00000550
                                                                        00000560
 FEILKODE   = 'FEIL'    ;                                               00000570
 DSNAVN     = '        ';                                               00000580
                                                                        00000590
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00000600
                                                                        00000610
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00000620
                                                                        00000630
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000640
                                                                        00000650
 IF FRA_CICS THEN                                                       00000660
    DO;                                                                 00000670
       KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(                     00000680
                                                KOM_OMR.TRANS_OPPL_OMR);00000690
       KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(                     00000700
                                                KOM_OMR.TRANS_OMR);     00000710
       KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(                     00000720
                                                KOM_OMR.STYRINGS_OMR);  00000730
    END;                                                                00000740
                                                                        00000750
 IF TRANSKODE     = 'R100' THEN                                         00000760
    DO;                                                                 00000770
       ALLOCATE S001101O;                                               00000780
       S001101O.CICS_INFOO  = DIV_PARAM_OMR.CICS_NAVN;                  00000790
       CALL BLANK_FB_MAP;                                               00000800
       BARNE_TAB_POS = '1';                                             00000810
    END;                                                                00000820
                                                                        00000830
 IF HENT_FRAM_MAP THEN                                                  00000840
    DO;                                                                 00000850
       EXEC CICS SEND MAP('S001101') MAPSET ('S001103') MAPONLY         00000860
                                                        SET (BMSMAPBR); 00000870
       ALLOCATE S001101O;                                               00000880
       S001101O.CICS_INFOO  = DIV_PARAM_OMR.CICS_NAVN;                  00000890
    END;                                                                00000900
                                                                        00000910
 RECEIVE_MAP:                                                           00000920
                                                                        00000930
 IF ^HENT_FRAM_MAP THEN                                                 00000940
    DO;                                                                 00000950
 /*YS*/IF TRANSKODE ^= 'R102'  &                                        00000960
 /*YS*/   TRANSKODE ^= 'R103'  THEN                                     00000970
          EXEC CICS RECEIVE MAP('S001101')                              00000980
                                    MAPSET('S001103') SET(BMSMAPBR);    00000990
 /*YS*/ELSE                                                             00001000
 /*YS*/   EXEC CICS RECEIVE MAP('S001201')                              00001010
 /*YS*/                             MAPSET('S001203') SET(BMSMAPBR);    00001020
       CALL BLANK_FB_MELDNR;                                            00001030
 /*YS*/CALL BLANK_FBY_MOR_MELDNR;                                       00001040
 /*YS*/CALL BLANK_FBY_FAR_MELDNR;                                       00001050
       FEIL_MELD_NR = 0;                                                00001060
    END;                                                                00001070
                                                                        00001080
 /*YS*/ IF TRANSKODE = 'R102' !                                         00001090
 /*YS*/    TRANSKODE = 'R103' THEN                                      00001100
 /*YS*/    DO;                                                          00001110
 /*YS*/       IF S001201I.FUNKSJONSKODEL > 0 THEN                       00001120
 /*YS*/          DO;                                                    00001130
 /*YS*/             FUNKSJONSKODE = S001201I.FUNKSJONSKODEI;            00001140
 /*YS*/             EXEC CICS XCTL PROGRAM('R0010301')                  00001150
 /*YS*/                                              COMMAREA(KOM_OMR); 00001160
 /*YS*/          END;                                                   00001170
                                                                        00001180
 /*YS*/       IF S001201I.STYRE_KODEL > 0 THEN                          00001190
 /*YS*/          DO;                                                    00001200
 /*YS*/             STYREKODE = S001201I.STYRE_KODEI;                   00001210
 /*YS*/             TRANSKODE = 'R041';                                 00001220
 /*YS*/             EXEC CICS XCTL PROGRAM('R0010401')                  00001230
 /*YS*/                                              COMMAREA(KOM_OMR); 00001240
 /*YS*/          END;                                                   00001250
 /*YS*/    END;                                                         00001260
 /*YS*/ ELSE                                                            00001270
 /*YS*/    DO;                                                          00001280
                                                                        00001290
              IF S001101I.FUNKSJONSKODEL > 0 THEN                       00001300
                 DO;                                                    00001310
                    FUNKSJONSKODE = S001101I.FUNKSJONSKODEI;            00001320
                    EXEC CICS XCTL PROGRAM('R0010301')                  00001330
                                                     COMMAREA(KOM_OMR); 00001340
                 END;                                                   00001350
                                                                        00001360
              IF S001101I.STYRE_KODEL > 0 THEN                          00001370
                 DO;                                                    00001380
                    STYREKODE = S001101I.STYRE_KODEI;                   00001390
                    TRANSKODE = 'R041';                                 00001400
                    EXEC CICS XCTL PROGRAM('R0010401')                  00001410
                                                     COMMAREA(KOM_OMR); 00001420
                 END;                                                   00001430
 /*YS*/    END;                                                         00001440
                                                                        00001450
 IF EIBAID = DFHPF4  &  BARNE_TAB_POS = '1'  &  FØRSTE_GANG THEN        00001460
    DO;                                                                 00001470
       CALL INFO;                                                       00001480
       HENT_FRAM_MAP = '0'B;                                            00001490
       GOTO RECEIVE_MAP;                                                00001500
    END;                                                                00001510
                                                                        00001520
 IF STYREKODE   ^= 'FB' & FRA_CICS THEN                                 00001530
    TRANSKODE    = 'R041';                                              00001540
 ELSE                                                                   00001550
    DO;                                                                 00001560
       ANT_FEIL_SKREVET = 0;                                            00001570
       FEIL_FUNNET      = '0'B;                                         00001580
       TRANS_RETURKODE  = TRANSKODE;                                    00001590
                                                                        00001600
       SELECT (TRANSKODE);                                              00001610
          WHEN('R100')                                                  00001620
             DO;                                                        00001630
                CALL BLANK_FB_MELDNR;                                   00001640
                CALL BLANK_FB_BARN;                                     00001650
                CALL BLANK_FB_MOR;                                      00001660
                CALL BLANK_FB_FAR;                                      00001670
 /*YS*/         CALL BLANK_FBY_FAR_MELDNR;                              00001680
 /*YS*/         CALL BLANK_FBY_MOR_MELDNR;                              00001690
 /*YS*/         CALL BLANK_FBY_FAR;                                     00001700
 /*YS*/         CALL BLANK_FBY_MOR;                                     00001710
                CALL OVERFØR_FB_BARN;                                   00001720
                CALL OVERFØR_FB_MOR;                                    00001730
                CALL OVERFØR_FB_FAR;                                    00001740
                CALL KONTROLL_FB_SØKER(FEIL_FUNNET);                    00001750
             END;                                                       00001760
          WHEN('R101')                                                  00001770
             DO;                                                        00001780
                CALL BLANK_FB_MELDNR;                                   00001790
                CALL OVERFØR_FB_BARN;                                   00001800
                CALL OVERFØR_FB_MOR;                                    00001810
                CALL OVERFØR_FB_FAR;                                    00001820
                CALL KONTROLL_FB_SØKER(FEIL_FUNNET);                    00001830
             END;                                                       00001840
 /*YS*/   WHEN('R102')                                                  00001850
 /*YS*/      DO;                                                        00001860
 /*YS*/         CALL BLANK_FBY_MOR_MELDNR;                              00001870
 /*YS*/         CALL OVERFØR_FBY_MOR;                                   00001880
 /*YS*/         CALL KONTROLL_FBY_MOR(FEIL_FUNNET);                     00001890
 /*YS*/      END;                                                       00001900
 /*YS*/   WHEN('R103')                                                  00001910
 /*YS*/      DO;                                                        00001920
 /*YS*/         CALL BLANK_FBY_FAR_MELDNR;                              00001930
 /*YS*/         CALL OVERFØR_FBY_FAR;                                   00001940
 /*YS*/         CALL KONTROLL_FBY_FAR(FEIL_FUNNET);                     00001950
 /*YS*/      END;                                                       00001960
          OTHERWISE;                                                    00001970
       /* INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER */00001980
       END;                                                             00001990
                                                                        00002000
       IF FEIL_FUNNET ! HENT_FRAM_MAP ! FRA_UTEN_DIALOG !               00002010
          TRANS_RETURKODE ^= TRANSKODE THEN                             00002020
          DO;                                                           00002030
 /*YS*/      IF TRANSKODE ^= 'R102' &                                   00002040
 /*YS*/         TRANSKODE ^= 'R103' THEN                                00002050
 /*YS*/         DO;                                                     00002060
                   IF TRANSKODE = 'R100' THEN                           00002070
                      TRANSKODE = 'R101';                               00002080
                   CALL BLANK_FB_MAP;                                   00002090
                   CALL OVERFØR_FB_BARN_MAP;                            00002100
                   CALL OVERFØR_FB_MOR_MAP;                             00002110
                   CALL OVERFØR_FB_FAR_MAP;                             00002120
                   IF HENT_FRAM_MAP THEN                                00002130
                      EXEC CICS SEND MAP('S001101') MAPSET('S001103')   00002140
                                                    ERASE CURSOR;       00002150
                   ELSE                                                 00002160
                      EXEC CICS SEND MAP('S001101') MAPSET('S001103')   00002170
                                              DATAONLY ERASEAUP CURSOR; 00002180
 /*YS*/         END;                                                    00002190
 /*YS*/      ELSE                                                       00002200
 /*YS*/         DO;                                                     00002210
 /*YS*/            CALL BLANK_FBY_MAP;                                  00002220
 /*YS*/            IF TRANSKODE = 'R102' THEN                           00002230
 /*YS*/               CALL OVERFØR_FBY_MOR_MAP;                         00002240
 /*YS*/            ELSE                                                 00002250
 /*YS*/               CALL OVERFØR_FBY_FAR_MAP;                         00002260
 /*YS*/            IF HENT_FRAM_MAP THEN                                00002270
 /*YS*/               EXEC CICS SEND MAP('S001201') MAPSET('S001203')   00002280
 /*YS*/                                             ERASE CURSOR;       00002290
 /*YS*/            ELSE                                                 00002300
 /*YS*/               EXEC CICS SEND MAP('S001201') MAPSET('S001203')   00002310
 /*YS*/                                    DATAONLY ERASEAUP CURSOR;    00002320
 /*YS*/         END;                                                    00002330
                                                                        00002340
             HENT_FRAM_MAP = '0'B;                                      00002350
             FEIL_MELD_NR  = 666;/* => FEIL_FUNNET ER SATT. */          00002360
                                                                        00002370
             IF FRA_CICS THEN                                           00002380
                EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);  00002390
             ELSE                                                       00002400
                GOTO RECEIVE_MAP;                                       00002410
          END;                                                          00002420
       ELSE                                                             00002430
          DO;                                                           00002440
 /*YS*/ /* ********************************************************** */00002450
 /*YS*/ /* KONTROLLEN FOR FORELDRELØSE BARN ER FERDIG.  DERSOM MOR    */00002460
 /*YS*/ /* OG/ELLER FAR ER DØD PGA YRKESSKADE, PREUTFYLLES YRKESSKADE-*/00002470
 /*YS*/ /* BILDET.                                                    */00002480
 /*YS*/ /* ********************************************************** */00002490
                                                                        00002500
 /*YS*/      IF TRANSKODE ^= 'R102' &                                   00002510
 /*YS*/         TRANSKODE ^= 'R103' &                                   00002520
 /*YS*/         YSKADE_TILLEGG_M = 'J' THEN                             00002530
 /*YS*/         DO;                                                     00002540
 /*YS*/            ALLOCATE S001201O;                                   00002550
                   S001201O.CICS_INFOO  = DIV_PARAM_OMR.CICS_NAVN;      00002560
 /*YS*/            S001201O.FNRO   = F_FELT_PIC_CHAR11(FNR_M);          00002570
 /*YS*/            S001201O.TKNRO  = F_FELT_PIC_CHAR4(TKNR(1));         00002580
 /*YS*/            S001201O.NAVNO  = NAVN_M;                            00002590
 /*YS*/            S001201O.VIRK_DATOO = F_FELT_PIC_CHAR4(VIRK_DATO_MÅ);00002600
 /*YS*/            S001201O.FNR_Y_BARNO = F_FELT_PIC_CHAR11(FNR_B(1));  00002610
                                                                        00002620
 /*YS*/            IF FUNKSJONSKODE   = 'V'   THEN                      00002630
 /*YS*/               CALL OVERFØR_FBY_MOR_MAP;                         00002640
                                                                        00002650
 /*YS*/            EXEC CICS SEND MAP('S001201') MAPSET('S001203')      00002660
 /*YS*/                                          ERASE;                 00002670
 /*YS*/            TRANSKODE = 'R102';                                  00002680
 /*YS*/            HENT_FRAM_MAP = '0'B;                                00002690
                                                                        00002700
 /*YS*/            IF FRA_CICS           THEN                           00002710
 /*YS*/               EXEC CICS RETURN TRANSID(TRANSKODE)               00002720
 /*YS*/                                COMMAREA(KOM_OMR);               00002730
 /*YS*/            ELSE                                                 00002740
 /*YS*/               GOTO RECEIVE_MAP;                                 00002750
                                                                        00002760
 /*YS*/         END;                                                    00002770
 /*YS*/      ELSE                                                       00002780
 /*YS*/         IF TRANSKODE ^= 'R103' &                                00002790
 /*YS*/            YSKADE_TILLEGG_F = 'J' THEN                          00002800
 /*YS*/            DO;                                                  00002810
 /*YS*/               ALLOCATE S001201O;                                00002820
                      S001201O.CICS_INFOO  = DIV_PARAM_OMR.CICS_NAVN;   00002830
 /*YS*/               S001201O.FNRO   = F_FELT_PIC_CHAR11(FNR_F);       00002840
 /*YS*/               S001201O.TKNRO  = F_FELT_PIC_CHAR4(TKNR(1));      00002850
 /*YS*/               S001201O.NAVNO  = NAVN_F;                         00002860
 /*YS*/               S001201O.VIRK_DATOO  =                            00002870
 /*YS*/                                  F_FELT_PIC_CHAR4(VIRK_DATO_MÅ);00002880
 /*YS*/               S001201O.FNR_Y_BARNO =                            00002890
 /*YS*/                                    F_FELT_PIC_CHAR11(FNR_B(1)); 00002900
                                                                        00002910
 /*YS*/               IF FUNKSJONSKODE   = 'V'   THEN                   00002920
 /*YS*/                  CALL OVERFØR_FBY_FAR_MAP;                      00002930
                                                                        00002940
 /*YS*/               EXEC CICS SEND MAP('S001201') MAPSET('S001203')   00002950
 /*YS*/                                             ERASE;              00002960
 /*YS*/               TRANSKODE = 'R103';                               00002970
 /*YS*/               HENT_FRAM_MAP = '0'B;                             00002980
                                                                        00002990
 /*YS*/               IF FRA_CICS           THEN                        00003000
 /*YS*/                  EXEC CICS RETURN TRANSID(TRANSKODE)            00003010
 /*YS*/                                COMMAREA(KOM_OMR);               00003020
 /*YS*/               ELSE                                              00003030
 /*YS*/                  GOTO RECEIVE_MAP;                              00003040
                                                                        00003050
 /*YS*/            END;                                                 00003060
 /*YS*/                                                                 00003070
             IF TRANSKODE = 'R100' THEN                                 00003080
                TRANS_RETURKODE = 'R101';                               00003090
             ELSE                                                       00003100
                TRANS_RETURKODE = TRANSKODE;                            00003110
             IF FRA_CICS THEN                                           00003120
                DO;                                                     00003130
                   BLANKETTYPE = STYREKODE;                             00003140
                   TRANSKODE = 'R042';                                  00003150
                END;                                                    00003160
          END;                                                          00003170
    END;                                                                00003180
                                                                        00003190
  CALL UTGANG;                                                          00003200
                                                                        00003210
  UTGANG: PROC;                                                         00003220
    IF FRA_CICS THEN                                                    00003230
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00003240
    ELSE                                                                00003250
       EXEC CICS RETURN;                                                00003260
  END UTGANG;                                                           00003270
                                                                        00003280
  INFO:   PROC;                                                         00003290
                                                                        00003300
     SELECT (TRANSKODE);                                                00003310
        WHEN('R100')                                                    00003320
           DO;                                                          00003330
              CALL BLANK_FB_MELDNR;                                     00003340
              CALL BLANK_FB_BARN;                                       00003350
              CALL BLANK_FB_MOR;                                        00003360
              CALL BLANK_FB_FAR;                                        00003370
              CALL OVERFØR_FB_BARN;                                     00003380
              CALL OVERFØR_FB_MOR;                                      00003390
              CALL OVERFØR_FB_FAR;                                      00003400
           END;                                                         00003410
                                                                        00003420
        WHEN('R101')                                                    00003430
           DO;                                                          00003440
              CALL BLANK_FB_MELDNR;                                     00003450
              CALL OVERFØR_FB_BARN;                                     00003460
              CALL OVERFØR_FB_MOR;                                      00003470
              CALL OVERFØR_FB_FAR;                                      00003480
           END;                                                         00003490
                                                                        00003500
        OTHERWISE;                                                      00003510
     END;                                                               00003520
                                                                        00003530
                                                                        00003540
                                                                        00003550
     EXEC CICS SEND MAP('S001102') MAPSET('S001103')                    00003560
                                   MAPONLY ERASE ;                      00003570
                                                                        00003580
     EXEC CICS RECEIVE MAP('S001102')                                   00003590
                                   MAPSET('S001103');                   00003600
                                                                        00003610
     IF S001102I.FUNKSJONSKODEL > 0 THEN                                00003620
        DO;                                                             00003630
           FUNKSJONSKODE = S001102I.FUNKSJONSKODEI;                     00003640
           EXEC CICS XCTL PROGRAM('R0010301')                           00003650
                                         COMMAREA(KOM_OMR) ;            00003660
        END;                                                            00003670
                                                                        00003680
     IF S001102I.STYRE_KODEL > 0 THEN                                   00003690
        DO;                                                             00003700
           STYREKODE = S001102I.STYRE_KODEI;                            00003710
           TRANSKODE = 'R041';                                          00003720
           EXEC CICS XCTL PROGRAM('R0010401')                           00003730
                                         COMMAREA(KOM_OMR);             00003740
        END;                                                            00003750
                                                                        00003760
                                                                        00003770
                                                                        00003780
     ALLOCATE S001101O;                                                 00003790
     ALLOCATE S001101I;                                                 00003800
    S001101O.CICS_INFOO  = DIV_PARAM_OMR.CICS_NAVN;                     00003810
                                                                        00003820
     IF TRANSKODE = 'R100' THEN                                         00003830
        TRANSKODE = 'R101';                                             00003840
                                                                        00003850
                                                                        00003860
     CALL BLANK_FB_MAP;                                                 00003870
     CALL OVERFØR_FB_BARN_MAP;                                          00003880
                                                                        00003890
     IF FNR_M ^= 0 THEN                                                 00003900
        DO;                                                             00003910
           CALL OVERFØR_FB_MOR_MAP;                                     00003920
           CALL OVERFØR_FB_FAR_MAP;                                     00003930
        END;                                                            00003940
                                                                        00003950
     EXEC CICS SEND MAP('S001101') MAPSET('S001103') MAPONLY ERASE;     00003960
                                                                        00003970
     EXEC CICS SEND MAP('S001101') MAPSET('S001103') DATAONLY ERASEAUP; 00003980
                                                                        00003990
     FØRSTE_GANG = '0'B ;                                               00004000
                                                                        00004010
  END INFO;                                                             00004020
                                                                        00004030
  FEILBEH:                                                              00004040
                                                                        00004050
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00004060
                                                                        00004070
     PROGRAM_ID = 'R0011001';                                           00004080
                                                                        00004090
     ALLOCATE S001101O;                                                 00004100
     S001101O.CICS_INFOO  = DIV_PARAM_OMR.CICS_NAVN;                    00004110
                                                                        00004120
     S001101O.MELDING2O =                                               00004130
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00004140
                                                                        00004150
     S001101O.MELDING3O =                                               00004160
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00004170
                                                                        00004180
     S001101O.MELDING4O =                                               00004190
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00004200
                                         !! '. DATASETT : ' !! DSNAVN;  00004210
                                                                        00004220
     S001101O.MELDING5O =                                               00004230
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00004240
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00004250
                                                                        00004260
     S001101O.MELDING6O =                                               00004270
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00004280
                                                                        00004290
                                                                        00004300
     EXEC CICS SEND MAP('S001101')                                      00004310
                                                 MAPSET('S001103');     00004320
                                                                        00004330
     EXEC CICS RECEIVE MAP('S001101')                                   00004340
                                    MAPSET('S001103') SET(BMSMAPBR);    00004350
                                                                        00004360
                                                                        00004370
     EXEC CICS SYNCPOINT ROLLBACK;                                      00004380
                                                                        00004390
                                                                        00004400
     TERMINERINGS_IND = 'F';                                            00004410
                                                                        00004420
     TRANSKODE  = 'R041';                                               00004430
                                                                        00004440
     CALL UTGANG;                                                       00004450
                                                                        00004460
  ABEND:                                                                00004470
     EXEC CICS ABEND ABCODE(FEIL);                                      00004480
                                                                        00004490
  PF1:                                                                  00004500
                                                                        00004510
 /* LEGGER UNDERKJENT TRANS UT PÅ VENTEDATABASE HVIS GYLDIG     */      00004520
 /* FNR OG VIRKNINGSDATO,ELLERS FORKASTES TRANSAKSJONEN.        */      00004530
                                                                        00004540
     IF ^(BARN.FNR_BNR(1) = 1          !                                00004550
          BARN.FNR_BNR(1) = 200        !                                00004560
          BARN_GEN.VIRK_DATO_MÅNR = 9  !                                00004570
          BARN_GEN.VIRK_DATO_MÅNR = 10 !                                00004580
          BARN_GEN.VIRK_DATO_MÅNR = 200) THEN                           00004590
        DO;                                                             00004600
                                                                        00004610
           IF FØDSNUMMER    = 0   THEN                                  00004620
                                                                        00004630
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER FORKASTET.           */      00004640
                                                                        00004650
              DO;                                                       00004660
                 FEIL_MELD_NR  = 0;                                     00004670
 /*YS*/          HJELPE_MELDING =                                       00004680
                         'REGISTERINGEN ER IKKE AVSLUTTET MED "ENTER"'!!00004690
                         '.TRANSAKSJONEN ER FORKASTET.';                00004700
                                                                        00004710
              END;                                                      00004720
           ELSE                                                         00004730
              DO;                                                       00004740
                                                                        00004750
                 SEARCH_FNR  = TRANS_OPPL_OMR.FØDSNUMMER;               00004760
                 IF FRA_CICS THEN                                       00004770
                    BLANKETTYPE = STYREKODE;                            00004780
                                                                        00004790
                                                                        00004800
                 IF FEIL_MELD_NR = 666 &      /*BLANKETTKONTROLLFEIL*/  00004810
                    ^FRA_MED_DIALOG     THEN  /*IKKE BASEKONTROLLFEIL*/ 00004820
                    FUNKSJONSKODE = 'B';                                00004830
                                                                        00004840
                 EXEC CICS LINK PROGRAM('R0010490') COMMAREA(KOM_OMR);  00004850
                                                                        00004860
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER LAGT UT PÅ VENTEBASE.*/      00004870
                                                                        00004880
 /*YS*/          HJELPE_MELDING =                                       00004890
                         'TRANSAKSJONEN ER LAGT UT PÅ VENTEREGISTER.';  00004900
              END;                                                      00004910
                                                                        00004920
 /*YS*/    IF TRANSKODE ^= 'R102' &                                     00004930
 /*YS*/       TRANSKODE ^= 'R103' THEN                                  00004940
 /*YS*/       DO;                                                       00004950
 /*YS*/          S001101O.MELDING6O = HJELPE_MELDING;                   00004960
                                                                        00004970
                 EXEC CICS SEND MAP('S001101') MAPSET('S001103')        00004980
                                                           DATAONLY;    00004990
     /* DUMMY SEND-KALL.                              */                00005000
                                                                        00005010
                 EXEC CICS SEND MAP('S001101')                          00005020
                                                  MAPSET('S001103');    00005030
 /*YS*/       END;                                                      00005040
 /*YS*/    ELSE                                                         00005050
 /*YS*/       DO;                                                       00005060
 /*YS*/          S001201O.YMELDING6O =  HJELPE_MELDING;                 00005070
 /*YS*/          EXEC CICS SEND MAP('S001201') MAPSET('S001203')        00005080
 /*YS*/                                                    DATAONLY;    00005090
 /*YS*/ /* DUMMY SEND-KALL.                         */                  00005100
 /*YS*/                                                                 00005110
 /*YS*/          EXEC CICS SEND MAP('S001201')                          00005120
 /*YS*/                                           MAPSET('S001203');    00005130
 /*YS*/       END;                                                      00005140
                                                                        00005150
           EXEC CICS DELAY INTERVAL(005);                               00005160
                                                                        00005170
           TERMINERINGS_IND = 'F';                                      00005180
                                                                        00005190
           TRANSKODE  = 'R041';                                         00005200
                                                                        00005210
           CALL UTGANG;                                                 00005220
                                                                        00005230
        END;                                                            00005240
     ELSE                                                               00005250
        DO;                                                             00005260
           TERMINERINGS_IND = 'F';                                      00005270
                                                                        00005280
           TRANSKODE = 'R041';                                          00005290
                                                                        00005300
 /*YS*/    HJELPE_MELDING =                                             00005310
                                                                        00005320
   'NB** TRANSAKSJONEN ER FORKASTET P.G.A. UGYLDIG FNR EL. VDATO **NB'; 00005330
                                                                        00005340
 /*YS*/    IF TRANSKODE ^= 'R102' &                                     00005350
 /*YS*/       TRANSKODE ^= 'R103' THEN                                  00005360
 /*YS*/       DO;                                                       00005370
 /*YS*/          S001101O.MELDING6O = HJELPE_MELDING;                   00005380
                 EXEC CICS SEND MAP('S001101') MAPSET('S001103')        00005390
                                                           DATAONLY;    00005400
     /* DUMMY SEND-KALL.                            */                  00005410
                                                                        00005420
                 EXEC CICS SEND MAP('S001101')                          00005430
                                    MAPSET('S001103');                  00005440
 /*YS*/       END;                                                      00005450
 /*YS*/    ELSE                                                         00005460
 /*YS*/       DO;                                                       00005470
 /*YS*/          S001201O.YMELDING6O = HJELPE_MELDING;                  00005480
 /*YS*/          EXEC CICS SEND MAP('S001201') MAPSET('S001203')        00005490
 /*YS*/                                                    DATAONLY;    00005500
 /*YS*/ /* DUMMY SEND-KALL.                         */                  00005510
 /*YS*/                                                                 00005520
 /*YS*/          EXEC CICS SEND MAP('S001201')                          00005530
 /*YS*/                             MAPSET('S001203');                  00005540
 /*YS*/       END;                                                      00005550
                                                                        00005560
           EXEC CICS DELAY INTERVAL(005);                               00005570
           CALL UTGANG;                                                 00005580
        END;                                                            00005590
                                                                        00005600
                                                                        00005610
  PF2:                                                                  00005620
     TERMINERINGS_IND   = 'F';                                          00005630
                                                                        00005640
 /*YS*/HJELPE_MELDING =                                                 00005650
      'NBNBNBNBNB***    TRANSAKSJONEN ER FORKASTET.    ***NBNBNBNBNB';  00005660
                                                                        00005670
 /*YS*/ IF TRANSKODE ^= 'R102' &                                        00005680
 /*YS*/    TRANSKODE ^= 'R103' THEN                                     00005690
 /*YS*/    DO;                                                          00005700
 /*YS*/       S001101O.MELDING6O = HJELPE_MELDING;                      00005710
              EXEC CICS SEND MAP('S001101') MAPSET('S001103')           00005720
                                                      DATAONLY ;        00005730
     /* DUMMY SEND-KALL.                                     */         00005740
                                                                        00005750
              EXEC CICS SEND MAP('S001101')                             00005760
                                    MAPSET('S001103');                  00005770
 /*YS*/    END;                                                         00005780
 /*YS*/ ELSE                                                            00005790
 /*YS*/    DO;                                                          00005800
 /*YS*/       S001201O.YMELDING6O  = HJELPE_MELDING;                    00005810
 /*YS*/       EXEC CICS SEND MAP('S001201') MAPSET('S001203')           00005820
 /*YS*/                                               DATAONLY ;        00005830
 /*YS*/ /* DUMMY SEND-KALL.                                  */         00005840
 /*YS*/                                                                 00005850
 /*YS*/       EXEC CICS SEND MAP('S001201')                             00005860
 /*YS*/                             MAPSET('S001203');                  00005870
 /*YS*/    END;                                                         00005880
                                                                        00005890
     EXEC CICS DELAY INTERVAL(005);                                     00005900
                                                                        00005910
                                                                        00005920
     TRANSKODE = 'R041';                                                00005930
                                                                        00005940
     CALL UTGANG;                                                       00005950
                                                                        00005960
                                                                        00005970
                                                                        00005980
 %PAGE;                                                                 00005990
 %INCLUDE R0011002;  /*  BLANK  ARBEIDSOMRÅDE                      */   00006000
 %PAGE;                                                                 00006010
 %INCLUDE R0011003;  /*  KONTROLL AV SØKERDELEN                    */   00006020
 %PAGE;                                                                 00006030
 %INCLUDE R0011006;  /*  ARBEIDSOMRÅDE -> MAP                      */   00006040
 %PAGE;                                                                 00006050
 %INCLUDE R0011009;  /*  MAP -> ARBEIDSOMRÅDE                      */   00006060
 %PAGE;                                                                 00006070
 %INCLUDE R0019901;  /*  TESTER OM DATO ER GYLDIG                  */   00006080
 %PAGE;                                                                 00006090
 %INCLUDE R0019902;  /*  FINNE KJØNN                               */   00006100
 %PAGE;                                                                 00006110
 %INCLUDE R0019904;  /*  FØDSELSNUMMERKONTROLL                     */   00006120
 %PAGE;                                                                 00006130
 %INCLUDE R0019905;  /*  BERGNER ALDER                             */   00006140
 %PAGE;                                                                 00006150
 %INCLUDE R0019908;  /*  DAGENS DATO PLUSS 1                       */   00006160
 %PAGE;                                                                 00006170
 %INCLUDE R0019909;  /*  KONTROLL_TT                               */   00006180
 %PAGE;                                                                 00006190
 %INCLUDE R0019910;  /*  NUMERISK KONTROLL                         */   00006200
 %PAGE;                                                                 00006210
 %INCLUDE R0019911;  /*  DATO KONTROLL                             */   00006220
 %PAGE;                                                                 00006230
 %INCLUDE R0019912;  /*  KONVERTERING CHAR ==> PIC / PIC ==> CHAR  */   00006240
 %PAGE;                                                                 00006250
 %INCLUDE R0019913;  /*  F_SNU_DATA                                */   00006260
 %PAGE;                                                                 00006270
 %INCLUDE R0019942;  /*  SNU DØDSDATO (ELLER ANDRE DATOER PIC(6))  */   00006280
 %PAGE;                                                                 00006290
 %INCLUDE R0019944;  /*  SKRIV FEIL                                */   00006300
 %PAGE;                                                                 00006310
 %INCLUDE R0019963;  /*  SKRIV_FEIL_YP                     */  /*YS*/   00006320
 %PAGE;                                                                 00006330
 %INCLUDE R0010508;  /*  BEREGN TT AF                              */   00006340
 %PAGE;                                                                 00006350
 %INCLUDE R0010608;  /*  BEREGN TT UF                              */   00006360
 END R00110;                                                            00006370
