 /*       SIST ENDRET 13/03-98 13.34.28 AV   JDA7339                  */00000000
 /*       SIST ENDRET 13/03-98 13.19.40 AV   JDA7339                  */00000010
 /*       SIST ENDRET 26/01-98 09.09.18 AV   HLA7339                  */00000020
 /*       SIST ENDRET 28/07-97 12.32.22 AV   HLA7339                  */00000030
 /*       SIST ENDRET 09/01-96 08.47.22 AV   JDA0310                  */00000040
 /*       SIST ENDRET 26/09-94 11.12.35 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 05/09-94 09.59.59 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 28/07-94 13.21.01 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 25/02-94 13.06.39 AV   HERMAN                   */00000080
 /*       SIST ENDRET 26/04-91 12.30.19 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 21/01-91 13.25.08 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 05/07-90 09.43.10 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 25/08-89 15.04.09 AV   HERMAN                   */00000120
 /*       SIST ENDRET 14/04-89 14.41.09 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 14/12-88 14.12.39 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 09/01-85 12.00.21 AV   KARIN                    */00000150
 /*       SIST ENDRET 30/08-84 08.42.19 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 16/08-84 09.15.39 AV   FARVIK                   */00000170
 /*       SIST ENDRET 12/06-84 12.09.20 AV   KARIN                    */00000180
 /*       SIST ENDRET 04/01-84 10.25.04 AV   HERMAN                   */00000190
 /*       SIST ENDRET 02/12-83 07.13.22 AV   FARVIK                   */00000200
 /*       SIST ENDRET 23/11-83 15.21.06 AV   HERMAN                   */00000210
 /*       SIST ENDRET 23/11-83 08.43.31 AV   FARVIK                   */00000220
 /*       SIST ENDRET 10/11-83 14.14.54 AV   FARVIK                   */00000230
 /*       SIST ENDRET 08/11-83 13.39.43 AV   FARVIK                   */00000240
 /* **************************************************************** */ 00000250
 /*IDENTIFIKASJON:                                                   */ 00000260
 /*    R0010520 - PROSEDYRE I PLI                                    */ 00000270
 /*    PROGRAMMERER: GEIR, OKTOBER 1981                              */ 00000280
 /* **************************************************************** */ 00000290
 /*SIST ENDRET 5/6-84 AV KARIN                                       */ 00000300
 /*    ENDRINGEN GJELDER REDUSERT BARNETILLEGG - DVS ENDREDE         */ 00000310
 /*    PK2-KODER FOR EKTEFELLE OG BARN                               */ 00000320
 /* **************************************************************** */ 00000330
 /*SIST ENDRET 9/1-85 AV KARIN                                       */ 00000340
 /*    ENDRINGEN GJELDER NYE KODER I STATUS-TYPE, SE KOMMENTARER     */ 00000350
 /*    I PROGRAMMET                                                  */ 00000360
 /*    ENDRINGEN GJELDER OGSÅ SAVING AV STATUS-TYPE FOR SØKER        */ 00000370
 /*    SOM DER SKAL TESTES PÅ I R0010521.                            */ 00000380
 /* **************************************************************** */ 00000390
 /*HENSIKT:                                                          */ 00000400
 /*    KONTROLLERE APTRANS MOT STATUS FAMILIEFORHOLD.                */ 00000410
 /*    RUTINEN KONTROLLERER ALLE PERSONER I TRANSAKSJONEN MOT        */ 00000420
 /*    INFORMASJON I REGISTERET. FOR HVER FAMILIEPERSON SOM GÅR      */ 00000430
 /*    FEILFRI GJENNOM KONTROLLENE BLIR DET OPPRETTET NY STATUS      */ 00000440
 /*    FOR PERSONEN, OG SØKERENS STATUS OPPDATERES.                  */ 00000450
 /*PROGRAMTILKNYTNING:                                               */ 00000460
 /*    KALLES OPP AV PROGRAM R0013520                                */ 00000470
 /*BRUK:                                                             */ 00000480
 /*    EXEC CICS XCTL PROGRAM ('R0010520') COMMAREA (KOM_OMR)        */ 00000490
 /*                                                                  */ 00000500
 /*ENDRING :                                                         */ 00000510
 /*    INCLUDE På R0019922 ER FJERNET 4.1.84. (INGEN CALL På PROG.)  */ 00000520
 /*    HERMAN.                                                       */ 00000530
 /* **************************************************************** */ 00000540
 %PAGE;                                                                 00000550
  KON_AP:                                                               00000560
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000570
 %SKIP;                                                                 00000580
      %INCLUDE P0019908;                                                00000590
      %INCLUDE P0019906;                                                00000600
      %INCLUDE P0010501;                                                00000610
      %INCLUDE P0019910;                                                00000620
      %INCLUDE P0019912;                                                00000630
 %PAGE;                                                                 00000640
      DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                    00000650
      DCL  COMMAREA_PEKER PTR;                                          00000660
 %PAGE;                                                                 00000670
      DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                    00000680
 %PAGE;                                                                 00000690
   DCL                                                                  00000700
      BARN_IND            FIXED BIN          (15),                      00000710
      IND                 FIXED BIN          (15),                      00000720
      I                   FIXED BIN          (15),                      00000730
      J                   FIXED BIN          (15),                      00000740
      ( DATE , CSTG  )    BUILTIN,                                      00000750
      DATO_ÅMD            CHAR                 (6),                     00000760
      DAGENS_DATO_ÅM DEF DATO_ÅMD POS(1) PIC '9999',                    00000770
      DAGENS_DATO_DAG DEF DATO_ÅMD POS(5) PIC '99',                     00000780
      DAGENS_DATO_1MND DEF DATO_ÅMD POS(3) PIC'99',                     00000790
      DAGENS_DATO_1ÅR  DEF DATO_ÅMD POS(1) PIC'99',                     00000800
      TILLEGG             PIC                  '9',                     00000810
      SISTE_UTTAKSDATO_ÅM DEC FIXED            (4),                     00000820
      HJ_VIRK_DATO_ÅM     PIC               '(4)9',                     00000830
      MAX BUILTIN;                                                      00000840
   DCL                                                                  00000850
      T_FNR               PIC              '(11)9';                     00000860
   DCL                                                                  00000870
      1 NR DEF T_FNR,                                                   00000880
         2 DG             PIC                 '99',                     00000890
         2 MN             PIC                 '99',                     00000900
         2 ÅR             PIC                 '99',                     00000910
         2 PERSNR,                                                      00000920
            3 ÅRHUNDRE    PIC                '999',                     00000930
            3 REST        PIC                 '99';                     00000940
   DCL                                                                  00000950
      SEKSTISJU_ÅRSDATO   PIC               '(4)9';                     00000960
   DCL                                                                  00000970
      STATUS_TYPE_SØKER   CHAR(1);                                      00000980
 %PAGE;                                /*    */                         00000990
                                                                        00001000
 /* **************************************************************** */ 00001010
 /* PROGRAMMET STARTER HER.                                          */ 00001020
 /* **************************************************************** */ 00001030
                                                                        00001040
      PROGRAM_ID = 'R0010520';                                          00001050
      IND        = 0;                                                   00001060
      T_FNR           = APS.FNR;                                        00001070
      HJ_VIRK_DATO_ÅM = F_SNU_DATO(TRANS_OMR.VIRK_DATO_MÅ);             00001080
 %SKIP;                                                                 00001090
                                                                        00001100
 /* **************************************************************** */ 00001110
 /*  REGNER UT ÅR OG MND VEDKOMMENDE FYLLER 67 ÅR (ÅÅMM). SIFFER     */ 00001120
 /*  7-9 ANGIR ÅRHUNDRE: 1800-TALLET 500-749, 1900-TALLET 000-499    */ 00001130
 /* **************************************************************** */ 00001140
                                                                        00001150
      IF ÅRHUNDRE <= '499' THEN                                         00001160
         SEKSTISJU_ÅRSDATO = (ÅR + 67) * 100 + MN;                      00001170
      ELSE                                                              00001180
         SEKSTISJU_ÅRSDATO = ((ÅR + 67) - 100) * 100 + MN;              00001190
 %SKIP(2);                                                              00001200
      SISTE_UTTAKSDATO_ÅM =                                             00001210
      MAX(B01.ALDERSP.UTTAKSDATO_ÅM(SØKER_IND),                         00001220
                       B01.VENTØVR.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,1),   00001230
                       B01.VENTØVR.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,2),   00001240
                       B01.VENTØVR.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,3),   00001250
                       B01.VENTØVR.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,4),   00001260
                       B01.VENTØVR.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,5));  00001270
 %PAGE;                                /*     */                        00001280
      TRANSTYPE = 1;                                                    00001290
      DATO_ÅMD  = DATE;                                                 00001300
 /*   IF DAGENS_DATO_DAG > 19 THEN   */                                 00001310
         TILLEGG = 2;                                                   00001320
 /*   ELSE                           */                                 00001330
 /*      TILLEGG = 1;                */                                 00001340
      DAGENS_DATO_1MND = DAGENS_DATO_1MND + TILLEGG;                    00001350
      IF DAGENS_DATO_1MND > 12 THEN                                     00001360
         DO;                                                            00001370
             DAGENS_DATO_1MND = DAGENS_DATO_1MND - 12;                  00001380
             DAGENS_DATO_1ÅR  = DAGENS_DATO_1ÅR  + 1;                   00001390
         END;                                                           00001400
      IF HJ_VIRK_DATO_ÅM > DAGENS_DATO_ÅM THEN                          00001410
        DO;                                                             00001420
  L100:                                                                 00001430
           FEIL_VED_LABEL = '100';                                      00001440
           FEIL_MELD_NR   = 10;                                         00001450
           GO TO L999;                                                  00001460
        END;                                                            00001470
                                                                        00001480
                                                                        00001490
 /* **************************************************************** */ 00001500
 /* DERSOM SØKER HAR PENSJONSSTATUS.                                 */ 00001510
 /* **************************************************************** */ 00001520
                                                                        00001530
                                                                        00001540
 /* 9/1-85      KARIN     */                                            00001550
                                                                        00001560
      STATUS_TYPE_SØKER = STATUS_TYPE;                                  00001570
                                                                        00001580
 /* 9/1-85      KARIN     */                                            00001590
      IF STATUS_TYPE_SØKER  = 'B' !                                     00001600
         STATUS_TYPE_SØKER  = 'D' !                                     00001610
         STATUS_TYPE_SØKER  = 'G' THEN                                  00001620
         DO;                                                            00001630
            /* *********************************************** */       00001640
            /* ETTERFØLGENDE TESTER GJELDER DISSE STATUS-TYPER */       00001650
            /* - B - BYGGER PÅ SISTE STATUS                    */       00001660
            /* - D - BYGGER PÅ NEST SISTE STATUS               */       00001670
            /* - G - BYGGER PÅ NEST SISTE STATUS, ER OPPHØRT   */       00001680
            /*       I SISTE STATUS MED X (IKKE DØD)           */       00001690
            /* *********************************************** */       00001700
            IF B01.TKNR(SØKER_IND) > 0 THEN                             00001710
               IF B01.TKNR(SØKER_IND) ^= APS.TKNR &                     00001720
                  B01.SIVILSTAND(SØKER_IND) ^= 'A' THEN                 00001730
                  DO;                                                   00001740
  L110:                                                                 00001750
                     FEIL_VED_LABEL = '110';                            00001760
                     FEIL_MELD_NR   = 1702;                             00001770
                     GO TO L999;                                        00001780
                  END;                                                  00001790
            IF SISTE_UTTAKSDATO_ÅM > HJ_VIRK_DATO_ÅM THEN               00001800
               DO;                                                      00001810
  L120:                                                                 00001820
                  FEIL_VED_LABEL = '120';                               00001830
                  FEIL_MELD_NR   = 1703;                                00001840
                  GO TO L999;                                           00001850
               END;                                                     00001860
            IF HJ_VIRK_DATO_ÅM > SEKSTISJU_ÅRSDATO THEN                 00001870
               IF B01.PENSJONSTYPE1(SØKER_IND)    ^= 'A' &              00001880
                  B01.PENSJONSTYPE1(SØKER_IND)    ^= 'G'    THEN        00001890
                  DO;                                                   00001900
  L130:                                                                 00001910
                     FEIL_VED_LABEL = '130';                            00001920
                     FEIL_MELD_NR   = 1704;                             00001930
                     GO TO L999;                                        00001940
                  END;                                                  00001950
                                                                        00001960
 /* *************************************************************** */  00001970
 /* DERSOM DET ER EN EKTEFELLE I TRANSEN.                           */  00001980
 /* *************************************************************** */  00001990
                                                                        00002000
            IF APS.FNR_EK > 0 THEN                                      00002010
               DO;                                                      00002020
                  SELECT ( B01.SIVILSTAND(SØKER_IND));                  00002030
                                                                        00002040
 /* *************************************************************** */  00002050
 /* DERSOM SØKERS SIVILSTAND ER UGIFT.                              */  00002060
 /* *************************************************************** */  00002070
                                                                        00002080
                     WHEN ('U')                                         00002090
                        DO;                                             00002100
  L140:                                                                 00002110
                           FEIL_VED_LABEL = '140';                      00002120
                           FEIL_MELD_NR   = 1001;                       00002130
                           GO TO L999;                                  00002140
                        END;                                            00002150
                                                                        00002160
 /* *************************************************************** */  00002170
 /* DERSOM SØKER ER SKILT.                                          */  00002180
 /* *************************************************************** */  00002190
                                                                        00002200
                     WHEN ('S')                                         00002210
                        DO;                                             00002220
  L150:                                                                 00002230
                           FEIL_VED_LABEL = '150';                      00002240
                           FEIL_MELD_NR   = 1002;                       00002250
                           GO TO L999;                                  00002260
                        END;                                            00002270
                                                                        00002280
 /* *************************************************************** */  00002290
 /* DERSOM SØKER ER ETTERLATT.                                      */  00002300
 /* *************************************************************** */  00002310
                                                                        00002320
                     WHEN ('E')                                         00002330
                        DO;                                             00002340
  L160:                                                                 00002350
                           FEIL_VED_LABEL = '160';                      00002360
                           FEIL_MELD_NR   = 1003;                       00002370
                           GO TO L999;                                  00002380
                        END;                                            00002390
                                                                        00002400
 /* *************************************************************** */  00002410
 /* ELLERS ER SØKEREN GIFT.                                         */  00002420
 /* *************************************************************** */  00002430
                                                                        00002440
                     OTHERWISE                                          00002450
                        DO;                                             00002460
                                                                        00002470
 /* *************************************************************** */  00002480
 /* DERSOM DET ER EN ANNEN EKTEFELLE I SØKERENS PESTATUS.           */  00002490
 /* *************************************************************** */  00002500
                                                                        00002510
                           IF B01.FNR(EKTEF_IND) ^= APS. FNR_EK         00002520
                           THEN                                         00002530
                              DO;                                       00002540
  L170:                                                                 00002550
                                 FEIL_VED_LABEL = '170';                00002560
                                 FEIL_MELD_NR   = 1004;                 00002570
                                 GO TO L999;                            00002580
                              END;                                      00002590
                           ELSE                                         00002600
                                                                        00002610
 /* *************************************************************** */  00002620
 /* NÅ FORUTSETTES DET AT EKTEFELLEN ER I SØKERS PESTATUS.          */  00002630
 /* *************************************************************** */  00002640
                                                                        00002650
                              DO;                                       00002660
                                                                        00002670
 /* *************************************************************** */  00002680
 /* DERSOM DET SØKES OM EKTEFELLETILLEGG.                           */  00002690
 /* *************************************************************** */  00002700
                                                                        00002710
                                 IF APS.TILL_EK = 'J' THEN              00002720
                                    DO;                                 00002730
                                                                        00002740
 /* *************************************************************** */  00002750
 /* DERSOM EKTEFELLEN HAR PENSJON.                                  */  00002760
 /* *************************************************************** */  00002770
                                                                        00002780
                                       IF (                             00002790
                                        B01.PENSJONSTYPE1 (EKTEF_IND)   00002800
                                                             = 'A' !    00002810
                                        B01.PENSJONSTYPE1 ( EKTEF_IND)  00002820
                                                             = 'U' !    00002830
 /*YS*/                                 B01.PENSJONSTYPE1 ( EKTEF_IND)  00002840
 /*YS*/                                                      = 'Y' !    00002850
 /*AFP*/                                B01.PENSJONSTYPE1 ( EKTEF_IND)  00002860
 /*AFP*/                                                     = 'K'  )   00002870
                                                                        00002880
                                       THEN                             00002890
                                       DO;                              00002900
  L180:                                                                 00002910
                                          FEIL_VED_LABEL = '180';       00002920
                                          FEIL_MELD_NR   = 1011;        00002930
                                          GO TO L999;                   00002940
                                       END;                             00002950
                                                                        00002960
 /* **************************************************************** */ 00002970
 /* EKTEFELLEN HAR IKKE PENSJON.                                     */ 00002980
 /* **************************************************************** */ 00002990
                                                                        00003000
                                       ELSE                             00003010
                                       DO;                              00003020
                                       CALL                             00003030
                                       FLYTT_B01_TIL_B02( SØKER_IND);   00003040
                                       IF FEIL_MELD_NR > 0 THEN         00003050
                                          GO TO L999;                   00003060
                                       ELSE                             00003070
                                          PROGRAM_ID='R0010520';        00003080
                                       CALL                             00003090
                                       FLYTT_B01_TIL_B02( EKTEF_IND);   00003100
                                       IF FEIL_MELD_NR > 0 THEN         00003110
                                          GO TO L999;                   00003120
                                       ELSE                             00003130
                                          PROGRAM_ID='R0010520';        00003140
                                       CALL                             00003150
                                            AJOURFØR_B02_MED_APTRANS;   00003160
                                       END;                             00003170
                                    END;                                00003180
                                                                        00003190
 /* *************************************************************** */  00003200
 /* DET SØKES IKKE OM EKTEFELLETILLEGG.                             */  00003210
 /* *************************************************************** */  00003220
                                                                        00003230
                                 ELSE                                   00003240
                                    DO;                                 00003250
                                       CALL                             00003260
                                       FLYTT_B01_TIL_B02( SØKER_IND);   00003270
                                       IF FEIL_MELD_NR > 0 THEN         00003280
                                          GO TO L999;                   00003290
                                       ELSE                             00003300
                                          PROGRAM_ID='R0010520';        00003310
                                       CALL                             00003320
                                       FLYTT_B01_TIL_B02( EKTEF_IND);   00003330
                                       IF FEIL_MELD_NR > 0 THEN         00003340
                                          GO TO L999;                   00003350
                                       ELSE                             00003360
                                          PROGRAM_ID='R0010520';        00003370
 /* RETTING AV FEIL NR 1 FRA KONSOLIDERINSPROSJEKTET                    00003380
      IF B02.ALDERSP.FAI(EKTEF_IND) > 0    THEN                         00003390
          CALL RULL_FAI(B02.G_DATO_ÅM(EKTEF_IND),                       00003400
                        B02.VIRK_DATO_ÅM(SØKER_IND),                    00003410
                        B02.ALDERSP.FAI(EKTEF_IND));                    00003420
    * GJØRES I 0522 ************************ 9802 HL */                 00003430
                                       CALL                             00003440
                                       AJOURFØR_B02_MED_APTRANS;        00003450
                                    END;                                00003460
                              END;                                      00003470
                        END;                                            00003480
                  END;                                                  00003490
               END;                                                     00003500
            ELSE                                                        00003510
                                                                        00003520
 /* ************************************************************ */     00003530
 /* INGEN EKTEFELLE I TRANSEN.                                   */     00003540
 /* ************************************************************ */     00003550
                                                                        00003560
               DO;                                                      00003570
                                                                        00003580
 /* *************************************************************** */  00003590
 /* DERSOM SØKERS SIVILSTAND ER G ELLER A.                          */  00003600
 /* *************************************************************** */  00003610
                                                                        00003620
                 IF  B01.SIVILSTAND(SØKER_IND) = 'P' THEN               00003630
                     DO;                                                00003640
  L185:                                                                 00003650
                        FEIL_VED_LABEL = '185';                         00003660
                        FEIL_MELD_NR   = 1105;                          00003670
                        GO TO L999;                                     00003680
                     END;                                               00003690
                                                                        00003700
                 IF  B01.SIVILSTAND(SØKER_IND) = 'W' !                  00003710
                     B01.SIVILSTAND(SØKER_IND) = 'V' THEN               00003720
                     DO;                                                00003730
  L187:                                                                 00003740
                        FEIL_VED_LABEL = '187';                         00003750
                        FEIL_MELD_NR   = 1106;                          00003760
                        GO TO L999;                                     00003770
                     END;                                               00003780
                                                                        00003790
                  IF (                                                  00003800
                   B01.SIVILSTAND(SØKER_IND) = 'G' !                    00003810
                   B01.SIVILSTAND(SØKER_IND) = 'A') THEN                00003820
                     DO;                                                00003830
  L190:                                                                 00003840
                        FEIL_VED_LABEL = '190';                         00003850
                        FEIL_MELD_NR   = 1102;                          00003860
                        GO TO L999;                                     00003870
                     END;                                               00003880
                  ELSE                                                  00003890
                     DO;                                                00003900
                        CALL FLYTT_B01_TIL_B02(SØKER_IND);              00003910
                        IF B01.PENSJONSTYPE2(SØKER_IND) = 'E' THEN      00003920
                           B02.PERSON(EKTEF_IND) =                      00003930
                                            B01.PERSON(EKTEF_IND);      00003940
                        IF FEIL_MELD_NR > 0 THEN                        00003950
                           GO TO L999;                                  00003960
                        ELSE                                            00003970
                           PROGRAM_ID='R0010520';                       00003980
                        CALL AJOURFØR_B02_MED_APTRANS;                  00003990
                     END;                                               00004000
               END;                                                     00004010
         END;                                                           00004020
      ELSE                                                              00004030
                                                                        00004040
 /* 9/1-85 KARIN */                                                     00004050
 /* *************************************************************** */  00004060
 /* SØKEREN ER IKKE I PENSJONSDELEN ELLER                           */  00004070
 /* HAR EN OPPHØRT PENSJONSSTATUS (STATUS-KODE-HIST = O / X)        */  00004080
 /* *************************************************************** */  00004090
                                                                        00004100
         DO;                                                            00004110
            /* 9/1-85 KARIN */                                          00004120
            /* ************************************************/        00004130
            /* DET ETTERFØLGENDE GJELDER DISSE STATUS-TYPER:   */       00004140
            /* - A - IKKE STATUS-SEGMENT ELLER STATUS-SEGMENT  */       00004150
            /*       SOM ER OPPHØRT, STATUS_KODE-HIST = 'O',   */       00004160
            /*       INGEN OPPLYSNINGER FRA STATUS SKAL MED I  */       00004170
            /*       B02.                                      */       00004180
            /* - C - IKKE STATUS-SEGMENT                       */       00004190
            /* - I - HAR STATUS-SEGMENT (SS) SOM ER HISTORISK, */       00004200
            /*       STATUS-KODE-HIST = 'X', UFØREHISTORIKKEN  */       00004210
            /*       SKAL VÆRE MED OVER TIL B02.               */       00004220
            /* - K - HAR STATUS-SEGMENT (NS) SOM ER HISTORISK, */       00004230
            /*       STATUS-KODE-HIST = 'X', UFØREHISTORIKKEN  */       00004240
            /*       SKAL VÆRE MED OVER TIL B02.               */       00004250
            /* *********************************************** */       00004260
                                                                        00004270
 /* *************************************************************** */  00004280
 /* BARE NÅR DET LIGGER NOE I B01.                                  */  00004290
 /* *************************************************************** */  00004300
                                                                        00004310
            IF B01.FNR(SØKER_IND) > 0 THEN                              00004320
               DO;                                                      00004330
                  CALL FLYTT_B01_TIL_B02(SØKER_IND);                    00004340
                  IF FEIL_MELD_NR > 0 THEN                              00004350
                     GO TO L999;                                        00004360
                  ELSE                                                  00004370
                     PROGRAM_ID='R0010520';                             00004380
                  B02.NAVN(SØKER_IND)  = APS.NAVN;                      00004390
               END;                                                     00004400
            ELSE                                                        00004410
                                                                        00004420
 /* *************************************************************** */  00004430
 /* OPPLYSNINGER FOR OPPRETTELSE AV ROTSEGMENT.                     */  00004440
 /* *************************************************************** */  00004450
                                                                        00004460
               DO;                                                      00004470
                  B02.FNR(SØKER_IND)   = APS.FNR;                       00004480
                  B02.NAVN(SØKER_IND)  = APS.NAVN;                      00004490
                  B02.TKNR(SØKER_IND)  = APS.TKNR;                      00004500
                  B02.SPRÅK(SØKER_IND) = APS.SPRÅK;                     00004510
               END;                                                     00004520
                                                                        00004530
 /* *************************************************************** */  00004540
 /* DERSOM DET ER EKTEFELLE I TRANSEN.                              */  00004550
 /* *************************************************************** */  00004560
                                                                        00004570
            IF APS.FNR_EK > 0 THEN                                      00004580
               DO;                                                      00004590
                  SEARCH_FNR = APS.FNR_EK;                              00004600
                  POS_I_B01  = EKTEF_IND;                               00004610
                  EXEC CICS LINK PROGRAM ('R0019928') COMMAREA          00004620
                                                        (KOM_OMR);      00004630
                  IF FEIL_MELD_NR > 0 THEN                              00004640
                     GO TO L999;                                        00004650
                  ELSE                                                  00004660
                     PROGRAM_ID='R0010520';                             00004670
                                                                        00004680
 /* ************************************************************** */   00004690
 /* DERSOM EKTEFELLEN IKKE HAR PESTATUS.                           */   00004700
 /* ************************************************************** */   00004710
                                                                        00004720
                  IF STATUS_TYPE  = 'A' !                               00004730
                     STATUS_TYPE  = 'I' !                               00004740
                     STATUS_TYPE  = 'K' !   /* 9/1-85 */                00004750
                     STATUS_TYPE  = 'C' THEN                            00004760
                     DO;                                                00004770
                                                                        00004780
 /* ************************************************************** */   00004790
 /* DERSOM EKTEFELLEN ER I BASEN (MEN IKKE HAR PENSJONSSTATUS).    */   00004800
 /* ************************************************************** */   00004810
                                                                        00004820
                        IF B01.FNR(EKTEF_IND) > 0 THEN                  00004830
                           DO;                                          00004840
                              CALL FLYTT_B01_TIL_B02(EKTEF_IND);        00004850
                              IF FEIL_MELD_NR > 0 THEN                  00004860
                                 GO TO L999;                            00004870
                              ELSE                                      00004880
                                 PROGRAM_ID='R0010520';                 00004890
                              B02.NAVN(EKTEF_IND)  = APS.NAVN_EK;       00004900
                              B02.TKNR(EKTEF_IND)  = APS.TKNR;          00004910
                           END;                                         00004920
                        ELSE                                            00004930
                                                                        00004940
 /* *************************************************************** */  00004950
 /* OPPLYSNINGER FOR OPPRETTELSE AV ROTSEGMENT.                     */  00004960
 /* *************************************************************** */  00004970
                                                                        00004980
                           DO;                                          00004990
                              B02.FNR(EKTEF_IND)   = APS.FNR_EK;        00005000
                              B02.NAVN(EKTEF_IND)  = APS.NAVN_EK;       00005010
                              B02.TKNR(EKTEF_IND)  = APS.TKNR;          00005020
                              B02.SPRÅK(EKTEF_IND) = APS.SPRÅK;         00005030
                           END;                                         00005040
                           /* R0010521 ENDRET 9/1-85 AV KARIN */        00005050
                           CALL                                         00005060
                               OPPRETT_STATUS_AP_SØKER; /*R0010521*/    00005070
                           CALL KOBLE_TO_PERSONER (                     00005080
                                                 SØKER_IND,EKTEF_IND);  00005090
                     END;                                               00005100
                  ELSE                                                  00005110
                     DO;                                                00005120
                                                                        00005130
 /* *************************************************************** */  00005140
 /* EKTEFELLEN HAR PENSJONSSTATUS.                                  */  00005150
 /* *************************************************************** */  00005160
                                                                        00005170
 /* ENDRET AV KARIN 9/1-85 */                                           00005180
                        IF STATUS_TYPE = 'F' !                          00005190
                           STATUS_TYPE = 'H'  THEN                      00005200
                           DO;                                          00005210
  L195:                                                                 00005220
                              FEIL_VED_LABEL = '195';                   00005230
                              FEIL_MELD_NR   = 1716;                    00005240
                              GO TO L999;                               00005250
                           END;                                         00005260
                        ELSE                                            00005270
                           DO;                                          00005280
  L200:                                                                 00005290
                              FEIL_VED_LABEL = '200';                   00005300
                              FEIL_MELD_NR   = 1008;                    00005310
                              GO TO L999;                               00005320
                           END;                                         00005330
                     END;                                               00005340
               END;                                                     00005350
            ELSE                                                        00005360
                                                                        00005370
 /* ************************************************************** */   00005380
 /* DET ER IKKE EKTEFELLE I TRANSEN.                               */   00005390
 /* *************************************************************  */   00005400
                                                                        00005410
                  CALL OPPRETT_STATUS_AP_SØKER;                         00005420
         END;                                                           00005430
                                                                        00005440
 /* *************************************************************** */  00005450
 /*         BARNEDELEN                                              */  00005460
 /* *************************************************************** */  00005470
                                                                        00005480
      DO I = 1 TO APS.BT_ANT;                                           00005490
         BARN_IND = 0;                                                  00005500
         DO J = 3 TO 14 WHILE (B02.FNR(J) > 0);                         00005510
            IF APB.FNR_BARN(I) = B02.FNR(J) THEN                        00005520
               DO;                                                      00005530
                  BARN_IND = J;                                         00005540
                  J = 14;                                               00005550
               END;                                                     00005560
         END;                                                           00005570
 %PAGE;                                /* */                            00005580
                                                                        00005590
 /* ***************************************************************** */00005600
 /* BARNET ER IKKE I B01, IKKE TILKNYTTET SØKER ELLER SØKERS EKTEFELLE*/00005610
 /* ***************************************************************** */00005620
                                                                        00005630
         IF BARN_IND = 0 THEN                                           00005640
            DO;                                                         00005650
               BARN_IND        = J;                                     00005660
               SEARCH_FNR      = APB.FNR_BARN(I);                       00005670
               POS_I_B01       = BARN_IND;                              00005680
               EXEC CICS LINK PROGRAM ('R0019928') COMMAREA             00005690
                                                         (KOM_OMR);     00005700
               IF FEIL_MELD_NR > 0 THEN                                 00005710
                  GO TO L999;                                           00005720
               ELSE                                                     00005730
                  PROGRAM_ID = 'R0010520';                              00005740
                                                                        00005750
 /* *************************************************************** */  00005760
 /* DERSOM BARNET IKKE HAR PENSJONSSTATUS.                          */  00005770
 /* *************************************************************** */  00005780
                                                                        00005790
                /* 9/1-85 AV KARIN */                                   00005800
               IF STATUS_TYPE = 'A' !                                   00005810
                  STATUS_TYPE = 'I' !                                   00005820
                  STATUS_TYPE = 'C' THEN                                00005830
                  DO;                                                   00005840
                                                                        00005850
 /* *************************************************************** */  00005860
 /* DERSOM BARNET ER I BASEN.                                       */  00005870
 /* *************************************************************** */  00005880
                                                                        00005890
                     IF B01.FNR(BARN_IND) > 0 THEN                      00005900
                        DO;                                             00005910
                           CALL FLYTT_B01_TIL_B02(BARN_IND);            00005920
                           IF FEIL_MELD_NR > 0 THEN                     00005930
                              GO TO L999;                               00005940
                           ELSE                                         00005950
                              PROGRAM_ID = 'R0010520';                  00005960
                        END;                                            00005970
                                                                        00005980
 /* *************************************************************** */  00005990
 /* BARNET ER IKKE I BASEN.                                         */  00006000
 /* *************************************************************** */  00006010
                                                                        00006020
                     ELSE                                               00006030
                                                                        00006040
 /* *************************************************************** */  00006050
 /* OPPLYSNINGER FOR OPPRETTELSE AV ROTSEGMENT.                     */  00006060
 /* *************************************************************** */  00006070
                                                                        00006080
                         DO;                                            00006090
                            B02.FNR(BARN_IND)   = APB.FNR_BARN (I);     00006100
                            B02.NAVN(BARN_IND)  = (25)' ';              00006110
                            B02.TKNR(BARN_IND)  = APS.TKNR;             00006120
                            B02.SPRÅK(BARN_IND) = APS.SPRÅK;            00006130
                         END;                                           00006140
 /* KS 4/6-84 */                                                        00006150
                     IF APB.RBT_BARN(I) = 'J' THEN                      00006160
                        B02.PENSJONSTYPE2(BARN_IND) = 'R';              00006170
                     ELSE                                               00006180
                        B02.PENSJONSTYPE2(BARN_IND) = ' ';              00006190
                     CALL                                               00006200
                     OPPRETT_STATUS_FORS_BARN(BARN_IND,SØKER_IND);      00006210
                     CALL KOBLE_TO_PERSONER(SØKER_IND,BARN_IND);        00006220
                  END;                                                  00006230
               ELSE                                                     00006240
                                                                        00006250
 /* ************************************************************** */   00006260
 /* BARNET HAR PESTATUS.                                           */   00006270
 /* ************************************************************** */   00006280
                                                                        00006290
                  DO;                                                   00006300
                     IF STATUS_TYPE ^= 'F'                              00006310
                                                      THEN              00006320
                        DO;                                             00006330
                                                                        00006340
 /* ************************************************************** */   00006350
 /* BARNET ER FORSØRGET AV ANDRE.                                  */   00006360
 /* ************************************************************** */   00006370
                                                                        00006380
                           IF B01.                                      00006390
                                  PENSJONSTYPE1(BARN_IND) = 'L' THEN    00006400
                              DO;                                       00006410
  L210:                                                                 00006420
                                 FEIL_VED_LABEL = '210';                00006430
                                 FEIL_MELD_NR   = 1203;                 00006440
                                 GO TO L999;                            00006450
                              END;                                      00006460
                           ELSE                                         00006470
                                                                        00006480
 /* ************************************************************** */   00006490
 /* BARNET ER TILKNYTTET ANDRE PÅ EN ANNEN MÅTE.                   */   00006500
 /* ************************************************************** */   00006510
                                                                        00006520
                              IF B01.                                   00006530
                                     FNR_TILKN(BARN_IND,1) > 0 THEN     00006540
                                 DO;                                    00006550
  L230:                                                                 00006560
                                    FEIL_VED_LABEL = '220';             00006570
                                    FEIL_MELD_NR   = 1206;              00006580
                                    GO TO L999;                         00006590
                                 END;                                   00006600
                              ELSE                                      00006610
                                                                        00006620
 /* ************************************************************** */   00006630
 /* BARNET HAR PENSJON.                                            */   00006640
 /* ************************************************************** */   00006650
                                                                        00006660
                                 DO;                                    00006670
  L240:                                                                 00006680
                                    FEIL_VED_LABEL = '240';             00006690
                                    FEIL_MELD_NR   = 1204;              00006700
                                    GO TO L999;                         00006710
                                 END;                                   00006720
                        END;                                            00006730
                     ELSE                                               00006740
                        DO;                                             00006750
  L245:                                                                 00006760
                           FEIL_VED_LABEL = '245';                      00006770
                           FEIL_MELD_NR   = 0601;                       00006780
                           GO TO L999;                                  00006790
                        END;                                            00006800
                  END;                                                  00006810
            END;                                                        00006820
                                                                        00006830
                                                                        00006840
 /* ************************************************************** */   00006850
 /* BARNET ER TILKNYTTET SØKERENS FAMILIE.                         */   00006860
 /* ************************************************************** */   00006870
                                                                        00006880
         ELSE                                                           00006890
            DO;                                                         00006900
                                                                        00006910
 /* ************************************************************** */   00006920
 /* DERSOM BARNET IKKE ER TILKNYTTET SØKER.                        */   00006930
 /* ************************************************************** */   00006940
                                                                        00006950
               IF B01.FNR_TILKN(BARN_IND,1) ^= B01.FNR(SØKER_IND)       00006960
                                                                 THEN   00006970
                  DO;                                                   00006980
  L250:                                                                 00006990
                     FEIL_VED_LABEL = '250';                            00007000
                     FEIL_MELD_NR   = 1201;                             00007010
                     GO TO L999;                                        00007020
                  END;                                                  00007030
               ELSE                                                     00007040
                  DO;                                                   00007050
                                                                        00007060
 /* ************************************************************** */   00007070
 /* IKKE FORSØRGET BARN.                                           */   00007080
 /* ************************************************************** */   00007090
                                                                        00007100
                     IF B01.PENSJONSTYPE1(BARN_IND) ^= 'L' THEN         00007110
                        DO;                                             00007120
  L260:                                                                 00007130
                           FEIL_VED_LABEL = '260';                      00007140
                           FEIL_MELD_NR   = 1207;                       00007150
                           GO TO L999;                                  00007160
                        END;                                            00007170
                     ELSE                                               00007180
 /* KS 4/6-84 */                                                        00007190
                        DO;                                             00007200
                        /* BARNET ER REGISTRERT SOM FORS. FRA FØR */    00007210
                           IF B01.PENSJONSTYPE2(BARN_IND) = 'R' &       00007220
                              APB.RBT_BARN (I) = 'R' THEN               00007230
                              DO;                                       00007240
  L265:                                                                 00007250
                                FEIL_VED_LABEL = '265';                 00007260
                                FEIL_MELD_NR   = 1209;                  00007270
                                GO TO L999;                             00007280
                              END;                                      00007290
                         /* HVIS BARNET ER FORSØRGET FRA FØR SÅ SKAL */ 00007300
                         /* PK2 BEHOLDES                             */ 00007310
                        END;                                            00007320
                  END;                                                  00007330
            END;                                                        00007340
      END;                                                              00007350
                                                                        00007360
 /* ************************************************************* */    00007370
 /* BARN TILKNYTTET SØKER MED L (FORSØRGEDE BARN)                 */    00007380
 /* ************************************************************* */    00007390
                                                                        00007400
  B02.ANTALL_BARN(SØKER_IND) = 0;                                       00007410
  DO I = 1 TO 13 WHILE                                                  00007420
         (B02.TILKN.FNR_TILKN(SØKER_IND,I) > 0 );                       00007430
     IF B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'L'   !               00007440
        B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'V'   !   /*HL*/      00007450
        B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'W'   THEN            00007460
        B02.ANTALL_BARN(SØKER_IND) =                                    00007470
                                    B02.ANTALL_BARN(SØKER_IND) + 1;     00007480
  END;                                                                  00007490
                                                                        00007500
 /* **************************************************************** */ 00007510
 /*YS - VI SKAL AVSLUTTE EN EVT. UFØREPERIODE V/ENGANGSUTLØSNING*/      00007520
 /* **************************************************************** */ 00007530
                                                                        00007540
                                                                        00007550
         IF B02.UFØRHIST.UFT_ÅM(SØKER_IND,1) > 0     THEN               00007560
         DO;                                                            00007570
            DCL SISTE  FIXED BIN(15);                                   00007580
    /*0697 HL:*/                                                        00007590
            DO J = 7 TO 1 BY -1 UNTIL(B02.UFØRHIST.UFT_ÅM(SØKER_IND,    00007600
                                                          J) > 0);      00007610
               SISTE = J;                                               00007620
            END;                                                        00007630
                                                                        00007640
            IF B02.UFØRHIST.OPPHØRSDATO_ÅM(SØKER_IND,SISTE) = 0 THEN    00007650
                                                                        00007660
            DO;                                                         00007670
               B02.UFØRHIST.OPPHØRSDATO_ÅM(SØKER_IND,SISTE) =           00007680
                                             SEKSTISJU_ÅRSDATO;         00007690
               B02.UFØRHIST.OPPHØRSKODE(SØKER_IND,SISTE) = 'A';         00007700
               B02.ALDERSP.KONV_P_KODE(SØKER_IND)        = 'U';/*TS*/   00007710
                                                               /*0994*/ 00007720
               DO J = 5 TO 1 BY -1 UNTIL(B02.YRKEHIST.YUFT_ÅM           00007730
                                                (SØKER_IND,J) > 0);     00007740
                  SISTE = J;                                            00007750
               END;                                                     00007760
                                                                        00007770
               IF B02.YRKEHIST.OPPH_DATO_ÅM(SØKER_IND,SISTE) = 0 THEN   00007780
                                                                        00007790
               DO;                                                      00007800
                  B02.YRKEHIST.OPPH_DATO_ÅM(SØKER_IND,SISTE) =          00007810
                                               SEKSTISJU_ÅRSDATO;       00007820
                  B02.YRKEHIST.OPPH_KODE(SØKER_IND,SISTE) = 'A';        00007830
               END;                                                     00007840
            END;                                                        00007850
         END;                                                           00007860
                                                                        00007870
  L999:                                                                 00007880
                                                                        00007890
  EXEC CICS RETURN;                                                     00007900
                                                                        00007910
  %PAGE;                                                                00007920
      %INCLUDE R0010521;                                                00007930
      %INCLUDE R0010522;                                                00007940
      %INCLUDE R0019905;                                                00007950
      %INCLUDE R0019913;                                                00007960
      %INCLUDE R0019923;                                                00007970
      %INCLUDE R0019924;                                                00007980
      %INCLUDE R0019926;                                                00007990
      %INCLUDE R0019929;                                                00008000
      %INCLUDE R0019954;   /*RULL_FORVENTET*/                           00008010
      %INCLUDE R0019967;   /*RULL_FAI*/                                 00008020
      %INCLUDE R0019968;   /*F_RULL_FORSI*/                             00008030
   END KON_AP;                                                          00008040
