 /*       SIST ENDRET 13/12-91 12.20.56 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 17/06-91 13.20.04 AV   HERMAN                   */00000010
 /*       SIST ENDRET 14/12-88 13.18.38 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 30/08-84 08.47.16 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 17/11-83 14.34.58 AV   OLAV                     */00000040
 /*       SIST ENDRET 19/09-83 08.53.32 AV   OLAV                     */00000050
 /*       SIST ENDRET 27/04-83 12.35.17 AV   OLAV                     */00000060
 /* ***************************************************************** */00000070
 /*IDENTIFIKASJON:                                                    */00000080
 /*    R0014122 - BEREGN_APD - INTERN PROC I PLI.                     */00000090
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982.                          */00000100
 /*    ENDRET JULI 82 AV KARIN                                        */00000110
 /*HENSIKT:                                                           */00000120
 /*    PROGRAMMET BEREGNER APD OG SETTER UTTAKSDATO I B02.            */00000130
 /*PROGRAMTILKNYTNING:                                                */00000140
 /*    PROGRAMMET BLIR INKLUDERT I OVERLIGGENDE PROGRAM.              */00000150
 /*BRUK:                                                              */00000160
 /*    CALL BEREGN_APD(APD_ØNSKET);                                   */00000170
 /* ***************************************************************** */00000180
 BEREGN_APD: PROC(APD_ØNSKET);                                          00000190
                                                                        00000200
 DCL APD_ØNSKET           FIXED DEC(3);                                 00000210
 DCL                                                                    00000220
    I                     FIXED BIN(15),                                00000230
    W_TAI                 FIXED DEC(7),                                 00000240
    W_BRP                 FIXED DEC(7,2),                               00000250
    W_APD_80              FIXED DEC(7,3),                               00000260
    W_APD_ANVENDT         FIXED DEC(3),                                 00000270
    FNR_ÅM                PIC'(4)9',                                    00000280
    FNR_Å                 PIC'(2)9' DEF FNR_ÅM POS(1),                  00000290
    FNR_M                 PIC'(2)9' DEF FNR_ÅM POS(3),                  00000300
    W_FRAVIK              CHAR(1);                                      00000310
                                                                        00000320
 PROGRAM_ID = 'R0014122';                                               00000330
 W_TAI         = 0;                                                     00000340
 W_APD_80      = 0;                                                     00000350
 W_APD_ANVENDT = 0;                                                     00000360
 W_FRAVIK      = ' ';                                                   00000370
 FNR_Å = FNR_R.ÅR;                                                      00000380
 FNR_M = FNR_R.MND;                                                     00000390
                                                                        00000400
                 /*ETTER ØNSKE FRA TRY SIN GRUPPE   : */                00000410
                 /* TRUDE 11.91 TO NESTE STATEMENT    */                00000420
 CALL TIDLIGERE_ARBEIDSINNTEKT(W_TAI,W_BRP);                            00000430
                                                                        00000440
 IF FNR_ÅM > 0301 & FNR_R.ÅRHUNDRE < 5 &                                00000450
    B02.STATUS.VIRK_DATO_ÅM(BER_SØ_IND) > 7212 THEN                     00000460
                                                                        00000470
    DO;                                                                 00000480
       IF APD_ØNSKET = 999 THEN                                         00000490
          APD_ØNSKET = 100;                                             00000500
       IF B02.FAI(BER_SØ_IND) = 0 THEN                                  00000510
          DO;                                                           00000520
             W_APD_80 = 100;                                            00000530
             W_FRAVIK = 'N';                                            00000540
          END;                                                          00000550
       ELSE                                                             00000560
          DO;                                                           00000570
     /* RUTINEN REGNER UT TIDL ARB_INNTEKT, R0014135  */                00000580
     /* VERDIEN LEGGES INN I W_TAI                    */                00000590
     /* FLYTTES FORAN PGA TAI SKAL INN I DIV_PARAM_OMR.TAI */           00000600
     /* UANSETT OM FAI = 0 . TRUDE, 11,91                  */           00000610
                                                                        00000620
     /* RUTINEN REGNER UT APD ETTER 80-PROSENT-REGELEN, FINNER UT  */   00000630
     /* OM DET SKAL GIS FRAVIK ETTER 80_PROSENT-REGELEN, R0014136  */   00000640
    /* VED FRAVIK: W_FRAVIK = 'J'                                 */    00000650
                                                                        00000660
             CALL ÅTTI_PROSENT_REGELEN                                  00000670
                                (W_TAI,APD_ØNSKET,W_APD_80,W_FRAVIK);   00000680
          END;                                                          00000690
                                                                        00000700
                                                                        00000710
                                                                        00000720
       IF B02.ALDERSP.KONV_GRAD(BER_SØ_IND) > W_APD_80 THEN             00000730
          DO;                                                           00000740
             W_APD_ANVENDT = B02.ALDERSP.KONV_GRAD(BER_SØ_IND);         00000750
             B02.ALDERSP.P67_KODE(BER_SØ_IND) = '2'; /* KONVERTERT */   00000760
          END;                                                          00000770
       ELSE                                                             00000780
          DO;                                                           00000790
             W_APD_ANVENDT = W_APD_80;                                  00000800
             IF W_FRAVIK = 'J' THEN                                     00000810
                B02.ALDERSP.P67_KODE(BER_SØ_IND) = '4';                 00000820
                                                                        00000830
             ELSE                                                       00000840
                B02.ALDERSP.P67_KODE(BER_SØ_IND) = '1';                 00000850
         /*  TEKST B13    */                                            00000860
          END;                                                          00000870
                                                                        00000880
       IF APD_ØNSKET < W_APD_ANVENDT THEN                               00000890
          DO;                                                           00000900
             W_APD_ANVENDT = APD_ØNSKET;                                00000910
             B02.ALDERSP.P67_KODE(BER_SØ_IND) = '3';      /* ØNSKET   */00000920
          END;                                                          00000930
                                                                        00000940
       IF B02.ALDERSP.UTTAKSDATO_ÅM(BER_SØ_IND) = 0 THEN                00000950
          DO;                                                           00000960
             B02.ALDERSP.UTTAKSDATO_ÅM(BER_SØ_IND) = B02.STATUS.        00000970
                                              VIRK_DATO_ÅM(BER_SØ_IND); 00000980
             B02.ALDERSP.UTTAKS_APD   (BER_SØ_IND) = W_APD_ANVENDT;     00000990
          END;                                                          00001000
       ELSE        /*AFP*/                                              00001010
 /*AFP*/  IF B02.ALDERSP.UTTAKSDATO_ÅM(BER_SØ_IND) =                    00001020
 /*AFP*/     B02.STATUS.VIRK_DATO_ÅM(BER_SØ_IND)     THEN               00001030
 /*AFP*/     B02.ALDERSP.UTTAKS_APD   (BER_SØ_IND) = W_APD_ANVENDT;     00001040
                                                                        00001050
       ELSE                                                             00001060
          IF B02.UTTAKSDATO_ÅM_ØVRIGE(BER_SØ_IND,5) > 0 &               00001070
             B02.VIRK_DATO_ÅM(BER_SØ_IND) >                             00001080
                   B02.UTTAKSDATO_ÅM_ØVRIGE(BER_SØ_IND,5)          THEN 00001090
             DO;                                                        00001100
 L100:                                                                  00001110
                FEIL_VED_LABEL = 'L100';                                00001120
                                                                        00001130
              /*ANTALL VENTEPERIODER OPPBRUKT*/                         00001140
                                                                        00001150
                FEIL_MELD_NR = 218;                                     00001160
                GOTO L999;                                              00001170
             END;                                                       00001180
          ELSE                                                          00001190
             DO;                                                        00001200
                DO I = 1 TO 5 UNTIL                                     00001210
                        (B02.UTTAKSDATO_ÅM_ØVRIGE(BER_SØ_IND,I) = 0);   00001220
                END;                                                    00001230
                IF I = 1 THEN                                           00001240
                   DO;                                                  00001250
                      IF B02.VIRK_DATO_ÅM(BER_SØ_IND) =                 00001260
                            B02.UTTAKSDATO_ÅM(BER_SØ_IND)        THEN   00001270
                         B02.ALDERSP.UTTAKS_APD   (BER_SØ_IND) =        00001280
                                                     W_APD_ANVENDT;     00001290
                      ELSE                                              00001300
                         IF W_APD_ANVENDT ^=                            00001310
                             B02.ALDERSP.UTTAKS_APD(BER_SØ_IND)  THEN   00001320
                            DO;                                         00001330
                               B02.UTTAKSDATO_ÅM_ØVRIGE(BER_SØ_IND,I) = 00001340
                                 B02.STATUS.VIRK_DATO_ÅM (BER_SØ_IND);  00001350
                               B02.APD_ØVRIGE(BER_SØ_IND,I) =           00001360
                                                         W_APD_ANVENDT; 00001370
                            END;                                        00001380
                   END;                                                 00001390
                ELSE                                                    00001400
                   DO;                                                  00001410
                      IF B02.VIRK_DATO_ÅM(BER_SØ_IND) =                 00001420
                            B02.UTTAKSDATO_ÅM_ØVRIGE(BER_SØ_IND,I - 1)  00001430
                                                                  THEN  00001440
                         B02.APD_ØVRIGE(BER_SØ_IND,I - 1) =             00001450
                                                         W_APD_ANVENDT; 00001460
                      ELSE                                              00001470
                         IF W_APD_ANVENDT ^=                            00001480
                                B02.APD_ØVRIGE(BER_SØ_IND,I - 1)   THEN 00001490
                            DO;                                         00001500
                               B02.UTTAKSDATO_ÅM_ØVRIGE(BER_SØ_IND,I) = 00001510
                                  B02.STATUS.VIRK_DATO_ÅM (BER_SØ_IND); 00001520
                               B02.APD_ØVRIGE(BER_SØ_IND,I) =           00001530
                                                         W_APD_ANVENDT; 00001540
                            END;                                        00001550
                   END;                                                 00001560
                                                                        00001570
             END;                                                       00001580
                                                                        00001590
       B02.ALDERSP.APD(BER_SØ_IND) = W_APD_ANVENDT;                     00001600
                                                                        00001610
       IF W_APD_ANVENDT = 0 THEN         /*12.6.91 HL */                00001620
          DO;                                                           00001630
             B02.GARANTITILLEGG_EK(BER_SØ_IND)        = 0;              00001640
             B02.GARANTITILLEGG_BARN(BER_SØ_IND)      = 0;              00001650
             B02.BT_SÆRBARN(BER_SØ_IND)               = 0;              00001660
             B02.GARANTITILLEGG_SÆRBARN(BER_SØ_IND)   = 0;              00001670
             B02.FT_SKAL_BEREGNES(BER_SØ_IND)         = 'D';            00001680
          END;                                                          00001690
    END;                                                                00001700
                                                                        00001710
 L999:                                                                  00001720
 END BEREGN_APD;                                                        00001730
