 /*       SIST ENDRET 25/02-97 11.48.50 AV   JDA7339                  */00000000
 /*       SIST ENDRET 06/02-96 13.25.03 AV   JDA0310                  */00000010
 /*       SIST ENDRET 10/01-96 11.06.06 AV   TSB0310                  */00000020
 /*       SIST ENDRET 13/06-95 10.51.43 AV   TSB0310                  */00000030
                                                                        00000040
 /* ***************************************************************** */00000050
 /*IDENTIFIKASJON:                                                    */00000060
 /* **********************                                            */00000070
 /*  PROGRAM-IDENT : R00104UP  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000080
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000090
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000100
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000110
 /*                                                                   */00000120
 /* ***************************************************************** */00000130
 /*HENSIKT:                                                           */00000140
 /* **********                                                        */00000150
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000160
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000170
 /*    FORHÅND.                                                       */00000180
 /*    MAPS HØRER INN UNDER MAPSET 'S0010T'.                         */ 00000190
 /*                                                                   */00000200
 /* ***************************************************************** */00000210
 /*PROGRAMTILKNYTTING:                                                */00000220
 /* ********************                                              */00000230
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000240
 /*                                                                   */00000250
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000260
 /*    BRUK :                                                         */00000270
 /*    EXEC CICS XCTL PROGRAM ('R00104UP') COMMAREA(KOM_OMR);         */00000280
 /*    PROGRAMMET INCLUDER :                                          */00000290
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    UP       */00000300
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       UP       */00000310
 /* ***************************************************************** */00000320
 /*DATASETTOPPLYSNINGER:                                              */00000330
 /* ***********************                                           */00000340
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000350
 /*                                                                   */00000360
 /* ***************************************************************** */00000370
 /*FEILMELDINGER:                                                     */00000380
 /* *******************                                               */00000390
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000400
 /*                                                                   */00000410
 /* ***************************************************************** */00000420
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000430
                                                                        00000440
          %INCLUDE P0019906;                                            00000450
          %INCLUDE P0019908;                                            00000460
          %INCLUDE P0019910;                                            00000470
          %INCLUDE P0019912;                                            00000480
          %INCLUDE P0019913;                                            00000490
 DCL                                                                    00000500
      (CSTG, ADDR)                   BUILTIN;                           00000510
 DCL  COMMAREA_PEKER         PTR,                                       00000520
      LOKAL_KOM_PTR          PTR;                                       00000530
                                                                        00000540
                                                                        00000550
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000560
 DCL                                                                    00000570
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000580
    DFHBMUNP             CHAR(1) INIT(' '),                             00000590
    DFHBMBRY             CHAR(1) INIT('H'),                             00000600
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000610
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000620
    MELDING6O            CHAR(10),                                      00000630
    YMELDING6O           CHAR(10);                                      00000640
                                                                        00000650
          %INCLUDE S001F1  ;                                            00000660
          %INCLUDE P0010601;                                            00000670
                                                                        00000680
                                                                        00000690
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000700
                                                                        00000710
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000720
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000730
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000740
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000750
                                                                        00000760
                                                                        00000770
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000780
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000790
                                                                        00000800
           IF ^W01_YSKADE THEN                                          00000810
              DO;                                                       00000820
                 CALL OVERFØR_UPSØKER_MAP;                              00000830
                 IF UPS.NORSK_BOSATT = 'N' ! UPS.VILKÅR_8_1 ='N' THEN   00000840
                    DO;                                                 00000850
                       CALL TEKST_SPES;                                 00000860
                       CALL OVERFØR_UPSPES_MAP;                         00000870
                    END;                                                00000880
                 IF UPS.BT_ANT > 0 THEN                                 00000890
                    DO;                                                 00000900
                       CALL TEKST_BARN;                                 00000910
                       CALL OVERFØR_UPBARN_MAP;                         00000920
                    END;                                                00000930
                                                                        00000940
                 IF UPS.YSKADE_TILLEGG = 'J' THEN                       00000950
                    DO;                                                 00000960
                       W01_YSKADE = '1'B;                               00000970
                       W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1;           00000980
                    END;                                                00000990
                                                                        00001000
      /*         ELSE                                                   00001010
                       FREE TRANS_OMR,TRANS_OPPL_OMR;                   00001020
      */                                                                00001030
                 S001061O.DUMMYA = 'Ø';                                 00001040
                 W01_MAP   =   'S001061';                               00001050
              END;                                                      00001060
           ELSE                                                         00001070
              DO;                                                       00001080
                                                                        00001090
                 CALL OVERFØR_YP_MAP;                                   00001100
                                                                        00001110
                 W01_YSKADE = '0'B;                                     00001120
                                                                        00001130
                 S001201O.DUMMYA = 'Ø';                                 00001140
                 /* FREE TRANS_OMR,TRANS_OPPL_OMR; */                   00001150
                 W01_MAP   =   'S001201' ;                              00001160
                                                                        00001170
              END;                                                      00001180
                                                                        00001190
      EXEC CICS RETURN;                                                 00001200
                                                                        00001210
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00001220
      PROC(FIXED_DEC_5);                                                00001230
                                                                        00001240
      DCL                                                               00001250
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00001260
                                                                        00001270
   END SKRIV_FEIL;                                                      00001280
                                                                        00001290
        SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001300
                                                                        00001310
           DCL                                                          00001320
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001330
                                                                        00001340
        END SKRIV_FEIL_YP;                                              00001350
                                                                        00001360
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001370
                                                                        00001380
           DCL                                                          00001390
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001400
                                                                        00001410
        END SKRIV_FEIL_SP;                                              00001420
                                                                        00001430
          %INCLUDE R0019912;                                            00001440
          %INCLUDE R0010606;                                            00001450
          %INCLUDE R0010607;                                            00001460
                                                                        00001470
 END R001041;                                                           00001480
