 R001TRA:                                                               R0000010
  PROC (PCB_PEKER)    OPTIONS  (MAIN);                                  R0000020
  /* **************************************************************** */R0000030
  /*IDENTIFIKASJON:                                                   */R0000040
  /*    R001TRAN - HOVEDPROGRAM I PLI                                 */R0000050
  /*    PROGRAMMERER: GRASMO  JUNI  1982                              */R0000060
  /*                                                                  */R0000070
  /*HENSIKT:                                                          */R0000080
  /*    TESTER TRANSLATE _ BUILTIN I PLI                              */R0000090
  /*                                                                  */R0000250
  /* **************************************************************** */R0000260
  /*                                                                  */R0000260
  %INCLUDE P0017912;         /*   DCL AV W_TXT                        */R0000310
  %INCLUDE P0017907;         /*   DCL AV FEILLISTE                    */R0000310
  %INCLUDE P0017908;         /*   DCL AV FELLES_SKRIVELINJE           */R0000310
  /*                                                                  */R0000250
  /* **************************************************************** */R0000260
  /*                                                                  */R0000260
     DCL 1  VAR                   CHAR    (6)   INIT ('AAAAAA');                
     DCL 1  VERDI                 CHAR    (6)   INIT ('BBBBBB');                
     DCL 1  HENT_TXTKODE          CHAR    (3)   INIT ('   ');                   
     DCL 1  FE_TELLER           FIXED DEC (3)   INIT ('000');                   
  /* **************************************************************** */R0002580
  /*                                                                  */R0002590
  /*     INNEBYGDE PLI-FUNKSJONER                                     */R0002600
  /*                                                                  */R0002610
  /* **************************************************************** */R0002620
     DCL                                                                R0002630
       ( ADDR , LOW , CSTG , DATE , TRANSLATE )      BUILTIN;           R0002640
     DCL                                                                R0002650
       PLITDLI ENTRY;                                                   R0002660
  %SKIP;                                                                R0002670
  /* **************************************************************** */R0002680
  /*                                                                  */R0002690
  /*     DLI CALL-PARAMETRE                                           */R0002700
  /*                                                                  */R0002710
  /* **************************************************************** */R0002720
  %SKIP(2);                                                             R0002730
     DCL 1  W001_DLI               UNALIGNED,                           R0002740
            2   GU                 CHAR     (4)   INIT('GU  '),         R0002750
            2   GN                 CHAR     (4)   INIT('GN  '),         R0002760
            2   GNP                CHAR     (4)   INIT('GNP '),         R0002770
            2   PARM_CT_3          FIXED BIN(31)  INIT(3),              R0002780
            2   PARM_CT_4          FIXED BIN(31)  INIT(4),              R0002790
            2   PARM_CT_5          FIXED BIN(31)  INIT(5),              R0002800
            2   OUT2               CHAR     (20)  INIT                  R0002810
                        ('                    ');                       R0002820
  %PAGE;                                                                R0002830
  /* **************************************************************** */R0002840
  /*                                                                  */R0002850
  /*     DL1 SSA-OMRÅDER FOR  ROT OG STATUS-SEGMENTER.                */R0002860
  /*                                                                  */R0002870
  /* **************************************************************** */R0002880
  %SKIP(2);                                                             R0002890
     DCL    SSA_UQUAL                          CHAR(9) INIT ((9)' ');   R0002900
  %SKIP;                                                                R0002910
     DCL 1  SSA1_TX0ROT            UNALIGNED,                           R0002920
            2    HDEL                          CHAR (17) INIT           R0002930
                 ('TX0ROT  (TXTKODE '),                                 R0002940
            2    REL_OP                        CHAR (2)  INIT (' ='),   R0002950
            2    TKEY                          CHAR (3)  INIT ('000'),  R0002960
            2    HP                            CHAR (1)  INIT (')');    R0002970
  %SKIP;                                                                R0003060
     DCL 1  PCB_PEKER              POINTER;                             R0003070
  %SKIP;                                                                R0003060
     DCL 1  PCB_TX1                BASED    (PCB_PEKER),                R0003070
  %INCLUDE P0012003;         /*   DCL AV FOLKETRYGD DB                */R0000270
  /* **************************************************************** */R0003190
  /*                                                                  */R0003200
  /*                                                                  */R0003210
  /* SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .                */R0003220
  /*---------------------------------------------------               */R0003230
  /*                                                                  */R0003240
  /* **************************************************************** */R0003250
  /* **************************************************************** */R0003310
  /*                                                                  */R0003320
  /*   HOVED STRUKTUR FOR TEST AV TRANSLATE BUILTIN       ....        */R0003330
  /*                                                                  */R0003340
  /* **************************************************************** */R0003350
  /*                                                                  */R0003490
       OPEN                    FILE(LASER);                             03480   
       HENT_TXTKODE            =        'A01';                                  
       DO    WHILE            (LES_TXT1);                               R0003640
          CALL   TRANSLATE1;                                                    
          PUT DATA (W_TXT);                                                     
       END;                                                                     
       CLOSE                   FILE(LASER);                             04010   
 LES_TXT1:                                                              R0004040
    PROC               RETURNS (BIT(1));                                R0004050
 %SKIP;                                                                 R0004060
       DCL   W010_RETUR                           BIT   (1) INIT ('0'B);R0004070
 %SKIP;                                                                 R0004080
       /* *************************************************************/R0004090
       /*                                                             */R0004100
       /*   PROC FOR Å LESE  ROT                                      */R0004110
       /*                                                             */R0004120
       /* *************************************************************/R0004130
       %SKIP;                                                           R0004140
       SSA1_TX0ROT.TKEY      =          HENT_TXTKODE;                   R0004150
       CALL              PLITDLI        (PARM_CT_4,                     R0004160
                                        GU,                             R0004170
                                        PCB_TX1,                        R0004180
                                        W_TXT,                          R0004190
                                        SSA1_TX0ROT);                   R0004200
       SELECT          (STATUS_KODE);                                   R0004210
         WHEN            ('  ')                                         R0004220
           DO;                                                          R0004230
              W010_RETUR      =  '1'B;                                  R0004240
           END;                                                         R0004250
         WHEN            ('GB' , 'GE')                                  R0004260
           DO;                                                          R0004270
              W010_RETUR      =  '0'B;                                  R0004280
           END;                                                         R0004290
         OTHERWISE                                                      R0004300
           DO;                                                          R0004310
              /*   FEIL    UAKSEPTABEL KODE FRA DL1   */                R0004320
              FE_TEKST     =            FEILTYPE_TEKST(1);                      
              FE_DATA      =            DBD_NAVN !! STATUS_KODE;                
              W010_RETUR   =            '0'B;                           R0004330
              CALL         SKRIV_FEILLISTE;                             R0004000
           END;                                                         R0004340
       END;   /* SELECT                       */                        R0004350
       PUT DATA (W_TXT);                                                        
       FE_TEKST            =            FEILTYPE_TEKST(3);                      
       FE_DATA             =  HENT_TXTKODE!! DBD_NAVN !! STATUS_KODE;           
       CALL                SKRIV_FEILLISTE;                             R0004000
       HENT_TXTKODE        =           'A02';                                   
       RETURN             (W010_RETUR);                                 R0004360
 END LES_TXT1;                                                          R0004370
 %SKIP(2);                                                              R0015150
 TRANSLATE1:                                                            R0015160
    PROC;                                                               R0015170
    TXTLINJE             =       TRANSLATE  (TXTLINJE,VERDI,VAR);               
    FELLES_LINJE         =       TXTLINJE;                                      
    WRITE  FILE(LASER)   FROM    (FELLES_SKRIVELINJE_D);                        
 END TRANSLATE1;                                                        R0004370
 %SKIP(2);                                                              R0015150
 SKRIV_FEILLISTE:                                                       R0015160
    PROC;                                                               R0015170
    /*                                                               */ R0015180
    /* ************************************************************* */ R0015190
    /* SKRIVE-RUTINE FOR FEILLISTE                                   */ R0015200
    /* ************************************************************* */ R0015210
    /*                                                               */ R0015220
  %PAGE;                                                                P0000010
    IF ( FE_TELLER  >  40 ) ! ( FE_TELLER   <   1 )  THEN                       
       DO;                                                                      
          FEILLISTE_LINJE     =   FEH1_HEADING_D;                       P0000120
          WRITE FILE(FEIL)   FROM (FEILLISTE_SKRIVELINJE);              R0015230
          FEILLISTE_LINJE     =   FEH2_HEADING_D;                       P0000120
          WRITE FILE(FEIL)   FROM (FEILLISTE_SKRIVELINJE);              R0015230
          FE_SIDE            =    FE_SIDE   +   1;                              
          FE_TELLER           =   1;                                            
       END;                                                                     
    FEILLISTE_LINJE           =   FEILTYPE_LINJE_D;                     P0000120
    WRITE FILE(FEIL)        FROM (FEILLISTE_SKRIVELINJE);               R0015230
    FE_TELLER                 =   FE_TELLER    +   1;                           
 %SKIP(2);                                                              R0015300
 END SKRIV_FEILLISTE;                                                   R0015240
 END R001TRA;                                                           R0015700
