 /* ***************************************************************** */R0000010
 /*IDENTIFIKASJON:                                                    */R0000020
 /*    R0019905 - PROGRAM I PLI                                       */R0000030
 /*    PROGRAMMERT AV GEIR MARS 1981                                  */R0000040
 /*HENSIKT:                                                           */R0000050
 /*    FUNKSJONEN ANGIR TIDA FRA FØDSELSTIDSPUNKT TIL VIRKNINGSDATO   */R0000060
 /*BRUK:                                                              */R0000070
 /*    ALDERSBEREGNING PERSONER FØDT 1900 TIL 1999                    */R0000080
 /*    ALDERSBEREGNING PERSONER FØDT 1800 TIL 1899                    */R0000090
 /* ***************************************************************** */R0000100
 %SKIP (2);                                                             R0000110
 F_ALDER:                                                               R0000120
 PROC (FNR,VIRK_DATO)RETURNS(FIXED DEC(5));                             R0000130
   DCL                                                                  R0000140
      FNR         PIC'(11)9',                                           R0000150
      ALDER_Å_MND FIXED DEC(5),                                         R0000160
      VIRK_DATO   PIC '9999',                                           R0000170
      1 VIRK_DAT DEF VIRK_DATO,                                         R0000180
         2 VMND   PIC '(2)9',                                           R0000190
         2 VÅR    PIC '(2)9';                                           R0000200
   DCL                                                                  R0000210
      1 FNR_UP DEF FNR,                                                 R0000220
         2 FDAG   PIC '(2)9',                                           R0000230
         2 FMND   PIC '(2)9',                                           R0000240
         2 FÅR    PIC '(2)9',                                           R0000250
         2 POS_7  PIC '9',                                              R0000260
         2 FELT_3 PIC '(4)9';                                           R0000270
 %PAGE;                                                                 R0000280
   DCL                                                                  R0000290
      MOD BUILTIN,                                                      R0000300
      ABS BUILTIN,                                                      R0000310
      MNDF        FIXED DEC(5),                                         R0000320
      MNDROUND    FIXED DEC(5),                                         R0000330
      ANT_M       PIC 'S9999',                                          R0000340
      MND         PIC 'S(2)9',                                          R0000350
      ÅR          PIC 'S99';                                            R0000360
 /*                                                                   */R0000370
 /*                                                                   */R0000380
 /* ALDERSBEREGNING FOR PERSONER FØDT I TIDA 1900 TIL 1999            */R0000390
 /*                                                                   */R0000400
      IF POS_7 >= 0 & POS_7 < 5 THEN                                    R0000410
         ANT_M = VÅR*12 + VMND - FÅR*12 - FMND;                         R0000420
 /*                                                                   */R0000430
 /*                                                                   */R0000440
 /* ALDERSBEREGNING FOR PERSONER FØDT FØR ÅR 1900                     */R0000450
 /*                                                                   */R0000460
      ELSE                                                              R0000470
      IF POS_7 > 4 & POS_7 < 8 THEN                                     R0000480
         ANT_M = VÅR*12 + VMND - FÅR*12 - FMND + 1200;                  R0000490
      MNDF = ANT_M;                                                     R0000500
      MNDROUND = MNDF/12;                                               R0000510
      IF MNDF >= 0 THEN                                                 R0000520
         ALDER_Å_MND = MNDROUND*100 + MOD(MNDF,12);                     R0000530
      ELSE                                                              R0000540
         ALDER_Å_MND = MNDROUND*100 - MOD(ABS(MNDF),12);                R0000550
      RETURN (ALDER_Å_MND);                                             R0000560
   END F_ALDER;                                                         R0000570
