 /*       SIST ENDRET 13/03-98 13.36.01 AV   JDA7339                  */00000000
 /*       SIST ENDRET 13/03-98 13.20.46 AV   JDA7339                  */00000010
 /*       SIST ENDRET 25/02-94 13.13.00 AV   HERMAN                   */00000020
 /*       SIST ENDRET 01/11-93 15.35.09 AV   TRUDE                    */00000030
 /*       SIST ENDRET 06/03-91 14.09.40 AV   DYBVIK                   */00000040
 /******************************************************************* */00000050
 /*  IDENTIFIKASJON:                                                  */00000060
 /****************************                                        */00000070
 /*  PROGRAMIDENT : R001N820-KONTROLL E3TRANS MOT STATUS FOR FAMILIEN */00000080
 /*  PROGRAMSPRÅK : PLI/CICS                                          */00000090
 /*  PROGRAMMERER : TRUDE SPONBERG                                    */00000100
 /*  PROGRAMMET BLE LAGET I NOV 1990                                  */00000110
 /*  ****************************                                     */00000120
 /*  HENSIKT:                                                         */00000130
 /*      KONTROLLER EPTRANS MOT STATUS FOR FAMILIEN                   */00000140
 /*  PROGRAMTILKNYTNING:                                              */00000150
 /*      KALLES OPP AV PROGRAM R0013520                               */00000160
 /*  BRUK:                                                            */00000170
 /*      EXEC CICS XCTL PROGRAM ('R001N820') COMMAREA (KOM_OMR)       */00000180
 /*                                                                   */00000190
 /*  *****************************                                    */00000200
 /*  ENDRING                                                          */00000210
 /* ***************************************************************** */00000220
                                                                        00000230
  KON_E3:                                                               00000240
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000250
                                                                        00000260
 /* ***************************************************************** */00000270
 /* KOMM_OMR                                                          */00000280
 /* ***************************************************************** */00000290
                                                                        00000300
 %INCLUDE P0019908 ;                                                    00000310
                                                                        00000320
 /* ***************************************************************** */00000330
 /* MENY_OMR                                                          */00000340
 /* ***************************************************************** */00000350
                                                                        00000360
 %INCLUDE P0019906;                                                     00000370
                                                                        00000380
 /* ***************************************************************** */00000390
 /* TRANS_OMR                                                         */00000400
 /* ***************************************************************** */00000410
                                                                        00000420
 %INCLUDE P001N801;                                                     00000430
 %INCLUDE P0019910;                                                     00000440
 %INCLUDE P0019912;                                                     00000450
                                                                        00000460
 DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                         00000470
 DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                         00000480
 DCL COMMAREA_PEKER PTR;                                                00000490
 %PAGE;                                                                 00000500
 DCL   AVDØD_IND           FIXED BIN (15),                              00000510
       I                   FIXED BIN (15),                              00000520
       TILKNYTTET_SW       CHAR(1),                                     00000530
       STATUS_TYPE_SØKER   CHAR(1);                                     00000540
   DCL                                                                  00000550
       W_DØDSTP_ÅM                                    FIXED(5);         00000560
   DCL                                                                  00000570
       W_DØDSTP_ÅMD                                   PIC '999999',     00000580
       W_DØDSTP_ÅR     DEF W_DØDSTP_ÅMD      POS (1)  PIC '99',         00000590
 /*YS*/W_DØDSTP_MND    DEF W_DØDSTP_ÅMD      POS (3)  PIC '99',         00000600
 /*YS*/W_DØDSDATO_ÅM   DEF W_DØDSTP_ÅMD      POS (1)  PIC '9999';       00000610
   DCL                                                                  00000620
       W_VIRKDATO_ÅM                                  PIC '9999',       00000630
       W_VIRKDATO_ÅR   DEF W_VIRKDATO_ÅM     POS (1)  PIC '99',         00000640
       W_VIRKDATO_MND  DEF W_VIRKDATO_ÅM     POS (3)  PIC '99';         00000650
   DCL                                                                  00000660
       W_ALDER_ÅM                                 PIC '9999';           00000670
                                                                        00000680
   DCL                                                                  00000690
       FNR                           PIC '(11)9',                       00000700
       FNR_MÅ POS (3)  DEF  FNR      PIC '9999',                        00000710
       FNR_ÅR POS (5)  DEF  FNR      PIC '99',                          00000720
       FNR_ÅRHUNDRE POS(7)  DEF  FNR PIC '9',                           00000730
       SEKSTISJUÅRSDATO_SØKER        PIC '99999';                       00000740
                                                                        00000750
   DCL                                                                  00000760
       FNR_EK                               PIC '(11)9',                00000770
       FNR_EK_MÅ POS (3)  DEF  FNR_EK       PIC '9999',                 00000780
       FNR_EK_ÅR POS (5)  DEF  FNR_EK       PIC '99',                   00000790
       FNR_EK_ÅRHUNDRE POS(7)  DEF  FNR_EK  PIC '9',                    00000800
       SEKSTISJUÅRSDATO_EK                  PIC '99999';                00000810
                                                                        00000820
   DCL                                                                  00000830
      1 ALDER_67_SØKER   DEF SEKSTISJUÅRSDATO_SØKER,                    00000840
        2 ÅR           PIC '999',                                       00000850
        2 MND          PIC '99';                                        00000860
   DCL                                                                  00000870
      1 ALDER_67_EK      DEF SEKSTISJUÅRSDATO_EK,                       00000880
        2 ÅR           PIC '999',                                       00000890
        2 MND          PIC '99';                                        00000900
                                                                        00000910
   DCL                                                                  00000920
      W_STI_ÅM        PIC '9999' INIT ('0'),                            00000930
      W_STI_ÅR   POS(1) DEF W_STI_ÅM  PIC '99',                         00000940
      W_STI_M    POS(3) DEF W_STI_ÅM  PIC '99';                         00000950
                                                                        00000960
   DCL                                                                  00000970
      TT_SØKER        FIXED DEC (5),                                    00000980
      TT_AVDØD        FIXED DEC (5);                                    00000990
                                                                        00001000
    DCL TT_RED        CHAR (1) INIT (' ');  /*TRUDE PGA N824 I N620*/   00001010
                                            /* 011193*/                 00001020
 /* ***************************************************************** */00001030
 /* HER BEGYNNER PROGRAMMET KON_EP                                    */00001040
 /* ENDRET 11/1-85 AV KARIN : SAVING AV SØKERS STATUS_TYPE            */00001050
 /* ***************************************************************** */00001060
                                                                        00001070
 PROGRAM_ID      = 'R001N820';                                          00001080
 I               = 0;                                                   00001090
 TRANSTYPE       = ' 3';                                                00001100
 STATUS_TYPE_SØKER = STATUS_TYPE;                                       00001110
                                                                        00001120
 FNR             = E3S.FNR;                                             00001130
 FNR_EK          = E3S.FNR_EK;                                          00001140
                                                                        00001150
 IF FNR_ÅRHUNDRE  < 5   THEN                                            00001160
       SEKSTISJUÅRSDATO_SØKER  = F_SNU_DATO(FNR_MÅ) + 6700;             00001170
 ELSE                                                                   00001180
       SEKSTISJUÅRSDATO_SØKER  = F_SNU_DATO(FNR_MÅ) + 6700 - 1000;      00001190
                                                                        00001200
 IF FNR_EK_ÅRHUNDRE  < 5   THEN                                         00001210
   SEKSTISJUÅRSDATO_EK   = F_SNU_DATO(FNR_EK_MÅ) + 6700;                00001220
 ELSE                                                                   00001230
   SEKSTISJUÅRSDATO_EK   = F_SNU_DATO(FNR_EK_MÅ) + 6700 - 1000;         00001240
                                                                        00001250
 /* ***************************************************************** */00001260
 /* AVDØD EKTEFELLES INDEX FINNES.                                    */00001270
 /* ***************************************************************** */00001280
                                                                        00001290
  IF SØKER_IND = 1 THEN                                                 00001300
     AVDØD_IND = 2;                                                     00001310
  ELSE                                                                  00001320
     AVDØD_IND = 1;                                                     00001330
                                                                        00001340
 /*AFP:SØKER ER AFP-PENSJONIST. FOR Å FÅ EP, MÅ VI HA          */       00001350
 /*    OPPHØRSBLANKETT FØRST.BLANKETT AVVISES.TRUDE 080289     */       00001360
 /*AFP*/                                                                00001370
 /*AFP*/ IF B01.PENSJONSTYPE1(SØKER_IND)  = 'K'  THEN                   00001380
 /*AFP*/    DO;                                                         00001390
 /*AFP*/       FEIL_MELD_NR  = 1735;                                    00001400
 /*AFP*/       GO TO L999;                                              00001410
 /*AFP*/    END;                                                        00001420
                                                                        00001430
 /* ***************************************************************** */00001440
 /* AVDØDE ER OPPGITT PÅ BLANKETTEN - FNR ULIK 11111111111            */00001450
 /* ***************************************************************** */00001460
                                                                        00001470
 IF E3S.FNR_EK ^= (11)'1' THEN                                          00001480
    DO;                                                                 00001490
                                                                        00001500
 /* ***************************************************************** */00001510
 /* DERSOM AVDØD IKKE ER LEST INN I B01.                              */00001520
 /* ***************************************************************** */00001530
       IF B01.FNR(AVDØD_IND) = 0 THEN                                   00001540
          DO;                                                           00001550
             DØD = '1'B;                                                00001560
             SEARCH_FNR  = E3S.FNR_EK;                                  00001570
             POS_I_B01   = AVDØD_IND;                                   00001580
             EXEC CICS LINK PROGRAM ('R0019928') COMMAREA (KOM_OMR);    00001590
             IF FEIL_MELD_NR > 0 THEN                                   00001600
                GO   TO L999;                                           00001610
             ELSE                                                       00001620
                PROGRAM_ID = 'R001N820';                                00001630
             DØD = '0'B;                                                00001640
                                                                        00001650
 /* ***************************************************************** */00001660
 /* KONTROLLERER OM AVDØD ER KJENT OG ER DØD I BASEN.                 */00001670
 /* ***************************************************************** */00001680
                                                                        00001690
             IF B01.FNR(AVDØD_IND) = 0 !                                00001700
                (B01.FNR(AVDØD_IND) > 0 &                               00001710
                B01.DØDSDATO_ÅMD(AVDØD_IND) = 0) THEN                   00001720
                DO;                                                     00001730
  L100:                                                                 00001740
                   FEIL_VED_LABEL = '100';                              00001750
                   FEIL_MELD_NR   = 1710;                               00001760
                   GO TO L999;                                          00001770
                END;                                                    00001780
             ELSE                                                       00001790
                                                                        00001800
 /* ***************************************************************** */00001810
 /*  EKTEFELLEN ER DØD OG SØKEREN HAR IKKE PENSJONSSTATUS.            */00001820
 /* ***************************************************************** */00001830
                                                                        00001840
                IF B01.PENSJONSTYPE1 (SØKER_IND) = ' ' !                00001850
                   B01.STATUS_KODE_HIST (SØKER_IND) ^= ' ' THEN         00001860
                                                                        00001870
 /* ***************************************************************** */00001880
 /*  SØKEREN ER I BASEN MED INNTEKTER OG HISTORIKK.                   */00001890
 /* ***************************************************************** */00001900
                                                                        00001910
                   DO;                                                  00001920
                      B02.TKNR  (SØKER_IND) =  E3S.TKNR;                00001930
                      B02.NAVN  (SØKER_IND) =  E3S.NAVN;                00001940
                      B02.SPRÅK (SØKER_IND) =  E3S.SPRÅK;               00001950
                      IF B01.FNR(SØKER_IND) > 0 THEN                    00001960
                         CALL                                           00001970
                         FLYTT_B01_TIL_B02(SØKER_IND);                  00001980
                      ELSE                                              00001990
                                                                        00002000
 /* ***************************************************************** */00002010
 /*  SØKEREN ER IKKE I BASEN.                                         */00002020
 /*  ENDRING 11/1-85 AV KARIN: RUTINEN OPPRETT_STATUS_EP_SØKER        */00002030
 /* ***************************************************************** */00002040
                                                                        00002050
                         B02.FNR   (SØKER_IND) =  E3S.FNR;              00002060
                      B02.PERSON(AVDØD_IND) = B01.PERSON(AVDØD_IND);    00002070
                      CALL                                              00002080
                         OPPRETT_STATUS_E3_SØKER; /* R001N821 */        00002090
 /*YS*/                  IF FEIL_MELD_NR > 0  THEN                      00002100
 /*YS*/                     GO TO L999;                                 00002110
                                                                        00002120
                      CALL                                              00002130
                         KOBLE_TO_PERSONER(SØKER_IND,AVDØD_IND);        00002140
                   END;                                                 00002150
                ELSE                                                    00002160
                   DO;                                                  00002170
                                                                        00002180
 /* ***************************************************************** */00002190
 /*  SØKEREN HAR PENSJONSSTATUS.                                      */00002200
 /* ***************************************************************** */00002210
                                                                        00002220
                      IF B01.TKNR(SØKER_IND) > 0  THEN                  00002230
                         IF B01.TKNR(SØKER_IND) ^= E3S.TKNR THEN        00002240
                            DO;                                         00002250
  L110:                                                                 00002260
                               FEIL_VED_LABEL = '110';                  00002270
                               FEIL_MELD_NR   = 1702;                   00002280
                               GO TO L999;                              00002290
                            END;                                        00002300
                      SELECT (B01.STATUS.SIVILSTAND(SØKER_IND));        00002310
                                                                        00002320
 /* ***************************************************************** */00002330
 /*  SØKEREN ER UGIFT.                                                */00002340
 /*  SIVILSTAND 'U' På BLANKETTEN ER TILLATT VED YRKESSKADE.    *//*YS*/00002350
 /*  SØKEREN HAR DA VÆRT SAMBOER MED AVDØDE.                    *//*YS*/00002360
 /* ***************************************************************** */00002370
                                                                        00002380
                         WHEN('U')                                      00002390
                            DO;                                         00002400
 /*YS*/                        IF E3S.SIVILSTAND ^= 'U' THEN            00002410
 /*YS*/                           DO;                                   00002420
  L120:                                                                 00002430
                                     FEIL_VED_LABEL = '120';            00002440
                                     FEIL_MELD_NR = 1407;               00002450
                                     GO TO L999;                        00002460
 /*YS*/                           END;                                  00002470
 /*YS*/                        ELSE                                     00002480
 /*YS*/                           DO;                                   00002490
 /*YS*/                              CALL                               00002500
 /*YS*/                              FLYTT_B01_TIL_B02(SØKER_IND);      00002510
 /*YS*/                              B02.PERSON(AVDØD_IND) =            00002520
 /*YS*/                                    B01.PERSON(AVDØD_IND);       00002530
 /*YS*/                              CALL                               00002540
 /*YS*/                              AJOURFØR_B02_MED_E3_TRANS;         00002550
 /*YS*/                              IF FEIL_MELD_NR > 0   THEN         00002560
 /*YS*/                                 GO TO L999;                     00002570
 /*YS*/                              CALL                               00002580
 /*YS*/                              KOBLE_TO_PERSONER                  00002590
 /*YS*/                              (SØKER_IND,AVDØD_IND);             00002600
 /*YS*/                           END;                                  00002610
                            END;                                        00002620
                                                                        00002630
 /* ***************************************************************** */00002640
 /*  SØKEREN ER SKILT.                                                */00002650
 /* ***************************************************************** */00002660
                                                                        00002670
                        WHEN('S')                                       00002680
                           DO;                                          00002690
                              IF E3S.SIVILSTAND ='E' THEN               00002700
                                 DO;                                    00002710
  L130:                                                                 00002720
                                    FEIL_VED_LABEL = '130';             00002730
                                    FEIL_MELD_NR   = 1409;              00002740
                                    GO TO L999;                         00002750
                                 END;                                   00002760
                              ELSE                                      00002770
                                 DO;                                    00002780
                                    CALL                                00002790
                                    FLYTT_B01_TIL_B02(SØKER_IND);       00002800
                                    B02.PERSON(AVDØD_IND) =             00002810
                                          B01.PERSON(AVDØD_IND);        00002820
                                    CALL                                00002830
                                    AJOURFØR_B02_MED_E3_TRANS;          00002840
 /*YS*/                             IF FEIL_MELD_NR > 0  THEN           00002850
 /*YS*/                                GO TO L999;                      00002860
                                    CALL                                00002870
                                    KOBLE_TO_PERSONER                   00002880
                                    (SØKER_IND,AVDØD_IND);              00002890
                                 END;                                   00002900
                           END;                                         00002910
                                                                        00002920
 /* ***************************************************************** */00002930
 /*  SØKEREN MÅ VÆRE ETTERLATT                                        */00002940
 /* ***************************************************************** */00002950
                                                                        00002960
                        WHEN('E')                                       00002970
                           DO;                                          00002980
                              IF E3S.SIVILSTAND ='S' THEN               00002990
                                 DO;                                    00003000
      L140:                                                             00003010
                                    FEIL_VED_LABEL = '140';             00003020
                                    FEIL_MELD_NR   = 1410;              00003030
                                    GO TO L999;                         00003040
                                 END;                                   00003050
                              ELSE                                      00003060
                                 DO;                                    00003070
                                    CALL                                00003080
                                    FLYTT_B01_TIL_B02(SØKER_IND);       00003090
                                    B02.PERSON(AVDØD_IND) =             00003100
                                              B01.PERSON(AVDØD_IND);    00003110
                                    CALL                                00003120
                                     AJOURFØR_B02_MED_E3_TRANS;         00003130
 /*YS*/                              IF FEIL_MELD_NR > 0  THEN          00003140
 /*YS*/                                 GO TO L999;                     00003150
                                    CALL                                00003160
                                     KOBLE_TO_PERSONER                  00003170
                                           (SØKER_IND,AVDØD_IND);       00003180
                                 END;                                   00003190
                           END;                                         00003200
                        OTHERWISE                                       00003210
                           DO;                                          00003220
  L145:                                                                 00003230
                              FEIL_VED_LABEL = '145';                   00003240
                              FEIL_MELD_NR   = 1412;                    00003250
                              GO TO L999;                               00003260
                           END;                                         00003270
                      END; /* END SELECT */                             00003280
                   END;    /* END SØKER HAR PENSJONSSTATUS */           00003290
          END;             /* END AVDØD IKKE I B01 */                   00003300
       ELSE                                                             00003310
                                                                        00003320
 /* ***************************************************************** */00003330
 /*  AVDØD ER I B01-D.V.S KNYTTET TIL SØKEREN I BASEN.                */00003340
 /*  SØKER OG AVDØDE BEHØVER IKKE Å VÆRE TILKNYTTET HVERANDRE,        */00003350
 /*  HVIS SØKER FYLLER 67/70 ÅR MELLOM TRANSDATO OG DAGENS-DATO KAN   */00003360
 /*  BEGGE LIGGE I B01 UTEN Å VÆRE TILKNYTTET                         */00003370
 /* ***************************************************************** */00003380
                                                                        00003390
          DO;                                                           00003400
             IF B01.TKNR(SØKER_IND) > 0 THEN                            00003410
                IF B01.TKNR(SØKER_IND) ^= E3S.TKNR THEN                 00003420
                   DO;                                                  00003430
  L150:                                                                 00003440
                      FEIL_VED_LABEL = '150';                           00003450
                      FEIL_MELD_NR   = 1702;                            00003460
                      GO TO L999;                                       00003470
                   END;                                                 00003480
                SELECT (B01.STATUS.SIVILSTAND(SØKER_IND));              00003490
                                                                        00003500
 /* ***************************************************************** */00003510
 /*  SØKEREN ER GIFT, SAMBOER ELLER PARTNER   (W OG P 11.93 JD)       */00003520
 /* ***************************************************************** */00003530
                                                                        00003540
                   WHEN('G','A','W','P')                                00003550
                                                                        00003560
 /* ***************************************************************** */00003570
 /*  EKTEFELLEN ER IKKE REGISTRERT SOM DØD I BASEN.                   */00003580
 /* ***************************************************************** */00003590
                                                                        00003600
                      DO;                                               00003610
                        IF B01.FNR(AVDØD_IND) = E3S.FNR_EK THEN         00003620
                           DO;                                          00003630
  L160:                                                                 00003640
                              FEIL_VED_LABEL = '160';                   00003650
                              FEIL_MELD_NR   = 1710;                    00003660
                              GO TO L999;                               00003670
                           END;                                         00003680
                        ELSE                                            00003690
                                                                        00003700
 /* ***************************************************************** */00003710
 /*  SØKEREN ER GIFT MED EN ANNEN.                                    */00003720
 /* ***************************************************************** */00003730
                                                                        00003740
                           DO;                                          00003750
  L170:                                                                 00003760
                              FEIL_VED_LABEL = '170';                   00003770
                              FEIL_MELD_NR   = 1408;                    00003780
                              GO TO L999;                               00003790
                           END;                                         00003800
                      END;                                              00003810
                                                                        00003820
 /* ***************************************************************** */00003830
 /*  SØKEREN ER ETTERLATT MED/UTEN TILKNYTTING TIL AVDØDE             */00003840
 /* ***************************************************************** */00003850
                                                                        00003860
                   OTHERWISE                                            00003870
                      DO;                                               00003880
                        IF B01.FNR(AVDØD_IND) = E3S.FNR_EK THEN         00003890
                                                                        00003900
 /* ***************************************************************** */00003910
 /*  DET ER DEN SAMME AVDØD.                                          */00003920
 /* ***************************************************************** */00003930
                                                                        00003940
                           DO;                                          00003950
                              IF E3S.SIVILSTAND ^=                      00003960
                                  B01.STATUS.SIVILSTAND(SØKER_IND) THEN 00003970
                                 DO;                                    00003980
  L180:                                                                 00003990
                                    FEIL_VED_LABEL = '180';             00004000
                                    FEIL_MELD_NR   = 1410;              00004010
                                    GO TO L999;                         00004020
                                 END;                                   00004030
                              ELSE                                      00004040
                                 DO;                                    00004050
                                    CALL                                00004060
                                      FLYTT_B01_TIL_B02(SØKER_IND);     00004070
                                    B02.PERSON(AVDØD_IND) =             00004080
                                            B01.PERSON(AVDØD_IND);      00004090
                                    CALL                                00004100
                                     AJOURFØR_B02_MED_E3_TRANS;         00004110
 /*YS*/                             IF FEIL_MELD_NR > 0  THEN           00004120
 /*YS*/                                GO TO L999;                      00004130
                                 /* ENDRET AV KARIN 19/1-84      */     00004140
                                 /* TESTE OM TILKNYTTING MANGLER */     00004150
                                    TILKNYTTET_SW = 'N';                00004160
                                    DO I = 1 TO 13 WHILE                00004170
                                     (B01.FNR_TILKN(AVDØD_IND,I) > 0);  00004180
                                     IF B01.FNR_TILKN(AVDØD_IND,I) =    00004190
                                       B01.FNR(SØKER_IND) THEN          00004200
                                       TILKNYTTET_SW = 'J';             00004210
                                    END;                                00004220
                                    IF TILKNYTTET_SW = 'N' THEN         00004230
                                      CALL KOBLE_TO_PERSONER            00004240
                                          (SØKER_IND,AVDØD_IND);        00004250
                                 /* ENDRINGEN SLUTTER HER, KS 19/1-84 */00004260
                                 END;                                   00004270
                           END;                                         00004280
                                                                        00004290
 /* ***************************************************************** */00004300
 /*  DET ER IKKE DEN SAMME AVDØD.                                     */00004310
 /* ***************************************************************** */00004320
                                                                        00004330
                        ELSE                                            00004340
                           DO;                                          00004350
  L190:                                                                 00004360
                              FEIL_VED_LABEL = '190';                   00004370
                              FEIL_MELD_NR   = 1408;                    00004380
                              GO TO L999;                               00004390
                           END;                                         00004400
                      END;                                              00004410
                END;  /* END SELECT     */                              00004420
          END;        /*AVDØD ER I B01 */                               00004430
    END;              /*AVDØD ER OPPGITT PÅ BLANKETTEN */               00004440
 ELSE                                                                   00004450
    DO;                                                                 00004460
 /* ***************************************************************** */00004470
 /*  AVDØD EKTEFELLE ER UOPPGITT  - ENDRET AV KARIN 21/2-84           */00004480
 /* ***************************************************************** */00004490
 /* ***************************************************************** */00004500
 /* DERSOM AVDØD ER LEST INN I B01. (DETTE ER FEIL)                   */00004510
 /* ***************************************************************** */00004520
                                                                        00004530
       IF B01.FNR(AVDØD_IND) > 0 THEN                                   00004540
          DO;                                                           00004550
  L200:                                                                 00004560
              FEIL_VED_LABEL = '200';                                   00004570
              FEIL_MELD_NR   = 1715;                                    00004580
              GO TO L999;                                               00004590
             /* FEIL - UOPPGITT EKTEFELLE På BLANKETTEN */              00004600
          END;                                                          00004610
                                                                        00004620
                                                                        00004630
                                                                        00004640
 /* ***************************************************************** */00004650
 /*  HAR SØKER PENSJONSSTATUS, INNTEKTER , HISTORIKK?                 */00004660
 /* ***************************************************************** */00004670
                                                                        00004680
       IF B01.PENSJONSTYPE1 (SØKER_IND) = ' ' !                         00004690
          B01.STATUS_KODE_HIST (SØKER_IND) ^= ' ' THEN                  00004700
                                                                        00004710
 /* ***************************************************************** */00004720
 /*  SØKEREN ER I BASEN MED INNTEKTER OG HISTORIKK.                   */00004730
 /* ***************************************************************** */00004740
                                                                        00004750
          DO;                                                           00004760
             B02.TKNR  (SØKER_IND) =  E3S.TKNR;                         00004770
             B02.NAVN  (SØKER_IND) =  E3S.NAVN;                         00004780
             B02.SPRÅK (SØKER_IND) =  E3S.SPRÅK;                        00004790
             IF B01.FNR(SØKER_IND) > 0 THEN                             00004800
                CALL                                                    00004810
                 FLYTT_B01_TIL_B02(SØKER_IND);                          00004820
             ELSE                                                       00004830
                                                                        00004840
 /* ***************************************************************** */00004850
 /*  SØKEREN ER IKKE I BASEN.                                         */00004860
 /* ***************************************************************** */00004870
                                                                        00004880
                 B02.FNR   (SØKER_IND) =  E3S.FNR;                      00004890
                                                                        00004900
              CALL                                                      00004910
                OPPRETT_STATUS_E3_SØKER;                                00004920
 /*YS*/       IF FEIL_MELD_NR > 0         THEN                          00004930
 /*YS*/          GO TO L999;                                            00004940
          END;                                                          00004950
       ELSE                                                             00004960
          DO;                                                           00004970
                                                                        00004980
 /* ***************************************************************** */00004990
 /*  SØKEREN HAR PENSJONSSTATUS.                                      */00005000
 /* ***************************************************************** */00005010
                                                                        00005020
             IF B01.TKNR(SØKER_IND) > 0  THEN                           00005030
                IF B01.TKNR(SØKER_IND) ^= E3S.TKNR THEN                 00005040
                   DO;                                                  00005050
             L210:                                                      00005060
                      FEIL_VED_LABEL = '210';                           00005070
                      FEIL_MELD_NR   = 1702;                            00005080
                      GO TO L999;                                       00005090
                   END;                                                 00005100
                                                                        00005110
             SELECT (B01.STATUS.SIVILSTAND(SØKER_IND));                 00005120
                                                                        00005130
 /* ***************************************************************** */00005140
 /*  SØKEREN ER UGIFT.                                                */00005150
 /*YS      FØDSELSNUMMER AVDØD ER IKKE OPPGITT.  YRKESSKADE OG SIV=U  */00005160
 /*YS      SKAL IKKE FOREKOMME.                                       */00005170
 /* ***************************************************************** */00005180
                                                                        00005190
                WHEN('U')                                               00005200
                   DO;                                                  00005210
              L220:                                                     00005220
                      FEIL_VED_LABEL = '220';                           00005230
                      FEIL_MELD_NR = 1407;                              00005240
                      GO TO L999;                                       00005250
                   END;                                                 00005260
                                                                        00005270
 /* ***************************************************************** */00005280
 /*  SØKEREN ER SKILT.                                                */00005290
 /*YS      FØDSELSNUMMER AVDØD ER IKKE OPPGITT.  YRKESSKADE OG SIV=U  */00005300
 /*YS      SKAL IKKE FOREKOMME.                                       */00005310
 /* ***************************************************************** */00005320
                                                                        00005330
                WHEN('S')                                               00005340
                   DO;                                                  00005350
                      IF E3S.SIVILSTAND ='E' THEN                       00005360
                         DO;                                            00005370
                L230:                                                   00005380
                            FEIL_VED_LABEL = '230';                     00005390
                            FEIL_MELD_NR   = 1409;                      00005400
                            GO TO L999;                                 00005410
                          END;                                          00005420
                       ELSE                                             00005430
                          DO;                                           00005440
                             CALL                                       00005450
                              FLYTT_B01_TIL_B02(SØKER_IND);             00005460
                             CALL                                       00005470
                              AJOURFØR_B02_MED_E3_TRANS;                00005480
 /*YS*/                      IF FEIL_MELD_NR > 0    THEN                00005490
 /*YS*/                         GO TO L999;                             00005500
                          END;                                          00005510
                   END;                                                 00005520
                                                                        00005530
 /* ***************************************************************** */00005540
 /*  SØKEREN MÅ VÆRE ETTERLATT                                        */00005550
 /*YS      FØDSELSNUMMER AVDØD ER IKKE OPPGITT.  YRKESSKADE OG SIV=U  */00005560
 /*YS      SKAL IKKE FOREKOMME.                                       */00005570
 /* ***************************************************************** */00005580
                                                                        00005590
                WHEN('E')                                               00005600
                   DO;                                                  00005610
                      IF E3S.SIVILSTAND ='S' THEN                       00005620
                         DO;                                            00005630
          L240:                                                         00005640
                            FEIL_VED_LABEL = '240';                     00005650
                            FEIL_MELD_NR   = 1410;                      00005660
                            GO TO L999;                                 00005670
                         END;                                           00005680
                      ELSE                                              00005690
                         DO;                                            00005700
                            CALL                                        00005710
                              FLYTT_B01_TIL_B02(SØKER_IND);             00005720
                            CALL                                        00005730
                                 AJOURFØR_B02_MED_E3_TRANS;             00005740
 /*YS*/                     IF FEIL_MELD_NR > 0    THEN                 00005750
 /*YS*/                        GO TO L999;                              00005760
                         END;                                           00005770
                   END;                                                 00005780
                OTHERWISE                                               00005790
                   DO;                                                  00005800
           L245:                                                        00005810
                      FEIL_VED_LABEL = '245';                           00005820
                      FEIL_MELD_NR   = 1412;                            00005830
                      GO TO L999;                                       00005840
                   END;                                                 00005850
             END;        /* END SELECT */                               00005860
          END;           /* END SØKER HAR PENSJONSSTATUS */             00005870
    END;                 /* END AVDØD ER UOPPGITT        */             00005880
                                                                        00005890
                                                                        00005900
  L999:                                                                 00005910
  EXEC CICS PURGE MESSAGE;                                              00005920
  EXEC CICS RETURN;                                                     00005930
  %INCLUDE R0019905;    /*F_ALDER                               */      00005940
  %INCLUDE R0019913;    /*F_SNU_DATO                            */      00005950
  %INCLUDE R0019926;    /*FLYTT_B01_TIL_B02                     */      00005960
  %INCLUDE R0019924;    /*KOBLE_TO_PERSONER                     */      00005970
  %INCLUDE R0019949;    /*BEREGNER TT_FRAMT                     */      00005980
  %INCLUDE R0019965;    /*F_DATO_ÅM_PLUSS1                      *//*YS*/00005990
  %INCLUDE R001N821;    /*OPPRETT_STATUS_EP_SØKER               */      00006000
  %INCLUDE R001N822;    /*AJOURFØR_B02_MED_EP_TRANS             */      00006010
  %INCLUDE R001N823;    /*KONTROLL_AJOURFØR_AVDØD_YP_E3         */      00006020
  %INCLUDE R001N824;    /*F_BEREGN_TT_FRAMT_UTLAND              */      00006030
    %INCLUDE R0019968;  /* F_RULL_FORSI              */                 00006040
 END KON_E3;                                                            00006050
