 /*       SIST ENDRET 24/10-97 11.55.26 AV   JDA7339                  */00000000
 /*       SIST ENDRET 04/08-97 14.09.00 AV   JDA7339                  */00000010
 /*       SIST ENDRET 11/02-97 10.33.42 AV   JDA7339                  */00000020
 /*       SIST ENDRET 23/06-95 11.59.38 AV   JDA0310                  */00000030
 /*       SIST ENDRET 31/10-94 09.13.33 AV   JDA0310                  */00000040
 /*       SIST ENDRET 27/10-94 09.31.20 AV   JDA0310                  */00000050
 /*       SIST ENDRET 15/03-94 13.48.52 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 25/02-94 12.33.33 AV   HERMAN                   */00000070
 /*IDENTIFIKASJON:                                                    */00000080
 /*    R001UE02  -                                                    */00000090
 /*    PROGRAMMERER: JAN, AUGUST 81                                   */00000100
 /*HENSIKT:                                                           */00000110
 /*    R001UE02 INNHOLDER:                                            */00000120
 /*      PROSEDYRER FOR BLANKING AV EN_TRANS_OMR.                     */00000130
 /*ENDRING:                                                           */00000140
 /*    PROSEDYRE FOR BLANKING AV EN_MAP OG PROSEDYRER FOR OVERFØRING  */00000150
 /*    AV DATA FRA SKJERMBILDE TIL EN_TRANS_OMR. ER SKILT UT OG LAGT  */00000160
 /*    I R001UE09.                                  070587  BRITT     */00000170
 /*PROGRAMTILKNYTNING:                                                */00000180
 /*    PROSEDYRENE INCLUDES I BEHANDLINGA AV ENDRINGSBLANKETTER TIL   */00000190
 /*    DET MASKINELLE FOLKETRYGDSYSTEMET.                             */00000200
 /*    ARBEIDSOMRÅDE: P001UE01  (LIGGER I R001.TEST.COPYLIB)          */00000210
 /*BRUK:                                                              */00000220
 /*    %INCLUDE R001UE02;                                             */00000230
 /*    BLANK_EN_SØKER:    BLANKER SØKERDELEN                          */00000240
 /*    BLANK_EN_KAP7:     BLANKER KAPITTEL 7                          */00000250
 /*    BLANK_EN_KAP8:     BLANKER KAPITTEL 8                          */00000260
 /*    BLANK_EN_KAP10:    BLANKER KAPITTEL 10                         */00000270
 /*    BLANK_EN_KAP11:    BLANKER KAPITTEL 11     *//*YS*//*          */00000280
 /*    BLANK_EN_INNTEKT   BLANKER INNTEKTENE                          */00000290
 /*    BLANK_EN_MELDNR:   SETTER 0 I MELDINGSNUMMERNE                 */00000300
 %PAGE;                                /*   */                          00000310
 /* ***************************************************************** */00000320
 /*                                                                   */00000330
 /*    PROSEDYREN BLANKER EN_SØKERDELEN I EN_TRANS_OMR I              */00000340
 /*    KOM_OMR FOR ENDRINGSBLANKETTER.                                */00000350
 /*                                                                   */00000360
 /* ***************************************************************** */00000370
 %SKIP(2);                             /*   */                          00000380
 BLANK_EN_SØKER:                                                        00000390
   PROC;                                                                00000400
      ENS.REGDATO        = 0;                                           00000410
      ENS.TERMID         = '    ';                                      00000420
      ENS.FNR            = 0;                                           00000430
      ENS.FNR_GML        = 0;                                           00000440
      ENS.TKNR           = 0;                                           00000450
      ENS.SPRÅK          = ' ';                                         00000460
      ENS.VIRK_DATO_MÅ   = 0;                                           00000470
      ENS.NAVN_NYTT      = (25)' ';                                     00000480
      ENS.NAVN_NYTT_EK   = (25)' ';                                     00000490
      ENS.FNR_EK         = 0;                                           00000500
      ENS.FNR_GML_EK     = 0;                                           00000510
      ENS.NAVN_EK        = (25)' ';                                     00000520
      ENS.SKILSMISSE     = ' ';                                         00000530
      ENS.FLYTTET_FRA    = ' ';                                         00000540
      ENS.FLYTTET_SAMMEN = ' ';                                         00000550
      ENS.OPPHØR_SAMBO   = ' ';                                         00000560
      ENS.EK_INNT_OVER_2G = ' ';                                        00000570
      ENS.SIVILSTAND     = ' ';                                         00000580
   END BLANK_EN_SØKER;                                                  00000590
 %PAGE;                                /*   */                          00000600
 /* ***************************************************************** */00000610
 /*                                                                   */00000620
 /*    PROSEDYREN BLANKER EN_KAPITTEL 7 I EN_TRANS_OMR I              */00000630
 /*    KOM_OMR FOR ENDRINGSBLANKETTER.                                */00000640
 /*                                                                   */00000650
 /* ***************************************************************** */00000660
 %SKIP;                                                                 00000670
 BLANK_EN_KAP7:                                                         00000680
   PROC;                                                                00000690
      ENK7.FAI     = 9999999;                                           00000700
   END BLANK_EN_KAP7;                                                   00000710
 %PAGE;                                /*   */                          00000720
 /* ***************************************************************** */00000730
 /*                                                                   */00000740
 /*    PROSEDYREN BLANKER EN_KAPITTEL 8 I EN_TRANS_OMR I              */00000750
 /*    KOM_OMR FOR ENDRINGSBLANKETTER.                                */00000760
 /*                                                                   */00000770
 /* ***************************************************************** */00000780
 %SKIP(2);                                                              00000790
 BLANK_EN_KAP8:                                                         00000800
   PROC;                                                                00000810
      ENK8.UFG  = 999;                                                  00000820
      ENK8.TIDSBEGR_ATTF = 0;                                           00000830
      ENK8.SKJERM_ATTF = 0;                                             00000840
      ENK8.FRYSP_3ÅR_ARB = 0;                                           00000850
      ENK8.FRYSP_TIDSB = 0;                                             00000860
      ENK8.INNTEKT_FØR_UP  = 0;                                         00000870
      ENK8.INNT_DATO_MÅ    = 0;                                         00000880
   END BLANK_EN_KAP8;                                                   00000890
 %PAGE;                                /*   */                          00000900
 /* ***************************************************************** */00000910
 /*                                                                   */00000920
 /*    PROSEDYREN BLANKER EN_KAPITTEL 10 I EN_TRANS_OMR I             */00000930
 /*    KOM_OMR FOR ENDRINGSBLANKETTER.                                */00000940
 /*                                                                   */00000950
 /* ***************************************************************** */00000960
 %SKIP(2);                                                              00000970
 BLANK_EN_KAP10:                                                        00000980
   PROC;                                                                00000990
      ENK10.FORVENTET_INNT = 9999999;                                   00001000
      ENK10.O_TIL_PENSJON  = ' ';                                       00001010
      ENK10.TP_PROSENT     = 999;                                       00001020
      ENK10.FRAML_DATO_MÅ  = 0;                                         00001030
      ENK10.OPPHØR_EO      = ' ';                                       00001040
   END BLANK_EN_KAP10;                                                  00001050
 %PAGE;                                                                 00001060
 /* *********************************************************** */      00001070
 /*                                                             */      00001080
 /*    PROSEDYREN BLANKER EN_KAPITTEL 11 I EN_TRANS_OMR I       */      00001090
 /*    KOM_OMR FOR ENDRINGSBLANKETTER.                          */      00001100
 /*                                                             */      00001110
 /* *********************************************************** */      00001120
 %SKIP(2);                                                              00001130
 BLANK_EN_KAP11:                                                        00001140
   PROC;                                                                00001150
      ENK11.YUG   = 999;                                                00001160
   END BLANK_EN_KAP11;                                                  00001170
 /* *********************************************************** */      00001180
 /*                                                             */      00001190
 /*    PROSEDYREN BLANKER EN_INNTEKT                            */      00001200
 /*    KOM_OMR FOR ENDRINGSBLANKETTER.                          */      00001210
 /*                                                             */      00001220
 /* *********************************************************** */      00001230
 %SKIP(2);                                                              00001240
 BLANK_EN_INNTEKT: PROC;                                                00001250
      EN_INNTEKT.PENSJONSINNT_SØKER = 999999;                           00001260
      EN_INNTEKT.PENSJONSINNT_EK    = 999999;                           00001270
      EN_INNTEKT.ARBEIDSINNT_SØKER =  999999;                           00001280
      EN_INNTEKT.ARBEIDSINNT_EK    =  999999;                           00001290
      EN_INNTEKT.MINST_4G          =  ' ';                              00001300
 END BLANK_EN_INNTEKT;                                                  00001310
                                                                        00001320
 BLANK_EN_SPES: PROC;                                                   00001330
      EN_SPES.STATSBORGER           = 999;                              00001340
      EN_SPES.BOSTED                = 999;                              00001350
      EN_SPES.TP_NORDISK            = 9999999;                          00001360
      EN_SPES.TP_NORDISK_LAND       = 999;                              00001370
      EN_SPES.PENSJON_EØS           = 9999999;                          00001380
                                                                        00001390
 END BLANK_EN_SPES;                                                     00001400
 %PAGE;                                /* */                            00001410
 /* ***************************************************************** */00001420
 /*                                                                   */00001430
 /*    PROSEDYRE FOR Å SETTE 0  MELDINGSNUMMERNE I EN_TRANS_OMR I     */00001440
 /*    KOM_OMR.                                                       */00001450
 /*                                                                   */00001460
 /* ***************************************************************** */00001470
 %SKIP(2);                                                              00001480
 BLANK_EN_MELDNR:                                                       00001490
   PROC;                                                                00001500
 %SKIP(2);                     /*  */                                   00001510
 /*  0 I MELDINGSNUMMERNE I  SØKERDELEN                               */00001520
 %SKIP(2);                                                              00001530
      ENS.REGDATONR        = 0;                                         00001540
      ENS.TERMIDNR         = 0;                                         00001550
      ENS.FNRNR            = 0;                                         00001560
      ENS.TKNRNR           = 0;                                         00001570
      ENS.SPRÅKNR          = 0;                                         00001580
      ENS.VIRK_DATO_MÅNR   = 0;                                         00001590
      ENS.NAVN_NYTTNR      = 0;                                         00001600
      ENS.NAVN_NYTT_EKNR   = 0;                                         00001610
      ENS.FNR_EKNR         = 0;                                         00001620
      ENS.NAVN_EKNR        = 0;                                         00001630
      ENS.SKILSMISSENR     = 0;                                         00001640
      ENS.FLYTTET_FRANR    = 0;                                         00001650
      ENS.FLYTTET_SAMMENNR = 0;                                         00001660
      ENS.OPPHØR_SAMBONR   = 0;                                         00001670
      ENS.EK_INNT_OVER_2GNR = 0;                                        00001680
      ENS.SIVILSTANDNR     = 0;                                         00001690
                                                                        00001700
 /*  0 I MELDINGSNUMMERNE I  KAPITTEL 7                               */00001710
                                                                        00001720
      ENK7.FAINR           = 0;                                         00001730
                                                                        00001740
 /*   0 I MELDINGSNUMMERNE I KAPITTEL 8                               */00001750
                                                                        00001760
      ENK8.UFGNR            = 0;                                        00001770
      ENK8.TIDSBEGR_ATTFNR = 0;                                         00001780
      ENK8.SKJERM_ATTFNR   = 0;                                         00001790
      ENK8.FRYSP_3ÅR_ARBNR = 0;                                         00001800
      ENK8.FRYSP_TIDSBNR   = 0;                                         00001810
      ENK8.INNTEKT_FØR_UPNR  = 0;                                       00001820
      ENK8.INNT_DATO_MÅNR    = 0;                                       00001830
                                                                        00001840
                                                                        00001850
 /*   0 I MELDINGSNUMMERNE I KAPITTEL 11                  */            00001860
                                                                        00001870
      ENK11.YUGNR           = 0;                                        00001880
                                                                        00001890
 /*   0 I MELDINGSNUMMERNE I KAPITTEL 10  */                            00001900
      ENK10.FORVENTET_INNTNR     = 0;                                   00001910
      ENK10.O_TIL_PENSJONNR = 0;                                        00001920
      ENK10.TP_PROSENTNR    = 0;                                        00001930
      ENK10.FRAML_DATO_MÅNR = 0;                                        00001940
      ENK10.OPPHØR_EONR     = 0;                                        00001950
                                                                        00001960
      EN_INNTEKT.PENSJONSINNT_SØKERNR = 0;                              00001970
      EN_INNTEKT.PENSJONSINNT_EKNR    = 0;                              00001980
      EN_INNTEKT.ARBEIDSINNT_SØKERNR = 0;                               00001990
      EN_INNTEKT.ARBEIDSINNT_EKNR    = 0;                               00002000
      EN_INNTEKT.MINST_4GNR          = 0;                               00002010
      EN_SPES.STATSBORGERNR           = 0;                              00002020
      EN_SPES.BOSTEDNR                = 0;                              00002030
      EN_SPES.TP_NORDISKNR            = 0;                              00002040
      EN_SPES.TP_NORDISK_LANDNR       = 0;                              00002050
      EN_SPES.PENSJON_EØSNR           = 0;                              00002060
   END BLANK_EN_MELDNR;                                                 00002070
