 /*       SIST ENDRET 25/02-97 11.52.27 AV   JDA7339                  */00000000
 /*       SIST ENDRET 06/02-96 13.19.31 AV   JDA0310                  */00000010
 /*       SIST ENDRET 10/01-96 10.55.03 AV   TSB0310                  */00000020
 /*       SIST ENDRET 13/06-95 10.53.44 AV   TSB0310                  */00000030
 /*       SIST ENDRET 19/09-94 12.48.51 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 17/02-94 13.23.02 AV   TRUDE                    */00000050
 /* ***************************************************************** */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /* **********************                                            */00000080
 /*  PROGRAM-IDENT : R00104EP  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000090
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000100
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000110
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000120
 /*                                                                   */00000130
 /* ***************************************************************** */00000140
 /*HENSIKT:                                                           */00000150
 /* **********                                                        */00000160
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000170
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000180
 /*    FORHÅND.                                                       */00000190
 /*    MAPS HØRER INN UNDER MAPSET 'S001F1'.                         */ 00000200
 /*                                                                   */00000210
 /* ***************************************************************** */00000220
 /*PROGRAMTILKNYTTING:                                                */00000230
 /* ********************                                              */00000240
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000250
 /*                                                                   */00000260
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000270
 /*    BRUK :                                                         */00000280
 /*    EXEC CICS XCTL PROGRAM ('R00104EP') COMMAREA(KOM_OMR);         */00000290
 /*    PROGRAMMET INCLUDER :                                          */00000300
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    EP       */00000310
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       EP       */00000320
 /* ***************************************************************** */00000330
 /*DATASETTOPPLYSNINGER:                                              */00000340
 /* ***********************                                           */00000350
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000360
 /*                                                                   */00000370
 /* ***************************************************************** */00000380
 /*FEILMELDINGER:                                                     */00000390
 /* *******************                                               */00000400
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000410
 /*                                                                   */00000420
 /* ***************************************************************** */00000430
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000440
                                                                        00000450
          %INCLUDE P0019906;                                            00000460
          %INCLUDE P0019908;                                            00000470
          %INCLUDE P0019910;                                            00000480
          %INCLUDE P0019912;                                            00000490
          %INCLUDE P0019913;                                            00000500
                                                                        00000510
 DCL                                                                    00000520
      (CSTG, ADDR)                   BUILTIN;                           00000530
 DCL  COMMAREA_PEKER         PTR,                                       00000540
      LOKAL_KOM_PTR          PTR;                                       00000550
                                                                        00000560
                                                                        00000570
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000580
 DCL                                                                    00000590
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000600
    DFHBMUNP             CHAR(1) INIT(' '),                             00000610
    DFHBMBRY             CHAR(1) INIT('H'),                             00000620
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000630
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000640
    MELDING6O            CHAR(10),                                      00000650
    YMELDING6O           CHAR(10);                                      00000660
                                                                        00000670
          %INCLUDE S001F1  ;                                            00000680
          %INCLUDE P0010801;                                            00000690
                                                                        00000700
                                                                        00000710
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000720
                                                                        00000730
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000740
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000750
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000760
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000770
                                                                        00000780
                                                                        00000790
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000800
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000810
                                                                        00000820
                                                                        00000830
           IF ^W01_YSKADE THEN                                          00000840
              DO;                                                       00000850
                 CALL OVERFØR_EPSØKER_MAP;             /* R0010806 */   00000860
                 IF EPS.NORSK_BOSATT = 'N' THEN                         00000870
                    DO;                                                 00000880
                       CALL TEKST_SPES_SØKER;          /* R0010807 */   00000890
                       CALL OVERFØR_EPSPES_SØKER_MAP;  /* R0010806 */   00000900
                    END;                                                00000910
                 IF EPS.NORSK_BOSATT_EK = 'N' THEN                      00000920
                    DO;                                                 00000930
                       CALL TEKST_SPES_AVDØDE;         /* R0010807 */   00000940
                       CALL OVERFØR_EPSPES_AVDØDE_MAP; /* R0010806 */   00000950
                    END;                                                00000960
                                                                        00000970
                 IF EPS.YSKADE_TILLEGG  = 'J' THEN                      00000980
                    DO;                                                 00000990
                       W01_YSKADE = '1'B;                               00001000
                       W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1;           00001010
                                                                        00001020
                    END;                                                00001030
                                                                        00001040
                                                                        00001050
                 S001081O.DUMMYA = 'Ø';           /* PROT,DARK  */      00001060
                 W01_MAP  = 'S001081';                                  00001070
              END;                                                      00001080
           ELSE                                                         00001090
              DO;                                                       00001100
                                                                        00001110
                 CALL OVERFØR_EPY_MAP;            /* R0010806 */        00001120
                                                                        00001130
                 W01_YSKADE     = '0'B;                                 00001140
                                                                        00001150
                 S001201O.DUMMYA = 'Ø';           /* PROT,DARK */       00001160
                                                                        00001170
                 W01_MAP  = 'S001201';                                  00001180
              END;                                                      00001190
                                                                        00001200
                                                                        00001210
                                                                        00001220
      EXEC CICS RETURN;                                                 00001230
                                                                        00001240
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00001250
      PROC(FIXED_DEC_5);                                                00001260
                                                                        00001270
      DCL                                                               00001280
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00001290
                                                                        00001300
   END SKRIV_FEIL;                                                      00001310
                                                                        00001320
        SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001330
                                                                        00001340
           DCL                                                          00001350
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001360
                                                                        00001370
        END SKRIV_FEIL_YP;                                              00001380
                                                                        00001390
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001400
                                                                        00001410
           DCL                                                          00001420
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001430
                                                                        00001440
        END SKRIV_FEIL_SP;                                              00001450
                                                                        00001460
          %INCLUDE R0019912;                                            00001470
          %INCLUDE R0010806;                                            00001480
          %INCLUDE R0010807;                                            00001490
                                                                        00001500
 END R001041;                                                           00001510
                                                                        00001520
