 /*       SIST ENDRET 13/12-91 13.11.46 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 14/04-89 15.00.15 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 14/12-88 14.32.45 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 08/10-86 09.17.57 AV   LUNDEBY                  */00000030
 /*       SIST ENDRET 06/12-84 17.10.30 AV   BREIVIK                  */00000040
 /*       SIST ENDRET 24/10-84 14.50.17 AV   FARVIK                   */00000050
 /*       SIST ENDRET 23/11-82 13.45.48 AV   BREIVIK                  */00000060
 /*-------------------------------------------------------------------*/00000070
 /* IDENTIFIKASJON:                                                   */00000080
 /*    R0016301                                                       */00000090
 /*                                                                   */00000100
 /*    PROGRAMMERER: P. BREIVIK, JULI 1982.                           */00000110
 /*                                                                   */00000120
 /* HENSIKT:                                                          */00000130
 /*    HER GENERERES ET ROT- OG ET REGTPKT-SEGMENT TIL                */00000140
 /*    STAT-TRANS-BASEN SOM FORTELLER AT OPPLYSNINGENE UNDER ET       */00000150
 /*    VIRKNINGSTIDSPUNKT I DSR SKAL FJERNES (SETTES PASSIVE).        */00000160
 /*       PARAMETERNE OVERFØRES VIA TRANS_OPPL_OMR.                   */00000170
 /*                                                                   */00000180
 /* PROGRAMTILKNYTNING:                                               */00000190
 /*                                                                   */00000200
 /* BRUK:                                                             */00000210
 /*                                                                   */00000220
 /*-------------------------------------------------------------------*/00000230
                                                                        00000240
 R001630: PROC (COMMAREA_PEKER) OPTIONS (MAIN);                         00000250
                                                                        00000260
 DCL COMMAREA_PEKER          POINTER;                                   00000270
                                                                        00000280
 %INCLUDE P0019906; /* TRANS_OPPL_OMR */                                00000290
                                                                        00000300
 %INCLUDE P0019908; /* KOM_OMR */                                       00000310
                                                                        00000320
 %INCLUDE P0019912; /* DIV_PARAM_OMR */                                 00000330
                                                                        00000340
 %PAGE;                                                                 00000350
 DCL 1 TR0ROT,                                                          00000360
 %INCLUDE P0018201; /* ARBEIDSOMRÅDE TR0ROT               */            00000370
 DCL 1 REGTPKT,                                                         00000380
 %INCLUDE P0018202; /* ARBEIDSOMRÅDE REGTPKT              */            00000390
                                                                        00000400
                                                                        00000410
 /*-------------------------------------------------------------------*/00000420
 /*                                                                   */00000430
 /*   DL/1 PARAMETRE                                                  */00000440
 /*                                                                   */00000450
 /*-------------------------------------------------------------------*/00000460
                                                                        00000470
 DCL PLITDLI ENTRY;                                                     00000480
                                                                        00000490
 %INCLUDE DLIUIB;                                                       00000500
                                                                        00000510
 DCL UIB_RC_OK               BIT (8) INIT (0);     /* KONSTANT */       00000520
                                                                        00000530
 DCL 1 TR0_PCB_PEKER         BASED (UIBPCBAL),                          00000540
       2 TR0_PCB_PTR         POINTER;                                   00000550
                                                                        00000560
 DCL GU                      CHAR (4) INIT('GU  ');                     00000570
 DCL GHU                     CHAR (4) INIT('GHU ');                     00000580
 DCL GHNP                    CHAR (4) INIT('GHNP');                     00000590
 DCL DELETE                  CHAR (4) INIT('DLET');                     00000600
 DCL ISRT                    CHAR (4) INIT('ISRT');                     00000610
                                                                        00000620
 DCL TRE                     FIXED BIN (31) INIT(3);                    00000630
 DCL FIRE                    FIXED BIN (31) INIT(4);                    00000640
 DCL FEM                     FIXED BIN (31) INIT(5);                    00000650
                                                                        00000660
 /*-------------------------------------------------------------------*/00000670
 /*                                                                   */00000680
 /*   DEKLARASJON AV SSA                                              */00000690
 /*                                                                   */00000700
 /*-------------------------------------------------------------------*/00000710
                                                                        00000720
 DCL SSA_UNQUAL              CHAR (9);                                  00000730
                                                                        00000740
 DCL 1 SSA_TR0ROT UNALIGNED,                                            00000750
       2 HOVEDDEL            CHAR (17) INIT('TR0ROT  (FNR     '),       00000760
       2 REL_OP              CHAR (2)  INIT(' ='),                      00000770
       2 FNR_KEY             FIXED DEC (11),                            00000780
       2 END_MRK             CHAR (1)  INIT(')');                       00000790
                                                                        00000800
 DCL 1 SSA_REGTPKT1 UNALIGNED,                                          00000810
       2 HOVEDDEL            CHAR (17) INIT('REGTPKT (VIRKDATS'),       00000820
       2 REL_OP              CHAR (2)  INIT(' ='),                      00000830
       2 VIRKDATO            CHAR (4),                                  00000840
       2 END_MRK             CHAR (1)  INIT(')');                       00000850
                                                                        00000860
 DCL 1 SSA_REGTPKT2 UNALIGNED,                                          00000870
       2 HOVEDDEL            CHAR (17) INIT('REGTPKT (VIRKDATS'),       00000880
       2 REL_OP              CHAR (2)  INIT('>='),                      00000890
       2 VIRKDATO            CHAR (4),                                  00000900
       2 END_MRK             CHAR (1)  INIT(')');                       00000910
                                                                        00000920
 /*-------------------------------------------------------------------*/00000930
 /*                                                                   */00000940
 /*   PCB-OMRÅDE                                                      */00000950
 /*                                                                   */00000960
 /*-------------------------------------------------------------------*/00000970
                                                                        00000980
 %INCLUDE P0012002;                                                     00000990
                                                                        00001000
 DCL 1 TR0_PCB               BASED (TR1_PCB_PEKER),                     00001010
                                                                        00001020
 %INCLUDE P0012003;                                                     00001030
                                                                        00001040
 /*-------------------------------------------------------------------*/00001050
 /*                                                                   */00001060
 /*   HJELPEVARIABLE                                                  */00001070
 /*                                                                   */00001080
 /*-------------------------------------------------------------------*/00001090
                                                                        00001100
 DCL DATO_KLOKKE             PIC '(15)9',                               00001110
     DATO_ÅM                 PIC '9999' DEF DATO_KLOKKE,                00001120
     DATO                    PIC '(6)9' DEF DATO_KLOKKE,                00001130
     KLOKKE                  PIC '(9)9' DEF DATO_KLOKKE POS(7);         00001140
                                                                        00001150
                                                                        00001160
 DCL IO_PEK                  POINTER;                                   00001170
                                                                        00001180
 DCL IO_AREA                 CHAR (70);                                 00001190
                                                                        00001200
 DCL IO_HELP_AREA            CHAR (70) BASED (IO_PEK);                  00001210
                                                                        00001220
 DCL PBR_TEXT                CHAR (50);                                 00001230
                                                                        00001240
 DCL (DATE,TIME,CSTG,                                                   00001250
      ADDR,CHAR)             BUILTIN;                                   00001260
                                                                        00001270
 %PAGE;                                                                 00001280
 /*-------------------------------------------------------------------*/00001290
 /*                                                                   */00001300
 /* START PÅ PROGRAM FJERN ALT UNDER ET VIRKNINGSTIDSPUNKT,           */00001310
 /*    OG ETTERFØLGENDE VIRKNINGSTIDSPUNKTER,                         */00001320
 /*    HVIS VIRKNINGSTIDSPUNKETET FINNES.                             */00001330
 /*    PROGRAMMET KALLES OPP MED TO PARAMETRE:                        */00001340
 /*                                                                   */00001350
 /*    1. FØDSELSNUMMER TIL PERSONEN DET GJELDER                      */00001360
 /*    2. VIRKNINGSTIDSPUNKT DET SKAL SLETTES PÅ                      */00001370
 /*-------------------------------------------------------------------*/00001380
                                                                        00001390
                                                                        00001400
    DIV_PARAM_OMR.PROGRAM_ID = 'R0016301';                              00001410
    UIBPTR =UIB_PEKER;                                                  00001420
                                                                        00001430
                                                                        00001440
 %PAGE;                                                                 00001450
 /*-------------------------------------------------------------------*/00001460
 /*                                                                   */00001470
 /* START PÅ PROGRAM FJERN SEGMENTER I STAT-TRANS-BASEN.              */00001480
 /*                                                                   */00001490
 /*-------------------------------------------------------------------*/00001500
                                                                        00001510
                                                                        00001520
    TR0ROT            = '';                                             00001530
    REGTPKT           = '';                                             00001540
                                                                        00001550
    SSA_TR0ROT.FNR_KEY   = TRANS_OPPL_OMR.FØDSNUMMER;                   00001560
                                                                        00001570
                                                                        00001580
    CALL PLITDLI (FIRE,                                                 00001590
                  GU,                                                   00001600
                  TR0_PCB,                                              00001610
                  IO_AREA,                                              00001620
                  SSA_TR0ROT);                                          00001630
                                                                        00001640
                                                                        00001650
     SSA_REGTPKT1.VIRKDATO = F_SNU_DATO(TRANS_OPPL_OMR.VIRKNINGSDATO);  00001660
     SSA_REGTPKT2.VIRKDATO = F_SNU_DATO(TRANS_OPPL_OMR.VIRKNINGSDATO);  00001670
                                                                        00001680
     SELECT(TR0_PCB.STATUS_KODE);                                       00001690
                                                                        00001700
                                                                        00001710
         WHEN ('GE');                                                   00001720
                                                                        00001730
         WHEN ('  ')                                                    00001740
                                                                        00001750
           DO;                                                          00001760
             CALL PLITDLI (FIRE,                                        00001770
                           GHNP,                                        00001780
                           TR0_PCB,                                     00001790
                           IO_AREA,                                     00001800
                           SSA_REGTPKT1);                               00001810
                                                                        00001820
              IF TR0_PCB.STATUS_KODE ^= '  ' &                          00001830
                 TR0_PCB.STATUS_KODE ^= 'GE' THEN                       00001840
                  DO;                                                   00001850
   L090:                                                                00001860
                  /*--------------------------------------*/            00001870
                  /* FEIL VED GHU-KALLET    TIL TR0-BASEN */            00001880
                  /* SEGMENT LOT SEG IKKE LESE.           */            00001890
                  /*--------------------------------------*/            00001900
                                                                        00001910
                     DIV_PARAM_OMR.FEIL_VED_LABEL = 'L090'    ;         00001920
                     DIV_PARAM_OMR.FEIL_MELD_NR   = 500       ;         00001930
                     DIV_PARAM_OMR.DB_STATUS_KODE =                     00001940
                                                TR0_PCB.STATUS_KODE;    00001950
                     GO TO UTGANG;                                      00001960
                  END;                                                  00001970
                                                                        00001980
                                                                        00001990
           DO WHILE (TR0_PCB.STATUS_KODE = ' ');                        00002000
                                                                        00002010
                                                                        00002020
              CALL PLITDLI (TRE,                                        00002030
                            DELETE,                                     00002040
                            TR0_PCB,                                    00002050
                            IO_AREA);                                   00002060
                                                                        00002070
              IF TR0_PCB.STATUS_KODE ^= '  ' THEN                       00002080
                  DO;                                                   00002090
   L100:                                                                00002100
                  /*--------------------------------------*/            00002110
                  /* FEIL VED DELETE-KALLET TIL TR0-BASEN */            00002120
                  /* SEGMENT LOT SEG IKKE SLETTE          */            00002130
                  /*--------------------------------------*/            00002140
                                                                        00002150
                     DIV_PARAM_OMR.FEIL_VED_LABEL = 'L100'    ;         00002160
                     DIV_PARAM_OMR.FEIL_MELD_NR   = 500       ;         00002170
                     DIV_PARAM_OMR.DB_STATUS_KODE =                     00002180
                                                TR0_PCB.STATUS_KODE;    00002190
                     GO TO UTGANG;                                      00002200
                  END;                                                  00002210
                                                                        00002220
             CALL PLITDLI (FIRE,                                        00002230
                           GHNP,                                        00002240
                           TR0_PCB,                                     00002250
                           IO_AREA,                                     00002260
                           SSA_REGTPKT2);                               00002270
                                                                        00002280
             IF TR0_PCB.STATUS_KODE ^= '  ' &                           00002290
                TR0_PCB.STATUS_KODE ^= 'GE' THEN                        00002300
   L110:                                                                00002310
               DO;                                                      00002320
             /*------------------------------------*/                   00002330
             /* FEIL VED GHNP-KALLET.              */                   00002340
             /*------------------------------------*/                   00002350
                                                                        00002360
                  DIV_PARAM_OMR.FEIL_VED_LABEL = 'L110';                00002370
                  DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                   00002380
                  DIV_PARAM_OMR.DB_STATUS_KODE =                        00002390
                                               TR0_PCB.STATUS_KODE;     00002400
                  GO TO UTGANG;                                         00002410
               END;                                                     00002420
                                                                        00002430
                                                                        00002440
           END;   /*DO WHILE  */                                        00002450
                                                                        00002460
        END;   /*DO  */                                                 00002470
                                                                        00002480
         OTHERWISE                                                      00002490
                                                                        00002500
            DO;                                                         00002510
   L120:                                                                00002520
             /*------------------------------------*/                   00002530
             /* FEIL VED GU-KALLET.                */                   00002540
             /*------------------------------------*/                   00002550
                                                                        00002560
               DIV_PARAM_OMR.FEIL_VED_LABEL = 'L120';                   00002570
               DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                      00002580
               DIV_PARAM_OMR.DB_STATUS_KODE =                           00002590
                                             TR0_PCB.STATUS_KODE;       00002600
               GO TO UTGANG;                                            00002610
            END;                                                        00002620
      END; /* OF SELECT */                                              00002630
                                                                        00002640
 /*-------------------------------------------------------------------*/00002650
 /*    INSERTER DE-AKTIV-SEGMENTER PÅ TR-BASE.                        */00002660
 /*-------------------------------------------------------------------*/00002670
                                                                        00002680
    TR0ROT.FNR = TRANS_OPPL_OMR.FØDSNUMMER;                             00002690
                                                                        00002700
    SSA_UNQUAL = 'TR0ROT   ';                                           00002710
                                                                        00002720
    CALL PLITDLI (FIRE,                                                 00002730
                  ISRT,                                                 00002740
                  TR0_PCB,                                              00002750
                  TR0ROT,                                               00002760
                  SSA_UNQUAL);                                          00002770
                                                                        00002780
    IF DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK !                           00002790
       ^(TR0_PCB.STATUS_KODE = '  ' ! TR0_PCB.STATUS_KODE = 'II') THEN  00002800
    DO;                                                                 00002810
                                                                        00002820
 L130:                                                                  00002830
     /*--------------------------------------*/                         00002840
     /* FEIL VED INSERT-KALLET TIL TR0-BASEN */                         00002850
     /* SEGMENT FANTES IKKE FRA FØR OG       */                         00002860
     /* LOT SEG HELLER IKKE LEGGE INN        */                         00002870
     /*--------------------------------------*/                         00002880
                                                                        00002890
       FEIL_VED_LABEL = 'L130';                                         00002900
       FEIL_MELD_NR = 500;                                              00002910
       GO TO UTGANG;                                                    00002920
    END;                                                                00002930
                                                                        00002940
    DATO   = DATE;                                                      00002950
    KLOKKE = TIME;                                                      00002960
                                                                        00002970
                                                                        00002980
    REGTPKT.DATOKL                = DATO_KLOKKE;                        00002990
    REGTPKT.VIRKDATO              =                                     00003000
                             F_SNU_DATO(TRANS_OPPL_OMR.VIRKNINGSDATO);  00003010
    REGTPKT.DELMRK_VTP            = 'F';   /* FJERNES */                00003020
    SSA_TR0ROT.FNR_KEY            = TR0ROT.FNR;                         00003030
                                                                        00003040
    IO_PEK  = ADDR(REGTPKT);                                            00003050
    IO_AREA = IO_HELP_AREA;                                             00003060
                                                                        00003070
                                                                        00003080
    SSA_UNQUAL = 'REGTPKT ';                                            00003090
                                                                        00003100
    CALL PLITDLI (FEM,                                                  00003110
                  ISRT,                                                 00003120
                  TR0_PCB,                                              00003130
                  IO_AREA,                                              00003140
                  SSA_TR0ROT,                                           00003150
                  SSA_UNQUAL);                                          00003160
                                                                        00003170
    IF DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK !                           00003180
       TR0_PCB.STATUS_KODE     ^= '  ' THEN                             00003190
       DO;                                                              00003200
 L140:                                                                  00003210
     /*--------------------------------------*/                         00003220
     /* FEIL VED INSERT-KALLET TIL TR0-BASEN */                         00003230
     /* UNIKT SEGMENT LOT SEG IKKE LEGGE INN */                         00003240
     /*--------------------------------------*/                         00003250
                                                                        00003260
          FEIL_VED_LABEL = 'L140';                                      00003270
          FEIL_MELD_NR = 500;                                           00003280
       END;                                                             00003290
                                                                        00003300
 UTGANG:                                                                00003310
                                                                        00003320
    EXEC CICS RETURN;                                                   00003330
                                                                        00003340
 %INCLUDE R0019913; /* F_SNU_DATO     */                                00003350
                                                                        00003360
 END R001630;                                                           00003370
