 /*       SIST ENDRET 24/08-88 09.29.58 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 09/02-88 13.21.08 AV   DYBVIK                   */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /* **********************                                            */00000040
 /*  PROGRAM-IDENT : R001NO11  UNDERPROGRAM SOM BRUKES AV R001NO10    */00000050
 /*                            KONTROLL AP-BLANKETT.                  */00000060
 /*  PROGRAM-SPRÅK : PLI                                              */00000070
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */00000080
 /*  PROGRAMMET BLE LAGET : OKT 1986                                  */00000090
 /*                                                                   */00000100
 /* ***************************************************************** */00000110
 /*  ENDRINGERSDATO :    230888                                       */00000120
 /*  ENDRINGEN GJELDER:  LAGT INN CALL TIL BLANK_AP_SPES.             */00000130
 /*                      ABENDER I GRUNNBLANKETTRUTINEN KAN SKYLDES   */00000140
 /*                      UGYLDIGE VERDIER I APSP.                     */00000150
 /*  ENDRINGEN BLE UTFØRT AV : BRITT                                  */00000160
 /*                                                                   */00000170
 /* ***************************************************************** */00000180
 /*BRUK:                                                              */00000190
 /* ********                                                          */00000200
 /*                                                                   */00000210
 /*  %INCLUDE R001NO11                                                */00000220
 /*                                                                   */00000230
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */00000240
 /*                                                                   */00000250
 /*    R0010502   BLANK TRANSOMR                                      */00000260
 /*    R0010503   KONTR AP SØKER                                      */00000270
 /*    R0010504   KONTR AP BARN                                       */00000280
 /*    FUNKSJONER SOM BRUKES ER INCLUDET I HOVEDPROGRAMMET.           */00000290
 /*                                                                   */00000300
 /* ***************************************************************** */00000310
 /*                                                                   */00000320
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR AP OG FLYTTER DERETTER        */00000330
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */00000340
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */00000350
 /*  NUMRE TATT VARE PÅ.                                              */00000360
 /*                                                                   */00000370
 /* ***************************************************************** */00000380
                                                                        00000390
 P105_BEHANDLE_AP: PROC;                                                00000400
                                                                        00000410
                                                                        00000420
 %INCLUDE P0010501;                      /* TRANSOMRÅDE AP */           00000430
                                                                        00000440
                                                                        00000450
          CALL BLANK_AP_SØKER;                         /* R0010502 */   00000460
          CALL BLANK_AP_BARN;                          /* R0010502 */   00000470
          CALL BLANK_AP_MELDNR;                        /* R0010502 */   00000480
          CALL BLANK_AP_SPES;                          /* R0010502 */   00000490
          CALL OVERF_AP_BLANKETT;                                       00000500
          CALL KONTROLL_AP_SØKER(FEIL_FUNNET);         /* R0010503 */   00000510
                                                                        00000520
          IF ^FEIL_FUNNET                         &                     00000530
             F_FELT_PIC_CHAR2(APS.BT_ANT) ^= '00' THEN                  00000540
             DO;                                                        00000550
                CALL OVERF_AP_BARN;                                     00000560
                CALL KONTROLL_AP_BARN(FEIL_FUNNET);    /* R0010504 */   00000570
             END;                                                       00000580
                                                                        00000590
          IF APS.NORSK_BOSATT = 'N'   THEN                              00000600
             DO;                                                        00000610
                FEIL_I_BOSATT = TRUE;                                   00000620
                FEIL_FUNNET   = TRUE;                                   00000630
             END;                                                       00000640
                                                                        00000650
          IF FEIL_FUNNET      THEN                                      00000660
             CALL FINN_FEIL_AP;                                         00000670
                                                                        00000680
                                                                        00000690
                                                                        00000700
                                                                        00000710
 /* ***************************************************************** */00000720
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */00000730
 /*    RECORDEN TIL AP TRANSOMRÅDE FOR AP SØKER.                      */00000740
 /* ***************************************************************** */00000750
 OVERF_AP_BLANKETT:PROC;                                                00000760
                                                                        00000770
          APS.REGDATO      =  BLANKETT_RECORD.TRANS_DATO_ÅMD;           00000780
          APS.TERMID       = 'NORT';                                    00000790
          APS.VIRK_DATO_MÅ =  AP_BLANKETT.VIRK_DATO_MÅ;                 00000800
          APS.FNR          =  BLANKETT_RECORD.FNR;                      00000810
          APS.NAVN         =  BLANKETT_RECORD.NAVN;                     00000820
          APS.TKNR         =  BLANKETT_RECORD.TKNR;                     00000830
          APS.TILL_EK      =  AP_BLANKETT.EKTEFELLETILLEGG;             00000840
          APS.SIVILSTAND   =  AP_BLANKETT.SIVILSTAND;                   00000850
          APS.SPRÅK        =  AP_BLANKETT.SPRÅK;                        00000860
                                                                        00000870
          IF F_FELT_PIC_CHAR3 (AP_BLANKETT.ANT_BARN) ^= '   '    THEN   00000880
             APS.BT_ANT    =  AP_BLANKETT.ANT_BARN;                     00000890
                                                                        00000900
          APS.NORSK_BOSATT =  AP_BLANKETT.NORSK_BOSATT;                 00000910
                                                                        00000920
          IF F_FELT_PIC_CHAR5 (AP_BLANKETT.FAI) ^= '     '       THEN   00000930
             APS.FAI       =  AP_BLANKETT.FAI * 100;                    00000940
                                                                        00000950
          IF F_FELT_PIC_CHAR3 (AP_BLANKETT.APD) ^= '   '         THEN   00000960
             APS.APD       =  AP_BLANKETT.APD;                          00000970
                                                                        00000980
          IF F_FELT_PIC_CHAR11 (AP_BLANKETT.FNR_EK) ^= (11)' '   THEN   00000990
             APS.FNR_EK    =  AP_BLANKETT.FNR_EK;                       00001000
                                                                        00001010
          APS.NAVN_EK      =  AP_BLANKETT.NAVN_EK;                      00001020
          APS.EK_INNT      =  AP_BLANKETT.EK_INNT;                      00001030
                                                                        00001040
                                                                        00001050
    END OVERF_AP_BLANKETT;                                              00001060
                                                                        00001070
                                                                        00001080
 /* ***************************************************************** */00001090
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */00001100
 /*    RECORDEN TIL AP TRANSOMRÅDE FOR AP BARN.                       */00001110
 /* ***************************************************************** */00001120
 OVERF_AP_BARN:PROC;                                                    00001130
                                                                        00001140
                                                                        00001150
          DO I = 1 TO 12 WHILE (F_FELT_PIC_CHAR11                       00001160
                               (AP_BLANKETT.FNR_BARN (I)) ^= (11)' ');  00001170
             APB.FNR_BARN(I) = AP_BLANKETT.FNR_BARN(I);                 00001180
             APB.RBT_BARN(I) = AP_BLANKETT.RED_BT(I);                   00001190
          END;                                                          00001200
                                                                        00001210
                                                                        00001220
    END OVERF_AP_BARN;                                                  00001230
                                                                        00001240
                                                                        00001250
                                                                        00001260
 /* ***************************************************************** */00001270
 /*    PROCEDURE SOM FINNER OG TAR VARE PÅ FEIL_MELD_NR NÅR DET ER    */00001280
 /*    FEIL I DEN OVERFØRTE RECORDEN.                                 */00001290
 /* ***************************************************************** */00001300
 FINN_FEIL_AP:PROC;                                                     00001310
                                                                        00001320
    DCL ANT_BARN              FIXED BIN (15);                           00001330
                                                                        00001340
          FEIL_IND = 1;                                                 00001350
                                                                        00001360
          IF APS.FNRNR ^= 0 &                                           00001370
             APS.FNRNR ^= 999 THEN                                      00001380
             DO;                                                        00001390
                W01_FEIL_NR(FEIL_IND) = APS.FNRNR;                      00001400
                FEIL_IND = FEIL_IND + 1;                                00001410
             END;                                                       00001420
                                                                        00001430
          IF APS.TKNRNR ^= 0 &                                          00001440
             APS.TKNRNR ^= 999 THEN                                     00001450
             DO;                                                        00001460
                W01_FEIL_NR(FEIL_IND) = APS.TKNRNR;                     00001470
                FEIL_IND = FEIL_IND + 1;                                00001480
             END;                                                       00001490
                                                                        00001500
          IF APS.NAVNNR ^= 0 &                                          00001510
             APS.NAVNNR ^= 999 THEN                                     00001520
             DO;                                                        00001530
                W01_FEIL_NR(FEIL_IND) = APS.NAVNNR;                     00001540
                IF FEIL_IND ^= 3 THEN                                   00001550
                   FEIL_IND  = FEIL_IND + 1;                            00001560
             END;                                                       00001570
                                                                        00001580
          IF APS.SPRÅKNR ^= 0 &                                         00001590
             APS.SPRÅKNR ^= 999 THEN                                    00001600
             DO;                                                        00001610
                W01_FEIL_NR(FEIL_IND) = APS.SPRÅKNR;                    00001620
                IF FEIL_IND ^= 3 THEN                                   00001630
                   FEIL_IND  = FEIL_IND + 1;                            00001640
             END;                                                       00001650
                                                                        00001660
          IF APS.SIVILSTANDNR ^= 0 &                                    00001670
             APS.SIVILSTANDNR ^= 999 THEN                               00001680
             DO;                                                        00001690
                W01_FEIL_NR(FEIL_IND) = APS.SIVILSTANDNR;               00001700
                IF FEIL_IND ^= 3 THEN                                   00001710
                   FEIL_IND  = FEIL_IND + 1;                            00001720
             END;                                                       00001730
                                                                        00001740
          IF APS.TILL_EKNR ^= 0 &                                       00001750
             APS.TILL_EKNR ^= 999 THEN                                  00001760
             DO;                                                        00001770
                W01_FEIL_NR(FEIL_IND) = APS.TILL_EKNR;                  00001780
                IF FEIL_IND ^= 3 THEN                                   00001790
                   FEIL_IND  = FEIL_IND + 1;                            00001800
             END;                                                       00001810
                                                                        00001820
          IF APS.NORSK_BOSATTNR ^= 0 &                                  00001830
             APS.NORSK_BOSATTNR ^= 999 THEN                             00001840
             DO;                                                        00001850
                W01_FEIL_NR(FEIL_IND) = APS.NORSK_BOSATTNR;             00001860
                IF FEIL_IND ^= 3 THEN                                   00001870
                   FEIL_IND  = FEIL_IND + 1;                            00001880
             END;                                                       00001890
                                                                        00001900
          IF APS.BT_ANTNR ^= 0 &                                        00001910
             APS.BT_ANTNR ^= 999 THEN                                   00001920
             DO;                                                        00001930
                W01_FEIL_NR(FEIL_IND) = APS.BT_ANTNR;                   00001940
                IF FEIL_IND ^= 3 THEN                                   00001950
                   FEIL_IND  = FEIL_IND + 1;                            00001960
             END;                                                       00001970
                                                                        00001980
          IF APS.FAINR ^= 0 &                                           00001990
             APS.FAINR ^= 999 THEN                                      00002000
             DO;                                                        00002010
                W01_FEIL_NR(FEIL_IND) = APS.FAINR;                      00002020
                IF FEIL_IND ^= 3 THEN                                   00002030
                   FEIL_IND  = FEIL_IND + 1;                            00002040
             END;                                                       00002050
                                                                        00002060
          IF APS.APDNR ^= 0 &                                           00002070
             APS.APDNR ^= 999 THEN                                      00002080
             DO;                                                        00002090
                W01_FEIL_NR(FEIL_IND) = APS.APDNR;                      00002100
                IF FEIL_IND ^= 3 THEN                                   00002110
                   FEIL_IND  = FEIL_IND + 1;                            00002120
             END;                                                       00002130
                                                                        00002140
          IF APS.VIRK_DATO_MÅNR ^= 0 &                                  00002150
             APS.VIRK_DATO_MÅNR ^= 999 THEN                             00002160
             DO;                                                        00002170
                W01_FEIL_NR(FEIL_IND) = APS.VIRK_DATO_MÅNR;             00002180
                IF FEIL_IND ^= 3 THEN                                   00002190
                   FEIL_IND  = FEIL_IND + 1;                            00002200
             END;                                                       00002210
                                                                        00002220
          IF APS.FNR_EKNR ^= 0 &                                        00002230
             APS.FNR_EKNR ^= 999 THEN                                   00002240
             DO;                                                        00002250
                W01_FEIL_NR(FEIL_IND) = APS.FNR_EKNR;                   00002260
                IF FEIL_IND ^= 3 THEN                                   00002270
                   FEIL_IND  = FEIL_IND + 1;                            00002280
             END;                                                       00002290
                                                                        00002300
          IF APS.NAVN_EKNR ^= 0 &                                       00002310
             APS.NAVN_EKNR ^= 999 THEN                                  00002320
             DO;                                                        00002330
                W01_FEIL_NR(FEIL_IND) = APS.NAVN_EKNR;                  00002340
                IF FEIL_IND ^= 3 THEN                                   00002350
                   FEIL_IND  = FEIL_IND + 1;                            00002360
             END;                                                       00002370
                                                                        00002380
          IF APS.EK_INNTNR ^= 0 &                                       00002390
             APS.EK_INNTNR ^= 999 THEN                                  00002400
             DO;                                                        00002410
                W01_FEIL_NR(FEIL_IND) = APS.EK_INNTNR;                  00002420
                IF FEIL_IND ^= 3 THEN                                   00002430
                   FEIL_IND  = FEIL_IND + 1;                            00002440
             END;                                                       00002450
                                                                        00002460
                                                                        00002470
          DO ANT_BARN = 1 TO 12 WHILE (F_FELT_PIC_CHAR11                00002480
                                   (APB.FNR_BARN(ANT_BARN)) ^= (11)'0');00002490
                                                                        00002500
             IF APB.FNR_BARNNR(ANT_BARN) ^= 0   &                       00002510
                APB.FNR_BARNNR(ANT_BARN) ^= 999 THEN                    00002520
                DO;                                                     00002530
                   W01_FEIL_NR(FEIL_IND) = APB.FNR_BARNNR(ANT_BARN);    00002540
                   IF FEIL_IND ^= 3 THEN                                00002550
                      FEIL_IND  = FEIL_IND + 1;                         00002560
                END;                                                    00002570
                                                                        00002580
             IF APB.RBT_BARNNR(ANT_BARN) ^= 0   &                       00002590
                APB.RBT_BARNNR(ANT_BARN) ^= 999 THEN                    00002600
                DO;                                                     00002610
                   W01_FEIL_NR(FEIL_IND) = APB.RBT_BARNNR(ANT_BARN);    00002620
                   IF FEIL_IND ^= 3 THEN                                00002630
                      FEIL_IND  = FEIL_IND + 1;                         00002640
                END;                                                    00002650
                                                                        00002660
          END;                                                          00002670
                                                                        00002680
                                                                        00002690
                                                                        00002700
    END FINN_FEIL_AP;                                                   00002710
                                                                        00002720
                                                                        00002730
                                                                        00002740
 %PAGE;                                                                 00002750
 /* ***************************************************************** */00002760
 /*          E K S T E R N E    P R O C E D U R E R                   */00002770
 /* ***************************************************************** */00002780
                                                                        00002790
 %PAGE;                                                                 00002800
 %INCLUDE R0010502;          /*     BLANK AP TRANSOMR   */              00002810
 %PAGE;                                                                 00002820
 %INCLUDE R0010503;          /*     KONTR AP SØKER      */              00002830
 %PAGE;                                                                 00002840
 %INCLUDE R0010504;          /*     KONTR AP BARN       */              00002850
                                                                        00002860
                                                                        00002870
 END P105_BEHANDLE_AP;                                                  00002880
                                                                        00002890
                                                                        00002900
