 /*       SIST ENDRET 11/11-86 11.30.45 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 21/02-86 06.44.16 AV   FARVIK                   */00000010
 /*       SIST ENDRET 14/10-85 10.35.31 AV   FARVIK                   */00000020
 /*       SIST ENDRET 07/06-84 16.09.13 AV   LUNDEBY                  */00000030
 /*       SIST ENDRET 28/07-83 14.49.24 AV   FARVIK                   */00000040
 /*       SIST ENDRET 30/05-83 08.28.56 AV   LUNDEBY                  */00000050
 /*       SIST ENDRET 23/11-82 07.42.04 AV   LUNDEBY                  */00000060
                                                                        00000070
                                                                        00000080
    %PAGE;                                                              00000090
    /* ************************************************************ */  00000100
    /*                                                              */  00000110
    /* PROCEDURE SOM LEGGER INN BLANKETT-OPPLYSN. :     O1          */  00000120
    /* --------------------------------------------                 */  00000130
    /*                                                              */  00000140
    /* ************************************************************ */  00000150
                                                                        00000160
    P160_SKRIV_O1_TRANS:                                                00000170
      PROC;                                                             00000180
                                                                        00000190
                                                                        00000200
      %PAGE;                                                            00000210
      %INCLUDE P0011601;           /* TRANS_OMR (BASED) :   O1      */  00000220
                                                                        00000230
                                                                        00000240
      DCL  W160_DØDSDATO_DMÅ                     PIC '999999' INIT (0); 00000250
                                                                        00000260
      DCL  W160_VTP_MÅ  DEF  W160_DØDSDATO_DMÅ   PIC '9999'   POS  (3); 00000270
                                                                        00000280
                                                                        00000290
      /* ************************************************************ */00000300
      /*     FERDIG MED DEKLARASJONENE . EKSEKVERINGEN STARTER .      */00000310
      /*       LEGGER O1-TRANS OVER VARIABEL-DEL .                    */00000320
      /*                                                              */00000330
      /* ************************************************************ */00000340
                                                                        00000350
      IF FUNKSJONSKODE   ^=   'B' &                                     00000360
         FUNKSJONSKODE   ^=   'E'                                THEN   00000370
         TRANS_PEKER      =  ADDR ( TRANS_LISTE_OMR.VARIABEL_DEL (I) ); 00000380
                                                                        00000390
      /* ************************************************************ */00000400
      /*            SKRIVER  :      T R A N H I S T .                 */00000410
      /* ************************************************************ */00000420
                                                                        00000430
      W160_DØDSDATO_DMÅ               =  O1.DØDSDATO_DØD   ;            00000440
                                                                        00000450
      TRANHIST.VIRK_DATO_ÅM           =  F_SNU_DATO (W160_VTP_MÅ)      ;00000460
      TRANHIST.VTP_KEY                =  9999 - TRANHIST.VIRK_DATO_ÅM  ;00000470
      TRANHIST.GRBLKODE               =  TRANS_OPPL_OMR.BLANKETTYPE    ;00000480
      TRANHIST.REGDATO_ÅMD            =  W001_REG_DATO                 ;00000490
      TRANHIST.TERMID                 =  W001_TERMID                   ;00000500
      TRANHIST.TKNR                   =  O1.TKNR_DØD                   ;00000510
      TRANHIST.SIVILSTAND             =  ' '                           ;00000520
      TRANHIST.TRANS_RETURKODE        =  TRANS_OPPL_OMR.TRANS_RETURKODE;00000530
                                                                        00000540
      CALL  P010_SKRIV_TRANHIST;                                        00000550
                                                                        00000560
      IF    FEIL_MELD_NR               >   0                  THEN      00000570
        DO;                                                             00000580
          /* ******************************************************* */ 00000590
          /* FEIL VED SKRIV AV :   TRANHIST    KJØRING AVBRYTES.     */ 00000600
          /*                                                         */ 00000610
          /* ******************************************************* */ 00000620
                                                                        00000630
          GO TO SLUTT;                                                  00000640
        END;                                                            00000650
                                                                        00000660
      /* ************************************************************ */00000670
      /*            SKRIVER    :   O P P H B L 1 .                    */00000680
      /* ************************************************************ */00000690
                                                                        00000700
      OPPHBL1.DØDSDATO_DMÅ        =   O1.DØDSDATO_DØD;                  00000710
      OPPHBL1.FNR_EK              =   O1.FNR_EK;                        00000720
      OPPHBL1.PI                  =   O1.PI_DØD;                        00000730
                                                                        00000740
      W001_HJELPE_PEKER            =   ADDR ( OPPHBL1 );                00000750
      SSA_UQUAL                    =         'OPPHBL1 ';                00000760
      CALL  P020_SKRIV_BARN_AV_TRANHIST;                                00000770
                                                                        00000780
      IF    FEIL_MELD_NR               >   0                  THEN      00000790
        DO;                                                             00000800
          /* ******************************************************* */ 00000810
          /* FEIL VED SKRIV AV :   GRUNNBO1    KJØRING AVBRYTES.     */ 00000820
          /* ******************************************************* */ 00000830
                                                                        00000840
          GO TO SLUTT;                                                  00000850
        END;                                                            00000860
                                                                        00000870
  SLUTT:                                                                00000880
                                                                        00000890
    END P160_SKRIV_O1_TRANS;                                            00000900
                                                                        00000910
                                                                        00000920
