 /*       SIST ENDRET 20/04-95 07.38.09 AV   HLB0310                  */00000000
 /*       SIST ENDRET 19/04-95 15.10.39 AV   HLB0310                  */00000010
 /*       SIST ENDRET 19/04-95 11.23.28 AV   HLB0310                  */00000020
 /*       SIST ENDRET 24/05-94 13.30.06 AV   HERMAN                   */00000030
 /*       SIST ENDRET 28/02-94 13.33.14 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 15/10-92 15.04.19 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 15/10-92 13.49.25 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 28/09-92 11.05.30 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 27/01-92 15.13.01 AV   TRUDE                    */00000080
 /*       SIST ENDRET 03/01-92 14.14.41 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 02/01-92 16.09.55 AV   HERMAN                   */00000100
 /*       SIST ENDRET 16/12-91 13.29.09 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 12/07-91 13.11.45 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 26/04-91 12.18.32 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 12/04-91 08.18.40 AV   HERMAN                   */00000140
 /*       SIST ENDRET 11/04-91 15.15.22 AV   HERMAN                   */00000150
 /*       SIST ENDRET 08/04-91 12.07.51 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 07/11-90 14.21.49 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 01/12-89 09.05.50 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 16/10-89 13.13.46 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 18/08-89 08.26.09 AV   HERMAN                   */00000200
 /*       SIST ENDRET 14/12-88 13.31.43 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 08/11-88 12.27.56 AV   DYBVIK                   */00000220
 /*       SIST ENDRET 30/05-88 14.00.48 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 30/03-88 11.04.23 AV   HERMAN                   */00000240
 /*       SIST ENDRET 14/12-87 11.41.58 AV   DYBVIK                   */00000250
 R001NO2: PROC (SB1_PCB_PEKER) OPTIONS(MAIN);                           00000260
 %SKIP(3);                                                              00000270
 /********************************************************************/ 00000280
 /*IDENTIFIKASJON                                                    */ 00000290
 /*     R001NO20            - BATCH     HOVEDPROGRAM I PL1           */ 00000300
 /*     BRITT FOSSUM        -           JULI 1986                    */ 00000310
 /*HENSIKT                                                           */ 00000320
 /*     LESE GJENNOM STØNADSBREVBASEN OG PLUKKER UT DATA SOM SKAL    */ 00000330
 /*     OVERFØRES TIL NORTRYGDPENSJONER                              */ 00000340
 /*INPUT                                                             */ 00000350
 /*     STØNADSBREVBASEN                                             */ 00000360
 /*     TABELL OVER TRYGDEKONTORER                                   */ 00000370
 /*OUTPUT                                                            */ 00000380
 /*     NORFILE SOM GÅR INN I NORTRYGD TRANSPORTSYSTEM               */ 00000390
 /********************************************************************/ 00000400
 %SKIP(2);                                                              00000410
 %INCLUDE P001NO20;       /*  OUTPUTOMRÅDE NOR_REC                */    00000420
 %INCLUDE P001NO21;       /*  DCL I FORBINDELSE MED BRUK AV       */    00000430
                          /*  STØNADSBREVBASEN                    */    00000440
 %INCLUDE P0019001;       /*  DCL AV W_ROT,W_HENDELSE OG W_BEREGN */    00000450
                                                                        00000460
 /*  FILER    */                                                        00000470
                                                                        00000480
     DCL SYSIN           FILE STREAM INPUT;                             00000490
     DCL SYSPRINT        FILE STREAM PRINT;                             00000500
     DCL NORFILE         FILE RECORD OUTPUT;                            00000510
                                                                        00000520
 /*------------------------------------------------------------------*/ 00000530
 /*  TRYGDEKONTORTABELL                                              */ 00000540
 /*------------------------------------------------------------------*/ 00000550
                                                                        00000560
     DCL  01 TKNR_TAB ( 101 : 2400 ) AUTOMATIC,                         00000570
             05  NORTRYGDKTR     CHAR(1)     INIT(' ');                 00000580
                                                                        00000590
     DCL TKNR_IND        BINARY FIXED(15);                              00000600
                                                                        00000610
                                                                        00000620
 /*  TELLERE, BRYTERE, INNEBYGDE FUNKSJONER   */                        00000630
                                                                        00000640
     DCL TELLER_LEST     BINARY FIXED(31) INIT (0);                     00000650
     DCL TELLER_NORREC   BINARY FIXED(31) INIT (0);                     00000660
                                                                        00000670
     DCL MER_DATA        BIT(1)           INIT ('1'B);                  00000680
     DCL FØRSTE_ROT      BIT(1);                                        00000690
     DCL FØRSTE_HENDELSE BIT(1);                                        00000700
     DCL YTELSE_OPPHØRT  BIT(1)           INIT ('0'B);                  00000710
                                                                        00000720
     DCL (ONCODE, SUBSTR, ADDR, STG, DATE, TIME, VERIFY,                00000730
     PLIRETC)                                       BUILTIN;            00000740
     DCL RETCODE         BINARY FIXED(31)   INIT (0);                   00000750
                                                                        00000760
     DCL I               BINARY FIXED(15);                              00000770
     DCL J               BINARY FIXED(15);                              00000780
                                                                        00000790
 /*------------------------------------------------------------------*/ 00000800
 /*  HJELPEOMRÅDER                                                   */ 00000810
 /*------------------------------------------------------------------*/ 00000820
                                                                        00000830
                                                                        00000840
     DCL  W01_AKT_VERSJON     PIC '999';                                00000850
                                                                        00000860
     DCL  W01_FNR_PIC         PIC '(11)9';                              00000870
                                                                        00000880
 /*  HJELPEOMRÅDER FOR INPUT/OUTPUT */                                  00000890
                                                                        00000900
     DCL  W01_IO              CHAR (700);                               00000910
                                                                        00000920
     DCL  W01_HJELPE_IO       CHAR (700)    BASED (HJELPE_PEKER);       00000930
                                                                        00000940
     DCL  HJELPE_PEKER        POINTER;                                  00000950
                                                                        00000960
     DCL  W02_AKT_HENDELSE    LIKE W_HENDELSE;                          00000970
     DCL  W02_AKT_ROT         LIKE W_ROT;                               00000980
                                                                        00000990
 /*  START-PARAMETERE */                                                00001000
                                                                        00001010
     DCL  W01_START_FNR       PIC '(11)9'     INIT((11)'0');            00001020
     DCL  W01_ØNSKET_ANTALL   PIC '(6)9'      INIT((6)'0');             00001030
                                                                        00001040
 /*  DATO-HÅNDTERING */                                                 00001050
                                                                        00001060
     DCL 01 W01_DATO,                                                   00001070
            02 W01_ÅR                  CHAR(2),                         00001080
            02 W01_MND                 CHAR(2),                         00001090
            02 W01_DAG                 CHAR(2);                         00001100
     DCL W01_DATO_DEF  DEF W01_DATO    CHAR(6);                         00001110
                                                                        00001120
 /*  TIDS-HÅNDTERING */                                                 00001130
                                                                        00001140
     DCL 01 W01_TID,                                                    00001150
            02 W01_TTMM          CHAR(4),                               00001160
            02 W01_TID_REST      CHAR(5);                               00001170
     DCL W01_TID_DEF DEF W01_TID CHAR(9);                               00001180
                                                                        00001190
                                                                        00001200
 /*  REDEF AV REGISTRERINGSTIDSPUNKT */                                 00001210
                                                                        00001220
     DCL 01 W01_REGTIDSPUNKT,                                           00001230
            02 W01_REGTID_TTMMSS CHAR(6),                               00001240
            02 W01_REGDATO_ÅMD   CHAR(6);                               00001250
     DCL W01_REGTIDSPUNKT_DEF    DEF W01_REGTIDSPUNKT  CHAR(12);        00001260
                                                                        00001270
     DCL W01_FNR                         PIC '(11)9';                   00001280
     DCL W01_FNR_ÅR DEF W01_FNR POS (5)  PIC '99';                      00001290
                                                                        00001300
     DCL HJ_SUM_YTELSE    FIXED DEC (7) INIT (0);                       00001310
 %SKIP(2);                                                              00001320
 /*------------------------------------------------------------------*/ 00001330
 /*  SLUTT PÅ DEKLARASJONENE.  CALLER INITIERING OG LESER PARAMETERE */ 00001340
 /*------------------------------------------------------------------*/ 00001350
                                                                        00001360
      N_PEKER = ADDR(NOR_RECORD);                                       00001370
                                                                        00001380
          ON ERROR BEGIN;                                               00001390
             ON ERROR SYSTEM;                                           00001400
             PUT FILE (SYSPRINT) EDIT ('FEIL HAR OPPSTÅTT. ONCODE = ',  00001410
                                        ONCODE)                         00001420
                                      ( SKIP,COL(4),A,A(4));            00001430
             PUT FILE (SYSPRINT) EDIT ('SISTE FNR: ',                   00001440
                                        W02_AKT_ROT.FNR)                00001450
                                      ( SKIP,COL(4),A,P'999999B999B99');00001460
             RETCODE = 100;                                             00001470
          END;                                                          00001480
                                                                        00001490
          CALL P005_INIT;                                               00001500
                                                                        00001510
          GET FILE (SYSIN) EDIT (W01_START_FNR,W01_ØNSKET_ANTALL)       00001520
                                (P'99999999999',X(1),P'999999');        00001530
                                                                        00001540
          PUT FILE (SYSPRINT) EDIT ('START KJØRING R001NO20 ',          00001550
                                     W01_DAG,W01_MND,W01_ÅR,' KL.',     00001560
                                     W01_TTMM)                          00001570
                                   (PAGE,COL(4),A,A,A,A,A,A);           00001580
          PUT FILE (SYSPRINT) EDIT ('START-FNR = ',W01_START_FNR)       00001590
                                   (SKIP,COL(4),A,P'99999999999');      00001600
          PUT FILE (SYSPRINT) EDIT ('ANTALL PERSONER ØNSKET BEH. = ',   00001610
                                     W01_ØNSKET_ANTALL)                 00001620
                                   (SKIP,COL(4),A,P'999999');           00001630
                                                                        00001640
 /*------------------------------------------------------------------*/ 00001650
 /* HVIS LESINGEN SKAL STARTE PÅ ET BESTEMT FØDSELSNUMMER, BLIR DET  */ 00001660
 /* GJORT OPPSLAG PÅ DETTE FØDSELSNUMMERET I BASEN.  DERSOM ØNSKET   */ 00001670
 /* ANTALL BEHANDLET ER 1 BLIR DENNE PERSONEN BEHANDLET, HVIS IKKE   */ 00001680
 /* LESES NESTE FØR BEHANDLINGEN BEGYNNER.                           */ 00001690
 /*------------------------------------------------------------------*/ 00001700
                                                                        00001710
          IF W01_START_FNR  ^= 99999999999  &                           00001720
             W01_START_FNR  ^= 00000000000   THEN                       00001730
             DO;                                                        00001740
                PKEY = W01_START_FNR;                                   00001750
                CALL     PLIHSSR       (PARM_CT_4,                      00001760
                                        GU,                             00001770
                                        PCB_SB1,                        00001780
                                        W01_IO,                         00001790
                                        SSA1_SB0PERSN);                 00001800
                IF PCB_SB1.STATUS_KODE ^= '  ' THEN                     00001810
                   DO;                                                  00001820
                      PUT FILE (SYSPRINT) EDIT ('PROGRAMMET AVBRYTES!') 00001830
                                               (SKIP(2),COL(4),A);      00001840
                      PUT FILE (SYSPRINT) EDIT ('START-FNR ER FEIL.',   00001850
                                                'START-FNR: ',          00001860
                                                 W01_START_FNR)         00001870
                                                (SKIP,COL(4),A,COL(31), 00001880
                                                 A,P'99999999999');     00001890
                      MER_DATA = '0'B;                                  00001900
                      RETCODE = 100;                                    00001910
                   END;                                                 00001920
                GET = GN;                                               00001930
                IF W01_ØNSKET_ANTALL > 1 THEN                           00001940
                   CALL P030_LES_NESTE_ROT;                             00001950
             END;                                                       00001960
                                                                        00001970
                                                                        00001980
 /*------------------------------------------------------------------*/ 00001990
 /* HVIS DET IKKE BLIR OPPGITT NOE BESTEMT START-FØDSELSNUMMER,      */ 00002000
 /* BEGYNNER LESINGEN FRA BEGYNNELSEN AV STØNADSBREVBASEN.           */ 00002010
 /*------------------------------------------------------------------*/ 00002020
                                                                        00002030
          ELSE                                                          00002040
             DO;                                                        00002050
                CALL P040_LES;                                          00002060
                                                                        00002070
                GET = GN;                                               00002080
             END;                                                       00002090
                                                                        00002100
                                                                        00002110
 %SKIP(2);                                                              00002120
 /*------------------------------------------------------------------*/ 00002130
 /* HOVEDPROSEDYRE.                                                  */ 00002140
 /* ALLE ROTSEGMENTENE LESES. HENDELSES-SEGMENTER BLIR LEST BARE FOR */ 00002150
 /* NORTRYGDKONTORER. DET BLIR DANNET EN NORRECORD FOR DE HENDELSES- */ 00002160
 /* SEGMENTER SOM HAR VERSJON LIK ELLER STØRRE ENN AKTUELL VERSJON.  */ 00002170
 /*------------------------------------------------------------------*/ 00002180
                                                                        00002190
 L100:    DO WHILE (MER_DATA & TELLER_LEST <= W01_ØNSKET_ANTALL);       00002200
                                                                        00002210
                SELECT (PCB_SB1.SEGM_NAVN);                             00002220
                                                                        00002230
                   WHEN ('SB0PERSN')                                    00002240
                                                                        00002250
                    /*-----------------------------------------------*/ 00002260
                    /* NÅR ET ROTSEGMENT LESES, BLIR TKNR-INDEKS GITT*/ 00002270
                    /* VERDI. HVIS DET ER ET NORTRYGDKONTOR SKRIVES  */ 00002280
                    /* RECORD FOR SISTE AKTUELLE HENDELSES-SEGMENT   */ 00002290
                    /* FOR FORRIGE PERSON UT.                        */ 00002300
                    /*-----------------------------------------------*/ 00002310
                      DO;                                               00002320
                         SUBSTR ( ADDR(W_ROT) -> W01_HJELPE_IO, 1,      00002330
                                               STG(W_ROT) ) = W01_IO;   00002340
                                                                        00002350
                         /* IF-TEST FOR Å UNNGÅ DUMMY-RECORD: */        00002360
                         IF W_ROT.FNR ^= 99999999999  &                 00002370
                            W_ROT.FNR  > 01000000000  THEN              00002380
                                                                        00002390
                            DO;                                         00002400
                               TELLER_LEST      = TELLER_LEST + 1;      00002410
                               TKNR_IND         = W_ROT.TKNR;           00002420
                 /*FEIL!!      W01_FNR          = W_ROT.FNR; TRUDE0992*/00002430
                                                                        00002440
                                                                        00002450
                               IF NORTRYGDKTR (TKNR_IND) = 'J' THEN     00002460
                                  DO;                                   00002470
                                     IF ^ FØRSTE_ROT      &             00002480
                                        ^ FØRSTE_HENDELSE THEN          00002490
                                        DO;                             00002500
                                           CALL P020_LAG_RECORD;        00002510
                                        END;                            00002520
                                     ELSE                               00002530
                                        FØRSTE_ROT = '0'B;              00002540
                                     W02_AKT_ROT = W_ROT;               00002550
                                     YTELSE_OPPHØRT = '0'B;             00002560
                                     FØRSTE_HENDELSE = '1'B;            00002570
                                  END;                                  00002580
                            END;                                        00002590
                      END;                                              00002600
                                                                        00002610
                   WHEN ('HENDELSE')                                    00002620
                                                                        00002630
                    /*-----------------------------------------------*/ 00002640
                    /* DET DANNES IKKE NOR-RECORD PÅ GRUNNLAG AV ET  */ 00002650
                    /* HENDELSES-SEGMENT FØR NESTE SEGMENT ER LEST,  */ 00002660
                    /* OG DET ER TESTET PÅ VERSJON/HENDELSESDATO OM  */ 00002670
                    /* FORRIGE SEGMENT ER EN AKTUELL HENDELSE.       */ 00002680
                    /*-----------------------------------------------*/ 00002690
                                                                        00002700
                      DO;                                               00002710
                                                                        00002720
                         SUBSTR ( ADDR(W_HENDELSE) -> W01_HJELPE_IO,    00002730
                                     1, STG(W_HENDELSE) ) = W01_IO;     00002740
                                                                        00002750
                         IF FØRSTE_HENDELSE  THEN                       00002760
                            DO;                                         00002770
                               FØRSTE_HENDELSE = '0'B;                  00002780
                               W01_AKT_VERSJON = W_HENDELSE.VERSJON;    00002790
                               W02_AKT_HENDELSE = W_HENDELSE;           00002800
                            END;                                        00002810
                                                                        00002820
                         ELSE                                           00002830
                                                                        00002840
                    /*-----------------------------------------------*/ 00002850
                    /* DERSOM DENNE VERSJON ER MINDRE ENN AKTUELL    */ 00002860
                    /* VERSJON SKAL DETTE SEGMENTET IKKE BEHANDLES.  */ 00002870
                    /*-----------------------------------------------*/ 00002880
                                                                        00002890
                    /*   IF W_HENDELSE.VERSJON ^< W01_AKT_VERSJON */    00002900
     /*                     IF W_HENDELSE.VERSJON > W01_AKT_VERSJON     00002910
                                                             THEN       00002920
                               DO;                                      00002930
     */                                                                 00002940
                                                                        00002950
                    /*-----------------------------------------------*/ 00002960
                    /* HER TESTES OM FORRIGE LESTE HENDELSE SKAL     */ 00002970
                    /* DANNE GRUNNLAG FOR EN OVERFØRING.             */ 00002980
                    /*-----------------------------------------------*/ 00002990
                                                                        00003000
                                  IF YTELSE_OPPHØRT                   ! 00003010
                                     W_HENDELSE.HENDDATO > 0      !     00003020
                /*                          W02_AKT_HENDELSE.HENDDATO ! 00003030
                */                                                      00003040
                                     W_HENDELSE.OPPHØRS_KODE = 'D'  THEN00003050
                                     DO;                                00003060
                                        YTELSE_OPPHØRT = '0'B;          00003070
                                        CALL P020_LAG_RECORD;           00003080
                                     END;                               00003090
                                  IF W_HENDELSE.OPPHØRS_KODE ^= ' ' THEN00003100
                                     YTELSE_OPPHØRT = '1'B;             00003110
                                                                        00003120
                                  W02_AKT_HENDELSE = W_HENDELSE;        00003130
                                  W01_AKT_VERSJON = W_HENDELSE.VERSJON; 00003140
                               END;                                     00003150
     /*               END;                                              00003160
     */                                                                 00003170
                   OTHERWISE                                            00003180
                      DO;                                               00003190
                         PUT FILE (SYSPRINT) EDIT ('PROGRAMMET ',       00003200
                                                   'STOPPES!!')         00003210
                                                  (SKIP(2),COL(4),A,A); 00003220
                         PUT FILE (SYSPRINT) EDIT ('FEIL SEGMENTTYPE ', 00003230
                                                   'ER LEST.',          00003240
                                                   'SEGMENTTYPE: ',     00003250
                                                    PCB_SB1.SEGM_NAVN,  00003260
                                                   'PCB-NØKKEL: ',      00003270
                                                    PCB_SB1.KEY_FB_OMR) 00003280
                                                  (SKIP,COL(4),A,A,     00003290
                                                   COL(31),A,A,A,A);    00003300
                         STOP;                                          00003310
                      END;                                              00003320
                END;                                                    00003330
                                                                        00003340
 /*------------------------------------------------------------------*/ 00003350
 /*  DERSOM TRYGDEKONTORNUMMERET I ROTSEGMENTET IKKE TILHØRER ET     */ 00003360
 /*  NORTRYGD-KONTOR, SKAL IKKE UNDERLIGGENDE HENDELSES-SEGMENTER    */ 00003370
 /*  LESES, MEN NESTE ROTSEGMENT.                                    */ 00003380
 /*------------------------------------------------------------------*/ 00003390
                                                                        00003400
             IF NORTRYGDKTR (TKNR_IND) = 'J'                     THEN   00003410
                   CALL P040_LES;                                       00003420
                ELSE                                                    00003430
                   CALL P030_LES_NESTE_ROT;                             00003440
          END L100;                                                     00003450
                                                                        00003460
 /*------------------------------------------------------------------*/ 00003470
 /* SLUTT PÅ GJENTAGELSE AV PERSONER.  DET BLIR LAGET EN NOR-RECORD  */ 00003480
 /* PÅ GRUNNLAG AV SISTE HENDELSESSEGMENT FOR SISTE PERSON, FØR      */ 00003490
 /* PROGRAMMET AVSLUTTES.                                            */ 00003500
 /*------------------------------------------------------------------*/ 00003510
                                                                        00003520
          IF ^ FØRSTE_ROT    &                                          00003530
             ^ FØRSTE_HENDELSE THEN                                     00003540
             DO;                                                        00003550
                CALL P020_LAG_RECORD;                                   00003560
             END;                                                       00003570
                                                                        00003580
          PUT FILE (SYSPRINT) EDIT ('ANTALL PERSONER LEST: ',           00003590
                                     TELLER_LEST)                       00003600
                                   (SKIP(2),COL(4),A,P'9999999');       00003610
          PUT FILE (SYSPRINT) EDIT ('ANTALL RECORDS OVERFØRT: ',        00003620
                                     TELLER_NORREC)                     00003630
                                   (SKIP,COL(4),A,P'99999999');         00003640
          PUT FILE (SYSPRINT) EDIT ('SISTE FNR BEHANDLET: ',W_ROT.FNR)  00003650
                                   (SKIP,COL(4),A,P'99999999999');      00003660
          W01_DATO_DEF = DATE;                                          00003670
          W01_TID_DEF  = TIME;                                          00003680
          PUT FILE (SYSPRINT) EDIT ('STOPP KJØRING R001NO20 ',          00003690
                                     W01_DAG,W01_MND,W01_ÅR,' KL.',     00003700
                                     W01_TTMM)                          00003710
                                   (SKIP,COL(4),A,A,A,A,A,A);           00003720
                                                                        00003730
          CALL PLIRETC(RETCODE);                                        00003740
                                                                        00003750
          CLOSE FILE (SYSIN),                                           00003760
                FILE (SYSPRINT),                                        00003770
                FILE (NORFILE);                                         00003780
                                                                        00003790
          RETURN;                                                       00003800
                                                                        00003810
                                                                        00003820
                                                                        00003830
 %PAGE;                                                                 00003840
 P005_INIT: PROC;                                                       00003850
 /*------------------------------------------------------------------*/ 00003860
 /* LESER VSAMFIL REGION OG DANNER EN TABELL OVER GYLDIGE TRYGDEKON- */ 00003870
 /* TORNUMMER OG NORTRYGDKONTORER.  DIV. INITIERING                  */ 00003880
 /*------------------------------------------------------------------*/ 00003890
                                                                        00003900
                                                                        00003910
     DCL  01 NOR_SENTRAL_REC,                                           00003920
             05  TKNR              PIC      '(4)9',                     00003930
             05  KD_SENTRAL        FIXED DEC (3),                       00003940
             05  NOR_SENTRAL       FIXED DEC (3),                       00003950
             05  FILLER            CHAR      (31);                      00003960
                                                                        00003970
     DCL  REGION    FILE RECORD SEQUENTIAL INPUT    ENV(VSAM);          00003980
     DCL  EOF_REGION               BIT (1)          INIT('0'B);         00003990
                                                                        00004000
          ON ENDFILE (REGION)      EOF_REGION = '1'B;                   00004010
                                                                        00004020
          OPEN FILE (REGION);                                           00004030
                                                                        00004040
          READ FILE (REGION) INTO (NOR_SENTRAL_REC);                    00004050
                                                                        00004060
          DO WHILE (^EOF_REGION);                                       00004070
             TKNR_IND    = NOR_SENTRAL_REC.TKNR;                        00004080
             IF NOR_SENTRAL > 0  THEN                                   00004090
                NORTRYGDKTR (TKNR_IND) = 'J';                           00004100
             READ FILE (REGION) INTO (NOR_SENTRAL_REC);                 00004110
          END;                                                          00004120
                                                                        00004130
          CLOSE FILE (REGION);                                          00004140
                                                                        00004150
          OPEN FILE (SYSIN),                                            00004160
               FILE (SYSPRINT),                                         00004170
               FILE (NORFILE);                                          00004180
                                                                        00004190
                                                                        00004200
          GET          = GU;                                            00004210
          SSA_UQUAL    = 'SB0PERSN ';                                   00004220
          W01_DATO_DEF = DATE;                                          00004230
          W01_TID_DEF  = TIME;                                          00004240
          FØRSTE_ROT   = '1'B;                                          00004250
                                                                        00004260
                                                                        00004270
     END P005_INIT;                                                     00004280
                                                                        00004290
                                                                        00004300
 %PAGE;                                                                 00004310
 /*------------------------------------------------------------------*/ 00004320
 /* LAGER RECORD FOR OVERFØRING TIL NORTRYGD-PENSJONER               */ 00004330
 /*------------------------------------------------------------------*/ 00004340
 P020_LAG_RECORD: PROCEDURE;                                            00004350
                                                                        00004360
          W01_TID_DEF            = TIME;                                00004370
          DATA                   = '';                                  00004380
                                                                        00004390
 /* LAGER RECORDHODE                                                 */ 00004400
                                                                        00004410
          HODE.TKNR              = W02_AKT_ROT.TKNR;                    00004420
          HODE.RECORD_TYPE       = 'PE';                                00004430
          HODE.TRANSTYPE         = '06';                                00004440
          HODE.TRANSDATO         = W01_DATO_DEF;                        00004450
          HODE.TRANSTID          = W01_TTMM;                            00004460
                                                                        00004470
 /* LAGER RECORDDATA                                                 */ 00004480
                                                                        00004490
          DATATYPE               = 01;                                  00004500
          W01_FNR_PIC              = W02_AKT_ROT.FNR;                   00004510
          W01_FNR                  = W02_AKT_ROT.FNR;  /* TRUDE 0992*/  00004520
          DATA.FNR                 = W01_FNR_PIC;                       00004530
                                                                        00004540
          DATA.TKNR                = W02_AKT_ROT.TKNR;                  00004550
          DATA.VIRKNINGS_DATO      = W02_AKT_HENDELSE.HENDDATO;         00004560
          W01_REGTIDSPUNKT_DEF     = W02_AKT_ROT.SISTE_REG_TIDSPUNKT;   00004570
          IF F_NUMERISK(W01_REGDATO_ÅMD)                THEN            00004580
             DATA.STØNADSBREVDATO  = W01_REGDATO_ÅMD;                   00004590
                                                                        00004600
          DATA.PENSJONSTYPE        = W02_AKT_HENDELSE.PENSJONSTYPE1 !!  00004610
                                     W02_AKT_HENDELSE.PENSJONSTYPE2 !!  00004620
                                     W02_AKT_HENDELSE.PENSJONSTYPE3 ;   00004630
                                                                        00004640
          DATA.TP_GAR_KODE    = W02_AKT_HENDELSE.TP_GAR_KODE;           00004650
          DATA.GAMMEL_SAMMENSTØTS_REGEL =                               00004660
                     W02_AKT_HENDELSE.GAMMEL_SAMMENSTØTS_REGEL;         00004670
                                                                        00004680
                                                                        00004690
 /*22.4.91 - HL : NYE FELTER, INNTEKTSPRØVET FORSØRGINGSTILLEGG : */    00004700
                                                                        00004710
  DATA.FT_SKAL_BEREGNES    = W02_AKT_HENDELSE.FT_SKAL_BEREGNES;         00004720
  DATA.BT_SÆRBARN          = W02_AKT_HENDELSE.BT_SÆRBARN;               00004730
  DATA.GARANTITILLEGG_EK   = W02_AKT_HENDELSE.GARANTITILLEGG_EK;        00004740
  DATA.GARANTITILLEGG_FBARN= W02_AKT_HENDELSE.GARANTITILLEGG_BARN;      00004750
  DATA.GARANTITILLEGG_SBARN= W02_AKT_HENDELSE.GARANTITILLEGG_SÆRBARN;   00004760
  DATA.PENSJONSINNTEKT     = W02_AKT_HENDELSE.PENSJONSINNTEKT * 100;    00004770
  DATA.FOLKETRYGD          = W02_AKT_HENDELSE.FOLKETRYGD;               00004780
  DATA.ARBEIDSINNTEKT_EK   = W02_AKT_HENDELSE.ARBEIDSINNTEKT_EK * 100;  00004790
  DATA.PENSJONSINNTEKT_EK  = W02_AKT_HENDELSE.PENSJONSINNTEKT_EK * 100; 00004800
  DATA.FOLKETRYGD_EK       = W02_AKT_HENDELSE.FOLKETRYGD_EK;            00004810
                                                                        00004820
          /* ******************************************************** */00004830
          /* TRYGDETID SKAL IKKE OVERFØRES FOR BARNEPENSJONISTER EN   */00004840
          /* AV FORELDRENE DØD.  TLF. MARTIN STENEHJEM 160787.        */00004850
          /* ******************************************************** */00004860
                                                                        00004870
          IF W02_AKT_HENDELSE.PENSJONSTYPE1  ^= 'N' THEN                00004880
             DATA.TRYGDETID        = W02_AKT_HENDELSE.TT;               00004890
                                                                        00004900
          IF W02_AKT_HENDELSE.PENSJONSTYPE1  = 'A' !                    00004910
             W02_AKT_HENDELSE.PENSJONSTYPE1  = 'K' THEN                 00004920
             DO;                                                        00004930
               DATA.GRUNNPENSJON = W02_AKT_HENDELSE.AP_GP_NETTO;        00004940
               DATA.NETTO_GRUNNPENSJON  =                               00004950
                                  W02_AKT_HENDELSE.AP_GP_NETTO; /**/    00004960
             END;                                                       00004970
          ELSE                                                          00004980
            DO;                                                         00004990
             DATA.GRUNNPENSJON        = W02_AKT_HENDELSE.GP_BRUTTO;     00005000
             DATA.NETTO_GRUNNPENSJON  = W02_AKT_HENDELSE.GP_NETTO;/**/  00005010
            END;                                                        00005020
                                                                        00005030
                                                                        00005040
          SELECT (W02_AKT_HENDELSE.PENSJONSTYPE1);                      00005050
                                                                        00005060
 /*   A L D E R S P E N S J O N                                      */ 00005070
                                                                        00005080
             WHEN ('A')                                                 00005090
                DO;                                                     00005100
                   DATA.TILLEGGSPENSJON = W02_AKT_HENDELSE.AP_TP_NETTO; 00005110
             /*    DATA.TILLEGGSPENSJON = W02_AKT_HENDELSE.TP_BRUTTO;*/ 00005120
                   DATA.GARANTITILLEGG_TP_1291 =                        00005130
                                W02_AKT_HENDELSE.GT_TILLEGG_LOV92;      00005140
                   DATA.TILLEGGSPENSJON_1291 =                          00005150
                                          W02_AKT_HENDELSE.GT_LOV92;    00005160
                   DATA.NETTO_TILLEGGSPENSJON=                          00005170
                                    W02_AKT_HENDELSE.TP_NETTO           00005180
                                  + W02_AKT_HENDELSE.AP_TP_NETTO; /**/  00005190
                   DATA.SÆRTILLEGG            = W02_AKT_HENDELSE.ST;    00005200
                                                                        00005210
                   DATA.KOMPTILLEGG           = W02_AKT_HENDELSE.KT;    00005220
                   DATA.GARANTITILLEGG_TP     = W02_AKT_HENDELSE.       00005230
                                               GARANTITILLEGG_TP;       00005240
                   DATA.BARNETILLEGG          = W02_AKT_HENDELSE.BT;    00005250
                   DATA.EKTEFELLETILLEGG      = W02_AKT_HENDELSE.ET;    00005260
                   DATA.ANT_BARN     = W02_AKT_HENDELSE.ANTALL_BARN;    00005270
                   DATA.VENTET_PROSENT =                                00005280
                              W02_AKT_HENDELSE.VENTEFAKTOR * 100;       00005290
                                                                        00005300
                   /* *********************************************** */00005310
                   /* VENTET_OPPLYSNINGER SKAL BARE OVERFØRES I DE    */00005320
                   /* TILFELLER HVOR VENTETILLEGG SKAL UTBETALES.     */00005330
                   /* (TLF. M.STENEHJEM 21.5.87.)                     */00005340
                   /* *********************************************** */00005350
                                                                        00005360
                   IF DATA.VENTET_PROSENT > 0 THEN                      00005370
                      DO;                                               00005380
                         DATA.VENTET_SLUTT_POENG =                      00005390
                              W02_AKT_HENDELSE.SPT_P67 * 100;           00005400
                                                                        00005410
                         DATA.VENTET_SLUTT_MED_OVERKOMP =               00005420
                              W02_AKT_HENDELSE.OPT_P67 * 100;           00005430
                         DATA.VENTET_POENGÅR = W02_AKT_HENDELSE.PÅ_P67; 00005440
                         DATA.VENTET_GRUNNPENSJON =                     00005450
                                                W02_AKT_HENDELSE.VT_GP; 00005460
                         DATA.VENTET_TILLEGGSPENSJON =                  00005470
                                         W02_AKT_HENDELSE.VT_TP;        00005480
                      END;                                              00005490
                                                                        00005500
                     HJ_SUM_YTELSE  = W02_AKT_HENDELSE.AP_GP_NETTO      00005510
                                    + W02_AKT_HENDELSE.AP_TP_NETTO      00005520
                                    + W02_AKT_HENDELSE.TP_NETTO;        00005530
                                                                        00005540
                   IF HJ_SUM_YTELSE        >  0  &                      00005550
                      W02_AKT_HENDELSE.APD = 0        THEN              00005560
                      DATA.PENSJONSGRAD = 999;                          00005570
                   ELSE                                                 00005580
                      DATA.PENSJONSGRAD       = W02_AKT_HENDELSE.APD;   00005590
                   DATA.SLUTTPOENGTALL    = W02_AKT_HENDELSE.SPT * 100; 00005600
                   DATA.SLUTTPOENG_MED_OVERKOMP  =                      00005610
                                            W02_AKT_HENDELSE.OPT * 100; 00005620
                   DATA.POENGÅR_45     = W02_AKT_HENDELSE.PÅ -          00005630
                                         W02_AKT_HENDELSE.PÅ_ETTER91;   00005640
                   DATA.POENGÅR_42     = W02_AKT_HENDELSE.PÅ_ETTER91;   00005650
                   DATA.BEREGNINGSALTERNATIV =                          00005660
                                 W02_AKT_HENDELSE.BEREGN_ALT_AEY;       00005670
                   DATA.TIDLIGERE_ERVERVSINNT = W02_AKT_HENDELSE.TEI;   00005680
 /*20.10.90 HL : */                                                     00005690
                   DATA.YRKE_YPT = W02_AKT_HENDELSE.YRKE_YPT * 100;     00005700
                   DATA.YRKE_UFG = W02_AKT_HENDELSE.YRKE_UFG;           00005710
       IF DATA.YRKE_YPT > 0             THEN                            00005720
        IF DATA.YRKE_UFG  > 0         THEN                              00005730
          DO;        /*EGEN YRKERETT */                                 00005740
             IF W01_FNR_ÅR > 40     THEN                                00005750
              DO;                                                       00005760
               DATA.YRKE_PÅ_45 = 40 - W02_AKT_HENDELSE.YRKE_PÅ_ETTER91; 00005770
              END;                                                      00005780
             ELSE                                                       00005790
               DATA.YRKE_PÅ_45 = W01_FNR_ÅR  -                          00005800
                                 W02_AKT_HENDELSE.YRKE_PÅ_ETTER91;      00005810
             DATA.YRKE_PÅ_42 = W02_AKT_HENDELSE.YRKE_PÅ_ETTER91;        00005820
          END;                                                          00005830
        ELSE         /*AVDØD EKTEFELLE GIR YRKERETT */                  00005840
          DO;                                                           00005850
             W01_FNR = W02_AKT_HENDELSE.FNR_EKTEF;                      00005860
             IF W01_FNR_ÅR > 40     THEN                                00005870
               DATA.YRKE_PÅ_45 = 40 - W02_AKT_HENDELSE.YRKE_PÅ_ETTER91; 00005880
             ELSE                                                       00005890
               DATA.YRKE_PÅ_45 = W01_FNR_ÅR  -                          00005900
                                 W02_AKT_HENDELSE.YRKE_PÅ_ETTER91;      00005910
             DATA.YRKE_PÅ_42 = W02_AKT_HENDELSE.YRKE_PÅ_ETTER91;        00005920
          END;                                                          00005930
 /*HIT 20.10.90 HL*/                                                    00005940
                                                                        00005950
                   IF W02_AKT_HENDELSE.PENSJONSTYPE2 = 'E' THEN         00005960
                      DO;                                               00005970
                                                                        00005980
                                                                        00005990
 /*HVIS PENSJONISTEN IKKE HAR EGNE YRKESSKADEFORDELER, SÅ SKAL */       00006000
 /*AVDØDES EVENTUELLE FORDELER LEGGES INN : */                          00006010
                                                                        00006020
                         IF DATA.YRKE_YPT = 0        THEN               00006030
                            DATA.YRKE_YPT =                             00006040
                               W02_AKT_HENDELSE.YRKE_YPT_AVD * 100;     00006050
 /*21.9.90 HL */                                                        00006060
                         DATA.SLUTTP_ETTER_AVDØD =                      00006070
                                         W02_AKT_HENDELSE.SPT_EK * 100; 00006080
                         DATA.SLUTTP_MED_OVER_ETTER_AVD =               00006090
                                         W02_AKT_HENDELSE.OPT_EK * 100; 00006100
                         DATA.POENGÅR_ETTER_AVDØD_45  =                 00006110
                                       W02_AKT_HENDELSE.PÅ_EK -         00006120
                                       W02_AKT_HENDELSE.PÅ_ETTER91_EK;  00006130
                         DATA.POENGÅR_ETTER_AVDØD_42  =                 00006140
                              W02_AKT_HENDELSE.PÅ_ETTER91_EK;           00006150
                                                                        00006160
                                                                        00006170
                     /*  DATA.TILLEGGSPENSJON_AVDØD =              */   00006180
                     /*  FINNES IKKE I STØNADSBREVBASEN, TP HER ER */   00006190
                     /*  EGEN TP OG AVD. TP SAMMENLAGT             */   00006200
                                                                        00006210
                         IF W02_AKT_HENDELSE.PÅ_EK > 0 THEN             00006220
                            DATA.PROS_AV_AVDØD_TILLEGSP =               00006230
                                      W02_AKT_HENDELSE.TP_PROSENT;      00006240
                         DATA.ARBEIDSINNTEKT   =                        00006250
                             W02_AKT_HENDELSE.FORVENTET_INNTEKT * 100;  00006260
                      END;                                              00006270
                                                                        00006280
                   ELSE                                                 00006290
                      DATA.ARBEIDSINNTEKT = W02_AKT_HENDELSE.FAI * 100; 00006300
                                                                        00006310
                /* DATA.TRYGDETID_VED_67         =             */       00006320
                /* I STØNADSBREVBASEN LIGGER BARE TT_ANV.      */       00006330
                END;                                                    00006340
                                                                        00006350
 /*   U F Ø R E P E N S J O N                                        */ 00006360
                                                                        00006370
             WHEN ('U')                                                 00006380
                DO;                                                     00006390
                   DATA.TILLEGGSPENSJON = W02_AKT_HENDELSE.TP_BRUTTO;   00006400
                   DATA.GARANTITILLEGG_TP_1291 =                        00006410
                                W02_AKT_HENDELSE.GT_TILLEGG_LOV92;      00006420
                   DATA.TILLEGGSPENSJON_1291 =                          00006430
                                          W02_AKT_HENDELSE.GT_LOV92;    00006440
                   DATA.NETTO_TILLEGGSPENSJON =                         00006450
                                    W02_AKT_HENDELSE.TP_NETTO;          00006460
                   DATA.SÆRTILLEGG            = W02_AKT_HENDELSE.ST;    00006470
                                                                        00006480
                   DATA.KOMPTILLEGG           = W02_AKT_HENDELSE.KT;    00006490
                   DATA.GARANTITILLEGG_TP     = W02_AKT_HENDELSE.       00006500
                                               GARANTITILLEGG_TP;       00006510
                   DATA.BARNETILLEGG          = W02_AKT_HENDELSE.BT;    00006520
                   DATA.ANT_BARN      = W02_AKT_HENDELSE.ANTALL_BARN;   00006530
                   DATA.PENSJONSGRAD  = W02_AKT_HENDELSE.UF_GRAD;       00006540
                                                                        00006550
                   DATA.SLUTTPOENGTALL = W02_AKT_HENDELSE.SPT * 100;    00006560
                   DATA.SLUTTPOENG_MED_OVERKOMP =                       00006570
                                         W02_AKT_HENDELSE.OPT * 100;    00006580
                   DATA.POENGÅR_45     = W02_AKT_HENDELSE.PÅ -          00006590
                                         W02_AKT_HENDELSE.PÅ_ETTER91;   00006600
                   DATA.POENGÅR_42     = W02_AKT_HENDELSE.PÅ_ETTER91;   00006610
                                                                        00006620
                   IF W02_AKT_HENDELSE.ÅFT > 0            THEN          00006630
                      DO;                                               00006640
                         DATA.HAR_ÅTTE_FEM_TILLEGG = 'J';               00006650
                         DATA.ÅTTE_FEM_TILLEGG = W02_AKT_HENDELSE.ÅFT;  00006660
                      END;                                              00006670
                                                                        00006680
 /*EØS*/           ELSE                                                 00006690
                   IF W02_AKT_HENDELSE.PRO_RATA_BEREGNING = 'J' THEN    00006700
                         DATA.HAR_ÅTTE_FEM_TILLEGG = 'E';               00006710
                                                                        00006720
                   IF W02_AKT_HENDELSE.PENSJONSTYPE2 = 'E' THEN         00006730
                      DO;                                               00006740
                         IF W02_AKT_HENDELSE.DØD_AV_YSKADE = 'E' &      00006750
                            W02_AKT_HENDELSE.YRKE_YPT_AVD > 0 THEN      00006760
                                                                        00006770
                                                                        00006780
 /*21.9.90 HL */            DATA.YRKE_YPT =                             00006790
                               W02_AKT_HENDELSE.YRKE_YPT_AVD * 100;     00006800
                         DATA.SLUTTP_ETTER_AVDØD =                      00006810
                                       W02_AKT_HENDELSE.SPT_EK * 100;   00006820
                         DATA.SLUTTP_MED_OVER_ETTER_AVD =               00006830
                                       W02_AKT_HENDELSE.OPT_EK * 100;   00006840
                         DATA.POENGÅR_ETTER_AVDØD_45  =                 00006850
                                    W02_AKT_HENDELSE.PÅ_EK -            00006860
                                    W02_AKT_HENDELSE.PÅ_ETTER91_EK;     00006870
                         DATA.POENGÅR_ETTER_AVDØD_42  =                 00006880
                              W02_AKT_HENDELSE.PÅ_ETTER91_EK;           00006890
                                                                        00006900
                     /*  DATA.TILLEGGSPENSJON_AVDØD =              */   00006910
                     /*  FINNES IKKE I STØNADSBREVBASEN, TP HER ER */   00006920
                     /*  EGEN TP OG AVD. TP SAMMENLAGT             */   00006930
                                                                        00006940
                         IF W02_AKT_HENDELSE.PÅ_EK > 0 THEN             00006950
                            DATA.PROS_AV_AVDØD_TILLEGSP =               00006960
                                        W02_AKT_HENDELSE.TP_PROSENT;    00006970
                      END;                                              00006980
                                                                        00006990
                   ELSE                                                 00007000
                      DATA.EKTEFELLETILLEGG   = W02_AKT_HENDELSE.ET;    00007010
                                                                        00007020
                   DATA.ARBEIDSINNTEKT =                                00007030
                           W02_AKT_HENDELSE.FORVENTET_INNTEKT * 100;    00007040
                END;                                                    00007050
                                                                        00007060
 /*   E T T E R L A T T E P E N S J O N                              */ 00007070
                                                                        00007080
             WHEN ('E')                                                 00007090
                DO;                                                     00007100
                   DATA.TILLEGGSPENSJON = W02_AKT_HENDELSE.TP_BRUTTO;   00007110
                   DATA.GARANTITILLEGG_TP_1291 =                        00007120
                                W02_AKT_HENDELSE.GT_TILLEGG_LOV92;      00007130
                   DATA.TILLEGGSPENSJON_1291 =                          00007140
                                          W02_AKT_HENDELSE.GT_LOV92;    00007150
                   DATA.NETTO_TILLEGGSPENSJON  =                        00007160
                                          W02_AKT_HENDELSE.TP_NETTO;    00007170
                                                                        00007180
                   DATA.SÆRTILLEGG          = W02_AKT_HENDELSE.ST;      00007190
                   DATA.KOMPTILLEGG         = W02_AKT_HENDELSE.KT;      00007200
                                                                        00007210
       /*---SKAL FORSØKE Å FÅ UT YSKADE  ETTER AVDØD 220992 TRUDE---*/  00007220
       /*---SLIK VAR DET :                                       ---*/  00007230
       /*----            IF W02_AKT_HENDELSE.DØD_AV_YSKADE = 'E' &    */00007240
       /*--------           W02_AKT_HENDELSE.YRKE_YPT_AVD > 0 THEN    */00007250
 /*21.9.90 HL               DATA.YRKE_YPT =                          */ 00007260
       /*--------              W02_AKT_HENDELSE.YRKE_YPT_AVD * 100;  */ 00007270
                                                                        00007280
       /* AVDØDE VAR YRKESSKADET                                     */ 00007290
                         IF  W02_AKT_HENDELSE.YRKE_YPT_AVD > 0 THEN     00007300
                           DO;                                          00007310
                             W01_FNR = W02_AKT_HENDELSE.FNR_EKTEF;      00007320
                             IF W01_FNR_ÅR > 40     THEN                00007330
                                DATA.YRKE_PÅ_45 = 40 -                  00007340
                                  W02_AKT_HENDELSE.YRKE_PÅ_ETTER91_AVD; 00007350
                             ELSE                                       00007360
                                DATA.YRKE_PÅ_45 = W01_FNR_ÅR  -         00007370
                                  W02_AKT_HENDELSE.YRKE_PÅ_ETTER91_AVD; 00007380
                             DATA.YRKE_PÅ_42 =                          00007390
                                  W02_AKT_HENDELSE.YRKE_PÅ_ETTER91_AVD; 00007400
                             DATA.YRKE_YPT =                            00007410
                                  W02_AKT_HENDELSE.YRKE_YPT_AVD * 100;  00007420
     /*   PUT FILE (SYSPRINT) EDIT ('W01_FNR_AVD = ',                   00007430
                             W01_FNR)                                   00007440
                                   (SKIP,COL(4),A,P'99999999999'); */   00007450
    /*TELF M STENEHJEM I DAG 15.10.92 OPPLYSNING OM YRKE_UFG KAN */     00007460
    /*IKKE NORTRYGD BRUKE. TRUDE 15.10.92 */                            00007470
                          /* DATA.YRKE_UFG =                            00007480
                                  W02_AKT_HENDELSE.YRKE_UFG_AVD */      00007490
                           END;                                         00007500
       /* AVDØDE VAR YRKESSKADET  TIL HIT TRUDE 220992               */ 00007510
                                                                        00007520
                                                                        00007530
                         DATA.SLUTTP_ETTER_AVDØD =                      00007540
                                         W02_AKT_HENDELSE.SPT_EK * 100; 00007550
                         DATA.SLUTTP_MED_OVER_ETTER_AVD =               00007560
                                         W02_AKT_HENDELSE.OPT_EK * 100; 00007570
                         DATA.POENGÅR_ETTER_AVDØD_45  =                 00007580
                                   W02_AKT_HENDELSE.PÅ_EK -             00007590
                                   W02_AKT_HENDELSE.PÅ_ETTER91_EK;      00007600
                         DATA.POENGÅR_ETTER_AVDØD_42  =                 00007610
                              W02_AKT_HENDELSE.PÅ_ETTER91_EK;           00007620
                                                                        00007630
                                                                        00007640
               /*  DATA.TILLEGGSPENSJON_AVDØD      =             */     00007650
               /*  FINNES IKKE I STØNADSBREVBASEN, TP HER ER */         00007660
               /*  EGEN TP OG AVD. TP SAMMENLAGT             */         00007670
                                                                        00007680
                   IF W02_AKT_HENDELSE.PÅ_EK > 0 THEN                   00007690
                      DATA.PROS_AV_AVDØD_TILLEGSP =                     00007700
                                 W02_AKT_HENDELSE.TP_PROSENT;           00007710
                                                                        00007720
                   DATA.ARBEIDSINNTEKT =                                00007730
                           W02_AKT_HENDELSE.FORVENTET_INNTEKT * 100;    00007740
                END;                                                    00007750
                                                                        00007760
 /*   E T T E R L A T T   F A M I L I E P L E I E R                  */ 00007770
                                                                        00007780
             WHEN ('J')                                                 00007790
                DO;                                                     00007800
                   DATA.SÆRTILLEGG     = W02_AKT_HENDELSE.ST;           00007810
                   DATA.KOMPTILLEGG    = W02_AKT_HENDELSE.KT;           00007820
                   DATA.ARBEIDSINNTEKT =                                00007830
                        W02_AKT_HENDELSE.FORVENTET_INNTEKT * 100;       00007840
                END;                                                    00007850
                                                                        00007860
 /*   F O R E L D R E L Ø S T   B A R N                              */ 00007870
                                                                        00007880
             WHEN ('B')                                                 00007890
                DO;                                                     00007900
                   DATA.TILLEGGSPENSJON = W02_AKT_HENDELSE.TP_BRUTTO;   00007910
                   DATA.GARANTITILLEGG_TP_1291 =                        00007920
                                W02_AKT_HENDELSE.GT_TILLEGG_LOV92;      00007930
                   DATA.TILLEGGSPENSJON_1291 =                          00007940
                                          W02_AKT_HENDELSE.GT_LOV92;    00007950
                   DATA.NETTO_TILLEGGSPENSJON  =                        00007960
                                          W02_AKT_HENDELSE.TP_NETTO;    00007970
                                                                        00007980
                   DATA.SÆRTILLEGG      = W02_AKT_HENDELSE.ST;          00007990
                   DATA.KOMPTILLEGG     = W02_AKT_HENDELSE.KT;          00008000
                   DATA.SLUTTP_ETTER_AVDØD   =                          00008010
                                      W02_AKT_HENDELSE.SPT_EK * 100;    00008020
                   DATA.SLUTTP_MED_OVER_ETTER_AVD  =                    00008030
                                      W02_AKT_HENDELSE.OPT_EK * 100;    00008040
                   DATA.POENGÅR_ETTER_AVDØD_45 =                        00008050
                                     W02_AKT_HENDELSE.PÅ_EK -           00008060
                                     W02_AKT_HENDELSE.PÅ_ETTER91_EK;    00008070
                   DATA.POENGÅR_ETTER_AVDØD_42  =                       00008080
                              W02_AKT_HENDELSE.PÅ_ETTER91_EK;           00008090
                                                                        00008100
                   DATA.BARNEPENSJONS_TYPE =                            00008110
                                      W02_AKT_HENDELSE.PENSJONSTYPE1;   00008120
                                                                        00008130
                                                                        00008140
                   IF W02_AKT_HENDELSE.PENSJONSTYPE2 = 'P'  THEN        00008150
                      DO;                                               00008160
                         DATA.ANT_BARN = W02_AKT_HENDELSE.ANTALL_BARN;  00008170
                         SUBSTR(DATA.PENSJONSTYPE,2,1) = 'Y';           00008180
                      END;                                              00008190
                                                                        00008200
               /*  DATA.TILLEGGSPENSJON_AVDØD =              */         00008210
               /*  HVIS PT3 ^= U LIGGER TP.AVDØD I BRUTTO    */         00008220
               /*  TILLEGGSPENSJON                           */         00008230
                                                                        00008240
                   IF W02_AKT_HENDELSE.PENSJONSTYPE3 = 'U' THEN         00008250
                      DATA.PENSJONSGRAD = W02_AKT_HENDELSE.UF_GRAD;     00008260
                                                                        00008270
                END;                                                    00008280
                                                                        00008290
 /*   B A R N E P E N S J O N                                        */ 00008300
                                                                        00008310
             WHEN ('N')                                                 00008320
                DO;                                                     00008330
                   IF W02_AKT_HENDELSE.PENSJONSTYPE3 = 'U' THEN         00008340
                      DO;                                               00008350
                         DATA.TILLEGGSPENSJON  =                        00008360
                                          W02_AKT_HENDELSE.TP_BRUTTO;   00008370
                   DATA.GARANTITILLEGG_TP_1291 =                        00008380
                                W02_AKT_HENDELSE.GT_TILLEGG_LOV92;      00008390
                   DATA.TILLEGGSPENSJON_1291 =                          00008400
                                          W02_AKT_HENDELSE.GT_LOV92;    00008410
                         DATA.NETTO_TILLEGGSPENSJON =                   00008420
                                          W02_AKT_HENDELSE.TP_NETTO;    00008430
                         DATA.SÆRTILLEGG       = W02_AKT_HENDELSE.ST;   00008440
                         DATA.KOMPTILLEGG      = W02_AKT_HENDELSE.KT;   00008450
                         DATA.PENSJONSGRAD = W02_AKT_HENDELSE.UF_GRAD;  00008460
                      END;                                              00008470
                                                                        00008480
                   DATA.BARNEPENSJONS_TYPE =                            00008490
                                      W02_AKT_HENDELSE.PENSJONSTYPE1;   00008500
                                                                        00008510
                                                                        00008520
                   IF W02_AKT_HENDELSE.PENSJONSTYPE2 = 'P'  THEN        00008530
                      DO;                                               00008540
                        DATA.ANT_BARN = W02_AKT_HENDELSE.ANTALL_BARN;   00008550
                        SUBSTR(DATA.PENSJONSTYPE,2,1)  = 'Y';           00008560
                   END;                                                 00008570
                END;                                                    00008580
                                                                        00008590
 /*   A V T A L E F E S T E E  P E N S J O N                         */ 00008600
                                                                        00008610
             WHEN ('K')                                                 00008620
                DO;                                                     00008630
                   IF W02_AKT_HENDELSE.PENSJONSTYPE2 ^= 'N' THEN        00008640
                   DO;                                                  00008650
                        /*EKTEFELLE TILLEGG VAR GLEMT UNDER AFP */      00008660
                        /*TRUDE, 150992 :                       */      00008670
                   DATA.EKTEFELLETILLEGG      = W02_AKT_HENDELSE.ET;    00008680
                                                                        00008690
                   /* HVORFOR IKKE BEREGNINGSALT PÅ AFP  */             00008700
  /*9210*/         DATA.BEREGNINGSALTERNATIV =                          00008710
  /*9210*/                       W02_AKT_HENDELSE.BEREGN_ALT_AEY;       00008720
                                                                        00008730
                   DATA.TILLEGGSPENSJON = W02_AKT_HENDELSE.AP_TP_NETTO; 00008740
                   DATA.GARANTITILLEGG_TP_1291 =                        00008750
                                W02_AKT_HENDELSE.GT_TILLEGG_LOV92;      00008760
                   DATA.TILLEGGSPENSJON_1291 =                          00008770
                                          W02_AKT_HENDELSE.GT_LOV92;    00008780
                     DATA.NETTO_TILLEGGSPENSJON=                        00008790
                                          W02_AKT_HENDELSE.TP_NETTO;    00008800
                     DATA.SÆRTILLEGG            = W02_AKT_HENDELSE.ST;  00008810
                     DATA.KOMPTILLEGG           = W02_AKT_HENDELSE.KT;  00008820
                     DATA.GARANTITILLEGG_TP     = W02_AKT_HENDELSE.     00008830
                                               GARANTITILLEGG_TP;       00008840
                                                                        00008850
   /*1092*/          DATA.AFP_TILLEGG   = W02_AKT_HENDELSE.AFP_TILLEGG; 00008860
                     HJ_SUM_YTELSE  = W02_AKT_HENDELSE.AP_GP_NETTO      00008870
                                    + W02_AKT_HENDELSE.AP_TP_NETTO;     00008880
                                                                        00008890
  /*92 HER SKULLE VI HA  TESTET PÅ UTTAKSDATO !!!! ????       */        00008900
                     IF HJ_SUM_YTELSE        >  0  &                    00008910
                        W02_AKT_HENDELSE.APD =  0  THEN                 00008920
                        DATA.PENSJONSGRAD = 999;                        00008930
                     ELSE                                               00008940
                        DATA.PENSJONSGRAD       = W02_AKT_HENDELSE.APD; 00008950
                     DATA.SLUTTPOENGTALL = W02_AKT_HENDELSE.SPT * 100;  00008960
                     DATA.SLUTTPOENG_MED_OVERKOMP  =                    00008970
                                            W02_AKT_HENDELSE.OPT * 100; 00008980
                     DATA.POENGÅR_45   = W02_AKT_HENDELSE.PÅ -          00008990
                                         W02_AKT_HENDELSE.PÅ_ETTER91;   00009000
                     DATA.POENGÅR_42     = W02_AKT_HENDELSE.PÅ_ETTER91; 00009010
                     DATA.TIDLIGERE_ERVERVSINNT  =                      00009020
                                                W02_AKT_HENDELSE.TEI;   00009030
                                                                        00009040
                     DATA.ARBEIDSINNTEKT = W02_AKT_HENDELSE.FAI * 100;  00009050
                   END;                                                 00009060
                END;                                                    00009070
                                                                        00009080
 /*   Y R K E S K A D E                                            */   00009090
                                                                        00009100
             WHEN ('Y')                                                 00009110
                DO;                                                     00009120
                   DATA.TILLEGGSPENSJON = W02_AKT_HENDELSE.TP_BRUTTO    00009130
                                        + W02_AKT_HENDELSE.YRKE_TP;     00009140
                   DATA.GARANTITILLEGG_TP_1291 =                        00009150
                                W02_AKT_HENDELSE.GT_TILLEGG_LOV92;      00009160
                   DATA.TILLEGGSPENSJON_1291 =                          00009170
                                          W02_AKT_HENDELSE.GT_LOV92;    00009180
                   DATA.NETTO_TILLEGGSPENSJON =                         00009190
                                    W02_AKT_HENDELSE.TP_NETTO +         00009200
                                    W02_AKT_HENDELSE.YRKE_TP;           00009210
                   DATA.GRUNNPENSJON        = DATA.GRUNNPENSJON +       00009220
                                    W02_AKT_HENDELSE.YRKE_GP;           00009230
                   DATA.NETTO_GRUNNPENSJON  = DATA.NETTO_GRUNNPENSJON + 00009240
                                    W02_AKT_HENDELSE.YRKE_GP;           00009250
                                                                        00009260
                   DATA.SÆRTILLEGG            = W02_AKT_HENDELSE.ST;    00009270
                                                                        00009280
                   DATA.KOMPTILLEGG           = W02_AKT_HENDELSE.KT;    00009290
                   DATA.GARANTITILLEGG_TP     = W02_AKT_HENDELSE.       00009300
                                               GARANTITILLEGG_TP;       00009310
                   DATA.BARNETILLEGG          = W02_AKT_HENDELSE.BT     00009320
                                     + W02_AKT_HENDELSE.YRKE_BT;        00009330
                   DATA.ANT_BARN      = W02_AKT_HENDELSE.ANTALL_BARN;   00009340
                   DATA.PENSJONSGRAD  = W02_AKT_HENDELSE.UF_GRAD;       00009350
                                                                        00009360
                   DATA.SLUTTPOENGTALL = W02_AKT_HENDELSE.SPT * 100;    00009370
                   DATA.SLUTTPOENG_MED_OVERKOMP =                       00009380
                                         W02_AKT_HENDELSE.OPT * 100;    00009390
                   DATA.POENGÅR_45     = W02_AKT_HENDELSE.PÅ -          00009400
                                         W02_AKT_HENDELSE.PÅ_ETTER91;   00009410
                   DATA.POENGÅR_42     = W02_AKT_HENDELSE.PÅ_ETTER91;   00009420
                                                                        00009430
                   DATA.YRKE_YPT = W02_AKT_HENDELSE.YRKE_YPT * 100;     00009440
                   DATA.YRKE_UFG = W02_AKT_HENDELSE.YRKE_UFG;           00009450
             IF W01_FNR_ÅR > 40     THEN                                00009460
               DO;                                                      00009470
               DATA.YRKE_PÅ_45 = 40 - W02_AKT_HENDELSE.YRKE_PÅ_ETTER91; 00009480
               END;                                                     00009490
             ELSE                                                       00009500
               DATA.YRKE_PÅ_45 = W01_FNR_ÅR  -                          00009510
                                 W02_AKT_HENDELSE.YRKE_PÅ_ETTER91;      00009520
                   DATA.YRKE_PÅ_42 = W02_AKT_HENDELSE.YRKE_PÅ_ETTER91;  00009530
                                                                        00009540
                   IF W02_AKT_HENDELSE.ÅFT > 0            THEN          00009550
                      DO;                                               00009560
                         DATA.HAR_ÅTTE_FEM_TILLEGG = 'J';               00009570
                         DATA.ÅTTE_FEM_TILLEGG = W02_AKT_HENDELSE.ÅFT;  00009580
                      END;                                              00009590
 /*EØS*/           ELSE                                                 00009600
                   IF W02_AKT_HENDELSE.PRO_RATA_BEREGNING = 'J' THEN    00009610
                         DATA.HAR_ÅTTE_FEM_TILLEGG = 'E';               00009620
                                                                        00009630
                   IF W02_AKT_HENDELSE.PENSJONSTYPE2 = 'E' THEN         00009640
                      DO;                                               00009650
                                                                        00009660
 /*21.9.90 HL */                                                        00009670
                         DATA.SLUTTP_ETTER_AVDØD =                      00009680
                                         W02_AKT_HENDELSE.SPT_EK * 100; 00009690
                         DATA.SLUTTP_MED_OVER_ETTER_AVD =               00009700
                                         W02_AKT_HENDELSE.OPT_EK * 100; 00009710
                         DATA.POENGÅR_ETTER_AVDØD_45  =                 00009720
                                         W02_AKT_HENDELSE.PÅ_EK;        00009730
                         DATA.POENGÅR_ETTER_AVDØD_42  =                 00009740
                              W02_AKT_HENDELSE.PÅ_ETTER91_EK;           00009750
                                                                        00009760
                     /*  DATA.TILLEGGSPENSJON_AVDØD =              */   00009770
                     /*  FINNES IKKE I STØNADSBREVBASEN, TP HER ER */   00009780
                     /*  EGEN TP OG AVD. TP SAMMENLAGT             */   00009790
                                                                        00009800
                         IF W02_AKT_HENDELSE.PÅ_EK > 0 THEN             00009810
                            DATA.PROS_AV_AVDØD_TILLEGSP =               00009820
                                        W02_AKT_HENDELSE.TP_PROSENT;    00009830
                      END;                                              00009840
                                                                        00009850
                   ELSE                                                 00009860
                      DATA.EKTEFELLETILLEGG   = W02_AKT_HENDELSE.ET;    00009870
                                                                        00009880
                   DATA.ARBEIDSINNTEKT =                                00009890
                           W02_AKT_HENDELSE.FORVENTET_INNTEKT * 100;    00009900
                END;                                                    00009910
                                                                        00009920
                                                                        00009930
                                                                        00009940
             OTHERWISE;                                                 00009950
                                                                        00009960
          END; /* SELECT */                                             00009970
                                                                        00009980
  IF W02_AKT_HENDELSE.ARBEIDSINNTEKT > 0        THEN                    00009990
     DATA.ARBEIDSINNTEKT   = W02_AKT_HENDELSE.ARBEIDSINNTEKT * 100;     00010000
                                                                        00010010
          IF W02_AKT_HENDELSE.PENSJONSTYPE1  = 'A' !                    00010020
             W02_AKT_HENDELSE.PENSJONSTYPE1  = 'K' THEN                 00010030
            DO;                                                         00010040
             DATA.SUM_YTELSE   =  W02_AKT_HENDELSE.AP_GP_NETTO          00010050
                               +  W02_AKT_HENDELSE.AP_TP_NETTO;         00010060
             W02_AKT_HENDELSE.GP_NETTO = 0;                             00010070
            END;                                                        00010080
                                                                        00010090
            /*YRKE-DELEN VAR IKKE MED I SUM YTELSE. TRUDE 150992*/      00010100
          DATA.SUM_YTELSE   =  DATA.SUM_YTELSE              +           00010110
                               W02_AKT_HENDELSE.GP_NETTO    +           00010120
                               W02_AKT_HENDELSE.YRKE_GP     +   /*0992*/00010130
                               W02_AKT_HENDELSE.TP_NETTO    +           00010140
                               W02_AKT_HENDELSE.YRKE_TP     +   /*0992*/00010150
                               W02_AKT_HENDELSE.ST          +           00010160
                               W02_AKT_HENDELSE.BT          +           00010170
                               W02_AKT_HENDELSE.ET          +           00010180
                               W02_AKT_HENDELSE.KT          +           00010190
                               W02_AKT_HENDELSE.VT_GP       +           00010200
                               W02_AKT_HENDELSE.VT_TP       +           00010210
                               W02_AKT_HENDELSE.BT_SÆRBARN  +           00010220
                  W02_AKT_HENDELSE.GARANTITILLEGG_SÆRBARN   +           00010230
                  W02_AKT_HENDELSE.GARANTITILLEGG_EK        +           00010240
                  W02_AKT_HENDELSE.GARANTITILLEGG_BARN      +           00010250
                               W02_AKT_HENDELSE. GARANTITILLEGG_TP +    00010260
                               W02_AKT_HENDELSE.GT_TILLEGG_LOV92   +    00010270
 /*1092*/                      W02_AKT_HENDELSE.AFP_TILLEGG        +    00010280
                               W02_AKT_HENDELSE.ÅFT           ;         00010290
                                                                        00010300
                                                                        00010310
          IF W02_AKT_HENDELSE.FNR_EKTEF > 0         &                   00010320
             W02_AKT_HENDELSE.PENSJONSTYPE2 ^= 'Ø'  THEN                00010330
             DO;                                                        00010340
                                                                        00010350
                W01_FNR_PIC      = W02_AKT_HENDELSE.FNR_EKTEF;          00010360
                DATA.FNR_TAB(1)  = W01_FNR_PIC;                         00010370
                DATA.KODE   (1)  = W02_AKT_HENDELSE.PENSJONSTYPE1_EK;   00010380
                DATA.FT_FØR_0591(1)= W02_AKT_HENDELSE.ET_FØR_0591;      00010390
                IF W02_AKT_HENDELSE.PENSJONSTYPE2_EK = 'M'    THEN      00010400
                   DATA.EK_INNT_OVER_4G = 'J';                          00010410
                ELSE                                                    00010420
                   IF W02_AKT_HENDELSE.PENSJONSTYPE2_EK = 'U' THEN      00010430
                      DATA.EK_INNT_OVER_4G = 'N';                       00010440
                                                                        00010450
             END;                                                       00010460
                                                                        00010470
          /* ******************************************************** */00010480
          /* INDEKSER SETTES FOR Å KUNNE BEGYNNE PÅ FØRSTE LEDIGE     */00010490
          /* PLASS I FØDSELSNUMMER-TABELLEN. (TLF O. LIESTØL 21.4.87) */00010500
          /* ******************************************************** */00010510
                                                                        00010520
          IF DATA.FNR_TAB(1)  ^= (11)' '    THEN                        00010530
             J = 2;                                                     00010540
          ELSE                                                          00010550
             J = 1;                                                     00010560
                                                                        00010570
          DATA.ANTALL_I_TAB =  DATA.ANT_BARN + J - 1;                   00010580
                                                                        00010590
          IF ^((W02_AKT_HENDELSE.PENSJONSTYPE1 = 'B' !                  00010600
                W02_AKT_HENDELSE.PENSJONSTYPE1 = 'N'  )  &              00010610
                W02_AKT_HENDELSE.PENSJONSTYPE2 = 'P'       )  THEN      00010620
                                                                        00010630
                                                                        00010640
             DO I = J TO 5 WHILE (W02_AKT_HENDELSE.FNR_B(I-(J-1)) > 0); 00010650
                W01_FNR_PIC  = W02_AKT_HENDELSE.FNR_B(I-(J-1)) ;        00010660
                DATA.FNR_TAB(I) = W01_FNR_PIC;                          00010670
                DATA.KODE (I) =                                         00010680
                              W02_AKT_HENDELSE.PENSJONSTYPE2_B(I-(J-1));00010690
                IF DATA.KODE (I) = ' '             THEN                 00010700
                   DATA.KODE (I) = 'L';                                 00010710
                DATA.FT_FØR_0591 (I) =                                  00010720
                              W02_AKT_HENDELSE.BT_FØR_0591(I-(J-1));    00010730
             END;                                                       00010740
 /* ************************************************************** */   00010750
 /*     AFP                                                        */   00010760
 /* SKRIVES IKKE RECORD HVIS PENSJONSTYPE1 = 'K' OG                */   00010770
 /*                          PENSJONSTYPE2 = 'N'                   */   00010780
 /* ************************************************************** */   00010790
  IF (W02_AKT_HENDELSE.PENSJONSTYPE1 = 'K'  &                           00010800
      W02_AKT_HENDELSE.PENSJONSTYPE2 = 'N' )   !                        00010810
      W02_AKT_HENDELSE.PENSJONSTYPE2 = 'A'   THEN                       00010820
     DO;                                                                00010830
     END;                                                               00010840
  ELSE                                                                  00010850
     DO;                                                                00010860
       WRITE FILE (NORFILE) FROM (NOR_RECORD);                          00010870
       TELLER_NORREC = TELLER_NORREC + 1;                               00010880
 /*TILLEGG 19.4.95 HL :            */                                   00010890
                                                                        00010900
          IF ^((W02_AKT_HENDELSE.PENSJONSTYPE1 = 'B' !                  00010910
                W02_AKT_HENDELSE.PENSJONSTYPE1 = 'N'  )  &              00010920
                W02_AKT_HENDELSE.PENSJONSTYPE2 = 'P'       )  THEN      00010930
 /*HIT 19.4.95 HL*/                                                     00010940
                                                                        00010950
       IF W02_AKT_HENDELSE.FNR_B(6-(J-1)) > 0       THEN                00010960
          DO;                                                           00010970
            DATATYPE = 02;                                              00010980
            SKAL_BLANKES = '';                                          00010990
            DO K = 1 TO 8;                                              00011000
               DATA2.FNR_KODE (K) = '';                                 00011010
            END;                                                        00011020
            DO I = 6 TO 13 WHILE (W02_AKT_HENDELSE.FNR_B(I-(J-1)) > 0); 00011030
                W01_FNR_PIC  = W02_AKT_HENDELSE.FNR_B(I-(J-1)) ;        00011040
                DATA2.FNR_TAB(I-5) = W01_FNR_PIC;                       00011050
                DATA2.KODE (I-5) =                                      00011060
                              W02_AKT_HENDELSE.PENSJONSTYPE2_B(I-(J-1));00011070
                IF DATA2.KODE (I-5) = ' '        THEN                   00011080
                   DATA2.KODE (I-5) = 'L';                              00011090
                DATA2.FT_FØR_0591 (I-5) =                               00011100
                          W02_AKT_HENDELSE.BT_FØR_0591(I-(J-1));        00011110
            END;                                                        00011120
            WRITE FILE (NORFILE) FROM (NOR_RECORD);                     00011130
            TELLER_NORREC = TELLER_NORREC + 1;                          00011140
            DATATYPE = 01;                                              00011150
          END;                                                          00011160
     END;                                                               00011170
                                                                        00011180
                                                                        00011190
                                                                        00011200
     END P020_LAG_RECORD;                                               00011210
                                                                        00011220
 %PAGE;                                                                 00011230
 /*------------------------------------------------------------------*/ 00011240
 /* LESER NESTE ROT I STØNADSBREVBASEN                               */ 00011250
 /*------------------------------------------------------------------*/ 00011260
 P030_LES_NESTE_ROT: PROCEDURE;                                         00011270
                                                                        00011280
                                                                        00011290
          CALL     PLIHSSR       (PARM_CT_4,                            00011300
                                  GET,                                  00011310
                                  PCB_SB1,                              00011320
                                  W01_IO,                               00011330
                                  SSA_UQUAL);                           00011340
                                                                        00011350
          SELECT (PCB_SB1.STATUS_KODE);                                 00011360
                                                                        00011370
             WHEN ('  ','GK','GA');                                     00011380
                                                                        00011390
             WHEN ('GB','GE')                                           00011400
                MER_DATA = '0'B;                                        00011410
                                                                        00011420
             OTHERWISE                                                  00011430
                DO;                                                     00011440
                   PUT FILE (SYSPRINT) EDIT ('PROGRAMMET AVBRYTES!')    00011450
                                            (SKIP(2),COL(4),A);         00011460
                   PUT FILE (SYSPRINT) EDIT ('UAKSEPTABEL KODE FRA ',   00011470
                                             'DL1.','STATUSKODE = ',    00011480
                                              PCB_SB1.STATUS_KODE)      00011490
                                            (SKIP,COL(4),A,A,COL(31),   00011500
                                             A,A);                      00011510
                   MER_DATA = '0'B;                                     00011520
                   RETCODE = 100;                                       00011530
                END;                                                    00011540
          END;                                                          00011550
                                                                        00011560
     END P030_LES_NESTE_ROT;                                            00011570
                                                                        00011580
                                                                        00011590
                                                                        00011600
 %PAGE;                                                                 00011610
 /*------------------------------------------------------------------*/ 00011620
 /* LESER NESTE SEGMENT I STØNADSBREVBASEN                           */ 00011630
 /*------------------------------------------------------------------*/ 00011640
 P040_LES: PROCEDURE;                                                   00011650
                                                                        00011660
                                                                        00011670
          CALL     PLIHSSR       (PARM_CT_3,                            00011680
                                  GET,                                  00011690
                                  PCB_SB1,                              00011700
                                  W01_IO);                              00011710
                                                                        00011720
          SELECT (PCB_SB1.STATUS_KODE);                                 00011730
                                                                        00011740
             WHEN ('  ','GK','GA');                                     00011750
                                                                        00011760
             WHEN ('GB','GE')                                           00011770
                MER_DATA = '0'B;                                        00011780
                                                                        00011790
             OTHERWISE                                                  00011800
                DO;                                                     00011810
                   PUT FILE (SYSPRINT) EDIT ('PROGRAMMET AVBRYTES!')    00011820
                                            (SKIP(2),COL(4),A);         00011830
                   PUT FILE (SYSPRINT) EDIT ('UAKSEPTABEL KODE FRA ',   00011840
                                             'DL1.','STATUSKODE = ',    00011850
                                              PCB_SB1.STATUS_KODE)      00011860
                                            (SKIP,COL(4),A,A,COL(31),   00011870
                                             A,A);                      00011880
                   MER_DATA = '0'B;                                     00011890
                   RETCODE = 100;                                       00011900
                END;                                                    00011910
          END;                                                          00011920
                                                                        00011930
     END P040_LES;                                                      00011940
                                                                        00011950
 /****************************************************************/     00011960
 /*                                                              */     00011970
 /*    EKSTERNE PROSEDYRER                                       */     00011980
 /*                                                              */     00011990
 /****************************************************************/     00012000
                                                                        00012010
 %PAGE;                                                                 00012020
    %INCLUDE R0019910;            /* F_NUMERISK                  */     00012030
                                                                        00012040
                                                                        00012050
 END R001NO2;                                                           00012060
