 /*       SIST ENDRET 19/12-85 09.15.31 AV   ANNE                     */00000000
 /*       SIST ENDRET 04/11-85 09.39.14 AV   ANNE                     */00000010
 /*       SIST ENDRET 27/03-85 09.27.31 AV   HERMAN                   */00000020
 /*       SIST ENDRET 05/10-84 14.04.07 AV   FARVIK                   */00000030
 /*       SIST ENDRET 17/09-84 11.29.23 AV   FARVIK                   */00000040
 /*       SIST ENDRET 12/09-84 08.06.42 AV   FARVIK                   */00000050
 %SKIP;                                /*  */                           00000060
 /* ***************************************************************** */00000070
 /*                                                                   */00000080
 /* ***************************************************************** */00000090
 /*IDENTIFIKASJON:                                                    */00000100
 /* **********************                                            */00000110
 /*  PROGRAM-IDENT : R0011304     VELG MENY_TG     HOVEDPROG          */00000120
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000130
 /*  PROGRAMMERER  :                                                  */00000140
 /*  PROGRAMMET BLE LAGET :                                           */00000150
 /*  ENDRINGSDATO         :                                           */00000160
 /*  ENDRINGEN GJELDER    :                                           */00000170
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000180
 /*                                                                   */00000190
 /* ***************************************************************** */00000200
 /*HENSIKT:                                                           */00000210
 /* **********                                                        */00000220
 /*                                                                   */00000230
 /*  KONTROLLEN GIS FRA    REGISTRERINGSRUTINEN -R0010401- VED        */00000240
 /*  HJELP AV TRANSKODE R130.                                         */00000250
 /*  PROGRAMMET TAR IMOT OPPLYSNINGER FRA MENYEN FOR TILLEGGSBLANKETT */00000260
 /*  OG SENDER UT DET ØNSKEDE BILDE FOR REGISTRERING AV TG-BLANKETTEN.*/00000270
 /*  DERETTER BLIR KONTROLLEN OVERLATT TIL R0011301, SOM              */00000280
 /*  LESER AKTUELT BILDE OG KONTROLLERER OPPLYSNINGENE.               */00000290
 /*                                                                   */00000300
 /* ***************************************************************** */00000310
 /*PROGRAMTILKNYTTING:                                                */00000320
 /* ********************                                              */00000330
 /*  PROGRAMMETS TRANSKODE ER 'R130'                                  */00000340
 /*  PROGRAMMET FÅR KONTROLL VIA CICS/TRANSKODE FRA R0010401          */00000350
 /*  PROGRAMMET HAR EXEC      XCTL TIL                                */00000360
 /*                              R0010301 - VELG FUNKSJON             */00000370
 /*                              R0010401 - REGISTRERING              */00000380
 /*  PROGRAMMET GIR KONTROLL VIA CICS/TRANSKODE TIL R0011301          */00000390
 /*                                                                   */00000400
 /* ***************************************************************** */00000410
 /*FEILMELDINGER:                                                     */00000420
 /* *******************                                               */00000430
 /* GIR MELDING PÅ BILDE S001131 :                                    */00000440
 /*           'F E I L  H A R  O P P S T Å T T ! ! !.' !!             */00000450
 /*           'TRYKK "ENTER" OG PRØV PÅ NYTT.';                       */00000460
 /*  GIR MELDING VED FEIL KODE :                                      */00000470
 /*           S001131O.MELDINGO = 'UGYLDIG TILLEGGSKODE';             */00000480
 /*           EXEC CICS SEND MAP('S001131') MAPSET('S001133')         */00000490
 /*                                                                   */00000500
 /* ***************************************************************** */00000510
 R00113:                                                                00000520
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000530
 %PAGE;                                                                 00000540
      %INCLUDE S00113;     /*  TILLEGG TIL GRUNNBLANKETT MAPSETTET  */  00000550
 %PAGE;                                                                 00000560
      %INCLUDE P0019906;   /*  TRANS_OPPLYSNINGS_OMRÅDE (BASED)     */  00000570
 %PAGE;                                                                 00000580
      %INCLUDE P0019908;   /*  KOMMUNIKASJONSOMRÅDE (BASED)         */  00000590
 %PAGE;                                                                 00000600
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED)              */  00000610
 %PAGE;                                                                 00000620
      %INCLUDE P0019912;   /*  DIV_PARAM_OMR   (BASED)              */  00000630
 %PAGE;                                                                 00000640
   DCL                                                                  00000650
      (COMMAREA_PEKER,                                                  00000660
      BMSMAPBR) PTR;                                                    00000670
   DCL                                                                  00000680
      (ADDR,UNSPEC,CSTG) BUILTIN;                                       00000690
   DCL                                                                  00000700
      TG_KODE CHAR(2);                                                  00000710
   DCL                                                                  00000720
      FEIL_FUNNET  BIT (1),                                             00000730
      ONKODE PIC'9999',                                                 00000740
      CURSOR_POS FIXED BIN(15) INIT(-1),                                00000750
      ONK DEF ONKODE CHAR(4),                                           00000760
      FEILKODE       CHAR(4),                                           00000770
      DSNAVN         CHAR(8),                                           00000780
      ANT_FEIL_SKREVET FIXED DEC (3);                                   00000790
 %PAGE;                                                                 00000800
 %PAGE;                                                                 00000810
      ON ERROR SNAP BEGIN       ;                                       00000820
         ON ERROR SYSTEM        ;                                       00000830
         ONKODE=ONCODE          ;                                       00000840
         FEILKODE = ONK         ;                                       00000850
         DSNAVN   = EIBDS       ;                                       00000860
         GO TO FEILBEH          ;                                       00000870
      END;                                                              00000880
                                                                        00000890
 FEILKODE   = 'FEIL'    ;                                               00000900
 DSNAVN     = '        ';                                               00000910
                                                                        00000920
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00000930
                                                                        00000940
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000950
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000960
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000970
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_PEKER);  00000980
                                                                        00000990
      EXEC CICS RECEIVE MAP('S001131') MAPSET ('S001133') SET(BMSMAPBR);00001000
                                                                        00001010
      IF S001131I.FUNKSJONSKODEL > 0 THEN                               00001020
        DO;                                                             00001030
            FUNKSJONSKODE = S001131I.FUNKSJONSKODEI;                    00001040
            EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);       00001050
         END;                                                           00001060
                                                                        00001070
      IF S001131I.STYRE_KODEL > 0 THEN                                  00001080
         STYREKODE = S001131I.STYRE_KODEI;                              00001090
                                                                        00001100
      IF STYREKODE ^= 'TG' THEN                                         00001110
        TRANSKODE = 'R041';                                             00001120
      ELSE                                                              00001130
        DO;                                                             00001140
          TG_KODE = S001131I.TG_KODEI;                                  00001150
            SELECT(TG_KODE);                                            00001160
               WHEN('UP')                                               00001170
                  DO;                                                   00001180
                     EXEC CICS SEND MAP('S001132') MAPSET('S001133')    00001190
                     MAPONLY ERASE;                                     00001200
                     TRANSKODE = 'R131';                                00001210
                  END;                                                  00001220
               WHEN('EP')                                               00001230
                  DO;                                                   00001240
                     EXEC CICS SEND MAP('S001133') MAPSET('S001133')    00001250
                     MAPONLY ERASE;                                     00001260
                     TRANSKODE = 'R132';                                00001270
                  END;                                                  00001280
               WHEN('FB')                                               00001290
                  DO;                                                   00001300
                     EXEC CICS SEND MAP('S001134') MAPSET('S001133')    00001310
                     MAPONLY ERASE;                                     00001320
                     TRANSKODE = 'R133';                                00001330
                  END;                                                  00001340
                                                                        00001350
  /* TILLEGG 27.3.85  HL :                                         */   00001360
                                                                        00001370
               WHEN('AI')                                               00001380
                  DO;                                                   00001390
                     EXEC CICS SEND MAP('S001135') MAPSET('S001133')    00001400
                     MAPONLY ERASE;                                     00001410
                     TRANSKODE = 'R137';                                00001420
                  END;                                                  00001430
                                                                        00001440
  /* HIT 27.3.85  HL                                              */    00001450
                                                                        00001460
               OTHERWISE                                                00001470
                  DO;                                                   00001480
                     S001131O.MELDINGO = 'UGYLDIG TILLEGGSKODE';        00001490
                     EXEC CICS SEND MAP('S001131') MAPSET('S001133')    00001500
                     ERASE;                                             00001510
                     TRANSKODE = 'R130';                                00001520
                  END;                                                  00001530
            END;                                                        00001540
                                                                        00001550
          EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);        00001560
                                                                        00001570
        END;                                                            00001580
                                                                        00001590
      EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);             00001600
                                                                        00001610
  FEILBEH:                                                              00001620
                                                                        00001630
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00001640
     PROGRAM_ID = 'R0011304';                                           00001650
                                                                        00001660
     S001131O.MELDINGO =                                                00001670
              'F E I L  H A R  O P P S T Å T T ! ! !.' !!               00001680
              'TRYKK "ENTER" OG PRØV PÅ NYTT.';                         00001690
                                                                        00001700
                                                                        00001710
     EXEC CICS SEND MAP('S001131')                                      00001720
                                                 MAPSET('S001133');     00001730
                                                                        00001740
     EXEC CICS RECEIVE MAP('S001131')                                   00001750
                                    MAPSET('S001133') SET(BMSMAPBR);    00001760
                                                                        00001770
                                                                        00001780
     EXEC CICS SYNCPOINT ROLLBACK;                                      00001790
                                                                        00001800
                                                                        00001810
     TERMINERINGS_IND = 'F';                                            00001820
                                                                        00001830
     TRANSKODE  = 'R041';                                               00001840
                                                                        00001850
     EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);              00001860
                                                                        00001870
  ABEND:                                                                00001880
     EXEC CICS ABEND ABCODE(FEIL);                                      00001890
                                                                        00001900
                                                                        00001910
   END R00113;                                                          00001920
