 /*       SIST ENDRET 08/09-87 12.06.51 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 07/03-86 10.26.35 AV   ANNE                     */00000010
 /*       SIST ENDRET 08/09-83 10.53.55 AV   JANKR                    */00000020
 /* ***************************************************************** */00000030
 /* IDENTIFIKASJON                                                    */00000040
 /*     R0010425 - PROGRAM SOM FORETAR  OPPDATERING AV FEILMELDINGS - */00000050
 /*                TABELLEN UNDER ADMINISTRASJONSDELEN AV SYSTEMET.   */00000060
 /*                HOVEDPROGRAM I CICS/PLI.                           */00000070
 /*     PROGRAMMERER: JAN - H. KRISTENSEN SEPTEMBER 1983.             */00000080
 /* HENSIKT                                                           */00000090
 /*     PROGRAMMET SKAL SENDE UT EN MAP FØRST FOR AT EN SKAL KUNNE    */00000100
 /*     VELGE KODE FOR DET EN ØNSKER UTFØRT.                          */00000110
 /*     DERETTER SKAL DENNE MAPPEN RECEIVES SLIK AT DETTE PROGRAMMET  */00000120
 /*     KAN GI KONTROLL TIL DEN AKTUELLE PROGRAMDELEN SOM UTFØRER     */00000130
 /*     AKSJONEN.                                                     */00000140
 /* PROGRAMTILKNYTNING                                                */00000150
 /*     BLIR GITT KONTROLL FRA PROGRAM R0010420 SOM ER STYREPROGRAM   */00000160
 /*     UNDER ADMINISTRASJONSDELEN.                                   */00000170
 /*                                                                   */00000180
 /* ***************************************************************** */00000190
                                                                        00000200
 R001B1: PROC(COMMAREA_PEKER)                  OPTIONS (MAIN);          00000210
                                                                        00000220
    %INCLUDE P0019908;            /* KOM_OMR                          */00000230
    %INCLUDE P0019912;            /* DIV_PARAM_OMR                    */00000240
    %INCLUDE P0019910;            /* STYRINGS_OMR                     */00000250
    %INCLUDE P0019906;            /* TRANS_OPPL_OMR                   */00000260
    %INCLUDE S001A5;              /* MAP TIL FEILMELDINGER FOR        */00000270
                                  /* ADMINISTRASJONSDELEN.            */00000280
    %INCLUDE DFHBMSCA;            /* HJELPE STRUKTUR FOR ATTRIBUTTER  */00000290
                                                                        00000300
     DCL    W01_IO                 CHAR (81);                           00000310
                                                                        00000320
    DCL                                                                 00000330
      1 ADM_OMR                  BASED(B01_PEKER), /* DETTE SIDEN B01 */00000340
        2 FORRIGE_AKSJON         CHAR(2),          /* IKKE BRUKES HER */00000350
                                                                        00000360
      1 FEIL_REC                 BASED(FEIL_PEKER),                     00000370
        2 FEILNR                 CHAR(4),                               00000380
        2 BLANK                  CHAR(1),                               00000390
        2 TEKST                  CHAR(73),                              00000400
      W01_NR                     PIC '9999',                            00000410
      CSTG                       BUILTIN,                               00000420
      ADDR                       BUILTIN,                               00000430
      UNSPEC                     BUILTIN,                               00000440
      LENGTH                     BUILTIN,                               00000450
      W01_IO_PEKER               POINTER,                               00000460
      BMSMAPBR                   POINTER,                               00000470
      COMMAREA_PEKER             POINTER,                               00000480
      FEIL_PEKER                 POINTER;                               00000490
                                                                        00000500
                                                                        00000510
    KOM_OMR.STYRINGS_PEKER  = ADDR(KOM_OMR.STYRINGS_OMR);               00000520
    KOM_OMR.TRANS_OPPL_PEKER= ADDR(KOM_OMR.TRANS_OPPL_OMR);             00000530
    KOM_OMR.DIV_PARAM_PEKER = ADDR(KOM_OMR.DIV_PARAM_OMR);              00000540
    W01_IO_PEKER            = ADDR(W01_IO);                             00000550
    TRANSKODE               = 'RA25';        /* DETTE PROGRAM  */       00000560
                                                                        00000570
                                                                        00000580
    IF PROGRAM_ID = 'R0010420' THEN         /* KOMMER IN FØRSTE GANG */ 00000590
                                                                        00000600
       DO;                                                              00000610
          EXEC CICS SEND MAP('S001A5') MAPSET('S001A53') MAPONLY ERASE; 00000620
                                                                        00000630
       END;                                                             00000640
                                                                        00000650
                                                                        00000660
    ELSE IF PROGRAM_ID = 'R0010425' THEN       /*   DETTE PROGRAM   */  00000670
                                                                        00000680
       DO;                                                              00000690
          EXEC CICS RECEIVE MAP('S001A5')MAPSET('S001A53')              00000700
                                         SET  (BMSMAPBR);               00000710
          S001A5O.MELDINGO  = ' ';                                      00000720
          W01_NR       =  S001A5O.FEILMELD_NRO;                         00000730
                                                                        00000740
                                                                        00000750
 /* ENDRET 18.02.86   AL                                       */       00000760
                                                                        00000770
          IF S001A5I.FUNKSJONSKODEL > 0 &                               00000780
             VERIFY(S001A5I.FUNKSJONSKODEI,'RVEFIAX') = 0 THEN          00000790
                                                                        00000800
 /* HIT    18.02.86   AL                                       */       00000810
                                                                        00000820
             DO;                                                        00000830
                FUNKSJONSKODE = S001A5I.FUNKSJONSKODEI;                 00000840
                EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR); 00000850
             END;                                                       00000860
                                                                        00000870
          IF S001A5I.STYRE_KODEL > 0 &                                  00000880
             S001A5I.STYRE_KODEI ^= 'FB' THEN                           00000890
             DO;                                                        00000900
                STYREKODE  = S001A5I.STYRE_KODEI;                       00000910
                EXEC CICS XCTL PROGRAM ('R0010420') COMMAREA (KOM_OMR); 00000920
             END;                                                       00000930
                                                                        00000940
          SELECT(S001A5I.AKSJONI);                                      00000950
             WHEN('VM')                                                 00000960
                DO;                                                     00000970
                   CALL BLANK_TEKST;                                    00000980
                   CALL TEKST_PROT;                                     00000990
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VM);        00001000
                   EXEC CICS READ DATASET ('FEILTAB') RIDFLD(W01_NR)    00001010
                                                    SET(FEIL_PEKER);    00001020
                   CALL OVERFØR_TIL_MAP;                                00001030
                   FORRIGE_AKSJON = 'VM';                               00001040
                                                                        00001050
                END;                                                    00001060
             WHEN('VN')                                                 00001070
                DO;                                                     00001080
                   CALL BLANK_TEKST;                                    00001090
                   CALL TEKST_PROT;                                     00001100
                   S001A5O.FEILMELD_NRO = S001A5O.FEILMELD_NRO + 1;     00001110
                   W01_NR               = S001A5O.FEILMELD_NRO;         00001120
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VN);        00001130
                   EXEC CICS READ DATASET ('FEILTAB') RIDFLD(W01_NR)    00001140
                                            GTEQ    SET(FEIL_PEKER);    00001150
                                                                        00001160
                   CALL OVERFØR_TIL_MAP;                                00001170
                                                                        00001180
                   FORRIGE_AKSJON = 'VN';                               00001190
                                                                        00001200
                END;                                                    00001210
             WHEN('VF')                                                 00001220
                DO;                                                     00001230
                   CALL BLANK_TEKST;                                    00001240
                   CALL TEKST_PROT;                                     00001250
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VM);        00001260
                   EXEC CICS STARTBR DATASET ('FEILTAB') EQUAL          00001270
                                        RIDFLD(W01_NR);                 00001280
                   EXEC CICS HANDLE CONDITION ENDFILE(NOTFND_VN);       00001290
                   EXEC CICS READPREV DATASET ('FEILTAB')RIDFLD(W01_NR) 00001300
                                                    SET(FEIL_PEKER);    00001310
                   EXEC CICS READPREV DATASET ('FEILTAB')RIDFLD(W01_NR) 00001320
                                                    SET(FEIL_PEKER);    00001330
                                                                        00001340
                   CALL OVERFØR_TIL_MAP;                                00001350
                                                                        00001360
                   FORRIGE_AKSJON = 'VF';                               00001370
                                                                        00001380
                END;                                                    00001390
           /*WHEN('RF')                                                 00001400
                DO;                                                     00001410
                   CALL BLANK_TEKST;                                    00001420
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_RT);        00001430
                   EXEC CICS READ DATASET ('FEILTAB') RIDFLD(W01_NR)    00001440
                                                    SET(FEIL_PEKER);    00001450
                   CALL TEKST_PROT;                                     00001460
                                                                        00001470
                   S001A5O.MELDINGO =                                   00001480
                       'DETTE FEILMELDINGSNUMMER FINNES FRA FØR';       00001490
                                                                        00001500
                   FORRIGE_AKSJON = 'RF';                               00001510
                   CALL TEKST_UNP;                                      00001520
                                                                        00001530
                                                                        00001540
                END; */                                                 00001550
         /*  WHEN('EF')                                                 00001560
                DO;                                                     00001570
                   CALL BLANK_TEKST;                                    00001580
                   CALL TEKST_PROT;                                     00001590
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VT);        00001600
                   EXEC CICS READ DATASET ('FEILTAB') RIDFLD(W01_NR)    00001610
                                                    SET(FEIL_PEKER);    00001620
                   CALL TEKST_UNP;                                      00001630
                   CALL OVERFØR_TIL_MAP;                                00001640
                   FORRIGE_AKSJON = 'ET';                               00001650
                                                                        00001660
                END;                                                    00001670
             WHEN('SF')                                                 00001680
                DO;                                                     00001690
                                                                        00001700
                   SELECT (FORRIGE_AKSJON);                             00001710
                      WHEN('RF')                                        00001720
                         DO;                                            00001730
                            CALL OVERFØR_FRA_MAP;                       00001740
                            CALL KONTROLL_AV_INPUT;                     00001750
                            EXEC CICS WRITE DATASET ('FEILTAB')         00001760
                                FROM (FEIL_REC)  RIDFLD(W01_NR);        00001770
                            S001A2O.MELDINGO =                          00001780
                            'TEKSTEN TIL DETTE TRYGDEKONTOR ER NÅ'      00001790
                            !! ' SKREVET TIL SYSTEMET';                 00001800
                         END;                                           00001810
                      WHEN('EF')                                        00001820
                         DO;                                            00001830
                            EXEC CICS READ DATASET ('FEILTAB') UPDATE   00001840
                                 RIDFLD(W01_NR) SET(FEIL_PEKER);        00001850
                            CALL OVERFØR_FRA_MAP;                       00001860
                            CALL KONTROLL_AV_INPUT;                     00001870
                            EXEC CICS REWRITE DATASET ('FEILTAB')       00001880
                                                  FROM (FEIL_REC);      00001890
                            S001A5O.MELDINGO =                          00001900
                            'TEKSTEN TIL DENNE FEILMELDING ER'          00001910
                            !! ' NÅ ENDRET';                            00001920
                         END;                                           00001930
                      OTHERWISE                                         00001940
                         DO;                                            00001950
                            S001A5O.MELDINGO =                          00001960
                            'GAL KODE FØR SF, BARE RT ELLER EF TILLATT';00001970
                         END;                                           00001980
                                                                        00001990
                   END;                                                 00002000
                                                                        00002010
                   CALL TEKST_PROT;                                     00002020
                   FORRIGE_AKSJON = 'SF';                               00002030
                END;                                                    00002040
             WHEN('FF')                                                 00002050
                DO;                                                     00002060
                   CALL BLANK_TEKST;                                    00002070
                   CALL TEKST_PROT;                                     00002080
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VF);        00002090
                   EXEC CICS READ DATASET ('FEILTAB') RIDFLD(W01_NR)    00002100
                                                      SET(FEIL_PEKER);  00002110
                   EXEC CICS DELETE DATASET ('FEILTAB') RIDFLD(W01_NR); 00002120
                   S001A5O.MELDINGO = 'DENNE FEILMELDINGEN ER FJERNET'; 00002130
                   CALL OVERFØR_TIL_MAP;                                00002140
                   FORRIGE_AKSJON = 'FF';                               00002150
                                                                        00002160
                END; */                                                 00002170
             WHEN('XX')                                                 00002180
                DO;                                                     00002190
                   PROGRAM_ID = 'R0010301';    /* LITT JUKS !!!!     */ 00002200
                   EXEC CICS XCTL PROGRAM ('R0010420')                  00002210
                                  COMMAREA (KOM_OMR);                   00002220
                END;                                                    00002230
             OTHERWISE                                                  00002240
                DO;                                                     00002250
                   S001A5O.MELDINGO = 'UGYLDIG KODE';                   00002260
                   CALL TEKST_PROT;                                     00002270
                   S001A5I.AKSJONL      = -1;     /* CURSOR */          00002280
                   S001A5I.FEILMELD_NRL = 0;                            00002290
                END;                                                    00002300
                                                                        00002310
                                                                        00002320
          END;      /* SELECT  */                                       00002330
                                                                        00002340
          CALL SEND_MAP;                                                00002350
                                                                        00002360
                                                                        00002370
       END;                                                             00002380
                                                                        00002390
                                                                        00002400
  UT:                                                                   00002410
    PROGRAM_ID = 'R0010425';                                            00002420
    EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);              00002430
                                                                        00002440
                                                                        00002450
                                                                        00002460
                                                                        00002470
  NOTFND_VM:                                                            00002480
    S001A5O.MELDINGO =                                                  00002490
           'FEILMELDINGSNUMMERET FINNES IKKE I SYSTEMET';               00002500
    CALL SEND_MAP;                                                      00002510
    GOTO UT;                                                            00002520
                                                                        00002530
  NOTFND_VN:                                                            00002540
    S001A5O.MELDINGO =                                                  00002550
           'INGEN FLERE FEILMELDINGER I DENNE RETNING';                 00002560
    CALL SEND_MAP;                                                      00002570
    GOTO UT;                                                            00002580
                                                                        00002590
                                                                        00002600
  NOTFND_RS:                                                            00002610
    CALL TEKST_UNP;                                                     00002620
    FORRIGE_AKSJON = 'RS';                                              00002630
    CALL SEND_MAP;                                                      00002640
    GOTO UT;                                                            00002650
                                                                        00002660
                                                                        00002670
  SEND_MAP: PROC;                                                       00002680
     EXEC CICS SEND MAP ('S001A5') MAPSET ('S001A53')                   00002690
                                 CURSOR     DATAONLY ;                  00002700
  END SEND_MAP;                                                         00002710
                                                                        00002720
                                                                        00002730
  BLANK_TEKST: PROC;                                                    00002740
     S001A5O.FEILTEKSTO     = ' ';                                      00002750
  END BLANK_TEKST;                                                      00002760
                                                                        00002770
                                                                        00002780
  TEKST_UNP: PROC;                                                      00002790
     S001A5I.FEILTEKSTL     = -1;   /* CURSOR   */                      00002800
     S001A5I.FEILMELD_NRL   = 0;                                        00002810
     S001A5O.FEILMELD_NRA   = '9';  /* ASKIP + BRIGHT + MDT */          00002820
     S001A5O.FEILTEKSTA     = 'I';  /* UNP + BRI + MDT      */          00002830
  END TEKST_UNP;                                                        00002840
                                                                        00002850
                                                                        00002860
  TEKST_PROT: PROC;                                                     00002870
     S001A5I.FEILTEKSTL     = 0;                                        00002880
     S001A5I.FEILMELD_NRL   = -1;  /* CURSOR   */                       00002890
     S001A5O.FEILMELD_NRA   = 'P'; /* BRIGHT + NUM + UNP + MDT */       00002900
     S001A5O.FEILTEKSTA     = DFHBMASB;                                 00002910
  END TEKST_PROT;                                                       00002920
                                                                        00002930
                                                                        00002940
  OVERFØR_TIL_MAP: PROC;                                                00002950
     S001A5O.FEILMELD_NRO   = FEIL_REC.FEILNR;                          00002960
     S001A5O.FEILTEKSTO     = FEIL_REC.TEKST;                           00002970
  END OVERFØR_TIL_MAP;                                                  00002980
                                                                        00002990
                                                                        00003000
  OVERFØR_FRA_MAP: PROC;                                                00003010
                                                                        00003020
     FEIL_REC.FEILNR     = S001A5O.FEILMELD_NRO;                        00003030
     FEIL_REC.TEKST = ' ';                                              00003040
     IF S001A5I.FEILTEKSTL    > 0 THEN                                  00003050
        FEIL_REC.TEKST   = S001A5I.FEILTEKSTI;                          00003060
                                                                        00003070
  END OVERFØR_FRA_MAP;                                                  00003080
                                                                        00003090
  KONTROLL_AV_INPUT:  PROC;                                             00003100
                                                                        00003110
     IF W01_IO  = ' ' THEN                                              00003120
        DO;                                                             00003130
           S001A5O.MELDINGO   = 'FEILMELDING ER IKKE UTFYLLT';          00003140
           S001A5I.FEILTEKSTL = -1;      /* CURSOR      */              00003150
        END;                                                            00003160
                                                                        00003170
     ELSE                                                               00003180
        RETURN;            /*  RETURNERER UTEN Å HA FUNNET FEIL  */     00003190
                                                                        00003200
                                                                        00003210
    /* HIT KOMMER EN BARE DERSOM DET ER FEIL, DA BLIR DET EN    */      00003220
    /* ANNEN UTGANG                                             */      00003230
                                                                        00003240
    CALL SEND_MAP;                                                      00003250
    GOTO UT;                                                            00003260
                                                                        00003270
                                                                        00003280
  END KONTROLL_AV_INPUT;                                                00003290
                                                                        00003300
 END R001B1;                                                            00003310
                                                                        00003320
                                                                        00003330
                                                                        00003340
