 /*       SIST ENDRET 13/03-98 13.38.18 AV   JDA7339                  */00000000
 /*       SIST ENDRET 13/03-98 13.22.26 AV   JDA7339                  */00000010
 /*       SIST ENDRET 05/12-97 12.46.05 AV   JDA7339                  */00000020
 /*       SIST ENDRET 27/11-97 11.51.32 AV   JDA7339                  */00000030
 /*       SIST ENDRET 26/08-96 10.36.52 AV   JDA0310                  */00000040
 /*       SIST ENDRET 25/09-95 14.48.50 AV   JDA0310                  */00000050
 /*       SIST ENDRET 25/02-94 13.11.33 AV   HERMAN                   */00000060
 /*       SIST ENDRET 07/07-93 09.55.25 AV   HERMAN                   */00000070
 /*       SIST ENDRET 07/07-93 09.42.21 AV   HERMAN                   */00000080
 /*       SIST ENDRET 03/03-92 09.53.38 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 26/04-91 12.27.45 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 21/01-91 14.16.25 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 12/11-90 13.16.04 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 01/12-89 08.59.48 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 14/04-89 14.44.35 AV   DYBVIK                   */00000140
 /* ***************************************************************** */00000150
 /*       SIST ENDRET 29/03-88 13.18.37 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 11/10-85 15.28.08 AV   TASSEN                   */00000170
 /*       SIST ENDRET 27/02-85 13.00.13 AV   KARIN                    */00000180
 /*       SIST ENDRET 15/02-85 14.52.58 AV   HERMAN                   */00000190
 /*       SIST ENDRET 12/02-85 10.34.15 AV   HERMAN                   */00000200
 /*       SIST ENDRET 05/11-84 16.33.53 AV   FARVIK                   */00000210
 /*       SIST ENDRET 12/10-84 09.41.11 AV   OLAV                     */00000220
 /*       SIST ENDRET 22/08-84 15.18.16 AV   KARIN                    */00000230
 /*       SIST ENDRET 15/06-84 09.57.59 AV   KARIN                    */00000240
 /*       SIST ENDRET 23/01-84 16.42.14 AV   FARVIK                   */00000250
 /*       SIST ENDRET 28/10-83 07.54.38 AV   FARVIK                   */00000260
 /*       SIST ENDRET 17/10-83 09.20.22 AV   FARVIK                   */00000270
 /*       SIST ENDRET 25/08-83 09.28.48 AV   OLAV                     */00000280
 /*       SIST ENDRET 25/04-83 10.45.32 AV   KARIN                    */00000290
 /*       SIST ENDRET 08/02-88 10.45.32 AV   SATISH                   */00000300
      /* *************************************** */                     00000310
      /* IDENTIFIKASJON:                         */                     00000320
      /*      R0011620                           */                     00000330
      /*      PROGRAMMERER: HELEN,MAI 1982.      */                     00000340
      /* HENSIKT:                                */                     00000350
      /*      KONTROLLERER DØDSTRANS MOT STATUS  */                     00000360
      /*      FOR FAMILIEN I BASEN.              */                     00000370
      /*    ENDRET 8/6-84 AV KARIN               */                     00000380
      /*      ENDRINGEN GJELDER REDUSERT BT.     */                     00000390
      /*    ENDRET 20/8-84 AV KARIN              */                     00000400
      /*      ENDRINGEN GJELDER VIRKNINGSDATO    */                     00000410
      /*      FOR RESTEN AV FAMILIEN NåR AVDØDE  */                     00000420
      /*      ER FORSØRGET EKTEFELLE ELLER       */                     00000430
      /*      FORSØRGET BARN, SKAL DA VÆRE :     */                     00000440
      /*                DØDSDATO + 1MND          */                     00000450
      /*    ENDRET 12.2.85 AV HERMAN             */                     00000460
      /*      PENSJONIST SOM FORSØRGER EKTEFELLE */                     00000470
      /*      FIKK FEIL TRANSTYPE.               */                     00000480
      /*      SE FEILMELDING NR 173              */                     00000490
      /*    ENDRET 27/2-85 AV KARIN              */                     00000500
      /*      ENDRINGEN GJELDER VIRKNINGSDATO    */                     00000510
      /*      FOR RESTEN AV FAMILIEN NåR AVDØDE  */                     00000520
      /*      ER FORSØRGET EKTEFELLE ELLER       */                     00000530
      /*      FORSØRGET BARN, SKAL DA VÆRE :     */                     00000540
      /*                DØDSDATO + 1MND          */                     00000550
      /*      DETTE BLE FEIL NÅR DØDSDATO I      */                     00000560
      /*      DESEMBER. VIRKDATO_ÅM SKAL DA VÆRE */                     00000570
      /*      DØDSDATO_ÅM + 100 - 11.            */                     00000580
      /* *************************************** */                     00000590
      /* PROGRAM TILKNYTNING:                    */                     00000600
      /*     KALLES OPP AV PROGRAM R0013520      */                     00000610
      /* BRUK:                                   */                     00000620
      /*    EXEC CICS XCTL PROGRAM ('R0011620')  */                     00000630
      /*    COMMAREA (KOM_OMR)                   */                     00000640
      /* *************************************** */                     00000650
                                                                        00000660
 KON_O1:                                                                00000670
 PROC(COMMAREA_PEKER) OPTIONS (MAIN);                                   00000680
                                                                        00000690
 /* ***************************************************************** */00000700
 /* KOMM_OMR.                                                         */00000710
 /* ***************************************************************** */00000720
                                                                        00000730
 %INCLUDE P0019908;                                                     00000740
 DCL COMMAREA_PEKER     PTR;                                            00000750
                                                                        00000760
 /* ***************************************************************** */00000770
 /* MENY_OMR.                                                         */00000780
 /* ***************************************************************** */00000790
                                                                        00000800
 %INCLUDE P0019906;                                                     00000810
                                                                        00000820
 /* ***************************************************************** */00000830
 /* STYRINGS_OMR                                                      */00000840
 /* ***************************************************************** */00000850
                                                                        00000860
 %INCLUDE P0019910;                                                     00000870
 %INCLUDE P0019912;                                                     00000880
                                                                        00000890
 /* ***************************************************************** */00000900
 /* TRANS_OMR.                                                        */00000910
 /* ***************************************************************** */00000920
                                                                        00000930
 %INCLUDE P0011601;                                                     00000940
                                                                        00000950
 /* ***************************************************************** */00000960
 /* HER KOMMER B01.                                                   */00000970
 /* ***************************************************************** */00000980
                                                                        00000990
 DCL  1  B01 BASED(B01_PEKER),                                          00001000
 %INCLUDE P0019921;                                                     00001010
                                                                        00001020
 /* ***************************************************************** */00001030
 /* HER KOMMER B02.                                                   */00001040
 /* ***************************************************************** */00001050
                                                                        00001060
 DCL  1  B02 BASED(B02_PEKER),                                          00001070
 %INCLUDE P0019921;                                                     00001080
                                                                        00001090
 /* ***************************************************************** */00001100
 /* HJELPEFELT.                                                       */00001110
 /* ***************************************************************** */00001120
                                                                        00001130
 DCL   AVDØD_IND         FIXED BIN(15),                                 00001140
       FORS_IND          FIXED BIN(15),                                 00001150
       FORS_EK_IND       FIXED BIN(15),                                 00001160
       AVD_FORS_IND      FIXED BIN(15),                                 00001170
       AVD_FORS_EK_IND   FIXED BIN(15),                                 00001180
       NY_YNG_BARN_IND   FIXED BIN(15),                                 00001190
       BARN_IND          FIXED BIN(15);                                 00001200
 DCL   I,J,K             FIXED BIN(15),                                 00001210
       T_FNR             PIC  '(11)9';                                  00001220
 DCL                                                                    00001230
      1 NR                DEF        T_FNR,                             00001240
        2 DG              PIC        '99',                              00001250
        2 MN              PIC        '99',                              00001260
        2 ÅR              PIC        '99',                              00001270
        2 PERSNR,                                                       00001280
          3 ÅRHUNDRE      PIC       '999',                              00001290
          3 REST          PIC        '99';                              00001300
 DCL                                                                    00001310
       BARN_FNR_SNUDD    PIC  '(11)9';                                  00001320
 DCL                                                                    00001330
      1 BA_FNR_SNUDD      DEF        BARN_FNR_SNUDD,                    00001340
        2 BA_ÅR_SN        PIC        '99',                              00001350
        2 BA_MN_SN        PIC        '99',                              00001360
        2 BA_DG_SN        PIC        '99',                              00001370
        2 BA_ÅRH_SN       PIC       '999',                              00001380
        2 BA_REST_SN      PIC        '99';                              00001390
 DCL                                                                    00001400
       NYTT_BARN_FNR     PIC  '(11)9';                                  00001410
 DCL                                                                    00001420
       FORRIGE_BARN_FNR     PIC  '(11)9';                               00001430
 DCL                                                                    00001440
      SEKSTISJU_ÅRSDATO   PIC        '(4)9',                            00001450
      HJ_VIRK_DATO_ÅM     PIC        '(4)9',                            00001460
      HJ_DØDSDATO_ÅM      PIC        '(4)9',                            00001470
      HJ_DØDSDATO_ÅMD     PIC        '(6)9';                            00001480
 DCL  HJ_DØDSDATO_ÅR_RE POS(1) DEF HJ_DØDSDATO_ÅMD PIC '99';            00001490
 DCL  HJ_DØDSDATO_MN_RE POS(3) DEF HJ_DØDSDATO_ÅMD PIC '99';            00001500
                                                                        00001510
 /* ***************************************************************** */00001520
 /* HJELPEFELT INITIERES.                                             */00001530
 /* ***************************************************************** */00001540
                                                                        00001550
 PROGRAM_ID      = 'R0011620';                                          00001560
 T_FNR           = O1.FNR_DØD;                                          00001570
 I               = 0;                                                   00001580
 J               = 0;                                                   00001590
 K               = 0;                                                   00001600
 AVDØD_IND       = SØKER_IND;                                           00001610
 FORS_IND        = 0;                                                   00001620
 NY_YNG_BARN_IND = 0;                                                   00001630
 AVD_FORS_IND    = 0;                                                   00001640
                                                                        00001650
 /* ***************************************************************** */00001660
 /* REGNER UT ÅR OG MND VEDKOMMENDE FYLLER 67 ÅR (ÅÅMM).  SIFFER      */00001670
 /* 7-9 ANGIR ÅRHUNDRE: 1800-TALLET 500-749, 1900-TALLET 000-499.     */00001680
 /* ***************************************************************** */00001690
                                                                        00001700
  IF ÅRHUNDRE <= '499' THEN                                             00001710
     SEKSTISJU_ÅRSDATO = (ÅR + 67) * 100 + MN;                          00001720
  ELSE                                                                  00001730
     SEKSTISJU_ÅRSDATO = ((ÅR + 67) - 100) * 100 + MN;                  00001740
                                                                        00001750
  /* DØDSDATO ER FLYTTET INN I VIRKNINGSDATO I R0011602  */             00001760
  HJ_VIRK_DATO_ÅM = F_SNU_DATO(VIRKNINGSDATO);                          00001770
  HJ_DØDSDATO_ÅMD = F_SNU_DØDSDATO(O1.DØDSDATO_DØD);                    00001780
  HJ_DØDSDATO_ÅM  = HJ_DØDSDATO_ÅMD / 100;                              00001790
                                                                        00001800
 /*HL : NY BESTEÅRSREGEL FRA 91 : */                                    00001810
                                                                        00001820
  IF NR.ÅR  < 24            !                                           00001830
     HJ_DØDSDATO_ÅM < 9100           THEN                               00001840
     B02.PENSJONSRETT_FØR_91 = 'J';                                     00001850
                                                                        00001860
                                                                        00001870
 /* ***************************************************************** */00001880
 /* AVDØD ER IKKE I BASEN.                                            */00001890
 /* ***************************************************************** */00001900
                                                                        00001910
  IF B01.FNR(AVDØD_IND) = 0 THEN                                        00001920
     DO;                                                                00001930
        B02.FNR              (AVDØD_IND)  =  O1.FNR_DØD;                00001940
        B02.TKNR             (AVDØD_IND)  =  O1.TKNR_DØD;               00001950
        B02.SPRÅK            (AVDØD_IND)  =  ' ';                       00001960
        B02.DØDSDATO_ÅMD     (AVDØD_IND)  =  HJ_DØDSDATO_ÅMD;           00001970
 /*HL   B02.VIRK_DATO_ÅM     (AVDØD_IND)  =  HJ_DØDSDATO_ÅM;    */      00001980
 /*HL*/ B02.VIRK_DATO_ÅM     (AVDØD_IND)  =  HJ_VIRK_DATO_ÅM;           00001990
        B02.PENSJONSTYPE1    (AVDØD_IND)  = 'D';                        00002000
        B02.FØRSTE_GANG_REG  (AVDØD_IND)  = 'J';                        00002010
        B02.STATUS_KODE_HIST (AVDØD_IND)  = 'X';                        00002020
        TRANSTYPE = 65;                                                 00002030
     END;                                                               00002040
  ELSE                                                                  00002050
                                                                        00002060
 /* ***************************************************************** */00002070
 /* AVDØDE ER I BASEN .                                               */00002080
 /* ***************************************************************** */00002090
                                                                        00002100
     DO;                                                                00002110
        IF B01.DØDSDATO_ÅMD(AVDØD_IND) > 0 &                            00002120
           B01.DØDSDATO_ÅMD(AVDØD_IND) ^= HJ_DØDSDATO_ÅMD THEN          00002130
           DO;                                                          00002140
   L100:                                                                00002150
              FEIL_VED_LABEL = '100';                                   00002160
              FEIL_MELD_NR   = 1709;                                    00002170
              GO TO L999;                                               00002180
           END;                                                         00002190
        IF AVDØD_IND < 3 THEN                                           00002200
           DO;                                                          00002210
                                                                        00002220
 /* ***************************************************************** */00002230
 /* AVDØDE HAR IKKE PENSJONSSTATUS.                                   */00002240
 /* ***************************************************************** */00002250
                                                                        00002260
              IF STATUS_TYPE = 'A' !                                    00002270
                 STATUS_TYPE = 'I' THEN                                 00002280
                 DO;                                                    00002290
                    TRANSTYPE = 65;                                     00002300
                    B02.PERSON  (AVDØD_IND)  = B01.PERSON(AVDØD_IND);   00002310
                    B02.DØDSDATO_ÅMD     (AVDØD_IND)  =                 00002320
                                                       HJ_DØDSDATO_ÅMD; 00002330
 /* HL      B02.VIRK_DATO_ÅM     (AVDØD_IND)  =  HJ_DØDSDATO_ÅM;  */    00002340
            B02.VIRK_DATO_ÅM     (AVDØD_IND)  =  HJ_VIRK_DATO_ÅM;       00002350
                    B02.PENSJONSTYPE1    (AVDØD_IND)  = 'D';            00002360
                    B02.STATUS_KODE_HIST (AVDØD_IND)  = 'X';            00002370
                    B02.SUM_YTELSE       (AVDØD_IND)  = 0;              00002380
                                                                        00002390
 /* ENDRET 14.2.85  HL : NÅR STATUS_TYPE = 'I', SÅ SKAL            */   00002400
 /*                      FØRSTE_GANG_REG VÆRE 'N'                  */   00002410
                                                                        00002420
                    IF STATUS_TYPE = 'I' THEN                           00002430
                                                                        00002440
                       B02.FØRSTE_GANG_REG  (AVDØD_IND)  = 'N';         00002450
                                                                        00002460
                    ELSE                                                00002470
                                                                        00002480
 /* HIT 14.2.85  HL                                                */   00002490
                                                                        00002500
                       B02.FØRSTE_GANG_REG  (AVDØD_IND)  = 'J';         00002510
                                                                        00002520
                                                                        00002530
                 END;                                                   00002540
                                                                        00002550
 /* ***************************************************************** */00002560
 /* AVDØDE HAR PENSJONSSTATUS.                                        */00002570
 /* ***************************************************************** */00002580
                                                                        00002590
              ELSE                                                      00002600
                 DO;                                                    00002610
                    B02.PERSON  (AVDØD_IND)  = B01.PERSON(AVDØD_IND);   00002620
                    B02.DØDSDATO_ÅMD     (AVDØD_IND)  =                 00002630
                                                       HJ_DØDSDATO_ÅMD; 00002640
 /* HL     B02.VIRK_DATO_ÅM     (AVDØD_IND)  =  HJ_DØDSDATO_ÅM;*/       00002650
 /*HL*/    B02.VIRK_DATO_ÅM     (AVDØD_IND)  =  HJ_VIRK_DATO_ÅM;        00002660
                    B02.PENSJONSTYPE1    (AVDØD_IND)  = 'D';            00002670
                    B02.STATUS_KODE_HIST (AVDØD_IND)  = 'X';            00002680
                    B02.SUM_YTELSE       (AVDØD_IND)  = 0;              00002690
                    B02.FØRSTE_GANG_REG  (AVDØD_IND)  = 'N';            00002700
                                                                        00002710
 /*YS*/             IF B01.YRKEPENS.YUG (AVDØD_IND) > 0      THEN       00002720
 /*YS*/                B02.DØD_AV_YRKESSKADE (AVDØD_IND) = 'J';         00002730
                                                                        00002740
                    DO I = 1 TO 13 WHILE(                               00002750
                                   B01.FNR_TILKN(AVDØD_IND,I) > 0);     00002760
               IF B01.TILKN.TILKNYTNINGSKODE(AVDØD_IND,I) = 'L' !       00002770
  /*HL*/          B01.TILKN.TILKNYTNINGSKODE(AVDØD_IND,I) = 'V' !       00002780
                  B01.TILKN.TILKNYTNINGSKODE(AVDØD_IND,I) = 'W' THEN    00002790
                                                                        00002800
                         /* AVDØDE ER TILKNYTTET FORSØRGET BARN  */     00002810
                                                                        00002820
                          DO J = 3 TO 14 WHILE (B01.FNR(J) > 0);        00002830
                                                                        00002840
                             IF B01.FNR(J) =                            00002850
                                     B01.FNR_TILKN(AVDØD_IND,I)     THEN00002860
                                DO;                                     00002870
                                                                        00002880
 /* ***************************************************************** */00002890
 /* BARNA FLYTTES TIL B02.                                            */00002900
 /* ***************************************************************** */00002910
                                   B02.PERSON(J)            =           00002920
                                                          B01.PERSON(J);00002930
                                   B02.STATUS_KODE_HIST (J) = 'O';      00002940
 /*HL           B02.VIRK_DATO_ÅM(J)      =  HJ_DØDSDATO_ÅM;    */       00002950
 /*HL*/         B02.VIRK_DATO_ÅM(J)      =  HJ_VIRK_DATO_ÅM;            00002960
                                                                        00002970
 /*YS*/             IF B01.YRKEPENS.YUG (AVDØD_IND) > 0      THEN       00002980
 /*YS*/                B02.DØD_AV_YRKESSKADE (J)    = 'Y';              00002990
                                                                        00003000
                                END;                                    00003010
                          END;                                          00003020
                    END;                                                00003030
                                                                        00003040
                    IF B01.STATUS.SIVILSTAND(AVDØD_IND) = 'G' !         00003050
                       B01.STATUS.SIVILSTAND(AVDØD_IND) = 'W' !         00003060
                       B01.STATUS.SIVILSTAND(AVDØD_IND) = 'V' !         00003070
                       B01.STATUS.SIVILSTAND(AVDØD_IND) = 'P' !         00003080
                       B01.STATUS.SIVILSTAND(AVDØD_IND) = 'A' THEN      00003090
                                                                        00003100
 /* ***************************************************************** */00003110
 /* AVDØDE ER GIFT OG KOBLET TIL EKTEFELLE.  (P OG W 11.93 JD )       */00003120
 /* ***************************************************************** */00003130
                                                                        00003140
                       DO;                                              00003150
                          IF B01.RF0PERSN.FNR(EKTEF_IND) = 0  THEN      00003160
                             DO;                                        00003170
                                                                        00003180
 /*ENDRET 17.10.88 HL : NY FEILMELDING INNLAGT :    */                  00003190
                                                                        00003200
  L110:  /*EKTEFELLEN ER AV EN ELLER ANNEN GRUNN IKKE INNLEST */        00003210
                                                                        00003220
                                FEIL_VED_LABEL = '110';                 00003230
                                FEIL_MELD_NR   = 1727;                  00003240
                                GO TO L999;                             00003250
                             END;                                       00003260
                                                                        00003270
    /*                    TRANSTYPE = 53;             */                00003280
                          TRANSTYPE = 18;          /*9803 HL*/          00003290
                          B02.PENSJONSTYPE2(AVDØD_IND) = ' ';           00003300
                          CALL                                          00003310
                              FLYTT_B01_TIL_B02(EKTEF_IND);             00003320
                             /* B02.VIRKDATO(EKTEF) ER NÅ = DØDSDATO */ 00003330
                                                                        00003340
                          B02.ARBEIDSINNTEKT_EK(EKTEF_IND) = 0;         00003350
                          B02.PENSJONSINNTEKT_EK(EKTEF_IND) = 0;        00003360
                          B02.EK_INNT_OVER_2G   (EKTEF_IND) = ' ';      00003370
                                                                        00003380
 /* RULLERING AV EKTEFELLES INNTEKTER - 9802 HL */                      00003390
    IF B02.ALDERSP.FAI(EKTEF_IND) > 0   THEN                            00003400
       CALL RULL_FAI(B02.G_DATO_ÅM(EKTEF_IND),                          00003410
                     B02.VIRK_DATO_ÅM(EKTEF_IND),                       00003420
                     B02.ALDERSP.FAI(EKTEF_IND));                       00003430
                                                                        00003440
    IF B02.FORSI.PENSJONSINNTEKT(EKTEF_IND) > 0  THEN                   00003450
       B02.FORSI.PENSJONSINNTEKT(EKTEF_IND) =                           00003460
           F_RULL_FORSI(B02.G_DATO_ÅM(EKTEF_IND),                       00003470
                 B02.VIRK_DATO_ÅM(EKTEF_IND),                           00003480
                 B02.FORSI.PENSJONSINNTEKT(EKTEF_IND));                 00003490
                                                                        00003500
    IF B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND) > 0  THEN                    00003510
       B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND) =                            00003520
           F_RULL_FORSI(B02.G_DATO_ÅM(EKTEF_IND),                       00003530
                 B02.VIRK_DATO_ÅM(EKTEF_IND),                           00003540
                 B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND));                  00003550
                                                                        00003560
    IF B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND) > 0  THEN                00003570
       B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND) =                        00003580
           F_RULL_FORSI(B02.G_DATO_ÅM(EKTEF_IND),                       00003590
                  B02.VIRK_DATO_ÅM(EKTEF_IND),                          00003600
                  B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND));             00003610
                                                                        00003620
    IF B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND) > 0  THEN                 00003630
       B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND) =                         00003640
           F_RULL_FORSI(B02.G_DATO_ÅM(EKTEF_IND),                       00003650
                 B02.VIRK_DATO_ÅM(EKTEF_IND),                           00003660
                 B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND));               00003670
                                                                        00003680
                                                                        00003690
                          IF B01.PENSJONSTYPE1 (AVDØD_IND) = 'F' THEN   00003700
                          /* AVDØDE ER FORSØRGET EKTEFELLE OG      */   00003710
                          /* B02.VIRKDATO(EKTEF) = DØDSDATO + 1MND */   00003720
                             DO;                                        00003730
 /* HL                                                                  00003740
                               IF HJ_DØDSDATO_MN_RE = 12 THEN           00003750
                               HJ_DØDSDATO_ÅMD = HJ_DØDSDATO_ÅMD        00003760
                                               + 10000 -1100;           00003770
                               ELSE                                     00003780
                               HJ_DØDSDATO_ÅMD = HJ_DØDSDATO_ÅMD + 100; 00003790
                               HJ_DØDSDATO_ÅM = HJ_DØDSDATO_ÅMD / 100;  00003800
                               B02.VIRK_DATO_ÅM (EKTEF_IND) =           00003810
                               HJ_DØDSDATO_ÅM;                          00003820
     */                                                                 00003830
 /*HL*/  B02.VIRK_DATO_ÅM(EKTEF_IND) = HJ_VIRK_DATO_ÅM;                 00003840
                                                                        00003850
                               IF B01.ANTALL_BARN(EKTEF_IND) > 0 THEN   00003860
                                DO;                                     00003870
                                 DO I = 1 TO 13 WHILE                   00003880
                                  (B01.FNR_TILKN (EKTEF_IND, I) > 0);   00003890
                 IF B01.TILKN.TILKNYTNINGSKODE(EKTEF_IND,I) = 'L'  !    00003900
  /*HL*/            B01.TILKN.TILKNYTNINGSKODE(EKTEF_IND,I) = 'V'  !    00003910
                    B01.TILKN.TILKNYTNINGSKODE(EKTEF_IND,I) = 'W' THEN  00003920
                                                                        00003930
                                  DO J = 3 TO 14 WHILE (B01.FNR(J) > 0);00003940
 /* HL       B02.VIRK_DATO_ÅM(J) =HJ_DØDSDATO_ÅM;       */              00003950
 /*HL*/      B02.VIRK_DATO_ÅM(J) =HJ_VIRK_DATO_ÅM;                      00003960
                                  END;                                  00003970
                                 END;                                   00003980
                                END;                                    00003990
                             END;                                       00004000
                                                                        00004010
                          IF FEIL_MELD_NR > 0 THEN                      00004020
                             GO TO L999;                                00004030
                          ELSE                                          00004040
                             PROGRAM_ID = 'R0011620';                   00004050
                       IF B01.SIVILSTAND(EKTEF_IND) = 'V'  THEN         00004060
                          B02.SIVILSTAND(EKTEF_IND) = 'U';              00004070
                       ELSE                                             00004080
                          B02.SIVILSTAND(EKTEF_IND) = 'E';              00004090
                       B02.FØRSTE_GANG_REG  (EKTEF_IND)  = 'N';         00004100
                                                                        00004110
 /*YS*/             IF B01.YRKEPENS.YUG (AVDØD_IND) > 0      THEN       00004120
 /*YS*/                B02.DØD_AV_YRKESSKADE (EKTEF_IND) = 'Y';         00004130
                          CALL OPPHØR_KOBLING_AVDØD;                    00004140
                          /* IKKE LENGER REDUSERT BARNETILL */          00004150
                                                                        00004160
                          DO I = 3 TO 14 WHILE (B02.FNR(I) > 0);        00004170
                             IF B01.PENSJONSTYPE2(I) = 'R' THEN         00004180
                                TRANSTYPE = 47;                         00004190
                             B02.PENSJONSTYPE2(I) = ' ';                00004200
                          END;                                          00004210
 /* ***************************************************************** */00004220
 /* FINNER TRANSTYPE.                                                 */00004230
 /* ***************************************************************** */00004240
                                                                        00004250
                          IF B01.PENSJONSTYPE1(AVDØD_IND) = 'F' THEN    00004260
                                                                        00004270
 /* ***************************************************************** */00004280
 /* AVDØDE ER EN FORSØRGET EKTEFELLE.                                 */00004290
 /* ***************************************************************** */00004300
                                                                        00004310
                             DO;                                        00004320
                                B02.PENSJONSTYPE2(EKTEF_IND) = 'P';     00004330
                                TRANSTYPE = 17;                         00004340
                             END;                                       00004350
                          IF B01.PENSJONSTYPE2(AVDØD_IND) = 'S' THEN    00004360
                                                                        00004370
 /* ***************************************************************** */00004380
 /* AVDØDE ER EN AV TO PENSJONISTER.                                  */00004390
 /* ***************************************************************** */00004400
                                                                        00004410
                             DO;                                        00004420
  /* FJERNET HL :                                                       00004430
                                HJ_VIRK_DATO_ÅM = HJ_DØDSDATO_ÅM;       00004440
                                VIRKNINGSDATO =                         00004450
                                           F_SNU_DATO(HJ_VIRK_DATO_ÅM); 00004460
      HIT HL */                                                         00004470
                              B02.PENSJONSTYPE2(EKTEF_IND) = 'P';       00004480
                              B02.EK_INNT_OVER_2G(EKTEF_IND) = ' ';     00004490
                                                                        00004500
 /*AFP : TT OVERFØRES IKKE FOR AFP : */                                 00004510
                                                                        00004520
 /*AFP*/                     IF B02.PENSJONSTYPE1(EKTEF_IND) ^= 'K' &   00004530
 /*AFP*/                       B02.PENSJONSTYPE1(SØKER_IND) ^= 'K' THEN 00004540
 /*HL0793*/                     IF HJ_DØDSDATO_ÅM < 9100           THEN 00004550
                                B02.TT_GARANTI   (EKTEF_IND) =          00004560
                                                 B02.TT_ANV(SØKER_IND); 00004570
                                                                        00004580
                                TRANSTYPE = 18;                         00004590
                             END;                                       00004600
                          IF B01.PENSJONSTYPE1(AVDØD_IND) = 'G' THEN    00004610
                                                                        00004620
 /* ***************************************************************** */00004630
 /* AVDØDE ER EN IKKE-FORSØRGET EKTEFELLE.                            */00004640
 /* ***************************************************************** */00004650
                                                                        00004660
    /*                       TRANSTYPE = 53;            */              00004670
                             TRANSTYPE = 18;      /*9803 HL*/           00004680
                          IF B01.PENSJONSTYPE2(AVDØD_IND) = 'P'  !      00004690
 /* TILLEGG 12.2.85 HL */    B01.PENSJONSTYPE2(AVDØD_IND) = 'F' THEN    00004700
                                                                        00004710
 /* ***************************************************************** */00004720
 /* AVDØDE HAR EKTEFELLE UTEN PENSJON.                                */00004730
 /* ***************************************************************** */00004740
                                                                        00004750
                             DO;                                        00004760
                                TRANSTYPE = 54;                         00004770
                                B02.SIVILSTAND(EKTEF_IND) = 'E';        00004780
                                        /* TRUDE 220995*/               00004790
                                IF B01.PENSJONSTYPE2(EKTEF_IND) = 'N'   00004800
                                                                THEN    00004810
                                      TRANSTYPE = 18;                   00004820
                                        /*TRUDE 220995*/                00004830
                                                                        00004840
                             END;                                       00004850
                          CALL                                          00004860
                              AJOURFØR_HIST_AVDØDE_I_STATUS(AVDØD_IND); 00004870
                                                                        00004880
                           IF O1.FNR_EK  > 0    THEN                    00004890
                                                                        00004900
 /* ***************************************************************** */00004910
 /* EKTEFELLE HAR AUTOMATISKE ETTERLATTE RETTIGHETER.                 */00004920
 /* ***************************************************************** */00004930
                                                                        00004940
                             DO;                                        00004950
                                IF (B01.PENSJONSTYPE1(EKTEF_IND) = 'A'! 00004960
                                    B01.PENSJONSTYPE1(EKTEF_IND) = 'U'! 00004970
                                    B01.PENSJONSTYPE1(EKTEF_IND) = 'Y') 00004980
                                  & B01.PENSJONSTYPE2(EKTEF_IND) = 'S'  00004990
                                                                THEN    00005000
                                   DO;                                  00005010
                                        /* TS 0896 UFG MÅ VÆRE 100*/    00005020
                                IF (B01.PENSJONSTYPE1(EKTEF_IND) = 'U'! 00005030
                                    B01.PENSJONSTYPE1(EKTEF_IND) = 'Y')&00005040
                                    B01.UFØRPENS.UFG(EKTEF_IND) <  100 &00005050
                                    O1.PI_DØD ^= '9999999'    THEN      00005060
                                       DO;                              00005070
    L115:                                                               00005080
                                          FEIL_VED_LABEL = '115';       00005090
                                          FEIL_MELD_NR   = 1750;        00005100
                                          GO TO L999;                   00005110
                                       END;                             00005120
                                       /* TS 0896 TIL HIT*/             00005130
                                                                        00005140
                                      B02.PENSJONSTYPE2(EKTEF_IND) =    00005150
                                                                  'E';  00005160
   B02.ETTEPENS.SPT_1291(EKTEF_IND) = B02.UFØRPENS.SPT_1291(AVDØD_IND); 00005170
   B02.ETTEPENS.OPT_1291(EKTEF_IND) = B02.UFØRPENS.OPT_1291(AVDØD_IND); 00005180
   B02.ETTEPENS.PÅ_1291(EKTEF_IND)  = B02.UFØRPENS.PÅ_1291(AVDØD_IND);  00005190
                                      CALL                              00005200
                                         KOBLE_TO_PERSONER(AVDØD_IND,   00005210
                                                           EKTEF_IND);  00005220
                                   END;                                 00005230
                                ELSE                                    00005240
                                                                        00005250
                                   IF O1.PI_DØD ^= '9999999'    THEN    00005260
                                                                        00005270
 /*O1.PI_DØD = 999999 BETYR AT DØDSMELDINGEN ER GENERERT AV EP-SØKNAD*/ 00005280
                                                                        00005290
 /*AFP*/                              IF B01.PENSJONSTYPE1(SØKER_IND)   00005300
 /*AFP*/                                             = 'K' THEN         00005310
 /*AFP*/                                DO;                             00005320
 /*AFP*/                                 FEIL_VED_LABEL = '120';        00005330
 /*AFP*/                                 FEIL_MELD_NR   = 1736;         00005340
 /*AFP*/                                END;                            00005350
 /*AFP*/ ELSE                                                           00005360
                                                                        00005370
                                       DO;                              00005380
   L120:                                                                00005390
                                         FEIL_VED_LABEL = '120';        00005400
                                         FEIL_MELD_NR   = 1406;         00005410
                                         GO TO L999;                    00005420
                                       END;                             00005430
                             END;                                       00005440
                                                                        00005450
                                                                        00005460
                       END;                                             00005470
                     ELSE                                               00005480
                                                                        00005490
 /* ***************************************************************** */00005500
 /* AVDØDE ER ETTERLATT ELLER SKILT.                                  */00005510
 /* ***************************************************************** */00005520
                                                                        00005530
                        DO;                                             00005540
                           TRANSTYPE = 54;                              00005550
                           CALL                                         00005560
                               OPPHØR_KOBLING_AVDØD;                    00005570
                           CALL                                         00005580
                               AJOURFØR_HIST_AVDØDE_I_STATUS            00005590
                                                     (AVDØD_IND);       00005600
                        END;                                            00005610
                 END;                                                   00005620
           END;                                                         00005630
                                                                        00005640
 /* ***************************************************************** */00005650
 /* AVDØDE ER PÅ BARNEPLASS OG MÅ DERFOR HA PENSJONSSTATUS.           */00005660
 /* ***************************************************************** */00005670
                                                                        00005680
        ELSE                                                            00005690
           DO;                                                          00005700
                                                                        00005710
 /* ***************************************************************** */00005720
 /* AVDØD_IND ER NÅ DEN RIKTIGE BARNEINDEKS.                       */   00005730
 /* ***************************************************************** */00005740
                                                                        00005750
              IF B01.PENSJONSTYPE1(AVDØD_IND) = 'L' THEN                00005760
                                                                        00005770
 /* ***************************************************************** */00005780
 /* AVDØDE ER FORSØRGET BARN. BARNET KAN BARE VÆRE KNYTTET TIL        */00005790
 /* FORSØRGEREN I TILKNYTNINGS SEGMENT(1).                            */00005800
 /* ***************************************************************** */00005810
                                                                        00005820
                 DO;                                                    00005830
                    IF B01.FNR_TILKN(AVDØD_IND,1) = B01.FNR(1)          00005840
                                                                THEN    00005850
                       DO;                                              00005860
                          FORS_IND = 1;                                 00005870
                          FORS_EK_IND = 2;                              00005880
                       END;                                             00005890
                    ELSE                                                00005900
                       DO;                                              00005910
                          FORS_IND = 2;                                 00005920
                          FORS_EK_IND = 1;                              00005930
                       END;                                             00005940
                                                                        00005950
 /* ***************************************************************** */00005960
 /* BARNA BLIR FLYTTET SAMTIDIG MED FORELDRE.                         */00005970
 /* ***************************************************************** */00005980
                                                                        00005990
                    CALL                                                00006000
                        FLYTT_B01_TIL_B02(FORS_IND);                    00006010
                    IF FEIL_MELD_NR > 0 THEN                            00006020
                       GO TO L999;                                      00006030
                    ELSE                                                00006040
                       PROGRAM_ID = 'R0011620';                         00006050
                    IF B01.FNR(FORS_EK_IND) > 0  THEN                   00006060
                       DO;                                              00006070
                          CALL                                          00006080
                              FLYTT_B01_TIL_B02(FORS_EK_IND);           00006090
                          IF FEIL_MELD_NR > 0 THEN                      00006100
                             GO TO L999;                                00006110
                          ELSE                                          00006120
                             PROGRAM_ID = 'R0011620';                   00006130
                       END;                                             00006140
                                                                        00006150
 /* ***************************************************************** */00006160
 /* BARNET BLIR SLETTET OG TILKNYT.SEGMENT TIL FORSØRGEREN OPPDATERES.*/00006170
 /* ***************************************************************** */00006180
                                                                        00006190
                    CALL                                                00006200
                        AJOURFØR_HIST_AVDØDE_I_STATUS(AVDØD_IND);       00006210
                    CALL                                                00006220
                        OPPHØR_KOBLING_AVDØD;                           00006230
                    B02.ANTALL_BARN(FORS_IND) =                         00006240
                                          B02.ANTALL_BARN(FORS_IND) - 1;00006250
                    TRANSTYPE = 19;                                     00006260
                 END;                                                   00006270
              ELSE                                                      00006280
                 IF B01.PENSJONSTYPE1(AVDØD_IND) = 'N' !                00006290
                    B01.PENSJONSTYPE1(AVDØD_IND) = 'B' THEN             00006300
                                                                        00006310
 /* ***************************************************************** */00006320
 /* BARNET ER ETTERLATT - EN AV FORELDRENE DØD.                       */00006330
 /* ***************************************************************** */00006340
                                                                        00006350
                    DO;                                                 00006360
                       IF B01.FNR(1) > 0 THEN                           00006370
                          DO;                                           00006380
                             AVD_FORS_IND    = 1;                       00006390
                             AVD_FORS_EK_IND = 2;                       00006400
                          END;                                          00006410
                       ELSE                                             00006420
                          DO;                                           00006430
                             AVD_FORS_IND    = 2;                       00006440
                             AVD_FORS_EK_IND = 1;                       00006450
                          END;                                          00006460
                       CALL                                             00006470
                           FLYTT_B01_TIL_B02(3);                        00006480
                       IF FEIL_MELD_NR > 0 THEN                         00006490
                          GO TO L999;                                   00006500
                       ELSE                                             00006510
                          PROGRAM_ID = 'R0011620';                      00006520
                                                                        00006530
 /* ***************************************************************** */00006540
 /* BARNET ER FLYTTET SAMMEN MED ØVRIGE BARN.                         */00006550
 /* ***************************************************************** */00006560
                       B02.PERSON  (AVD_FORS_IND)  =                    00006570
                                     B01.PERSON(AVD_FORS_IND);          00006580
                       IF B01.PENSJONSTYPE1(AVDØD_IND) = 'B' THEN       00006590
                          B02.PERSON  (AVD_FORS_EK_IND)  =              00006600
                                     B01.PERSON(AVD_FORS_EK_IND);       00006610
                       CALL                                             00006620
                           AJOURFØR_HIST_AVDØDE_I_STATUS(AVDØD_IND);    00006630
                       CALL                                             00006640
                           OPPHØR_KOBLING_AVDØD;                        00006650
                                                                        00006660
 /* ***************************************************************** */00006670
 /* BARNET ER YNGSTE BARN.                                            */00006680
 /* ***************************************************************** */00006690
                                                                        00006700
 /*  ENDRET  08.02.88   SATISH ---                                    */00006710
 /*                    IF B01.PENSJONSTYPE2(AVDØD_IND) = 'Y' THEN     */00006720
 /*   HIT TILL   08.02.88-----                                        */00006730
                                                                        00006740
                       IF B01.PENSJONSTYPE2(AVDØD_IND) = 'P' &          00006750
                         (B01.PENSJONSTYPE1(AVDØD_IND) = 'B' !          00006760
                          B01.PENSJONSTYPE1(AVDØD_IND) = 'N')  THEN     00006770
                          DO;                                           00006780
                                                                        00006790
 /* ***************************************************************** */00006800
 /* KOBLINGEN TIL YNGSTE BARN FRA AVDØDE FORSØRGEREN OPPHØRER.        */00006810
 /* ***************************************************************** */00006820
                                                                        00006830
                                 IF B01.ANTALL_BARN(AVDØD_IND) > 1 THEN 00006840
                                    DO;                                 00006850
                                                                        00006860
 /* ***************************************************************** */00006870
 /* BARNET ER TILKNYTTET ØVRIGE BARN.                                 */00006880
 /* ***************************************************************** */00006890
                                                                        00006900
                                       TRANSTYPE = 37;                  00006910
                                                                        00006920
 /* ***************************************************************** */00006930
 /* BARNA UNDERSØKES FOR Å FINNE NY YNGSTE BARN.                      */00006940
 /* ***************************************************************** */00006950
                                                                        00006960
                                       NY_YNG_BARN_IND = 4;             00006970
                                       IF B01.ANTALL_BARN(AVDØD_IND) >  00006980
                                                                 2 THEN 00006990
                                          DO I = 5 TO 14 WHILE (        00007000
                                                      B02.FNR(I) > 0);  00007010
 /* ***************************************************************** */00007020
 /* NYTT BARNS FNR SNUS FOR Å FINNE DET YNGSTE BARNET                 */00007030
 /* ***************************************************************** */00007040
                                                                        00007050
                                             T_FNR      = B02.FNR(I);   00007060
                                             BA_ÅR_SN   = ÅR;           00007070
                                             BA_MN_SN   = MN;           00007080
                                             BA_DG_SN   = DG;           00007090
                                             BA_ÅRH_SN  = ÅRHUNDRE;     00007100
                                             BA_REST_SN = REST;         00007110
                                             NYTT_BARN_FNR =            00007120
                                               BARN_FNR_SNUDD;          00007130
 /* ***************************************************************** */00007140
 /* FORRIGE YNGSTE BARNS FNR SNUS FOR Å FINNE DET YNGSTE              */00007150
 /* ***************************************************************** */00007160
                                                                        00007170
                                             T_FNR      =               00007180
                                             B02.FNR(NY_YNG_BARN_IND);  00007190
                                             BA_ÅR_SN   = ÅR;           00007200
                                             BA_MN_SN   = MN;           00007210
                                             BA_DG_SN   = DG;           00007220
                                             BA_ÅRH_SN  = ÅRHUNDRE;     00007230
                                             BA_REST_SN = REST;         00007240
                                             FORRIGE_BARN_FNR =         00007250
                                               BARN_FNR_SNUDD;          00007260
                                                                        00007270
                                             IF NYTT_BARN_FNR >         00007280
                                                FORRIGE_BARN_FNR THEN   00007290
                                                NY_YNG_BARN_IND = I;    00007300
                                          END;                          00007310
                                                                        00007320
 /* ***************************************************************** */00007330
 /* PENSJONSKODER ,ANTALL BARN OPPDATERES.                            */00007340
 /* ***************************************************************** */00007350
 /*   ENDRET 15.03.88   SATISH                                          00007360
                                       B02.PENSJONSTYPE2(               00007370
                                              NY_YNG_BARN_IND)          00007380
                                                                = 'Y'   00007390
     HITTIL  15.03.88  SATISH                                     */    00007400
                                       B02.PENSJONSTYPE2(               00007410
                                              NY_YNG_BARN_IND)          00007420
                                                                = 'P';  00007430
                                       B02.ANTALL_BARN(                 00007440
                                            NY_YNG_BARN_IND) =          00007450
                                              B01.ANTALL_BARN(          00007460
                                                       AVDØD_IND) - 1;  00007470
                                       B02.FØRSTE_GANG_REG              00007480
                                           (NY_YNG_BARN_IND) = 'N';     00007490
                                                                        00007500
 /* ***************************************************************** */00007510
 /* BARNET KOBLES TIL AVDØDE FORSØRGEREN.                             */00007520
 /* ***************************************************************** */00007530
                                                                        00007540
                                       CALL                             00007550
                                           KOBLE_TO_PERSONER (          00007560
                                                       NY_YNG_BARN_IND, 00007570
                                                          AVD_FORS_IND);00007580
                                       IF B01.PENSJONSTYPE1(AVDØD_IND) =00007590
                                                              'B' THEN  00007600
                                          CALL                          00007610
                                              KOBLE_TO_PERSONER (       00007620
                                                       NY_YNG_BARN_IND, 00007630
                                                      AVD_FORS_EK_IND); 00007640
                                                                        00007650
 /* ***************************************************************** */00007660
 /* ØVRIGE BARN KOBLES TIL NY YNGSTE BARN OG KOBLING TIL AVDØDE       */00007670
 /* BARN OPPHØRER.                                                    */00007680
 /* ***************************************************************** */00007690
                                                                        00007700
                                       DO I = 4 TO 14 WHILE (           00007710
                                                  B02.FNR(I) > 0);      00007720
                                          IF B02.PENSJONSTYPE2(I) =     00007730
                                                              'Ø' THEN  00007740
                                             DO;                        00007750
                                                BARN_IND = I;           00007760
                                                CALL                    00007770
                                                    KOBLE_TO_PERSONER   00007780
                                                             (BARN_IND, 00007790
                                                       NY_YNG_BARN_IND);00007800
                                                B02.FØRSTE_GANG_REG     00007810
                                                (NY_YNG_BARN_IND) = 'N';00007820
                                             END;                       00007830
                                                                        00007840
 /* ***************************************************************** */00007850
 /* BARNET ER NÅ KOBLET TIL NY YNGSTE BARN MED 'P' .                  */00007860
 /* ***************************************************************** */00007870
                                                                        00007880
                                       END;                             00007890
                                    END;                                00007900
                                 ELSE                                   00007910
                                                                        00007920
 /* ***************************************************************** */00007930
 /* DET ER IKKE FLERE BARN.                                           */00007940
 /* ***************************************************************** */00007950
                                                                        00007960
                                   TRANSTYPE = 56;                      00007970
                          END;                                          00007980
                       ELSE                                             00007990
                                                                        00008000
 /* ***************************************************************** */00008010
 /* BARNET IKKE YNGSTE BARN.YNGSTE BARN HAR INDEKS = 3.               */00008020
 /* ANTALL BARN OPPDATERES .                                          */00008030
 /* ***************************************************************** */00008040
                                                                        00008050
                          DO;                                           00008060
                             TRANSTYPE = 37;                            00008070
                             B02.ANTALL_BARN(3) = B01.ANTALL_BARN(3) -1;00008080
                             DO I = 3 TO 14 WHILE                       00008090
                                (B02.FNR(I) > 0);                       00008100
                                 B02.FØRSTE_GANG_REG(I) = 'N';          00008110
                             END;                                       00008120
                          END;                                          00008130
                    END;                                                00008140
           END;                                                         00008150
     END;                                                               00008160
   L999:                                                                00008170
   EXEC CICS RETURN;                                                    00008180
 %INCLUDE R0011622; /* AJOURFØR_HISTORIKK_OM_AVDØDE_I_STATUS */         00008190
 %INCLUDE R0019913; /* F_SNU_DATO                            */         00008200
 %INCLUDE R0019924; /* KOBLE_TO_PERSONER                     */         00008210
 %INCLUDE R0019926; /* FLYTT_B01_TIL_B02                     */         00008220
 %INCLUDE R0019930; /* OPPHØR_KOBLING_AVDØD                  */         00008230
 %INCLUDE R0019942; /* F_SNU_DØDSDATO                        */         00008240
 %INCLUDE R0019967; /* RULL_FAI                              */         00008250
 %INCLUDE R0019968; /* F_RULL_FORSI                          */         00008260
 END KON_O1;                                                            00008270
