 /*       SIST ENDRET 23/05-86 10.30.56 AV   BRITT                    */00000000
 /*       SIST ENDRET 24/01-85 09.22.03 AV   LUNDEBY                  */00000010
 /*       SIST ENDRET 02/02-84 11.56.36 AV   JANKR                    */00000020
                                                                        00000030
                                                                        00000040
 /* DETTE ER ET TEST - PROGRAM FOR INNHENTING AV DATA OG BLADNING       00000050
    VED TEMP. STOR. QUEUE.    */                                        00000060
                                                                        00000070
 TESTPG: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                           00000080
                                                                        00000090
  %INCLUDE DFHBMSCA;                                                    00000100
   DCL                                                                  00000110
      TIME                BUILTIN,                                      00000120
      COMMAREA_PEKER      PTR,                                          00000130
      PTR                 PTR,                                          00000140
      BMSMAPBR            PTR;                                          00000150
                                                                        00000160
   DCL                                                                  00000170
       QUENAME CHAR(8),                                                 00000180
         TERMID CHAR(4) DEF QUENAME POS(1),                             00000190
         REST   CHAR(4) DEF QUENAME POS(5);                             00000200
                                                                        00000210
    DCL 1 INNTREC UNAL,                                                 00000220
           2 FNR             FIXED DEC (11),                            00000230
           2 TRANSTYPE       CHAR      (2),                             00000240
           2 TKNR            PIC     '9999';                            00000250
                                                                        00000260
    DCL 1 IO_INNTREC UNAL,                                              00000270
           2 TRANSKODEFILL  CHAR(5),                                    00000280
           2 FNR             PIC    '(11)9',                            00000290
           2 FILLER          CHAR    (1)   ,                            00000300
           2 TRANSTYPE       PIC       '99',                            00000310
           2 FILLER1         CHAR    (1)   ,                            00000320
           2 PT1             CHAR    (1);                               00000330
                                                                        00000340
    DCL 1 TRKLISTE UNAL,                                                00000350
           2 FILLER1         CHAR(9),                                   00000360
           2 FNR             FIXED DEC (11),                            00000370
           2 NAVN            CHAR(25),                                  00000380
           2 PENSJONSTYPE1   CHAR(1),                                   00000390
           2 PENSJONSTYPE2   CHAR(1),                                   00000400
           2 GP              FIXED DEC (5),                             00000410
           2 OS              FIXED DEC (5),                             00000420
           2 TP              FIXED DEC (5),                             00000430
           2 ET              FIXED DEC (5),                             00000440
           2 BT              FIXED DEC (5),                             00000450
           2 FORVENTET       FIXED DEC (5),                             00000460
           2 SUM_YTELSE      FIXED DEC (5),                             00000470
           2 TKNR            FIXED DEC (5),                             00000480
           2 APD_UFG         FIXED DEC (3),                             00000490
           2 ÅFT             FIXED DEC (3),                             00000500
           2 ST              FIXED DEC (5),                             00000510
           2 KT              FIXED DEC (3),                             00000520
           2 VT_GP           FIXED DEC (5),                             00000530
           2 VT_TP           FIXED DEC (5),                             00000540
           2 KONV_P_KODE     CHAR(1),                                   00000550
           2 GP_N            FIXED DEC (5),                             00000560
           2 TP_N            FIXED DEC (5),                             00000570
           2 FILLER2         CHAR(12);                                  00000580
                                                                        00000590
                                                                        00000600
     DCL 1 PIC_SRUC,                                                    00000610
           2 FNR_PIC         PIC'(11)9',                                00000620
           2 GP_PIC          PIC'(5)9',                                 00000630
           2 OS_PIC          PIC'(5)9',                                 00000640
           2 TP_PIC          PIC'(5)9',                                 00000650
           2 ET_PIC          PIC'(5)9',                                 00000660
           2 BT_PIC          PIC'(5)9',                                 00000670
           2 FORVENTET_PIC   PIC'(5)9',                                 00000680
           2 SUM_YTELSE_PIC  PIC'(5)9',                                 00000690
           2 TKNR_PIC        PIC'(4)9',                                 00000700
           2 APD_UFG_PIC     PIC'(3)9',                                 00000710
           2 ÅFT_PIC         PIC'(3)9',                                 00000720
           2 ST_PIC          PIC'(5)9',                                 00000730
           2 KT_PIC          PIC'(3)9',                                 00000740
           2 VT_GP_PIC       PIC'(5)9',                                 00000750
           2 VT_TP_PIC       PIC'(5)9',                                 00000760
           2 GP_N_PIC        PIC'(5)9',                                 00000770
           2 TP_N_PIC        PIC'(5)9';                                 00000780
                                                                        00000790
   DCL                                                                  00000800
     CHAR1   CHAR(1),                                                   00000810
                                                                        00000820
     1 CHARLIST,                                                        00000830
       2 EGEN,                                                          00000840
         3 TERMID CHAR(4),                                              00000850
         3 LDC    CHAR(2),                                              00000860
         3 OP     CHAR(3),                                              00000870
         3 STATUS CHAR(1),                                              00000880
         3 RESERV CHAR(6),                                              00000890
       2 SLUTT  FIXED BIN(15),                                          00000900
                                                                        00000910
     1 CHARLIST2,                                                       00000920
       2 PRINT,                                                         00000930
         3 TERMID CHAR(4) INIT('G11J'),                                 00000940
         3 RESERV CHAR(12) INIT(' '),                                   00000950
       2 SLUTT2,                                                        00000960
         3 SLUTT  FIXED BIN(15) INIT(-1),                               00000970
         3 RESERV CHAR(14)      INIT(' '),                              00000980
                                                                        00000990
     FNR_TAB (1000) FIXED DEC(11),                                      00001000
     PIC11   PIC'(11)9',                                                00001010
     FIXED_BIN15 FIXED BIN(15),                                         00001020
     FIXED_DEC7  FIXED DEC(7),                                          00001030
     LINJE_TELL  FIXED BIN(15),                                         00001040
     I       PIC'ZZZZ9',                                                00001050
     J           FIXED BIN(15),                                         00001060
     K       PIC'Z9',                                                   00001070
     FIX11   FIXED DEC(11) INIT(99999999999),                           00001080
     RBA_PEKER        POINTER,                                          00001090
     KEYBIT_T BIT(48) BASED (Q),                                        00001100
     KEYBIT  BIT(48) INIT((48)'0'B),                                    00001110
     KEYBIT_B  BIT(48) BASED(P),                                        00001120
     UTLINJE1 CHAR(80),                                                 00001130
     CHAR_37  CHAR(37),                                                 00001140
     1 REC100 BASED(REC_PTR),                                           00001150
       2 FILLER1    CHAR(9),                                            00001160
       2 KEY_FNR    FIXED DEC(11),                                      00001170
       2 FILLER2    CHAR(85),                                           00001180
                                                                        00001190
     CHARB   CHAR(78) BASED,                                            00001200
     MAPCHAR      CHAR(200) BASED (BMSMAPBR),                           00001210
     SIDEP   PIC'ZZZZZZZ99',                                            00001220
     LENGTH  FIXED BIN(15);                                             00001230
                                                                        00001240
  DCL                                                                   00001250
     1 INN_OMRÅDE,                                                      00001260
       2 TRANSKODEFILL  CHAR(5),                                        00001270
       2 FNR            PIC'(11)9';                                     00001280
                                                                        00001290
                                                                        00001300
   DCL                                                                  00001310
     1 COMMAREA BASED(COMMAREA_PEKER),                                  00001320
       2  SIDE         FIXED BIN(15),                                   00001330
       2  TRANSKODE    CHAR(4);                                         00001340
                                                                        00001350
   Q = ADDR(FIX11);                                                     00001360
   P = ADDR(KEY_FNR);                                                   00001370
                                                                        00001380
                                                                        00001390
  IF EIBCALEN = 0 THEN                                                  00001400
     DO;                                                                00001410
       ALLOCATE COMMAREA;                                               00001420
       SIDE = 1;                                                        00001430
     END;                                                               00001440
                                                                        00001450
    IF EIBAID ='I' THEN  /*** PF21  ****/                               00001460
        EXEC CICS ROUTE LIST (CHARLIST2);                               00001470
                                                                        00001480
   IF EIBTRNID = 'TE10' THEN                                            00001490
     DO;                                                                00001500
        LINJE_TELL  = 3;                                                00001510
        I = 1;                                                          00001520
        FIXED_BIN15 = 16;                                               00001530
        EXEC CICS RECEIVE INTO (INN_OMRÅDE) LENGTH(FIXED_BIN15);        00001540
        FIX11 = INN_OMRÅDE.FNR;                                         00001550
        EXEC CICS HANDLE CONDITION ENDFILE(GÅUT) NOTFND(GÅUT);          00001560
                                                                        00001570
                                                                        00001580
        UTLINJE1 = '     OVERSKRIFT FOR TRKLISTE SEQ - DISPLAY MED ALT';00001590
        EXEC CICS SEND TEXT FROM (UTLINJE1)  PAGING ACCUM ERASE         00001600
                                             L80 PRINT;                 00001610
        UTLINJE1 = ' ';                                                 00001620
        EXEC CICS SEND TEXT FROM(UTLINJE1) ACCUM PAGING L80 PRINT;      00001630
                                                                        00001640
    /*  EXEC CICS STARTBR DATASET('TRKLIST')  RIDFLD(KEYBIT_T);*/       00001650
        EXEC CICS STARTBR DATASET('TRKLIST')  RIDFLD(RBA_PEKER) RBA;    00001660
                                                                        00001670
        DO FIX11 = 1 TO INN_OMRÅDE.FNR;                                 00001680
                                                                        00001690
           EXEC CICS READNEXT DATASET('TRKLIST')  SET  (PTR)            00001700
                                           RBA      RIDFLD(RBA_PEKER);  00001710
        END;                                                            00001720
                                                                        00001730
     LES10:                                                             00001740
  /*    EXEC CICS READNEXT DATASET('TRKLIST')  INTO (TRKLISTE)          00001750
                                                    RIDFLD(KEYBIT_T);   00001760
   */   EXEC CICS READNEXT DATASET('TRKLIST')  INTO (TRKLISTE)          00001770
                                           RBA      RIDFLD(RBA_PEKER);  00001780
        FNR_PIC       = TRKLISTE.FNR;                                   00001790
        GP_PIC        = GP;                                             00001800
        OS_PIC        = OS;                                             00001810
        TP_PIC        = TP;                                             00001820
        ET_PIC        = ET;                                             00001830
        BT_PIC        = BT;                                             00001840
        FORVENTET_PIC = FORVENTET;                                      00001850
        SUM_YTELSE_PIC  = SUM_YTELSE;                                   00001860
        TKNR_PIC        = TRKLISTE.TKNR;                                00001870
        APD_UFG_PIC     = APD_UFG;                                      00001880
        ÅFT_PIC         = ÅFT;                                          00001890
        ST_PIC          = ST;                                           00001900
        KT_PIC          = KT;                                           00001910
        VT_GP_PIC       = VT_GP;                                        00001920
        VT_TP_PIC       = VT_TP;                                        00001930
        GP_N_PIC        = GP_N;                                         00001940
        TP_N_PIC        = TP_N;                                         00001950
                                                                        00001960
                                                                        00001970
        UTLINJE1 = FNR_PIC !! '   ' !! TRKLISTE.NAVN !! 'PENSJONSTP1: ' 00001980
                           !! PENSJONSTYPE1 !! '  PENSJONSTP2: '  !!    00001990
                              PENSJONSTYPE2;                            00002000
        CALL SEND_UTLINJE;                                              00002010
                                                                        00002020
        UTLINJE1 =                                                      00002030
                 'GP: ' !! GP_PIC !! ' ' !!                             00002040
                 'OS: ' !! OS_PIC !! ' ' !!                             00002050
                 'TP: ' !! TP_PIC !! ' ' !!                             00002060
                 'ET: ' !! ET_PIC !! ' ' !!                             00002070
                 'BT: ' !! BT_PIC !! ' ' !!                             00002080
                 'FORV: ' !! FORVENTET_PIC !! ' ' !!                    00002090
                 'S-YT: ' !! SUM_YTELSE_PIC;                            00002100
        CALL SEND_UTLINJE;                                              00002110
                                                                        00002120
        UTLINJE1 =                                                      00002130
                 'TKNR: ' !! TKNR_PIC !! ' ' !!                         00002140
                 'APD_UFG: ' !! APD_UFG_PIC !! ' ' !!                   00002150
                 'ÅFT: ' !! ÅFT_PIC !! ' ' !!                           00002160
                 'ST: ' !! ST_PIC !! ' ' !!                             00002170
                 'KT: ' !! KT_PIC !! ' ' !!                             00002180
                 'VT_GP: ' !! VT_GP_PIC !! ' ' !!                       00002190
                 'VT_TP: ' !! VT_TP_PIC;                                00002200
        CALL SEND_UTLINJE;                                              00002210
                                                                        00002220
        UTLINJE1 =                                                      00002230
                 'KONV_P_KODE: ' !! KONV_P_KODE !! ' ' !!               00002240
                 'GP_N: ' !! GP_N_PIC !! ' ' !!                         00002250
                 'TP_N: ' !! TP_N_PIC;                                  00002260
        CALL SEND_UTLINJE;                                              00002270
                                                                        00002280
        UTLINJE1 = ' ';                                                 00002290
        CALL SEND_UTLINJE;                                              00002300
                                                                        00002310
        I = I + 1;                                                      00002320
                                                                        00002330
        IF I < 100 THEN                                                 00002340
          GOTO LES10;                                                   00002350
        ELSE                                                            00002360
          GOTO GÅUT;                                                    00002370
     END;                                                               00002380
                                                                        00002390
   ELSE IF EIBTRNID = 'TE11' THEN                                       00002400
                                                                        00002410
     DO;                                                                00002420
        EXEC CICS HANDLE CONDITION ENDFILE(GÅUT) NOTFND(GÅUT);          00002430
        LINJE_TELL  = 3;                                                00002440
                                                                        00002450
                                                                        00002460
        UTLINJE1 = '     OVERSKRIFT FOR FEILMELDINGER       ';          00002470
        EXEC CICS SEND TEXT FROM (UTLINJE1)  PAGING ACCUM ERASE         00002480
                                             L80 PRINT;                 00002490
        UTLINJE1 = ' ';                                                 00002500
        EXEC CICS SEND TEXT FROM(UTLINJE1) ACCUM PAGING L80 PRINT;      00002510
                                                                        00002520
        EXEC CICS STARTBR DATASET('OMRFEIL')  RIDFLD(RBA_PEKER) RBA;    00002530
                                                                        00002540
                                                                        00002550
        DO WHILE ('A' = 'A');                                           00002560
           EXEC CICS READNEXT DATASET('OMRFEIL')  INTO (UTLINJE1)       00002570
                                           RBA      RIDFLD(RBA_PEKER);  00002580
           CALL SEND_UTLINJE;                                           00002590
        END;                                                            00002600
     END;                                                               00002610
                                                                        00002620
   ELSE IF EIBTRNID = 'TE12' THEN                                       00002630
                                                                        00002640
     DO;                                                                00002650
        FIXED_DEC7 = 0;                                                 00002660
        FIX11 = 0;                                                      00002670
                                                                        00002680
        EXEC CICS HANDLE CONDITION ENDFILE(TE12C);                      00002690
        EXEC CICS STARTBR DATASET('TRKLIST')  RIDFLD(RBA_PEKER) RBA;    00002700
                                                                        00002710
        DO WHILE ('A' = 'A');                                           00002720
           EXEC CICS READNEXT DATASET('TRKLIST')  SET  (PTR)            00002730
                                           RBA      RIDFLD(RBA_PEKER);  00002740
           FIXED_DEC7 = FIXED_DEC7 + 1;                                 00002750
                                                                        00002760
        END;                                                            00002770
                                                                        00002780
     TE12A:                                                             00002790
        PIC11 = FIXED_DEC7;                                             00002800
        UTLINJE1 = '  ANTALL RECORDS På TRKLISTE - FILE: ' !! PIC11;    00002810
        EXEC CICS SEND TEXT FROM (UTLINJE1)  PAGING ACCUM ERASE;        00002820
        GOTO GÅUT;                                                      00002830
                                                                        00002840
     TE12C:                                                             00002850
        GOTO TE12A;                                                     00002860
                                                                        00002870
     END;                                                               00002880
                                                                        00002890
   ELSE IF EIBTRNID = 'TE13' THEN                                       00002900
                                                                        00002910
     DO;                                                                00002920
        LINJE_TELL  = 2;                                                00002930
        EXEC CICS HANDLE CONDITION ENDFILE(GÅUT) NOTFND(GÅUT);          00002940
                                                                        00002950
        UTLINJE1 = '     OVERSKRIFT FOR INTENDR SEQ - DISPLAY';         00002960
        EXEC CICS SEND TEXT FROM (UTLINJE1)  PAGING ACCUM ERASE;        00002970
        UTLINJE1 = ' ';                                                 00002980
        CALL SEND_UTLINJE;                                              00002990
                                                                        00003000
        EXEC CICS STARTBR DATASET('INTEJKR')  RIDFLD(KEYBIT);           00003010
     LES1:                                                              00003020
        EXEC CICS READNEXT DATASET('INTEJKR')  INTO (INNTREC)           00003030
                                                    RIDFLD(KEYBIT);     00003040
        PIC11 = INNTREC.FNR;                                            00003050
        UTLINJE1 = PIC11 !! '   ' !! INNTREC.TRANSTYPE  !! '   '        00003060
                                       !!   INNTREC.TKNR;               00003070
        CALL SEND_UTLINJE;                                              00003080
                                                                        00003090
        GOTO LES1;                                                      00003100
     END;                                                               00003110
                                                                        00003120
   ELSE IF EIBTRNID = 'TE14' THEN                                       00003130
    DO;                                                                 00003140
        EXEC CICS HANDLE CONDITION NOTFND(GÅUT);                        00003150
        FIXED_BIN15 = 21;                                               00003160
        EXEC CICS RECEIVE INTO (IO_INNTREC) LENGTH(FIXED_BIN15);        00003170
        FIX11 = IO_INNTREC.FNR;                                         00003180
        INNTREC.FNR       = IO_INNTREC.FNR;                             00003190
        INNTREC.TRANSTYPE = IO_INNTREC.TRANSTYPE;                       00003200
                                                                        00003210
        IF IO_INNTREC.FILLER = 'D' THEN                                 00003220
           DO;                                                          00003230
                                                                        00003240
              EXEC CICS DELETE DATASET('INTEJKR')  RIDFLD(KEYBIT_T);    00003250
              UTLINJE1 =                                                00003260
                  ' FNR: '!! IO_INNTREC.FNR  !! ' ER FJERNET FRA' !!    00003270
                                                ' INTENDR - FILE';      00003280
           END;                                                         00003290
                                                                        00003300
        ELSE IF IO_INNTREC.FILLER = 'A' THEN                            00003310
           DO;                                                          00003320
                                                                        00003330
              EXEC CICS WRITE DATASET('INTEJKR')  RIDFLD(KEYBIT_T)      00003340
                                                  FROM(INNTREC);        00003350
              UTLINJE1 =                                                00003360
                  ' FNR: '!! IO_INNTREC.FNR  !! ' ER SKREVET UT PÅ' !!  00003370
                                                ' INTENDR - FILE';      00003380
           END;                                                         00003390
                                                                        00003400
        EXEC CICS SEND TEXT FROM (UTLINJE1)  PAGING ACCUM ERASE;        00003410
        EXEC CICS SEND PAGE;                                            00003420
    END;                                                                00003430
                                                                        00003440
   ELSE IF EIBTRNID = 'TE15' THEN                                       00003450
     DO;                                                                00003460
        LINJE_TELL  = 3;                                                00003470
        I = 1;                                                          00003480
        EXEC CICS HANDLE CONDITION ENDFILE(GÅUT) NOTFND(GÅUT);          00003490
                                                                        00003500
                                                                        00003510
        IF EIBAID ='I' THEN  /*** PF21  ****/                           00003520
           EXEC CICS ROUTE LIST (CHARLIST2);                            00003530
                                                                        00003540
        UTLINJE1 = '     OVERSKRIFT FOR OSLO67 SEQ - DISPLAY MED ALT';  00003550
        EXEC CICS SEND TEXT FROM (UTLINJE1)  PAGING ACCUM ERASE         00003560
                                             L80 PRINT;                 00003570
        UTLINJE1 = ' ';                                                 00003580
        EXEC CICS SEND TEXT FROM(UTLINJE1) ACCUM PAGING L80 PRINT;      00003590
                                                                        00003600
        EXEC CICS STARTBR DATASET('OSLO67')  RIDFLD(RBA_PEKER) RBA;     00003610
     LES15:                                                             00003620
        EXEC CICS READNEXT DATASET('OSLO67')  INTO (CHAR_37)            00003630
                                           RBA      RIDFLD(RBA_PEKER);  00003640
        UTLINJE1 = CHAR_37;                                             00003650
        CALL SEND_UTLINJE;                                              00003660
                                                                        00003670
                                                                        00003680
        UTLINJE1 = ' ';                                                 00003690
        CALL SEND_UTLINJE;                                              00003700
                                                                        00003710
        I = I + 1;                                                      00003720
                                                                        00003730
        IF I < 100 THEN                                                 00003740
          GOTO LES15;                                                   00003750
        ELSE                                                            00003760
          GOTO GÅUT;                                                    00003770
     END;                                                               00003780
                                                                        00003790
                                                                        00003800
  EXEC CICS RETURN;                                                     00003810
                                                                        00003820
                                                                        00003830
  SEND_UTLINJE:                                                         00003840
       PROC;                                                            00003850
                                                                        00003860
     IF LINJE_TELL = 33 THEN                                            00003870
        DO;                                                             00003880
           EXEC CICS SEND TEXT FROM (UTLINJE1)  PAGING ACCUM ERASE      00003890
                                                L80 PRINT;              00003900
           LINJE_TELL = 1;                                              00003910
        END;                                                            00003920
      ELSE                                                              00003930
        EXEC CICS SEND TEXT FROM(UTLINJE1) ACCUM PAGING L80 PRINT;      00003940
                                                                        00003950
       LINJE_TELL = LINJE_TELL + 1;                                     00003960
                                                                        00003970
                                                                        00003980
  END SEND_UTLINJE;                                                     00003990
                                                                        00004000
                                                                        00004010
                                                                        00004020
  GÅUT:                                                                 00004030
   EXEC CICS SEND PAGE ;                                                00004040
   EXEC CICS RETURN;                                                    00004050
                                                                        00004060
                                                                        00004070
                                                                        00004080
 END TESTPG;                                                            00004090
