 /*       SIST ENDRET 08/09-87 12.08.00 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 28/07-83 07.08.44 AV   FARVIK                   */00000010
 /*       SIST ENDRET 06/10-82 13.22.59 AV   JANKR                    */00000020
 /*       SIST ENDRET 05/05-82 10.30.42 AV   KRISTENSEN               */00000030
 /* ***************************************************************** */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /*    R0019921 - FEIL_ML - HOVEDPROGRAM  I CICS/PLI.                 */00000060
 /*    PROGRAMMERER: KRISTENSEN, MAI 1982.                            */00000070
 /*    ENDRET AV DYBVIK JULI 1987.                                    */00000080
 /*HENSIKT:                                                           */00000090
 /*    PROGRAMMET HENTER UT EN FEILMELDING FRA FEILMELDINGS - BASEN   */00000100
 /*    PÅ GRUNNLAG AV ET FEILMELDINGSNUMMER.                          */00000110
 /*PROGRAMTILKNYTNING:                                                */00000120
 /*    PROGRAMMET BLIR LINKET TIL FRA SKRIV_FEIL SOM ER INTERN PROC   */00000130
 /*    I DIALOG - PROGRAMMENE.                                        */00000140
 /*BRUK:                                                              */00000150
 /*    EXEC CICS LINK PROGRAM ('R0019921') COMMAREA(FEIL_STRUC);      */00000160
 /* ***************************************************************** */00000170
 FEIL_ML: PROC(FEILM_COMMAREA_PEKER) OPTIONS(MAIN);                     00000180
 %PAGE;                                                                 00000190
 %INCLUDE P0019908;   /* HOVED KOM_OMR BASED  */                        00000200
 %PAGE;                                                                 00000210
 /*NCLUDE P0019962*/  /* COPY-OMR FOR FEILTAB */                        00000220
 %PAGE;                                                                 00000230
 %INCLUDE P0012002;   /* PCB - PEKER - OMR    */                        00000240
    DCL                                                                 00000250
      1 FEILTAB,                                                        00000260
        2 FEILNUMMER            CHAR(4),                                00000270
        2 FEILBLANK             CHAR(1),                                00000280
        2 FEILMELDING           CHAR(73);                               00000290
    DCL                                                                 00000300
      NR1 DEF FEILNUMMER POS(2) CHAR(3),                                00000310
      NR2 DEF FEILNUMMER POS(3) CHAR(2),                                00000320
      NR3 DEF FEILNUMMER POS(4) CHAR(1),                                00000330
      FEILM_COMMAREA_PEKER             POINTER,                         00000340
                                                                        00000350
      1 FEIL_STRUC           BASED(FEILM_COMMAREA_PEKER),               00000360
        2 FEIL_NR          FIXED DEC      (5),                          00000370
        2 FEIL_MELDING           CHAR(78),                              00000380
        2 COMMAREA_PEKER         POINTER,                               00000390
      W01_FEIL                   PIC'9999',                             00000400
                                                                        00000410
      (NULL,ADDR,CSTG,LOW,SUBSTR,UNSPEC)     BUILTIN;                   00000420
                                                                        00000430
       /* HER STARTER EKSEKVERING             */                        00000440
                                                                        00000450
                                                                        00000460
      EXEC CICS HANDLE CONDITION NOTFND (NOT_FOUND);                    00000470
                                                                        00000480
      W01_FEIL            = FEIL_NR;                                    00000490
                                                                        00000500
            EXEC CICS READ DATASET ('FEILTAB')                          00000510
                INTO (FEILTAB)                                          00000520
                RIDFLD (W01_FEIL);                                      00000530
                                                                        00000540
      IF SUBSTR(FEILNUMMER,1,3) = '000' THEN                            00000550
         FEIL_MELDING = NR3!!FEILBLANK!!FEILMELDING;                    00000560
      ELSE                                                              00000570
         IF SUBSTR(FEILNUMMER,1,2) = '00' THEN                          00000580
            FEIL_MELDING = NR2!!FEILBLANK!!FEILMELDING;                 00000590
         ELSE                                                           00000600
            IF SUBSTR(FEILNUMMER,1,1) = '0' THEN                        00000610
               FEIL_MELDING = NR1!!FEILBLANK!!FEILMELDING;              00000620
            ELSE                                                        00000630
               FEIL_MELDING = FEILNUMMER!!FEILBLANK!!FEILMELDING;       00000640
 NOT_FOUND:                                                             00000650
                                                                        00000660
                                                                        00000670
   EXEC CICS RETURN;                                                    00000680
                                                                        00000690
 END FEIL_ML;                                                           00000700
