 /*       SIST ENDRET 08/02-83 17.00.59 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 08/02-83 16.55.21 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 03/02-83 17.46.25 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 03/02-83 10.12.29 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 31/01-83 08.46.15 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 28/01-83 15.01.17 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 28/01-83 08.06.56 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 27/01-83 14.19.02 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 25/01-83 10.06.26 AV   OLSEN                    */00000080
 /*       SIST ENDRET 20/01-83 13.36.48 AV   OLSEN                    */00000090
 /*       SIST ENDRET 18/01-83 12.10.40 AV   OLSEN                    */00000100
  /* *************************************************************** */ 00000110
  /* IDENTIFIKASJON:   R0017046 - PROSEDYRE I PLI                    */ 00000120
  /* PROGRAMMERER:  JAN, JANUAR 1983                                 */ 00000130
  /* HENSIKT:                                                        */ 00000140
  /*        LEGGER INFORMASJON FRA B02 OVER I ET BER-VEDL-SEGMENT    */ 00000150
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */ 00000160
  /*        HVER AJOURFØRT TRANSAKSJON.                              */ 00000170
  /* PROGRAMTILKNYTNING:                                             */ 00000180
  /*        PROGRAMMET INKLUDERES I  R0017001                        */ 00000190
  /* BRUK:                                                           */ 00000200
  /*        CALL BYGG_OPP_BERVEDL_SEGMENT(IND,EKIND)                 */ 00000210
  /* *************************************************************** */ 00000220
  BYGG_OPP_BERVEDL_SEGMENT:                                             00000230
    PROC(IND,EKIND);                                                    00000240
                                                                        00000250
    DCL IND   FIXED BIN (15);                                           00000260
    DCL EKIND FIXED BIN (15);                                           00000270
                                                                        00000280
  /* *************************************************************** */ 00000290
  /*   PROGRAMMET BEGYNNER HER. VI BLANKER W_BERVEDL                 */ 00000300
  /* *************************************************************** */ 00000310
                                                                        00000320
                                                                        00000330
    W_BERVEDL               = '';                                       00000340
    W_BERVEDL.PÅ            = POTALL_OPPL.POREKKE.PÅ(IND);              00000350
    W_BERVEDL.OPT           = POTALL_OPPL.POREKKE.OPT(IND);             00000360
    W_BERVEDL.SPT           = POTALL_OPPL.POREKKE.SPT(IND);             00000370
    W_BERVEDL.ÅR_BUP_FPP    = POTALL_OPPL.POREKKE.BUP_FPP_ÅR(IND);      00000380
    W_BERVEDL.VENTEFAKTOR   = B02.VENTEFAKTOR(IND);                     00000390
    W_BERVEDL.PÅ_EK         = POTALL_OPPL.POREKKE.PÅ(EKIND);            00000400
    W_BERVEDL.OPT_EK        = POTALL_OPPL.POREKKE.OPT(EKIND);           00000410
    W_BERVEDL.SPT_EK        = POTALL_OPPL.POREKKE.SPT(EKIND);           00000420
    W_BERVEDL.ÅR_BUP_FPP_EK = POTALL_OPPL.POREKKE.BUP_FPP_ÅR(EKIND);    00000430
                                                                        00000440
                                                                        00000450
    CALL INSERT_BERVEDL;                                                00000460
    EXEC CICS SEND TEXT FROM  (W_BERVEDL.SPT) ACCUM;                    00000470
    IF W_BERVEDL.SPT > 0 THEN                                           00000480
       DO;                                                              00000490
          CALL BYGG_OPP_BERGRUNL_SEGMENT(IND);                          00000500
          HJC = 'GRU';                                                  00000510
          EXEC CICS SEND TEXT FROM (HJC) ACCUM;                         00000520
       END;                                                             00000530
                                                                        00000540
  /* *************************************************************** */ 00000550
  /*   DERSOM AVDØDE ER EKTEFELLE                                    */ 00000560
  /* *************************************************************** */ 00000570
                                                                        00000580
    EXEC CICS SEND TEXT FROM  (IND) ACCUM;                              00000590
    EXEC CICS SEND TEXT FROM  (EKIND) ACCUM;                            00000600
    EXEC CICS SEND TEXT FROM  (B02.PENSJONSTYPE1(IND)) ACCUM;           00000610
    EXEC CICS SEND TEXT FROM  (B02.PENSJONSTYPE1(EKIND)) ACCUM;         00000620
    IF (B02.PENSJONSTYPE1(IND) = 'E' &                                  00000630
        B02.PENSJONSTYPE1(EKIND) = 'D' ) !                              00000640
       W_BERVEDL.SPT_EK       >  0   THEN                               00000650
        DO;                                                             00000660
           CALL BYGG_OPP_BERGRUNL_SEGMENT_DØD(EKIND);                   00000670
           HJC = 'DEP';                                                 00000680
           EXEC CICS SEND TEXT FROM (HJC) ACCUM;                        00000690
        END;                                                            00000700
                                                                        00000710
  /* *************************************************************** */ 00000720
  /*   BARNEPENJON EN ELLER BEGGE FORELDRE DØDE                      */ 00000730
  /* *************************************************************** */ 00000740
                                                                        00000750
    IF  B02.PENSJONSTYPE1(IND) = 'B' !                                  00000760
        B02.PENSJONSTYPE1(IND) = 'N' THEN                               00000770
        DO;                                                             00000780
                                                                        00000790
  /* *************************************************************** */ 00000800
  /*   AVDØDE ER FAR                                                 */ 00000810
  /* *************************************************************** */ 00000820
                                                                        00000830
           IF B02.PENSJON_ETTER(IND) = 'F' THEN                         00000840
              DO;                                                       00000850
                 EKIND = 2;                                             00000860
                 CALL BYGG_OPP_BERGRUNL_SEGMENT_DØD(EKIND);             00000870
                 HJC = 'FAR';                                           00000880
                 EXEC CICS SEND TEXT FROM (HJC) ACCUM;                  00000890
              END;                                                      00000900
                                                                        00000910
  /* *************************************************************** */ 00000920
  /*   AVDØDE ER MOR                                                 */ 00000930
  /* *************************************************************** */ 00000940
                                                                        00000950
           IF B02.PENSJON_ETTER(IND) = 'M' THEN                         00000960
              DO;                                                       00000970
                 EKIND = 1;                                             00000980
                 CALL BYGG_OPP_BERGRUNL_SEGMENT_DØD(EKIND);             00000990
                 HJC = 'MOR';                                           00001000
                 EXEC CICS SEND TEXT FROM (HJC) ACCUM;                  00001010
              END;                                                      00001020
        END;                                                            00001030
  END  BYGG_OPP_BERVEDL_SEGMENT;                                        00001040
                                                                        00001050
