 /*       SIST ENDRET 05/12-97 12.46.39 AV   JDA7339                  */00000000
 /*       SIST ENDRET 27/11-97 11.51.58 AV   JDA7339                  */00000010
 /*       SIST ENDRET 29/08-97 12.31.17 AV   JDA7339                  */00000020
 /*       SIST ENDRET 28/08-97 08.55.00 AV   SPA7339                  */00000030
 /*       SIST ENDRET 31/01-97 14.03.30 AV   JDA0310                  */00000040
 /*       SIST ENDRET 01/09-95 10.43.09 AV   TSB0310                  */00000050
 /*       SIST ENDRET 19/09-94 11.21.21 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 11/02-94 15.25.20 AV   TRUDE                    */00000070
 /*       SIST ENDRET 02/12-93 10.49.44 AV   TRUDE                    */00000080
 /*       SIST ENDRET 23/09-93 13.07.02 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 17/12-92 12.45.54 AV   TRUDE                    */00000100
 /*       SIST ENDRET 12/06-92 13.54.51 AV   TRUDE                    */00000110
 /*       SIST ENDRET 19/03-92 13.59.19 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 17/02-92 14.57.15 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 13/01-92 14.15.02 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 03/01-92 14.15.12 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 13/12-91 12.59.33 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 26/04-91 12.25.26 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 21/01-91 14.18.50 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 11/12-90 13.29.10 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 05/07-90 09.32.48 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 12/10-89 09.41.15 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 18/08-89 08.43.54 AV   HERMAN                   */00000220
 /*       SIST ENDRET 14/04-89 14.51.20 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 28/01-88 15.10.23 AV   DYBVIK                   */00000240
 /*       SIST ENDRET 26/01-88 08.53.38 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 17/03-87 13.01.17 AV   DYBVIK                   */00000260
 /*       SIST ENDRET 30/01-85 08.46.40 AV   KARIN                    */00000270
 /*       SIST ENDRET 28/08-84 13.42.39 AV   KARIN                    */00000280
 /*       SIST ENDRET 13/06-84 14.05.14 AV   OLAV                     */00000290
 /*       SIST ENDRET 17/02-84 09.26.11 AV   HERMAN                   */00000300
 /*       SIST ENDRET 21/11-83 14.31.51 AV   OLAV                     */00000310
 /*       SIST ENDRET 19/09-83 09.07.12 AV   OLAV                     */00000320
 /* **************************************************************** */ 00000330
 /*IDENTIFIKASJON:                                                   */ 00000340
 /*    R0014201 - HOVEDPROGRAM I PLI                                 */ 00000350
 /*    PROGRAMMERER:              R.FARVIK,APRIL -82.                */ 00000360
 /*HENSIKT:                                                          */ 00000370
 /*    BEREGNE ALDERSPENSJON.                                        */ 00000380
 /*                                                                  */ 00000390
 /*PROGRAMTILKNYTNING:                                               */ 00000400
 /*    KALLES OPP AV PROGRAM R0013520                                */ 00000410
 /*BRUK:                                                             */ 00000420
 /*    EXEC CICS XCTL PROGRAM ('R0014201') COMMAREA (KOM_OMR)        */ 00000430
 /*                                                                  */ 00000440
 /* **************************************************************** */ 00000450
 %PAGE;                                                                 00000460
 R001421:                                                               00000470
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000480
 %PAGE;                                                                 00000490
      %INCLUDE P0019906;  /*TRANS_OPPL_OMR BASED(TRANS_OPPL_PEKER)*/    00000500
      %INCLUDE P0019908;  /*KOM_OMR        BASED(COMMAREA_PEKER)  */    00000510
      %INCLUDE P0019910;  /*STYRINGS_OMR   BASED(STYRINGS_PEKER)  */    00000520
      %INCLUDE P0019912;  /*DIV_PARAM_OMR  BASED(DIV_PARAM_PEKER) */    00000530
      %INCLUDE P0019924;  /*GV_TAB_RE      BASED(GV_PEKER)        */    00000540
      %INCLUDE P0014002;  /*W_POREKKE*/                                 00000550
      %INCLUDE P0014003;  /*TAB*/                                       00000560
      %INCLUDE P0014009;  /*POTALL_OPPL    BASED(PO_PEKER)        */    00000570
 %PAGE;                                                                 00000580
   DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                       00000590
 %PAGE;                                                                 00000600
   DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                       00000610
 %PAGE;                                                                 00000620
   DCL                                                                  00000630
      (CSTG,DATE,ROUND,SUBSTR,SUM) BUILTIN,                             00000640
      HJ_DATO                             CHAR     (6),                 00000650
      HJ_DATO_ÅR DEF HJ_DATO      POS (1) PIC      '(2)9',              00000660
      APD_ØNSKET                          FIXED DEC(3),                 00000670
      MAX_ÅR                              PIC      '(2)9',              00000680
      ALDER_ÅM                            PIC      '(4)9',              00000690
      ALDER_ÅM_IDAG                       PIC      '(4)9',              00000700
      ÅR_ALDER_IDAG DEF ALDER_ÅM_IDAG  POS (1) PIC '(2)9';              00000710
   DCL                                                                  00000720
    1 W_FNR                               PIC      '(11)9';             00000730
   DCL                                                                  00000740
    1 FNR_R DEF W_FNR,                                                  00000750
      2 DAG                   PIC '(2)9',                               00000760
      2 MND                   PIC '(2)9',                               00000770
      2 ÅR                    PIC '(2)9',                               00000780
      2 ÅRHUNDRE              PIC '9',                                  00000790
      2 FILLER                PIC '(4)9';                               00000800
   DCL                                                                  00000810
    1 FNR_ÅM,                                                           00000820
      2 FNR_Å                 PIC '(2)9',                               00000830
      2 FNR_M                 PIC '(2)9';                               00000840
   DCL W_FNR_R  LIKE FNR_R;  /*NY92*/                                   00000850
                                                                        00000860
   DCL  VIRKDATO_MÅ           PIC '(4)9';                               00000870
   DCL  VIRKDATO_ÅR DEF VIRKDATO_MÅ POS (3) PIC '(2)9';                 00000880
                                                                        00000890
   DCL W_SUM_YTELSE           FIXED DEC(7);   /*NY92*/                  00000900
   DCL AP_TEI                 FIXED DEC(7);   /*NY92*/                  00000910
                                                                        00000920
   DCL                                                                  00000930
    1 FNR_ÅM_NUM DEF FNR_ÅM POS (1) PIC '(4)9';                         00000940
                                                                        00000950
   DCL W_FNR_ÅM       PIC '(4)9';                                       00000960
                                                                        00000970
   DCL ST_BEREGNET(2)  CHAR (1) INIT (' ');                             00000980
                                                                        00000990
   DCL                                                                  00001000
    1 DATO                    CHAR (6),                                 00001010
    1 HJ_MÅ                   PIC '(4)9';                               00001020
   DCL                                                                  00001030
    1 DAGENS_DATO DEF DATO POS(1),                                      00001040
      2 ÅR                    PIC '(2)9',                               00001050
      2 MND                   PIC '(2)9',                               00001060
      2 DAG                   PIC '(2)9';                               00001070
   DCL                                                                  00001080
    1 COMMAREA_PEKER          POINTER;                                  00001090
 %PAGE;                                                                 00001100
 /* ***************************************************************** */00001110
 /* PROGRAMMET STARTER HER                                            */00001120
 /* ***************************************************************** */00001130
  ST_BEREGNET(1)  = ' ';                                                00001140
  ST_BEREGNET(2)  = ' ';                                                00001150
                                                                        00001160
  W_POREKKE = '';                                                       00001170
  B02.AFP_TILLEGG(BER_SØ_IND)  = 0;     /*TRUDE 1292*/                  00001180
  B02.PENSJONSTYPE3(BER_SØ_IND) = ' ';   /*TRUDE 190994*/               00001190
                                                                        00001200
        APD_HLTEST = B02.ALDERSP.APD(BER_SØ_IND);        /*NB*/         00001210
        DATO  = DATE;                                                   00001220
        W_FNR = B02.FNR(BER_SØ_IND);                                    00001230
        HJ_MÅ = DAGENS_DATO.MND * 100 + DAGENS_DATO.ÅR;                 00001240
   DCL F_DATO  PIC '(4)9';                                              00001250
   W_FNR_ÅM =  FNR_R.ÅR!!FNR_R.MND;                                     00001260
                                                                        00001270
 /* ***************************************************************** */00001280
 /* BEREGN DEL1 AV ALDERSPENSJONEN.                                   */00001290
 /* ***************************************************************** */00001300
                                                                        00001310
    /* ************************************************************** */00001320
    /* IKKE SAMMENSTØTENDE BEREGNING NÅR EK HAR 0 APD                 */00001330
    /* ************************************************************** */00001340
                                                                        00001350
    IF B02.PENSJONSTYPE1(BER_EK_IND) = 'A'      !                       00001360
 /*AFP*/     (  B02.PENSJONSTYPE1(BER_EK_IND) = 'K'      &              00001370
 /*AFP*/        B02.PENSJONSTYPE2(BER_EK_IND) ^= 'N'  )  THEN           00001380
       DO;                                                              00001390
          IF B02.ALDERSP.APD  (BER_EK_IND) =  0   &                     00001400
             B02.SUM_YTELSE(BER_EK_IND)    =  0    THEN     /*NY92*/    00001410
             DO;                                                        00001420
                IF B02.PENSJONSTYPE2(BER_EK_IND)  = 'S'   &             00001430
                   B02.KONV_P_KODE  (BER_EK_IND) ^= 'F'   &             00001440
                   B02.P67_KODE  (BER_EK_IND) ^= '5'   THEN   /*HL*/    00001450
                                                                        00001460
         /*------DETTE LÅ PÅ TEST. VET IKKE HVORFOR. TRUDE -----        00001470
         P67_KODE = 5 DVS KONV ET, ELLER UFG < 100 OG DATO >9200        00001480
                   NULLPENSJON                                          00001490
                IF B02.PENSJONSTYPE2(BER_EK_IND)  = 'S'   THEN          00001500
                   IF  B02.KONV_P_KODE(BER_EK_IND) ^= 'F'   &           00001510
                       B02.P67_KODE (BER_EK_IND)   ^= '5'   THEN        00001520
          ------------------------- */                                  00001530
                   DO;                                                  00001540
                      B02.PENSJONSTYPE2(BER_SØ_IND)  = 'P';             00001550
                      B02.PENSJONSTYPE2(BER_EK_IND)  = 'P';             00001560
                   END;                                                 00001570
             END;                                                       00001580
                                                                        00001590
          ELSE                                                          00001600
                                                                        00001610
             DO;                                                        00001620
                IF (B02.SIVILSTAND   (BER_EK_IND)  = 'G'  !             00001630
                    B02.SIVILSTAND   (BER_EK_IND)  = 'P'  !             00001640
                    B02.SIVILSTAND   (BER_EK_IND)  = 'W')      &        00001650
                   B02.PENSJONSTYPE2(BER_SØ_IND)  = 'P'  &              00001660
                   B02.PENSJONSTYPE2(BER_EK_IND)  = 'P'    THEN         00001670
                                                                        00001680
                   DO;                                                  00001690
                      B02.PENSJONSTYPE2(BER_SØ_IND)  = 'S';             00001700
                      B02.PENSJONSTYPE2(BER_EK_IND)  = 'S';             00001710
  /*AFP1093*/         IF B02.PENSJONSTYPE3(BER_EK_IND) = 'S' THEN       00001720
                         B02.PENSJONSTYPE2(BER_SØ_IND)  = 'P';          00001730
                   END;                                                 00001740
             END;                                                       00001750
       END;                                                             00001760
                                                                        00001770
    ELSE                                                                00001780
                                                                        00001790
 /*YS*/IF (B02.PENSJONSTYPE1(BER_EK_IND)  = 'U'   !                     00001800
 /*YS*/    B02.PENSJONSTYPE1(BER_EK_IND)  = 'Y')  &                     00001810
           (B02.SIVILSTAND   (BER_EK_IND)  = 'G'  !                     00001820
            B02.SIVILSTAND   (BER_EK_IND)  = 'P'  !                     00001830
            B02.SIVILSTAND   (BER_EK_IND)  = 'W')      &                00001840
          B02.PENSJONSTYPE2(BER_SØ_IND)  = 'P'  &                       00001850
          B02.PENSJONSTYPE2(BER_EK_IND)  = 'P'    THEN                  00001860
                                                                        00001870
          DO;                                                           00001880
             B02.PENSJONSTYPE2(BER_SØ_IND)  = 'S';                      00001890
             B02.PENSJONSTYPE2(BER_EK_IND)  = 'S';                      00001900
          END;                                                          00001910
                                                                        00001920
 /* ***************************************************************** */00001930
 /* BEREGN SØKERS ALDER PÅ VIRKNINGSDATOTIDSPKT.                      */00001940
 /* ***************************************************************** */00001950
                                                                        00001960
        DCL VIRK_TEST   FIXED DEC (5) INIT (0);                         00001970
        VIRK_TEST =  TRANS_OPPL_OMR.VIRKNINGSDATO;                      00001980
        ALDER_ÅM = F_ALDER(W_FNR,                                       00001990
                               TRANS_OPPL_OMR.VIRKNINGSDATO);           00002000
                                                                        00002010
        CALL BEREGN_AP_DEL1;                         /* 4221 */         00002020
        DCL APD_HLTEST    PIC '999';                                    00002030
        APD_HLTEST = B02.ALDERSP.APD(BER_SØ_IND);        /*NB*/         00002040
                                                                        00002050
        IF FEIL_MELD_NR > 0  THEN                                       00002060
           GO TO L999;                                                  00002070
        ELSE                                                            00002080
           PROGRAM_ID = 'R0014201';                                     00002090
                                                                        00002100
                                                                        00002110
 /* ***************************************************************** */00002120
 /* BEREGN SØKERS ALDER IDAG.                                         */00002130
 /* ***************************************************************** */00002140
                                                                        00002150
        HJ_DATO = DATE;                                                 00002160
        ALDER_ÅM_IDAG = F_ALDER(W_FNR,HJ_MÅ);                           00002170
        IF (HJ_DATO_ÅR > 81)THEN                                        00002180
           MAX_ÅR  = HJ_DATO_ÅR - 02;                                   00002190
        ELSE                                                            00002200
           MAX_ÅR  = HJ_DATO_ÅR - 02 + 100;                             00002210
                                                                        00002220
 /* ***************************************************************** */00002230
 /* FØLENDE SELECT REPRESENTERER DEL2 AV PENSJONSBEREGNINGEN.         */00002240
 /* DEL2 ER NEMLIG IKKE AKTUELL FOR ALLE TRANSTYPER.                  */00002250
 /* ***************************************************************** */00002260
                                                                        00002270
 /*LOVENDRING PR. 1.1.91 HL : */                                        00002280
                                                                        00002290
        VIRKDATO_MÅ = TRANS_OPPL_OMR.VIRKNINGSDATO;                     00002300
    IF ( W_FNR_ÅM   < 2501 &                                /*NY92*/    00002310
         FNR_R.ÅRHUNDRE  < 5  )  !                          /*NY92*/    00002320
         FNR_R.ÅRHUNDRE  > 6     !                          /*NY92*/    00002330
       (B02.KONV_P_KODE(BER_SØ_IND) = 'K' &             /*NY92*/        00002340
        B02.UTTAKSDATO_ÅM(BER_SØ_IND) < 9200) THEN      /*NY92*/        00002350
      DO;                                                               00002360
 /*     IF (ALDER_ÅM < 7000 & ÅR_ALDER_IDAG < MAX_ÅR) THEN      */      00002370
        IF (ALDER_ÅM < 7000 & VIRKDATO_ÅR < 91)   !                     00002380
           (ALDER_ÅM < 7001 & VIRKDATO_ÅR > 90)     THEN                00002390
           SELECT (TRANSTYPE);                                          00002400
                                                                        00002410
 /* ***************************************************************** */00002420
 /* GRUNNBLANKETT ALDER.                                              */00002430
 /* ***************************************************************** */00002440
                                                                        00002450
              WHEN (1)                                                  00002460
                 DO;                                                    00002470
                   IF TRANS_OPPL_OMR.BLANKETTYPE =  'AP'  THEN          00002480
                      CALL HENT_FRA_AP;                                 00002490
                   IF TRANS_OPPL_OMR.BLANKETTYPE =  'A1'  THEN          00002500
                      CALL HENT_FRA_A1;                                 00002510
                     CALL BEREGN_APD(APD_ØNSKET);            /* 4122 */ 00002520
                                                                        00002530
                 END;                                                   00002540
                                                                        00002550
 /* ***************************************************************** */00002560
 /* NY FORSØRGINGSTILLEGGS-BLANKETT - MED ARBEIDSINNTEKT              */00002570
 /* ***************************************************************** */00002580
                                                                        00002590
              WHEN (6)                                                  00002600
                 DO;                                                    00002610
                   IF B02.VIRK_DATO_ÅM(BER_SØ_IND) > 9104 THEN          00002620
                       CALL BEREGN_APD(100);        /* 4122 */          00002630
                 END;                                                   00002640
                                                                        00002650
                                                                        00002660
 /* ***************************************************************** */00002670
 /* ENDRINGSBLANKETT-ENDRING I GRAD ELLER FAI.                        */00002680
 /* ***************************************************************** */00002690
                                                                        00002700
              WHEN (8)                                                  00002710
                 DO;                                                    00002720
                     IF TRANS_OPPL_OMR.BLANKETTYPE  = 'EN'  THEN        00002730
                        CALL BEREGN_APD(100);            /* 4122 */     00002740
                     ELSE                                               00002750
                       DO;                                              00002760
                          CALL HENT_FRA_E1;                             00002770
                          CALL BEREGN_APD(APD_ØNSKET);    /* 4122 */    00002780
                       END;                                             00002790
                 END;                                                   00002800
                                                                        00002810
 /* ***************************************************************** */00002820
 /* AUTOMATISK OVERGANG FRA UP/YP TIL AP ETTER FYLTE 67 ÅR.           */00002830
 /* ***************************************************************** */00002840
                                                                        00002850
              WHEN (24)                                                 00002860
                 DO;                                                    00002870
                     CALL BEREGN_APD_OVERGANG_FRA_UP;       /* 4123 */  00002880
                                                                        00002890
 /*YS*/              IF B01.PENSJONSTYPE1(BER_SØ_IND) = 'Y' THEN        00002900
 /*YS*/                CALL BEREGN_APD_OVERGANG_FRA_YP;    /* 4127 */   00002910
                                                                        00002920
                 END;                                                   00002930
                        /*TRANSTYPE=33 ETTERLATT FAMILIEPLEIER*/        00002940
              WHEN (33)                                                 00002950
                 DO;                                                    00002960
                                                                        00002970
  /* LOVENDRING PR 1.4.84      *             *         * */             00002980
                                                                        00002990
                     IF B02.STATUS.VIRK_DATO_ÅM(BER_SØ_IND) > 8403 THEN 00003000
                       DO;                                              00003010
                          APD_ØNSKET = 100;                             00003020
                          CALL BEREGN_APD(APD_ØNSKET);      /* 4122 */  00003030
                       END;                                             00003040
                                                                        00003050
  /* HIT    *       *          *         *        *      */             00003060
                                                                        00003070
                                                                        00003080
                    CALL BEREGN_APD_OVERGANG_FRA_KAP10;   /*R0014124*/  00003090
                 END;                                                   00003100
              OTHERWISE                                                 00003110
                 DO;                                                    00003120
                        /* ENDRING MARS 92.  DERSOM B02.APD > 0     */  00003130
                        /* LEGGES B02.APD INN I ØNSKET_APD.         */  00003140
                        /* VED Å LEGGE 100 INN I APD ØNSKET, FÅR    */  00003150
                        /* IKKE DE VENTETILLEGG SOM BARE ØNSKER Å   */  00003160
                        /* TA UT DELEPENSJON FØR 0484               */  00003170
                        /*TRUDE 180392                              */  00003180
                                                                        00003190
                    IF  B02.ALDERSP.APD(BER_SØ_IND) > 0   &      /*TS*/ 00003200
                        B02.STATUS.VIRK_DATO_ÅM(BER_SØ_IND) < 8404 THEN 00003210
                       APD_ØNSKET = B02.ALDERSP.APD(BER_SØ_IND); /*TS*/ 00003220
                    ELSE                                         /*TS*/ 00003230
                       APD_ØNSKET = 100;                                00003240
                    CALL BEREGN_APD(APD_ØNSKET);      /* 4122 */        00003250
                 END;                                                   00003260
           END;                                                         00003270
        ELSE                                                            00003280
           CALL APD_70ÅR;                                 /* 4125 */    00003290
                                                                        00003300
 /* ***************************************************************** */00003310
 /* DEL3 AV ALDERSPENSJONEN BEREGNES.                                 */00003320
 /* ***************************************************************** */00003330
                                                                        00003340
      END;                                                              00003350
        CALL BEREGN_AP_DEL3;                              /* 4222 */    00003360
 /* */                                                                  00003370
                                                                        00003380
 HENT_FRA_AP: PROC;                                                     00003390
   %INCLUDE P0010501;  /* AP-OMRÅDE                */                   00003400
      APD_ØNSKET = APS.APD;                                             00003410
 END HENT_FRA_AP;                                                       00003420
                                                                        00003430
 HENT_FRA_A1: PROC;                                                     00003440
   %INCLUDE P001N501;  /* A1-OMRÅDE                */                   00003450
      APD_ØNSKET = A1S.APD;                                             00003460
 END HENT_FRA_A1;                                                       00003470
                                                                        00003480
 HENT_FRA_E1: PROC;                                                     00003490
   %INCLUDE P0011401;  /* E1-OMRÅDE                */                   00003500
     APD_ØNSKET = E1K7.APD;                                             00003510
 END HENT_FRA_E1;                                                       00003520
                                                                        00003530
        %INCLUDE R0014221;      /* BEREGN_AP_DEL1              */       00003540
  %PAGE;                                                                00003550
        %INCLUDE R0014231;      /* BEREGN TP_AP                */       00003560
  %PAGE;                                                                00003570
        %INCLUDE R0014233;      /* BEREGN BT (BARNETILLEGG)    */       00003580
        %INCLUDE R0014244;      /* JUSTER_AP_40PROS            */       00003590
  %PAGE;                                                                00003600
        %INCLUDE R0014153;      /* BEREGN_SPT_OPT_PÅ           */       00003610
  %PAGE;                                                                00003620
        %INCLUDE R0014156;      /* BEREGN_SPT_OPT_PÅ_ALT       */       00003630
  %PAGE;                                                                00003640
        %INCLUDE R0014143;      /* POENG_TILLEGG               */       00003650
  %PAGE;                                                                00003660
        %INCLUDE R0014232;      /* BEREGN GP_AP                */       00003670
  %PAGE;                                                                00003680
 /*YS*/ %INCLUDE R0014241;      /* BEREGN_AP_OVERGANG_FRA_YP   */       00003690
  %PAGE;                                                                00003700
 /*YS*/ %INCLUDE R0014242;      /* POENGTILLEGG_ENDRES_YP      */       00003710
  %PAGE;                                                                00003720
        %INCLUDE R0014145;      /* REGN_TT_67_TIL_70           */       00003730
        /* CALLES I R0014232                                   */       00003740
  %PAGE;                                                                00003750
                                                                        00003760
        %INCLUDE R0014122;      /* BEREGN_APD                  */       00003770
  %PAGE;                                                                00003780
        %INCLUDE R0014135;      /* TIDLIGERE_ARBEIDSINNTEKT    */       00003790
  %PAGE;                                                                00003800
        %INCLUDE R0014136;      /* ÅTTI_PROSENT_REGELEN        */       00003810
  %PAGE;                                                                00003820
        %INCLUDE R0014146;      /* FAI_GRENSER                 */       00003830
  %PAGE;                                                                00003840
        %INCLUDE R0014155;      /* FAI_GRENSER_FRAVIK          */       00003850
  %PAGE;                                                                00003860
        %INCLUDE R0014147;      /* FRAVIK_80%                  */       00003870
                                                                        00003880
  %PAGE;                                                                00003890
        %INCLUDE R0014123;      /* BEREGN_APD_OVERGANG_FRA_UP  */       00003900
  %PAGE;                                                                00003910
        %INCLUDE R0014124;      /* BEREGN_APD_OVERGANG_FRA_KAP10 */     00003920
  %PAGE;                                                                00003930
        %INCLUDE R0014125;      /* APD_70ÅR                    */       00003940
  %PAGE;                                                                00003950
 /*YS*/ %INCLUDE R0014127;      /* BEREGN_APD_OVERGANG_FRA_YP  */       00003960
  %PAGE;                                                                00003970
                                                                        00003980
        %INCLUDE R0014222;      /* BEREGN_AP_DEL3              */       00003990
  %PAGE;                                                                00004000
        %INCLUDE R0014137;      /* JUSTER_MED_APD              */       00004010
  %PAGE;                                                                00004020
        %INCLUDE R0014138;      /* BEREGN_VT                   */       00004030
  %PAGE;                                                                00004040
                                                                        00004050
        %INCLUDE R0014142;      /* F_TILLEGGSPENSJON           */       00004060
  %PAGE;                                                                00004070
        %INCLUDE R0014133;      /* F_BEREGN_SÆRTILLEGG         */       00004080
  %PAGE;                                                                00004090
        %INCLUDE R0014134;      /* F_BEREGN_KOMPTILLEGG        */       00004100
  %PAGE;                                                                00004110
        %INCLUDE R0014180;      /* SÆRTILLEGG_UTLAND           */       00004120
  %PAGE;                                                                00004130
        %INCLUDE R0014181;      /* F_ET_UTLAND                 */       00004140
  %PAGE;                                                                00004150
        %INCLUDE R0019905;      /* F_ALDER                     */       00004160
  %PAGE;                                                                00004170
        %INCLUDE R0019913;      /* F_SNU_DATO                  */       00004180
  %PAGE;                                                                00004190
        %INCLUDE R0014151;      /* KLAGJØR_TAB            NY92 */       00004200
  %PAGE;                                                                00004210
        %INCLUDE R0014161;      /* LEGG_UFØREHIST_I_TAB    NY92 */      00004220
  %PAGE;                                                                00004230
        %INCLUDE R0014139;   /* JUSTER_MED_FORVENTET_INNTEKT_AP NY92*/  00004240
  %PAGE;                                                                00004250
        %INCLUDE R0014140;   /* F_OVERGANG_FRA_YP               NY92*/  00004260
  %PAGE;                                                                00004270
        %INCLUDE R0014148;   /* F_TP92                          NY92*/  00004280
  %PAGE;                                                                00004290
        %INCLUDE R0019967;   /* RULL_FAI            TRUDE 290492    */  00004300
                                                                        00004310
   L999:                                                                00004320
                                                                        00004330
   END R001421;                                                         00004340
