 /*       SIST ENDRET 06/04-94 14.54.38 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 23/04-91 10.56.47 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 14/04-89 13.35.59 AV   HERMAN                   */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0014166 - SUBRUTINE I PLI                                     */00000040
 /*    PROGRAMMERER: HERMAN LARSSEN,   JUNI 1988                      */00000050
 /*HENSIKT:                                                           */00000060
 /*    SKAL LEGGE UT YRKEHISTORIKK I TABELL - DVS PAÅ FOR HVER ÅR     */00000070
 /*    SAMMEN MED KAP 11-UFØREGRAD                                    */00000080
 /*                                                                   */00000090
 /*ENDRET: 060494 MÅTTE LEGGE INN PAÅ I ALLE GRADSENDRINGER. TRUDE    */00000100
 /*                                                                   */00000110
 /*                                                                   */00000120
 /* ***************************************************************** */00000130
  LEGG_YRKEHIST_I_TAB:                                                  00000140
    PROC(IND,FØDSELSÅR);                                                00000150
 /* PROC(IND,FØDSELSÅR,TAB);   ENDERET AV SATISH  21.4.91             */00000160
 /*  %INCLUDE P0014003;        ENDERET AV SATISH  21.4.91            */ 00000170
                                                                        00000180
                                                                        00000190
 %SKIP(2);                                                              00000200
    DCL                                                                 00000210
       I                 FIXED BIN(15) INIT(0);                         00000220
    DCL                                                                 00000230
       INDEKS            FIXED BIN(15);                                 00000240
    DCL                                                                 00000250
       IND               FIXED BIN(15);                                 00000260
    DCL                                                                 00000270
       FØDSELSÅR         PIC '99';                                      00000280
    DCL                                                                 00000290
       OPPH_DATO         PIC'(4)9' INIT(0),                             00000300
       UFTPKT            PIC'(4)9' INIT(0),                             00000310
       UF_GRAD_ÅM        PIC'(4)9' INIT(0);                             00000320
    DCL                                                                 00000330
       1 UF_ÅM DEF UFTPKT,                                              00000340
         2 UF_ÅR         PIC'99',                                       00000350
         2 UF_MND        PIC'99';                                       00000360
    DCL                                                                 00000370
       1 OPPHØRSDATO     DEF OPPH_DATO,                                 00000380
         2 UF_OPPH_ÅR    PIC'99',                                       00000390
         2 UF_OPPH_MND   PIC'99';                                       00000400
    DCL                                                                 00000410
       1 UFG_DATO        DEF UF_GRAD_ÅM,                                00000420
         2 UFG_DATO_ÅR   PIC'99',                                       00000430
         2 UFG_DATO_MND  PIC'99';                                       00000440
    DCL                                                                 00000450
       UFG_STOPP         PIC'(4)9' INIT(0);                             00000460
    DCL                                                                 00000470
       W_TIDLIGERE_GRAD  FIXED(3)  INIT(0);                             00000480
                                                                        00000490
 %PAGE;                                                                 00000500
  DO INDEKS = 1 TO 5 WHILE (B02.YUFT_ÅM(IND,INDEKS) > 0);               00000510
     UFTPKT    = B02.YUFT_ÅM(IND,INDEKS);                               00000520
                                                                        00000530
     OPPH_DATO = B02.OPPH_DATO_ÅM(IND,INDEKS);                          00000540
     IF TAB.YRKE_GRAD(UF_ÅR) < B02.YRKEHIST.YUG(IND,INDEKS)   THEN      00000550
                                                                        00000560
        DO;                                                             00000570
           TAB.YRKE_GRAD(UF_ÅR) = B02.YRKEHIST.YUG(IND,INDEKS);         00000580
           TAB.PAÅ      (UF_ÅR) = B02.YRKEHIST.PAÅ(IND,INDEKS);         00000590
        END;                                                            00000600
                                                                        00000610
     ELSE                                                               00000620
        DO;                                                             00000630
           TAB.YRKE_GRAD(UF_ÅR + 1) = B02.YRKEHIST.YUG(IND,INDEKS);     00000640
           TAB.PAÅ      (UF_ÅR + 1) = B02.YRKEHIST.PAÅ(IND,INDEKS);     00000650
        END;                                                            00000660
                                                                        00000670
     W_TIDLIGERE_GRAD = B02.YRKEHIST.YUG(IND,INDEKS);                   00000680
                                                                        00000690
                                                                        00000700
                                                                        00000710
     DO I = 1 TO 5;                                                     00000720
        IF B02.YUG_DATO_ÅM(IND,INDEKS,I) > 0 THEN                       00000730
                                                                        00000740
           DO;                                                          00000750
              UF_GRAD_ÅM = B02.YUG_DATO_ÅM(IND,INDEKS,I);               00000760
                                                                        00000770
              IF W_TIDLIGERE_GRAD < B02.YUG_ØVRIGE(IND,INDEKS,I) !      00000780
                 UFG_DATO_MND = 01                      THEN            00000790
                                                                        00000800
                DO;                                                     00000810
                 TAB.YRKE_GRAD(UFG_DATO_ÅR) = B02.YUG_ØVRIGE(           00000820
                                                          IND,INDEKS,I);00000830
                  TAB.PAÅ(UFG_DATO_ÅR)      = TAB.PAÅ(UF_ÅR);/*TS0494*/ 00000840
                END;                                                    00000850
               ELSE                                                     00000860
                  IF TAB.UFØR_SLUTT_MND(UFG_DATO_ÅR + 1) ^= 01 THEN     00000870
                    DO;                                                 00000880
                     TAB.UFØR_GRAD(UFG_DATO_ÅR + 1) =                   00000890
                                     B02.UFG_ØVRIGE(IND,INDEKS,I);      00000900
                     TAB.PAÅ(UFG_DATO_ÅR + 1)= TAB.PAÅ(UF_ÅR);/*TS0494*/00000910
                    END;                                                00000920
               W_TIDLIGERE_GRAD = B02.UFG_ØVRIGE(IND,INDEKS,I);         00000930
           END;                                                         00000940
        ELSE                                                            00000950
             I = 5;                                                     00000960
     END; /*DO I = 1 TO 5 */                                            00000970
                                                                        00000980
     IF UF_OPPH_ÅR > 0 THEN                                             00000990
                                                                        00001000
        DO;                                                             00001010
           UFG_STOPP = UF_OPPH_ÅR;                                      00001020
           IF TAB.UFØR_SLUTT_MND(UF_OPPH_ÅR) = 01 THEN                  00001030
                                                                        00001040
              DO;                                                       00001050
                 TAB.YRKE_GRAD(UF_OPPH_ÅR) = 0;                         00001060
                 UFG_STOPP                 = UFG_STOPP - 1;             00001070
              END;                                                      00001080
                                                                        00001090
         END;                                                           00001100
                                                                        00001110
      ELSE                                                              00001120
                                                                        00001130
         DO;                                                            00001140
            IF UF_ÅR < 73 THEN                                          00001150
               UFG_STOPP = FØDSELSÅR + 69;                              00001160
            ELSE                                                        00001170
               UFG_STOPP = FØDSELSÅR + 66;                              00001180
                                                                        00001190
            IF W_FNR_R.ÅRHUNDRE > 4        THEN                         00001200
               UFG_STOPP = UFG_STOPP - 100;                             00001210
         END;                                                           00001220
                                                                        00001230
      IF UF_ÅR < UFG_STOPP THEN                                         00001240
                                                                        00001250
         DO I = UF_ÅR + 1 TO UFG_STOPP;                                 00001260
            IF TAB.YRKE_GRAD(I) = 0 THEN                                00001270
                                                                        00001280
               DO;                                                      00001290
               /* TAB.PAÅ(I)       = TAB.PAÅ(I - 1)   TS060494  */      00001300
                                                                        00001310
               /* SYSTEMET TAKLER BARE EN YKRESKADE: TRUDE 060494*/     00001320
                  TAB.PAÅ(I)       = TAB.PAÅ(UF_ÅR);                    00001330
                                                                        00001340
                  TAB.YRKE_GRAD(I) = TAB.YRKE_GRAD(I - 1);              00001350
               END;                                                     00001360
                                                                        00001370
         END;                                                           00001380
 END;                                                                   00001390
 %SKIP(2);                                                              00001400
  END LEGG_YRKEHIST_I_TAB;                                              00001410
