 /*       SIST ENDRET 09/02-88 13.22.35 AV   DYBVIK                   */00000000
 %SKIP(3);                                                              00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /* **********************                                            */00000040
 /*  PROGRAM-IDENT : R001NO17  UNDERPROGRAM SOM BRUKES AV R001NO10.   */00000050
 /*                            KONTROLL O1-BLANKETT.                  */00000060
 /*  PROGRAM-SPRÅK : PLI                                              */00000070
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */00000080
 /*  PROGRAMMET BLE LAGET : OKTOBER 1986                              */00000090
 /*  ENDRINGERSDATO :                                                 */00000100
 /*  ENDRINGEN GJELDER:                                               */00000110
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000120
 /*                                                                   */00000130
 /* ***************************************************************** */00000140
 /*BRUK:                                                              */00000150
 /* ********                                                          */00000160
 /*                                                                   */00000170
 /*  %INCLUDE R001NO17                                                */00000180
 /*                                                                   */00000190
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */00000200
 /*                                                                   */00000210
 /*    R0011602   BLANK O1 TRANSOMR                                   */00000220
 /*    R0011603   KONTR O1 SØKER                                      */00000230
 /*    FUNKSJONER SOM BRUKES ER INKLUDERT I HOVEDPROGRAMMET.          */00000240
 /*                                                                   */00000250
 /* ***************************************************************** */00000260
 /*                                                                   */00000270
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR O1 OG FLYTTER DERETTER        */00000280
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */00000290
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */00000300
 /*  NUMRE TATT VARE PÅ.                                              */00000310
 /*                                                                   */00000320
 /* ***************************************************************** */00000330
                                                                        00000340
 P116_BEHANDLE_O1: PROC;                                                00000350
                                                                        00000360
                                                                        00000370
 %INCLUDE P0011601;                               /* TRANSOMR O1 */     00000380
                                                                        00000390
                                                                        00000400
          FEIL_I_BOSATT = '0'B;                                         00000410
          FEIL_BLANKETT = '0'B;                                         00000420
          FEIL_FUNNET   = '0'B;                                         00000430
          CALL BLANK_O1_OPPHØR;                  /* R0011602 */         00000440
          CALL BLANK_O1_MELDNR;                  /* R0011602 */         00000450
          CALL OVERFØR_O1_BLANKETT;                                     00000460
          CALL KONTROLL_O1(FEIL_FUNNET);         /* R0011603 */         00000470
                                                                        00000480
          IF FEIL_FUNNET     THEN                                       00000490
             DO;                                                        00000500
                CALL FINN_FEIL_O1;                                      00000510
             END;                                                       00000520
                                                                        00000530
                                                                        00000540
                                                                        00000550
 /* ***************************************************************** */00000560
 /*   PROSEDYRE FOR Å OVERFØRE FELT FRA OVERFØRINGSRECORD             */00000570
 /*   TIL O1_TRANS_OMR I KOM_OMR FOR OPPHØRSBLANKETT 1.               */00000580
 /* ***************************************************************** */00000590
 OVERFØR_O1_BLANKETT: PROC;                                             00000600
                                                                        00000610
                                                                        00000620
          O1.REGDATO      = BLANKETT_RECORD.TRANS_DATO_ÅMD;             00000630
          O1.TERMID       = 'NORT';                                     00000640
          O1.FNR_DØD      = BLANKETT_RECORD.FNR;                        00000650
          O1.TKNR_DØD     = BLANKETT_RECORD.TKNR;                       00000660
          O1.DØDSDATO_DØD = O1_BLANKETT.DØDSDATO;                       00000670
                                                                        00000680
          IF F_FELT_PIC_CHAR11(O1_BLANKETT.FNR_EK) ^= (11)' '    THEN   00000690
             O1.FNR_EK    = O1_BLANKETT.FNR_EK;                         00000700
                                                                        00000710
          IF F_FELT_PIC_CHAR5(O1_BLANKETT.PI_DØD) ^= (5)' '      THEN   00000720
             O1.PI_DØD    = O1_BLANKETT.PI_DØD * 100;                   00000730
                                                                        00000740
                                                                        00000750
   END OVERFØR_O1_BLANKETT;                                             00000760
                                                                        00000770
                                                                        00000780
 /* ***************************************************************** */00000790
 /*   PROSEDYRE SOM FINNER OG TAR VARE PÅ FEILMELDINGSNUMMER HVIS DET */00000800
 /*   ER FEIL I DEN OVERFØRTE REKORDEN.                               */00000810
 /* ***************************************************************** */00000820
 FINN_FEIL_O1:PROC;                                                     00000830
                                                                        00000840
                                                                        00000850
          FEIL_IND = 1;                                                 00000860
                                                                        00000870
          IF O1.FNR_DØDNR ^= 0   &                                      00000880
             O1.FNR_DØDNR ^= 999 THEN                                   00000890
             DO;                                                        00000900
                W01_FEIL_NR(FEIL_IND) = O1.FNR_DØDNR;                   00000910
                FEIL_IND = FEIL_IND + 1;                                00000920
             END;                                                       00000930
                                                                        00000940
          IF O1.TKNR_DØDNR ^= 0   &                                     00000950
             O1.TKNR_DØDNR ^= 999 THEN                                  00000960
             DO;                                                        00000970
                W01_FEIL_NR(FEIL_IND) = O1.TKNR_DØDNR;                  00000980
                FEIL_IND = FEIL_IND + 1;                                00000990
             END;                                                       00001000
                                                                        00001010
          IF O1.DØDSDATO_DØDNR ^= 0   &                                 00001020
             O1.DØDSDATO_DØDNR ^= 999 THEN                              00001030
             DO;                                                        00001040
                W01_FEIL_NR(FEIL_IND) = O1.DØDSDATO_DØDNR;              00001050
                IF FEIL_IND ^= 3 THEN                                   00001060
                   FEIL_IND  = FEIL_IND + 1;                            00001070
             END;                                                       00001080
                                                                        00001090
          IF O1.FNR_EKNR ^= 0   &                                       00001100
             O1.FNR_EKNR ^= 999 THEN                                    00001110
             DO;                                                        00001120
                W01_FEIL_NR(FEIL_IND) = O1.FNR_EKNR;                    00001130
                IF FEIL_IND ^= 3 THEN                                   00001140
                   FEIL_IND  = FEIL_IND + 1;                            00001150
             END;                                                       00001160
                                                                        00001170
          IF O1.PI_DØDNR ^= 0   &                                       00001180
             O1.PI_DØDNR ^= 999 THEN                                    00001190
             DO;                                                        00001200
                W01_FEIL_NR(FEIL_IND) = O1.PI_DØDNR;                    00001210
                IF FEIL_IND ^= 3 THEN                                   00001220
                   FEIL_IND  = FEIL_IND + 1;                            00001230
             END;                                                       00001240
                                                                        00001250
                                                                        00001260
    END FINN_FEIL_O1;                                                   00001270
                                                                        00001280
                                                                        00001290
                                                                        00001300
 %PAGE;                                                                 00001310
 /* ***************************************************************** */00001320
 /*          E K S T E R N E    P R O C E D U R E R                   */00001330
 /* ***************************************************************** */00001340
                                                                        00001350
                                                                        00001360
 %PAGE;                                                                 00001370
 %INCLUDE R0011602;          /*     BLANK O1 TRANSOMR   */              00001380
                                                                        00001390
 %PAGE;                                                                 00001400
 %INCLUDE R0011603;          /*     KONTR O1 OPPHØR     */              00001410
                                                                        00001420
                                                                        00001430
 END P116_BEHANDLE_O1;                                                  00001440
                                                                        00001450
                                                                        00001460
