 /*       SIST ENDRET 22/07-97 12.21.25 AV   JDA7339                  */00000000
 /*       SIST ENDRET 23/02-95 12.56.31 AV   TSB0310                  */00000010
 /*       SIST ENDRET 07/02-89 13.10.57 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 14/12-88 13.17.17 AV   DYBVIK                   */00000030
 /*                                                                   */00000040
 /* ***************************************************************** */00000050
 /*IDENTIFIKASJON:                                                    */00000060
 /* **********************                                            */00000070
 /*  PROGRAM-IDENT : R0011905   KONTROLL_AFP_SPES  SUBPROGRAM         */00000080
 /*  PROGRAM-SPRÅK : PLI                                              */00000090
 /*  PROGRAMMERER  : SATISH                                           */00000100
 /*  PROGRAMMET BLE LAGET : 20.10.88                                  */00000110
 /*  ENDRINGSDATO  :                                                  */00000120
 /*  ENDRINGEN GJELDER:                                               */00000130
 /*  ENDRINGEN BLE UTFØRT AV :  ERIK                                  */00000140
 /*                                                                   */00000150
 /* ***************************************************************** */00000160
 /*HENSIKT:                                                           */00000170
 /* **********                                                        */00000180
 /*  KONTROLLERER GRUNNBLANKETT AFP - DEN SPESIELLE DEL.              */00000190
 /*  RETURNERER FEIL_FUNNET = '1'B VED FEIL, ELLERS '0'B.             */00000200
 /*                                                                   */00000210
 /* ***************************************************************** */00000220
 /*PROGRAMTILKNYTTING:                                                */00000230
 /* ********************                                              */00000240
 /*  PROGRAMMET INCLUDES AV R0011901 - KONTROLL_GRUNNBLANKEF TT_AFP   */00000250
 /*  ARBEIDSOMRÅDET P0011901 ER INCLUDET I HOVEDPROG.                 */00000260
 /*  BRUK :                                                           */00000270
 /*      CALL KONTROLL_AFP_SPES(FEIL_FUNNET)                          */00000280
 /*                                                                   */00000290
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN INCLUDES I HOVEDPROG :       */00000300
 /*      R0019907 - F_TABSØKC_FUNNET                                  */00000310
 /*      R0019910 - F_NUMERISK                                        */00000320
 /*      R0019912 - F_FELT_PIC_CHARNN                                 */00000330
 /*      VERIFY   - BUILTIN-FUNCTION                                  */00000340
 /*                                                                   */00000350
 /*  EKSTERN PROSEDYRE SOM CALLES :                                   */00000360
 /*      R0011908 - TT_AFP       (INCLUDE I HOVEDPROG)                */00000370
 /*                                                                   */00000380
 /*  INTERNE PROSEDYRER :                                             */00000390
 /*      KONTROLL_AFP_SPES(FEIL_FUNNET)                               */00000400
 /*      SJEKK_TT_NUMERISK                                            */00000410
 /*                                                                   */00000420
 /* ***************************************************************** */00000430
 /*DATASETTOPPLYSNINGER:                                              */00000440
 /* ***********************                                           */00000450
 /*   INGEN                                                           */00000460
 /* ***************************************************************** */00000470
 /*FEILMELDINGER:                                                     */00000480
 /* *******************                                               */00000490
 /*   MELDINGSNR LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM            */00000500
 /*   FEIL_FUNNET SETTES = '1'B.                                      */00000510
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDINGER PÅ SKJERMBILDET.   */00000520
 /*   AFP SKAL HA FEILMELDINGSNUMRE FRA 400 TIL 494.  ERIK 31.10.88   */00000530
 /*                                                                   */00000540
 /* ***************************************************************** */00000550
 KONTROLL_AFP_SPES:                                                     00000560
   PROC(FEIL_FUNNET);                                                   00000570
 %PAGE;                                                                 00000580
   DCL                                                                  00000590
      FEIL_FUNNET                        BIT(1);                        00000600
   DCL                                                                  00000610
      KEY_BIT1                   BIT(32) BASED (KEY_PEKER1),            00000620
      KEY_BIT2                   BIT(32) BASED (KEY_PEKER2),            00000630
      KEY_PEKER1                 POINTER,                               00000640
      KEY_PEKER2                 POINTER,                               00000650
      ST_RECL                    CHAR (35);                             00000660
   DCL                                                                  00000670
      T_FNR                              PIC'(11)9',                    00000680
      T_VIRK_DATO                        PIC'(4)9';                     00000690
   DCL                                                                  00000700
      T_VIRK_DATO_MMM                    PIC'(4)9';                     00000710
   DCL                                                                  00000720
      VIRK_DATO_M DEF T_VIRK_DATO POS(1) PIC'(2)9',                     00000730
      VIRK_DATO_Å DEF T_VIRK_DATO POS(3) PIC'(2)9';                     00000740
   DCL                                                                  00000750
      HJ_FELT_3                          CHAR(3);                       00000760
   DCL                                                                  00000770
      1 NR DEF T_FNR,                                                   00000780
        2 DG                             PIC'99',                       00000790
        2 MN                             PIC'99',                       00000800
        2 ÅR                             PIC'99',                       00000810
        2 PERSNR,                                                       00000820
          3 ÅRHUNDRE                     PIC'999',                      00000830
          3 REST                         PIC'99';                       00000840
   DCL                                                                  00000850
      FYLT_SEKSTISJU                     PIC'(4)9';                     00000860
   DCL                                                                  00000870
      FYLT_SEKSTISEKS                    PIC'(4)9'; /* ERIK 28.10.88 */ 00000880
   DCL                                                                  00000890
      FYLT_SEKSTIFEM                     PIC'(4)9'; /* ERIK 28.10.88 */ 00000900
   DCL                                                                  00000910
      TT_VENT_UTL_Å                      PIC'99',                       00000920
      TT_VENT_UTL_ÅM                     PIC'(4)9',                     00000930
      OVER_MND                           PIC'99',                       00000940
      TT                                 PIC'99';                       00000950
   DCL                                                                  00000960
      MAKS_TT_FØR_1967                   PIC'99',                       00000970
      TT_TIL_TPK                         PIC'(4)9',                     00000980
      TT_E66_ÅM                          PIC'(4)9';                     00000990
 %SKIP(2);                                                              00001000
      T_FNR       = AFP.FNR;                                            00001010
      T_VIRK_DATO = AFP.VIRK_DATO_MÅ;                                   00001020
      TT_E66_ÅM   = (AFPSP.TT_E66_Å * 100) + AFPSP.TT_E66_M;            00001030
      KEY_PEKER1  = ADDR(AFPSP.STATSBORGER);                            00001040
      KEY_PEKER2  = ADDR(AFPSP.BOSATT);                                 00001050
 %PAGE;                                /*    */                         00001060
 /* ***************************************************************** */00001070
 /* TESTER OM FORUTSETNINGENE FOR Å KONTROLLERE FELTENE I SPES.INFO   */00001080
 /* DELEN ER TILSTEDE.                                                */00001090
 /* ***************************************************************** */00001100
  FEIL_FUNNET = '0'B;                                                   00001110
  CALL SJEKK_TT_NUMERISK;                                               00001120
  IF ^FEIL_FUNNET THEN                                                  00001130
    DO;                                                                 00001140
      IF AFPSP.TT_F67     = 0 & AFPSP.TT_E66_Å      =  0 &              00001150
         AFPSP.TT_E66_M   = 0 &                                         00001160
         F_FELT_PIC_CHAR3(AFPSP.STATSBORGER)        = '000' &           00001170
         F_FELT_PIC_CHAR3(AFPSP.BOSATT)             = '000' &           00001180
         AFPSP.OVERKOMP_UTL                         = ' ' THEN          00001190
        DO;                                                             00001200
          FEIL_FUNNET        = '1'B;                                    00001210
          AFP.NORSK_BOSATTNR = 61;                                      00001220
        END;                                                            00001230
      ELSE                                                              00001240
        DO;                                                             00001250
 /* ***************************************************************** */00001260
 /* FELTKONTROLLER.........                                           */00001270
 /* ***************************************************************** */00001280
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND1);               00001290
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT1)       00001300
                                               INTO(ST_RECL);           00001310
              GOTO STAT_UT;                                             00001320
          NOTFND1:                                                      00001330
              FEIL_FUNNET        = '1'B;                                00001340
              AFPSP.STATSBORGERNR = 24;                                 00001350
              GOTO STAT_UT;                                             00001360
          STAT_UT:                                                      00001370
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND2);               00001380
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT2)       00001390
                                               INTO(ST_RECL);           00001400
              GOTO BO_UT;                                               00001410
          NOTFND2:                                                      00001420
              FEIL_FUNNET   = '1'B;                                     00001430
              AFPSP.BOSATTNR = 25;                                      00001440
              GOTO BO_UT;                                               00001450
          BO_UT:                                                        00001460
                                                                        00001470
     /*   IF   AFPSP.FRAVIK_FLYKT ^= ' ' THEN                           00001480
            DO;                                                         00001490
              FEIL_FUNNET         = '1'B;                               00001500
              AFPSP.FRAVIK_FLYKTNR = 403;                               00001510
            END;   0797 MH */                                           00001520
          IF ^(AFPSP.OVERKOMP_UTL = 'J' !                               00001530
                               AFPSP.OVERKOMP_UTL = ' ') THEN           00001540
            DO;                                                         00001550
              FEIL_FUNNET         = '1';                                00001560
              AFPSP.OVERKOMP_UTLNR = 35;                                00001570
            END;                                                        00001580
          IF AFPSP.TT_E66_M > 12 THEN                                   00001590
            DO;                                                         00001600
              FEIL_FUNNET = '1'B;                                       00001610
              AFPSP.TT_E66_MNR = 31;                                    00001620
            END;                                                        00001630
      END;                                                              00001640
 %PAGE;                                                                 00001650
 /* ***************************************************************** */00001660
 /* KRYSSKONTROLLER                                                   */00001670
 /* ***************************************************************** */00001680
        IF ^FEIL_FUNNET THEN                                            00001690
          DO;                                                           00001700
     /*     IF AFPSP.STATSBORGER = 0 & AFPSP.OVERKOMP_UTL = 'J' THEN    00001710
              DO;                                                       00001720
     TRUDE      FEIL_FUNNET         = '1'B;                             00001730
     230295     AFPSP.OVERKOMP_UTLNR = 34;                              00001740
              END; */                                                   00001750
            IF AFPSP.FRAVIK_FLYKT = 'J' &                               00001760
               (AFPSP.TT_E66_M    > 0 ! /* 160797 MH TT SKAL IKKJE */   00001770
                AFPSP.TT_E66_Å    > 0 ! /* FYLLES UT VED FRAVIK    */   00001780
                AFPSP.TT_F67      > 0   ) THEN                          00001790
              DO;                                                       00001800
                FEIL_FUNNET         = '1'B;                             00001810
                AFPSP.FRAVIK_FLYKTNR = 403;                             00001820
                AFPSP.TT_E66_MNR    = 999;                              00001830
                AFPSP.TT_E66_ÅNR    = 999;                              00001840
                AFPSP.TT_F67NR      = 999;                              00001850
              END;                                                      00001860
 %PAGE;                                /*    */                         00001870
 /* ***************************************************************** */00001880
 /* REGNER UT ÅR OG MND VEDKOMMENDE FYLLER 66 ÅR (ÅÅMM)               */00001890
 /*(SIFFER 7-9 ANGIR ÅRHUNDRE:1800-TALLET 500-749,1900-TALLET 000-499)*/00001900
 /* ***************************************************************** */00001910
        IF ÅRHUNDRE <= 499 THEN                                         00001920
           FYLT_SEKSTISEKS = ((ÅR + 66) * 12) + MN;                     00001930
        ELSE                                                            00001940
           FYLT_SEKSTISEKS = (((ÅR + 66) - 100) * 12) + MN;             00001950
 /* ***************************************************************** */00001960
 /* REGNER UT ÅR OG MND VEDKOMMENDE FYLLER 65 ÅR (ÅÅMM)               */00001970
 /*(SIFFER 7-9 ANGIR ÅRHUNDRE:1800-TALLET 500-749,1900-TALLET 000-499)*/00001980
 /* ***************************************************************** */00001990
        IF ÅRHUNDRE <= 499 THEN                                         00002000
           FYLT_SEKSTIFEM = ((ÅR + 65) * 12) + MN;                      00002010
        ELSE                                                            00002020
           FYLT_SEKSTIFEM = (((ÅR + 65) - 100) * 12) + MN;              00002030
 /* ***************************************************************** */00002040
 /* REGNER OM ANT.MND.VENTET I UTLANDET (MM) TIL ÅR OG MND (ÅÅMM)     */00002050
 /* ***************************************************************** */00002060
        T_VIRK_DATO_MMM = (VIRK_DATO_Å * 12) + VIRK_DATO_M;             00002070
 %PAGE;                                /*   */                          00002080
 /* ***************************************************************** */00002090
 /* KONTROLL AV SØKERENS TRYGDETID:                                   */00002100
 /* - OM TT FØR 1967 ER FOR HØY                                       */00002110
 /* - OM TT FRA 1966 TIL FYLTE 67 ÅR ER FOR HØY                       */00002120
 /* ***************************************************************** */00002130
        IF ^FEIL_FUNNET THEN                                            00002140
          DO;                                                           00002150
            /* TRYGDETIDEM MÅ ALLTID OPPGIS NÅR DET ER SPESIELLE  */    00002160
            /* OPPLYSNINGER                                       */    00002170
            IF AFPSP.TT_F67       = 0 &                                 00002180
               AFPSP.TT_E66_Å     = 0 &                                 00002190
               AFPSP.TT_E66_M     = 0 &                                 00002200
               AFPSP.FRAVIK_FLYKT = ' ' THEN                            00002210
               DO;                                                      00002220
                 FEIL_FUNNET = '1'B;                                    00002230
                 AFPSP.TT_F67NR = 195;                                  00002240
                 AFPSP.TT_E66_ÅNR = 999;                                00002250
                 AFPSP.TT_E66_MNR = 999;                                00002260
               END;                                                     00002270
                                                                        00002280
            CALL TT_AFP(AFP.FNR,AFP.VIRK_DATO_MÅ,                       00002290
                        MAKS_TT_FØR_1967,TT_TIL_TPK);   /*R0011908 */   00002300
                                                                        00002310
            IF AFPSP.TT_F67 > MAKS_TT_FØR_1967 THEN                     00002320
              DO;                                                       00002330
                FEIL_FUNNET     = '1'B;                                 00002340
                AFPSP.TT_F67NR = 31;                                    00002350
              END;                                                      00002360
            IF TT_E66_ÅM > TT_TIL_TPK THEN                              00002370
              DO;                                                       00002380
                FEIL_FUNNET     = '1'B;                                 00002390
                AFPSP.TT_E66_ÅNR = 112;                                 00002400
                AFPSP.TT_E66_MNR = 999;                                 00002410
              END;                                                      00002420
          END;                                                          00002430
 %PAGE;                                /*   */                          00002440
 /* ***************************************************************** */00002450
 /* KRYSSKONTROLL AFPSP.FRAVIK_19_3 OG TT                             */00002460
 /* ***************************************************************** */00002470
            IF AFPSP.TT_E66_M > 0 THEN                                  00002480
               TT = AFPSP.TT_F67 + (AFPSP.TT_E66_Å + 1);                00002490
            ELSE                                                        00002500
               TT = AFPSP.TT_F67 + AFPSP.TT_E66_Å;                      00002510
         END;                                                           00002520
     END;                                                               00002530
 /* ***************************************************************** */00002540
  SJEKK_TT_NUMERISK:                                                    00002550
      PROC;                                                             00002560
            IF ^F_NUMERISK(F_FELT_PIC_CHAR2(AFPSP.TT_F67)) THEN         00002570
               DO;                                                      00002580
                  FEIL_FUNNET         = '1'B;                           00002590
                  AFPSP.TT_F67NR      = 200;                            00002600
               END;                                                     00002610
            IF ^F_NUMERISK(F_FELT_PIC_CHAR2(AFPSP.TT_E66_Å)) THEN       00002620
               DO;                                                      00002630
                  FEIL_FUNNET         = '1'B;                           00002640
                  AFPSP.TT_E66_ÅNR    = 200;                            00002650
               END;                                                     00002660
            IF ^F_NUMERISK(F_FELT_PIC_CHAR2(AFPSP.TT_E66_M)) THEN       00002670
               DO;                                                      00002680
                  FEIL_FUNNET         = '1'B;                           00002690
                  AFPSP.TT_E66_MNR    = 200;                            00002700
               END;                                                     00002710
      END SJEKK_TT_NUMERISK;                                            00002720
   END KONTROLL_AFP_SPES;                                               00002730
