 /*       SIST ENDRET 24/07-92 10.10.53 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 02/04-92 15.51.46 AV   HERMAN                   */00000010
 /*       SIST ENDRET 20/02-92 12.10.45 AV   HERMAN                   */00000020
 /*       SIST ENDRET 05/02-92 13.37.49 AV   HERMAN                   */00000030
 /*       SIST ENDRET 08/01-92 15.44.37 AV   HERMAN                   */00000040
 /*       SIST ENDRET 13/12-91 12.37.06 AV   DYBVIK                   */00000050
 /*IDENTIFIKASJON:                                                    */00000060
 /*    R0014523 - SUBRUTINE I PLI                                     */00000070
 /*    PROGRAMMERER: HERMAN DES 91                                    */00000080
 /*HENSIKT:                                                           */00000090
 /*    TP_UP GARANTIER                                                */00000100
 /*    BEREGNER : GAR92_EGEN, GAR92_EGEN_55 OG GAR92_AVD              */00000110
 /*TILKNYTTING:                                                       */00000120
 /*    PROGRAMMET INCLUDES I 4501                                     */00000130
 /* ***************************************************************** */00000140
  BEREGN_TP_ETTERLATT_GARANTI:                                          00000150
    PROC ;                                                              00000160
 %PAGE;                                                                 00000170
    DCL      UFGRAD    FIXED DEC (3)   INIT (0);                        00000180
    DCL      TP_WORK   FIXED DEC (13,4) INIT (0);                       00000190
    DCL KAP11_TP_AVD      FIXED DEC (5) INIT (0);                       00000200
    DCL VANLIG_TP_AVD     FIXED DEC (5) INIT (0);                       00000210
    DCL MINUS             FIXED DEC (3,2) INIT (0);                     00000220
    DCL SPT_UTEN_PT       FIXED DEC (3,2) INIT (0);                     00000230
    DCL OPT_UTEN_PT       FIXED DEC (3,2) INIT (0);                     00000240
                                                                        00000250
                                                                        00000260
        UFGRAD  = B02.UFØRPENS.UFG(BER_SØ_IND) -                        00000270
                  B02.YRKEPENS.YUG(BER_SØ_IND);                         00000280
                                                                        00000290
        IF UFGRAD < 0 THEN                                              00000300
           UFGRAD = 0 ;                                                 00000310
                                                                        00000320
 /*FJERNET NY BEREGNING AV YP - HL 020492 : */                          00000330
                                                                        00000340
 /*     IF B02.PENSJONSTYPE1(BER_SØ_IND) = 'Y'    THEN                  00000350
           DO;                                                          00000360
              IF B02.YRKEPENS.YPT(BER_SØ_IND) <                         00000370
                 B02.YRKE_POENG_1291(BER_SØ_IND)         THEN           00000380
                 B02.YRKEPENS.YPT(BER_SØ_IND) =                         00000390
                 B02.YRKE_POENG_1291(BER_SØ_IND);                       00000400
              TP_WORK = G * 45/100;                                     00000410
              TP_WORK = TP_WORK * B02.YRKEPENS.YPT(BER_SØ_IND);         00000420
              TP_WORK = TP_WORK * B02.YRKEPENS.YUG(BER_SØ_IND)/100;     00000430
              TP_WORK = TP_WORK / 12;                                   00000440
              TP_YP = TP_WORK + 0.5;                                    00000450
              TP_YP_55 = TP_WORK * 55/100 + 0.5;                        00000460
           END;                                                     */  00000470
                                                                        00000480
 /*20.2.92 HL : BARE GARANTI PÅ UP DERSOM DET ER UP FRA FØR : */        00000490
                                                                        00000500
    IF B02.UFØRPENS.SPT_1291(BER_SØ_IND) > 0  THEN                      00000510
       DO;                                                              00000520
                                                                        00000530
 /*HVIS GJENLEVENDE HAR POENGTILLEGG, SÅ MÅ DETTE FJERNES I EGENPENSJ.*/00000540
                                                                        00000550
          IF B01.POENGTILLEGG_KODE(BER_SØ_IND) = 'A'      THEN          00000560
             MINUS = 1;                                                 00000570
          ELSE                                                          00000580
          IF B01.POENGTILLEGG_KODE(BER_SØ_IND) = 'B'      THEN          00000590
             MINUS = 0.5;                                               00000600
          IF MINUS > 0       THEN                                       00000610
             DO;                                                        00000620
                SPT_UTEN_PT = B02.UFØRPENS.SPT_1291(BER_SØ_IND) - MINUS;00000630
                IF B02.UFØRPENS.OPT_1291(BER_SØ_IND) > SPT_UTEN_PT THEN 00000640
                   OPT_UTEN_PT = SPT_UTEN_PT;                           00000650
                ELSE                                                    00000660
                   OPT_UTEN_PT = B02.UFØRPENS.OPT_1291(BER_SØ_IND);     00000670
             END;                                                       00000680
          ELSE                                                          00000690
             DO;                                                        00000700
                SPT_UTEN_PT = B02.UFØRPENS.SPT_1291(BER_SØ_IND);        00000710
                OPT_UTEN_PT = B02.UFØRPENS.OPT_1291(BER_SØ_IND);        00000720
             END;                                                       00000730
                                                                        00000740
          GAR92_EGEN =  F_TILLEGGSPENSJON(FNR_R.ÅR,35500,               00000750
                         SPT_UTEN_PT,                                   00000760
                         OPT_UTEN_PT,                                   00000770
                         B02.UFØRPENS.PÅ_1291(BER_SØ_IND),              00000780
                                   UFGRAD,                              00000790
                                   100,'J');                            00000800
          GAR92_EGEN    = TP_YP + GAR92_EGEN;                           00000810
                                                                        00000820
          GAR92_EGEN_55 = F_TILLEGGSPENSJON(FNR_R.ÅR,35500,             00000830
                         B02.UFØRPENS.SPT_1291(BER_SØ_IND),             00000840
                         B02.UFØRPENS.OPT_1291(BER_SØ_IND),             00000850
                         B02.UFØRPENS.PÅ_1291(BER_SØ_IND),              00000860
                                    UFGRAD,                             00000870
                                    55,'J');                            00000880
       END;                                                             00000890
    ELSE                                                                00000900
    IF B01.UFØRPENS.UFG(BER_SØ_IND) > 0     THEN                        00000910
       DO;                                                              00000920
                                                                        00000930
                                                                        00000940
          IF B01.POENGTILLEGG_KODE(BER_SØ_IND) = 'A'      THEN          00000950
             MINUS = 1;                                                 00000960
          ELSE                                                          00000970
          IF B01.POENGTILLEGG_KODE(BER_SØ_IND) = 'B'      THEN          00000980
             MINUS = 0.5;                                               00000990
          IF MINUS > 0       THEN                                       00001000
             DO;                                                        00001010
                SPT_UTEN_PT = B02.UFØRPENS.SPT(BER_SØ_IND) - MINUS;     00001020
                IF B02.UFØRPENS.OPT(BER_SØ_IND) > SPT_UTEN_PT THEN      00001030
                   OPT_UTEN_PT = SPT_UTEN_PT;                           00001040
                ELSE                                                    00001050
                   OPT_UTEN_PT = B02.UFØRPENS.OPT(BER_SØ_IND);          00001060
             END;                                                       00001070
          ELSE                                                          00001080
             DO;                                                        00001090
                SPT_UTEN_PT = B02.UFØRPENS.SPT(BER_SØ_IND);             00001100
                OPT_UTEN_PT = B02.UFØRPENS.OPT(BER_SØ_IND);             00001110
             END;                                                       00001120
                                                                        00001130
          GAR92_EGEN =  F_TILLEGGSPENSJON(FNR_R.ÅR,35500,               00001140
                         SPT_UTEN_PT,                                   00001150
                         OPT_UTEN_PT,                                   00001160
                         B02.UFØRPENS.PÅ(BER_SØ_IND),                   00001170
                                   UFGRAD,                              00001180
                                   100,'J');                            00001190
          GAR92_EGEN    = TP_YP + GAR92_EGEN;                           00001200
                                                                        00001210
          GAR92_EGEN_55 = F_TILLEGGSPENSJON(FNR_R.ÅR,35500,             00001220
                         B02.UFØRPENS.SPT(BER_SØ_IND),                  00001230
                         B02.UFØRPENS.OPT(BER_SØ_IND),                  00001240
                         B02.UFØRPENS.PÅ(BER_SØ_IND),                   00001250
                                    UFGRAD,                             00001260
                                    55,'J');                            00001270
       END;                                                             00001280
                                                                        00001290
    GAR92_EGEN_55 = GAR92_EGEN_55 + TP_YP_55;                           00001300
                                                                        00001310
    IF B02.ETTEPENS.SPT_1291(BER_SØ_IND) > 0             THEN           00001320
                                                                        00001330
        GAR92_AVD      = F_TILLEGGSPENSJON(FNR_EK_R.ÅR_EK,35500,        00001340
                         B02.ETTEPENS.SPT_1291(BER_SØ_IND),             00001350
                         B02.ETTEPENS.OPT_1291(BER_SØ_IND),             00001360
                         B02.ETTEPENS.PÅ_1291(BER_SØ_IND),              00001370
                                    100,                                00001380
                         B02.TP_PROSENT(BER_SØ_IND),     /*NY*/         00001390
      /*                            55,'J');        */                  00001400
                                       'J');                            00001410
                                                                        00001420
    ELSE                                                                00001430
                                                                        00001440
        GAR92_AVD      = F_TILLEGGSPENSJON(FNR_EK_R.ÅR_EK,35500,        00001450
                         B02.ETTEPENS.SPT_AVD(BER_SØ_IND),              00001460
                         B02.ETTEPENS.OPT_AVD(BER_SØ_IND),              00001470
                         B02.ETTEPENS.PÅ_AVD(BER_SØ_IND),               00001480
                                    100,                                00001490
                         B02.TP_PROSENT(BER_SØ_IND),     /*NY*/         00001500
      /*                            55,'J');          */                00001510
                                       'J');                            00001520
                                                                        00001530
                                                                        00001540
                                                                        00001550
 /* ****************************************************** */           00001560
 /* YS - BEREGNING                                         */           00001570
 /* ****************************************************** */           00001580
                                                                        00001590
  IF B02.YRKEPENS.YUG(BER_EK_IND) > 0           THEN                    00001600
     DO;                                                                00001610
        IF B02.YRKEPENS.YPT(BER_EK_IND)   <                             00001620
           B02.YRKE_POENG_1291(BER_EK_IND)        THEN                  00001630
           B02.YRKEPENS.YPT(BER_EK_IND)   =                             00001640
           B02.YRKE_POENG_1291(BER_EK_IND);                             00001650
                                                                        00001660
        KAP11_TP_AVD = F_TILLEGGSPENSJON(FNR_EK_R.ÅR_EK,G,              00001670
                       B02.YRKEPENS.YPT(BER_EK_IND),0,40,               00001680
                       B02.YRKEPENS.YUG(BER_EK_IND),                    00001690
                       B02.TP_PROSENT(BER_SØ_IND),'J');                 00001700
                                                                        00001710
        VANLIG_TP_AVD = GAR92_AVD *                                     00001720
          (100 - B02.YRKEPENS.YUG(BER_EK_IND)) / 100 + 0.5;             00001730
                                                                        00001740
        IF (KAP11_TP_AVD + VANLIG_TP_AVD) > GAR92_AVD     THEN          00001750
                                                                        00001760
        GAR92_AVD = KAP11_TP_AVD + VANLIG_TP_AVD;                       00001770
                                                                        00001780
      END;                                                              00001790
                                                                        00001800
                                                                        00001810
    RETUR:                                                              00001820
                                                                        00001830
  END BEREGN_TP_ETTERLATT_GARANTI;                                      00001840
