 /*       SIST ENDRET 08/10-82 14.05.26 AV   LUNDEBY                  */00000000
 /*       SIST ENDRET 20/09-82 11.32.44 AV   OLSEN                    */00000010
 /*       SIST ENDRET 10/09-82 12.13.34 AV   HELEN                    */00000020
 /*       SIST ENDRET 10/09-82 09.50.38 AV   HELEN                    */00000030
 /*       SIST ENDRET 26/08-82 08.31.29 AV   OLAV                     */00000040
 /*       SIST ENDRET 23/08-82 08.19.54 AV   OLAV                     */00000050
  /* *************************************************************** */ 00000060
  /* IDENTIFIKASJON:   R0017413                                      */ 00000070
  /* PROGRAMMERER:  HELEN    JULI, 1982                              */ 00000080
  /* HENSIKT:                                                        */ 00000090
  /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT    */ 00000100
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */ 00000110
  /*        HVER AJOURFØRT TRANSAKSJON.                              */ 00000120
  /* PROGRAMTILKNYTNING:                                             */ 00000130
  /*        PROGRAMMET INKLUDERES I  R0017001                        */ 00000140
  /*        OG BLIR OPPKALT AV R0017401                              */ 00000150
  /*        (LAG_SB_GRUNNLAG_IKKE_BARN)                              */ 00000160
  /* *************************************************************** */ 00000170
  LAG_ETTERLATT_HEND:                                                   00000180
      PROC(IND);                                                        00000190
    DCL   IND             FIXED BIN (15);                               00000200
    DCL   AVD_IND         FIXED BIN (15);                               00000210
  /* *************************************************************** */ 00000220
  /* PROGRAMMET BEGYNNER HER.                                        */ 00000230
  /* VI FINNER AVDØDES INDEKS OG BLANKER W_HENDELSE.                 */ 00000240
  /* *************************************************************** */ 00000250
    IF  IND = 1 THEN                                                    00000260
        AVD_IND = 2;                                                    00000270
    ELSE                                                                00000280
        AVD_IND = 1;                                                    00000290
    W_HENDELSE            =    '';                                      00000300
    W_HENDELSE.FNR_EKTEF  =    B02.PERSON.RF0PERSN.FNR(AVD_IND);        00000310
    W_HENDELSE.NAVN_EKTEF =    B02.PERSON.RF0PERSN.NAVN(AVD_IND);       00000320
    W_HENDELSE.HENDDATO   =    B02.PERSON.STATUS.VIRK_DATO_ÅM(IND);     00000330
    W_HENDELSE.VERSJON    =    W_ROT.NESTE_SB_VERSJON_NR;               00000340
    W_HENDELSE.TERMINAL   =    EIBLK.EIBTRMID;                          00000350
    W_HENDELSE.GP_BRUTTO = B02.PERSON.ETTEPENS.GP_BRUTTO(IND);          00000360
    W_HENDELSE.GP_NETTO  = B02.PERSON.ETTEPENS.GP_NETTO(IND);           00000370
    W_HENDELSE.TP_BRUTTO = B02.PERSON.ETTEPENS.TP_BRUTTO(IND);          00000380
    W_HENDELSE.TP_NETTO  = B02.PERSON.ETTEPENS.TP_NETTO(IND);           00000390
    W_HENDELSE.ST        = B02.PERSON.ETTEPENS.ST(IND);                 00000400
    W_HENDELSE.KT        = B02.PERSON.ETTEPENS.KT(IND);                 00000410
    W_HENDELSE.TT        = B02.PERSON.STATUS.TT_ANV(IND);               00000420
    CALL  PLASSER_TEKSTTYPE_A_KODE;                                     00000430
 /* CALL  PLASSER_TEKSTYPE_B1_KODE */                                   00000440
    W_HENDELSE.TEKSTYPE_B1_KODE  = 9;                                   00000450
 /* CALL  PLASSER_TEKSTYPE_B2_KODE */                                   00000460
    W_HENDELSE.TEKSTYPE_B2_KODE  = 9;                                   00000470
 /* CALL  PLASSER_TEKSTYPE_C_KODE  */                                   00000480
    W_HENDELSE.TEKSTYPE_C_KODE   = 9;                                   00000490
 /* **************************************************************** */ 00000500
 /* HENDELSE SEGMENT SKRIVES UT.                                     */ 00000510
 /* **************************************************************** */ 00000520
    CALL INSERT_HENDELSE;                                               00000530
 /* IF W_HENDELSE.TP_NETTO > 0  THEN                                 */ 00000540
 /*    CALL BYGG_OPP_BEREGNINGS_VEDLEGG_SEGMENT                      */ 00000550
  END  LAG_ETTERLATT_HEND;                                              00000560
