 /*       SIST ENDRET 06/04-94 14.53.18 AV   DYBVIK                   */00000000
 /* ***************************************************************** */00000010
 /*                                                                   */00000020
 /*    SKRIV  DATA TIL REG.                                           */00000030
 /*                                                                   */00000040
 /* ***************************************************************** */00000050
 %SKIP(2);                                                              00000060
                                                                        00000070
 OVERFØR_INNTEKT_TIL:  PROC(FEIL_FUNNET);                               00000080
                                                                        00000090
    DCL   FEIL_FUNNET  BIT (1) ;                                        00000100
                                                                        00000110
     CALL DATABASE ('OPEN ');                                           00000120
                                                                        00000130
    SKRIV_KODE = ' ';                                                   00000140
    MER_DATA   =    '0'B;                                               00000150
    RF1_KODE   = ' ';                                                   00000160
    UT.FRA_FNR            =  OOS.FRA_FNR;                               00000170
    UT.TIL_FNR            =  OOS.TIL_FNR;                               00000180
    UT.START_ÅR           =  OOS.START_ÅR;                              00000190
    UT.BARN_ANTTAL        =  OOS.BARN_ANTTAL;                           00000200
    DO K = 1 TO 12;                                                     00000210
       UT.FNR_BARN (K)       =  OOB.FNR_BARN (K);                       00000220
    END;                                                                00000230
                                                                        00000240
   CALL LES_Q_ROT;                                                      00000250
   IF RF1_KODE = ' '  THEN                                              00000260
      DO;                                                               00000270
                                                                        00000280
         CALL LES_INNTEKT_GNP;                                          00000290
                                                                        00000300
         DO WHILE (RF1_KODE = ' ' & SKRIV_KODE = ' ' & MER_DATA);       00000310
                                                                        00000320
            IF PI_SEGM.ÅR    = OOS.START_ÅR  &                          00000330
               PI_SEGM.TYPE  = 'J'                  THEN                00000340
               DO;                                                      00000350
                  UT.FRA_FNR            =  OOS.FRA_FNR;                 00000360
                  UT.TIL_FNR            =  OOS.TIL_FNR;                 00000370
                  UT.START_ÅR           =  OOS.START_ÅR;                00000380
                  UT.BARN_ANTTAL        =  OOS.BARN_ANTTAL;             00000390
                  DO K = 1 TO 12;                                       00000400
                     UT.FNR_BARN (K)    =  OOB.FNR_BARN (K);            00000410
                  END;                                                  00000420
           /*                                                           00000430
                  UT.TYPE (K)           =  PI_SEGM.TYPE;                00000440
                  UT.ÅR   (K)           =  PI_SEGM.ÅR;                  00000450
                  UT.INNTEKT(K)         =  PI_SEGM.PI;                  00000460
          */                                                            00000470
       /*         EXEC CICS WRITE DATASET ('FNR9W33') FROM (UT) */      00000480
                  EXEC CICS WRITE DATASET ('OMSORGE') FROM (UT)         00000490
                                                     RIDFLD(P_RBA) RBA; 00000500
                  CALL FJERNE_BARN_OMSORGE_FRAFNR;                      00000510
                  CALL UPDATE_BARN_OMSORGE_TILFNR;                      00000520
                                                                        00000530
                  SKRIV_KODE = 'X';                                     00000540
              END;                                                      00000550
                                                                        00000560
              IF  SKRIV_KODE = ' '  THEN                                00000570
                  CALL LES_INNTEKT_GNP;                                 00000580
         END;                                                           00000590
      END;                                                              00000600
                                                                        00000610
     IF SKRIV_KODE = ' ' THEN                                           00000620
        DO;                                                             00000630
          FEIL_FUNNET  = '1'B;                                          00000640
          OOSP. INNTEKTNR = '2';                                        00000650
        END;                                                            00000660
                                                                        00000670
      IF RF1_KODE   = 'X'  THEN                                         00000680
         DO;                                                            00000690
             FEIL_FUNNET  = '1'B;                                       00000700
             OOSP.INNTEKTNR = '2';                                      00000710
         END;                                                           00000720
                                                                        00000730
                                                                        00000740
     CALL DATABASE ('TERM');                                            00000750
 END  OVERFØR_INNTEKT_TIL;                                              00000760
                                                                        00000770
                                                                        00000780
                                                                        00000790
    /* ************************************************************** */00000800
    /*                                                                */00000810
    /* PROCEDURE FOR LESE ROT-SEGM              ( GHU   )             */00000820
    /*                                                                */00000830
    /* ************************************************************** */00000840
  LES_Q_ROT: PROC;                                                      00000850
                                                                        00000860
                                                                        00000870
                                                                        00000880
      ROOT = '';                                                        00000890
      SSA1_RF0PERSN.PKEY = OOS.FRA_FNR;                                 00000900
                                                                        00000910
      CALL PLITDLI                              (W02_PARM_CT_4,         00000920
                                                 W02_GU,                00000930
                                                 RF1,                   00000940
                                                 ROOT  ,                00000950
                                                 SSA1_RF0PERSN);        00000960
                                                                        00000970
      IF   UIBFCTR              =     UIB_RC_OK    THEN                 00000980
        DO;                                                             00000990
           IF RF1.STATUS_KODE   =  '  '  THEN                           00001000
               RF1_KODE = ' ';                                          00001010
           ELSE                                                         00001020
               DO;                                                      00001030
                  FEIL_FUNNET = '1'B;                                   00001040
                  OOS.FRA_FNRNR = 1713;                                 00001050
                  RF1_KODE = 'X';                                       00001060
               END;                                                     00001070
        END;                                                            00001080
      ELSE                                                              00001090
        DO;                                                             00001100
           RF1_KODE = 'X';                                              00001110
        END;                                                            00001120
                                                                        00001130
    END LES_Q_ROT;                                                      00001140
                                                                        00001150
                                                                        00001160
                                                                        00001170
    /* ************************************************************** */00001180
    /*                                                                */00001190
    /* PROCEDURE FOR LESE ROT-SEGM              ( GHU   )             */00001200
    /*                                                                */00001210
    /* ************************************************************** */00001220
                                                                        00001230
   LES_INNTEKT_GNP:PROC;                                                00001240
                                                                        00001250
      SSA_UQUAL = 'PINNTEKT';                                           00001260
                                                                        00001270
      CALL PLITDLI                              (W02_PARM_CT_4,         00001280
                                                 W02_GHNP,              00001290
                                                 RF1,                   00001300
                                                 PI_SEGM,               00001310
                                                 SSA_UQUAL);            00001320
                                                                        00001330
      IF   UIBFCTR              =     UIB_RC_OK    THEN                 00001340
        DO;                                                             00001350
           IF RF1.STATUS_KODE   =  '  '  !                              00001360
              RF1.STATUS_KODE   =  'GA'  !                              00001370
              RF1.STATUS_KODE   =  'GK'  THEN                           00001380
               MER_DATA                     =    '1'B;                  00001390
           ELSE                                                         00001400
               MER_DATA                     =    '0'B;                  00001410
        END;                                                            00001420
      ELSE                                                              00001430
        DO;                                                             00001440
           MER_DATA                         =    '0'B;                  00001450
           RF1_KODE                         =    'X';                   00001460
        END;                                                            00001470
                                                                        00001480
   END LES_INNTEKT_GNP;                                                 00001490
                                                                        00001500
    /* ************************************************************** */00001510
    /*                                                                */00001520
    /* PROCEDURE FOR FJERN PINNTEKT SEG                               */00001530
    /*  OG UPDATE INTEKT-MARK                                         */00001540
    /*                                                                */00001550
    /* ************************************************************** */00001560
  FJERNE_BARN_OMSORGE_FRAFNR: PROC;                                     00001570
                                                                        00001580
      CALL PLITDLI                              (W02_PARM_CT_3,         00001590
                                                 W02_DLET,              00001600
                                                 RF1,                   00001610
                                                 PI_SEGM);              00001620
                                                                        00001630
      IF   UIBFCTR              =     UIB_RC_OK    THEN                 00001640
        DO;                                                             00001650
           IF RF1.STATUS_KODE  =  '  '   THEN                           00001660
               RF1_KODE                         =    ' ';               00001670
           ELSE                                                         00001680
               RF1_KODE                         =    'X';               00001690
        END;                                                            00001700
      ELSE                                                              00001710
        DO;                                                             00001720
               RF1_KODE                         =    'X';               00001730
        END;                                                            00001740
                                                                        00001750
                                                                        00001760
  END FJERNE_BARN_OMSORGE_FRAFNR;                                       00001770
                                                                        00001780
    /* ************************************************************** */00001790
    /*                                                                */00001800
    /* PROCEDURE FOR LESE ROT-SEGM              ( GHU   )             */00001810
    /*  OG UPDATE INTEKT-MARK                                         */00001820
    /*                                                                */00001830
    /* ************************************************************** */00001840
  UPDATE_BARN_OMSORGE_TILFNR: PROC;                                     00001850
   CALL LES_TIL_FNR;                                                    00001860
                                                                        00001870
   IF RF1_KODE = ' ' THEN                                               00001880
      DO;                                                               00001890
                                                                        00001900
         PI_SEGM.TYPE             = 'J' ;                               00001910
         PI_SEGM.ÅR               =    OOS.START_ÅR  ;                  00001920
         PI_SEGM.PI               = 0;                                  00001930
         PI_SEGM.PI_RAPPDATO      = DATE;                               00001940
         CALL SKRIV_PINNTEKT;                                           00001950
      END;                                                              00001960
   IF RF1_KODE ^= ' ' THEN                                              00001970
      DO;                                                               00001980
          FEIL_FUNNET = '1'B;                                           00001990
          OOS.TIL_FNRNR = 0217;                                         00002000
      END;                                                              00002010
                                                                        00002020
  END UPDATE_BARN_OMSORGE_TILFNR;                                       00002030
                                                                        00002040
  LES_TIL_FNR: PROC;                                                    00002050
                                                                        00002060
      SSA1_RF0PERSN.PKEY = OOS.TIL_FNR;                                 00002070
      ROOT = '';                                                        00002080
                                                                        00002090
      CALL PLITDLI                              (W02_PARM_CT_4,         00002100
                                                 W02_GHU,               00002110
                                                 RF1,                   00002120
                                                 ROOT,                  00002130
                                                 SSA1_RF0PERSN);        00002140
                                                                        00002150
      IF   UIBFCTR              =     UIB_RC_OK    THEN                 00002160
        DO;                                                             00002170
           IF RF1.STATUS_KODE   =  '  '  THEN                           00002180
               RF1_KODE = ' ';                                          00002190
           ELSE                                                         00002200
              DO;                                                       00002210
                 FEIL_FUNNET = '1'B;                                    00002220
                 OOS.TIL_FNRNR = 1713;                                  00002230
                 RF1_KODE = 'X';                                        00002240
              END;                                                      00002250
        END;                                                            00002260
      ELSE                                                              00002270
        DO;                                                             00002280
           RF1_KODE = 'X';                                              00002290
        END;                                                            00002300
                                                                        00002310
  END LES_TIL_FNR;                                                      00002320
                                                                        00002330
                                                                        00002340
   SKRIV_PINNTEKT:    PROC;                                             00002350
                                                                        00002360
      SSA_UQUAL = 'PINNTEKT ';                                          00002370
                                                                        00002380
      CALL PLITDLI                              (W02_PARM_CT_5,         00002390
                                                 W02_ISRT,              00002400
                                                 RF1,                   00002410
                                                 PI_SEGM,               00002420
                                                 SSA1_RF0PERSN,         00002430
                                                 SSA_UQUAL);            00002440
                                                                        00002450
      IF   UIBFCTR              =     UIB_RC_OK    THEN                 00002460
        DO;                                                             00002470
           IF RF1.STATUS_KODE  =  '  '   THEN                           00002480
               RF1_KODE                         =    ' ';               00002490
           ELSE                                                         00002500
               RF1_KODE                         =    'X';               00002510
        END;                                                            00002520
      ELSE                                                              00002530
        DO;                                                             00002540
               RF1_KODE                         =    'X';               00002550
        END;                                                            00002560
                                                                        00002570
   END SKRIV_PINNTEKT;                                                  00002580
                                                                        00002590
                                                                        00002600
                                                                        00002610
 DATABASE:                                                              00002620
   PROC(STYRING);                                                       00002630
                                                                        00002640
   DCL                                                                  00002650
     STYRING                               CHAR(5),                     00002660
     NULL                                  BUILTIN,                     00002670
     UNSPEC                                BUILTIN;                     00002680
                                                                        00002690
                                                                        00002700
     DCL                                                                00002710
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');         00002720
     DCL                                                                00002730
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00002740
  %PAGE;                                                                00002750
                                                                        00002760
     IF STYRING = 'OPEN' THEN                                           00002770
        DO;                                                             00002780
           CALL   PLITDLI                        (W02_PARM_CT_3,        00002790
                                                  W01_PCB_FUNCTION,     00002800
                                                  W01_PSB_NAVN,         00002810
                                                  UIBPTR);              00002820
                                                                        00002830
           IF DLIUIB.UIBFCTR                    =    '00000000'B THEN   00002840
             DO;                                                        00002850
               ALLOCATE PCB_UIB_PEKER_OMR;                              00002860
               PCB_UIB_PEKER_OMR.PCB_PEKER      =    UIBPCBAL;          00002870
               PCB_UIB_PEKER_OMR.UIB_PEKER      =    UIBPTR;            00002880
             END;                                                       00002890
           ELSE                                                         00002900
             DO;                                                        00002910
               FEIL_KODE    = '1'B;                                     00002920
               MELDING1O =                                              00002930
               'NOE ER GALT MED DATABASEN, KODE: ' !!                   00002940
               UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);               00002950
             END;                                                       00002960
        END;                                                            00002970
     ELSE                                                               00002980
        DO;                                                             00002990
           CALL   PLITDLI                        (W02_PARM_CT_1,        00003000
                                                  W01_TERM_FUNCTION);   00003010
           KOM_OMR.PCB_UIB_PEKER = NULL;                                00003020
        END;                                                            00003030
                                                                        00003040
 END DATABASE;                                                          00003050
                                                                        00003060
                                                                        00003070
