 /*       SIST ENDRET 23/01-98 12.23.31 AV   JDA7339                  */00000000
 /*       SIST ENDRET 11/12-97 09.18.01 AV   JDA7339                  */00000010
 /*       SIST ENDRET 05/12-97 12.18.12 AV   JDA7339                  */00000020
 /*       SIST ENDRET 27/11-97 10.42.25 AV   JDA7339                  */00000030
 /* ***************************************************************** */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /* **********************                                            */00000060
 /*  PROGRAM-IDENT : R001NU1A  UNDERPROGRAM SOM BRUKES AV R001NO10    */00000070
 /*                            KONTROLL KFP-BLANKETT.                 */00000080
 /*  PROGRAM-SPRÅK : PLI                                              */00000090
 /*  PROGRAMMERER  : HERMAN                                           */00000100
 /*  PROGRAMMET BLE LAGET : NOV 1997                                  */00000110
 /*                                                                   */00000120
 /* ***************************************************************** */00000130
 /*  ENDRINGER                                                        */00000140
 /* ***************************************************************** */00000150
 /*BRUK:                                                              */00000160
 /* ********                                                          */00000170
 /*                                                                   */00000180
 /*  %INCLUDE R001NU1A                                                */00000190
 /*                                                                   */00000200
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */00000210
 /*                                                                   */00000220
 /*    R001UJ02   BLANK TRANSOMR                                      */00000230
 /*    R001UJ03   KONTR KFP SØKER                                     */00000240
 /*    FUNKSJONER SOM BRUKES ER INCLUDET I HOVEDPROGRAMMET.           */00000250
 /*                                                                   */00000260
 /* ***************************************************************** */00000270
 /*                                                                   */00000280
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR KFP OG FLYTTER DERETTER       */00000290
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */00000300
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */00000310
 /*  NUMRE TATT VARE PÅ.                                              */00000320
 /*                                                                   */00000330
 /* ***************************************************************** */00000340
                                                                        00000350
 P119_BEHANDLE_KFP: PROC;                                               00000360
                                                                        00000370
                                                                        00000380
 %INCLUDE P001UJ01;                      /* TRANSOMRÅDE KFP */          00000390
                                                                        00000400
                                                                        00000410
          CALL BLANK_KFP_SØKER;                         /* R001UJ02 */  00000420
          CALL BLANK_KFP_MELDNR;                        /* R001UJ02 */  00000430
          CALL BLANK_KFP_SPES;                          /* R001UJ02 */  00000440
          CALL OVERF_KFP_BLANKETT;                                      00000450
          CALL KONTROLL_KFP_SØKER(FEIL_FUNNET);         /* R001UJ03 */  00000460
                                                                        00000470
                                                                        00000480
          IF KFP.NORSK_BOSATT = 'N'   THEN                              00000490
             DO;                                                        00000500
                FEIL_I_BOSATT = TRUE;                                   00000510
                FEIL_FUNNET   = TRUE;                                   00000520
             END;                                                       00000530
                                                                        00000540
          IF FEIL_FUNNET      THEN                                      00000550
             CALL FINN_FEIL_KFP;                                        00000560
                                                                        00000570
                                                                        00000580
                                                                        00000590
                                                                        00000600
 /* ***************************************************************** */00000610
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */00000620
 /*    RECORDEN TIL KFP TRANSOMRÅDE FOR KFP SØKER.                    */00000630
 /* ***************************************************************** */00000640
 OVERF_KFP_BLANKETT:PROC;                                               00000650
                                                                        00000660
          KFP.REGDATO      =  BLANKETT_RECORD.TRANS_DATO_ÅMD;           00000670
          KFP.TERMID       = 'NORT';                                    00000680
          KFP.VIRK_DATO_MÅ =  KFP_BLANKETT.VIRK_DATO_MÅ;                00000690
          KFP.FNR          =  BLANKETT_RECORD.FNR;                      00000700
          KFP.NAVN         =  BLANKETT_RECORD.NAVN;                     00000710
          KFP.TKNR         =  BLANKETT_RECORD.TKNR;                     00000720
          KFP.TILL_EK      =  KFP_BLANKETT.TILL_EK;                     00000730
          KFP.SIVILSTAND   =  KFP_BLANKETT.SIVILSTAND;                  00000740
          KFP.SPRÅK        =  KFP_BLANKETT.SPRÅK;                       00000750
          KFP.EK_INNT_OVER_2G =  KFP_BLANKETT.EK_INNT_OVER_2G;          00000760
                                                                        00000770
          KFP.NORSK_BOSATT =  KFP_BLANKETT.NORSK_BOSATT;                00000780
                                                                        00000790
          IF F_FELT_PIC_CHAR7 (KFP_BLANKETT.FAI) ^= (7)' '       THEN   00000800
             KFP.FAI       =  KFP_BLANKETT.FAI ;                        00000810
                                                                        00000820
          IF F_FELT_PIC_CHAR11 (KFP_BLANKETT.FNR_EK) ^= (11)' '  THEN   00000830
             KFP.FNR_EK    =  KFP_BLANKETT.FNR_EK;                      00000840
                                                                        00000850
          IF F_FELT_PIC_CHAR7                                           00000860
                 (KFP_BLANKETT.PENSJONS_INNTEKT) ^= (7)' '  THEN        00000870
             KFP.PEN_INNT  =  KFP_BLANKETT.PENSJONS_INNTEKT;            00000880
                                                                        00000890
          IF F_FELT_PIC_CHAR7(KFP_BLANKETT.PI_SISTE_ÅR) ^= (7)' '   THEN00000900
              KFP.PI_SISTE_ÅR =  KFP_BLANKETT.PI_SISTE_ÅR;              00000910
          KFP.AFP_ORDNING  =  KFP_BLANKETT.AFP_ORDNING;                 00000920
          KFP.NAVN_EK      =  KFP_BLANKETT.NAVN_EK;                     00000930
          KFP.AFP_TILLEGGKODE  =  KFP_BLANKETT.AFP_TILLEGG;             00000940
                                                                        00000950
                                                                        00000960
    END OVERF_KFP_BLANKETT;                                             00000970
                                                                        00000980
                                                                        00000990
 /* ***************************************************************** */00001000
 /*    PROCEDURE SOM FINNER OG TAR VARE PÅ FEIL_MELD_NR NÅR DET ER    */00001010
 /*    FEIL I DEN OVERFØRTE RECORDEN.                                 */00001020
 /* ***************************************************************** */00001030
 FINN_FEIL_KFP:PROC;                                                    00001040
                                                                        00001050
                                                                        00001060
          FEIL_IND = 1;                                                 00001070
                                                                        00001080
          IF KFP.VIRK_DATO_MÅNR ^= 0 &                                  00001090
             KFP.VIRK_DATO_MÅNR ^= 999 THEN                             00001100
             DO;                                                        00001110
                W01_FEIL_NR(FEIL_IND) = KFP.VIRK_DATO_MÅNR;             00001120
                IF FEIL_IND ^= 3 THEN                                   00001130
                   FEIL_IND  = FEIL_IND + 1;                            00001140
             END;                                                       00001150
                                                                        00001160
          IF KFP.FNRNR ^= 0 &                                           00001170
             KFP.FNRNR ^= 999 THEN                                      00001180
             DO;                                                        00001190
                W01_FEIL_NR(FEIL_IND) = KFP.FNRNR;                      00001200
                FEIL_IND = FEIL_IND + 1;                                00001210
             END;                                                       00001220
                                                                        00001230
          IF KFP.NAVNNR ^= 0 &                                          00001240
             KFP.NAVNNR ^= 999 THEN                                     00001250
             DO;                                                        00001260
                W01_FEIL_NR(FEIL_IND) = KFP.NAVNNR;                     00001270
                IF FEIL_IND ^= 3 THEN                                   00001280
                   FEIL_IND  = FEIL_IND + 1;                            00001290
             END;                                                       00001300
                                                                        00001310
          IF KFP.TKNRNR ^= 0 &                                          00001320
             KFP.TKNRNR ^= 999 THEN                                     00001330
             DO;                                                        00001340
                W01_FEIL_NR(FEIL_IND) = KFP.TKNRNR;                     00001350
                FEIL_IND = FEIL_IND + 1;                                00001360
             END;                                                       00001370
                                                                        00001380
          IF KFP.SPRÅKNR ^= 0 &                                         00001390
             KFP.SPRÅKNR ^= 999 THEN                                    00001400
             DO;                                                        00001410
                W01_FEIL_NR(FEIL_IND) = KFP.SPRÅKNR;                    00001420
                IF FEIL_IND ^= 3 THEN                                   00001430
                   FEIL_IND  = FEIL_IND + 1;                            00001440
             END;                                                       00001450
                                                                        00001460
          IF KFP.SIVILSTANDNR ^= 0 &                                    00001470
             KFP.SIVILSTANDNR ^= 999 THEN                               00001480
             DO;                                                        00001490
                W01_FEIL_NR(FEIL_IND) = KFP.SIVILSTANDNR;               00001500
                IF FEIL_IND ^= 3 THEN                                   00001510
                   FEIL_IND  = FEIL_IND + 1;                            00001520
             END;                                                       00001530
                                                                        00001540
          IF KFP.NORSK_BOSATTNR ^= 0 &                                  00001550
             KFP.NORSK_BOSATTNR ^= 999 THEN                             00001560
             DO;                                                        00001570
                W01_FEIL_NR(FEIL_IND) = KFP.NORSK_BOSATTNR;             00001580
                IF FEIL_IND ^= 3 THEN                                   00001590
                   FEIL_IND  = FEIL_IND + 1;                            00001600
             END;                                                       00001610
                                                                        00001620
          IF KFP.PI_SISTE_ÅRNR     ^= 0 &                               00001630
             KFP.PI_SISTE_ÅRNR     ^= 999 THEN                          00001640
             DO;                                                        00001650
                W01_FEIL_NR(FEIL_IND) = KFP.PI_SISTE_ÅRNR    ;          00001660
                IF FEIL_IND ^= 3 THEN                                   00001670
                   FEIL_IND  = FEIL_IND + 1;                            00001680
             END;                                                       00001690
                                                                        00001700
          IF KFP.FAINR ^= 0 &                                           00001710
             KFP.FAINR ^= 999 THEN                                      00001720
             DO;                                                        00001730
                W01_FEIL_NR(FEIL_IND) = KFP.FAINR;                      00001740
                IF FEIL_IND ^= 3 THEN                                   00001750
                   FEIL_IND  = FEIL_IND + 1;                            00001760
             END;                                                       00001770
                                                                        00001780
          IF KFP.EK_INNT_OVER_2GNR ^= 0 &                               00001790
             KFP.EK_INNT_OVER_2GNR ^= 999 THEN                          00001800
             DO;                                                        00001810
                W01_FEIL_NR(FEIL_IND) = KFP.EK_INNT_OVER_2GNR;          00001820
                IF FEIL_IND ^= 3 THEN                                   00001830
                   FEIL_IND  = FEIL_IND + 1;                            00001840
             END;                                                       00001850
                                                                        00001860
          IF KFP.TILL_EKNR ^= 0 &                                       00001870
             KFP.TILL_EKNR ^= 999 THEN                                  00001880
             DO;                                                        00001890
                W01_FEIL_NR(FEIL_IND) = KFP.TILL_EKNR;                  00001900
                IF FEIL_IND ^= 3 THEN                                   00001910
                   FEIL_IND  = FEIL_IND + 1;                            00001920
             END;                                                       00001930
                                                                        00001940
          IF KFP.FNR_EKNR ^= 0 &                                        00001950
             KFP.FNR_EKNR ^= 999 THEN                                   00001960
             DO;                                                        00001970
                W01_FEIL_NR(FEIL_IND) = KFP.FNR_EKNR;                   00001980
                IF FEIL_IND ^= 3 THEN                                   00001990
                   FEIL_IND  = FEIL_IND + 1;                            00002000
             END;                                                       00002010
                                                                        00002020
          IF KFP.NAVN_EKNR ^= 0 &                                       00002030
             KFP.NAVN_EKNR ^= 999 THEN                                  00002040
             DO;                                                        00002050
                W01_FEIL_NR(FEIL_IND) = KFP.NAVN_EKNR;                  00002060
                IF FEIL_IND ^= 3 THEN                                   00002070
                   FEIL_IND  = FEIL_IND + 1;                            00002080
             END;                                                       00002090
                                                                        00002100
          IF KFP.PEN_INNTNR ^= 0 &                                      00002110
             KFP.PEN_INNTNR ^= 999 THEN                                 00002120
             DO;                                                        00002130
                W01_FEIL_NR(FEIL_IND) = KFP.PEN_INNTNR;                 00002140
                IF FEIL_IND ^= 3 THEN                                   00002150
                   FEIL_IND  = FEIL_IND + 1;                            00002160
             END;                                                       00002170
                                                                        00002180
          IF KFP.AFP_ORDNINGNR ^= 0 &                                   00002190
             KFP.AFP_ORDNINGNR ^= 999 THEN                              00002200
             DO;                                                        00002210
                W01_FEIL_NR(FEIL_IND) = KFP.AFP_ORDNINGNR;              00002220
                IF FEIL_IND ^= 3 THEN                                   00002230
                   FEIL_IND  = FEIL_IND + 1;                            00002240
             END;                                                       00002250
                                                                        00002260
          IF KFP.AFP_TILLEGGKODENR ^= 0 &                               00002270
             KFP.AFP_TILLEGGKODENR ^= 999 THEN                          00002280
             DO;                                                        00002290
                W01_FEIL_NR(FEIL_IND) = KFP.AFP_TILLEGGKODENR;          00002300
                IF FEIL_IND ^= 3 THEN                                   00002310
                   FEIL_IND  = FEIL_IND + 1;                            00002320
             END;                                                       00002330
                                                                        00002340
                                                                        00002350
                                                                        00002360
                                                                        00002370
    END FINN_FEIL_KFP;                                                  00002380
                                                                        00002390
                                                                        00002400
                                                                        00002410
 %PAGE;                                                                 00002420
 /* ***************************************************************** */00002430
 /*          E K S T E R N E    P R O C E D U R E R                   */00002440
 /* ***************************************************************** */00002450
                                                                        00002460
 %PAGE;                                                                 00002470
 %INCLUDE R001UJ02;          /*     BLANK KF TRANSOMR   */              00002480
 %PAGE;                                                                 00002490
 %INCLUDE R001UJ03;          /*     KONTR KF SØKER      */              00002500
                                                                        00002510
 END P119_BEHANDLE_KFP;                                                 00002520
                                                                        00002530
                                                                        00002540
