 /*       SIST ENDRET 07/10-94 10.34.04 AV   TSB0310                  */00000000
 /*       SIST ENDRET 01/03-91 09.12.20 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 17/04-89 12.12.23 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 29/11-88 09.50.19 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 27/10-88 09.01.08 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 16/05-88 12.31.37 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 28/10-87 14.54.11 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 01/09-87 08.46.47 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 19/05-87 10.27.49 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 29/09-86 10.09.28 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 16/12-85 07.44.51 AV   FARVIK                   */00000100
 /*       SIST ENDRET 29/11-85 08.56.33 AV   FARVIK                   */00000110
 /*       SIST ENDRET 11/10-85 10.16.26 AV   LUNDEBY                  */00000120
 /*       SIST ENDRET 02/08-85 14.04.53 AV   FARVIK                   */00000130
 /*       SIST ENDRET 10/07-85 07.02.58 AV   LUNDEBY                  */00000140
 /*       SIST ENDRET 29/01-85 15.58.52 AV   LUNDEBY                  */00000150
 /*       SIST ENDRET 18/09-84 07.47.31 AV   FARVIK                   */00000160
 /*       SIST ENDRET 13/09-84 14.18.56 AV   FARVIK                   */00000170
 /*       SIST ENDRET 20/07-84 10.15.52 AV   FARVIK                   */00000180
                                                                        00000190
                                                                        00000200
 /* ***************************************************************** */00000210
 /*                                                                   */00000220
 /*  PROGRAMMET FJERNER INNTEKTER FOR ET FØDSELSNUMMER OPPGITT I      */00000230
 /*                                                                   */00000240
 /*  PROGRAM R001I101.                                                */00000250
 /*                                                                   */00000260
 /*                                                                   */00000270
 /*  PROGRAMMERER ROLF FARVIK, JUN 1983.                              */00000280
 /* ***************************************************************** */00000290
 /* ENDRET 29.01.85 AV SVERRE LUNDEBY FRA DATA-UTVIKLING A/S.         */00000300
 /* ---------------                                                   */00000310
 /*    LEGGER UT DATA TIL NORTRYGD. TKNR FINNES VED 1. OG SJEKKE OM   */00000320
 /*    DET FINNES I ROT-SEGM. ER RF0PERSN.TKNR = 0 BRUKES KOMMNR. I   */00000330
 /*    SISTE INNTEKTS-SEGM.                                           */00000340
 /*                                                                   */00000350
 /*ENDRET: 06.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000360
 /* ******                                                            */00000370
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000380
 /*    OM FNR ER ENDRET (R0019906).                                   */00000390
 /*                                                                   */00000400
 /*ENDRET: 22.11.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000410
 /* ******                                                            */00000420
 /*    VED GFNR BLE DET IKKE SKREVET PÅ KONTROLL-LISTA. ER ENDRET     */00000430
 /* ***************************************************************** */00000440
                                                                        00000450
 R001I30:                                                               00000460
   PROC (INTERN_KOM_PTR) OPTIONS(MAIN);                                 00000470
                                                                        00000480
 %PAGE;                                                                 00000490
      %INCLUDE S001I1;     /*  INNTEKTMAPSET1    (BASED) */             00000500
                                                                        00000510
 %PAGE;                                                                 00000520
      %INCLUDE S001I3;     /*  INNTEKTMAPSET3    (BASED) */             00000530
                                                                        00000540
 %PAGE;                                                                 00000550
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */            00000560
 %PAGE;                                                                 00000570
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                    00000580
 %PAGE;                                                                 00000590
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */               00000600
 %PAGE;                                                                 00000610
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */              00000620
 %PAGE;                                                                 00000630
 %SKIP(1);                                                              00000640
   DCL                                                                  00000650
       MAP_MELDING              CHAR(78)      INIT((78)' '),            00000660
       1  FEIL_STRUC,                                                   00000670
          2  FEIL_NR               FIXED DEC(5),                        00000680
          2  FEIL_MELDING          CHAR     (78),                       00000690
          2  KOM_OMR_PEKER         POINTER;                             00000700
    %PAGE;                                                              00000710
    /* ************************************************************** */00000720
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00000730
    /* ************************************************************** */00000740
                                                                        00000750
       DCL                                                              00000760
         ( ADDR , CSTG , LOW , STG , SUBSTR , ONCODE , NULL )  BUILTIN; 00000770
                                                                        00000780
       DCL                                                              00000790
           PLITDLI      ENTRY,                                          00000800
           BMSMAPBR     PTR  ;                                          00000810
                                                                        00000820
    /* ************************************************************** */00000830
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000840
    /* ************************************************************** */00000850
                                                                        00000860
    %INCLUDE DLIUIB;                                                    00000870
                                                                        00000880
       DCL                                                              00000890
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00000900
                                                                        00000910
       DCL                                                              00000920
         ( COMMAREA_PEKER , W01_HJELPE_PEKER , TRANS_SEGM_PEKER )       00000930
                                               POINTER;                 00000940
                                                                        00000950
       DCL GAMMEL_AKSJONSKODE        CHAR (2)     ;                     00000960
       DCL W02_INNT_MÅ               PIC '(4)9';                        00000970
       DCL INNT_ALDER_FRA            PIC '(2)9';                        00000980
       DCL ANTALL_FRA_LEST           FIXED DEC (3);                     00000990
       DCL ANTALL_LEST               FIXED DEC (3);                     00001000
       DCL LOW_VALUES            CHAR(6);                               00001010
       DCL W01_IO                CHAR(150);                             00001020
       DCL LOW_VALUES_1500       CHAR(1500);                            00001030
       DCL MAP_OMR               CHAR(1500) BASED (BMSMAPBR);           00001040
       DCL FATAL_FEIL            CHAR (1) INIT ('S');                   00001050
       DCL CICSINFO              CHAR (16);                             00001060
                                                                        00001070
       DCL 1 FNR_REG,                                                   00001080
             2 FNR1              FIXED DEC(11),                         00001090
             2 FNR2              FIXED DEC(11),                         00001100
             2 BRUKERID          CHAR     ( 4);                         00001110
                                                                        00001120
       DCL HUSK_PI_ÅR_FRA      FIXED    DEC   (3) ,                     00001130
           HUSK_PI_TYPE_FRA             CHAR  (1) ;                     00001140
                                                                        00001150
    /* ************************************************************** */00001160
    /*   ROT-SEGMENTET                                                */00001170
    /* ************************************************************** */00001180
                                                                        00001190
       DCL 1  RF0PERSN                UNALIGNED,                        00001200
       %INCLUDE P0019927;                                               00001210
                                                                        00001220
    /* ************************************************************** */00001230
    /*   INNTEKT-SEGMENTET                                            */00001240
    /* ************************************************************** */00001250
                                                                        00001260
       DCL 1  W01_PINT               UNALIGNED,                         00001270
       %INCLUDE P0019928;                                               00001280
                                                                        00001290
    /* ************************************************************** */00001300
    /*   INNTEKTSTABELL.                                              */00001310
    /* ************************************************************** */00001320
                                                                        00001330
       DCL 1  W03                    UNALIGNED,                         00001340
              2  W02(24),                                               00001350
                 3   TAB_PI_ÅR          FIXED    DEC   (3) ,            00001360
                 3   TAB_PI_KODE,                                       00001370
                     4   TAB_PI_TYPE             CHAR  (1) ,            00001380
                     4   TAB_PI_MERKE            PIC   '9' ,            00001390
                 3   TAB_PI             FIXED    DEC   (7) ,            00001400
                 3   TAB_PI_KOMMNR      FIXED    DEC   (5) ,            00001410
                 3   TAB_PI_RAPPDATO    FIXED    DEC   (5) ;            00001420
                                                                        00001430
                                                                        00001440
       DCL INTERN_KOM_PTR        POINTER;                               00001450
                                                                        00001460
       DCL 1 INTERN_KOM_OMR  BASED (INTERN_KOM_PTR),                    00001470
             2 HOVED_KOM_PTR        POINTER,                            00001480
             2 FRA_FNR              PIC '(11)9',                        00001490
             2 TIL_FNR              PIC '(11)9';                        00001500
                                                                        00001510
    /* ************************************************************** */00001520
    /*   OPPTELINGS- OG LOOP-PARAMETRE M.M                            */00001530
    /* ************************************************************** */00001540
                                                                        00001550
       DCL 1  W01                       UNALIGNED,                      00001560
              2   MER_DATA                    BIT  (1)   INIT ('1'B),   00001570
              2   FEILMELDING_SATT            BIT  (1)   INIT ('0'B),   00001580
              2   STYRINGSKODE_IKKE_SATT      BIT  (1)   INIT ('0'B),   00001590
              2   AKSJONSKODE                 CHAR (2),                 00001600
              2   PERSON_IKKE_FUNNET          BIT  (1)   INIT ('1'B),   00001610
              2   AKSJON_IKKE_SATT            BIT  (1)   INIT ('1'B),   00001620
              2   NAVN                        CHAR (25)  INIT ((25)' '),00001630
              2   VIRK_DATO_ÅM                PIC '9999' INIT ( 0  ),   00001640
              2   I                    FIXED  BIN  (15)  INIT (1),      00001650
              2   J                    FIXED  BIN  (15)  INIT (1);      00001660
                                                                        00001670
    /* ************************************************************** */00001680
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00001690
    /* ************************************************************** */00001700
                                                                        00001710
       DCL 1  W01_DLI_PARAM,                                            00001720
              2   W02_GET                 CHAR (4)   INIT ('    '),     00001730
              2   W02_GHU                 CHAR (4)   INIT('GHU '),      00001740
              2   W02_DLET                CHAR (4)   INIT('DLET'),      00001750
              2   W02_ISRT                CHAR (4)   INIT('ISRT'),      00001760
              2   W02_GU                  CHAR (4)   INIT ('GU  '),     00001770
              2   W02_GN                  CHAR (4)   INIT ('GN  '),     00001780
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),     00001790
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00001800
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00001810
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),          00001820
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');  00001830
                                                                        00001840
                                                                        00001850
    /* ************************************************************** */00001860
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00001870
    /* ************************************************************** */00001880
                                                                        00001890
       DCL    SSA_UQUAL_ROT        STATIC CHAR ( 9) INIT('RF0PERSN ') ; 00001900
                                                                        00001910
       DCL 1  SSA_UQUAL_PINNTEKT   STATIC CHAR ( 9) INIT('PINNTEKT ') ; 00001920
                                                                        00001930
       DCL 1  SSA_UQUAL_PINNTEKT_L STATIC CHAR (11) INIT('PINNTEKT*L ');00001940
                                                                        00001950
       DCL 1  SSA1_RF0PERSN        STATIC,                              00001960
              2    HDEL                       CHAR (17)  INIT           00001970
                   ('RF0PERSN(FNR     '),                               00001980
              2    REL_OP                     CHAR (2)   INIT (' ='),   00001990
              2    PKEY               FIXED   DEC  (11),                00002000
              2    HP                         CHAR (1)   INIT (')');    00002010
                                                                        00002020
                                                                        00002030
       DCL 1  SSA1_PINNTEKT        STATIC,                              00002040
              2    HDEL                       CHAR (17)  INIT           00002050
                   ('PINNTEKT(INNTÅRTY'),                               00002060
              2    REL_OP                     CHAR (2)   INIT (' ='),   00002070
              2    ÅR                 FIXED   DEC  (2),                 00002080
              2    TYPE                       CHAR (1),                 00002090
              2    HP                         CHAR (1)   INIT (')');    00002100
                                                                        00002110
                                                                        00002120
    /* ************************************************************** */00002130
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00002140
    /* ************************************************************** */00002150
                                                                        00002160
    %PAGE;                                                              00002170
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00002180
    %PAGE;                                                              00002190
                                                                        00002200
       DCL 1  B01              BASED (B01_PEKER),                       00002210
    %INCLUDE P0019921;                         /* B01_OMR (BASED)     */00002220
                                                                        00002230
                                                                        00002240
    %PAGE;                                                              00002250
       DCL 1  B02              BASED (B02_PEKER),                       00002260
    %INCLUDE P0019921;                         /* B02_OMR (BASED)     */00002270
                                                                        00002280
    %PAGE;                                                              00002290
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                   00002300
    %INCLUDE P0012003;                         /* PCB                 */00002310
                                                                        00002320
                                                                        00002330
    %PAGE;                                                              00002340
       DCL 1  RF2              BASED (RF2_PCB_PEKER),                   00002350
    %INCLUDE P0012003;                         /* PCB                 */00002360
                                                                        00002370
    /* ************************************************************** */00002380
    /*                                                                */00002390
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00002400
    /*     ---------------------------------------------------        */00002410
    /*                                                                */00002420
    /*                                                                */00002430
    /*      INITIERING AV PARAMETRE TIL DIV OMR.     .                */00002440
    /*                                                                */00002450
    /*                                                                */00002460
    /* ************************************************************** */00002470
                                                                        00002480
                                                                        00002490
  COMMAREA_PEKER                        = HOVED_KOM_PTR;                00002500
                                                                        00002510
 %PAGE;                                                                 00002520
      ON ERROR SNAP BEGIN;                                              00002530
         ON ERROR SYSTEM;                                               00002540
         ONKODE=ONCODE;                                                 00002550
         EXEC CICS ABEND ABCODE(ONK);                                   00002560
      END;                                                              00002570
                                                                        00002580
 EXEC CICS HANDLE CONDITION ERROR(ERRBEH);                              00002590
                                                                        00002600
  EXEC CICS HANDLE AID PF2(PF2);                                        00002610
  EXEC CICS HANDLE AID PF1(PF2);                                        00002620
                                                                        00002630
  INTERN_KOM_PTR     = ADDR(INTERN_KOM_OMR);            /*NY*/          00002640
  PROGRAM_ID        = 'R001I301'                   ;                    00002650
  DB_STATUS_KODE    = '  '                         ;                    00002660
  FEIL_MELD_NR      = 0                            ;                    00002670
  FNR_REG.BRUKERID  = DIV_PARAM_OMR.CICS_IND;                           00002680
  CICSINFO          = F_CICSINFO (DIV_PARAM_OMR.CICS_IND);              00002690
                                                                        00002700
  LOW_VALUES        = (6)' '                       ;/* HEXA LOW-VALUES*/00002710
  LOW_VALUES_1500   = (1500)' '                    ;/* HEXA LOW-VALUES*/00002720
  %PAGE;                                                                00002730
                                                                        00002740
                                                                        00002750
  /**********    H O V E D S T Y R I N G   S T A R T   *************/   00002760
                                                                        00002770
  IF TRANSKODE = 'R0I3' !                                               00002780
     TRANSKODE = 'RI3A' THEN                                            00002790
     DO;                                                                00002800
                                                                        00002810
  /***  ÅPNER RF_BASEN                            *********/            00002820
                                                                        00002830
                                                                        00002840
        IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                           00002850
            CALL DATABASE('OPEN');                                      00002860
                                                                        00002870
        ELSE                                                            00002880
            UIBPTR     = PCB_UIB_PEKER_OMR.UIB_PEKER;                   00002890
                                                                        00002900
        IF FEIL_MELD_NR > 0   THEN                                      00002910
           DO;                                                          00002920
              TERMINERINGS_IND = FATAL_FEIL;                            00002930
              GO TO L999;                                               00002940
           END;                                                         00002950
     END;                                                               00002960
                                                                        00002970
                                                                        00002980
  FEILMELDING_SATT       = '1'B    ;                                    00002990
  AKSJON_IKKE_SATT       = '1'B    ;                                    00003000
  W01.MER_DATA           = '1'B    ;                                    00003010
  ANTALL_FRA_LEST        = 0       ;                                    00003020
  ANTALL_LEST            = 0       ;                                    00003030
                                                                        00003040
                                                                        00003050
                                                                        00003060
                                                                        00003070
  GAMMEL_AKSJONSKODE = 'DU';  /* GIS DUMMY-INIT-VERDI*/                 00003080
                                                                        00003090
  DO WHILE (GAMMEL_AKSJONSKODE ^= '  ');                                00003100
                                                                        00003110
     CALL BYGG_FJERNINGSBILDE;                                          00003120
     IF FEIL_MELD_NR > 0 THEN                                           00003130
        DO;                                                             00003140
           TERMINERINGS_IND = FATAL_FEIL;                               00003150
           GO TO L999;                                                  00003160
        END;                                                            00003170
                                                                        00003180
     IF GAMMEL_AKSJONSKODE = 'BE' THEN                                  00003190
        DO;                                                             00003200
                                                                        00003210
           /***  SKRIVER UT FJERNINGSBILDET MED  DATA.**/               00003220
                                                                        00003230
           S001I03O.CICS_INFOO   =  CICSINFO         ;                  00003240
           MAP_MELDING           = 'INNTEKT(ER) FJERNET.TRYKK ENTER.';  00003250
           S001I03O.MELDING6O    =  MAP_MELDING;                        00003260
           S001I03I.AKSJONL      = -1; /* CURSOR POS */                 00003270
                                                                        00003280
           EXEC CICS SEND MAP('S001I03')                                00003290
                               MAPSET('S001I33')  CURSOR ERASE;         00003300
           EXEC CICS RECEIVE MAP('S001I03')                             00003310
                               MAPSET('S001I33');                       00003320
           GAMMEL_AKSJONSKODE = '  ';                                   00003330
                                                                        00003340
           GO TO FERDIG;                                                00003350
        END;                                                            00003360
     ELSE                                                               00003370
        DO;                                                             00003380
                                                                        00003390
           /***  SKRIVER UT FJERNINGSBILDET MED  DATA.**/               00003400
                                                                        00003410
           S001I03I.MRK1L    = -1; /* CURSOR POS */                     00003420
                                                                        00003430
           EXEC CICS SEND MAP('S001I03')                                00003440
                               MAPSET('S001I33')  CURSOR ERASE;         00003450
                                                                        00003460
        END;                                                            00003470
                                                                        00003480
     IF GAMMEL_AKSJONSKODE = 'ME' THEN                                  00003490
        AKSJON_IKKE_SATT       = '1'B    ;                              00003500
                                                                        00003510
     DO WHILE (AKSJON_IKKE_SATT);                                       00003520
                                                                        00003530
        CALL AKSJON_BEHANDLING;                                         00003540
                                                                        00003550
     END;                                                               00003560
                                                                        00003570
                                                                        00003580
   FERDIG:                                                              00003590
  END;                                                                  00003600
                                                                        00003610
                                                                        00003620
  L999:                                                                 00003630
                                                                        00003640
                                                                        00003650
 IF FEIL_MELD_NR > 0 THEN                                               00003660
    DO;                                                                 00003670
       TERMINERINGS_IND = FATAL_FEIL;                                   00003680
       CALL SKRIV_FEILMELDING;                                          00003690
    END;                                                                00003700
 ELSE                                                                   00003710
    DO;                                                                 00003720
                                                                        00003730
  /***** O M R E G N I N G   P.G.A. I N N T E K T S E N D R I N G **/   00003740
                                                                        00003750
                                                                        00003760
       FØDSNUMMER = FRA_FNR;                                            00003770
                                                                        00003780
       IF INNT_ALDER_FRA = '66' THEN                                    00003790
          ØNSKET_STATUS  = '6';                                         00003800
       ELSE                                                             00003810
          IF INNT_ALDER_FRA = '69' THEN                                 00003820
             ØNSKET_STATUS  = '9';                                      00003830
                                                                        00003840
                                                                        00003850
       EXEC CICS LINK PROGRAM('R001I601')                               00003860
                                     COMMAREA (KOM_OMR);                00003870
                                                                        00003880
      IF FEIL_MELD_NR > 0 THEN                                          00003890
         DO;                                                            00003900
            GOTO L999;                                                  00003910
         END;                                                           00003920
      ELSE                                                              00003930
         PROGRAM_ID = 'R001I301';                                       00003940
                                                                        00003950
      CALL DATABASE('CLOSE');                                           00003960
                                                                        00003970
      ALLOCATE S001I01O;                                                00003980
      ALLOCATE S001I01I;                                                00003990
                                                                        00004000
      EXEC CICS LOAD PROGRAM('S001I13');                                00004010
                                                                        00004020
      S001I01I.STYREKODEL   = -1;                                       00004030
      S001I01O.CICS_INFOO   =  CICSINFO;                                00004040
                                                                        00004050
      EXEC CICS SEND MAP('S001I01')                                     00004060
                                MAPSET('S001I13') CURSOR ERASE;         00004070
                                                                        00004080
      EXEC CICS RETURN;                                                 00004090
   END;                                                                 00004100
                                                                        00004110
                                                                        00004120
                                                                        00004130
                                                                        00004140
  /**********    H O V E D S T Y R I N G   S L U T T   *************/   00004150
                                                                        00004160
                                                                        00004170
                                                                        00004180
                                                                        00004190
 BYGG_FJERNINGSBILDE:                                                   00004200
   PROC;                                                                00004210
                                                                        00004220
    ALLOCATE S001I03O;                                                  00004230
    ALLOCATE S001I03I;                                                  00004240
                                                                        00004250
    EXEC CICS LOAD PROGRAM('S001I33');                                  00004260
                                                                        00004270
    S001I03O.FNRO         = FRA_FNR;                                    00004280
    S001I03O.CICS_INFOO   = CICSINFO;                                   00004290
                                                                        00004300
    SSA1_RF0PERSN.PKEY    = FRA_FNR;                                    00004310
                                                                        00004320
    IF ANTALL_FRA_LEST  < 25 THEN                                       00004330
       DO;                                                              00004340
          W02_GET      = W02_GU;                                        00004350
          CALL P005_LES_ROT_QUAL_FNR;                                   00004360
                                                                        00004370
          IF W01.MER_DATA THEN                                          00004380
             ANTALL_FRA_LEST  = 1;                                      00004390
          ELSE                                                          00004400
             DO;                                                        00004410
             /* ******************************************** */         00004420
             /* FRA-FNR IKKE I DATABASE--> FEILMELDING.     */          00004430
             /* ******************************************** */         00004440
                                                                        00004450
                MAP_MELDING =                                           00004460
                        'PERSONEN MED FRA-FNR : ' !! FRA_FNR !!         00004470
                                  ' ER IKKE I DATABASEN.' ;             00004480
                ALLOCATE S001I01O;                                      00004490
                ALLOCATE S001I01I;                                      00004500
                                                                        00004510
                EXEC CICS LOAD PROGRAM('S001I13');                      00004520
                                                                        00004530
                S001I01O.FRAFNRA      = 'I';                            00004540
                S001I01O.FRAFNRO      = FRA_FNR;                        00004550
                S001I01I.FRAFNRL      = -1; /* CURSOR POS       */      00004560
                S001I01O.STYREKODEO   = STYREKODE;                      00004570
                S001I01O.CICS_INFOO   = CICSINFO;                       00004580
                S001I01O.MELDINGO     = MAP_MELDING;                    00004590
                                                                        00004600
                EXEC CICS SEND MAP('S001I01')                           00004610
                                      MAPSET('S001I13') CURSOR ERASE;   00004620
                                                                        00004630
                TRANSKODE = 'R0I1';                                     00004640
                                                                        00004650
                CALL DATABASE('CLOSE');                                 00004660
                                                                        00004670
                IF FEIL_MELD_NR > 0   THEN                              00004680
                   DO;                                                  00004690
                      TERMINERINGS_IND = FATAL_FEIL;                    00004700
                      GO TO L999;                                       00004710
                   END;                                                 00004720
                                                                        00004730
                EXEC CICS RETURN;                                       00004740
             END;                                                       00004750
       END;                                                             00004760
    ELSE                                                                00004770
                                                                        00004780
       DO;                                                              00004790
          ANTALL_FRA_LEST  = 1;                                         00004800
                                                                        00004810
          SSA1_RF0PERSN.PKEY       = FRA_FNR;                           00004820
                                                                        00004830
          W02_GET      = W02_GU;                                        00004840
                                                                        00004850
          CALL P005_LES_ROT_QUAL_FNR;                                   00004860
                                                                        00004870
          SSA1_PINNTEKT.ÅR           =     HUSK_PI_ÅR_FRA     ;         00004880
          SSA1_PINNTEKT.TYPE         =     HUSK_PI_TYPE_FRA   ;         00004890
                                                                        00004900
          W02_GET      = W02_GNP;                                       00004910
          CALL P010_LES_INNT_QUAL;                                      00004920
                                                                        00004930
          CALL FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR;                          00004940
                                                                        00004950
          ANTALL_FRA_LEST  = ANTALL_FRA_LEST + 1;                       00004960
       END;                                                             00004970
                                                                        00004980
    DO WHILE(W01.MER_DATA  &  ANTALL_FRA_LEST < 25);                    00004990
                                                                        00005000
                                                                        00005010
       /*******    LES NESTE PINNTEKT     *********/                    00005020
                                                                        00005030
       CALL P020_LES_NESTE_PINNTEKT_FNR;                                00005040
                                                                        00005050
       IF W01.MER_DATA     THEN                                         00005060
          DO;                                                           00005070
                                                                        00005080
             CALL FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR;                       00005090
                                                                        00005100
                                                                        00005110
             ANTALL_FRA_LEST = ANTALL_FRA_LEST + 1;                     00005120
          END;                                                          00005130
    END;                                                                00005140
                                                                        00005150
    ANTALL_LEST = ANTALL_FRA_LEST - 1;                                  00005160
                                                                        00005170
    IF    ANTALL_FRA_LEST > 24 THEN                                     00005180
                                                                        00005190
          CALL SJEKK_OM_FLERE_INNTEKTER_FRAFNR;                         00005200
    ELSE                                                                00005210
       CALL SJEKK_OM_INGEN_INNTEKTER;                                   00005220
  END BYGG_FJERNINGSBILDE;                                              00005230
                                                                        00005240
                                                                        00005250
                                                                        00005260
 SJEKK_OM_FLERE_INNTEKTER_FRAFNR:                                       00005270
   PROC;                                                                00005280
                                                                        00005290
     /*******    LES VENTE_BASE   *********/                            00005300
                                                                        00005310
  CALL P020_LES_NESTE_PINNTEKT_FNR;                                     00005320
                                                                        00005330
  IF W01.MER_DATA     THEN                                              00005340
     DO;                                                                00005350
        MAP_MELDING =                                                   00005360
                     'FLERE EN 24 INNTEKTER REGISTERT PÅ FRA-FNR. ' !!  00005370
                               'AKSJONSKODE = ME ==> NESTE SIDE.';      00005380
                                                                        00005390
        S001I03O.CICS_INFOO = CICSINFO            ;                     00005400
        S001I03O.MELDING6O  = MAP_MELDING;                              00005410
                                                                        00005420
        HUSK_PI_ÅR_FRA   = W02_PI_ÅR;                                   00005430
        HUSK_PI_TYPE_FRA = W02_PI_TYPE;                                 00005440
                                                                        00005450
                                                                        00005460
     END;                                                               00005470
  ELSE                                                                  00005480
     ANTALL_FRA_LEST = 24;                                              00005490
                                                                        00005500
  END SJEKK_OM_FLERE_INNTEKTER_FRAFNR;                                  00005510
                                                                        00005520
                                                                        00005530
                                                                        00005540
                                                                        00005550
                                                                        00005560
                                                                        00005570
 SJEKK_OM_INGEN_INNTEKTER:                                              00005580
   PROC;                                                                00005590
                                                                        00005600
                                                                        00005610
    IF    ^W01.MER_DATA & FEIL_MELD_NR = 0 &                            00005620
                          ANTALL_FRA_LEST = 1 THEN                      00005630
          DO;                                                           00005640
             FEILMELDING_SATT   = '1'B;                                 00005650
             MAP_MELDING =                                              00005660
                        'PERSONEN MED FRA-FNR : ' !! FRA_FNR !!         00005670
                                  ' HAR IKKE REGISTERTE INNTEKTER ' ;   00005680
             ALLOCATE S001I01O;                                         00005690
             ALLOCATE S001I01I;                                         00005700
                                                                        00005710
             EXEC CICS LOAD PROGRAM('S001I13');                         00005720
                                                                        00005730
             S001I01I.FRAFNRL      = -1; /* CURSOR POS       */         00005740
             S001I01O.FRAFNRA      = 'I';                               00005750
             S001I01O.STYREKODEO   = STYREKODE;                         00005760
             S001I01O.FRAFNRO      = FRA_FNR;                           00005770
             S001I01O.CICS_INFOO   = CICSINFO       ;                   00005780
             S001I01O.MELDINGO     = MAP_MELDING;                       00005790
                                                                        00005800
             EXEC CICS SEND MAP('S001I01')                              00005810
                                      MAPSET('S001I13') CURSOR ERASE;   00005820
                                                                        00005830
                CALL DATABASE('CLOSE');                                 00005840
             TRANSKODE = 'R0I1';                                        00005850
                                                                        00005860
             EXEC CICS RETURN;                                          00005870
          END;                                                          00005880
                                                                        00005890
                                                                        00005900
  END SJEKK_OM_INGEN_INNTEKTER;                                         00005910
                                                                        00005920
                                                                        00005930
                                                                        00005940
  AKSJON_BEHANDLING:                                                    00005950
     PROC;                                                              00005960
                                                                        00005970
  /* **************************************************************** */00005980
  /*HENSIKT:                                                          */00005990
  /*    UTFØRER ØNSKET AKSJON.                                          00006000
  /*                                                                  */00006010
  /*                                                                  */00006020
  /*BRUK:                                                             */00006030
  /*    CALL AKSJON_BEHANDLING;                                         00006040
  /*                                                                  */00006050
  /* **************************************************************** */00006060
                                                                        00006070
   DCL W_FNR                FIXED DEC  (11)      INIT (0),              00006080
       W_TKNR               FIXED DEC  ( 4)      INIT (0);              00006090
                                                                        00006100
   FEILMELDING_SATT       = '1'B;                                       00006110
   AKSJON_IKKE_SATT       = '1'B;                                       00006120
                                                                        00006130
   DO UNTIL (^FEILMELDING_SATT);                                        00006140
                                                                        00006150
      FEILMELDING_SATT = '0'B;                                          00006160
                                                                        00006170
   /***  LESER INN DATA FRA FJERNINGSBILDET.  */                        00006180
                                                                        00006190
                                                                        00006200
      EXEC CICS RECEIVE MAP('S001I03')                                  00006210
                               MAPSET('S001I33')SET (BMSMAPBR);         00006220
                                                                        00006230
                                                                        00006240
                                                                        00006250
      IF S001I03I.FUNKSJONSKODEL >  0                     THEN          00006260
         DO;                                                            00006270
            FUNKSJONSKODE        =  S001I03I.FUNKSJONSKODEI;            00006280
                                                                        00006290
            IF FUNKSJONSKODE     = 'I'                    THEN          00006300
               GO TO L999;                                              00006310
            ELSE                                                        00006320
                                                                        00006330
               EXEC CICS RETURN;                                        00006340
                                                                        00006350
         END;                                                           00006360
                                                                        00006370
                                                                        00006380
      /***  SJEKKER OM AKSJONØNSKET ER GYLDIG  ******/                  00006390
                                                                        00006400
      IF S001I03I.AKSJONL > 0 THEN                                      00006410
         DO;                                                            00006420
            AKSJONSKODE         = S001I03I.AKSJONI;                     00006430
            S001I03O.CICS_INFOO = CICSINFO ;                            00006440
                                                                        00006450
            SELECT(AKSJONSKODE);                                        00006460
                                                                        00006470
               WHEN('FA')                                               00006480
                  DO;                                                   00006490
                     DO I = 1 TO ANTALL_LEST;                           00006500
                                                                        00006510
                        CALL MARKER_LINJE;                              00006520
                                                                        00006530
                     END;                                               00006540
                                                                        00006550
                     CALL BEHANDLE_MARKERTE_LINJER;                     00006560
                                                                        00006570
                     GAMMEL_AKSJONSKODE = AKSJONSKODE;                  00006580
                                                                        00006590
                     S001I03I.AKSJONL    = -1; /* CURSOR POS */         00006600
                                                                        00006610
                     EXEC CICS SEND MAP('S001I03')                      00006620
                               MAPSET('S001I33')  CURSOR ERASE;         00006630
                                                                        00006640
                  END;                                                  00006650
                                                                        00006660
               WHEN('FM')                                               00006670
                  DO;                                                   00006680
                     CALL BEHANDLE_MARKERTE_LINJER;                     00006690
                                                                        00006700
                     GAMMEL_AKSJONSKODE = AKSJONSKODE;                  00006710
                                                                        00006720
                     S001I03I.AKSJONL    = -1; /* CURSOR POS */         00006730
                                                                        00006740
                     EXEC CICS SEND MAP('S001I03')                      00006750
                               MAPSET('S001I33')  CURSOR ERASE;         00006760
                                                                        00006770
                  END;                                                  00006780
                                                                        00006790
               WHEN('BE')                                               00006800
                  DO;                                                   00006810
                     IF GAMMEL_AKSJONSKODE    = 'FA' !                  00006820
                        GAMMEL_AKSJONSKODE    = 'ME' !                  00006830
                        GAMMEL_AKSJONSKODE    = 'FM'            THEN    00006840
                        DO;                                             00006850
                           SSA1_RF0PERSN.PKEY =  FRA_FNR;               00006860
                                                                        00006870
                           /*--------------------------------------*/   00006880
                           /* SKRIVER DATA TIL NORTRYGD            */   00006890
                           /*--------------------------------------*/   00006900
                                                                        00006910
                           W_TKNR = F100_FINN_TKNR (FRA_FNR)        ;   00006920
                           W_FNR              =     FRA_FNR         ;   00006930
                                                                        00006940
                           IF FEIL_MELD_NR    >  0              THEN    00006950
                              DO;                                       00006960
                                 AKSJON_IKKE_SATT  = '0'B;              00006970
                                 GO TO RETUR;                           00006980
                              END;                                      00006990
                                                                        00007000
                           IF W_TKNR          > 0               THEN    00007010
                              CALL P900_NOR_DATA  (W_FNR , W_TKNR)  ;   00007020
                                                                        00007030
                           IF FEIL_MELD_NR    >  0              THEN    00007040
                              DO;                                       00007050
                                 AKSJON_IKKE_SATT  = '0'B;              00007060
                                 GO TO RETUR;                           00007070
                              END;                                      00007080
                           ELSE                                         00007090
                              PROGRAM_ID      = 'R001I301'          ;   00007100
                                                                        00007110
                           CALL FJERN_INNTEKTER;                        00007120
                                                                        00007130
                           IF FEIL_MELD_NR         >  0         THEN    00007140
                              DO;                                       00007150
                                 TERMINERINGS_IND  =  FATAL_FEIL    ;   00007160
                                 AKSJON_IKKE_SATT  = '0'B;              00007170
                                 GO TO RETUR;                           00007180
                              END;                                      00007190
                                                                        00007200
                           GAMMEL_AKSJONSKODE = 'BE';                   00007210
                           AKSJON_IKKE_SATT   = '0'B;                   00007220
                        END;                                            00007230
                      ELSE                                              00007240
                        DO;                                             00007250
                           MAP_MELDING       = 'FA/FM MÅ OPPGIS FØRST.';00007260
                           FEILMELDING_SATT  = '1'B;                    00007270
                           S001I03I.AKSJONL  =                          00007280
                                                -1; /* CURSOR POS */    00007290
                           S001I03O.MELDING6O = MAP_MELDING;            00007300
                                                                        00007310
                           EXEC CICS SEND MAP('S001I03')                00007320
                                         MAPSET('S001I33') CURSOR ERASE;00007330
                        END;                                            00007340
                  END;                                                  00007350
               WHEN('SI')                                               00007360
                  DO;                                                   00007370
                     TRANSKODE =   'RI3A';                              00007380
                     EXEC CICS XCTL PROGRAM('R001I301')                 00007390
                                       COMMAREA(INTERN_KOM_OMR);        00007400
                  END;                                                  00007410
               WHEN('ME')                                               00007420
                  DO;                                                   00007430
                     AKSJON_IKKE_SATT       = '0'B;                     00007440
                     GAMMEL_AKSJONSKODE = AKSJONSKODE;                  00007450
                  END;                                                  00007460
               OTHERWISE                                                00007470
                  DO;                                                   00007480
                     MAP_MELDING        = 'UGYLDIG AKSJONSKODE';        00007490
                     FEILMELDING_SATT   = '1'B;                         00007500
                     S001I03I.AKSJONL  =                                00007510
                                          -1; /* CURSOR POS */          00007520
                     S001I03O.MELDING6O = MAP_MELDING;                  00007530
                                                                        00007540
                     EXEC CICS SEND MAP('S001I03')                      00007550
                                          MAPSET('S001I33') CURSOR;     00007560
                  END;                                                  00007570
            END;                                                        00007580
         END;                                                           00007590
      ELSE                                                              00007600
         DO;                                                            00007610
            MAP_MELDING        = 'AKSJONSKODE MÅ OPPGIS';               00007620
            FEILMELDING_SATT   = '1'B;                                  00007630
            S001I03I.AKSJONL   = -1; /* CURSOR POS */                   00007640
            S001I03O.CICS_INFOO = CICSINFO        ;                     00007650
            S001I03O.MELDING6O = MAP_MELDING;                           00007660
                                                                        00007670
            EXEC CICS SEND MAP('S001I03')  MAPSET('S001I33') CURSOR;    00007680
         END;                                                           00007690
  END;                                                                  00007700
  RETUR:                                                                00007710
                                                                        00007720
  END AKSJON_BEHANDLING;                                                00007730
                                                                        00007740
  FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR:                                       00007750
     PROC;                                                              00007760
     SELECT(ANTALL_FRA_LEST);                                           00007770
        WHEN(1)                                                         00007780
            DO;                                                         00007790
               S001I03O.ÅR1O    = W02_PI_ÅR;                            00007800
               S001I03O.TYPE1O  = W02_PI_TYPE;                          00007810
               S001I03O.BELØP1O = W02_PI * 100;                         00007820
               W02.TAB_PI_ÅR(1)       = W02_PI_ÅR;                      00007830
               W02.TAB_PI_KODE(1)     = W02_PI_KODE;                    00007840
               W02.TAB_PI(1)          = W02_PI;                         00007850
               W02.TAB_PI_KOMMNR(1)   = W02_PI_KOMMNR;                  00007860
               W02.TAB_PI_RAPPDATO(1) = W02_PI_RAPPDATO;                00007870
            END;                                                        00007880
        WHEN(2)                                                         00007890
            DO;                                                         00007900
               S001I03O.ÅR2O    = W02_PI_ÅR;                            00007910
               S001I03O.TYPE2O  = W02_PI_TYPE;                          00007920
               S001I03O.BELØP2O = W02_PI * 100;                         00007930
               W02.TAB_PI_ÅR(2)       = W02_PI_ÅR;                      00007940
               W02.TAB_PI_KODE(2)     = W02_PI_KODE;                    00007950
               W02.TAB_PI(2)          = W02_PI;                         00007960
               W02.TAB_PI_KOMMNR(2)   = W02_PI_KOMMNR;                  00007970
               W02.TAB_PI_RAPPDATO(2) = W02_PI_RAPPDATO;                00007980
            END;                                                        00007990
        WHEN(3)                                                         00008000
            DO;                                                         00008010
               S001I03O.ÅR3O    = W02_PI_ÅR;                            00008020
               S001I03O.TYPE3O  = W02_PI_TYPE;                          00008030
               S001I03O.BELØP3O = W02_PI * 100;                         00008040
               W02.TAB_PI_ÅR(3)       = W02_PI_ÅR;                      00008050
               W02.TAB_PI_KODE(3)     = W02_PI_KODE;                    00008060
               W02.TAB_PI(3)          = W02_PI;                         00008070
               W02.TAB_PI_KOMMNR(3)   = W02_PI_KOMMNR;                  00008080
               W02.TAB_PI_RAPPDATO(3) = W02_PI_RAPPDATO;                00008090
            END;                                                        00008100
        WHEN(4)                                                         00008110
            DO;                                                         00008120
               S001I03O.ÅR4O    = W02_PI_ÅR;                            00008130
               S001I03O.TYPE4O  = W02_PI_TYPE;                          00008140
               S001I03O.BELØP4O = W02_PI * 100;                         00008150
               W02.TAB_PI_ÅR(4)       = W02_PI_ÅR;                      00008160
               W02.TAB_PI_KODE(4)     = W02_PI_KODE;                    00008170
               W02.TAB_PI(4)          = W02_PI;                         00008180
               W02.TAB_PI_KOMMNR(4)   = W02_PI_KOMMNR;                  00008190
               W02.TAB_PI_RAPPDATO(4) = W02_PI_RAPPDATO;                00008200
            END;                                                        00008210
        WHEN(5)                                                         00008220
            DO;                                                         00008230
               S001I03O.ÅR5O    = W02_PI_ÅR;                            00008240
               S001I03O.TYPE5O  = W02_PI_TYPE;                          00008250
               S001I03O.BELØP5O = W02_PI * 100;                         00008260
               W02.TAB_PI_ÅR(5)       = W02_PI_ÅR;                      00008270
               W02.TAB_PI_KODE(5)     = W02_PI_KODE;                    00008280
               W02.TAB_PI(5)          = W02_PI;                         00008290
               W02.TAB_PI_KOMMNR(5)   = W02_PI_KOMMNR;                  00008300
               W02.TAB_PI_RAPPDATO(5) = W02_PI_RAPPDATO;                00008310
            END;                                                        00008320
        WHEN(6)                                                         00008330
            DO;                                                         00008340
               S001I03O.ÅR6O    = W02_PI_ÅR;                            00008350
               S001I03O.TYPE6O  = W02_PI_TYPE;                          00008360
               S001I03O.BELØP6O = W02_PI * 100;                         00008370
               W02.TAB_PI_ÅR(6)       = W02_PI_ÅR;                      00008380
               W02.TAB_PI_KODE(6)     = W02_PI_KODE;                    00008390
               W02.TAB_PI(6)          = W02_PI;                         00008400
               W02.TAB_PI_KOMMNR(6)   = W02_PI_KOMMNR;                  00008410
               W02.TAB_PI_RAPPDATO(6) = W02_PI_RAPPDATO;                00008420
            END;                                                        00008430
        WHEN(7)                                                         00008440
            DO;                                                         00008450
               S001I03O.ÅR7O    = W02_PI_ÅR;                            00008460
               S001I03O.TYPE7O  = W02_PI_TYPE;                          00008470
               S001I03O.BELØP7O = W02_PI * 100;                         00008480
               W02.TAB_PI_ÅR(7)       = W02_PI_ÅR;                      00008490
               W02.TAB_PI_KODE(7)     = W02_PI_KODE;                    00008500
               W02.TAB_PI(7)          = W02_PI;                         00008510
               W02.TAB_PI_KOMMNR(7)   = W02_PI_KOMMNR;                  00008520
               W02.TAB_PI_RAPPDATO(7) = W02_PI_RAPPDATO;                00008530
            END;                                                        00008540
        WHEN(8)                                                         00008550
            DO;                                                         00008560
               S001I03O.ÅR8O    = W02_PI_ÅR;                            00008570
               S001I03O.TYPE8O  = W02_PI_TYPE;                          00008580
               S001I03O.BELØP8O = W02_PI * 100;                         00008590
               W02.TAB_PI_ÅR(8)       = W02_PI_ÅR;                      00008600
               W02.TAB_PI_KODE(8)     = W02_PI_KODE;                    00008610
               W02.TAB_PI(8)          = W02_PI;                         00008620
               W02.TAB_PI_KOMMNR(8)   = W02_PI_KOMMNR;                  00008630
               W02.TAB_PI_RAPPDATO(8) = W02_PI_RAPPDATO;                00008640
            END;                                                        00008650
        WHEN(9)                                                         00008660
            DO;                                                         00008670
               S001I03O.ÅR9O    = W02_PI_ÅR;                            00008680
               S001I03O.TYPE9O  = W02_PI_TYPE;                          00008690
               S001I03O.BELØP9O = W02_PI * 100;                         00008700
               W02.TAB_PI_ÅR(9)       = W02_PI_ÅR;                      00008710
               W02.TAB_PI_KODE(9)     = W02_PI_KODE;                    00008720
               W02.TAB_PI(9)          = W02_PI;                         00008730
               W02.TAB_PI_KOMMNR(9)   = W02_PI_KOMMNR;                  00008740
               W02.TAB_PI_RAPPDATO(9) = W02_PI_RAPPDATO;                00008750
            END;                                                        00008760
        WHEN(10)                                                        00008770
            DO;                                                         00008780
               S001I03O.ÅR10O    = W02_PI_ÅR;                           00008790
               S001I03O.TYPE10O  = W02_PI_TYPE;                         00008800
               S001I03O.BELØP10O = W02_PI * 100;                        00008810
               W02.TAB_PI_ÅR(10)       = W02_PI_ÅR;                     00008820
               W02.TAB_PI_KODE(10)     = W02_PI_KODE;                   00008830
               W02.TAB_PI(10)          = W02_PI;                        00008840
               W02.TAB_PI_KOMMNR(10)   = W02_PI_KOMMNR;                 00008850
               W02.TAB_PI_RAPPDATO(10) = W02_PI_RAPPDATO;               00008860
            END;                                                        00008870
        WHEN(11)                                                        00008880
            DO;                                                         00008890
               S001I03O.ÅR11O    = W02_PI_ÅR;                           00008900
               S001I03O.TYPE11O  = W02_PI_TYPE;                         00008910
               S001I03O.BELØP11O = W02_PI * 100;                        00008920
               W02.TAB_PI_ÅR(11)       = W02_PI_ÅR;                     00008930
               W02.TAB_PI_KODE(11)     = W02_PI_KODE;                   00008940
               W02.TAB_PI(11)          = W02_PI;                        00008950
               W02.TAB_PI_KOMMNR(11)   = W02_PI_KOMMNR;                 00008960
               W02.TAB_PI_RAPPDATO(11) = W02_PI_RAPPDATO;               00008970
            END;                                                        00008980
        WHEN(12)                                                        00008990
            DO;                                                         00009000
               S001I03O.ÅR12O    = W02_PI_ÅR;                           00009010
               S001I03O.TYPE12O  = W02_PI_TYPE;                         00009020
               S001I03O.BELØP12O = W02_PI * 100;                        00009030
               W02.TAB_PI_ÅR(12)       = W02_PI_ÅR;                     00009040
               W02.TAB_PI_KODE(12)     = W02_PI_KODE;                   00009050
               W02.TAB_PI(12)          = W02_PI;                        00009060
               W02.TAB_PI_KOMMNR(12)   = W02_PI_KOMMNR;                 00009070
               W02.TAB_PI_RAPPDATO(12) = W02_PI_RAPPDATO;               00009080
            END;                                                        00009090
        WHEN(13)                                                        00009100
            DO;                                                         00009110
               S001I03O.ÅR13O    = W02_PI_ÅR;                           00009120
               S001I03O.TYPE13O  = W02_PI_TYPE;                         00009130
               S001I03O.BELØP13O = W02_PI * 100;                        00009140
               W02.TAB_PI_ÅR(13)       = W02_PI_ÅR;                     00009150
               W02.TAB_PI_KODE(13)     = W02_PI_KODE;                   00009160
               W02.TAB_PI(13)          = W02_PI;                        00009170
               W02.TAB_PI_KOMMNR(13)   = W02_PI_KOMMNR;                 00009180
               W02.TAB_PI_RAPPDATO(13) = W02_PI_RAPPDATO;               00009190
            END;                                                        00009200
        WHEN(14)                                                        00009210
            DO;                                                         00009220
               S001I03O.ÅR14O    = W02_PI_ÅR;                           00009230
               S001I03O.TYPE14O  = W02_PI_TYPE;                         00009240
               S001I03O.BELØP14O = W02_PI * 100;                        00009250
               W02.TAB_PI_ÅR(14)       = W02_PI_ÅR;                     00009260
               W02.TAB_PI_KODE(14)     = W02_PI_KODE;                   00009270
               W02.TAB_PI(14)          = W02_PI;                        00009280
               W02.TAB_PI_KOMMNR(14)   = W02_PI_KOMMNR;                 00009290
               W02.TAB_PI_RAPPDATO(14) = W02_PI_RAPPDATO;               00009300
            END;                                                        00009310
        WHEN(15)                                                        00009320
            DO;                                                         00009330
               S001I03O.ÅR15O    = W02_PI_ÅR;                           00009340
               S001I03O.TYPE15O  = W02_PI_TYPE;                         00009350
               S001I03O.BELØP15O = W02_PI * 100;                        00009360
               W02.TAB_PI_ÅR(15)       = W02_PI_ÅR;                     00009370
               W02.TAB_PI_KODE(15)     = W02_PI_KODE;                   00009380
               W02.TAB_PI(15)          = W02_PI;                        00009390
               W02.TAB_PI_KOMMNR(15)   = W02_PI_KOMMNR;                 00009400
               W02.TAB_PI_RAPPDATO(15) = W02_PI_RAPPDATO;               00009410
            END;                                                        00009420
        WHEN(16)                                                        00009430
            DO;                                                         00009440
               S001I03O.ÅR16O    = W02_PI_ÅR;                           00009450
               S001I03O.TYPE16O  = W02_PI_TYPE;                         00009460
               S001I03O.BELØP16O = W02_PI * 100;                        00009470
               W02.TAB_PI_ÅR(16)       = W02_PI_ÅR;                     00009480
               W02.TAB_PI_KODE(16)     = W02_PI_KODE;                   00009490
               W02.TAB_PI(16)          = W02_PI;                        00009500
               W02.TAB_PI_KOMMNR(16)   = W02_PI_KOMMNR;                 00009510
               W02.TAB_PI_RAPPDATO(16) = W02_PI_RAPPDATO;               00009520
            END;                                                        00009530
        WHEN(17)                                                        00009540
            DO;                                                         00009550
               S001I03O.ÅR17O    = W02_PI_ÅR;                           00009560
               S001I03O.TYPE17O  = W02_PI_TYPE;                         00009570
               S001I03O.BELØP17O = W02_PI * 100;                        00009580
               W02.TAB_PI_ÅR(17)       = W02_PI_ÅR;                     00009590
               W02.TAB_PI_KODE(17)     = W02_PI_KODE;                   00009600
               W02.TAB_PI(17)          = W02_PI;                        00009610
               W02.TAB_PI_KOMMNR(17)   = W02_PI_KOMMNR;                 00009620
               W02.TAB_PI_RAPPDATO(17) = W02_PI_RAPPDATO;               00009630
            END;                                                        00009640
        WHEN(18)                                                        00009650
            DO;                                                         00009660
               S001I03O.ÅR18O    = W02_PI_ÅR;                           00009670
               S001I03O.TYPE18O  = W02_PI_TYPE;                         00009680
               S001I03O.BELØP18O = W02_PI * 100;                        00009690
               W02.TAB_PI_ÅR(18)       = W02_PI_ÅR;                     00009700
               W02.TAB_PI_KODE(18)     = W02_PI_KODE;                   00009710
               W02.TAB_PI(18)          = W02_PI;                        00009720
               W02.TAB_PI_KOMMNR(18)   = W02_PI_KOMMNR;                 00009730
               W02.TAB_PI_RAPPDATO(18) = W02_PI_RAPPDATO;               00009740
            END;                                                        00009750
        WHEN(19)                                                        00009760
            DO;                                                         00009770
               S001I03O.ÅR19O    = W02_PI_ÅR;                           00009780
               S001I03O.TYPE19O  = W02_PI_TYPE;                         00009790
               S001I03O.BELØP19O = W02_PI * 100;                        00009800
               W02.TAB_PI_ÅR(19)       = W02_PI_ÅR;                     00009810
               W02.TAB_PI_KODE(19)     = W02_PI_KODE;                   00009820
               W02.TAB_PI(19)          = W02_PI;                        00009830
               W02.TAB_PI_KOMMNR(19)   = W02_PI_KOMMNR;                 00009840
               W02.TAB_PI_RAPPDATO(19) = W02_PI_RAPPDATO;               00009850
            END;                                                        00009860
        WHEN(20)                                                        00009870
            DO;                                                         00009880
               S001I03O.ÅR20O    = W02_PI_ÅR;                           00009890
               S001I03O.TYPE20O  = W02_PI_TYPE;                         00009900
               S001I03O.BELØP20O = W02_PI * 100;                        00009910
               W02.TAB_PI_ÅR(20)       = W02_PI_ÅR;                     00009920
               W02.TAB_PI_KODE(20)     = W02_PI_KODE;                   00009930
               W02.TAB_PI(20)          = W02_PI;                        00009940
               W02.TAB_PI_KOMMNR(20)   = W02_PI_KOMMNR;                 00009950
               W02.TAB_PI_RAPPDATO(20) = W02_PI_RAPPDATO;               00009960
            END;                                                        00009970
        WHEN(21)                                                        00009980
            DO;                                                         00009990
               S001I03O.ÅR21O    = W02_PI_ÅR;                           00010000
               S001I03O.TYPE21O  = W02_PI_TYPE;                         00010010
               S001I03O.BELØP21O = W02_PI * 100;                        00010020
               W02.TAB_PI_ÅR(21)       = W02_PI_ÅR;                     00010030
               W02.TAB_PI_KODE(21)     = W02_PI_KODE;                   00010040
               W02.TAB_PI(21)          = W02_PI;                        00010050
               W02.TAB_PI_KOMMNR(21)   = W02_PI_KOMMNR;                 00010060
               W02.TAB_PI_RAPPDATO(21) = W02_PI_RAPPDATO;               00010070
            END;                                                        00010080
        WHEN(22)                                                        00010090
            DO;                                                         00010100
               S001I03O.ÅR22O    = W02_PI_ÅR;                           00010110
               S001I03O.TYPE22O  = W02_PI_TYPE;                         00010120
               S001I03O.BELØP22O = W02_PI * 100;                        00010130
               W02.TAB_PI_ÅR(22)       = W02_PI_ÅR;                     00010140
               W02.TAB_PI_KODE(22)     = W02_PI_KODE;                   00010150
               W02.TAB_PI(22)          = W02_PI;                        00010160
               W02.TAB_PI_KOMMNR(22)   = W02_PI_KOMMNR;                 00010170
               W02.TAB_PI_RAPPDATO(22) = W02_PI_RAPPDATO;               00010180
            END;                                                        00010190
        WHEN(23)                                                        00010200
            DO;                                                         00010210
               S001I03O.ÅR23O    = W02_PI_ÅR;                           00010220
               S001I03O.TYPE23O  = W02_PI_TYPE;                         00010230
               S001I03O.BELØP23O = W02_PI * 100;                        00010240
               W02.TAB_PI_ÅR(23)       = W02_PI_ÅR;                     00010250
               W02.TAB_PI_KODE(23)     = W02_PI_KODE;                   00010260
               W02.TAB_PI(23)          = W02_PI;                        00010270
               W02.TAB_PI_KOMMNR(23)   = W02_PI_KOMMNR;                 00010280
               W02.TAB_PI_RAPPDATO(23) = W02_PI_RAPPDATO;               00010290
            END;                                                        00010300
        WHEN(24)                                                        00010310
            DO;                                                         00010320
               S001I03O.ÅR24O    = W02_PI_ÅR;                           00010330
               S001I03O.TYPE24O  = W02_PI_TYPE;                         00010340
               S001I03O.BELØP24O = W02_PI * 100;                        00010350
               W02.TAB_PI_ÅR(24)       = W02_PI_ÅR;                     00010360
               W02.TAB_PI_KODE(24)     = W02_PI_KODE;                   00010370
               W02.TAB_PI(24)          = W02_PI;                        00010380
               W02.TAB_PI_KOMMNR(24)   = W02_PI_KOMMNR;                 00010390
               W02.TAB_PI_RAPPDATO(24) = W02_PI_RAPPDATO;               00010400
            END;                                                        00010410
        OTHERWISE;                                                      00010420
     END;                                                               00010430
  END FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR;                                   00010440
                                                                        00010450
                                                                        00010460
  MARKER_LINJE:                                                         00010470
     PROC;                                                              00010480
     SELECT(I);                                                         00010490
        WHEN(1)                                                         00010500
            S001I03I.MRK1I    = 'M';                                    00010510
        WHEN(2)                                                         00010520
            S001I03I.MRK2I    = 'M';                                    00010530
        WHEN(3)                                                         00010540
            S001I03I.MRK3I    = 'M';                                    00010550
        WHEN(4)                                                         00010560
            S001I03I.MRK4I    = 'M';                                    00010570
        WHEN(5)                                                         00010580
            S001I03I.MRK5I    = 'M';                                    00010590
        WHEN(6)                                                         00010600
            S001I03I.MRK6I    = 'M';                                    00010610
        WHEN(7)                                                         00010620
            S001I03I.MRK7I    = 'M';                                    00010630
        WHEN(8)                                                         00010640
            S001I03I.MRK8I    = 'M';                                    00010650
        WHEN(9)                                                         00010660
            S001I03I.MRK9I    = 'M';                                    00010670
        WHEN(10)                                                        00010680
            S001I03I.MRK10I    = 'M';                                   00010690
        WHEN(11)                                                        00010700
            S001I03I.MRK11I    = 'M';                                   00010710
        WHEN(12)                                                        00010720
            S001I03I.MRK12I    = 'M';                                   00010730
        WHEN(13)                                                        00010740
            S001I03I.MRK13I    = 'M';                                   00010750
        WHEN(14)                                                        00010760
            S001I03I.MRK14I    = 'M';                                   00010770
        WHEN(15)                                                        00010780
            S001I03I.MRK15I    = 'M';                                   00010790
        WHEN(16)                                                        00010800
            S001I03I.MRK16I    = 'M';                                   00010810
        WHEN(17)                                                        00010820
            S001I03I.MRK17I    = 'M';                                   00010830
        WHEN(18)                                                        00010840
            S001I03I.MRK18I    = 'M';                                   00010850
        WHEN(19)                                                        00010860
            S001I03I.MRK19I    = 'M';                                   00010870
        WHEN(20)                                                        00010880
            S001I03I.MRK20I    = 'M';                                   00010890
        WHEN(21)                                                        00010900
            S001I03I.MRK21I    = 'M';                                   00010910
        WHEN(22)                                                        00010920
            S001I03I.MRK22I    = 'M';                                   00010930
        WHEN(23)                                                        00010940
            S001I03I.MRK23I    = 'M';                                   00010950
        WHEN(24)                                                        00010960
            S001I03I.MRK24I    = 'M';                                   00010970
        OTHERWISE;                                                      00010980
     END;                                                               00010990
  END MARKER_LINJE;                                                     00011000
                                                                        00011010
                                                                        00011020
                                                                        00011030
                                                                        00011040
                                                                        00011050
  BEHANDLE_MARKERTE_LINJER:                                             00011060
   PROC;                                                                00011070
     IF S001I03I.MRK1I = 'M' THEN                                       00011080
        DO;                                                             00011090
           S001I03O.MRK1O   = '*';                                      00011100
           S001I03I.ÅR1I    = LOW_VALUES;                               00011110
           S001I03I.TYPE1I  = LOW_VALUES;                               00011120
           S001I03I.BELØP1I = LOW_VALUES;                               00011130
        END;                                                            00011140
     IF S001I03I.MRK2I = 'M' THEN                                       00011150
        DO;                                                             00011160
           S001I03O.MRK2O   = '*';                                      00011170
           S001I03I.ÅR2I    = LOW_VALUES;                               00011180
           S001I03I.TYPE2I  = LOW_VALUES;                               00011190
           S001I03I.BELØP2I = LOW_VALUES;                               00011200
        END;                                                            00011210
     IF S001I03I.MRK3I = 'M' THEN                                       00011220
        DO;                                                             00011230
           S001I03O.MRK3O   = '*';                                      00011240
           S001I03I.ÅR3I    = LOW_VALUES;                               00011250
           S001I03I.TYPE3I  = LOW_VALUES;                               00011260
           S001I03I.BELØP3I = LOW_VALUES;                               00011270
        END;                                                            00011280
     IF S001I03I.MRK4I = 'M' THEN                                       00011290
        DO;                                                             00011300
           S001I03O.MRK4O   = '*';                                      00011310
           S001I03I.ÅR4I    = LOW_VALUES;                               00011320
           S001I03I.TYPE4I  = LOW_VALUES;                               00011330
           S001I03I.BELØP4I = LOW_VALUES;                               00011340
        END;                                                            00011350
     IF S001I03I.MRK5I = 'M' THEN                                       00011360
        DO;                                                             00011370
           S001I03O.MRK5O   = '*';                                      00011380
           S001I03I.ÅR5I    = LOW_VALUES;                               00011390
           S001I03I.TYPE5I  = LOW_VALUES;                               00011400
           S001I03I.BELØP5I = LOW_VALUES;                               00011410
        END;                                                            00011420
     IF S001I03I.MRK6I = 'M' THEN                                       00011430
        DO;                                                             00011440
           S001I03O.MRK6O   = '*';                                      00011450
           S001I03I.ÅR6I    = LOW_VALUES;                               00011460
           S001I03I.TYPE6I  = LOW_VALUES;                               00011470
           S001I03I.BELØP6I = LOW_VALUES;                               00011480
        END;                                                            00011490
     IF S001I03I.MRK7I = 'M' THEN                                       00011500
        DO;                                                             00011510
           S001I03O.MRK7O   = '*';                                      00011520
           S001I03I.ÅR7I    = LOW_VALUES;                               00011530
           S001I03I.TYPE7I  = LOW_VALUES;                               00011540
           S001I03I.BELØP7I = LOW_VALUES;                               00011550
        END;                                                            00011560
     IF S001I03I.MRK8I = 'M' THEN                                       00011570
        DO;                                                             00011580
           S001I03O.MRK8O   = '*';                                      00011590
           S001I03I.ÅR8I    = LOW_VALUES;                               00011600
           S001I03I.TYPE8I  = LOW_VALUES;                               00011610
           S001I03I.BELØP8I = LOW_VALUES;                               00011620
        END;                                                            00011630
     IF S001I03I.MRK9I = 'M' THEN                                       00011640
        DO;                                                             00011650
           S001I03O.MRK9O   = '*';                                      00011660
           S001I03I.ÅR9I    = LOW_VALUES;                               00011670
           S001I03I.TYPE9I  = LOW_VALUES;                               00011680
           S001I03I.BELØP9I = LOW_VALUES;                               00011690
        END;                                                            00011700
     IF S001I03I.MRK10I = 'M' THEN                                      00011710
        DO;                                                             00011720
           S001I03O.MRK10O   = '*';                                     00011730
           S001I03I.ÅR10I    = LOW_VALUES;                              00011740
           S001I03I.TYPE10I  = LOW_VALUES;                              00011750
           S001I03I.BELØP10I = LOW_VALUES;                              00011760
        END;                                                            00011770
     IF S001I03I.MRK11I = 'M' THEN                                      00011780
        DO;                                                             00011790
           S001I03O.MRK11O   = '*';                                     00011800
           S001I03I.ÅR11I    = LOW_VALUES;                              00011810
           S001I03I.TYPE11I  = LOW_VALUES;                              00011820
           S001I03I.BELØP11I = LOW_VALUES;                              00011830
        END;                                                            00011840
     IF S001I03I.MRK12I = 'M' THEN                                      00011850
        DO;                                                             00011860
           S001I03O.MRK12O   = '*';                                     00011870
           S001I03I.ÅR12I    = LOW_VALUES;                              00011880
           S001I03I.TYPE12I  = LOW_VALUES;                              00011890
           S001I03I.BELØP12I = LOW_VALUES;                              00011900
        END;                                                            00011910
     IF S001I03I.MRK13I = 'M' THEN                                      00011920
        DO;                                                             00011930
           S001I03O.MRK13O   = '*';                                     00011940
           S001I03I.ÅR13I    = LOW_VALUES;                              00011950
           S001I03I.TYPE13I  = LOW_VALUES;                              00011960
           S001I03I.BELØP13I = LOW_VALUES;                              00011970
        END;                                                            00011980
     IF S001I03I.MRK14I = 'M' THEN                                      00011990
        DO;                                                             00012000
           S001I03O.MRK14O   = '*';                                     00012010
           S001I03I.ÅR14I    = LOW_VALUES;                              00012020
           S001I03I.TYPE14I  = LOW_VALUES;                              00012030
           S001I03I.BELØP14I = LOW_VALUES;                              00012040
        END;                                                            00012050
     IF S001I03I.MRK15I = 'M' THEN                                      00012060
        DO;                                                             00012070
           S001I03O.MRK15O   = '*';                                     00012080
           S001I03I.ÅR15I    = LOW_VALUES;                              00012090
           S001I03I.TYPE15I  = LOW_VALUES;                              00012100
           S001I03I.BELØP15I = LOW_VALUES;                              00012110
        END;                                                            00012120
     IF S001I03I.MRK16I = 'M' THEN                                      00012130
        DO;                                                             00012140
           S001I03O.MRK16O   = '*';                                     00012150
           S001I03I.ÅR16I    = LOW_VALUES;                              00012160
           S001I03I.TYPE16I  = LOW_VALUES;                              00012170
           S001I03I.BELØP16I = LOW_VALUES;                              00012180
        END;                                                            00012190
     IF S001I03I.MRK17I = 'M' THEN                                      00012200
        DO;                                                             00012210
           S001I03O.MRK17O   = '*';                                     00012220
           S001I03I.ÅR17I    = LOW_VALUES;                              00012230
           S001I03I.TYPE17I  = LOW_VALUES;                              00012240
           S001I03I.BELØP17I = LOW_VALUES;                              00012250
        END;                                                            00012260
     IF S001I03I.MRK18I = 'M' THEN                                      00012270
        DO;                                                             00012280
           S001I03O.MRK18O   = '*';                                     00012290
           S001I03I.ÅR18I    = LOW_VALUES;                              00012300
           S001I03I.TYPE18I  = LOW_VALUES;                              00012310
           S001I03I.BELØP18I = LOW_VALUES;                              00012320
        END;                                                            00012330
     IF S001I03I.MRK19I = 'M' THEN                                      00012340
        DO;                                                             00012350
           S001I03O.MRK19O   = '*';                                     00012360
           S001I03I.ÅR19I    = LOW_VALUES;                              00012370
           S001I03I.TYPE19I  = LOW_VALUES;                              00012380
           S001I03I.BELØP19I = LOW_VALUES;                              00012390
        END;                                                            00012400
     IF S001I03I.MRK20I = 'M' THEN                                      00012410
        DO;                                                             00012420
           S001I03O.MRK20O   = '*';                                     00012430
           S001I03I.ÅR20I    = LOW_VALUES;                              00012440
           S001I03I.TYPE20I  = LOW_VALUES;                              00012450
           S001I03I.BELØP20I = LOW_VALUES;                              00012460
        END;                                                            00012470
     IF S001I03I.MRK21I = 'M' THEN                                      00012480
        DO;                                                             00012490
           S001I03O.MRK21O   = '*';                                     00012500
           S001I03I.ÅR21I    = LOW_VALUES;                              00012510
           S001I03I.TYPE21I  = LOW_VALUES;                              00012520
           S001I03I.BELØP21I = LOW_VALUES;                              00012530
        END;                                                            00012540
     IF S001I03I.MRK22I = 'M' THEN                                      00012550
        DO;                                                             00012560
           S001I03O.MRK22O   = '*';                                     00012570
           S001I03I.ÅR22I    = LOW_VALUES;                              00012580
           S001I03I.TYPE22I  = LOW_VALUES;                              00012590
           S001I03I.BELØP22I = LOW_VALUES;                              00012600
        END;                                                            00012610
     IF S001I03I.MRK23I = 'M' THEN                                      00012620
        DO;                                                             00012630
           S001I03O.MRK23O   = '*';                                     00012640
           S001I03I.ÅR23I    = LOW_VALUES;                              00012650
           S001I03I.TYPE23I  = LOW_VALUES;                              00012660
           S001I03I.BELØP23I = LOW_VALUES;                              00012670
        END;                                                            00012680
     IF S001I03I.MRK24I = 'M' THEN                                      00012690
        DO;                                                             00012700
           S001I03O.MRK24O   = '*';                                     00012710
           S001I03I.ÅR24I    = LOW_VALUES;                              00012720
           S001I03I.TYPE24I  = LOW_VALUES;                              00012730
           S001I03I.BELØP24I = LOW_VALUES;                              00012740
        END;                                                            00012750
                                                                        00012760
  END BEHANDLE_MARKERTE_LINJER;                                         00012770
                                                                        00012780
                                                                        00012790
                                                                        00012800
  FJERN_INNTEKTER:                                                      00012810
     PROC;                                                              00012820
                                                                        00012830
                                                                        00012840
     IF S001I03O.MRK1O = '*' THEN                                       00012850
        CALL SKRIV_INNT  (1);                                           00012860
                                                                        00012870
     IF S001I03O.MRK2O = '*' THEN                                       00012880
        CALL SKRIV_INNT  (2);                                           00012890
                                                                        00012900
     IF S001I03O.MRK3O = '*' THEN                                       00012910
        CALL SKRIV_INNT  (3);                                           00012920
                                                                        00012930
     IF S001I03O.MRK4O = '*' THEN                                       00012940
        CALL SKRIV_INNT  (4);                                           00012950
                                                                        00012960
     IF S001I03O.MRK5O = '*' THEN                                       00012970
        CALL SKRIV_INNT  (5);                                           00012980
                                                                        00012990
     IF S001I03O.MRK6O = '*' THEN                                       00013000
        CALL SKRIV_INNT  (6);                                           00013010
                                                                        00013020
     IF S001I03O.MRK7O = '*' THEN                                       00013030
        CALL SKRIV_INNT  (7);                                           00013040
                                                                        00013050
     IF S001I03O.MRK8O = '*' THEN                                       00013060
        CALL SKRIV_INNT  (8);                                           00013070
                                                                        00013080
     IF S001I03O.MRK9O = '*' THEN                                       00013090
        CALL SKRIV_INNT  (9);                                           00013100
                                                                        00013110
     IF S001I03O.MRK10O = '*' THEN                                      00013120
        CALL SKRIV_INNT  (10);                                          00013130
                                                                        00013140
     IF S001I03O.MRK11O = '*' THEN                                      00013150
        CALL SKRIV_INNT  (11);                                          00013160
                                                                        00013170
     IF S001I03O.MRK12O = '*' THEN                                      00013180
        CALL SKRIV_INNT  (12);                                          00013190
                                                                        00013200
     IF S001I03O.MRK13O = '*' THEN                                      00013210
        CALL SKRIV_INNT  (13);                                          00013220
                                                                        00013230
     IF S001I03O.MRK14O = '*' THEN                                      00013240
        CALL SKRIV_INNT  (14);                                          00013250
                                                                        00013260
     IF S001I03O.MRK15O = '*' THEN                                      00013270
        CALL SKRIV_INNT  (15);                                          00013280
                                                                        00013290
     IF S001I03O.MRK16O = '*' THEN                                      00013300
        CALL SKRIV_INNT  (16);                                          00013310
                                                                        00013320
     IF S001I03O.MRK17O = '*' THEN                                      00013330
        CALL SKRIV_INNT  (17);                                          00013340
                                                                        00013350
     IF S001I03O.MRK18O = '*' THEN                                      00013360
        CALL SKRIV_INNT  (18);                                          00013370
                                                                        00013380
     IF S001I03O.MRK19O = '*' THEN                                      00013390
        CALL SKRIV_INNT  (19);                                          00013400
                                                                        00013410
     IF S001I03O.MRK20O = '*' THEN                                      00013420
        CALL SKRIV_INNT  (20);                                          00013430
                                                                        00013440
     IF S001I03O.MRK21O = '*' THEN                                      00013450
        CALL SKRIV_INNT  (21);                                          00013460
                                                                        00013470
     IF S001I03O.MRK22O = '*' THEN                                      00013480
        CALL SKRIV_INNT  (22);                                          00013490
                                                                        00013500
     IF S001I03O.MRK23O = '*' THEN                                      00013510
        CALL SKRIV_INNT  (23);                                          00013520
                                                                        00013530
     IF S001I03O.MRK24O = '*' THEN                                      00013540
        CALL SKRIV_INNT  (24);                                          00013550
                                                                        00013560
  END FJERN_INNTEKTER;                                                  00013570
                                                                        00013580
                                                                        00013590
                                                                        00013600
  SKRIV_INNT:                                                           00013610
   PROC      (I);                                                       00013620
                                                                        00013630
                                                                        00013640
   DCL I                                  PIC '99';                     00013650
                                                                        00013660
   W02_PI_ÅR                 = W02.TAB_PI_ÅR      (I);                  00013670
   W02_PI_KODE               = W02.TAB_PI_KODE    (I);                  00013680
   W02_PI                    = W02.TAB_PI         (I);                  00013690
   W02_PI_KOMMNR             = W02.TAB_PI_KOMMNR  (I);                  00013700
   W02_PI_RAPPDATO           = W02.TAB_PI_RAPPDATO(I);                  00013710
   SSA1_RF0PERSN.PKEY        = FRA_FNR;                                 00013720
                                                                        00013730
   /*----------------------------------------------------------------*/ 00013740
   /* SKRIVER FJERNET RECORD TIL STRYK-REG.                          */ 00013750
   /*     FEIL_MELD_NR = 9999   ==>    RECORD LÅ INNE. IKKE FEIL.    */ 00013760
   /*----------------------------------------------------------------*/ 00013770
                                                                        00013780
   CALL P9958_BEH_STRYK_REG ('SKRIV' , SSA1_RF0PERSN.PKEY , W02_PI_ÅR); 00013790
                                                                        00013800
   IF FEIL_MELD_NR           =    9999                      THEN        00013810
      FEIL_MELD_NR           =    0                                   ; 00013820
   ELSE IF                                                              00013830
      FEIL_MELD_NR           >    0                         THEN        00013840
      DO;                                                               00013850
         FATAL_FEIL          =   '1'B ;                                 00013860
         GO TO RETUR;                                                   00013870
      END;                                                              00013880
                                                                        00013890
   MAP_MELDING               = 'STRYK-REGISTERET OPPDATERT !';          00013900
                                                                        00013910
   CALL P10_FJERN_PINNTEKT;                                             00013920
                                                                        00013930
   IF FEIL_MELD_NR           >    0                         THEN        00013940
      DO;                                                               00013950
         FATAL_FEIL          =   '1'B ;                                 00013960
         GO TO RETUR;                                                   00013970
      END;                                                              00013980
                                                                        00013990
   W02_INNT_MÅ                        =    W02_PI_ÅR + 100;             00014000
                                                                        00014010
   IF F_ALDER(W02_INNT_MÅ,FRA_FNR)    =    66                THEN       00014020
      INNT_ALDER_FRA                  =   '66';                         00014030
   ELSE                                                                 00014040
      IF F_ALDER(W02_INNT_MÅ,FRA_FNR) =    69                THEN       00014050
         INNT_ALDER_FRA               =   '69';                         00014060
                                                                        00014070
                                                                        00014080
                                                                        00014090
                                                                        00014100
  SKRIV_LISTEDATA:                                                      00014110
                                                                        00014120
  /* **************************************************************** */00014130
  /*HENSIKT:                                                          */00014140
  /*    SKRIVER OPPLYSNINGER UT PÅ P001.OLINNTE FOR BRUK VED UTSKRIFT */00014150
  /*    AV KONTROLLISTE.                                              */00014160
  /*                                                                  */00014170
  /*BRUK:                                                             */00014180
  /*    CALL SKRIV_LISTEDATA;                                         */00014190
  /*                                                                  */00014200
  /* **************************************************************** */00014210
                                                                        00014220
                                                                        00014230
                                                                        00014240
   DCL                                                                  00014250
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00014260
      KEY_PEKER                  POINTER                ,               00014270
      KEY_RECL                   CHAR (97)              ,               00014280
      KEY                        CHAR (41)              ;               00014290
   DCL                                                                  00014300
      LISTE_RECL                 CHAR(97)   ;                           00014310
   DCL                                                                  00014320
      01 REC_OMR  DEF LISTE_RECL,                                       00014330
         02 KONTOR               CHAR(3)    ,                           00014340
         02 TERMID               CHAR(4)    ,                           00014350
         02 FNR                  PIC '(11)9',                           00014360
         02 REGTPK               CHAR(6)    ,                           00014370
         02 IÅR                  PIC '(2)9' ,                           00014380
         02 BLTYPE               CHAR(1)    ,                           00014390
         02 IART                 CHAR(1)    ,                           00014400
         02 KOMMNR1              PIC '(4)9' ,                           00014410
         02 AGIVNR               PIC '(3)9' ,                           00014420
         02 RAPPDATO             PIC '(6)9' ,                           00014430
         02 NAVN                 CHAR(25)   ,                           00014440
         02 INNTEKT              PIC '(7)9' ,                           00014450
         02 ETYPE                CHAR(1)    ,                           00014460
         02 MERKE                CHAR(1)    ,                           00014470
         02 DÅR                  PIC '(2)9' ,                           00014480
         02 KOMMNR2              PIC '(4)9' ,                           00014490
         02 BRUKERID             CHAR(4)    ,                           00014500
         02 FNR2                 PIC '(11)9',                           00014510
         02 INDEKS               CHAR(1)    ;                           00014520
   DCL                                                                  00014530
      01 HDATO                   PIC '(6)9';                            00014540
   DCL                                                                  00014550
      01 HDATO_REDEF DEF HDATO,                                         00014560
         02 ÅR                   PIC '(2)9',                            00014570
         02 MND                  PIC '(2)9',                            00014580
         02 DAG                  PIC '(2)9';                            00014590
   DCL                                                                  00014600
      01 NYKKEL     DEF KEY,                                            00014610
         02 KONTOR_N             CHAR(3)    ,                           00014620
         02 TERMID_N             CHAR(4)    ,                           00014630
         02 FNR_N                PIC '(11)9',                           00014640
         02 REGTPK_N             CHAR(6)    ,                           00014650
         02 IÅR_N                PIC '(2)9' ,                           00014660
         02 BLTYPE_N             CHAR(1)    ,                           00014670
         02 IART_N               CHAR(1)    ,                           00014680
         02 KOMMNR1_N            PIC '(4)9' ,                           00014690
         02 AGIVNR_N             PIC '(3)9' ,                           00014700
         02 RAPPDATO_N           PIC '(6)9' ;                           00014710
   DCL                                                                  00014720
      01 DATO                    PIC '(6)9';                            00014730
   DCL                                                                  00014740
      01 DATO_REDEF DEF DATO,                                           00014750
         02 DAG                  PIC '(2)9',                            00014760
         02 MND                  PIC '(2)9',                            00014770
         02 ÅR                   PIC '(2)9';                            00014780
                                                                        00014790
   DCL                                                                  00014800
      (DATE, TIME)    BUILTIN;                                          00014810
   DCL                                                                  00014820
      01 W02_BLTYPE              CHAR(1),                               00014830
      01 W02_ART                 CHAR(1);                               00014840
                                                                        00014850
                                                                        00014860
   DCL 1  TID,                                                          00014870
          2  TID1                          CHAR (6), /* TT,MM,.SEK    */00014880
          2  TID2                          CHAR (3); /* MILL.SEK.     */00014890
  DCL TID_D          DEFINED   TID         CHAR (9);                    00014900
                                                                        00014910
                                                                        00014920
                                                                        00014930
                                                                        00014940
     SELECT(W02_PI_TYPE);                                               00014950
                                                                        00014960
        WHEN('B','C','D')                                               00014970
                                                                        00014980
           DO;                                                          00014990
              W02_BLTYPE = 'B';                                         00015000
                                                                        00015010
              IF W02_PI_TYPE = 'B' THEN                                 00015020
                 W02_ART    = '1';                                      00015030
              ELSE                                                      00015040
                 IF W02_PI_TYPE = 'C' THEN                              00015050
                    W02_ART    = '2';                                   00015060
                 ELSE                                                   00015070
                    IF W02_PI_TYPE = 'D' THEN                           00015080
                       W02_ART    = '3';                                00015090
           END;                                                         00015100
                                                                        00015110
        WHEN('E','F')                                                   00015120
                                                                        00015130
           DO;                                                          00015140
              W02_BLTYPE = 'C';                                         00015150
                                                                        00015160
              IF W02_PI_TYPE = 'E' THEN                                 00015170
                 W02_ART    = '1';                                      00015180
              ELSE                                                      00015190
                 IF W02_PI_TYPE = 'F' THEN                              00015200
                    W02_ART    = '2';                                   00015210
           END;                                                         00015220
                                                                        00015230
        WHEN('H','I')                                                   00015240
                                                                        00015250
           DO;                                                          00015260
              W02_BLTYPE = 'D';                                         00015270
                                                                        00015280
              IF W02_PI_TYPE = 'H' THEN                                 00015290
                 W02_ART    = '1';                                      00015300
              ELSE                                                      00015310
                 IF W02_PI_TYPE = 'I' THEN                              00015320
                    W02_ART    = '2';                                   00015330
           END;                                                         00015340
                                                                        00015350
        WHEN('S','T')                                                   00015360
                                                                        00015370
           DO;                                                          00015380
              W02_BLTYPE = 'S';                                         00015390
                                                                        00015400
              IF W02_PI_TYPE = 'S' THEN                                 00015410
                 W02_ART    = '1';                                      00015420
              ELSE                                                      00015430
                 IF W02_PI_TYPE = 'T' THEN                              00015440
                    W02_ART    = '2';                                   00015450
           END;                                                         00015460
                                                                        00015470
        WHEN('V','W')                                                   00015480
                                                                        00015490
           DO;                                                          00015500
              W02_BLTYPE = 'U';                                         00015510
                                                                        00015520
              IF W02_PI_TYPE = 'V' THEN                                 00015530
                 W02_ART    = '1';                                      00015540
              ELSE                                                      00015550
                 IF W02_PI_TYPE = 'W' THEN                              00015560
                    W02_ART    = '2';                                   00015570
           END;                                                         00015580
                                                                        00015590
        OTHERWISE                                                       00015600
           ;                                                            00015610
     END;                                                               00015620
                                                                        00015630
                                                                        00015640
                                                                        00015650
      HDATO             = DATE();                                       00015660
      TID_D             = TIME  ;                                       00015670
                                                                        00015680
      DATO_REDEF.ÅR     = HDATO_REDEF.ÅR ;                              00015690
      DATO_REDEF.MND    = HDATO_REDEF.MND;                              00015700
      DATO_REDEF.DAG    = HDATO_REDEF.DAG;                              00015710
                                                                        00015720
      LISTE_RECL        = ''               ;                            00015730
      REC_OMR.KONTOR    = 'END'            ;                            00015740
      REC_OMR.FNR       = FRA_FNR          ;                            00015750
      REC_OMR.NAVN      = 'FJERNET'        ;                            00015760
      REC_OMR.TERMID    = EIBTRMID         ;                            00015770
      REC_OMR.REGTPK    = TID1             ;                            00015780
      REC_OMR.BRUKERID  = STYRINGS_OMR.BRUKERID;                        00015790
      REC_OMR.IÅR       = W02_PI_ÅR        ;                            00015800
      REC_OMR.BLTYPE    = W02_BLTYPE       ;                            00015810
      REC_OMR.IART      = W02_ART          ;                            00015820
      REC_OMR.MERKE     = 'F'              ;                            00015830
      REC_OMR.KOMMNR1   = W02_PI_KOMMNR    ;                            00015840
      REC_OMR.RAPPDATO  = DATO             ;                            00015850
      REC_OMR.AGIVNR    = 0                ;                            00015860
      REC_OMR.INNTEKT   = W02_PI * 100     ;                            00015870
      REC_OMR.INDEKS    = '5'              ;                            00015880
                                                                        00015890
      NYKKEL.KONTOR_N   = 'END'            ;                            00015900
      NYKKEL.TERMID_N   = EIBTRMID         ;                            00015910
      NYKKEL.FNR_N      = FRA_FNR          ;                            00015920
      NYKKEL.REGTPK_N   = TID1             ;                            00015930
      NYKKEL.IÅR_N      = W02_PI_ÅR        ;                            00015940
      NYKKEL.IART_N     = W02_ART          ;                            00015950
      NYKKEL.BLTYPE_N   = W02_BLTYPE       ;                            00015960
      NYKKEL.KOMMNR1_N  = W02_PI_KOMMNR    ;                            00015970
      NYKKEL.AGIVNR_N   = 0                ;                            00015980
      NYKKEL.RAPPDATO_N = DATO             ;                            00015990
      KEY_PEKER         = ADDR(KEY)        ;                            00016000
      KEY_RECL          = LISTE_RECL       ;                            00016010
                                                                        00016020
                                                                        00016030
      EXEC CICS HANDLE CONDITION ERROR    (L105)             ;          00016040
      EXEC CICS HANDLE CONDITION DUPREC   (ALT_OK)           ;          00016050
      EXEC CICS WRITE  DATASET ('OLINNTE') RIDFLD  (KEY_BIT )           00016060
                                           FROM    (KEY_RECL);          00016070
      GOTO ALT_OK;                                                      00016080
                                                                        00016090
   L105:                                                                00016100
      FEIL_MELD_NR                =    505 ;                            00016110
      FEIL_VED_LABEL              =   '105';                            00016120
      FATAL_FEIL                  =   '1'B ;                            00016130
                                                                        00016140
   ALT_OK:                                                              00016150
   RETUR:                                                               00016160
                                                                        00016170
  END SKRIV_INNT;                                                       00016180
                                                                        00016190
                                                                        00016200
                                                                        00016210
  P10_FJERN_PINNTEKT:                                                   00016220
     PROC;                                                              00016230
                                                                        00016240
  /* **************************************************************** */00016250
  /*HENSIKT:                                                          */00016260
  /*    FJERNER PINNTEKT MED ØNSKET KEY.                              */00016270
  /*                                                                  */00016280
  /*                                                                  */00016290
  /*BRUK:                                                             */00016300
  /*    CALL P10_FJERN_PINNTEKT;                                      */00016310
  /*                                                                  */00016320
  /* **************************************************************** */00016330
                                                                        00016340
                                                                        00016350
      SSA1_PINNTEKT.ÅR                 =     W02_PI_ÅR;                 00016360
      SSA1_PINNTEKT.TYPE               =     W02_PI_TYPE;               00016370
                                                                        00016380
                                                                        00016390
    /* ************************************************************** */00016400
    /* TAR ET GHU-KALL,FØR DLET.                                      */00016410
    /* ************************************************************** */00016420
                                                                        00016430
                                                                        00016440
      CALL PLITDLI                        (W02_PARM_CT_5,               00016450
                                           W02_GHU,                     00016460
                                           RF1,                         00016470
                                           W01_PINT,                    00016480
                                           SSA1_RF0PERSN,               00016490
                                           SSA1_PINNTEKT);              00016500
                                                                        00016510
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                    00016520
          ! RF1.STATUS_KODE         ^=       '  '         THEN          00016530
          DO;                                                           00016540
              /* ******************************************** */        00016550
              /* FEIL VED LES   AV :  PINNTEKT                */        00016560
              /* ******************************************** */        00016570
  L110:                                                                 00016580
             FEIL_MELD_NR             =       500 ;                     00016590
             FEIL_VED_LABEL           =      '110';                     00016600
             DB_STATUS_KODE           =       RF1.STATUS_KODE;          00016610
             GO   TO  RETUR;                                            00016620
          END;                                                          00016630
                                                                        00016640
                                                                        00016650
       /* ******************************************** */               00016660
       /* KALLET GHU GIKK OK . DELETER PINNTEKT        */               00016670
       /* ******************************************** */               00016680
                                                                        00016690
       CALL PLITDLI                        (W02_PARM_CT_3,              00016700
                                           W02_DLET,                    00016710
                                           RF1,                         00016720
                                           W01_PINT);                   00016730
                                                                        00016740
       IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                   00016750
         ! RF1.STATUS_KODE         ^=       '  '         THEN           00016760
         DO;                                                            00016770
              /* ******************************************** */        00016780
              /* FEIL VED DELETE  AV :  PINNTEKT              */        00016790
              /* ******************************************** */        00016800
  L125:                                                                 00016810
            FEIL_MELD_NR             =       500 ;                      00016820
            FEIL_VED_LABEL           =      '125';                      00016830
            DB_STATUS_KODE           =       RF1.STATUS_KODE;           00016840
            GO   TO  RETUR;                                             00016850
         END;                                                           00016860
                                                                        00016870
                                                                        00016880
    /* ************************************************************** */00016890
    /*                                                                */00016900
    /* SJEKKER OM DET ER FLERE SEGMENTER UNDER ROT.                   */00016910
    /* HVIS IKKE,FJERNES ROT.                                         */00016920
    /* ************************************************************** */00016930
                                                                        00016940
                                                                        00016950
                                                                        00016960
                                                                        00016970
    /* ************************************************************** */00016980
    /*                                                                */00016990
    /* TAR ET GU-KALL,FØR GNP.                                       */ 00017000
    /*                                                                */00017010
    /* ************************************************************** */00017020
                                                                        00017030
                                                                        00017040
      CALL PLITDLI                        (W02_PARM_CT_4,               00017050
                                           W02_GU,                      00017060
                                           RF1,                         00017070
                                           RF0PERSN,                    00017080
                                           SSA1_RF0PERSN);              00017090
                                                                        00017100
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK !                  00017110
          RF1.STATUS_KODE         ^=       '  '             THEN        00017120
          DO;                                                           00017130
              /* ******************************************** */        00017140
              /* FEIL VED LES   AV :  ROT                     */        00017150
              /* ******************************************** */        00017160
  L130:                                                                 00017170
             FEIL_MELD_NR             =       500 ;                     00017180
             FEIL_VED_LABEL           =      '130';                     00017190
             GO   TO  RETUR;                                            00017200
          END;                                                          00017210
                                                                        00017220
                                                                        00017230
      CALL PLITDLI                        (W02_PARM_CT_3,               00017240
                                           W02_GNP,                     00017250
                                           RF1,                         00017260
                                           W01_IO);                     00017270
                                                                        00017280
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK THEN               00017290
          DO;                                                           00017300
              /* ******************************************** */        00017310
              /* FEIL VED LES   AV :  ROT                     */        00017320
              /* ******************************************** */        00017330
  L135:                                                                 00017340
             FEIL_MELD_NR             =       500 ;                     00017350
             FEIL_VED_LABEL           =      '135';                     00017360
             GO   TO  RETUR;                                            00017370
          END;                                                          00017380
      ELSE                                                              00017390
         IF RF1.STATUS_KODE           =   'GE'             THEN         00017400
            DO;                                                         00017410
                                                                        00017420
                                                                        00017430
    /* ************************************************************** */00017440
    /*                                                                */00017450
    /* TAR ET GHU-KALL,FØR DLET.                                      */00017460
    /*                                                                */00017470
    /* ************************************************************** */00017480
                                                                        00017490
               CALL PLITDLI                        (W02_PARM_CT_4,      00017500
                                                    W02_GHU,            00017510
                                                    RF1,                00017520
                                                    W01_IO,             00017530
                                                    SSA1_RF0PERSN);     00017540
                                                                        00017550
               IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK !         00017560
                   RF1.STATUS_KODE         ^=       '  '    THEN        00017570
                   DO;                                                  00017580
              /* ******************************************** */        00017590
              /* FEIL VED LES   AV :  ROT                     */        00017600
              /* ******************************************** */        00017610
  L140:                                                                 00017620
                      FEIL_MELD_NR             =       500 ;            00017630
                      FEIL_VED_LABEL           =      '140';            00017640
                      GO   TO  RETUR;                                   00017650
                   END;                                                 00017660
                                                                        00017670
                                                                        00017680
       /* ******************************************** */               00017690
       /* BARE ROT IGJEN.ROT FJERNES.                  */               00017700
       /* ******************************************** */               00017710
                                                                        00017720
               CALL PLITDLI                        (W02_PARM_CT_3,      00017730
                                                   W02_DLET,            00017740
                                                   RF1,                 00017750
                                                   W01_IO);             00017760
                                                                        00017770
               IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK           00017780
                 ! RF1.STATUS_KODE         ^=       '  '         THEN   00017790
                   DO;                                                  00017800
              /* ******************************************** */        00017810
              /* FEIL VED DELETE  AV :  ROT                   */        00017820
              /* ******************************************** */        00017830
  L145:                                                                 00017840
                      FEIL_MELD_NR             =       500 ;            00017850
                      FEIL_VED_LABEL           =      '145';            00017860
                      DB_STATUS_KODE           =       RF1.STATUS_KODE; 00017870
                      GO   TO  RETUR;                                   00017880
                   END;                                                 00017890
            END;                                                        00017900
                                                                        00017910
                                                                        00017920
                                                                        00017930
  RETUR:                                                                00017940
                                                                        00017950
  END P10_FJERN_PINNTEKT;                                               00017960
                                                                        00017970
                                                                        00017980
    %PAGE;                                                              00017990
    /* ************************************************************** */00018000
    /*                                                                */00018010
    /* PROCEDURE FOR LESE ROT-SEGM GU QUAL.                           */00018020
    /* PCB : RF1.                                                     */00018030
    /* ************************************************************** */00018040
                                                                        00018050
    P005_LES_ROT_QUAL_FNR:                                              00018060
      PROC;                                                             00018070
                                                                        00018080
      CALL PLITDLI                              (W02_PARM_CT_4,         00018090
                                                 W02_GET,               00018100
                                                 RF1,                   00018110
                                                 RF0PERSN,              00018120
                                                 SSA1_RF0PERSN);        00018130
                                                                        00018140
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00018150
        DO;                                                             00018160
          SELECT  ( RF1.STATUS_KODE );                                  00018170
                                                                        00018180
            WHEN  ( '  ' )                                              00018190
              W01.MER_DATA                 =    '1'B;                   00018200
                                                                        00018210
            WHEN  ( 'GE' )                                              00018220
              W01.MER_DATA                 =    '0'B;                   00018230
                                                                        00018240
            OTHERWISE                                                   00018250
              DO;                                                       00018260
                /* ************************************************** */00018270
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00018280
                /* ************************************************** */00018290
  L200:                                                                 00018300
                FEIL_MELD_NR               =     500;                   00018310
                FEIL_VED_LABEL             =    '200';                  00018320
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00018330
                W01.MER_DATA               =    '0'B;                   00018340
              END;                                                      00018350
          END;                                                          00018360
        END;                                                            00018370
      ELSE                                                              00018380
        DO;                                                             00018390
          /* ************************************************** */      00018400
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00018410
          /* ************************************************** */      00018420
  L205:                                                                 00018430
          FEIL_MELD_NR               =     500;                         00018440
          FEIL_VED_LABEL             =    '205';                        00018450
          W01.MER_DATA               =    '0'B;                         00018460
        END;                                                            00018470
    END P005_LES_ROT_QUAL_FNR;                                          00018480
                                                                        00018490
                                                                        00018500
                                                                        00018510
                                                                        00018520
    %PAGE;                                                              00018530
    /* ************************************************************** */00018540
    /*                                                                */00018550
    /* PROCEDURE FOR LESE INNT-SEGM GN QUAL.                          */00018560
    /*                                                                */00018570
    /* ************************************************************** */00018580
                                                                        00018590
    P010_LES_INNT_QUAL:                                                 00018600
      PROC;                                                             00018610
                                                                        00018620
                                                                        00018630
      CALL PLITDLI                          (W02_PARM_CT_4,             00018640
                                             W02_GET,                   00018650
                                             RF1,                       00018660
                                             W01_PINT,                  00018670
                                             SSA1_PINNTEKT);            00018680
                                                                        00018690
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00018700
        DO;                                                             00018710
          SELECT  ( RF1.STATUS_KODE );                                  00018720
                                                                        00018730
            WHEN  ( '  ' )                                              00018740
              W01.MER_DATA                 =    '1'B;                   00018750
                                                                        00018760
            WHEN  ( 'GE' )                                              00018770
              W01.MER_DATA                 =    '0'B;                   00018780
                                                                        00018790
            OTHERWISE                                                   00018800
              DO;                                                       00018810
                /* ************************************************** */00018820
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00018830
                /* ************************************************** */00018840
  L210:                                                                 00018850
                FEIL_MELD_NR               =     500;                   00018860
                FEIL_VED_LABEL             =    '210';                  00018870
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00018880
                W01.MER_DATA               =    '0'B;                   00018890
              END;                                                      00018900
          END;                                                          00018910
        END;                                                            00018920
      ELSE                                                              00018930
        DO;                                                             00018940
          /* ************************************************** */      00018950
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00018960
          /* ************************************************** */      00018970
  L220:                                                                 00018980
          FEIL_MELD_NR               =     500;                         00018990
          FEIL_VED_LABEL             =    '220';                        00019000
          W01.MER_DATA               =    '0'B;                         00019010
        END;                                                            00019020
                                                                        00019030
                                                                        00019040
    END P010_LES_INNT_QUAL;                                             00019050
                                                                        00019060
    /* ************************************************************** */00019070
    /*                                                                */00019080
    /* PROCEDURE FOR LESE NESTE PINNTEKT (GNP   UKVALIFISERT  )       */00019090
    /* PCB : RF1.                                                     */00019100
    /* ************************************************************** */00019110
                                                                        00019120
    P020_LES_NESTE_PINNTEKT_FNR:                                        00019130
      PROC;                                                             00019140
                                                                        00019150
      CALL PLITDLI                              (W02_PARM_CT_4,         00019160
                                                 W02_GNP,               00019170
                                                 RF1,                   00019180
                                                 W01_PINT,              00019190
                                                 SSA_UQUAL_PINNTEKT);   00019200
                                                                        00019210
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00019220
        DO;                                                             00019230
          SELECT ( RF1.STATUS_KODE );                                   00019240
                                                                        00019250
            WHEN ( '  ' )                                               00019260
              W01.MER_DATA                 =    '1'B;                   00019270
                                                                        00019280
            WHEN ( 'GE' , 'GB' )                                        00019290
              W01.MER_DATA                 =    '0'B;                   00019300
                                                                        00019310
            OTHERWISE                                                   00019320
              DO;                                                       00019330
                /* ************************************************** */00019340
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00019350
                /* ************************************************** */00019360
  L240:                                                                 00019370
                FEIL_MELD_NR               =     500;                   00019380
                FEIL_VED_LABEL             =    '240';                  00019390
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00019400
                W01.MER_DATA               =    '0'B;                   00019410
              END;                                                      00019420
          END;                                                          00019430
        END;                                                            00019440
      ELSE                                                              00019450
        DO;                                                             00019460
          /* ************************************************** */      00019470
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00019480
          /* ************************************************** */      00019490
  L250:                                                                 00019500
          FEIL_MELD_NR               =     500;                         00019510
          FEIL_VED_LABEL             =    '250';                        00019520
          W01.MER_DATA               =    '0'B;                         00019530
        END;                                                            00019540
    END P020_LES_NESTE_PINNTEKT_FNR;                                    00019550
                                                                        00019560
                                                                        00019570
                                                                        00019580
                                                                        00019590
                                                                        00019600
                                                                        00019610
    /* ************************************************************** */00019620
    /*                                                                */00019630
    /* PROCEDURE FOR FINNE RETT TKNR .   (GU KVAL. PÅ ROT OG PINNTEKT)*/00019640
    /*                                                                */00019650
    /*     TKNR FINNES VED 1. OG SJEKKE OM ROTSEGM. FNR > 0  . ER DET */00019660
    /*     IKKE DET BENYTTES KOMMNR. I SISTE INNTEKTS-SEGM.           */00019670
    /*                                                                */00019680
    /* ************************************************************** */00019690
                                                                        00019700
    F100_FINN_TKNR:                                                     00019710
      PROC            ( W100_FNR)   RETURNS (FIXED DEC(4))            ; 00019720
                                                                        00019730
      DCL W100_FNR      FIXED DEC   (11)                              , 00019740
          W100_TKNR     FIXED DEC   ( 4)     INIT     (0)             ; 00019750
                                                                        00019760
                                                                        00019770
      SSA1_RF0PERSN.PKEY                  =      W100_FNR             ; 00019780
      W02_GET                             =      W02_GU               ; 00019790
      CALL P005_LES_ROT_QUAL_FNR;                                       00019800
                                                                        00019810
                                                                        00019820
                                                                        00019830
      IF RF0PERSN.TKNR                    >      0                THEN  00019840
         W100_TKNR                        =      RF0PERSN.TKNR        ; 00019850
      ELSE                                                              00019860
         DO;                                                            00019870
            CALL PLITDLI                        (W02_PARM_CT_4,         00019880
                                                 W02_GNP,               00019890
                                                 RF1,                   00019900
                                                 W01_PINT,              00019910
                                                 SSA_UQUAL_PINNTEKT_L); 00019920
                                                                        00019930
            IF   UIBFCTR                   =     UIB_RC_OK    THEN      00019940
              DO;                                                       00019950
                 SELECT ( RF1.STATUS_KODE );                            00019960
                                                                        00019970
                    WHEN ( '  ' )                                       00019980
                        W100_TKNR          =     W01_PINT.W02_PI_KOMMNR;00019990
                                                                        00020000
                    WHEN ( 'GE' , 'GB' );                               00020010
                                                                        00020020
                    OTHERWISE                                           00020030
                                                                        00020040
                       /* ******************************************* */00020050
                       /*UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES*/00020060
                       /* ******************************************* */00020070
                       DO;                                              00020080
  L162:                                                                 00020090
                          FEIL_MELD_NR         =     500;               00020100
                          FEIL_VED_LABEL       =    '162';              00020110
                          DB_STATUS_KODE       =     RF1.STATUS_KODE;   00020120
                       END;                                             00020130
                 END;                                                   00020140
              END;                                                      00020150
            ELSE                                                        00020160
              DO;                                                       00020170
                 /* ******************************************* */      00020180
                 /* UIB'S RETUR-CODE ER UAKSEPTABEL             */      00020190
                 /* ******************************************* */      00020200
  L164:                                                                 00020210
                  FEIL_MELD_NR               =     500;                 00020220
                  FEIL_VED_LABEL             =    '164';                00020230
              END;                                                      00020240
         END;                                                           00020250
                                                                        00020260
      RETURN (W100_TKNR);                                               00020270
                                                                        00020280
    END F100_FINN_TKNR;                                                 00020290
                                                                        00020300
                                                                        00020310
                                                                        00020320
  PF2:                                                                  00020330
                                                                        00020340
     MAP_MELDING              = 'TRANSAKSJONEN FORKASTET';              00020350
     FEILMELDING_SATT         = '1'B;                                   00020360
     S001I01I.STYREKODEL      = -1;     /* CURSOR POS */                00020370
     S001I01O.CICS_INFOO      = CICSINFO               ;                00020380
     S001I01O.MELDINGO        = MAP_MELDING;                            00020390
                                                                        00020400
     EXEC CICS SEND MAP('S001I01')                                      00020410
                                       MAPSET('S001I13') CURSOR ERASE;  00020420
                                                                        00020430
                CALL DATABASE('CLOSE');                                 00020440
     TRANSKODE = 'R0I1';                                                00020450
     EXEC CICS XCTL PROGRAM('R001I101') COMMAREA(KOM_OMR);              00020460
                                                                        00020470
                                                                        00020480
                                                                        00020490
  ERRBEH:                                                               00020500
     EXEC CICS HANDLE CONDITION ERROR;                                  00020510
     EXEC CICS PURGE MESSAGE;                                           00020520
     EXEC CICS ABEND ABCODE('FEIL');                                    00020530
                                                                        00020540
                                                                        00020550
                                                                        00020560
  SKRIV_FEILMELDING:                                                    00020570
     PROC;                                                              00020580
                                                                        00020590
  /* **************************************************************** */00020600
  /*HENSIKT:                                                          */00020610
  /*    GIR UT FEILMELDING.                                           */00020620
  /*                                                                  */00020630
  /*                                                                  */00020640
  /*BRUK:                                                             */00020650
  /*    CALL SKRIV_FEILMELDING;                                       */00020660
  /*                                                                  */00020670
  /* **************************************************************** */00020680
                                                                        00020690
  DCL FNR_PIC                PIC  '(11)9'     INIT (0),                 00020700
      FNR_CHAR DEF FNR_PIC   CHAR  (11)               ;                 00020710
                                                                        00020720
                                                                        00020730
  IF TERMINERINGS_IND = FATAL_FEIL THEN                                 00020740
     DO;                                                                00020750
        EXEC CICS PURGE MESSAGE;                                        00020760
        FEIL_MELDING = 'PROGRAM ' !! DIV_PARAM_OMR.PROGRAM_ID !!        00020770
                               ' GÅR I FEIL VED LABEL NR. '        !!   00020780
                                        DIV_PARAM_OMR.FEIL_VED_LABEL;   00020790
        EXEC CICS SEND TEXT FROM (FEIL_MELDING) ACCUM ERASE PAGING      00020800
                                                           JUSTIFY(10); 00020810
                                                                        00020820
        FEIL_STRUC.KOM_OMR_PEKER = COMMAREA_PEKER;                      00020830
        FEIL_STRUC.FEIL_NR       = FEIL_MELD_NR;                        00020840
        EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC);        00020850
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(14)            00020860
                                                         ACCUM PAGING;  00020870
                                                                        00020880
        IF FEIL_MELD_NR        =     500              THEN              00020890
           DO;                                                          00020900
                                                                        00020910
              /* *************************************************** */ 00020920
              /*     DATA-BASE FEIL . RETUR_KODEN LEGGES UT .        */ 00020930
              /* *************************************************** */ 00020940
                                                                        00020950
              EXEC CICS SEND TEXT FROM  (MAP_MELDING) ACCUM             00020960
                                               PAGING   JUSTIFY (18);   00020970
           END;                                                         00020980
                                                                        00020990
        ELSE                                                            00021000
           IF FEIL_MELD_NR   =     499              THEN                00021010
              DO;                                                       00021020
                                                                        00021030
               /* *************************************************** */00021040
               /*     PERSON ER UNDER BEHANDLING AV EN ANNEN TRANS    */00021050
               /* *************************************************** */00021060
                                                                        00021070
                                                                        00021080
                 FNR_PIC          =  DIV_PARAM_OMR.SEARCH_FNR  ;        00021090
                 FEIL_MELDING     =  '  FNR  =  ' !!  FNR_CHAR ;        00021100
                 EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM         00021110
                                                  PAGING   JUSTIFY (18);00021120
              END;                                                      00021130
                                                                        00021140
        FEIL_MELDING = 'TASKEN BLIR KANSELERT !!!!     ' !!             00021150
                                  'INGEN OPPDATERING ER BLITT UTFØRT. ';00021160
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(22)            00021170
                                                           ACCUM PAGING;00021180
        EXEC CICS SEND PAGE;                                            00021190
                                                                        00021200
        /******** NB!   NB! TASKEN BLIR KANSELERT  ********/            00021210
                                                                        00021220
         EXEC CICS ABEND                                                00021230
                     ABCODE(STOP);                                      00021240
     END;                                                               00021250
                                                                        00021260
  END SKRIV_FEILMELDING;                                                00021270
                                                                        00021280
                                                                        00021290
                                                                        00021300
  /* **************************************************************** */00021310
  /*                                                                  */00021320
  /*  PROCEDURE FOR Å ÅPNE OG LUKKE RF-DATABASEN.                     */00021330
  /*                                                                  */00021340
  /* **************************************************************** */00021350
                                                                        00021360
  DATABASE:                                                             00021370
   PROC(STYRING);                                                       00021380
                                                                        00021390
   DCL                                                                  00021400
     STYRING                               CHAR(5),                     00021410
     NULL                                  BUILTIN,                     00021420
     UNSPEC                                BUILTIN,                     00021430
     PLITDLI                               ENTRY;                       00021440
                                                                        00021450
  /*------------------------------------------------------------------*/00021460
  /* DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-KALL   */00021470
  /*------------------------------------------------------------------*/00021480
     DCL                                                                00021490
       W01_PSB_NAVN                CHAR (8)       INIT('B001R001');     00021500
     DCL                                                                00021510
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');         00021520
     DCL                                                                00021530
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00021540
                                                                        00021550
     DCL 1  W01_DLI_PARAM,                                              00021560
            2   W02_GU             CHAR (4)       INIT('GU  '),         00021570
            2   W02_PARM_CT_1      FIXED BIN(31)  INIT(1),              00021580
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT(3);              00021590
                                                                        00021600
  %PAGE;                                                                00021610
                                                                        00021620
     IF STYRING = 'OPEN' THEN                                           00021630
        DO;                                                             00021640
           CALL   PLITDLI                        (W02_PARM_CT_3,        00021650
                                                  W01_PCB_FUNCTION,     00021660
                                                  W01_PSB_NAVN,         00021670
                                                  UIBPTR);              00021680
                                                                        00021690
           IF DLIUIB.UIBFCTR                    =    '00000000'B THEN   00021700
              DO;                                                       00021710
                 ALLOCATE PCB_UIB_PEKER_OMR;                            00021720
                 PCB_UIB_PEKER_OMR.PCB_PEKER      =    UIBPCBAL;        00021730
                 PCB_UIB_PEKER_OMR.UIB_PEKER      =    UIBPTR;          00021740
              END;                                                      00021750
           ELSE                                                         00021760
              DO;                                                       00021770
                 FEIL_MELD_NR      =  500;                              00021780
 L555:           FEIL_VED_LABEL    = '555';                             00021790
                 MAP_MELDING =                                          00021800
                         'NOE ER GALT MED DATABASEN, KODE: ' !!         00021810
                           UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);   00021820
              END;                                                      00021830
        END;                                                            00021840
     ELSE                                                               00021850
        DO;                                                             00021860
           CALL   PLITDLI                        (W02_PARM_CT_1,        00021870
                                                  W01_TERM_FUNCTION);   00021880
           KOM_OMR.PCB_UIB_PEKER = NULL;                                00021890
        END;                                                            00021900
                                                                        00021910
  END DATABASE;                                                         00021920
                                                                        00021930
                                                                        00021940
  %INCLUDE R0019912;          /*  NUM-> CHAR                      */    00021950
  %INCLUDE R0019905;          /*  F_ALDER                         */    00021960
  %INCLUDE R0019957;          /*  P900_NOR_DATA       (FNR,TKNR ) */    00021970
  %INCLUDE R0019958;          /*  P9958_BEH_STRYK_REG (BEH,FNR,ÅR)*/    00021980
  %INCLUDE R0019960;          /*  F_CICSINFO                      */    00021990
                                                                        00022000
                                                                        00022010
 END R001I30;                                                           00022020
