 /*       SIST ENDRET 24/06-98 09.31.27 AV   JDA7339                  */00000000
 /*       SIST ENDRET 24/06-98 09.30.36 AV   JDA7339                  */00000010
 /*       SIST ENDRET 19/05-98 13.01.49 AV   JDA7339                  */00000020
 /*       SIST ENDRET 19/05-98 12.48.55 AV   JDA7339                  */00000030
 /*       SIST ENDRET 05/12-97 12.30.38 AV   JDA7339                  */00000040
 /*       SIST ENDRET 27/11-97 11.00.01 AV   JDA7339                  */00000050
 /*       SIST ENDRET 30/09-97 11.58.34 AV   JDA7339                  */00000060
 /*       SIST ENDRET 28/07-97 12.35.19 AV   HLA7339                  */00000070
 /*       SIST ENDRET 14/03-96 15.45.41 AV   HLB0310                  */00000080
 /*       SIST ENDRET 12/02-96 14.14.46 AV   JDA0310                  */00000090
 /*       SIST ENDRET 05/10-95 10.57.15 AV   JDA0310                  */00000100
 /*       SIST ENDRET 17/11-94 12.06.19 AV   JDA0310                  */00000110
 /*       SIST ENDRET 18/10-94 15.12.32 AV   HLB0310                  */00000120
 /*       SIST ENDRET 20/09-94 09.43.13 AV   HERMAN                   */00000130
 /*       SIST ENDRET 20/07-94 12.46.08 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 05/01-94 12.54.58 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 03/05-93 11.29.49 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 18/06-92 11.23.26 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 30/01-92 09.52.19 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 18/12-91 16.20.59 AV   HERMAN                   */00000190
 /*       SIST ENDRET 13/12-91 12.35.37 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 10/10-91 13.56.28 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 27/09-91 11.06.50 AV   DYBVIK                   */00000220
 /*       SIST ENDRET 11/07-91 14.23.08 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 26/04-91 11.47.40 AV   DYBVIK                   */00000240
 /*       SIST ENDRET 08/04-91 12.06.53 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 12/11-90 13.15.26 AV   DYBVIK                   */00000260
 /*       SIST ENDRET 04/09-90 12.53.55 AV   DYBVIK                   */00000270
 /*       SIST ENDRET 02/08-90 14.26.34 AV   DYBVIK                   */00000280
 /*       SIST ENDRET 01/12-89 08.42.26 AV   DYBVIK                   */00000290
 /*       SIST ENDRET 14/04-89 13.40.57 AV   HERMAN                   */00000300
  /* *************************************************************** */ 00000310
  /* IDENTIFIKASJON:   R0017037                                      */ 00000320
  /* PROGRAMMERER:  JAN Y. DYBVIK JANUAR 1988                        */ 00000330
  /* HENSIKT:                                                        */ 00000340
  /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT    */ 00000350
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */ 00000360
  /*        HVER AJOURFØRT TRANSAKSJON.                              */ 00000370
  /* PROGRAMTILKNYTNING:                                             */ 00000380
  /*        PROGRAMMET KALLES OPP AV R0017001                        */ 00000390
  /*                                                                 */ 00000400
  /* *************************************************************** */ 00000410
    LAG_YRKEPENS_HEND:                                                  00000420
      PROC (YP_IND,YE_IND);                                             00000430
                                                                        00000440
  EXEC CICS ADDRESS EIB(DFHEIPTR);                                      00000450
 DCL  YP_IND                               FIXED BIN(15);               00000460
 DCL  YE_IND                               FIXED BIN(15);               00000470
 DCL  W_BARN_IND                           FIXED BIN(15);   /*HL*/      00000480
  /*                                      TRUDE 090289       */         00000490
                                                                        00000500
  DCL K                 FIXED BIN(15) INIT (0);                         00000510
  DCL M                 FIXED BIN(15) INIT (0);                         00000520
  DCL Y                 FIXED BIN(15) INIT (0);                         00000530
  DCL W_INNT_GRENSE     FIXED DEC( 7) INIT (0);                         00000540
                                                                        00000550
  /* FINNE SISTE YUFT  */                                               00000560
                                                                        00000570
  /* *************************************************************** */ 00000580
  /* PROGRAMMET BEGYNNER HER . VI BLANKER W_HENDELSE.                */ 00000590
  /* *************************************************************** */ 00000600
                                                                        00000610
    W_HENDELSE              =  '';                                      00000620
    OMR_DATO                = F_SNU_DATO(TRANS_OPPL_OMR.VIRKNINGSDATO); 00000630
    IF TRANS_OPPL_OMR.TRANSTYPE = 27 THEN                               00000640
       DO;                                                              00000650
          HENDDATO  =  OMR_DATO;                                        00000660
       END;                                                             00000670
    ELSE                                                                00000680
       DO;                                                              00000690
          IF DIV_PERIODE.INTENDR_ÅM > 0    THEN                         00000700
             HENDDATO     = DIV_PERIODE.INTENDR_ÅM;                     00000710
          ELSE                                                          00000720
             DO;                                                        00000730
                R_HENDDATO_D =  B02.PERSON.STATUS.VIRK_DATO_ÅM(YP_IND); 00000740
                HENDDATO     =  R_HENDDATO.AAR !!R_HENDDATO.MND;        00000750
             END;                                                       00000760
       END;                                                             00000770
    W_HENDELSE.VERSJON      =  W_ROT.NESTE_SB_VERSJON_NR;               00000780
    W_HENDELSE.TERMINAL     =  EIBTRMID;                                00000790
    IF TRANS_OPPL_OMR.TRANSTYPE ^= 21 THEN                              00000800
       DO;                                                              00000810
          W_HENDELSE.FNR_EKTEF    =  B02.PERSON.RF0PERSN.FNR(YE_IND);   00000820
          W_HENDELSE.NAVN_EKTEF   =  B02.PERSON.RF0PERSN.NAVN(YE_IND);  00000830
       END;                                                             00000840
    W_HENDELSE.PENSJONSTYPE1 = B02.STATUS.PENSJONSTYPE1(YP_IND);        00000850
    W_HENDELSE.PENSJONSTYPE2 = B02.STATUS.PENSJONSTYPE2(YP_IND);        00000860
    W_HENDELSE.PENSJONSTYPE3 = B02.STATUS.PENSJONSTYPE3(YP_IND);        00000870
    W_HENDELSE.PENSJONSTYPE1_EK = B02.STATUS.PENSJONSTYPE1(YE_IND);     00000880
    W_HENDELSE.PENSJONSTYPE2_EK = B02.STATUS.PENSJONSTYPE2(YE_IND);     00000890
    W_HENDELSE.PENSJONSTYPE3_EK = B02.STATUS.PENSJONSTYPE3(YE_IND);     00000900
    W_HENDELSE.SIVILSTAND_EK    = B02.STATUS.SIVILSTAND(YE_IND);        00000910
                                                                        00000920
 /*20.9.89 HL : */                                                      00000930
    W_HENDELSE.GAMMEL_SAMMENSTØTS_REGEL =                               00000940
               B02.STATUS.GAMMEL_SAMMENSTØTS_REGEL(YP_IND);             00000950
 /*HIT 20.9.89 HL*/                                                     00000960
                                                                        00000970
  /* *************************************************************** */ 00000980
  /* DERSOM ETTERLATTE PENSJONEN ER STØRSTE                          */ 00000990
  /* *************************************************************** */ 00001000
                                                                        00001010
    IF B02.PERSON.ETTEPENS.GP_BRUTTO(YP_IND) > 0   THEN                 00001020
                                                                        00001030
       DO;                                                              00001040
          W_HENDELSE.GP_BRUTTO = B02.ETTEPENS.GP_BRUTTO(YP_IND);        00001050
          W_HENDELSE.GP_NETTO  = B02.ETTEPENS.GP_NETTO(YP_IND);         00001060
          W_HENDELSE.TP_BRUTTO = B02.ETTEPENS.TP_BRUTTO(YP_IND) +       00001070
                                        B02.UFØRPENS.TP(YP_IND);        00001080
          W_HENDELSE.TP_NETTO  = B02.ETTEPENS.TP_NETTO(YP_IND)  +       00001090
                                        B02.UFØRPENS.TP(YP_IND);        00001100
          W_HENDELSE.ST        = B02.ETTEPENS.ST(YP_IND);               00001110
                                                                        00001120
          IF B02.STATUS.SIVILSTAND(IND) ^= 'S' THEN                     00001130
             W_HENDELSE.TP_PROSENT = 55;                                00001140
          ELSE                                                          00001150
             W_HENDELSE.TP_PROSENT = B02.ETTEPENS.TP_PROSENT(YP_IND);   00001160
                                                                        00001170
       END;                                                             00001180
                                                                        00001190
    ELSE                                                                00001200
                                                                        00001210
       DO;                                                              00001220
          W_HENDELSE.GP_BRUTTO  =  B02.UFØRPENS.GP(YP_IND);             00001230
          W_HENDELSE.GP_NETTO   =  B02.UFØRPENS.GP(YP_IND);             00001240
          W_HENDELSE.TP_BRUTTO  =  B02.UFØRPENS.TP(YP_IND);             00001250
          W_HENDELSE.TP_NETTO   =  B02.UFØRPENS.TP(YP_IND);             00001260
          W_HENDELSE.ST         =  B02.UFØRPENS.ST(YP_IND);             00001270
                                                                        00001280
       END;                                                             00001290
    W_HENDELSE.KT           =  B02.PERSON.UFØRPENS.KT(YP_IND);          00001300
    W_HENDELSE.ET           =  B02.PERSON.UFØRPENS.ET(YP_IND);          00001310
    W_HENDELSE.BT           =  B02.PERSON.UFØRPENS.BT(YP_IND);          00001320
    /* ATTFØRING - 9806    */                                           00001330
    W_HENDELSE.ATTFØRING_GP_ÅRSBELØP =                                  00001340
             DIV_PERIODE.ATTFØRING_GP_ÅRSBELØP;                         00001350
    W_HENDELSE.ATTFØRING_TP_ÅRSBELØP =                                  00001360
             DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP;                         00001370
                                                                        00001380
                                                                        00001390
                                  /* NY 0591 FRA HIT TRUDE */           00001400
    W_HENDELSE.BT_SÆRBARN   =  B02.FORSI.BT_SÆRBARN(YP_IND);            00001410
    W_HENDELSE.FT_SKAL_BEREGNES = B02.FORSI.FT_SKAL_BEREGNES(YP_IND);   00001420
    W_HENDELSE.ARBEIDSINNTEKT   = B02.FORSI.ARBEIDSINNTEKT(YP_IND);     00001430
    W_HENDELSE.PENSJONSINNTEKT   = B02.FORSI.PENSJONSINNTEKT(YP_IND);   00001440
    W_HENDELSE.ARBEIDSINNTEKT_EK = B02.FORSI.ARBEIDSINNTEKT_EK(YP_IND); 00001450
    W_HENDELSE.PENSJONSINNTEKT_EK= B02.FORSI.PENSJONSINNTEKT_EK(YP_IND);00001460
    W_HENDELSE.FRIBELØP_MINSTE = DIV_PARAM_OMR.FRIBELØP_MINSTE(YP_IND); 00001470
    W_HENDELSE.FRIBELØP_FELLESBARN =                                    00001480
                              DIV_PARAM_OMR.FRIBELØP_FELLESBARN(YP_IND);00001490
   W_HENDELSE.FRIBELØP_SÆRBARN = DIV_PARAM_OMR.FRIBELØP_SÆRBARN(YP_IND);00001500
    W_HENDELSE.FOLKETRYGD        = DIV_PARAM_OMR.FOLKETRYGD(YP_IND);    00001510
                                                                        00001520
    /*HER ER DET FEIL INDEX SKAL VÆRE YE_IND,IKKE EKTEF_IND  */         00001530
    /*RETTES 290192 AV TRUDE                                 */         00001540
    W_HENDELSE.FOLKETRYGD_EK   = DIV_PARAM_OMR.FOLKETRYGD(YE_IND);      00001550
                                    /* HIT TRUDE */                     00001560
    W_HENDELSE.ÅFT          =  B02.PERSON.UFØRPENS.ÅFT(YP_IND);         00001570
    W_HENDELSE.UF_GRAD      =  B02.PERSON.UFØRPENS.UFG(YP_IND);         00001580
    W_HENDELSE.TT           =  B02.PERSON.STATUS.TT_ANV(YP_IND);        00001590
    W_HENDELSE.TT_EK        =  B02.PERSON.STATUS.TT_ANV(YE_IND);        00001600
    W_HENDELSE.TP_GAR_KODE  = B02.STATUS.TP_GAR_KODE(YP_IND);/*UFF67*/  00001610
    W_HENDELSE.PÅ           = B02.UFØRPENS.PÅ   (YP_IND);               00001620
    W_HENDELSE.OPT          = B02.UFØRPENS.OPT  (YP_IND);               00001630
    W_HENDELSE.SPT          = B02.UFØRPENS.SPT  (YP_IND);               00001640
                                                                        00001650
           /* TRUDE 1094*/                                              00001660
    IF  B02.INNTEKT_FØR_UP(YP_IND)    > 0  THEN                         00001670
      DO;                                                               00001680
         CALL BEREGN_INNTEKT_FØR_YP;                                    00001690
         W_HENDELSE.INNTEKT_FØR_UP =  W_INNT_GRENSE;                    00001700
      END;                                                              00001710
           /* TRUDE 1094*/                                              00001720
   /* W_HENDELSE.INNTEKT_FØR_UP = B02.INNTEKT_FØR_UP(YP_IND); JD 94*/   00001730
                                                                        00001740
  /* *************************************************************** */ 00001750
  /* NY LOV 0192     JD 11.91                                        */ 00001760
  /* *************************************************************** */ 00001770
                                                                        00001780
    W_HENDELSE.GT_LOV92    =  B02.STATUS.GT_LOV92(YP_IND);              00001790
    W_HENDELSE.GT_TILLEGG_LOV92 = B02.STATUS.GT_TILLEGG_LOV92(YP_IND);  00001800
    W_HENDELSE.GARANTI_DATO_ÅM  = B02.STATUS.GARANTI_DATO_ÅM(YP_IND);   00001810
    W_HENDELSE.SPT_1291         = B02.UFØRPENS.SPT_1291     (YP_IND);   00001820
    W_HENDELSE.OPT_1291         = B02.UFØRPENS.OPT_1291     (YP_IND);   00001830
    W_HENDELSE.PÅ_1291         = B02.UFØRPENS.PÅ_1291     (YP_IND);     00001840
    W_HENDELSE.PÅ_ETTER91      = B02.UFØRPENS.PÅ_ETTER91  (YP_IND);     00001850
    W_HENDELSE.YRKE_PÅ_ETTER91 = B02.YRKEPENS.PÅ_ETTER91  (YP_IND);     00001860
    W_HENDELSE.YRKE_POENG_1291 = B02.YRKEPENS.YRKE_POENG_1291(YP_IND);  00001870
             /* HIT JD 1191 */                                          00001880
    /*0697 HL:*/                                                        00001890
    DO Y = 1 TO 7 WHILE (B02.UFØRHIST.UFT_ÅM(YP_IND,Y) > 0);/*U67*/     00001900
       W_HENDELSE.BUP_GARANTI = B02.UFØRHIST.BUP_GARANTI(YP_IND,Y);     00001910
    END;               /*HIT UFF67 JD 19.9 89 */                        00001920
    W_HENDELSE.YRKE_GP      =  B02.PERSON.YRKEPENS.GP(YP_IND);          00001930
    W_HENDELSE.YRKE_TP      =  B02.PERSON.YRKEPENS.TP(YP_IND);          00001940
    W_HENDELSE.YRKE_BT      =  B02.PERSON.YRKEPENS.BT(YP_IND);          00001950
    W_HENDELSE.ANTALL_BARN  =  B02.PERSON.STATUS.ANTALL_BARN(YP_IND);   00001960
    W_HENDELSE.ANTALL_BARN_TIDL                                         00001970
                            =  B01.PERSON.STATUS.ANTALL_BARN(YP_IND);   00001980
    W_HENDELSE.TT           =  B02.PERSON.STATUS.TT_ANV(YP_IND);        00001990
    W_HENDELSE.TT_EK        =  B02.PERSON.STATUS.TT_ANV(YE_IND);        00002000
    W_HENDELSE.BOSATT       =  B02.BOSATT(YP_IND); /* JD 08.90 */       00002010
    W_HENDELSE.YRKE_ENGANGSBELØP_11_7 =                                 00002020
                  DIV_PARAM_OMR.ENGANGSBELØP_11_7(YP_IND);              00002030
    W_HENDELSE.YRKE_UFG     = B02.PERSON.YRKEPENS.YUG(YP_IND);          00002040
    W_HENDELSE.YRKE_KODE    = B02.YRKEPENS.YPT_KODE(YP_IND);            00002050
                                                                        00002060
    IF B02.YRKEPENS.YPT (YP_IND) < B02.YRKE_POENG_1291(YP_IND) THEN     00002070
       W_HENDELSE.YRKE_YPT     = B02.YRKE_POENG_1291(YP_IND);           00002080
    ELSE                                                                00002090
       W_HENDELSE.YRKE_YPT     = B02.YRKEPENS.YPT  (YP_IND);            00002100
                                                                        00002110
    W_HENDELSE.YRKE_SPT     = B02.YRKEPENS.SPT  (YP_IND);               00002120
    W_HENDELSE.FORVENTET_INNTEKT = B02.FORVENTET(YP_IND);               00002130
     /* NYE FELT FRYS OG TIDSB ATTF 10.97 JD   */                       00002140
    W_HENDELSE.FRYSDATO_ÅM        = B02.FRYSDATO_ÅM(YP_IND);            00002150
    W_HENDELSE.FRYSKODE           = B02.FRYSKODE   (YP_IND);            00002160
    W_HENDELSE.GARANTIGRAD        = B02.GARANTIGRAD(YP_IND);            00002170
    IF B02.TIDSBEGR_ATTF(YP_IND) = 'J' THEN                             00002180
       W_HENDELSE.ATTF_KODE = '1';                                      00002190
    ELSE                                                                00002200
    IF B02.SKJERM_ATTF  (YP_IND) = 'J' THEN                             00002210
       W_HENDELSE.ATTF_KODE = '2';                                      00002220
    IF B01.UFØRPENS.UFG(YP_IND) >                                       00002230
       B02.UFØRPENS.UFG(YP_IND)  &                                      00002240
      (B02.FRYSKODE    (YP_IND) ^= '1' &                                00002250
       B02.FRYSKODE    (YP_IND) ^= '2' ) THEN                           00002260
           W_HENDELSE. FRYSKODE = '3';                                  00002270
     /* NYE FELT FRYS OG TIDSB ATTF SLUTT JD 10.97 */                   00002280
                                                                        00002290
    W_HENDELSE.REDUSERT_GP_2G = DIV_PARAM_OMR.REDUSERT_GP_2G(YP_IND);   00002300
                                                                        00002310
    IF B02.STATUS.SIVILSTAND(YP_IND) ^= 'S' &                           00002320
       B02.STATUS.PENSJONSTYPE2(YP_IND) = 'E' THEN                      00002330
       W_HENDELSE.TP_PROSENT = 55;                                      00002340
    ELSE                                                                00002350
       W_HENDELSE.TP_PROSENT = B02.ETTEPENS.TP_PROSENT(YP_IND);         00002360
  /* *************************************************************** */ 00002370
  /* FØLGENDE FELT HENTES FRA EØS-INFO  (HL 0994                     */ 00002380
  /* *************************************************************** */ 00002390
                                                                        00002400
    W_HENDELSE.TT_PRORATA_MND = B02.TT_PRO_RATA_MND(YP_IND);            00002410
    W_HENDELSE.TT_TEORETISK_EØS_MND =                                   00002420
                                B02.TT_TEORETISK_EØS_MND(YP_IND);       00002430
    W_HENDELSE.SPT_EØS      =   B02.SPT_EØS(YP_IND);                    00002440
    W_HENDELSE.OPT_EØS      =   B02.OPT_EØS(YP_IND);                    00002450
    W_HENDELSE.ALTERNATIV_GP       = B02.ALTERNATIV_GP(YP_IND);         00002460
    W_HENDELSE.ALTERNATIV_TP       = B02.ALTERNATIV_TP(YP_IND);         00002470
    W_HENDELSE.ALTERNATIV_ST       = B02.ALTERNATIV_ST(YP_IND);         00002480
    W_HENDELSE.ALTERNATIV_ET       = B02.ALTERNATIV_ET(YP_IND);         00002490
    W_HENDELSE.ALTERNATIV_BT       = B02.ALTERNATIV_BT(YP_IND);         00002500
    W_HENDELSE.ALTERNATIV_SUM_PENSJON =                                 00002510
                            B02.ALTERNATIV_SUM_PENSJON(YP_IND);         00002520
    W_HENDELSE.ANTALL_NORSKE_PÅ     = B02.ANTALL_NORSKE_PÅ(YP_IND);     00002530
    W_HENDELSE.ANTALL_NORSKE_PÅ_ETTER91 =                               00002540
                            B02.ANTALL_NORSKE_PÅ_ETTER91(YP_IND);       00002550
    W_HENDELSE.PRO_RATA_BEREGNING   = B02.PRO_RATA_BEREGNING(YP_IND);   00002560
    W_HENDELSE.BEREGN_FOLKETRYGD    = B02.BEREGN_FOLKETRYGD(YP_IND);    00002570
    W_HENDELSE.TEORETISK_BELØP_GP   = DIV_PARAM_OMR.TEORETISK_BELØP_GP; 00002580
    W_HENDELSE.TEORETISK_BELØP_TP   = DIV_PARAM_OMR.TEORETISK_BELØP_TP; 00002590
    W_HENDELSE.EØS_8_4_3A           = B02.EØS_8_4_3A(YP_IND);           00002600
    W_HENDELSE.PÅ_EØS_FAKTISK   = DIV_PARAM_OMR.PÅ_EØS_FAKTISK(YP_IND); 00002610
   W_HENDELSE.PÅ_NORSK_FAKTISK = DIV_PARAM_OMR.PÅ_NORSK_FAKTISK(YP_IND);00002620
    W_HENDELSE.TT_NORSK_FAKTISK     = DIV_PARAM_OMR.TT_NORSK_FAKTISK;   00002630
    W_HENDELSE.TT_SUM_FAKTISK     = DIV_PARAM_OMR.TT_SUM_FAKTISK;       00002640
    W_HENDELSE.TT_TEORETISK       = DIV_PARAM_OMR.TT_TEORETISK;         00002650
        /* EØS-INFO TIL HIT HL 0994    */                               00002660
                                                                        00002670
 /*2.4.91 HL : */                                                       00002680
                  /* INDEX SKAL VÆRE YE_IND .TRUDE 180692 */            00002690
    IF YE_IND < 3        THEN                                           00002700
   /*  W_HENDELSE.GARANTITILLEGG_TP = DIV_PARAM_OMR.                    00002710
                                GARANTITILLEGG_TP(YE_IND);              00002720
                **** */                                                 00002730
       W_HENDELSE.GARANTITILLEGG_TP = DIV_PARAM_OMR.                    00002740
                                GARANTITILLEGG_TP(YP_IND);              00002750
                                                                        00002760
                                 /* TRUDE FT0591 FRA HIT */             00002770
                                 /*INDEX FEIL, SKAL VÆRE YE_IND*/       00002780
                                 /*IKKE EKTEF_IND              */       00002790
                                 /*RETTES 290192, TRUDE        */       00002800
                                                                        00002810
    IF B02.PENSJONSTYPE1(YE_IND)  =  'F' THEN                           00002820
         DO I = 1 TO 13;                                                00002830
            IF B02.FNR_TILKN(YP_IND,I) =   B02.FNR(YE_IND) THEN         00002840
                DO;                                                     00002850
                   W_HENDELSE.ET_FØR_0591 = B02.FT_FØR_91(YP_IND,I);    00002860
                   I = 13;                                              00002870
                END;                                                    00002880
         END;                                                           00002890
                                                                        00002900
    W_HENDELSE.GARANTITILLEGG_EK = B02.FORSI.GARANTITILLEGG_EK(YP_IND); 00002910
    W_HENDELSE.GARANTITILLEGG_BARN =                                    00002920
                            B02.FORSI.GARANTITILLEGG_BARN(YP_IND);      00002930
    W_HENDELSE.GARANTITILLEGG_SÆRBARN =                                 00002940
                        B02.FORSI.GARANTITILLEGG_SÆRBARN(YP_IND);       00002950
                                /* FT 0591 TIL HIT */                   00002960
                                                                        00002970
    IF B02.PENSJONSTYPE1(YE_IND) = 'U'   THEN                           00002980
       DO;                                                              00002990
          W_HENDELSE.PÅ_EK        = B02.UFØRPENS.PÅ   (YE_IND);         00003000
          W_HENDELSE.OPT_EK       = B02.UFØRPENS.OPT  (YE_IND);         00003010
          W_HENDELSE.SPT_EK       = B02.UFØRPENS.SPT  (YE_IND);         00003020
          W_HENDELSE.SPT_1291_EK    = B02.UFØRPENS.SPT_1291(YE_IND);    00003030
          W_HENDELSE.OPT_1291_EK    = B02.UFØRPENS.OPT_1291(YE_IND);    00003040
        W_HENDELSE.PÅ_1291_EK     = B02.UFØRPENS.PÅ_1291  (YE_IND);     00003050
        W_HENDELSE.PÅ_ETTER91_EK = B02.UFØRPENS.PÅ_ETTER91(YE_IND);     00003060
       END;                                                             00003070
                                                                        00003080
    IF B02.PENSJONSTYPE1(YE_IND) = 'Y'   THEN                           00003090
       DO;                                                              00003100
      /*  W_HENDELSE.OPT_EK       = B02.YRKEPENS.OPT  (YE_IND);*/       00003110
          W_HENDELSE.SPT_EK       = B02.YRKEPENS.YPT  (YE_IND);         00003120
       END;                                                             00003130
                                                                        00003140
    IF B02.PENSJONSTYPE1(YE_IND) = 'A'   THEN                           00003150
       DO;                                                              00003160
          W_HENDELSE.PÅ_EK        = B02.ALDERSP.PÅ    (YE_IND);         00003170
          W_HENDELSE.OPT_EK       = B02.ALDERSP.OPT   (YE_IND);         00003180
          W_HENDELSE.SPT_EK       = B02.ALDERSP.SPT   (YE_IND);         00003190
          W_HENDELSE.SPT_1291_EK    = B02.ALDERSP.SPT_1291(YE_IND);     00003200
          W_HENDELSE.OPT_1291_EK    = B02.ALDERSP.OPT_1291(YE_IND);     00003210
        W_HENDELSE.PÅ_1291_EK     = B02.ALDERSP.PÅ_1291  (YE_IND);      00003220
        W_HENDELSE.PÅ_ETTER91_EK = B02.ALDERSP.PÅ_ETTER91(YE_IND);      00003230
       END;                                                             00003240
    IF B02.PENSJONSTYPE2(YP_IND) = 'E'   THEN                           00003250
       DO;                                                              00003260
          W_HENDELSE.PÅ_EK        = B02.ETTEPENS.PÅ_AVD  (YP_IND);      00003270
          W_HENDELSE.OPT_EK       = B02.ETTEPENS.OPT_AVD  (YP_IND);     00003280
          W_HENDELSE.SPT_EK       = B02.ETTEPENS.SPT_AVD  (YP_IND);     00003290
          W_HENDELSE.SPT_1291_EK    = B02.ETTEPENS.SPT_1291(YP_IND);    00003300
          W_HENDELSE.OPT_1291_EK    = B02.ETTEPENS.OPT_1291(YP_IND);    00003310
        W_HENDELSE.PÅ_1291_EK     = B02.ETTEPENS.PÅ_1291  (YP_IND);     00003320
        W_HENDELSE.PÅ_ETTER91_EK = B02.ETTEPENS.PÅ_ETTER91(YP_IND);     00003330
       END;                                                             00003340
    IF B02.PENSJONSTYPE2(YE_IND) = 'U' !                                00003350
       B02.PENSJONSTYPE2(YE_IND) = 'M' THEN                             00003360
           W_HENDELSE.INNT4G_EK = B02.PENSJONSTYPE2(YE_IND);            00003370
                                                                        00003380
    W_BARN_IND = 1;                                                     00003390
    DO J = 3 TO 14 WHILE(B02.FNR(J) > 0);                               00003400
                                                                        00003410
       DO K = 1 TO 13 WHILE (B02.FNR_TILKN(YP_IND,K) > 0);              00003420
                                                                        00003430
          IF B02.FNR(J) = B02.FNR_TILKN(YP_IND,K) THEN                  00003440
                                                                        00003450
             DO;                                                        00003460
                 W_HENDELSE.BARN.FNR_B(W_BARN_IND)    = B02.FNR(J);     00003470
                 W_HENDELSE.BARN.PENSJONSTYPE2_B(W_BARN_IND) =          00003480
                                                 B02.PENSJONSTYPE2(J);  00003490
                 W_HENDELSE.BARN.BT_FØR_0591(W_BARN_IND) =              00003500
                                B02.FT_FØR_91(YP_IND,K);  /*NY0591*/    00003510
                 W_BARN_IND = W_BARN_IND + 1;                           00003520
                 K = 13;                                                00003530
             END;                                                       00003540
       END;                                                             00003550
    END;                                                                00003560
                                                                        00003570
    IF B02.PENSJONSTYPE1(YE_IND) = 'G' &                                00003580
      (B02.SIVILSTAND   (YE_IND) = 'G' !                                00003590
       B02.SIVILSTAND   (YE_IND) = 'W' ) &                              00003600
       B02.PENSJONSTYPE2(YE_IND) = 'M' THEN                             00003610
       DO;                                                              00003620
                                                                        00003630
          DO I = 3 TO 14 WHILE (B02.FNR(I) > 0);                        00003640
             IF B02.PENSJONSTYPE2(I) = 'R' &                            00003650
                W_HENDELSE.ANT_BT_REDUSERT < 3 THEN                     00003660
                W_HENDELSE.ANT_BT_REDUSERT =                            00003670
                W_HENDELSE.ANT_BT_REDUSERT + 1;                         00003680
          END;                                                          00003690
       END;                                                             00003700
                                                                        00003710
  /* *************************************************************** */ 00003720
  /* FØLGENDE FELT HENTES FRA YRKESSKADEHISTORIKKK                   */ 00003730
  /* *************************************************************** */ 00003740
                                                                        00003750
  DO M = 5 TO 1 BY -1  UNTIL (B02.YRKEHIST.YUFT_ÅM                      00003760
                                       (YP_IND,M) > 0);                 00003770
  END;                                                                  00003780
   IF DIV_PARAM_OMR.ENGANGSBELØP_11_7(YP_IND) > 0 THEN                  00003790
     DO;                                                                00003800
        W_HENDELSE.YRKE_UFG     = B02.YRKEHIST.YUG(YP_IND,M);           00003810
     END;                                                               00003820
                                                                        00003830
  W_HENDELSE.YRKE_YUFT_ÅM = B02.YRKEHIST.YUFT_ÅM(YP_IND,M);             00003840
  W_HENDELSE.YRKE_YST_ÅM  = B02.YRKEHIST.YST_ÅM (YP_IND,M);             00003850
  IF B02.YRKEHIST.AÅI (YP_IND,M) = 9999999 THEN                         00003860
     W_HENDELSE.YRKE_AÅI         = 0;                                   00003870
  ELSE                                                                  00003880
     W_HENDELSE.YRKE_AÅI         = B02.YRKEHIST.AÅI   (YP_IND,M);       00003890
  W_HENDELSE.YRKE_YRKE11  = B02.YRKEHIST.YRKE11 (YP_IND,M);             00003900
  W_HENDELSE.YRKE_PAÅ     = B02.YRKEHIST.PAÅ   (YP_IND,M);              00003910
                                              /* HIT TRUDE  */          00003920
                                                                        00003930
 /*TEST PÅ PENSJONSTYPE2 = E - HL 030890  : */                          00003940
                                                                        00003950
 IF B02.PENSJONSTYPE2(YP_IND) = 'E'             THEN                    00003960
 DO;                                                                    00003970
                                                                        00003980
  /* NÅR EKTEF  ER DØD AV YRKESSKADE   J.D 8.8.89              */       00003990
                                                                        00004000
    W_HENDELSE.YRKE_UFG_AVD = B02.YRKEPENS.YUG(YE_IND);                 00004010
    W_HENDELSE.YRKE_KODE_AVD = B02.YRKEPENS.YPT_KODE(YE_IND);           00004020
    IF B02.YRKEPENS.YPT (YE_IND) < B02.YRKE_POENG_1291(YE_IND) THEN     00004030
       W_HENDELSE.YRKE_YPT_AVD = B02.YRKE_POENG_1291(YE_IND);           00004040
    ELSE                                                                00004050
       W_HENDELSE.YRKE_YPT_AVD = B02.YRKEPENS.YPT  (YE_IND);            00004060
                                                                        00004070
 /* W_HENDELSE.YRKE_YPT_AVD = B02.YRKEPENS.YPT  (YE_IND)       */       00004080
    W_HENDELSE.YRKE_SPT_AVD = B02.YRKEPENS.SPT  (YE_IND);               00004090
                                                                        00004100
  DO Y = 1  TO 5 WHILE (B02.YRKEHIST.YUFT_ÅM (YE_IND,Y) > 0);           00004110
                                                                        00004120
     W_HENDELSE.YRKE_UFG_AVD     = B02.YRKEHIST.YUG(YE_IND,Y);          00004130
     W_HENDELSE.YRKE_YUFT_ÅM_AVD = B02.YRKEHIST.YUFT_ÅM(YE_IND,Y);      00004140
     W_HENDELSE.YRKE_YST_ÅM_AVD  = B02.YRKEHIST.YST_ÅM (YE_IND,Y);      00004150
     IF B02.YRKEHIST.AÅI (YE_IND,Y) = 9999999 THEN                      00004160
        W_HENDELSE.YRKE_AÅI_AVD    = 0;                                 00004170
     ELSE                                                               00004180
        W_HENDELSE.YRKE_AÅI_AVD     = B02.YRKEHIST.AÅI   (YE_IND,Y);    00004190
                                                                        00004200
     W_HENDELSE.YRKE_YRKE11_AVD  = B02.YRKEHIST.YRKE11 (YE_IND,Y);      00004210
     W_HENDELSE.YRKE_PAÅ_AVD     = B02.YRKEHIST.PAÅ   (YE_IND,Y);       00004220
  END;                                                                  00004230
     /* HIT J.D 8.8. 89 */                                              00004240
 END;                                                                   00004250
     /* HIT HL. 3.8. 90 */                                              00004260
  /* *************************************************************** */ 00004270
  /* FØLGENDE FELT HENTES FRA P0014009                               */ 00004280
  /* *************************************************************** */ 00004290
                                                                        00004300
    W_HENDELSE.ÅR_BUP_FPP    = POREKKE.BUP_FPP_ÅR(YP_IND);              00004310
    W_HENDELSE.ÅR_BUP_FPP_EK = POREKKE.BUP_FPP_ÅR(YE_IND);              00004320
                                                                        00004330
    /* -------------------------------------------------------------- */00004340
    /* OPPDATER INNTEKTSGRENSE:                   HENTES FRA R0014427 */00004350
    /* -------------------------------------------------------------- */00004360
    IF B02.UFØRPENS.UFG(YP_IND) > 0 THEN                                00004370
       W_HENDELSE.INNTEKTSGRENSE =                                      00004380
          B_LOVLIG_INNT                                                 00004390
            ((B02.UFØRHIST.UFT_ÅM(YP_IND,1)),                           00004400
             (B02.UFØRPENS.UFG(YP_IND)),                                00004410
             (B02.UFØRPENS.INNTEKT_FØR_UP(YP_IND)),                     00004420
             (B02.UFØRPENS.INNT_DATO_ÅM(YP_IND)),                       00004430
             ('N'),                                                     00004440
             ('N'),                                                     00004450
             (B02.UFØRHIST.BUP_GAR_KODE(YP_IND,1)),                     00004460
             (B02.STATUS.YRKES_KODE(YP_IND)));                          00004470
                                                                        00004480
    /* -------------------------------------------------------------- */00004490
    /* OPPDATER INNTEKTSKODE                                          */00004500
    /* -------------------------------------------------------------- */00004510
    /* 1. TIDSBEGRENSET ATTFØRING ? -> 5 */                             00004520
    IF (B02.UFØRPENS.TIDSBEGR_ATTF(YP_IND) = 'J' &                      00004530
    /*  B02.UFØRPENS.UFG(YP_IND)           = 100 ) !                    00004540
       (B02.UFØRPENS.TIDSBEGR_ATTF(YP_IND) = 'J' &                      00004550
        W_HENDELSE.INNTEKTSGRENSE          >   0 & */                   00004560
        B02.UFØRPENS.UFG(YP_IND)           >  49 ) THEN                 00004570
       W_HENDELSE.INNTEKTSKODE = 5;                                     00004580
    ELSE                                                                00004590
    /* 2. SKJERMET ATTFØRING ? -> 6 */                                  00004600
    IF (B02.UFØRPENS.SKJERM_ATTF(YP_IND)   = 'J'    &                   00004610
    /* (B02.UFØRPENS.UFG(YP_IND)           = 100   ) !                  00004620
       ((W_HENDELSE.INNTEKTSGRENSE         >   0 !                      00004630
         B02.UFØRPENS.INNT_DATO_ÅM(YP_IND) >   0 ) & */                 00004640
         B02.UFØRPENS.UFG(YP_IND)          >  49   ) THEN               00004650
       W_HENDELSE.INNTEKTSKODE = 6;                                     00004660
    ELSE                                                                00004670
    /* 3. 100% UFØR ? -> 4 */                                           00004680
    IF (B02.UFØRPENS.UFG(YP_IND) = 100) THEN                            00004690
       W_HENDELSE.INNTEKTSKODE = 4;                                     00004700
    ELSE                                                                00004710
    /* 4. UFØREGRAD > 0 & < 50 ? -> 7 */                                00004720
    IF (B02.UFØRPENS.UFG(YP_IND) >  0 &                                 00004730
        B02.UFØRPENS.UFG(YP_IND) < 50 ) THEN                            00004740
       W_HENDELSE.INNTEKTSKODE = 7;                                     00004750
    ELSE                                                                00004760
    /* 5. KOMBINERT VURDERT ? -> 11 ! 12 */                             00004770
    IF (B02.STATUS.YRKES_KODE(YP_IND) = 11 !                            00004780
        B02.STATUS.YRKES_KODE(YP_IND) = 12 )THEN                        00004790
       W_HENDELSE.INNTEKTSKODE = 2;                                     00004800
    ELSE                                                                00004810
    /* 6. INNTEKT IKKE UTFYLT ? -> 3 */                                 00004820
    IF (W_HENDELSE.INNTEKTSGRENSE = 0) THEN                             00004830
       W_HENDELSE.INNTEKTSKODE = 3;                                     00004840
    ELSE                                                                00004850
       /* 7. HER HAR ALLE GRADERT -> 1 */                               00004860
       W_HENDELSE.INNTEKTSKODE = 1;                                     00004870
                                                                        00004880
    /* -------------------------------------------------------------- */00004890
                                                                        00004900
    CALL PLASSER_TEKST(YP_IND,YE_IND);                                  00004910
                                                                        00004920
    CALL INSERT_HENDELSE;                                               00004930
                                                                        00004940
  /* *************************************************************** */ 00004950
  /* HVIS SLUTTPOENGTALLET ER STØRRE ENN 0 SKAL BEREGNINSGUNNLAG-    */ 00004960
  /* SEGMENT BYGGES OPP                                              */ 00004970
  /* *************************************************************** */ 00004980
                                                                        00004990
                                                                        00005000
    IF W_HENDELSE.YRKE_SPT > 0 THEN                                     00005010
       DO;                                                              00005020
          CALL BYGG_OPP_BERGRUNL_SEGMENT(YP_IND);                       00005030
       END;                                                             00005040
                                                                        00005050
  /* *************************************************************** */ 00005060
                                                                        00005070
 BEREGN_INNTEKT_FØR_YP: PROC;                                           00005080
                                                                        00005090
                                                                        00005100
   DCL         FNR_PIC11                PIC '(11)9',                    00005110
               W_UFT_ÅM                 PIC '9999',                     00005120
               W_UFT_ÅMD                PIC '999999',                   00005130
               GAMMEL_GRAD              FIXED DEC     (3) INIT(0),      00005140
               GV                       FIXED DEC     (7) INIT(0),      00005150
               G_UFT                    FIXED DEC     (7) INIT(0),      00005160
               INNTEKT                  FIXED DEC     (7) INIT(0),      00005170
               POENG                    FIXED DEC   (5,2) INIT(0),      00005180
               ÅRET                     FIXED DEC     (3);              00005190
                                                                        00005200
    DCL       W_UFT_Å DEF W_UFT_ÅM  POS (1)    PIC    '99';             00005210
    DCL       W_UFT_M DEF W_UFT_ÅM  POS (3)    PIC    '99';             00005220
                                                                        00005230
    DCL        VIRK_ÅR_MND                  FIXED DEC (4);              00005240
    DCL        FNR_ÅR DEF FNR_PIC11 POS(5)    PIC '99';                 00005250
    DCL        G_VIRK   FIXED DEC (5) INIT (0);                         00005260
    DCL        W_INNTUP      FIXED DEC (9) INIT (0);                    00005270
    DCL        W_FAK         FIXED DEC (7,6) INIT (0);                  00005280
                                                                        00005290
                                                                        00005300
 /*PROGRAMMET BEGYNNER HER:*/                                           00005310
                                                                        00005320
    FNR_PIC11 = B02.FNR(YP_IND);                                        00005330
    G_VIRK    = G;                                                      00005340
                                                                        00005350
 /* *************************************************************** */  00005360
 /* FOR Å REGNE INNTKET_FØR_YP MÅ VI:                               */  00005370
 /*                      FINNE GRUNNBELØPET PÅ UFØRETIDSPUNKTET     */  00005380
 /*                      FINNE GRUNNBELØPET PÅ DAGEN                */  00005390
 /* *************************************************************** */  00005400
                                                                        00005410
    W_UFT_ÅM   = B02.INNT_DATO_ÅM(YP_IND);                              00005420
    W_UFT_ÅMD = W_UFT_Å * 10000 + W_UFT_M * 100 + 01;                   00005430
                                                                        00005440
    DO J = 1 TO 60;                                                     00005450
       IF W_UFT_ÅMD       >= PERIODE_START_ÅMD(J) &                     00005460
          W_UFT_ÅMD       <= PERIODE_SLUTT_ÅMD(J) THEN                  00005470
          DO;                                                           00005480
             G_UFT             = G_TAB_PERIODE.GRUNNBELØP(J);           00005490
             J                 = 99;                                    00005500
          END;                                                          00005510
    END;                                                                00005520
                                                                        00005530
    W_FAK     =  G / G_UFT;                                             00005540
    W_INNTUP  =  B02.INNTEKT_FØR_UP(YP_IND) *  100;                     00005550
    W_INNTUP  =  W_INNTUP *  W_FAK;                                     00005560
    W_INNT_GRENSE   =     W_INNTUP / 10;   /* 10/100 1095 TS */         00005570
                                                                        00005580
 END BEREGN_INNTEKT_FØR_YP ;                                            00005590
                                                                        00005600
  /* *************************************************************** */ 00005610
                                                                        00005620
  END  LAG_YRKEPENS_HEND;                                               00005630
