 /*       SIST ENDRET 08/10-82 14.04.31 AV   LUNDEBY                  */00000000
 /*       SIST ENDRET 20/09-82 11.34.04 AV   OLSEN                    */00000010
 /*       SIST ENDRET 10/09-82 12.25.33 AV   HELEN                    */00000020
 /*       SIST ENDRET 09/09-82 14.29.55 AV   HELEN                    */00000030
 /*       SIST ENDRET 23/08-82 08.18.47 AV   OLAV                     */00000040
  /* *************************************************************** */ 00000050
  /* IDENTIFIKASJON:   R0017412                                      */ 00000060
  /* PROGRAMMERER:  HELEN    JULI, 1982                              */ 00000070
  /* HENSIKT:                                                        */ 00000080
  /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT    */ 00000090
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */ 00000100
  /*        HVER AJOURFØRT TRANSAKSJON.                              */ 00000110
  /* PROGRAMTILKNYTNING:                                             */ 00000120
  /*        PROGRAMMET KALLES OPP AV R0017001                        */ 00000130
  /*        OG BLIR OPPKALT AV R0017401                              */ 00000140
  /*                                                                 */ 00000150
  /* *************************************************************** */ 00000160
    LAG_UFØRPENS_HEND:                                                  00000170
      PROC (UP_IND,UE_IND);                                             00000180
 DCL  UP_IND                               FIXED BIN(15);               00000190
 DCL  UE_IND                               FIXED BIN(15);               00000200
  /* *************************************************************** */ 00000210
  /* PROGRAMMET BEGYNNER HER . VI BLANKER W_HENDELSE.                */ 00000220
  /* *************************************************************** */ 00000230
    W_HENDELSE              =  '';                                      00000240
    W_HENDELSE.HENDDATO     =  B02.PERSON.STATUS.VIRK_DATO_ÅM(UP_IND);  00000250
    W_HENDELSE.VERSJON      =  W_ROT.NESTE_SB_VERSJON_NR;               00000260
    W_HENDELSE.TERMINAL     =  EIBLK.EIBTRMID;                          00000270
    W_HENDELSE.FNR_EKTEF    =  B02.PERSON.RF0PERSN.FNR(UE_IND);         00000280
    W_HENDELSE.NAVN_EKTEF   =  B02.PERSON.RF0PERSN.NAVN(UE_IND);        00000290
    W_HENDELSE.GP_BRUTTO    =  B02.PERSON.UFØRPENS.GP(UP_IND);          00000300
    W_HENDELSE.GP_NETTO     =  B02.PERSON.UFØRPENS.GP(UP_IND);          00000310
    W_HENDELSE.TP_BRUTTO    =  B02.PERSON.UFØRPENS.TP(UP_IND);          00000320
    W_HENDELSE.TP_NETTO     =  B02.PERSON.UFØRPENS.TP(UP_IND);          00000330
    W_HENDELSE.ST           =  B02.PERSON.UFØRPENS.ST(UP_IND);          00000340
    W_HENDELSE.KT           =  B02.PERSON.UFØRPENS.KT(UP_IND);          00000350
    W_HENDELSE.ET           =  B02.PERSON.UFØRPENS.ET(UP_IND);          00000360
    W_HENDELSE.BT           =  B02.PERSON.UFØRPENS.BT(UP_IND);          00000370
    W_HENDELSE.ANTALL_BARN  =  B02.PERSON.STATUS.ANTALL_BARN(UP_IND);   00000380
    W_HENDELSE.ANTALL_BARN_TIDL                                         00000390
                            =  B01.PERSON.STATUS.ANTALL_BARN(UP_IND);   00000400
    W_HENDELSE.ÅFT          =  B02.PERSON.UFØRPENS.ÅFT(UP_IND);         00000410
    CALL  PLASSER_TEKSTTYPE_A_KODE;                                     00000420
    /* CALL  PLASSER_TEKSTYPE_B1_KODE  */                               00000430
    TEKSTYPE_B1_KODE         =  9;                                      00000440
    /* CALL  PLASSER_TEKSTYPE_B2_KODE  */                               00000450
    TEKSTYPE_B2_KODE         =  9;                                      00000460
  /* *************************************************************** */ 00000470
  /* FØLGENDE  3 FELT SKAL EVT. REDIGERES INN I TEKSTTYPE B1.        */ 00000480
  /* *************************************************************** */ 00000490
    W_HENDELSE.UF_GRAD      =  B02.PERSON.UFØRPENS.UFG(UP_IND);         00000500
    W_HENDELSE.TT           =  B02.PERSON.STATUS.TT_ANV(UP_IND);        00000510
    W_HENDELSE.TT_EK        =  B02.PERSON.STATUS.TT_ANV(UE_IND);        00000520
    /* CALL  PLASSER_TEKSTYPE_C_KODE  */                                00000530
    TEKSTYPE_C_KODE         =  9;                                       00000540
    /* CALL  PLASSER_TEKSTYPE_D_KODE  */                                00000550
    TEKSTYPE_D_KODE         =  9;                                       00000560
    CALL INSERT_HENDELSE;                                               00000570
  /* *************************************************************** */ 00000580
  /* DERSOM PERSONEN SKAL HA BEREGNINGSVEDLEGG.                      */ 00000590
  /* *************************************************************** */ 00000600
  /*IF W_HENDELSE.TP_NETTO > 0 */                                       00000610
  /*   & B02.PERSON.UFØRPENS.TP(UP_IND) ^=                           */ 00000620
  /*                           B01.PERSON.UFØRPENS.TP(UP_IND) THEN   */ 00000630
  /*   CALL BYGG_OPP_BEREGNINGS_VEDLEGG_SEGMENT                      */ 00000640
  END  LAG_UFØRPENS_HEND;                                               00000650
