 /*       SIST ENDRET 13/03-98 13.35.22 AV   JDA7339                  */00000000
 /*       SIST ENDRET 13/03-98 13.20.15 AV   JDA7339                  */00000010
 /*       SIST ENDRET 28/01-98 15.14.11 AV   JDA7339                  */00000020
 /*       SIST ENDRET 28/01-98 15.12.17 AV   JDA7339                  */00000030
 /*       SIST ENDRET 29/08-97 12.29.37 AV   JDA7339                  */00000040
 /*       SIST ENDRET 28/08-97 08.56.50 AV   SPA7339                  */00000050
 /*       SIST ENDRET 28/07-97 12.31.41 AV   HLA7339                  */00000060
 /*       SIST ENDRET 21/02-96 08.38.40 AV   JDA0310                  */00000070
 /*       SIST ENDRET 13/02-96 11.17.24 AV   HLB0310                  */00000080
 /*       SIST ENDRET 05/09-94 10.07.28 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 25/02-94 13.06.00 AV   HERMAN                   */00000100
 /*       SIST ENDRET 01/11-93 15.35.26 AV   TRUDE                    */00000110
 /*       SIST ENDRET 21/09-93 09.46.43 AV   TRUDE                    */00000120
 /*       SIST ENDRET 20/09-93 15.40.30 AV   TRUDE                    */00000130
 /*       SIST ENDRET 13/09-93 14.30.04 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 23/02-93 14.31.06 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 27/01-93 15.09.02 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 26/10-92 13.27.56 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 19/10-92 13.41.54 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 19/10-92 09.19.20 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 28/07-92 09.39.47 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 26/04-91 12.28.49 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 03/04-91 17.13.32 AV   HERMAN                   */00000220
 /*       SIST ENDRET 06/03-91 14.06.48 AV   DYBVIK                   */00000230
 /* **************************************************************** */ 00000240
 /*IDENTIFIKASJON:                                                   */ 00000250
 /*    R001N620 - PROSEDYRE I PLI        HOVEDPROGRAM                */ 00000260
 /*    PROGRAMMERER: TRUDE SPONBERG                                  */ 00000270
 /*HENSIKT:                                                          */ 00000280
 /*    KONTROLLERE U2TRANS MOT STATUS FAMILIEFORHOLD.                */ 00000290
 /*    RUTINEN KONTROLLERER ALLE PERSONER I TRANSAKSJONEN MOT        */ 00000300
 /*    INFORMASJON I REGISTERET. FOR HVER FAMILIEPERSON SOM GÅR      */ 00000310
 /*    FEILFRI GJENNOM KONTROLLENE BLIR DET OPPRETTET NY STATUS      */ 00000320
 /*    FOR PERSONEN, OG SØKERENS STATUS OPPDATERES.                  */ 00000330
 /* ***************************************************************  */ 00000340
 /* ENDRET:                                                          */ 00000350
 /* ENDRINGEN GJELDER:                                               */ 00000360
 /* ENDRET AV:                                                       */ 00000370
 /* ***************************************************************  */ 00000380
 /*PROGRAMTILKNYTNING:                                               */ 00000390
 /*    KALLES OPP AV PROGRAM R0013520                                */ 00000400
 /*BRUK:                                                             */ 00000410
 /*    EXEC CICS XCTL PROGRAM ('R001N620') COMMAREA (KOM_OMR)        */ 00000420
 /*                                                                  */ 00000430
 /* **************************************************************** */ 00000440
                                                                        00000450
 %PAGE;                                                                 00000460
 U2TR:                                                                  00000470
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000480
                                                                        00000490
 %PAGE;                                                                 00000500
      %INCLUDE P001N601;                                                00000510
      %INCLUDE P0019906;                                                00000520
      %INCLUDE P0019908;                                                00000530
      %INCLUDE P0019910;                                                00000540
      %INCLUDE P0019912;                                                00000550
      %INCLUDE P0019913;                                                00000560
                                                                        00000570
   DCL (COMMAREA_PEKER,LOKAL_KOM_PTR) PTR;                              00000580
                                                                        00000590
 %PAGE;                                                                 00000600
   DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                       00000610
                                                                        00000620
 %PAGE;                                                                 00000630
   DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                       00000640
                                                                        00000650
 %PAGE;                                                                 00000660
   DCL 1 B00 BASED(B00_PEKER), %INCLUDE P0019921;                       00000670
                                                                        00000680
                                                                        00000690
   DCL                                                                  00000700
      BARN_IND       FIXED BIN(15),                                     00000710
      UF_IND         FIXED BIN(15),                                     00000720
      IND            FIXED BIN(15);                                     00000730
   DCL                                                                  00000740
      I              FIXED BIN(15),                                     00000750
      J              FIXED BIN(15);                                     00000760
                                                                        00000770
 /* ***************************************************************** */00000780
 /* HJELPE DCL FOR Å SNU DATO                                         */00000790
 /* ***************************************************************** */00000800
                                                                        00000810
   DCL                                                                  00000820
      HJ_VIRK_DATO_ÅM          PIC '9999';                              00000830
   DCL                                                                  00000840
      FNR                      PIC '(11)9',                             00000850
      FNR_R_MÅ POS (3) DEF FNR PIC '9999',                              00000860
      FNR_R_Å  POS (5) DEF FNR PIC '99',                                00000870
      FNR_R_ÅRHUNDRE                                                    00000880
               POS (7) DEF FNR PIC '9',                                 00000890
      SEKSTISJUÅRSDATO         PIC '99999',                             00000900
      SYTTIÅRSDATO             PIC '99999',                             00000910
      TJUEÅRSDATO              PIC '99999',                             00000920
      SISTE_PERIODE            PIC '99',                                00000930
      SISTE_UTFYLTE            PIC '99';                                00000940
   DCL                                                                  00000950
      1 ALDER_67 DEF SEKSTISJUÅRSDATO,                                  00000960
        2 ÅR                   PIC'999',                                00000970
        2 MND                  PIC'99';                                 00000980
                                                                        00000990
   DCL                                                                  00001000
      1 ALDER_70       DEF SYTTIÅRSDATO,                                00001010
        2 ÅR                   PIC'999',                                00001020
        2 MND                  PIC'99';                                 00001030
   DCL                                                                  00001040
      1 STATUS_TYPE_SØKER  CHAR(1);                                     00001050
   DCL                                                                  00001060
      CSTG BUILTIN;                                                     00001070
   DCL HJ_UFT_MÅ                       PIC'9999';                       00001080
   DCL HJ_UFT_M DEF HJ_UFT_MÅ POS(1)   PIC'99';                         00001090
   DCL HJ_UFT_Å DEF HJ_UFT_MÅ POS(3)   PIC'99';                         00001100
   DCL HJ_MÅ                           PIC'9999';                       00001110
   DCL HJ_M     DEF HJ_MÅ     POS(1)   PIC'99';                         00001120
   DCL HJ_Å     DEF HJ_MÅ     POS(3)   PIC'99';                         00001130
   DCL HJ_ÅM                           PIC'9999';                       00001140
   DCL HJ_ÅM_FIX              FIXED DEC (5) INIT (0);                   00001150
                                                                        00001160
   DCL MAX_BUP                FIXED DEC (3) INIT (0);                   00001170
   DCL TIL_ÅR                 FIXED DEC (3) INIT (0);                   00001180
   DCL TT_RED                 CHAR      (1) INIT (' ');                 00001190
                                                                        00001200
 %PAGE;                                                                 00001210
                                                                        00001220
 /* ***************************************************************** */00001230
 /* PROGRAMMET STARTER HER                                            */00001240
 /* ***************************************************************** */00001250
                                                                        00001260
    ALLOCATE LOKAL_KOM_OMR;                                             00001270
                                                                        00001280
    /*KOM_OMR.TRANS_OPPL_PEKER = TRANS_LISTE.TRANS_OPPL_PTR(1) */       00001290
                                                                        00001300
    HOVED_KOM_OMR_PTR   = COMMAREA_PEKER;                               00001310
    PROGRAM_ID          = 'R001N620';                                   00001320
    FNR                 = U2S.FNR;                                      00001330
    HJ_VIRK_DATO_ÅM     = F_SNU_DATO(U2S.VIRK_DATO_MÅ);                 00001340
                                                                        00001350
    IF FNR_R_ÅRHUNDRE < 5          THEN                                 00001360
       DO;                                                              00001370
          SEKSTISJUÅRSDATO    = F_SNU_DATO(FNR_R_MÅ) + 6700;            00001380
          SYTTIÅRSDATO        = F_SNU_DATO(FNR_R_MÅ) + 7000;            00001390
          TJUEÅRSDATO         = F_SNU_DATO(FNR_R_MÅ) + 2000;            00001400
       END;                                                             00001410
    ELSE                                                                00001420
       DO;                                                              00001430
          SEKSTISJUÅRSDATO    = F_SNU_DATO(FNR_R_MÅ) + 6700 - 10000;    00001440
          SYTTIÅRSDATO        = F_SNU_DATO(FNR_R_MÅ) + 7000 - 10000;    00001450
          TJUEÅRSDATO         = F_SNU_DATO(FNR_R_MÅ) + 2000 - 10000;    00001460
       END;                                                             00001470
                                                                        00001480
    TRANSTYPE           = 2;                                            00001490
    I                   = 0;                                            00001500
    IND                 = 0;                                            00001510
    SISTE_UTFYLTE       = 0;                                            00001520
                                                                        00001530
    DO I = 1 TO 7;         /*0697 HL*/                                  00001540
                                                                        00001550
       IF B01.UFØRHIST.UFT_ÅM (SØKER_IND,I) = 0 THEN                    00001560
          DO;                                                           00001570
             SISTE_UTFYLTE    = I - 1;                                  00001580
                                                                        00001590
             IF I             = 1               THEN                    00001600
                SISTE_UTFYLTE = 1;                                      00001610
                                                                        00001620
             I                = 7;        /*0697 HL*/                   00001630
          END;                                                          00001640
    END;                                                                00001650
                                                                        00001660
                                                                        00001670
 /* *************************************************************** */  00001680
 /*  GARANTI_TP . BLANKETTER MÅ AVVISES NÅR UFG REDUSERES.TS 0992   */  00001690
 /* *************************************************************** */  00001700
   L300:                                                                00001710
     IF B01.GARANTI_TP(SØKER_IND)  > 0  THEN                            00001720
       DO;                                                              00001730
         IF B01.UFØRHIST.UFG (SØKER_IND,SISTE_UTFYLTE) >                00001740
                U2S.UFG    THEN                                         00001750
                 DO;                                                    00001760
                   FEIL_VED_LABEL = '300';                              00001770
                   FEIL_MELD_NR   = 383;                                00001780
                   GO TO L999;                                          00001790
                 END;                                                   00001800
       END;                                                             00001810
                                                                        00001820
                                                                        00001830
    SISTE_PERIODE       = 7;             /*0697 HL*/                    00001840
                                                                        00001850
 /* ***************************************************************** */00001860
 /* HVIS SØKEREN HAR PENSJONSSTATUS                                   */00001870
 /* ***************************************************************** */00001880
                                                                        00001890
                                                                        00001900
    STATUS_TYPE_SØKER = STATUS_TYPE;                                    00001910
                                                                        00001920
           /* ***********************************************  */       00001930
           /* ETTERFØLGENDE TESTER GJELDER DISSE STATUS-TYPER: */       00001940
           /* - B - BYGGER PÅ SISTE STATUS                     */       00001950
           /* - D - BYGGER PÅ NEST SISTE STATUS                */       00001960
           /* - G - BYGGER PÅ NEST SISTE STATUS, ER OPPHØRT I  */       00001970
           /*       SISTE STATUS MED X (IKKE DØD)              */       00001980
           /* ************************************************ */       00001990
                                                                        00002000
                                                                        00002010
      IF STATUS_TYPE_SØKER = 'B' !                                      00002020
         STATUS_TYPE_SØKER = 'D' !                                      00002030
         STATUS_TYPE_SØKER = 'G' THEN                                   00002040
         DO;                                                            00002050
            IF B01.TKNR(SØKER_IND)  >  0        &                       00002060
               B01.TKNR(SØKER_IND)  ^= U2S.TKNR &                       00002070
               B01.SIVILSTAND(SØKER_IND) ^= 'A' THEN                    00002080
                                                                        00002090
 /* ***************************************************************** */00002100
 /* SØKEREN ER REGISTRERT MED ET ANNET TKNR I STATUS ENN I TRANS      */00002110
 /* ***************************************************************** */00002120
                                                                        00002130
               DO;                                                      00002140
  L100:                                                                 00002150
                  FEIL_VED_LABEL     = '100';                           00002160
                  FEIL_MELD_NR       =  1702;                           00002170
                  GO TO L999;                                           00002180
               END;                                                     00002190
                                                                        00002200
                                                                        00002210
            IF B01.PENSJONSTYPE1(SØKER_IND)    = 'L' THEN               00002220
                                                                        00002230
 /* ***************************************************************** */00002240
 /* SØKER ER REGISTRERT FRA FØR SOM FORSØRGET BARN. FORSØRGINGS-      */00002250
 /* TILLEGGET MÅ OPPHØRE FØR UFØREPENSJON KAN REGISTRERES.            */00002260
 /* ***************************************************************** */00002270
                                                                        00002280
                    DO;                                                 00002290
  L102:                                                                 00002300
                      FEIL_VED_LABEL = '102';                           00002310
                      FEIL_MELD_NR   = 1720;                            00002320
                      GO TO L999;                                       00002330
                    END;                                                00002340
                                                                        00002350
            IF B01.PENSJONSTYPE1(SØKER_IND)    = 'K' THEN               00002360
                                                                        00002370
 /* ***************************************************************** */00002380
 /* SØKER HAR AVTALEFESTET PENSJON FRA FØR.                           */00002390
 /* ***************************************************************** */00002400
                                                                        00002410
               DO;                                                      00002420
        L103:                                                           00002430
                  FEIL_VED_LABEL = '103';                               00002440
                  FEIL_MELD_NR   = 1104;                                00002450
                  GO TO L999;                                           00002460
               END;                                                     00002470
                                                                        00002480
            IF (B01.PENSJONSTYPE1(SØKER_IND)               = 'U'  !     00002490
                B01.PENSJONSTYPE1(SØKER_IND)               = 'Y' )    & 00002500
               B01.UFT_ÅM       (SØKER_IND,SISTE_UTFYLTE) > F_SNU_DATO( 00002510
                                                   U2S.UFT_MÅ)        & 00002520
               U2S.ATT_UF  ^= 'A'                                       00002530
                                                              THEN      00002540
                                                                        00002550
 /* ***************************************************************** */00002560
 /* SØKER ER REGISTRERT FRA FØR SOM UFØREPENSJONIST MED ET UFØRE-     */00002570
 /* TIDSPUNKT SENERE ENN DET SOM NÅ BLIR RAPPORTERT                   */00002580
 /* ***************************************************************** */00002590
                                                                        00002600
                    DO;                                                 00002610
  L110:                                                                 00002620
                      FEIL_VED_LABEL = '110';                           00002630
                      FEIL_MELD_NR   = 1711;                            00002640
                      GO TO L999;                                       00002650
                    END;                                                00002660
            ELSE                                                        00002670
               IF B01.VERNEPLIKTÅR(SØKER_IND,1) > 0 &                   00002680
                  U2S.VP_ÅR(1) = 0 THEN                                 00002690
                                                                        00002700
 /* ***************************************************************** */00002710
 /* SØKEREN REGISTRERT MED OPPLYSNING OM VERNEPLIKTSÅR, TRANSAKSJONER */00002720
 /* INNEHOLDER IKKE DETTE                                             */00002730
 /* ***************************************************************** */00002740
                                                                        00002750
                  DO;                                                   00002760
  L120:                                                                 00002770
                     FEIL_VED_LABEL = '120';                            00002780
                     FEIL_MELD_NR   = 1707;                             00002790
                     GO TO L999;                                        00002800
                  END;                                                  00002810
               ELSE                                                     00002820
                  DO;                                                   00002830
                     IF B01.OPPHØRSDATO_ÅM(                             00002840
                        SØKER_IND,SISTE_PERIODE) > F_SNU_DATO(          00002850
                                                   U2S.UFT_MÅ) THEN     00002860
                                                                        00002870
 /* ***************************************************************** */00002880
 /* SØKER ER REGISTRERT MED OPPHØRSDATO I UFØREHISTORIKK SENERE ENN   */00002890
 /* UFØRETIDSPUNKT I TRANSEN                                          */00002900
 /* ***************************************************************** */00002910
                                                                        00002920
                              DO;                                       00002930
  L130:                                                                 00002940
                                 FEIL_VED_LABEL = '130';                00002950
                                 FEIL_MELD_NR   = 1712;                 00002960
                                 GO TO L999;                            00002970
                              END;                                      00002980
                  END;                                                  00002990
                                                                        00003000
 /* ***************************************************************** */00003010
 /* HVIS DET ER EN EKTEFELLE I TRANSEN                                */00003020
 /* ***************************************************************** */00003030
                                                                        00003040
            IF U2S.FNR_EK > 0 THEN                                      00003050
               DO;                                                      00003060
                                                                        00003070
 /* ***************************************************************** */00003080
 /* HVIS SØKEREN ER UGIFT                                             */00003090
 /* ***************************************************************** */00003100
                                                                        00003110
                  SELECT ( B01.SIVILSTAND(SØKER_IND));                  00003120
                     WHEN ('U')                                         00003130
                        DO;                                             00003140
   L140:                                                                00003150
                          FEIL_VED_LABEL = '140';                       00003160
                          FEIL_MELD_NR   = 1001;                        00003170
                          GO TO L999;                                   00003180
                        END;                                            00003190
                                                                        00003200
 /* ***************************************************************** */00003210
 /* HVIS SØKEREN ER SKILT                                             */00003220
 /* ***************************************************************** */00003230
                                                                        00003240
                     WHEN ('S')                                         00003250
                        DO;                                             00003260
  L150:                                                                 00003270
                           FEIL_VED_LABEL = '150';                      00003280
                           FEIL_MELD_NR   = 1002;                       00003290
                           GO TO L999;                                  00003300
                        END;                                            00003310
                                                                        00003320
 /* ***************************************************************** */00003330
 /* HVIS SØKEREN ER ETTERLATT                                         */00003340
 /* ***************************************************************** */00003350
                                                                        00003360
                     WHEN ('E')                                         00003370
                        DO;                                             00003380
  L160:                                                                 00003390
                           FEIL_VED_LABEL = '160';                      00003400
                           FEIL_MELD_NR   = 1003;                       00003410
                           GO TO L999;                                  00003420
                        END;                                            00003430
                                                                        00003440
 /* ***************************************************************** */00003450
 /* ELLERS ER SØKEREN GIFT                                            */00003460
 /* ***************************************************************** */00003470
                                                                        00003480
                     OTHERWISE                                          00003490
                        DO;                                             00003500
                                                                        00003510
 /* ***************************************************************** */00003520
 /* HVIS DET ER EN ANNEN EKTEFELLE I SØKERENS PENSJONSSTATUS          */00003530
 /* ***************************************************************** */00003540
                                                                        00003550
                           IF B01.FNR(EKTEF_IND) ^= U2S.                00003560
                                                        FNR_EK  THEN    00003570
                              DO;                                       00003580
  L170:                                                                 00003590
                                 FEIL_VED_LABEL = '170';                00003600
                                 FEIL_MELD_NR   = 1004;                 00003610
                                 GO TO L999;                            00003620
                              END;                                      00003630
                                                                        00003640
 /* ***************************************************************** */00003650
 /* DET FORUTSETTES NÅ AT EKTEFELLEN ER I SØKERENS PENSJONSSTATUS     */00003660
 /* ***************************************************************** */00003670
                                                                        00003680
                           ELSE                                         00003690
                              DO;                                       00003700
                                                                        00003710
 /* ***************************************************************** */00003720
 /* HVIS DET SØKES OM EKTEFELLETILLEGG                                */00003730
 /* ***************************************************************** */00003740
                                                                        00003750
                              IF U2S.TILL_EK = 'J' THEN                 00003760
                                    DO;                                 00003770
 /* ***************************************************************** */00003780
 /* HVIS EKTEFELLEN HAR EGEN PENSJON                                  */00003790
 /* ***************************************************************** */00003800
                                                                        00003810
                                       IF (                             00003820
                                           B01.PENSJONSTYPE1(EKTEF_IND) 00003830
                                                              = 'A' !   00003840
                                           B01.PENSJONSTYPE1(EKTEF_IND) 00003850
                                                              = 'U' !   00003860
                                           B01.PENSJONSTYPE1(EKTEF_IND) 00003870
                                                              = 'Y' !   00003880
                                           B01.PENSJONSTYPE1(EKTEF_IND) 00003890
                                                              = 'K'  )  00003900
                                                                   THEN 00003910
                                          DO;                           00003920
  L180:                                                                 00003930
                                             FEIL_VED_LABEL = '180';    00003940
                                             FEIL_MELD_NR   = 1011;     00003950
                                             GO TO L999;                00003960
                                          END;                          00003970
                                                                        00003980
 /* ***************************************************************** */00003990
 /* EKTEFELLEN HAR IKKE PENSJON                                       */00004000
 /* ***************************************************************** */00004010
                                                                        00004020
                                       ELSE                             00004030
                                          DO;                           00004040
                                             CALL                       00004050
                                                 FLYTT_B01_TIL_B02(     00004060
                                                            SØKER_IND); 00004070
                                             IF FEIL_MELD_NR > 0 THEN   00004080
                                                GO TO L999;             00004090
                                             CALL                       00004100
                                                 FLYTT_B01_TIL_B02(     00004110
                                                            EKTEF_IND); 00004120
                                             IF FEIL_MELD_NR > 0 THEN   00004130
                                                GO TO L999;             00004140
                                             CALL                       00004150
                                              AJOURFØR_B02_MED_U2TRANS; 00004160
                                             IF FEIL_MELD_NR > 0 THEN   00004170
                                               GO TO L999;              00004180
                                          END;                          00004190
                                    END;                                00004200
                                                                        00004210
 /* ***************************************************************** */00004220
 /* DET SØKES IKKE OM EKTEFELLETILLEGG                                */00004230
 /* ***************************************************************** */00004240
                                                                        00004250
                                 ELSE                                   00004260
                                    DO;                                 00004270
                                       CALL                             00004280
                                       FLYTT_B01_TIL_B02(SØKER_IND);    00004290
                                       IF FEIL_MELD_NR > 0 THEN         00004300
                                          GO TO L999;                   00004310
                                       CALL                             00004320
                                       FLYTT_B01_TIL_B02(EKTEF_IND);    00004330
                                       IF FEIL_MELD_NR > 0 THEN         00004340
                                          GO TO L999;                   00004350
                                       CALL                             00004360
                                       AJOURFØR_B02_MED_U2TRANS;        00004370
                                       IF FEIL_MELD_NR > 0 THEN         00004380
                                          GO TO L999;                   00004390
                                    END;                                00004400
                              END;                                      00004410
                        END;                                            00004420
                  END;                                                  00004430
               END;                                                     00004440
                                                                        00004450
 /* ***************************************************************** */00004460
 /* DET ER INGEN EKTEFELLE I TRANSEN                                  */00004470
 /* ***************************************************************** */00004480
                                                                        00004490
            ELSE                                                        00004500
                                                                        00004510
 /* ***************************************************************** */00004520
 /* HVIS SØKERENS SIVILSTAND ER 'G' ELLER 'A' ELLER 'P' ELLER 'W'     */00004530
 /* ***************************************************************** */00004540
              DO;                                                       00004550
                 IF  B01.SIVILSTAND(SØKER_IND) = 'P' THEN               00004560
                     DO;                                                00004570
  L185:                                                                 00004580
                        FEIL_VED_LABEL = '185';                         00004590
                        FEIL_MELD_NR   = 1105;                          00004600
                        GO TO L999;                                     00004610
                     END;                                               00004620
                                                                        00004630
                 IF  B01.SIVILSTAND(SØKER_IND) = 'W' THEN               00004640
                     DO;                                                00004650
  L187:                                                                 00004660
                        FEIL_VED_LABEL = '187';                         00004670
                        FEIL_MELD_NR   = 1106;                          00004680
                        GO TO L999;                                     00004690
                     END;                                               00004700
                                                                        00004710
                                                                        00004720
                  IF (                                                  00004730
                       B01.SIVILSTAND(SØKER_IND) = 'G' !                00004740
                       B01.SIVILSTAND(SØKER_IND) = 'A') THEN            00004750
                     DO;                                                00004760
   L190:                                                                00004770
                        FEIL_VED_LABEL = '190';                         00004780
                        FEIL_MELD_NR   = 1102;                          00004790
                        GO TO L999;                                     00004800
                     END;                                               00004810
                  ELSE                                                  00004820
                     DO;                                                00004830
                        IF SØKER_IND > 3                      THEN      00004840
                           CALL FLYTT_B01_TIL_B02(3);                   00004850
                        ELSE                                            00004860
                           CALL FLYTT_B01_TIL_B02(SØKER_IND);           00004870
                        IF FEIL_MELD_NR > 0 THEN                        00004880
                           GO TO L999;                                  00004890
                                                                        00004900
                        PROGRAM_ID          = 'R001N620'   ;            00004910
                                                                        00004920
                        IF (B01.PENSJONSTYPE1(SØKER_IND) = 'B' !        00004930
                            B01.PENSJONSTYPE1(SØKER_IND) = 'N') THEN    00004940
                           DO;  /* AVDØD MOR/FAR FLYTTES */             00004950
                              B02.PERSON(1) = B01.PERSON(1);            00004960
                              B02.PERSON(2) = B01.PERSON(2);            00004970
                           END;                                         00004980
                        IF B01.PENSJONSTYPE1(SØKER_IND) = 'E' !         00004990
                           B01.PENSJONSTYPE2(SØKER_IND) = 'E'   THEN    00005000
                           B02.PERSON(EKTEF_IND) =                      00005010
                                            B01.PERSON(EKTEF_IND);      00005020
                        CALL AJOURFØR_B02_MED_U2TRANS;                  00005030
                        IF FEIL_MELD_NR > 0 THEN                        00005040
                           GO TO L999;                                  00005050
                     END;                                               00005060
              END; /*??*/                                               00005070
         END; /*STATUS TYPE*/                                           00005080
      ELSE                                                              00005090
         DO;                                                            00005100
                                                                        00005110
 /* **************************************************************** */ 00005120
 /* SØKER ER I BASEN, HAR IKKE PENSJONSSTATUS                        */ 00005130
 /* ELLER HAR EN OPPHØRT PENSJONSSTATUS (STATUS_KODE_HIST = O / X)   */ 00005140
 /* **************************************************************** */ 00005150
 /* KS 6/12-84 */                                                       00005160
            /**************************************************/        00005170
            /* DET ETTERFØLGENDE GJELDER DISSE STATUS_TYPER:  */        00005180
            /* - A - IKKE STATUS-SEGMENT ELLER STATUS-SEGMENT */        00005190
            /*       SOM ER OPPHØRT, STATUS_KODE_HIST = 'O'   */        00005200
            /*       INGEN OPPL. FRA STATUS SKAL MED I B02    */        00005210
            /* - C - IKKE STATUS_SEGMENT                      */        00005220
            /* - I - HAR STATUS_SEGMENT(SS) SOM ER HISTORISK, */        00005230
            /*       STATUS_KODE_HIST = 'X', UFØREHISTORIKKEN */        00005240
            /*       SKAL VÆRE MED OVER TIL B02               */        00005250
            /* - K - HAR STATUS_SEGMENT(NS) SOM ER HISTORISK  */        00005260
            /*       STATUS_KODE_HIST = 'X', UFØREHISTORIKKEN */        00005270
            /*       SKAL VÆRE MED OVER TIL B02.              */        00005280
            /* ********************************************** */        00005290
                                                                        00005300
                                                                        00005310
            IF B01.FNR(SØKER_IND) > 0 THEN                              00005320
               DO;                                                      00005330
                  IF SØKER_IND > 3                      THEN            00005340
                     CALL FLYTT_B01_TIL_B02(3);                         00005350
                  ELSE                                                  00005360
                     CALL FLYTT_B01_TIL_B02(SØKER_IND);                 00005370
                  IF FEIL_MELD_NR > 0 THEN                              00005380
                     GO TO L999;                                        00005390
                  B02.NAVN(SØKER_IND)     =  U2S.NAVN;                  00005400
               END;                                                     00005410
            ELSE                                                        00005420
                                                                        00005430
 /* ***************************************************************** */00005440
 /* ROTSEGMENTOPPLYSNINGER.                                           */00005450
 /* ***************************************************************** */00005460
                                                                        00005470
               DO;                                                      00005480
                  B02.FNR (SØKER_IND)     =  U2S.FNR;                   00005490
                  B02.NAVN(SØKER_IND)     =  U2S.NAVN;                  00005500
                  B02.TKNR(SØKER_IND)     =  U2S.TKNR;                  00005510
                  B02.SPRÅK(SØKER_IND)    =  U2S.SPRÅK;                 00005520
               END;                                                     00005530
                                                                        00005540
 /* ***************************************************************** */00005550
 /* HVIS DET ER EKTEFELLE I TRANSEN                                   */00005560
 /* ***************************************************************** */00005570
                                                                        00005580
            IF U2S.FNR_EK > 0 THEN                                      00005590
               DO;                                                      00005600
                  POS_I_B01 = EKTEF_IND;                                00005610
                  SEARCH_FNR = U2S.FNR_EK;                              00005620
                  EXEC CICS LINK PROGRAM('R0019928') COMMAREA(KOM_OMR); 00005630
                  IF FEIL_MELD_NR > 0 THEN                              00005640
                     GO TO L999;                                        00005650
                  ELSE                                                  00005660
                     PROGRAM_ID = 'R001N620';                           00005670
                                                                        00005680
 /* ***************************************************************** */00005690
 /* HVIS EKTEFELLEN IKKE HAR PENSJONSSTATUS                           */00005700
 /* ***************************************************************** */00005710
                                                                        00005720
                  IF STATUS_TYPE = 'A' !                                00005730
                     STATUS_TYPE = 'I' !                                00005740
                     STATUS_TYPE = 'K' !   /* KS 6/12-84 */             00005750
                     STATUS_TYPE = 'C' THEN                             00005760
                     DO;                                                00005770
                                                                        00005780
 /* ***************************************************************** */00005790
 /* HVIS EKTEFELLEN ER I BASEN MEN IKKE HAR PENSJONSSTATUS            */00005800
 /* ***************************************************************** */00005810
                                                                        00005820
                        IF B01.FNR(EKTEF_IND) > 0 THEN                  00005830
                           DO;                                          00005840
                              CALL FLYTT_B01_TIL_B02 (EKTEF_IND);       00005850
                              IF FEIL_MELD_NR > 0 THEN                  00005860
                                 GO TO L999;                            00005870
                              B02.NAVN(EKTEF_IND)     =  U2S.NAVN_EK;   00005880
                              B02.TKNR(EKTEF_IND)     =  U2S.TKNR;      00005890
                           END;                                         00005900
                        ELSE                                            00005910
                                                                        00005920
 /* ***************************************************************** */00005930
 /* ROTSEGMENTOPPLYSNINGER.                                           */00005940
 /* ***************************************************************** */00005950
                                                                        00005960
                           DO;                                          00005970
                              B02.FNR (EKTEF_IND)     =  U2S.FNR_EK;    00005980
                              B02.NAVN(EKTEF_IND)     =  U2S.NAVN_EK;   00005990
                              B02.TKNR(EKTEF_IND)     =  U2S.TKNR;      00006000
                              B02.SPRÅK(EKTEF_IND)    =  U2S.SPRÅK;     00006010
                           END;                                         00006020
                                                                        00006030
                        /* R0010621 ENDRET 8/12-84 AV KARIN */          00006040
                                                                        00006050
                        CALL OPPRETT_STATUS_U2_SØKER;                   00006060
                        IF FEIL_MELD_NR > 0 THEN                        00006070
                           GO TO L999;                                  00006080
                                                                        00006090
                        IF B01.PENSJONSTYPE1(EKTEF_IND) = ' ' &         00006100
 /*0296 HL*/         B01.STATUS_KODE_HIST(EKTEF_IND) ^= 'X' THEN        00006110
                           B02.FØRSTE_GANG_REG(EKTEF_IND) = 'J';        00006120
                                                                        00006130
                        CALL KOBLE_TO_PERSONER(SØKER_IND,               00006140
                                                      EKTEF_IND);       00006150
                     END;                                               00006160
                  ELSE                                                  00006170
                     DO;                                                00006180
                                                                        00006190
 /* ***************************************************************** */00006200
 /* HVIS EKTEFELLEN HAR PENSJONSSTATUS                                */00006210
 /* ***************************************************************** */00006220
                                                                        00006230
                        IF STATUS_TYPE = 'F' !                          00006240
                           STATUS_TYPE = 'H' THEN                       00006250
  L195:                                                                 00006260
                           DO;                                          00006270
                              FEIL_VED_LABEL = '195';                   00006280
                              FEIL_MELD_NR   = 1716;                    00006290
                              GO TO L999;                               00006300
                           END;                                         00006310
                        ELSE                                            00006320
                           DO;                                          00006330
                              FEIL_VED_LABEL = '195';                   00006340
                              FEIL_MELD_NR   = 1008;                    00006350
                              GO TO L999;                               00006360
                                                                        00006370
                           END;                                         00006380
                     END;                                               00006390
               END;                                                     00006400
            ELSE                                                        00006410
               DO;                                                      00006420
                  CALL OPPRETT_STATUS_U2_SØKER;                         00006430
                  IF FEIL_MELD_NR > 0 THEN                              00006440
                     GO TO L999;                                        00006450
               END;                                                     00006460
                                                                        00006470
         END; /*ER FLYTTET FØR TEST PÅ REDUSERT ANTALL_BUP_ÅR */        00006480
              /*TRUDE 270792                                  */        00006490
 /*LOVENDRING 1.1.91 - REDUSERT ANTALL BUP_ÅR - HL : */                 00006500
 /* TEST PÅ NORSK BOSATT = 'N', TRUDE 20.0993*/                         00006510
                                                                        00006520
     /* IF U2S.NORSK_BOSATT  = 'N' THEN   */                            00006530
        IF TT_RED            = 'J' THEN    /*TRUDE 011193*/             00006540
          DO;                                                           00006550
            MAX_BUP = (B02.TT_FRAMT(SØKER_IND) + 6) / 12;               00006560
            TIL_ÅR  = B02.UFØRHIST.UFT_ÅM(SØKER_IND,UF_IND) / 100       00006570
                      + MAX_BUP - 1;                                    00006580
  /* RETTET TIL OVENS.+ MAX_BUP  13.0993 TRUDE */                       00006590
                                                                        00006600
  /*NOTAT 11.12.97 FRA TVEDT,(ENDRET 9712 HL) ENDRET TILBAKE*/          00006610
            IF (ALDER_67.ÅR - 1) > TIL_ÅR         THEN                  00006620
  /*        IF  ALDER_67.ÅR  > TIL_ÅR         THEN        */            00006630
               B02.UFØRHIST.REDUSERT_ANT_BUP_ÅR(SØKER_IND,UF_IND)       00006640
                   = MAX_BUP;                                           00006650
                                                                        00006660
  /* HER MÅ DET OGSÅ TESTES PÅ LIK , >= TIL_ÅR. TRUDE 191092       */   00006670
  /* HER MÅ DET OGSÅ TESTES BOSATT ='N'. PGA OVENST. TRUDE 126102  */   00006680
  /* STM NEDENFOR GIR ET ÅR FOR LITE POENGÅR                       */   00006690
  /* RETTES TIL SLIK DET VAR FØR.  TRUDE. DVS FOREGÅENDE STM       */   00006700
  /*        IF U2S.NORSK_BOSATT   = 'N'        &                   */   00006710
  /*           (ALDER_67.ÅR - 1) >= TIL_ÅR         THEN            */   00006720
  /*           B02.UFØRHIST.REDUSERT_ANT_BUP_ÅR(SØKER_IND,UF_IND)  */   00006730
  /*               = MAX_BUP                                       */   00006740
  /*  TEST TIL HIT 22.2.93  TRUDE                                  */   00006750
          END;                                                          00006760
                                                                        00006770
 /* *************************************************************** */  00006780
 /*        BARNEDELEN                                               */  00006790
 /* *************************************************************** */  00006800
                                                                        00006810
 /* DO 1 */                                                             00006820
      DO I = 1 TO U2S.BT_ANT;                                           00006830
         BARN_IND = 0;                                                  00006840
         DO J = 3 TO 14 WHILE (B02.FNR(J) > 0);                         00006850
            IF U2B.FNR_BARN(I) = B02.FNR (J) THEN                       00006860
               DO;                                                      00006870
                  BARN_IND = J;                                         00006880
                  J        = 14;                                        00006890
               END;                                                     00006900
         END;                                                           00006910
 %PAGE;                                /* */                            00006920
                                                                        00006930
 /* ***************************************************************** */00006940
 /* BARNET ER IKKE I B01, IKKE TILKNYTTET SØKER ELLER SØKERS EKTEFELLE*/00006950
 /* ***************************************************************** */00006960
                                                                        00006970
 /* IF 1 */                                                             00006980
         IF BARN_IND = 0 THEN                                           00006990
 /* DO 2 */ DO;                                                         00007000
               BARN_IND        = J;                                     00007010
               SEARCH_FNR      = U2B.FNR_BARN(I);                       00007020
               POS_I_B01       = BARN_IND;                              00007030
                                                                        00007040
               EXEC CICS LINK PROGRAM('R0019928') COMMAREA(KOM_OMR);    00007050
                                                                        00007060
               IF FEIL_MELD_NR > 0 THEN                                 00007070
                  GO TO L999;                                           00007080
               ELSE                                                     00007090
                  PROGRAM_ID = 'R001N620';                              00007100
                                                                        00007110
 /* *************************************************************** */  00007120
 /* DERSOM BARNET IKKE HAR PENSJONSSTATUS.                          */  00007130
 /* *************************************************************** */  00007140
                                                                        00007150
 /* IF 2 */    IF STATUS_TYPE = 'A' !                                   00007160
                  STATUS_TYPE = 'I' !                                   00007170
                  STATUS_TYPE = 'C' THEN                                00007180
 /* DO 3 */       DO;                                                   00007190
                                                                        00007200
 /* *************************************************************** */  00007210
 /* DERSOM BARNET ER I BASEN.                                       */  00007220
 /* *************************************************************** */  00007230
                                                                        00007240
 /* IF 3 */          IF B01.FNR(BARN_IND) > 0 THEN                      00007250
                        DO;                                             00007260
                           CALL FLYTT_B01_TIL_B02(BARN_IND);            00007270
                           IF FEIL_MELD_NR > 0 THEN                     00007280
                              GO TO L999;                               00007290
                        END;                                            00007300
                                                                        00007310
 /* *************************************************************** */  00007320
 /* BARNET ER IKKE I BASEN.                                         */  00007330
 /* *************************************************************** */  00007340
                                                                        00007350
 /* IF 3 */          ELSE                                               00007360
                                                                        00007370
 /* ***************************************************************** */00007380
 /* ROTSEGMENTOPPLYSNINGER.                                           */00007390
 /* ***************************************************************** */00007400
                                                                        00007410
                         DO;                                            00007420
                            B02.FNR (BARN_IND)     =  U2B.FNR_BARN (I); 00007430
                            B02.NAVN(BARN_IND)     =  (25)' ';          00007440
                            B02.TKNR(BARN_IND)     =  U2S.TKNR;         00007450
                            B02.SPRÅK(BARN_IND)    =  U2S.SPRÅK;        00007460
                         END;                                           00007470
                                                                        00007480
                    IF U2B.RBT_BARN(I) = 'J' THEN                       00007490
                       B02.PENSJONSTYPE2(BARN_IND) = 'R';               00007500
                    ELSE                                                00007510
                       B02.PENSJONSTYPE2(BARN_IND) = ' ';               00007520
                     CALL                                               00007530
                     OPPRETT_STATUS_FORS_BARN (                         00007540
                                              BARN_IND,SØKER_IND);      00007550
                     CALL KOBLE_TO_PERSONER(SØKER_IND,BARN_IND);        00007560
 /* DO 3 */       END;                                                  00007570
 /* IF 2 */    ELSE                                                     00007580
 /* NY DO 3 */    DO;                                                   00007590
                                                                        00007600
 /* ***************************************************************** */00007610
 /*               BARNET HAR PENSJONSSTATUS                           */00007620
 /* ***************************************************************** */00007630
                                                                        00007640
 /* NY IF 2 */       IF STATUS_TYPE ^= 'F'  THEN                        00007650
 /* NY IF 3 */          IF B01.FNR_TILKN(BARN_IND,1) > 0 THEN           00007660
 /* DO 4 */                DO;                                          00007670
                                                                        00007680
 /* *************************************************************** */  00007690
 /* FORSØRGET BARN.                                                 */  00007700
 /* *************************************************************** */  00007710
                                                                        00007720
 /* IF 4 */                                                             00007730
                              IF B01.PENSJONSTYPE1 (BARN_IND)           00007740
                                                                        00007750
                                                         = 'L' THEN     00007760
 /* DO 5 */                      DO;                                    00007770
                                                                        00007780
                                   IF    B01.FNR_TILKN (BARN_IND,1)     00007790
                                      =  B01.FNR (SØKER_IND)   THEN     00007800
                                                                        00007810
 /* BARNET ER REGISTRERT FRA FØR                                   */   00007820
                                                                        00007830
                                      DO;                               00007840
                                         CALL                           00007850
                                          FLYTT_B01_TIL_B02(BARN_IND);  00007860
                                         IF FEIL_MELD_NR > 0 THEN       00007870
                                           GO TO L999;                  00007880
                                         CALL                           00007890
                                          OPPRETT_STATUS_FORS_BARN (    00007900
                                              BARN_IND,SØKER_IND);      00007910
                                         CALL KOBLE_TO_PERSONER(        00007920
                                             SØKER_IND,BARN_IND);       00007930
                                         IF B01.VIRK_DATO_ÅM(BARN_IND)= 00007940
                                            B02.VIRK_DATO_ÅM(BARN_IND)  00007950
                                                                    THEN00007960
                                                                        00007970
 /* NEST SISTE STATUS FJERNES - INGEN ENDRING FOR BARNET            */  00007980
                                                                        00007990
                                            B01.VIRK_DATO_ÅM(BARN_IND)  00008000
                                            = 0;                        00008010
                                                                        00008020
                                      END;                              00008030
                                   ELSE                                 00008040
                                                                        00008050
                                      DO;                               00008060
  L210:                                                                 00008070
                                         FEIL_VED_LABEL = '210';        00008080
                                         FEIL_MELD_NR   = 1203;         00008090
                                         GO TO L999;                    00008100
                                      END;                              00008110
 /* DO 5 */                       END;                                  00008120
 /* IF 4 */                   ELSE                                      00008130
                                 DO;                                    00008140
  L230:                                                                 00008150
                                    FEIL_VED_LABEL = '230';             00008160
                                    FEIL_MELD_NR   = 1206;              00008170
                                    GO TO L999;                         00008180
                                 END;                                   00008190
                                                                        00008200
 /* ************************************************************** */   00008210
 /* BARNET HAR DA EGEN YTELSE.                                     */   00008220
 /* ************************************************************** */   00008230
                                                                        00008240
 /* DO 4 */                END;                                         00008250
 /* IF 3 */             ELSE                                            00008260
                           DO;                                          00008270
  L240:                                                                 00008280
                              FEIL_VED_LABEL = '240';                   00008290
                              FEIL_MELD_NR   = 1204;                    00008300
                              GO TO L999;                               00008310
                           END;                                         00008320
 /* DO 3 */       END;                                                  00008330
 /* DO 2 */ END;                                                        00008340
                                                                        00008350
 /* ************************************************************** */   00008360
 /* BARNET ER TILKNYTTET SØKERENS FAMILIE.                         */   00008370
 /* ************************************************************** */   00008380
 /* IF 2 */                                                             00008390
         ELSE                                                           00008400
 /* ***************************************************************** */00008410
 /* SØKEREN HAR ATTFØRING FRA FØR.SS = NS OG NS BLIR FJERNET.         */00008420
 /* ***************************************************************** */00008430
                                                                        00008440
            IF U2S.ATT_UF ^= 'A' !                                      00008450
               (U2S.ATT_UF = 'A' &                                      00008460
               ^(STATUS_TYPE = 'B' &                                    00008470
                   TRANS_LISTE_INDEX > 1))  THEN                        00008480
 /* DO 2 */   DO;                                                       00008490
                                                                        00008500
 /* ************************************************************** */   00008510
 /* DERSOM BARNET IKKE ER TILKNYTTET SØKER.                        */   00008520
 /* ************************************************************** */   00008530
                                                                        00008540
               IF B01.FNR_TILKN(BARN_IND,1) ^= B01.FNR(SØKER_IND)       00008550
                                                                THEN    00008560
                  DO;                                                   00008570
  L250:                                                                 00008580
                     FEIL_VED_LABEL = '250';                            00008590
                     FEIL_MELD_NR   = 1201;                             00008600
                     GO TO L999;                                        00008610
                  END;                                                  00008620
               ELSE                                                     00008630
 /* DO 3 */       DO;                                                   00008640
                                                                        00008650
 /* ************************************************************** */   00008660
 /* IKKE FORSØRGET BARN.                                           */   00008670
 /* ************************************************************** */   00008680
                                                                        00008690
                     IF B01.PENSJONSTYPE1(BARN_IND) ^= 'L' THEN         00008700
                        DO;                                             00008710
  L260:                                                                 00008720
                           FEIL_VED_LABEL = '260';                      00008730
                           FEIL_MELD_NR   = 1207;                       00008740
                           GO TO L999;                                  00008750
                        END;                                            00008760
                                                                        00008770
                     ELSE                                               00008780
                        IF U2B.RBT_BARN (I) = 'J'      THEN             00008790
                           B02.PENSJONSTYPE2 (BARN_IND) = 'R';          00008800
                        ELSE                                            00008810
                           B02.PENSJONSTYPE2 (BARN_IND) = ' ';          00008820
                                                                        00008830
 /* DO 3 */       END;                                                  00008840
 /* DO 2 */ END;                                                        00008850
 /* IF 1 */                                                             00008860
 /* DO 1 */                                                             00008870
      END;                                                              00008880
                                                                        00008890
                                                                        00008900
 /* ************************************************************* */    00008910
 /* BARN TILKNYTTET SØKER MED L (FORSØRGEDE BARN)                 */    00008920
 /* ************************************************************* */    00008930
                                                                        00008940
  IF    B02.PENSJONSTYPE1(SØKER_IND) = 'U' !                            00008950
        B02.PENSJONSTYPE1(SØKER_IND) = 'Y' THEN                         00008960
                                                                        00008970
     DO;                                                                00008980
        B02.ANTALL_BARN(SØKER_IND) = 0;                                 00008990
        DO I = 1 TO 13 WHILE                                            00009000
                        (B02.TILKN.FNR_TILKN(SØKER_IND,I) > 0 );        00009010
           IF B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'L'  !          00009020
              B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'V'  !          00009030
              B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'W'  THEN       00009040
              B02.ANTALL_BARN(SØKER_IND) =                              00009050
                                 B02.ANTALL_BARN(SØKER_IND) + 1;        00009060
        END;                                                            00009070
     END;                                                               00009080
                                                                        00009090
                                                                        00009100
 /* ************************************************************* */    00009110
 /* NYTT UFØRE-TILFELLE . DET KAN ENDRE EN PERSONS POENG.         */    00009120
 /* DATA SKRIVES UT TIL NORTRYGD-KONTORENE .                      */    00009130
 /* ************************************************************* */    00009140
                                                                        00009150
  CALL P900_NOR_DATA (B02.FNR(SØKER_IND) , B02.TKNR(SØKER_IND) );       00009160
                                                                        00009170
  IF   FEIL_MELD_NR                 =  0                        THEN    00009180
       PROGRAM_ID                   = 'R001N620'                   ;    00009190
                                                                        00009200
  L999:                                                                 00009210
     EXEC CICS RETURN;                                                  00009220
                                                                        00009230
                                                                        00009240
                                                                        00009250
 %PAGE;                                                                 00009260
        %INCLUDE R001N621;  /* OPPRETT_STATUS_U2_SØKER   */             00009270
        %INCLUDE R001N622;  /* AJOURFØR B02 MED U2 TRANS */             00009280
        %INCLUDE R001N824;  /* F_BEREGN_TT_FRAMT_UTLAND  */             00009290
        %INCLUDE R001U623;  /* UNGE_UFØRE                */             00009300
        %INCLUDE R0019905;  /* REGN ALDER PR VIRKDATO    */             00009310
        %INCLUDE R0019913;  /* SNU DATO                  */             00009320
        %INCLUDE R0019923;  /* OPPRETT STATUS FOR BARN   */             00009330
        %INCLUDE R0019924;  /* KOBLE TO PERSONER         */             00009340
        %INCLUDE R0019926;  /* FLYTT B01 TIL B02         */             00009350
        %INCLUDE R0019957;  /* P900_NOR_DATA (FNR,TKNR)  */             00009360
        %INCLUDE R0019940;  /* P900_NOR_DATA (FNR,TKNR)  */             00009370
        %INCLUDE R0019934;  /* OPPHØR_KOBLING_TO_PERSONER*/             00009380
        %INCLUDE R0019954;  /* RULL_FORVENTET            */             00009390
        %INCLUDE R0019967;  /* RULL_FAI                  */             00009400
        %INCLUDE R0019968;  /* F_RULL_FORSI              */             00009410
                                                                        00009420
                                                                        00009430
   END U2TR;                                                            00009440
