 /*       SIST ENDRET 05/12-97 12.45.20 AV   JDA7339                  */00000000
 /*       SIST ENDRET 27/11-97 11.51.01 AV   JDA7339                  */00000010
 /*       SIST ENDRET 02/01-96 17.06.11 AV   HLB0310                  */00000020
 /*       SIST ENDRET 06/01-94 09.13.49 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 05/01-94 15.28.01 AV   TRUDE                    */00000040
 /*       SIST ENDRET 05/01-94 14.03.30 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 03/01-94 12.27.17 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 01/12-89 08.51.11 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 21/06-88 08.34.53 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 22/03-88 09.41.42 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 14/03-88 08.18.43 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 09/03-88 14.49.45 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 09/03-88 12.34.50 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 08/03-88 11.30.14 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 23/02-88 12.50.32 AV   DYBVIK                   */00000140
                                                                        00000150
 /*IDENTIFIKASJON:                                                    */00000160
 /* **********************                                            */00000170
 /*  PROGRAM-IDENT : R0010430  - HOVEDPROGRAM                         */00000180
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000190
 /*  PROGRAMMERER  : PATHAK S.                                        */00000200
 /*  PROGRAMMET BLE LAGET : APRIL 1988                                */00000210
 /*  ENDRINGSDATO:                                                    */00000220
 /*  ENDRINGEN GJELDER:                                               */00000230
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000240
 /*                                                                   */00000250
 /* ***************************************************************** */00000260
 /*HENSIKT:                                                           */00000270
 /* **********                                                        */00000280
 /*  PROGRAMMET SKRIVER UT OPPLYSNINGER I HENHOLD TIL LOVEN OM        */00000290
 /*  INNSYNSRETT.                                                     */00000300
 /*                                                                   */00000310
 /*   - SENDER SKJERM-BILDE   MED ALLE OPPLYSNINGER FOR ET FNR        */00000320
 /*   - NØKKEL ER FNR.                                                */00000330
 /*   - SKRIVER RAPPORT PÅ PRINTER - DRAMMENSVEIEN                    */00000340
 /*   - SKRIVER RAPPORT PÅ PRINTER - DRIFT                            */00000350
 /*                                                                   */00000360
 /*  PROGRAMMET ER DEL AV ADMINISTRASJONS-RUTINA                      */00000370
 /*                                                                   */00000380
 /*                                                                   */00000390
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSKODE = RA43.        */00000400
 /*  DENNE TRANSKODE SETTES I R0010420                                */00000410
 /*  PROGRAMMET BLIR AKTIVISERT FRA BILDE S001023 I PROGRAM R0010420  */00000420
 /*  NÅR BRUKEREN TASTER INN 'IN'                                     */00000430
 /*                                                                   */00000440
 /*  PROGRAM SENDER BILDE S001A43 MED FAST TEKST MED VALG FUNSJONER   */00000450
 /*                                                                   */00000460
 /*  'NY'   FOR SØKER NY FNR                                          */00000470
 /*         FNR (11 SIFFER) ER KONTROLLET MED  R0019904 FOR GYLDIG    */00000480
 /*         FNR (11 SIFFER) ER KONTROLLET MED  R0019910 FOR NUMERIK   */00000490
 /*         FØDSELSNR-ENDRINGSREG: LESES I R0019906                   */00000500
 /*  HVIS ALT ER OK LESER BASE FOR ALLE OPPLYSNING FOR DETTE FNR      */00000510
 /*  OG SENDER BILDE MED INFORMASJONER                                */00000520
 /*                                                                   */00000530
 /*  'NS'   KAN BRUKES FOR   'NEST-SIDE'                              */00000540
 /*         HVIS FLERE INFORMASJONER LIGGER                           */00000550
 /*                                                                   */00000560
 /*  'FS'   FOR GO TIL FORRIGE SIDE                                   */00000570
 /*                                                                   */00000580
 /*  'DR'   FOR Å SKRIVE ALL INFORMASJON I DRAMMENSVEIEN              */00000590
 /*                                                                   */00000600
 /*  'DF'   FOR Å SKRIVE ALL INFORMASJON PÅ DRIFTEN                   */00000610
 /*                                                                   */00000620
 /*                                                                   */00000630
 /* ***************************************************************** */00000640
                                                                        00000650
 R001043: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                          00000660
   DCL  1  COMMAREA_PEKER   POINTER;                                    00000670
   %PAGE;                                                               00000680
   %INCLUDE P0019906;     /* TRANS_OPPL_OMRÅDE   */                     00000690
                                                                        00000700
   %PAGE;                                                               00000710
   %INCLUDE P0019908;     /*     KOM_OMR   */                           00000720
                                                                        00000730
   %PAGE;                                                               00000740
   %INCLUDE P0019910;     /*  STYRING-OMRÅDE (BASED) */                 00000750
                                                                        00000760
   %PAGE;                                                               00000770
   %INCLUDE P0019912;     /* DIV-PARAM-OM  */                           00000780
                                                                        00000790
   %PAGE;                                                               00000800
   %INCLUDE S001A4;    /*  UP-MAPSETTET   */                            00000810
                                                                        00000820
   %PAGE;                                                               00000830
  /*  %INCLUDE DFHBMSCA;    */                                          00000840
                                                                        00000850
                                                                        00000860
 %PAGE;                                                                 00000870
 DCL 1 B01 BASED(B01_PEKER),                                            00000880
 %INCLUDE P0019921;                                                     00000890
                                                                        00000900
 DCL 1 B02 BASED(B02_PEKER),                                            00000910
 %INCLUDE P0019921;                                                     00000920
                                                                        00000930
 %PAGE;                                                                 00000940
                                                                        00000950
                                                                        00000960
                                                                        00000970
     DCL KOM_OMR_PEKER          POINTER,                                00000980
         BMSMAPBR               POINTER,                                00000990
         PRI_RBA                POINTER;                                00001000
                                                                        00001010
 DCL                                                                    00001020
    VERIFY              BUILTIN,                                        00001030
    CURSOR_POS           FIXED BIN(15) INIT(-1);                        00001040
                                                                        00001050
 /* ************************************************* */                00001060
 /*  PRINTER NAVN OG ANDRE PARAMETER                  */                00001070
 /*                                                   */                00001080
 /*                                                   */                00001090
 /* ************************************************* */                00001100
 DCL                                                                    00001110
    1 CHARLIST2,                                                        00001120
      2 PRINTER,                                                        00001130
        3 TERMID           CHAR(4)  INIT ('R2AK'),                      00001140
        3 RESERV           CHAR(12) INIT (' '),                         00001150
      2 SISTE,                                                          00001160
        3 SLUTT            FIXED BIN(15) INIT(-1),                      00001170
        3 RESERV           CHAR(14)      INIT(' ');                     00001180
                                                                        00001190
                                                                        00001200
                                                                        00001210
 DCL 1 INT_VERIBLE,                                                     00001220
       2 IÅR                   BIN FIXED (15),                          00001230
       2 VÅR                   BIN FIXED (15),                          00001240
       2 UHIST                 BIN FIXED (15),                          00001250
       2 IX                    BIN FIXED (15) INIT (1),                 00001260
       2 IY                    BIN FIXED (15),                          00001270
       2 TIL                   BIN FIXED (15),                          00001280
                                                                        00001290
       2 BLANK_P  BIN FIXED (15) INIT (1),                              00001300
       2 BLANK_L  BIN FIXED (15) INIT (1),                              00001310
       2 LIND     BIN FIXED (15) INIT (1),                              00001320
       2 PL       BIN FIXED (15) INIT (1),                              00001330
       2 PP       BIN FIXED (15) INIT (0),                              00001340
       2 DR       BIN FIXED (15) INIT (0),                              00001350
       2 PRI_L    BIN FIXED (15) INIT (0),                              00001360
       2 PC_11     CHAR (11),                                           00001370
       2 FS_SIDE  PIC '9',                                              00001380
       2 S_SIDE   PIC '99',                                             00001390
       2 NY_FNR     BIN FIXED (15) INIT (0);                            00001400
                                                                        00001410
 /*   1 TKNR_REC                 BASED(TKNR_PEKER),   */                00001420
 DCL  1 TKNR_REC,                                                       00001430
        2 TKNR                   PIC '(4)9',                            00001440
        2 NAVN                   CHAR (25),                             00001450
        2 ADRESSE1               CHAR (35),                             00001460
        2 ADRESSE2               CHAR (30),                             00001470
        2 SORT_KRIT              CHAR (1),                              00001480
        2 SPRÅKKODE              CHAR (1),                              00001490
        2 DATA_SENTRAL           CHAR (3),                              00001500
        2 EDB_SYSTEM             CHAR (1),                              00001510
        2 REST_YSTEM             CHAR (1);                              00001520
                                                                        00001530
 DCL  KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00001540
      KEY_PEKER                  POINTER,                               00001550
      TKNR_PEKER                 POINTER;                               00001560
                                                                        00001570
 DCL  1 STAT_REC,                                                       00001580
        2 STAT_NR                PIC '(3)9',                            00001590
        2 FILLER                 CHAR (02),                             00001600
        2 STAT_NAVN              CHAR (30);                             00001610
                                                                        00001620
 /* ************************************************* */                00001630
 /*  WORKING AREA FOR STORING THE INFORMATION FOR     */                00001640
 /*  SCREEN AND PRINTER                               */                00001650
 /*  - AREAR IS ALSO IN PROGRAMMEN NO. R0010420       */                00001660
 /* ************************************************* */                00001670
  DCL 1 LOKAL_OMR BASED (TRANS_LISTE_PEKER),                            00001680
       2 ACC_SIDE         PIC  '99',                                    00001690
       2 MAP_SIDE         PIC  '99',                                    00001700
       2 NY_KODE          PIC '9',                                      00001710
       2 W01_SUM_KODE     CHAR (1),                                     00001720
                                                                        00001730
       2 ACC_PAGE    (04),                                              00001740
         5 ACC_LINJE (20)  CHAR(80);                                    00001750
                                                                        00001760
 DCL    1 AXX_LINE,                                                     00001770
          5 T_END       CHAR(3),                                        00001780
          5 T_XX        CHAR(77),                                       00001790
          AYY_LINE DEF AXX_LINE  CHAR(80);                              00001800
                                                                        00001810
 DCL    P_LINJE            CHAR (78);                                   00001820
 DCL    PRI_LINJE       CHAR(78);                                       00001830
                                                                        00001840
 DCL   1 UTLINJE          CHAR(78);                                     00001850
 DCL   ANT_GANGER         PIC '99' ;                                    00001860
 DCL   BLK_LINJE          CHAR(78)  INIT ('');                          00001870
                                                                        00001880
 DCL   1 WMNDÅR_DEF,                                                    00001890
         2 WMND            PIC '99',                                    00001900
         2 WÅR             PIC '99';                                    00001910
 DCL   1 WMNDÅR DEF WMNDÅR_DEF  PIC '9999';                             00001920
                                                                        00001930
 DCL   1 WÅRMND_DEF,                                                    00001940
         2 WÅR             PIC '99',                                    00001950
         2 WMND            PIC '99';                                    00001960
 DCL   1 WÅRMND DEF WÅRMND_DEF  PIC '9999';                             00001970
                                                                        00001980
                                                                        00001990
 DCL   1 DATO_DEF,                                                      00002000
         2 DAG             PIC '99',                                    00002010
         2 FILLER1         CHAR (1) INIT ('.'),                         00002020
         2 MND             PIC '99',                                    00002030
         2 FILLER          CHAR (1) INIT ('.'),                         00002040
         2 ÅR              PIC '99';                                    00002050
 DCL   1 DATO DEF DATO_DEF        CHAR (8);                             00002060
                                                                        00002070
 DCL   1 DATO_M           PIC '(6)9';                                   00002080
 DCL   1 DATO_M_DEF DEF  DATO_M,                                        00002090
         2 ÅR_M            PIC '99',                                    00002100
         2 MND_M           PIC '99',                                    00002110
         2 DAG_M           PIC '99';                                    00002120
                                                                        00002130
 DCL   1 DF_PRINT_LINE,                                                 00002140
         5 DF_PCC            CHAR (1) INIT (' '),                       00002150
         5 DF_FIL1           CHAR (1) INIT (' '),                       00002160
         5 DF_CC             CHAR (1) INIT (' '),                       00002170
         5 DF_FIL            CHAR (6) INIT ('      '),                  00002180
         5 DF_TEKST          CHAR (72),                                 00002190
         DF_COMD  DEF  DF_PRINT_LINE  CHAR(81);                         00002200
                                                                        00002210
 DCL   1 DF_KEY,                                                        00002220
         3 DF_FNR            PIC '(11)9',                               00002230
         3 DF_SIDENR         PIC '99',                                  00002240
         3 DF_LINE           PIC '999';                                 00002250
                                                                        00002260
                                                                        00002270
 /* ************************************************* */                00002280
 /*  LINES USED ON SCREEN                             */                00002290
 /*         AND PRINTER                               */                00002300
 /*                                                   */                00002310
 /* ************************************************* */                00002320
 DCL    1 L01_FNR_DEF ,                                                 00002330
          5 TEKST1         CHAR(38) INIT ('FØDSELSNUMMER'),             00002340
          5 FILLER1        CHAR(3 ) INIT (':  '),                       00002350
          5 W01_FNR        PIC '999999B999B99',                         00002360
          5 FILLER2        CHAR(26) INIT ( (26) ' '),                   00002370
          L01_FNR    DEF    L01_FNR_DEF  CHAR(80);                      00002380
                                                                        00002390
 DCL    1 L01_NAVN_DEF,                                                 00002400
          5 TEKST2        CHAR(38) INIT ('NAVN'),                       00002410
          5 FILLER1       CHAR(3 ) INIT (':  '),                        00002420
          5 W01_NAVN      CHAR(25),                                     00002430
          5 FILLER2       CHAR(14) INIT ( (14) ' '),                    00002440
          L01_NAVN    DEF    L01_NAVN_DEF  CHAR(80);                    00002450
                                                                        00002460
 DCL    1 L01_TKNR_DEF,                                                 00002470
          5 TEKST3        CHAR(38) INIT ('TRYGDEKONTORNUMMER'),         00002480
          5 FILLER1       CHAR(3 ) INIT (':  '),                        00002490
          5 W01_TKNR      PIC '9999',                                   00002500
          5 FILLER2       CHAR(5) INIT ( (5) ' '),                      00002510
          5 W01_TKNAVN    CHAR(25),                                     00002520
          5 FILLER3       CHAR(05) INIT ( (05) ' '),                    00002530
          L01_TKNR    DEF    L01_TKNR_DEF  CHAR(80);                    00002540
                                                                        00002550
 DCL    1 L01_STATSBORGER_DEF,                                          00002560
          5 TEKST86      CHAR(38) INIT ('STATSBORGERSKAPSKODE'),        00002570
          5 FILLER1      CHAR(04) INIT (':   '),                        00002580
          5 W01_STAT     PIC '(3)9',                                    00002590
          5 FILLER2      CHAR(05) INIT ( (05) ' '),                     00002600
          5 W01_LANDNAVN CHAR(30) INIT ( (30) ' '),                     00002610
          L01_STATSBORGER DEF L01_STATSBORGER_DEF CHAR(80);             00002620
                                                                        00002630
                                                                        00002640
 DCL    1 L01_SPRÅK_DEF,                                                00002650
          5 TEKST4        CHAR(38) INIT ('SPRÅKFORM'),                  00002660
          5 FILLER1       CHAR(3 ) INIT (':  '),                        00002670
          5 W01_SPRÅK     CHAR(11),                                     00002680
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                   00002690
          L01_SPRÅK   DEF    L01_SPRÅK_DEF  CHAR(80);                   00002700
                                                                        00002710
  /* DCL    1 L01_AI_DEF ,                                              00002720
          5 TEKST5        CHAR(38) INIT ('ANTATT INNTEKT I 1967'),      00002730
          5 FILLER1       CHAR(06) INIT (':     '),                     00002740
          5 W01_AI        PIC 'ZZZZ.ZZ9',                               00002750
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                   00002760
          L01_AI      DEF    L01_AI_DEF  CHAR(80); */                   00002770
                                                                        00002780
                                                                        00002790
 /* DCL 1 L01_INNTÅR_DEF,                                               00002800
          5 TEKST6        CHAR(38) INIT ('INNTEKTSÅR'),                 00002810
          5 FILLER1       CHAR(12) INIT (':           '),               00002820
          5 W01_INNT_ÅR   PIC '(2)9',                                   00002830
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                   00002840
          L01_INNTÅR  DEF    L01_INNTÅR_DEF  CHAR(80);  */              00002850
                                                                        00002860
 DCL    1 L01_INNT_DEF,                                                 00002870
          5 TEKST7        CHAR(28) INIT ('PENSJONSGIVENDE INNTEKT'),    00002880
          5 TEKST7_19     CHAR(2)  INIT ('19'),                         00002890
          5 TEKST7_ÅR     PIC '99',                                     00002900
          5 FILLER        CHAR(6 ) INIT ('      '),                     00002910
          5 FILLER1       CHAR(6 ) INIT (':     '),                     00002920
          5 W01_INNT      PIC 'ZZZZ.Z99',                               00002930
          5 FILLER2        CHAR(07) INIT ( (07) ' '),                   00002940
          5 FILLER_TEKST7  CHAR(10),                                    00002950
          5 W01_P_POENG    PIC '9V,99',                                 00002960
          5 FILLER4        CHAR(07) INIT ( (07) ' '),                   00002970
          L01_INNT  DEF    L01_INNT_DEF  CHAR(80);                      00002980
                                                                        00002990
 DCL    1 L01_VERNEPL_DEF,                                              00003000
          5 TEKST9        CHAR(38) INIT ('VERNEPLIKTÅR'),               00003010
          5 FILLER1       CHAR(12) INIT (':              '),            00003020
          5 W01_VERNEP    PIC 'Z9',                                     00003030
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                   00003040
          L01_VERNEPL  DEF L01_VERNEPL_DEF  CHAR(80);                   00003050
                                                                        00003060
 DCL    1 L01_AI63_DEF,                                                 00003070
          5 TEKST10       CHAR(38) INIT ('ANTATT INNTEKT 1963'),        00003080
          5 FILLER1       CHAR(6 ) INIT (':     '),                     00003090
          5 W01_AI63      PIC 'ZZZZ.ZZ9',                               00003100
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                   00003110
          L01_AI63   DEF   L01_AI63_DEF  CHAR(80);                      00003120
                                                                        00003130
 DCL    1 L01_AI64_DEF,                                                 00003140
          5 TEKST11       CHAR(38) INIT ('ANTATT INNTEKT 1964'),        00003150
          5 FILLER1       CHAR(6 ) INIT (':     '),                     00003160
          5 W01_AI64      PIC 'ZZZZ.ZZ9',                               00003170
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                   00003180
          L01_AI64   DEF   L01_AI64_DEF  CHAR(80);                      00003190
                                                                        00003200
 DCL    1 L01_AI65_DEF,                                                 00003210
          5 TEKST12      CHAR(38) INIT ('ANTATT INNTEKT 1965'),         00003220
          5 FILLER1       CHAR(6 ) INIT (':     '),                     00003230
          5 W01_AI65      PIC 'ZZZZ.ZZ9',                               00003240
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                   00003250
          L01_AI65   DEF   L01_AI65_DEF  CHAR(80);                      00003260
                                                                        00003270
 DCL    1 L01_AI66_DEF,                                                 00003280
          5 TEKST13      CHAR(38) INIT ('ANTATT INNTEKT 1966'),         00003290
          5 FILLER1       CHAR(6 ) INIT (':     '),                     00003300
          5 W01_AI66     PIC 'ZZZZ.ZZ9',                                00003310
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                   00003320
          L01_AI66   DEF   L01_AI66_DEF  CHAR(80);                      00003330
                                                                        00003340
 DCL    1 L01_AI67_DEF,                                                 00003350
          5 TEKST13      CHAR(38) INIT ('ANTATT INNTEKT 1967'),         00003360
          5 FILLER1       CHAR(6 ) INIT (':     '),                     00003370
          5 W01_AI67     PIC 'ZZZZ.ZZ9',                                00003380
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                   00003390
          L01_AI67   DEF   L01_AI67_DEF  CHAR(80);                      00003400
                                                                        00003410
 DCL    1 L01_PI66_DEF,                                                 00003420
          5 TEKST14      CHAR(38) INIT ('ARBEIDSINNTEKT 1966'),         00003430
          5 FILLER1       CHAR(6 ) INIT (':     '),                     00003440
          5 W01_PI66     PIC 'ZZZZ.ZZ9',                                00003450
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                   00003460
          L01_PI66   DEF   L01_PI66_DEF  CHAR(80);                      00003470
                                                                        00003480
 DCL    1 L01_VIRK_DEF,                                                 00003490
          5 TEKST15      CHAR(38) INIT                                  00003500
                       ('SISTE ENDRINGSDATO, MÅNED/ÅR'),                00003510
          5 FILLER1      CHAR(08) INIT (':       '),                    00003520
          5 W01_VIRK     PIC '99BB99',                                  00003530
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                   00003540
          L01_VIRK   DEF   L01_VIRK_DEF  CHAR(80);                      00003550
                                                                        00003560
 DCL    1 L01_SIVIL_DEF,                                                00003570
          5 TEKST16      CHAR(38) INIT ('SIVILSTAND'),                  00003580
          5 FILLER1      CHAR(3 ) INIT (':  '),                         00003590
          5 W01_SIVIL    CHAR(18),                                      00003600
          5 FILLER2        CHAR(21) INIT ( (21) ' '),                   00003610
          L01_SIVIL  DEF      L01_SIVIL_DEF  CHAR(80);                  00003620
                                                                        00003630
 DCL    1 L01_TT_DEF  ,                                                 00003640
          5 TEKST17      CHAR(38) INIT                                  00003650
                       ('ANVENDT TRYGDETID (I HELE ÅR) '),              00003660
          5 FILLER1      CHAR(10) INIT (':         '),                  00003670
          5 W01_TT       PIC 'ZZZ9',                                    00003680
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                   00003690
          L01_TT  DEF      L01_TT_DEF  CHAR(80);                        00003700
                                                                        00003710
 DCL    1 L01_SUM_DEF ,                                                 00003720
          5 TEKST18      CHAR(38) INIT ('SUM YTELSE (KR. PR. MD.)'),    00003730
          5 FILLER1      CHAR(06) INIT (':     '),                      00003740
          5 W01_SUM      PIC 'ZZZZ.ZZ9',                                00003750
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                   00003760
          L01_SUM    DEF      L01_SUM_DEF  CHAR(80);                    00003770
                                                                        00003780
 DCL    1 L01_BT_ANT_DEF,                                               00003790
          5 TEKST19      CHAR(38) INIT ('ANTALL BARNETILLEGG'),         00003800
          5 FILLER1      CHAR(11 ) INIT (':          '),                00003810
          5 W01_BT_ANT   PIC 'ZZ9',                                     00003820
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00003830
          L01_BT_ANT DEF   L01_BT_ANT_DEF  CHAR(80);                    00003840
                                                                        00003850
 DCL    1 L01_DØD_DEF,                                                  00003860
          5 TEKST20      CHAR(38) INIT ('DØDSDATO, ÅR/MÅNED/DAG'),      00003870
          5 FILLER1      CHAR(6 ) INIT (':     '),                      00003880
          5 W01_DØD      PIC '99B99B99',                                00003890
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                   00003900
          L01_DØD    DEF   L01_DØD_DEF  CHAR(80);                       00003910
                                                                        00003920
 DCL    1 L01_8_4_3_DEF,                                                00003930
          5 TEKST21      CHAR(38) INIT ('VILKÅR PARAGRAF 8-4 NR.3 A'),  00003940
          5 FILLER1      CHAR(13) INIT (':            '),               00003950
          5 W01_8_4_3    CHAR(1),                                       00003960
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00003970
          L01_8_4_3  DEF   L01_8_4_3_DEF  CHAR(80);                     00003980
                                                                        00003990
 DCL    1 L01_G_DATO_DEF,                                               00004000
          5 TEKST22      CHAR(38) INIT ('GRUNNBELØPSDATO, MÅNED/ÅR'),   00004010
          5 FILLER1      CHAR(8 ) INIT (':       '),                    00004020
          5 W01_G_DATO   PIC '99BB99',                                  00004030
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00004040
          L01_G_DATO DEF   L01_G_DATO_DEF  CHAR(80);                    00004050
                                                                        00004060
 DCL    1 L01_P_DATO_DEF,                                               00004070
          5 TEKST23      CHAR(38) INIT                                  00004080
                                  ('POENGTILLEGGSDATO, MÅNED/ÅR'),      00004090
          5 FILLER1      CHAR(8 ) INIT (':       '),                    00004100
          5 W01_P_DATO   PIC '99BB99',                                  00004110
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00004120
          L01_P_DATO DEF   L01_P_DATO_DEF  CHAR(80);                    00004130
                                                                        00004140
 DCL    1 L01_TILKN_DEF,                                                00004150
          5 TEKST24      CHAR(38) INIT ('EKTEFELLES FØDSELSDATO + NR'), 00004160
          5 FILLER1      CHAR(8 ) INIT (':       '),                    00004170
          5 W01_TILKN    PIC '(6)9B99999',                              00004180
          5 FILLER2      CHAR(22) INIT ( (22) ' '),                     00004190
          L01_TILKN  DEF   L01_TILKN_DEF  CHAR(80);                     00004200
                                                                        00004210
 DCL    1 L01_BARN_DEF,                                                 00004220
          5 TEKST24      CHAR(38) INIT ('BARNS FØDSELSDATO + NR'),      00004230
          5 FILLER1      CHAR(8 ) INIT (':       '),                    00004240
          5 W01_BARN    PIC '(6)9B99999',                               00004250
          5 FILLER2      CHAR(22) INIT ( (22) ' '),                     00004260
          L01_BARN   DEF   L01_BARN_DEF  CHAR(80);                      00004270
                                                                        00004280
 DCL    1 L01_APGP_DEF,                                                 00004290
          5 TEKST25      CHAR(38) INIT ('GRUNNPENSJON'),                00004300
          5 FILLER1      CHAR(06) INIT (':     '),                      00004310
          5 W01_APGP     PIC 'ZZZZ.ZZ9',                                00004320
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00004330
          L01_APGP   DEF   L01_APGP_DEF  CHAR(80);                      00004340
                                                                        00004350
 DCL    1 L01_APST_DEF,                                                 00004360
          5 TEKST26      CHAR(38) INIT ('SÆRTILLEGG'),                  00004370
          5 FILLER1      CHAR(06) INIT (':     '),                      00004380
          5 W01_APST     PIC 'ZZZZ.ZZ9',                                00004390
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00004400
          L01_APST   DEF   L01_APST_DEF  CHAR(80);                      00004410
                                                                        00004420
 DCL    1 L01_APBT_DEF,                                                 00004430
          5 TEKST27      CHAR(38) INIT ('BARNETILLEGG'),                00004440
          5 FILLER1      CHAR(06) INIT (':     '),                      00004450
          5 W01_APBT     PIC 'ZZZZ.ZZ9',                                00004460
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00004470
          L01_APBT   DEF   L01_APBT_DEF  CHAR(80);                      00004480
                                                                        00004490
 DCL    1 L01_APKT_DEF,                                                 00004500
          5 TEKST28      CHAR(38) INIT ('KOMPENSASJONSTILLEGG'),        00004510
          5 FILLER1      CHAR(06) INIT (':     '),                      00004520
          5 W01_APKT     PIC 'ZZZZ.ZZ9',                                00004530
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00004540
          L01_APKT   DEF   L01_APKT_DEF  CHAR(80);                      00004550
                                                                        00004560
 DCL    1 L01_APET_DEF,                                                 00004570
          5 TEKST29      CHAR(38) INIT ('EKTEFELLETILLEGG'),            00004580
          5 FILLER1      CHAR(06) INIT (':     '),                      00004590
          5 W01_APET     PIC 'ZZZZ.ZZ9',                                00004600
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00004610
          L01_APET   DEF   L01_APET_DEF  CHAR(80);                      00004620
                                                                        00004630
 DCL    1 L01_APTP_DEF,                                                 00004640
          5 TEKST30      CHAR(38) INIT ('TILLEGGSPENSJON'),             00004650
          5 FILLER1      CHAR(06) INIT (': '),                          00004660
          5 W01_APTP     PIC 'ZZZZ.ZZ9',                                00004670
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00004680
          L01_APTP   DEF   L01_APTP_DEF  CHAR(80);                      00004690
                                                                        00004700
 DCL    1 L01_APSPT_DEF,                                                00004710
          5 TEKST31      CHAR(38) INIT ('SLUTTPOENGTALL'),              00004720
          5 FILLER1      CHAR(10) INIT (':         '),                  00004730
          5 W01_APSPT    PIC '9V,99',                                   00004740
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00004750
          L01_APSPT  DEF   L01_APSPT_DEF CHAR(80);                      00004760
                                                                        00004770
 DCL    1 L01_APOPT_DEF,                                                00004780
          5 TEKST32      CHAR(38) INIT                                  00004790
                         ('SLUTTPOENGTALL M/OVERKOMPENSASJON'),         00004800
          5 FILLER1      CHAR(10) INIT (':         '),                  00004810
          5 W01_APOPT    PIC '9V,99',                                   00004820
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00004830
          L01_APOPT DEF  L01_APOPT_DEF CHAR(80);                        00004840
                                                                        00004850
 DCL    1 L01_APPÅ_DEF,                                                 00004860
          5 TEKST33      CHAR(38) INIT ('ANTALL POENGÅR'),              00004870
          5 FILLER1      CHAR(11) INIT (':          '),                 00004880
          5 W01_APPÅ     PIC 'ZZ9',                                     00004890
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00004900
          L01_APPÅ DEF   L01_APPÅ_DEF CHAR(80);                         00004910
                                                                        00004920
 DCL    1 L01_APAPD_DEF,                                                00004930
          5 TEKST34      CHAR(38) INIT ('ALDERSPENSJONSGRAD'),          00004940
          5 FILLER1      CHAR(11) INIT (':          '),                 00004950
          5 W01_APAPD    PIC 'ZZ9',                                     00004960
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00004970
          L01_APAPD DEF  L01_APAPD_DEF CHAR(80);                        00004980
                                                                        00004990
 DCL    1 L01_APFAI_DEF,                                                00005000
          5 TEKST35      CHAR(38) INIT ('FRAMTIDIG ARBEIDSINNTEKT'),    00005010
          5 FILLER1      CHAR(06) INIT (':     '),                      00005020
          5 W01_APFAI    PIC 'ZZZZ.ZZ9',                                00005030
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00005040
          L01_APFAI DEF  L01_APFAI_DEF CHAR(80);                        00005050
                                                                        00005060
 DCL    1 L01_APFAI_DATO_DEF,                                           00005070
          5 TEKST36      CHAR(38) INIT                                  00005080
                         ('FRAMTIDIG ARBEIDSINNTEKT FRA DATO'),         00005090
          5 FILLER1      CHAR(10) INIT (':         '),                  00005100
          5 W01_APFAI_DATO  PIC 'ZZZ9',                                 00005110
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00005120
          L01_APFAI_DATO DEF L01_APFAI_DATO_DEF CHAR(80);               00005130
                                                                        00005140
 DCL    1 L01_APKONV_GRAD_DEF,                                          00005150
          5 TEKST37      CHAR(38) INIT ('KONVERTERINGSGRAD'),           00005160
          5 FILLER1      CHAR(11) INIT (':          '),                 00005170
          5 W01_APKONV_GRAD PIC 'ZZ9',                                  00005180
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00005190
          L01_APKONV_GRAD DEF L01_APKONV_GRAD_DEF CHAR(80);             00005200
                                                                        00005210
 DCL    1 L01_APTTVENT_DEF,                                             00005220
          5 TEKST38      CHAR(38) INIT                                  00005230
                         ('TRYGDETID VED 67 ÅRS DATO'),                 00005240
          5 FILLER1      CHAR(11) INIT (':          '),                 00005250
          5 W01_APTTVENT PIC 'ZZ9',                                     00005260
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00005270
          L01_APTTVENT DEF L01_APTTVENT_DEF CHAR(80);                   00005280
                                                                        00005290
 DCL    1 L01_APVENTEFAKTOR_DEF,                                        00005300
          5 TEKST39      CHAR(38) INIT                                  00005310
                         ('VENTEPROSENT/ALDERSPENSJON'),                00005320
          5 FILLER1      CHAR(08) INIT (':       '),                    00005330
          5 W01_APVENTEFAKTOR PIC 'ZZZV,99',                            00005340
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00005350
          L01_APVENTEFAKTOR DEF L01_APVENTEFAKTOR_DEF CHAR(80);         00005360
                                                                        00005370
 DCL    1 L01_APVT_SPT_DEF,                                             00005380
          5 TEKST40      CHAR(38) INIT                                  00005390
                         ('VENTETIDSSLUTTPOENGTALL'),                   00005400
          5 FILLER1      CHAR(10) INIT (':         '),                  00005410
          5 W01_APVT_SPT PIC '9V,99',                                   00005420
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00005430
          L01_APVT_SPT DEF L01_APVT_SPT_DEF CHAR(80);                   00005440
                                                                        00005450
 DCL    1 L01_APVT_OPT_DEF,                                             00005460
          5 TEKST41      CHAR(38) INIT                                  00005470
                         ('VENTETIDSSLUTTPOENGTALL M/OVERKOMP.'),       00005480
          5 FILLER1      CHAR(10) INIT (':         '),                  00005490
          5 W01_APVT_OPT PIC '9V,99',                                   00005500
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00005510
          L01_APVT_OPT DEF L01_APVT_OPT_DEF CHAR(80);                   00005520
                                                                        00005530
 DCL    1 L01_APVT_PÅ_DEF,                                              00005540
          5 TEKST42      CHAR(38) INIT ('VENTETIDSPOENGÅR'),            00005550
          5 FILLER1      CHAR(11) INIT (':          '),                 00005560
          5 W01_APVT_PÅ  PIC 'ZZ9',                                     00005570
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00005580
          L01_APVT_PÅ DEF L01_APVT_PÅ_DEF CHAR(80);                     00005590
                                                                        00005600
 DCL    1 L01_APGP_P67_DEF,                                             00005610
          5 TEKST43      CHAR(38) INIT                                  00005620
                         ('GRUNNPENSJON VED 67 ÅRS DATO'),              00005630
          5 FILLER1      CHAR(06) INIT (':     '),                      00005640
          5 W01_AP_GP_P67   PIC 'ZZZZ.ZZ9',                             00005650
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00005660
          L01_APGP_P67 DEF L01_APGP_P67_DEF CHAR(80);                   00005670
                                                                        00005680
 DCL    1 L01_APTP_P67_DEF,                                             00005690
          5 TEKST44      CHAR(38) INIT                                  00005700
                         ('TILLEGGSPENSJON VED 67 ÅRS DATO'),           00005710
          5 FILLER1      CHAR(06) INIT (':     '),                      00005720
          5 W01_AP_TP_P67  PIC 'ZZZZ.ZZ9',                              00005730
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00005740
          L01_APTP_P67 DEF L01_APTP_P67_DEF CHAR(80);                   00005750
                                                                        00005760
 DCL    1 L01_APVT_GP_DEF,                                              00005770
          5 TEKST45      CHAR(38) INIT                                  00005780
                         ('VENTETILLEGG TIL GRUNNPENSJONEN'),           00005790
          5 FILLER1      CHAR(06) INIT (':     '),                      00005800
          5 W01_AP_VT_GP  PIC 'ZZZZ.ZZ9',                               00005810
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00005820
          L01_APVT_GP DEF L01_APVT_GP_DEF CHAR(80);                     00005830
                                                                        00005840
 DCL    1 L01_APVT_TP_DEF,                                              00005850
          5 TEKST46      CHAR(38) INIT                                  00005860
                         ('VENTETILLEGG TIL TILLEGGSPENSJON'),          00005870
          5 FILLER1      CHAR(06) INIT (':     '),                      00005880
          5 W01_AP_VT_TP  PIC 'ZZZZ.ZZ9',                               00005890
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00005900
          L01_APVT_TP DEF L01_APVT_TP_DEF CHAR(80);                     00005910
                                                                        00005920
 DCL    1 L01_UP_UFG_DEF,                                               00005930
          5 TEKST47      CHAR(38) INIT ('UFØREGRAD'),                   00005940
          5 FILLER1      CHAR(11) INIT (':          '),                 00005950
          5 W01_UP_UFG   PIC 'Z99',                                     00005960
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00005970
          L01_UP_UFG DEF L01_UP_UFG_DEF CHAR(80);                       00005980
                                                                        00005990
 DCL    1 L01_UP_8_4_3A_DEF,                                            00006000
          5 TEKST48      CHAR(38) INIT                                  00006010
                        ('VILKÅR PARAGRAF 8-4 NR. 3 A OPPFYLT'),        00006020
          5 FILLER1      CHAR(10) INIT (':         '),                  00006030
          5 W01_UP_8_4_3A  CHAR (4),                                    00006040
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00006050
          L01_UP_8_4_3A DEF L01_UP_8_4_3A_DEF CHAR(80);                 00006060
                                                                        00006070
 DCL    1 L01_UP_GP_DEF,                                                00006080
          5 TEKST49      CHAR(38) INIT ('GRUNNPENSJON'),                00006090
          5 FILLER1      CHAR(06) INIT (':     '),                      00006100
          5 W01_UP_GP    PIC 'ZZZZ.ZZ9',                                00006110
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00006120
          L01_UP_GP DEF  L01_UP_GP_DEF CHAR(80);                        00006130
                                                                        00006140
 DCL    1 L01_UP_ST_DEF,                                                00006150
          5 TEKST50      CHAR(38) INIT ('SÆRTILLEGG'),                  00006160
          5 FILLER1      CHAR(06) INIT (':     '),                      00006170
          5 W01_UP_ST    PIC 'ZZZZ.ZZ9',                                00006180
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00006190
          L01_UP_ST DEF  L01_UP_ST_DEF CHAR(80);                        00006200
                                                                        00006210
 DCL    1 L01_UP_ÅFT_DEF,                                               00006220
          5 TEKST51      CHAR(38) INIT                                  00006230
                                ('TILLEGG ETTER PARAGRAF 8-5 NR 1'),    00006240
          5 FILLER1      CHAR(06) INIT (':     '),                      00006250
          5 W01_UP_ÅFT   PIC 'ZZZZ.ZZ9',                                00006260
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00006270
          L01_UP_ÅFT DEF L01_UP_ÅFT_DEF CHAR(80);                       00006280
                                                                        00006290
 DCL    1 L01_UP_ET_DEF,                                                00006300
          5 TEKST52      CHAR(38) INIT ('EKTEFELLETILLEGG'),            00006310
          5 FILLER1      CHAR(06) INIT (':     '),                      00006320
          5 W01_UP_ET    PIC 'ZZZZ.ZZ9',                                00006330
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00006340
          L01_UP_ET DEF  L01_UP_ET_DEF CHAR(80);                        00006350
                                                                        00006360
 DCL    1 L01_UP_BT_DEF,                                                00006370
          5 TEKST53      CHAR(38) INIT ('BARNETILLEGG'),                00006380
          5 FILLER1      CHAR(06) INIT (':     '),                      00006390
          5 W01_UP_BT    PIC 'ZZZZ.ZZ9',                                00006400
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00006410
          L01_UP_BT DEF  L01_UP_BT_DEF CHAR(80);                        00006420
                                                                        00006430
 DCL    1 L01_UP_KT_DEF,                                                00006440
          5 TEKST54      CHAR(38) INIT ('KOMPENSASJONSTILLEGG'),        00006450
          5 FILLER1      CHAR(06) INIT (':     '),                      00006460
          5 W01_UP_KT    PIC 'ZZZZ.ZZ9',                                00006470
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00006480
          L01_UP_KT DEF  L01_UP_KT_DEF CHAR(80);                        00006490
                                                                        00006500
 DCL    1 L01_UP_TP_DEF,                                                00006510
          5 TEKST55      CHAR(38) INIT ('TILLEGGSPENSJON'),             00006520
          5 FILLER1      CHAR(06) INIT (':     '),                      00006530
          5 W01_UP_TP    PIC 'ZZZZ.ZZ9',                                00006540
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00006550
          L01_UP_TP DEF  L01_UP_TP_DEF CHAR(80);                        00006560
                                                                        00006570
 DCL    1 L01_UP_SPT_DEF,                                               00006580
          5 TEKST56      CHAR(38) INIT ('SLUTTPOENGTALL'),              00006590
          5 FILLER1      CHAR(09) INIT (':        '),                   00006600
          5 W01_UP_SPT   PIC 'Z9V,99',                                  00006610
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00006620
          L01_UP_SPT DEF L01_UP_SPT_DEF CHAR(80);                       00006630
                                                                        00006640
 DCL    1 L01_UP_OPT_DEF,                                               00006650
          5 TEKST57      CHAR(38) INIT                                  00006660
                                ('SLUTTPOENGTALL M/OVERKOMP'),          00006670
          5 FILLER1      CHAR(09) INIT (':  '),                         00006680
          5 W01_UP_OPT   PIC 'Z9V,99',                                  00006690
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00006700
          L01_UP_OPT DEF L01_UP_OPT_DEF CHAR(80);                       00006710
                                                                        00006720
 DCL    1 L01_UP_PÅ_DEF,                                                00006730
          5 TEKST58      CHAR(38) INIT ('ANTALL POENGÅR'),              00006740
          5 FILLER1      CHAR(11) INIT (':          '),                 00006750
          5 W01_UP_PÅ    PIC 'ZZ9',                                     00006760
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00006770
          L01_UP_PÅ DEF  L01_UP_PÅ_DEF CHAR(80);                        00006780
                                                                        00006790
 DCL    1 L01_UFØRHIST_UFT_ÅM_DEF,                                      00006800
          5 TEKST59      CHAR(38) INIT ('UFØRETIDSPUNKT, MÅNED/ÅR'),    00006810
          5 FILLER1      CHAR(08) INIT (':       '),                    00006820
          5 W01_UFØRHIST_UFT_ÅM   PIC '99BB99',                         00006830
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00006840
          L01_UFØRHIST_UFT_ÅM DEF L01_UFØRHIST_UFT_ÅM_DEF CHAR(80);     00006850
                                                                        00006860
 DCL    1 L01_UFØRHIST_UFG_DEF,                                         00006870
          5 TEKST60      CHAR(38) INIT ('UFØREGRAD'),                   00006880
          5 FILLER1      CHAR(11) INIT (':          '),                 00006890
          5 W01_UFØRHIST_UFG  PIC '(3)9',                               00006900
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00006910
          L01_UFØRHIST_UFG DEF L01_UFØRHIST_UFG_DEF CHAR(80);           00006920
                                                                        00006930
 DCL    1 L01_UFØRHIST_UFKRTERIER_DEF,                                  00006940
          5 TEKST60   CHAR(38)                                          00006950
                    INIT ('FYLLER KRITERIER FOR TILLEGGSPENSJON'),      00006960
          5 FILLER1      CHAR(11) INIT (':          '),                 00006970
          5 W01_UFØRHIST_UFKRITE CHAR(3),                               00006980
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00006990
      L01_UFØRHIST_UFKRTERIER DEF L01_UFØRHIST_UFKRTERIER_DEF CHAR(80); 00007000
                                                                        00007010
 DCL    1 L01_UFØRHIST_BUP_DEF,                                         00007020
          5 TEKST61      CHAR(38) INIT ('FRAMTIDIG PENSJONSPOENG'),     00007030
          5 FILLER1      CHAR(09) INIT (':        '),                   00007040
          5 W01_UFØRHIST_BUP  PIC 'Z9V,99',                             00007050
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00007060
          L01_UFØRHIST_BUP DEF L01_UFØRHIST_BUP_DEF CHAR(80);           00007070
                                                                        00007080
 DCL    1 L01_UFØRHIST_OPPH_ÅM_DEF,                                     00007090
          5 TEKST62      CHAR(38) INIT                                  00007100
              ('OPPHØRSDATO/UFØREPENSJON, MÅNED/ÅR'),                   00007110
          5 FILLER1      CHAR(08) INIT (':       '),                    00007120
          5 W01_UFØRHIST_OPPH_ÅM  PIC '99BB99',                         00007130
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00007140
          L01_UFØRHIST_OPPH_ÅM DEF L01_UFØRHIST_OPPH_ÅM_DEF CHAR(80);   00007150
                                                                        00007160
 DCL    1 L01_ET_GP_BRUTTO_DEF,                                         00007170
          5 TEKST65      CHAR(38) INIT ('BRUTTO GRUNNPENSJON'),         00007180
          5 FILLER1      CHAR(06) INIT (':     '),                      00007190
          5 W01_ET_GP_BRUTTO     PIC 'ZZZZ.ZZ9',                        00007200
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00007210
          L01_ET_GP_BRUTTO DEF L01_ET_GP_BRUTTO_DEF CHAR(80);           00007220
                                                                        00007230
 DCL    1 L01_ET_GP_NETTO_DEF,                                          00007240
          5 TEKST66      CHAR(38) INIT ('NETTO GRUNNPENSJON'),          00007250
          5 FILLER1      CHAR(06) INIT (':     '),                      00007260
          5 W01_ET_GP_NETTO   PIC 'ZZZZ.ZZ9',                           00007270
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00007280
          L01_ET_GP_NETTO DEF L01_ET_GP_NETTO_DEF CHAR(80);             00007290
                                                                        00007300
 DCL    1 L01_ET_ST_DEF,                                                00007310
          5 TEKST67      CHAR(38) INIT ('SÆRTILLEGG'),                  00007320
          5 FILLER1      CHAR(06) INIT (':     '),                      00007330
          5 W01_ET_ST    PIC 'ZZZZ.ZZ9',                                00007340
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00007350
          L01_ET_ST DEF  L01_ET_ST_DEF CHAR(80);                        00007360
                                                                        00007370
 DCL    1 L01_ET_KT_DEF,                                                00007380
          5 TEKST68      CHAR(38) INIT ('KOMPENSASJONSTILLEGG'),        00007390
          5 FILLER1      CHAR(11) INIT (':          '),                 00007400
          5 W01_ET_KT    PIC '(3)9',                                    00007410
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00007420
          L01_ET_KT DEF  L01_ET_KT_DEF CHAR(80);                        00007430
                                                                        00007440
 DCL    1 L01_ET_TP_BRUTTO_DEF,                                         00007450
          5 TEKST69      CHAR(38) INIT ('BRUTTO TILLEGGSPENSJON'),      00007460
          5 FILLER1      CHAR(06) INIT (':     '),                      00007470
          5 W01_ET_TP_BRUTTO    PIC 'ZZZZ.ZZ9',                         00007480
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00007490
          L01_ET_TP_BRUTTO DEF L01_ET_TP_BRUTTO_DEF CHAR(80);           00007500
                                                                        00007510
 DCL    1 L01_ET_TP_NETTO_DEF,                                          00007520
          5 TEKST70      CHAR(38) INIT ('NETTO TILLEGGSPENSJON'),       00007530
          5 FILLER1      CHAR(06) INIT (':     '),                      00007540
          5 W01_ET_TP_NETTO    PIC 'ZZZZ.ZZ9',                          00007550
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00007560
          L01_ET_TP_NETTO DEF L01_ET_TP_NETTO_DEF CHAR(80);             00007570
                                                                        00007580
 DCL    1 L01_ET_SPT_AVD_DEF,                                           00007590
          5 TEKST71      CHAR(38) INIT ('AVDØDES SLUTTPOENGTALL'),      00007600
          5 FILLER1      CHAR(10) INIT (':         '),                  00007610
          5 W01_ET_SPT_AVD    PIC '9V,99',                              00007620
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00007630
          L01_ET_SPT_AVD DEF L01_ET_SPT_AVD_DEF CHAR(80);               00007640
                                                                        00007650
 DCL    1 L01_ET_OPT_AVD_DEF,                                           00007660
          5 TEKST72      CHAR(38) INIT                                  00007670
                         ('AVDØDES SLUTTPOENGTALL M/OVERKOMP.'),        00007680
          5 FILLER1      CHAR(10) INIT (':         '),                  00007690
          5 W01_ET_OPT_AVD    PIC '9V,99',                              00007700
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00007710
          L01_ET_OPT_AVD DEF L01_ET_OPT_AVD_DEF CHAR(80);               00007720
                                                                        00007730
 DCL    1 L01_ET_PÅ_AVD_DEF,                                            00007740
          5 TEKST73      CHAR(38) INIT ('AVDØDES ANTALL POENGÅR'),      00007750
          5 FILLER1      CHAR(10) INIT (':          '),                 00007760
          5 W01_PÅ_AVD   PIC '9V,99',                                   00007770
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00007780
          L01_ET_PÅ_AVD DEF L01_ET_PÅ_AVD_DEF CHAR(80);                 00007790
                                                                        00007800
 DCL    1 L01_ET_TP_PROSENT_DEF,                                        00007810
          5 TEKST74      CHAR(38) INIT                                  00007820
                        ('TILLEGGSPENSJONSPROSENT FOR FRASKILT'),       00007830
          5 FILLER1      CHAR(10) INIT (':          '),                 00007840
          5 W01_TP_PROSENT   PIC '9V,99',                               00007850
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00007860
          L01_ET_TP_PROSENT DEF L01_ET_TP_PROSENT_DEF CHAR(80);         00007870
                                                                        00007880
 DCL    1 L01_ET_FORVENTET_DEF,                                         00007890
          5 TEKST75      CHAR(38) INIT ('FORVENTET ERVERVSINNTEKT'),    00007900
          5 FILLER1      CHAR(06) INIT (':     '),                      00007910
          5 W01_FORVENTET   PIC 'ZZZZ.ZZ9',                             00007920
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00007930
          L01_ET_FORVENTET DEF L01_ET_FORVENTET_DEF CHAR(80);           00007940
                                                                        00007950
 DCL    1 L01_ET_FRAMLEGGSDATO_DEF,                                     00007960
          5 TEKST75      CHAR(38) INIT ('FRAMLEGG                '),    00007970
          5 FILLER1      CHAR(3 ) INIT (':  '),                         00007980
          5 W01_FRAMLEGGSDATO    CHAR (20),                             00007990
          5 FILLER2      CHAR(19) INIT ( (19) ' '),                     00008000
        L01_ET_FRAMLEGGSDATO DEF L01_ET_FRAMLEGGSDATO_DEF CHAR(80);     00008010
                                                                        00008020
 DCL    1 L01_ET_FRAMLEGG_DEF,                                          00008030
          5 TEKST75      CHAR(38) INIT ('FRAMLEGG                '),    00008040
          5 FILLER1      CHAR(3 ) INIT (':  '),                         00008050
          5 W01_FRAMLEGGSKODE    CHAR (20),                             00008060
          5 FILLER2      CHAR(19) INIT ( (19) ' '),                     00008070
          L01_ET_FRAMLEGG  DEF L01_ET_FRAMLEGG_DEF CHAR(80);            00008080
                                                                        00008090
 DCL    1 L01_BP_PENSJON_DEF,                                           00008100
          5 TEKST75      CHAR(38) INIT ('PENSJONEN ER AVLEDET ETTER'),  00008110
          5 FILLER1      CHAR(11) INIT (':          '),                 00008120
          5 W01_PENSJON  CHAR (3),                                      00008130
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00008140
          L01_BP_PENSJON  DEF L01_BP_PENSJON_DEF CHAR(80);              00008150
                                                                        00008160
 DCL    1 L01_BP_GP_DEF,                                                00008170
          5 TEKST76      CHAR(38) INIT ('GRUNNPENSJON '),               00008180
          5 FILLER1      CHAR(06) INIT (':     '),                      00008190
          5 W01_BP_GP    PIC 'ZZZZ.ZZ9',                                00008200
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00008210
          L01_BP_GP DEF  L01_BP_GP_DEF CHAR(80);                        00008220
                                                                        00008230
 DCL    1 L01_BP_TP_DEF,                                                00008240
          5 TEKST77      CHAR(38) INIT ('TILLEGGSPENSJON'),             00008250
          5 FILLER1      CHAR(06) INIT (':     '),                      00008260
          5 W01_BP_TP    PIC 'ZZZZ.ZZ9',                                00008270
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00008280
          L01_BP_TP DEF  L01_BP_TP_DEF CHAR(80);                        00008290
                                                                        00008300
 DCL    1 L01_BP_ST_DEF,                                                00008310
          5 TEKST78      CHAR(38) INIT ('SÆRTILLEGG'),                  00008320
          5 FILLER1      CHAR(06) INIT (':     '),                      00008330
          5 W01_BP_ST    PIC 'ZZZZ.ZZ9',                                00008340
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00008350
          L01_BP_ST DEF  L01_BP_ST_DEF CHAR(80);                        00008360
                                                                        00008370
 DCL    1 L01_BP_KT_DEF,                                                00008380
          5 TEKST79      CHAR(38) INIT ('KOMPENSASJONSTILLEGG'),        00008390
          5 FILLER1      CHAR(11) INIT (':          '),                 00008400
          5 W01_BP_KT    PIC '(3)9',                                    00008410
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00008420
          L01_BP_KT DEF  L01_BP_KT_DEF CHAR(80);                        00008430
                                                                        00008440
 DCL    1 L01_BP_SPT_MOR_DEF,                                           00008450
          5 TEKST80      CHAR(38) INIT ('MORS SLUTTPOENGTALL'),         00008460
          5 FILLER1      CHAR(10) INIT (':        '),                   00008470
          5 W01_BP_SPT_MOR   PIC '9V,99',                               00008480
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00008490
          L01_BP_SPT_MOR DEF L01_BP_SPT_MOR_DEF CHAR(80);               00008500
                                                                        00008510
 DCL    1 L01_BP_OPT_MOR_DEF,                                           00008520
          5 TEKST81      CHAR(38) INIT                                  00008530
                         ('MORS SLUTTPOENGTALL M/OVERKOMP.'),           00008540
          5 FILLER1      CHAR(10) INIT (':        '),                   00008550
          5 W01_BP_OPT_MOR    PIC '9V,99',                              00008560
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00008570
          L01_BP_OPT_MOR DEF L01_BP_OPT_MOR_DEF CHAR(80);               00008580
                                                                        00008590
 DCL    1 L01_BP_PÅ_MOR_DEF,                                            00008600
          5 TEKST82      CHAR(38) INIT ('MORS ANTALL POENGÅR'),         00008610
          5 FILLER1      CHAR(12) INIT (':           '),                00008620
          5 W01_BP_PÅ_MOR   PIC '(2)9',                                 00008630
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00008640
          L01_BP_PÅ_MOR DEF L01_BP_PÅ_MOR_DEF CHAR(80);                 00008650
                                                                        00008660
 DCL    1 L01_BP_SPT_FAR_DEF,                                           00008670
          5 TEKST83      CHAR(38) INIT ('FARS SLUTTPOENGTALL'),         00008680
          5 FILLER1      CHAR(10) INIT (':         '),                  00008690
          5 W01_BP_SPT_FAR    PIC '9V,99',                              00008700
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00008710
          L01_BP_SPT_FAR DEF L01_BP_SPT_FAR_DEF CHAR(80);               00008720
                                                                        00008730
 DCL    1 L01_BP_OPT_FAR_DEF,                                           00008740
          5 TEKST84      CHAR(38) INIT                                  00008750
                         ('FARS SLUTTPOENGTALL M/OVERKOMP.'),           00008760
          5 FILLER1      CHAR(10) INIT (':         '),                  00008770
          5 W01_BP_OPT_FAR   PIC '9V,99',                               00008780
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                     00008790
          L01_BP_OPT_FAR DEF L01_BP_OPT_FAR_DEF CHAR(80);               00008800
                                                                        00008810
 DCL    1 L01_BP_PÅ_FAR_DEF,                                            00008820
          5 TEKST85      CHAR(38) INIT ('FARS ANTALL POENGÅR'),         00008830
          5 FILLER1      CHAR(12) INIT (':          '),                 00008840
          5 W01_BP_PÅ_FAR   PIC '(2)9',                                 00008850
          5 FILLER2      CHAR(37) INIT ( (37) ' '),                     00008860
          L01_BP_PÅ_FAR DEF L01_BP_PÅ_FAR_DEF CHAR(80);                 00008870
                                                                        00008880
 /*   SISTE LINE SKRIVET IN LOKAL OMRÅDE FOR VISE AT DENNE  */          00008890
 /*   ER EOF INFORMASJONS                                   */          00008900
 DCL    1 L01_END_DEF,                                                  00008910
          5 T_END_X      CHAR(38) INIT ('********************'),        00008920
          5 FILLER1      CHAR(3 ) INIT ('***'),                         00008930
          5 W01_END      CHAR(3)  INIT ('***'),                         00008940
          5 FILLER2      CHAR(36) INIT ( (36) ' '),                     00008950
          L01_END DEF L01_END_DEF CHAR(80);                             00008960
                                                                        00008970
 DCL    1 BOND_TX,                                                      00008980
          05 FA1          CHAR (9)  INIT ('         '),                 00008990
          05 BOND_TX1     CHAR (60) INIT                                00009000
    ('REGISTERET KAN INNEHOLDE HELSEOPPLYSNINGER SOM ER REGISTRERT'),   00009010
          05 FB1          CHAR (9)  INIT ('         '),                 00009020
          05 FA2          CHAR (9)  INIT ('         '),                 00009030
          05 BOND_TX2     CHAR (60) INIT                                00009040
    ('MED TALLKODE.  SLIKE KODER ER  REGISTRERT UT FRA  EVENTUELLE'),   00009050
          05 FB2          CHAR (9)  INIT ('         '),                 00009060
          05 FA3          CHAR (9)  INIT ('         '),                 00009070
          05 BOND_TX3     CHAR (60) INIT                                00009080
    ('DIAGNOSER SOM ER I TRYGDESAKEN DERES.  KRAV OM Å FÅ SE DISSE'),   00009090
          05 FB3          CHAR (9)  INIT ('         '),                 00009100
          05 FA4          CHAR (9)  INIT ('         '),                 00009110
          05 BOND_TX4     CHAR (60) INIT                                00009120
    ('OPPLYSNINGENE KAN DE SETTE FRAM FOR TRYGDEKONTORET,  SOM VIL'),   00009130
          05 FB4          CHAR (9)  INIT ('         '),                 00009140
          05 FA5          CHAR (9)  INIT ('         '),                 00009150
          05 BOND_TX5     CHAR (60) INIT                                00009160
    ('VURDERE  DEN  RETTEN  DE  HAR TIL Å  SE  OPPLYSNINGENE ETTER'),   00009170
          05 FB5          CHAR (9)  INIT ('         '),                 00009180
          05 FA6          CHAR (9)  INIT ('         '),                 00009190
          05 BOND_TX6     CHAR (60) INIT                                00009200
    ('BESTEMMELSENE I FOLKETRYGDLOVENS PARAGRAF 14-10.            '),   00009210
          05 FB6          CHAR (9)  INIT ('         '),                 00009220
                                                                        00009230
     BOND_TESKT (6) DEF BOND_TX  CHAR (78);                             00009240
                                                                        00009250
                                                                        00009260
 DCL    LINJETELLER      BIN FIXED (15) INIT (0);                       00009270
 DCL    TT               BIN FIXED (15) INIT (0);                       00009280
 DCL    W01_SUM_W        PIC  '(7)9';                                   00009290
                                                                        00009300
                                                                        00009310
                                                                        00009320
  DCL  1 MAP_STRUC,                                                     00009330
       2 MAP_MELDING_NR         CHAR   (5),                             00009340
       2 MAP_MELDING            CHAR      (78);                         00009350
                                                                        00009360
  DCL  1  FEIL_STRUC,                                                   00009370
          2  FEIL_NR            FIXED DEC ( 5),                         00009380
          2  FEIL_MELDING       CHAR      (78);                         00009390
                                                                        00009400
                                                                        00009410
    /* ************************************************************** */00009420
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00009430
    /* ************************************************************** */00009440
                                                                        00009450
       DCL                                                              00009460
      (DATE, ADDR , CSTG , LOW , STG , SUBSTR , ONCODE )  BUILTIN;      00009470
                                                                        00009480
                                                                        00009490
       DCL                                                              00009500
         ( W01_HJELPE_PEKER , TRANS_SEGM_PEKER )                        00009510
                                               POINTER;                 00009520
                                                                        00009530
       DCL 1 FNR_REG,                                                   00009540
             2 FNR1              FIXED DEC(11),                         00009550
             2 FNR2              FIXED DEC(11),                         00009560
             2 BRUKERID          CHAR     (4);                          00009570
                                                                        00009580
                                                                        00009590
    /* ************************************************************** */00009600
    /*   OPPTELLINGS- OG  LOOP-PARAMETER                              */00009610
    /* ************************************************************** */00009620
                                                                        00009630
       DCL 1  W01                       UNALIGNED,                      00009640
              2   AKSJONSKODE                 CHAR (2)   INIT ('  '),   00009650
              2   FEILMELDING_SATT            BIT  (1)   INIT ('0'B),   00009660
              2   MER_DATA                    BIT  (1)   INIT ('1'B),   00009670
              2   STYRINGSKODE_IKKE_SATT      BIT  (1)   INIT ('0'B),   00009680
              2   PERSON_IKKE_FUNNET          BIT  (1)   INIT ('1'B),   00009690
              2   AKSJON_IKKE_SATT            BIT  (1)   INIT ('1'B),   00009700
              2   PAKKET_FNR           FIXED  DEC  (11)  INIT ( 0  ),   00009710
              2   PAKKET_AAR           FIXED  DEC  ( 3)  INIT ( 0  ),   00009720
              2   I                    FIXED  BIN  (15)  INIT ( 1  ),   00009730
              2   J              FIXED  BIN  (15)  INIT ( 1  );         00009740
                                                                        00009750
                                                                        00009760
                                                                        00009770
                                                                        00009780
    DCL                                                                 00009790
        FEIL_DB               BIT       ( 1)    INIT ('0'B   ),         00009800
        UPTRANS_OPPDATERT     BIT       ( 1)    INIT ('0'B   ),         00009810
        W01_GHU               CHAR      ( 4)    INIT ('GHU ' ),         00009820
        W01_GHNP              CHAR      ( 4)    INIT ('GHNP' ),         00009830
        W01_REPL              CHAR      ( 4)    INIT ('REPL' ),         00009840
        W01_ISRT              CHAR      ( 4)    INIT ('ISRT' ),         00009850
        W01_OPEN              CHAR      ( 5)    INIT ('OPEN '),         00009860
        W01_CLOSE             CHAR      ( 5)    INIT ('CLOSE'),         00009870
        MELDING_DB            CHAR      (78)    INIT (''     ),         00009880
        LENGDE_INN_OMR        FIXED BIN (15)    INIT ( 16    );         00009890
                                                                        00009900
                                                                        00009910
    DCL EN      FIXED BIN (31) INIT (1),                                00009920
        TO      FIXED BIN (31) INIT (2),                                00009930
        TRE     FIXED BIN (31) INIT (3),                                00009940
        FIRE    FIXED BIN (31) INIT (4),                                00009950
        FEM     FIXED BIN (31) INIT (5),                                00009960
        SEKS    FIXED BIN (31) INIT (6);                                00009970
                                                                        00009980
                                                                        00009990
  /* ********************************************************** */      00010000
  /* DLI - FUNKSJONER :  PSB OG DLIUIB                          */      00010010
  /* ********************************************************** */      00010020
                                                                        00010030
   %INCLUDE  P0012002;                                                  00010040
                                                                        00010050
   DCL 1 RF1 BASED               (RF1_PCB_PEKER),                       00010060
   %INCLUDE  P0012003;                                                  00010070
                                                                        00010080
                                                                        00010090
 %INCLUDE P0019924;         /* G_V_TAB            */                    00010100
 %PAGE;                                                                 00010110
 %INCLUDE P0019925;         /* G_TAB              */                    00010120
 %PAGE;                                                                 00010130
                                                                        00010140
    DCL                                                                 00010150
    FIXED_DEC5_4           FIXED DEC(5,4),                              00010160
    FIXED_DEC9             FIXED DEC(9),                                00010170
    FIXED_DEC3             FIXED DEC(3),                                00010180
    FIXED_BIN15            FIXED BIN(15),                               00010190
    INDEX_1                FIXED BIN(15),                               00010200
    INDEX_2                FIXED BIN(15),                               00010210
    MAX_UFGO               PIC '999';                                   00010220
  DCL  GRUNN_OMR1      CHAR (1202);                                     00010230
  DCL  GRUNN_OMR2      CHAR (1202);                                     00010240
  DCL  GRUNN_IDENT     CHAR (8);                                        00010250
                                                                        00010260
                                                                        00010270
 /* ************************************************* */                00010280
 /*  LINES USED ON SCREEN                             */                00010290
 /*         AND PRINTER                               */                00010300
 /*                                                   */                00010310
 /* ************************************************* */                00010320
  /* ************************************************************** */  00010330
  /*                                                                */  00010340
  /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */  00010350
  /*     ---------------------------------------------------        */  00010360
  /*                                                                */  00010370
  /*                                                                */  00010380
  /*                                                                */  00010390
  /* ************************************************************** */  00010400
                                                                        00010410
                                                                        00010420
          ALLOCATE B01;                                                 00010430
          ALLOCATE B02;                                                 00010440
          ALLOCATE PCB_UIB_PEKER_OMR;                                   00010450
          ALLOCATE GV_TAB_RE;                                           00010460
          ALLOCATE G_TAB_RE;                                            00010470
                                                                        00010480
          KOM_OMR.B01_PEKER        =  ADDR(B01);                        00010490
          KOM_OMR.B02_PEKER        =  ADDR(B02);                        00010500
          KOM_OMR.TRANS_LISTE_PEKER =  ADDR(KOM_OMR.TRANS_LISTE_OMR);   00010510
          KOM_OMR.TRANS_OPPL_PEKER =  ADDR(KOM_OMR.TRANS_OPPL_OMR);     00010520
          KOM_OMR.STYRINGS_PEKER   =  ADDR(KOM_OMR.STYRINGS_OMR);       00010530
          KOM_OMR.DIV_PARAM_PEKER  =  ADDR(KOM_OMR.DIV_PARAM_OMR);      00010540
          KOM_OMR.PCB_UIB_PEKER    =  ADDR(PCB_UIB_PEKER_OMR);          00010550
          KOM_OMR.GV_PEKER  = ADDR (GRUNN_OMR1             ) ;          00010560
          KOM_OMR.G_PEKER   = ADDR (GRUNN_OMR2             );           00010570
          B01       = '';                                               00010580
          B02       = '' ;                                              00010590
                                                                        00010600
                                                                        00010610
          GV_TAB_RE =  ''  ;                                            00010620
          G_TAB_RE  =  ''  ;                                            00010630
                                                                        00010640
          GRUNN_IDENT   = 'P0019924';                                   00010650
          CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                00010660
                                                                        00010670
          GRUNN_IDENT   = 'P0019925';                                   00010680
          CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                00010690
                                                                        00010700
                                                                        00010710
   /*  -------- HOVED ----------------------- */                        00010720
   STYRINGS_OMR.FUNKSJONSKODE = 'F';                                    00010730
    IF PROGRAM_ID = 'R0010420' THEN                                     00010740
       DO;                                                              00010750
          ALLOCATE S001A43O  ;                                          00010760
          ALLOCATE S001A43I  ;                                          00010770
          EXEC CICS LOAD PROGRAM ('S001A43')      ;                     00010780
                                                                        00010790
          S001A43I.SFNRL   =  CURSOR_POS;                               00010800
          EXEC CICS SEND MAP('S001A43') MAPSET('S001A43')  ERASE        00010810
                                    MAPONLY CURSOR;                     00010820
          S001A43I.AKSJONI = '  ';                                      00010830
          ACC_SIDE = 1;                                                 00010840
          MAP_SIDE = 1;                                                 00010850
          PRI_L = '1'B;                                                 00010860
          PP    = '1'B;                                                 00010870
          NY_KODE = 0;                                                  00010880
       END;                                                             00010890
                                                                        00010900
                                                                        00010910
                                                                        00010920
     ELSE IF  PROGRAM_ID = 'R0010430' THEN   /* DETTE PROGRAM  */       00010930
                                                                        00010940
         DO;                                                            00010950
            EXEC CICS RECEIVE MAP('S001A43') MAPSET('S001A43')          00010960
                                         SET  (BMSMAPBR);               00010970
                                                                        00010980
            S001A43O.MELDINGO  = '';                                    00010990
            AKSJONSKODE = S001A43I.AKSJONI;                             00011000
                                                                        00011010
                                                                        00011020
                                                                        00011030
            IF S001A43I.FUNKSJONSKODEL > 0 &                            00011040
               VERIFY(S001A43I.FUNKSJONSKODEI,'RVEFIAX') = 0 THEN       00011050
                                                                        00011060
             DO;                                                        00011070
         /*     FUNKSJONSKODE = S001A43I.FUNKSJONSKODEI;     */         00011080
                EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR); 00011090
             END;                                                       00011100
                                                                        00011110
             IF S001A43I.STYRE_KODEL > 0 &                              00011120
                S001A43I.STYRE_KODEI ^= 'IN' THEN                       00011130
              DO;                                                       00011140
                STYREKODE  = S001A43I.STYRE_KODEI;                      00011150
                EXEC CICS XCTL PROGRAM ('R0010420')                     00011160
                               COMMAREA (KOM_OMR);                      00011170
              END;                                                      00011180
                                                                        00011190
             IF S001A43I.SFNRL  > 0   THEN                              00011200
                DO;                                                     00011210
                   NY_KODE = 0;                                         00011220
                END;                                                    00011230
                                                                        00011240
                                                                        00011250
      EXEC CICS ENTER TRACEID(01) FROM (S001A43I.AKSJONI);              00011260
             SELECT (S001A43I.AKSJONI);                                 00011270
               WHEN ('NY','  ')                                         00011280
                DO;                                                     00011290
                                                                        00011300
                   CALL P005_NYFNR;                                     00011310
                   CALL P010_SJEKK_FNR;                                 00011320
                   IF FEILMELDING_SATT = '1'B  THEN                     00011330
                      DO;                                               00011340
                      CALL P110_FEILMELD;                               00011350
                      GOTO M99_RETUR;                                   00011360
                   END;                                                 00011370
                                                                        00011380
                   FEIL_DB = '0'B;                                      00011390
                   CALL P020_DATABASE (W01_OPEN);                       00011400
                   IF FEIL_DB = '1'B    THEN                            00011410
                      DO;                                               00011420
                      CALL P110_FEILMELD;                               00011430
                      GOTO M99_RETUR;                                   00011440
                   END;                                                 00011450
                                                                        00011460
                   FEIL_DB = '0'B;                                      00011470
                                                                        00011480
                   CALL P095_READ_DATABASE;                             00011490
                                                                        00011500
                   IF FEIL_DB = '1'B    THEN                            00011510
                      DO;                                               00011520
                      CALL P110_FEILMELD;                               00011530
                      GOTO M99_RETUR;                                   00011540
                   END;                                                 00011550
                                                                        00011560
                   LIND = 1;                                            00011570
                   CALL  P030_ACC_DATA_OMRADE;                          00011580
                                                                        00011590
                   CALL P090_SEND_BILDE;                                00011600
                                                                        00011610
                   FEIL_DB  = '0'B;                                     00011620
                   NY_KODE = 1;                                         00011630
                                                                        00011640
                   CALL P020_DATABASE (W01_CLOSE);                      00011650
                   IF FEIL_DB = '1'B    THEN                            00011660
                      DO;                                               00011670
                      CALL P110_FEILMELD;                               00011680
                      GOTO M99_RETUR;                                   00011690
                   END;                                                 00011700
                                                                        00011710
                END;                                                    00011720
                                                                        00011730
               WHEN('NS')                                               00011740
                DO;                                                     00011750
                                                                        00011760
                   CALL P070_NESTESIDE;                                 00011770
                   IF FEILMELDING_SATT = '1'B    THEN                   00011780
                      DO;                                               00011790
                      CALL P110_FEILMELD;                               00011800
                      GOTO M99_RETUR;                                   00011810
                   END;                                                 00011820
                   CALL P090_SEND_BILDE;                                00011830
                END;                                                    00011840
                                                                        00011850
               WHEN('FS')                                               00011860
                DO;                                                     00011870
                                                                        00011880
                   CALL P060_TILBAKE;                                   00011890
                   IF FEILMELDING_SATT = '1'B    THEN                   00011900
                      DO;                                               00011910
                      CALL P110_FEILMELD;                               00011920
                      GOTO M99_RETUR;                                   00011930
                   END;                                                 00011940
                   CALL P090_SEND_BILDE;                                00011950
                END;                                                    00011960
                                                                        00011970
               WHEN ('D1','D2')                                         00011980
               DO;                                                      00011990
               IF  S001A43I.AKSJONI = 'D1' THEN  TERMID = 'RRAV';       00012000
               IF  S001A43I.AKSJONI = 'D2' THEN  TERMID = 'RRAU';       00012010
                                                                        00012020
                   IF NY_KODE = 0     THEN                              00012030
                      DO;                                               00012040
                         CALL P005_NYFNR;                               00012050
                         CALL P010_SJEKK_FNR;                           00012060
                         IF FEILMELDING_SATT = '1'B  THEN               00012070
                            DO;                                         00012080
                               CALL P110_FEILMELD;                      00012090
                               GOTO M99_RETUR;                          00012100
                            END;                                        00012110
                                                                        00012120
                         FEIL_DB = '0'B;                                00012130
                         CALL P020_DATABASE (W01_OPEN);                 00012140
                         IF FEIL_DB = '1'B    THEN                      00012150
                            DO;                                         00012160
                               CALL P110_FEILMELD;                      00012170
                               GOTO M99_RETUR;                          00012180
                            END;                                        00012190
                                                                        00012200
                         FEIL_DB = '0'B;                                00012210
                                                                        00012220
                         CALL P095_READ_DATABASE;                       00012230
                                                                        00012240
                         IF FEIL_DB = '1'B    THEN                      00012250
                            DO;                                         00012260
                               CALL P110_FEILMELD;                      00012270
                               GOTO M99_RETUR;                          00012280
                            END;                                        00012290
                                                                        00012300
                         LIND = 1;                                      00012310
                         CALL  P030_ACC_DATA_OMRADE;                    00012320
                                                                        00012330
                                                                        00012340
                                                                        00012350
                         FEIL_DB  = '0'B;                               00012360
                                                                        00012370
                         CALL P020_DATABASE (W01_CLOSE);                00012380
                         IF FEIL_DB = '1'B    THEN                      00012390
                            DO;                                         00012400
                            CALL P110_FEILMELD;                         00012410
                            GOTO M99_RETUR;                             00012420
                         END;                                           00012430
                                                                        00012440
                      END;                                              00012450
                                                                        00012460
                                                                        00012470
                   NY_KODE = 1;                                         00012480
                   CALL P200_DRAMMEN_PRINT;                             00012490
                   S001A43I.SFNRL =  CURSOR_POS;  /* CURSOR */          00012500
                   EXEC CICS SEND MAP('S001A43') MAPSET('S001A43')      00012510
                                         CURSOR  DATAONLY;              00012520
                END;                                                    00012530
                                                                        00012540
               WHEN('DF')                                               00012550
                DO;                                                     00012560
                   IF NY_KODE = 0     THEN                              00012570
                      DO;                                               00012580
                         CALL P005_NYFNR;                               00012590
                         CALL P010_SJEKK_FNR;                           00012600
                         IF FEILMELDING_SATT = '1'B  THEN               00012610
                            DO;                                         00012620
                               CALL P110_FEILMELD;                      00012630
                               GOTO M99_RETUR;                          00012640
                            END;                                        00012650
                                                                        00012660
                         FEIL_DB = '0'B;                                00012670
                         CALL P020_DATABASE (W01_OPEN);                 00012680
                         IF FEIL_DB = '1'B    THEN                      00012690
                            DO;                                         00012700
                               CALL P110_FEILMELD;                      00012710
                               GOTO M99_RETUR;                          00012720
                            END;                                        00012730
                                                                        00012740
                         FEIL_DB = '0'B;                                00012750
                                                                        00012760
                         CALL P095_READ_DATABASE;                       00012770
                                                                        00012780
                         IF FEIL_DB = '1'B    THEN                      00012790
                            DO;                                         00012800
                               CALL P110_FEILMELD;                      00012810
                               GOTO M99_RETUR;                          00012820
                            END;                                        00012830
                                                                        00012840
                         LIND = 1;                                      00012850
                         CALL  P030_ACC_DATA_OMRADE;                    00012860
                                                                        00012870
                                                                        00012880
                                                                        00012890
                         FEIL_DB  = '0'B;                               00012900
                                                                        00012910
                         CALL P020_DATABASE (W01_CLOSE);                00012920
                         IF FEIL_DB = '1'B    THEN                      00012930
                            DO;                                         00012940
                            CALL P110_FEILMELD;                         00012950
                            GOTO M99_RETUR;                             00012960
                         END;                                           00012970
                                                                        00012980
                      END;                                              00012990
                                                                        00013000
                                                                        00013010
                   NY_KODE = 1;                                         00013020
                   CALL P210_DRIFT_PRINT;                               00013030
                   S001A43I.SFNRL =  CURSOR_POS;  /* CURSOR */          00013040
                   EXEC CICS SEND MAP('S001A43') MAPSET('S001A43')      00013050
                                         CURSOR  DATAONLY;              00013060
                                                                        00013070
                END;                                                    00013080
                                                                        00013090
                                                                        00013100
               WHEN('XX')                                               00013110
                DO;                                                     00013120
                   PROGRAM_ID    =  'R0010301';                         00013130
                   TRANS_OPPL_OMR.TRANSKODE = 'RA20';                   00013140
                   EXEC CICS XCTL PROGRAM('R0010420')                   00013150
                                  COMMAREA (KOM_OMR);                   00013160
                END;                                                    00013170
               OTHERWISE                                                00013180
                DO;                                                     00013190
                   S001A43O.MELDINGO = 'UGYLDIG KODE';                  00013200
                   S001A43I.AKSJONL =  CURSOR_POS;  /* CURSOR */        00013210
                END;                                                    00013220
                                                                        00013230
            END;                                                        00013240
     END;                                                               00013250
                                                                        00013260
                                                                        00013270
  M99_RETUR:                                                            00013280
      TRANS_OPPL_OMR.TRANSKODE = 'RA43';                                00013290
      PROGRAM_ID               =  'R0010430';                           00013300
                                                                        00013310
      EXEC CICS RETURN TRANSID(TRANSKODE)                               00013320
                             COMMAREA(KOM_OMR);                         00013330
                                                                        00013340
                                                                        00013350
                                                                        00013360
  /***********************************************/                     00013370
  /*  FOR SETTING THE SWITCHES OF FOR NY PERSON  */                     00013380
  /**********************************************/                      00013390
                                                                        00013400
  P005_NYFNR: PROC;                                                     00013410
      CALL P091_BLANKING_RUTIN;                                         00013420
       FEILMELDING_SATT  = '0'B  ;                                      00013430
                                                                        00013440
       MAP_SIDE = 1;                                                    00013450
       ACC_SIDE = 1;                                                    00013460
       PRI_L = '1'B;                                                    00013470
                                                                        00013480
  END P005_NYFNR;                                                       00013490
                                                                        00013500
                                                                        00013510
                                                                        00013520
  /*************************************************/                   00013530
  /*   DATABASE ER BEHANDLET HER        */                              00013540
  /*************************************************/                   00013550
  P095_READ_DATABASE: PROC;                                             00013560
                                                                        00013570
       FNR_REG.FNR1       = S001A43I.SFNRI;                             00013580
       PC_11              = S001A43I.SFNRI;                             00013590
                                                                        00013600
       SEARCH_FNR                       = 0    ;                        00013610
       DIV_PARAM_OMR.ØNSKET_STATUS      = 'S'  ;                        00013620
       DIV_PARAM_OMR.POS_I_B01          = 1    ;                        00013630
       DIV_PARAM_OMR.SEARCH_FNR         = FNR_REG.FNR1  ;               00013640
       DIV_PARAM_OMR.TRANS_VIRKDATO_ÅM  = 9999;                         00013650
       DIV_PARAM_OMR.FEIL_MELD_NR       = 0 ;                           00013660
                                                                        00013670
       EXEC CICS LINK PROGRAM('R0013110') COMMAREA (KOM_OMR);           00013680
                                                                        00013690
       IF DIV_PARAM_OMR.FEIL_MELD_NR >  0        THEN                   00013700
          DO;                                                           00013710
             FEIL_DB    = '1'B;                                         00013720
             MAP_MELDING = ' FATA-FEIL I PROG R0013110  FEILNR' !!      00013730
                            DIV_PARAM_OMR.FEIL_MELD_NR !!'LABEL' !!     00013740
                            DIV_PARAM_OMR.FEIL_VED_LABEL ;              00013750
                                                                        00013760
          END;                                                          00013770
                                                                        00013780
       ELSE IF B01.PERSON.RF0PERSN.FNR(1) = 0 THEN                      00013790
          DO;                                                           00013800
             FEIL_DB    = '1'B;                                         00013810
             MAP_MELDING = ' PERSONEN MED FØDSELSNUMMER: ' !! PC_11 !!  00013820
                       'ER IKKE I DATABASE';                            00013830
                                                                        00013840
          END;                                                          00013850
                                                                        00013860
        ELSE                                                            00013870
          DO;                                                           00013880
              MAP_MELDING = '';                                         00013890
          END;                                                          00013900
                                                                        00013910
  END P095_READ_DATABASE;                                               00013920
                                                                        00013930
  /* **************************************************************** */00013940
  /*HENSIKT:                                                          */00013950
  /*    SJEKKER OM FNR GYLDIG.                                        */00013960
  /*                                                                  */00013970
  /*BRUK:                                                             */00013980
  /*    CALL P010_SJEKK_FNR;                                          */00013990
  /*                                                                  */00014000
  /* **************************************************************** */00014010
                                                                        00014020
   P010_SJEKK_FNR: PROC;                                                00014030
                                                                        00014040
                                                                        00014050
      IF ^(S001A43I.SFNRL > 0)  THEN                                    00014060
         DO;                                                            00014070
            MAP_MELDING        =  'FNR MÅ OPPGIS  !!  ';                00014080
            FEILMELDING_SATT   =  '1'B;                                 00014090
         END;                                                           00014100
                                                                        00014110
                                                                        00014120
      ELSE IF ^F_NUMERISK(S001A43I.SFNRI)        THEN                   00014130
           DO;                                                          00014140
              MAP_MELDING        = 'TEGN SOM IKKE ER NUMERISK ' !!      00014150
                                       'I FØDSELSNR. ! '             ;  00014160
              FEILMELDING_SATT   = '1'B;                                00014170
           END;                                                         00014180
                                                                        00014190
                                                                        00014200
      ELSE IF ^F_GYLDIG_FNR(S001A43I.SFNRI) THEN                        00014210
           DO;                                                          00014220
              MAP_MELDING = 'UGYLDIG FØDSELSNUMMER';                    00014230
              FEILMELDING_SATT   = '1'B;                                00014240
                                                                        00014250
           END;                                                         00014260
      ELSE                                                              00014270
           DO;                                                          00014280
                                                                        00014290
              FNR_REG.FNR1        =  S001A43I.SFNRI;                    00014300
              EXEC CICS LINK PROGRAM ('R0019906') COMMAREA(FNR_REG);    00014310
                                                                        00014320
                                                                        00014330
             IF FNR_REG.FNR2   >   0                   THEN             00014340
                DO;                                                     00014350
               MAP_MELDING        =  'FNR ENDRET TIL ' !! FNR_REG.FNR2; 00014360
               S001A43I.SFNRI     =  FNR_REG.FNR2;                      00014370
               CALL P110_FEILMELD;                                      00014380
                                                                        00014390
              END;                                                      00014400
            END;                                                        00014410
                                                                        00014420
 END P010_SJEKK_FNR;                                                    00014430
                                                                        00014440
 /* ************************************************* */                00014450
 /*  LESER REG (DATA BASED)                           */                00014460
 /*                                                   */                00014470
 /*                                                   */                00014480
 /* ************************************************* */                00014490
                                                                        00014500
 P020_DATABASE:                                                         00014510
   PROC    (STYRING);                                                   00014520
                                                                        00014530
   DCL                                                                  00014540
      STYRING             CHAR (5),                                     00014550
      NULL                BUILTIN,                                      00014560
      UNSPEC              BUILTIN,                                      00014570
      PLITDLI             ENTRY;                                        00014580
                                                                        00014590
  /* **************************************************************** */00014600
  /*     DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-   */00014610
  /*     KALL                                                         */00014620
  /* **************************************************************** */00014630
                                                                        00014640
     DCL                                                                00014650
       W01_PSB_NAVN                CHAR (8)       INIT('B001R001'),     00014660
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB '),         00014670
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00014680
                                                                        00014690
                                                                        00014700
   %INCLUDE DLIUIB;                                                     00014710
  /* **************************************************************** */00014720
  /*     DLI CALL-PARAMETRE                                           */00014730
  /* **************************************************************** */00014740
                                                                        00014750
     DCL 1  W01_DLI_PARAM,                                              00014760
            2   W02_PARM_CT_1      FIXED BIN (31)  INIT ( 1 ),          00014770
            2   W02_PARM_CT_3      FIXED BIN (31)  INIT ( 3 ),          00014780
            2   W02_PARM_CT_4      FIXED BIN (31)  INIT ( 4 );          00014790
                                                                        00014800
                                                                        00014810
                                                                        00014820
     IF STYRING = 'OPEN '                         THEN                  00014830
        DO;                                                             00014840
           CALL   PLITDLI                        (W02_PARM_CT_3,        00014850
                                                  W01_PCB_FUNCTION,     00014860
                                                  W01_PSB_NAVN,         00014870
                                                  UIBPTR);              00014880
                                                                        00014890
           IF DLIUIB.UIBFCTR               ^=    '00000000'B THEN       00014900
             DO;                                                        00014910
   L120 :                                                               00014920
                MAP_MELDING      =                                      00014930
                 'DB-FEIL PÅ ÅPNINGSKALLET, KODE:' !!                   00014940
                  UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);            00014950
                MAP_MELDING_NR   = 500                     ;            00014960
                FEIL_VED_LABEL   = 'L120'                  ;            00014970
                FEIL_DB = '1'B;                                         00014980
                                                                        00014990
             END;                                                       00015000
           ELSE                                                         00015010
             DO;                                                        00015020
                PCB_UIB_PEKER_OMR.PCB_PEKER  =  UIBPCBAL   ;            00015030
                PCB_UIB_PEKER_OMR.UIB_PEKER  =  UIBPTR     ;            00015040
             END;                                                       00015050
        END;                                                            00015060
     ELSE                                                               00015070
        DO;                                                             00015080
           CALL   PLITDLI                        (W02_PARM_CT_1,        00015090
                                                  W01_TERM_FUNCTION);   00015100
        END;                                                            00015110
                                                                        00015120
 END P020_DATABASE;                                                     00015130
                                                                        00015140
                                                                        00015150
  P030_ACC_DATA_OMRADE: PROC ;                                          00015160
                                                                        00015170
                                                                        00015180
   IF B01.RF0PERSN.FNR(POS_I_B01) > 0 THEN                              00015190
      DO;                                                               00015200
                                                                        00015210
        CALL P030_GENERELL_BEHANDLING;                                  00015220
                                                                        00015230
                                                                        00015240
        CALL P030_INNTEKTS_BEHANDLING;                                  00015250
                                                                        00015260
                                                                        00015270
                                                                        00015280
        CALL P030_TILBER_BEHANDLING;                                    00015290
                                                                        00015300
                                                                        00015310
        IF B01.STATUS.VIRK_DATO_ÅM (IX) > 0 THEN                        00015320
            DO;                                                         00015330
               CALL P030_STATUS_BEHANDLING;                             00015340
            END;                                                        00015350
                                                                        00015360
                                                                        00015370
        IF B01.ALDERSP.GP (IX) > 0 THEN                                 00015380
            DO;                                                         00015390
               CALL P030_ALDERSP_BEHANDLING;                            00015400
            END;                                                        00015410
                                                                        00015420
                                                                        00015430
        IF B01.UFØRPENS.UFG (IX)  > 0  THEN                             00015440
           DO;                                                          00015450
             CALL P030_UFØRPENS_BEHANDLING;                             00015460
           END;                                                         00015470
                                                                        00015480
                                                                        00015490
        CALL P030_UFØRHIST_BEHANDLING;                                  00015500
                                                                        00015510
                                                                        00015520
                                                                        00015530
        IF B01.ETTEPENS.GP_BRUTTO (IX) > 0 THEN                         00015540
            DO;                                                         00015550
               CALL P030_ETTEPENS_BEHANDLING;                           00015560
            END;                                                        00015570
                                                                        00015580
                                                                        00015590
                                                                        00015600
        IF B01.ETTEBARN.GP (IX) > 0 THEN                                00015610
          DO;                                                           00015620
             CALL P030_ETTEBARN_BEHANDLING;                             00015630
          END;                                                          00015640
                                                                        00015650
                                                                        00015660
                                                                        00015670
       /*      CALL P030_END_REC;    */                                 00015680
                                                                        00015690
      END;                                                              00015700
                                                                        00015710
  END P030_ACC_DATA_OMRADE ;                                            00015720
                                                                        00015730
  P030_GENERELL_BEHANDLING: PROC ;                                      00015740
                                                                        00015750
           W01_FNR    =   B01.RF0PERSN.FNR (IX);                        00015760
                                                                        00015770
           CALL P99_ACC_LINJE(L01_FNR);                                 00015780
                                                                        00015790
           W01_NAVN   =   B01.RF0PERSN.NAVN (IX);                       00015800
                                                                        00015810
           CALL P99_ACC_LINJE(L01_NAVN);                                00015820
                                                                        00015830
           W01_TKNR   =   B01.RF0PERSN.TKNR (IX);                       00015840
                                                                        00015850
                                                                        00015860
            EXEC CICS HANDLE CONDITION NOTFND(NOTFND_TK);               00015870
            EXEC CICS HANDLE CONDITION IOERR(NOTFND_TK);                00015880
            EXEC CICS HANDLE CONDITION SYSIDERR(NOTFND_TK);             00015890
            EXEC CICS READ DATASET ('TKNRTAB')                          00015900
                           INTO    (TKNR_REC)                           00015910
                           RIDFLD  (W01_TKNR)                           00015920
                           KEYLENGTH (4);                               00015930
                                                                        00015940
                                                                        00015950
            W01_TKNAVN =  TKNR_REC.NAVN;                                00015960
            GO TO FND_TK;                                               00015970
  NOTFND_TK:                                                            00015980
           W01_TKNAVN =  'FINNES IKKE KOMMUNE NAVN';                    00015990
  FND_TK:                                                               00016000
                                                                        00016010
           CALL P99_ACC_LINJE(L01_TKNR);                                00016020
                                                                        00016030
   /*  STATSBORG                              */                        00016040
           W01_STAT   =   B01.SPESOPPL.STATSBORGER (IX);                00016050
            EXEC CICS HANDLE CONDITION NOTFND(NOTFND_ST);               00016060
            EXEC CICS READ DATASET ('STATTAB')                          00016070
                           INTO    (STAT_REC)                           00016080
                           RIDFLD  (W01_STAT)                           00016090
                           KEYLENGTH (3);                               00016100
                                                                        00016110
                                                                        00016120
            W01_LANDNAVN =  STAT_REC.STAT_NAVN;                         00016130
            GO TO FND_ST;                                               00016140
  NOTFND_ST:                                                            00016150
           W01_LANDNAVN =  'FINNES IKKE LANDNAVN    ';                  00016160
  FND_ST:                                                               00016170
                                                                        00016180
           CALL P99_ACC_LINJE(L01_STATSBORGER);                         00016190
                                                                        00016200
           IF  B01.RF0PERSN.SPRÅK (IX) ^= ' '  THEN DO;                 00016210
                                                                        00016220
               SELECT (B01.RF0PERSN.SPRÅK (IX));                        00016230
                      WHEN ('N')  DO;                                   00016240
                                  W01_SPRÅK  = 'NYNORSK   ';            00016250
                                  END;                                  00016260
                      WHEN ('B')  DO;                                   00016270
                                  W01_SPRÅK  = 'BOKMÅL  ';              00016280
                                  END;                                  00016290
                      OTHERWISE DO;                                     00016300
                                  W01_SPRÅK  = 'FEIL_KODE';             00016310
                      END;                                              00016320
               END;                                                     00016330
                                                                        00016340
                                                                        00016350
                                                                        00016360
               CALL P99_ACC_LINJE(L01_SPRÅK);                           00016370
           END;                                                         00016380
                                                                        00016390
                                                                        00016400
  END P030_GENERELL_BEHANDLING   ;                                      00016410
                                                                        00016420
                                                                        00016430
                                                                        00016440
  P030_INNTEKTS_BEHANDLING: PROC ;                                      00016450
                                                                        00016460
      DO IÅR = 67 TO 99;                                                00016470
           IF B01.PERSON.PINNTEKT.PI (IX, IÅR) > 0 THEN                 00016480
                                                                        00016490
            DO;                                                         00016500
               TEKST7_ÅR   = IÅR;                                       00016510
               FILLER_TEKST7  =  'P.POENG:  ';                          00016520
               W01_INNT    = B01.PINNTEKT.PI(IX , IÅR) * 100 ;          00016530
                                                                        00016540
               CALL P0301_INNTEKTS_P_POENG;                             00016550
                                                                        00016560
               CALL P99_ACC_LINJE(L01_INNT);                            00016570
                                                                        00016580
            END;                                                        00016590
                                                                        00016600
      END;                                                              00016610
                                                                        00016620
                                                                        00016630
  END P030_INNTEKTS_BEHANDLING  ;                                       00016640
                                                                        00016650
                                                                        00016660
                                                                        00016670
  P030_TILBER_BEHANDLING  : PROC  ;                                     00016680
                                                                        00016690
      DO VÅR = 1 TO 4;                                                  00016700
                                                                        00016710
                                                                        00016720
        IF B01.TILBERPO.VERNEPLIKTÅR(IX, VÅR) > 0 THEN                  00016730
           DO;                                                          00016740
                                                                        00016750
             W01_VERNEP  = B01.TILBERPO.VERNEPLIKTÅR(IX, VÅR);          00016760
                                                                        00016770
             CALL P99_ACC_LINJE(L01_VERNEPL);                           00016780
           END;                                                         00016790
      END;                                                              00016800
                                                                        00016810
        IF B01.TILBERPO.AI63 (IX)  > 0  THEN                            00016820
           DO;                                                          00016830
              W01_AI63        = B01.TILBERPO.AI63 (IX)  * 100;          00016840
                                                                        00016850
              CALL P99_ACC_LINJE(L01_AI63);                             00016860
        END;                                                            00016870
                                                                        00016880
        IF B01.TILBERPO.AI64 (IX) > 0  THEN                             00016890
           DO;                                                          00016900
              W01_AI64       = B01.TILBERPO.AI64 (IX)  * 100;           00016910
                                                                        00016920
              CALL P99_ACC_LINJE(L01_AI64);                             00016930
           END;                                                         00016940
                                                                        00016950
        IF B01.TILBERPO.AI65 (IX)  > 0       THEN                       00016960
           DO;                                                          00016970
               W01_AI65      = B01.TILBERPO.AI65 (IX) * 100;            00016980
                                                                        00016990
               CALL P99_ACC_LINJE(L01_AI65);                            00017000
           END;                                                         00017010
                                                                        00017020
        IF B01.TILBERPO.AI66 (IX)  > 0   THEN                           00017030
           DO;                                                          00017040
               W01_AI66       = B01.TILBERPO.AI66 (IX) * 100;           00017050
                                                                        00017060
               CALL P99_ACC_LINJE(L01_AI66);                            00017070
           END;                                                         00017080
                                                                        00017090
        IF B01.RF0PERSN.AI67 (IX)  > 0   THEN                           00017100
           DO;                                                          00017110
               W01_AI67       = B01.RF0PERSN.AI67 (IX) * 100;           00017120
                                                                        00017130
               CALL P99_ACC_LINJE(L01_AI67);                            00017140
           END;                                                         00017150
                                                                        00017160
        IF B01.TILBERPO.PI66 (IX)  > 0    THEN                          00017170
           DO;                                                          00017180
               W01_PI66       = B01.TILBERPO.AI66 (IX);                 00017190
                                                                        00017200
               CALL P99_ACC_LINJE(L01_PI66);                            00017210
           END;                                                         00017220
                                                                        00017230
                                                                        00017240
  END P030_TILBER_BEHANDLING  ;                                         00017250
                                                                        00017260
                                                                        00017270
                                                                        00017280
  P030_STATUS_BEHANDLING  : PROC ;                                      00017290
                                                                        00017300
                                                                        00017310
   IF B01.STATUS.VIRK_DATO_ÅM (IX)  > 0  THEN                           00017320
      DO;                                                               00017330
         WÅRMND       = B01.STATUS.VIRK_DATO_ÅM (IX);                   00017340
         CALL P99_DATOREVERSE;                                          00017350
         W01_VIRK     = WMNDÅR;                                         00017360
                                                                        00017370
         CALL P99_ACC_LINJE(L01_VIRK);                                  00017380
      END;                                                              00017390
                                                                        00017400
   IF B01.STATUS.SIVILSTAND (IX)  > ' '  THEN                           00017410
      DO;                                                               00017420
                                                                        00017430
         SELECT ( B01.STATUS.SIVILSTAND (IX));                          00017440
           WHEN ('A')   W01_SIVIL = 'GIFT LEVER ADSKILT';               00017450
           WHEN ('E')   W01_SIVIL = ' ETTERLATT        ';               00017460
           WHEN ('G')   W01_SIVIL = '      GIFT        ';               00017470
           WHEN ('U')   W01_SIVIL = '     UGIFT        ';               00017480
           WHEN ('S')   W01_SIVIL = '     SKILT        ';               00017490
           WHEN ('W')   W01_SIVIL = '   SAMBOER        ';               00017500
           WHEN ('V')   W01_SIVIL = '   SAMBOER        ';               00017510
           WHEN ('P')   W01_SIVIL = '   PARTNER        ';               00017520
           OTHERWISE  DO;                                               00017530
                        W01_SIVIL  = 'FEIL-KODE         ';              00017540
           END;                                                         00017550
         END;                                                           00017560
                                                                        00017570
         CALL P99_ACC_LINJE(L01_SIVIL)            ;                     00017580
      END;                                                              00017590
                                                                        00017600
   IF  B01.STATUS.SIVILSTAND (IX) = 'A' !                               00017610
       B01.STATUS.SIVILSTAND (IX) = 'W' !                               00017620
       B01.STATUS.SIVILSTAND (IX) = 'V' !                               00017630
       B01.STATUS.SIVILSTAND (IX) = 'P' !                               00017640
       B01.STATUS.SIVILSTAND (IX) = 'G'     THEN                        00017650
       DO;                                                              00017660
          CALL P030_TILKN_BEHANDLING;                                   00017670
       END;                                                             00017680
                                                                        00017690
   IF B01.STATUS.TT_ANV (IX)     > 0 THEN                               00017700
      DO;                                                               00017710
         W01_TT       = B01.STATUS.TT_ANV (IX)    ;                     00017720
                                                                        00017730
         CALL P99_ACC_LINJE(L01_TT);                                    00017740
      END;                                                              00017750
                                                                        00017760
   IF B01.STATUS.ANTALL_BARN (IX)  > 0 THEN                             00017770
      DO;                                                               00017780
         W01_BT_ANT   = B01.STATUS.ANTALL_BARN (IX);                    00017790
         CALL P99_ACC_LINJE(L01_BT_ANT);                                00017800
      END;                                                              00017810
                                                                        00017820
   IF B01.STATUS.DØDSDATO_ÅMD (IX) > 0 THEN                             00017830
      DO;                                                               00017840
         W01_DØD      = B01.STATUS.DØDSDATO_ÅMD (IX);                   00017850
         CALL P99_ACC_LINJE(L01_DØD);                                   00017860
      END;                                                              00017870
                                                                        00017880
   IF B01.STATUS.G_DATO_ÅM (IX)   > 0 THEN                              00017890
      DO;                                                               00017900
         WÅRMND       = B01.STATUS.G_DATO_ÅM (IX);                      00017910
         CALL P99_DATOREVERSE;                                          00017920
         W01_G_DATO   = WMNDÅR;                                         00017930
         CALL P99_ACC_LINJE(L01_G_DATO);                                00017940
      END;                                                              00017950
                                                                        00017960
   IF B01.STATUS.POENGTILLEGG_DATO_ÅM (IX)  > 0 THEN                    00017970
      DO;                                                               00017980
         WÅRMND       = B01.STATUS.POENGTILLEGG_DATO_ÅM (IX);           00017990
         CALL P99_DATOREVERSE;                                          00018000
         W01_P_DATO   = WMNDÅR;                                         00018010
         CALL P99_ACC_LINJE(L01_P_DATO)    ;                            00018020
      END;                                                              00018030
                                                                        00018040
     W01_SUM_KODE = ' ';                                                00018050
     W01_SUM_W    = 0;                                                  00018060
   IF B01.STATUS.SUM_YTELSE (IX)   > 0  THEN                            00018070
      DO;                                                               00018080
         W01_SUM      = B01.STATUS.SUM_YTELSE (IX);                     00018090
         CALL P99_ACC_LINJE(L01_SUM);                                   00018100
         W01_SUM_KODE = 'J';                                            00018110
      END;                                                              00018120
                                                                        00018130
                                                                        00018140
  END P030_STATUS_BEHANDLING     ;                                      00018150
                                                                        00018160
                                                                        00018170
                                                                        00018180
  P030_TILKN_BEHANDLING    : PROC ;                                     00018190
                                                                        00018200
                                                                        00018210
     DO TIL = 1 TO 13;                                                  00018220
                                                                        00018230
        IF B01.TILKN.FNR_TILKN (IX, TIL) > 0 THEN                       00018240
           DO;                                                          00018250
              IF TIL = 1 THEN                                           00018260
                 DO;                                                    00018270
                    W01_TILKN =                                         00018280
                             B01.TILKN.FNR_TILKN (IX, TIL);             00018290
                  /*  SUBSTR(B01.TILKN.FNR_TILKN (IX, TIL),4,  6); */   00018300
                    CALL P99_ACC_LINJE(L01_TILKN)  ;                    00018310
                  END;                                                  00018320
           ELSE                                                         00018330
             IF TIL > 1 THEN                                            00018340
                 DO;                                                    00018350
                    W01_BARN  =                                         00018360
                                B01.TILKN.FNR_TILKN (IX, TIL)  ;        00018370
                   /* SUBSTR(B01.TILKN.FNR_TILKN (IX, TIL),4,  6); */   00018380
                    CALL P99_ACC_LINJE(L01_BARN)    ;                   00018390
                 END;                                                   00018400
           END;                                                         00018410
     END;                                                               00018420
                                                                        00018430
                                                                        00018440
  P030_TILKN_RETURN:                                                    00018450
  END P030_TILKN_BEHANDLING       ;                                     00018460
                                                                        00018470
                                                                        00018480
                                                                        00018490
  P030_ALDERSP_BEHANDLING  : PROC ;                                     00018500
                                                                        00018510
    IF B01.ALDERSP.GP (IX)  > 0 THEN                                    00018520
       DO;                                                              00018530
          W01_APGP         = B01.ALDERSP.GP (IX);                       00018540
          CALL P99_ACC_LINJE(L01_APGP);                                 00018550
       END;                                                             00018560
                                                                        00018570
    IF B01.ALDERSP.ST (IX)  > 0 THEN                                    00018580
       DO;                                                              00018590
          W01_APST         = B01.ALDERSP.ST (IX);                       00018600
          CALL P99_ACC_LINJE(L01_APST);                                 00018610
       END;                                                             00018620
                                                                        00018630
    IF B01.ALDERSP.BT (IX)   > 0 THEN                                   00018640
       DO;                                                              00018650
          W01_APBT         = B01.ALDERSP.BT (IX);                       00018660
          CALL P99_ACC_LINJE(L01_APBT);                                 00018670
       END;                                                             00018680
                                                                        00018690
    IF B01.ALDERSP.KT (IX)  > 0 THEN                                    00018700
       DO;                                                              00018710
          W01_APKT         = B01.ALDERSP.KT (IX);                       00018720
          CALL P99_ACC_LINJE(L01_APKT);                                 00018730
       END;                                                             00018740
                                                                        00018750
    IF B01.ALDERSP.ET (IX)  > 0 THEN                                    00018760
       DO;                                                              00018770
          W01_APET         = B01.ALDERSP.ET (IX);                       00018780
          CALL P99_ACC_LINJE(L01_APET);                                 00018790
       END;                                                             00018800
                                                                        00018810
    IF B01.ALDERSP.TP (IX)  > 0  THEN                                   00018820
       DO;                                                              00018830
          W01_APTP         = B01.ALDERSP.TP (IX);                       00018840
          CALL P99_ACC_LINJE(L01_APTP);                                 00018850
       END;                                                             00018860
                                                                        00018870
  /*    IF W01_SUM_W   > 0  THEN                                        00018880
       DO;                                                              00018890
          W01_SUM  = W01_SUM_W;                                         00018900
          CALL P99_ACC_LINJE(L01_SUM);                                  00018910
       END;                                       */                    00018920
                                                                        00018930
    IF B01.ALDERSP.SPT (IX)   > 0 THEN                                  00018940
       DO;                                                              00018950
          W01_APSPT        = B01.ALDERSP.SPT (IX);                      00018960
          CALL P99_ACC_LINJE(L01_APSPT);                                00018970
       END;                                                             00018980
                                                                        00018990
    IF B01.ALDERSP.OPT (IX)  > 0  THEN                                  00019000
       DO;                                                              00019010
          W01_APOPT        = B01.ALDERSP.OPT (IX);                      00019020
          CALL P99_ACC_LINJE(L01_APOPT);                                00019030
       END;                                                             00019040
                                                                        00019050
    IF B01.ALDERSP.PÅ (IX) > 0 THEN                                     00019060
       DO;                                                              00019070
          W01_APPÅ         = B01.ALDERSP.PÅ (IX);                       00019080
          CALL P99_ACC_LINJE(L01_APPÅ);                                 00019090
       END;                                                             00019100
                                                                        00019110
    IF B01.ALDERSP.APD (IX)  > 0 THEN                                   00019120
       DO;                                                              00019130
          W01_APAPD        = B01.ALDERSP.APD (IX);                      00019140
          CALL P99_ACC_LINJE(L01_APAPD);                                00019150
       END;                                                             00019160
                                                                        00019170
    IF B01.ALDERSP.FAI (IX)  > 0 THEN                                   00019180
       DO;                                                              00019190
          W01_APFAI        = B01.ALDERSP.FAI (IX) * 100;                00019200
          CALL P99_ACC_LINJE(L01_APFAI);                                00019210
       END;                                                             00019220
                                                                        00019230
    IF B01.ALDERSP.KONV_GRAD (IX) > 0 THEN                              00019240
       DO;                                                              00019250
          W01_APKONV_GRAD  = B01.ALDERSP.KONV_GRAD (IX);                00019260
          CALL P99_ACC_LINJE(L01_APKONV_GRAD);                          00019270
       END;                                                             00019280
                                                                        00019290
    IF B01.ALDERSP.TT_VENT (IX)  > 0 THEN                               00019300
       DO;                                                              00019310
          W01_APTTVENT     = B01.ALDERSP.TT_VENT (IX);                  00019320
          CALL P99_ACC_LINJE(L01_APTTVENT);                             00019330
       END;                                                             00019340
                                                                        00019350
    IF B01.ALDERSP.VENTEFAKTOR(IX)  > 0    THEN                         00019360
       DO;                                                              00019370
          W01_APVENTEFAKTOR= B01.ALDERSP.VENTEFAKTOR(IX);               00019380
          CALL P99_ACC_LINJE(L01_APVENTEFAKTOR);                        00019390
                                                                        00019400
          IF B01.ALDERSP.VT_SPT (IX)    > 0  THEN                       00019410
             DO;                                                        00019420
                W01_APVT_SPT     = B01.ALDERSP.VT_SPT (IX);             00019430
                CALL P99_ACC_LINJE(L01_APVT_SPT);                       00019440
             END;                                                       00019450
                                                                        00019460
          IF B01.ALDERSP.VT_OPT (IX)   > 0    THEN                      00019470
             DO;                                                        00019480
                W01_APVT_OPT     = B01.ALDERSP.VT_OPT (IX);             00019490
                CALL P99_ACC_LINJE(L01_APVT_OPT);                       00019500
             END;                                                       00019510
       END;                                                             00019520
                                                                        00019530
    IF B01.ALDERSP.VT_PÅ (IX)  > 0  &                                   00019540
       B01.VENTEFAKTOR   (IX)  > 0      THEN                            00019550
       DO;                                                              00019560
          W01_APVT_PÅ      = B01.ALDERSP.VT_PÅ (IX);                    00019570
          CALL P99_ACC_LINJE(L01_APVT_PÅ);                              00019580
       END;                                                             00019590
                                                                        00019600
                                                                        00019610
  END P030_ALDERSP_BEHANDLING     ;                                     00019620
                                                                        00019630
                                                                        00019640
                                                                        00019650
  P030_UFØRPENS_BEHANDLING  : PROC ;                                    00019660
                                                                        00019670
                                                                        00019680
    IF B01.UFØRPENS.GP (IX)  > 0     THEN                               00019690
       DO;                                                              00019700
          W01_UP_GP        = B01.UFØRPENS.GP (IX);                      00019710
          CALL P99_ACC_LINJE(L01_UP_GP);                                00019720
       END;                                                             00019730
                                                                        00019740
    IF B01.UFØRPENS.ST (IX)  > 0    THEN                                00019750
       DO;                                                              00019760
          W01_UP_ST        = B01.UFØRPENS.ST (IX);                      00019770
          CALL P99_ACC_LINJE(L01_UP_ST);                                00019780
       END;                                                             00019790
                                                                        00019800
    IF B01.UFØRPENS.ÅFT (IX)   > 0 THEN                                 00019810
       DO;                                                              00019820
          W01_UP_ÅFT       = B01.UFØRPENS.ÅFT (IX);                     00019830
          CALL P99_ACC_LINJE(L01_UP_ÅFT);                               00019840
       END;                                                             00019850
                                                                        00019860
    IF B01.UFØRPENS.ET (IX)  > 0  THEN                                  00019870
       DO;                                                              00019880
          W01_UP_ET        = B01.UFØRPENS.ET (IX);                      00019890
          CALL P99_ACC_LINJE(L01_UP_ET);                                00019900
       END;                                                             00019910
                                                                        00019920
    IF B01.UFØRPENS.BT (IX)  > 0   THEN                                 00019930
       DO;                                                              00019940
          W01_UP_BT        = B01.UFØRPENS.BT (IX);                      00019950
          CALL P99_ACC_LINJE(L01_UP_BT);                                00019960
       END;                                                             00019970
                                                                        00019980
    IF B01.UFØRPENS.KT (IX)  > 0 THEN                                   00019990
       DO;                                                              00020000
          W01_UP_KT        = B01.UFØRPENS.KT (IX);                      00020010
          CALL P99_ACC_LINJE(L01_UP_KT);                                00020020
       END;                                                             00020030
                                                                        00020040
    IF B01.UFØRPENS.TP (IX)  > 0 THEN                                   00020050
       DO;                                                              00020060
          W01_UP_TP        = B01.UFØRPENS.TP (IX);                      00020070
          CALL P99_ACC_LINJE(L01_UP_TP);                                00020080
       END;                                                             00020090
                                                                        00020100
    IF B01.STATUS.VILKÅR_8_4_3A (IX)  > ' '  THEN                       00020110
       DO;                                                              00020120
         IF B01.STATUS.VILKÅR_8_4_3A (IX) = 'J'  THEN    DO;            00020130
                   W01_UP_8_4_3A    = 'JA  ';                           00020140
         END;                                                           00020150
         ELSE                                                           00020160
         IF B01.STATUS.VILKÅR_8_4_3A (IX) = 'N'  THEN    DO;            00020170
                   W01_UP_8_4_3A    = 'NEI ';                           00020180
         END;                                                           00020190
         ELSE DO;                                                       00020200
                   W01_UP_8_4_3A    = 'FEIL';                           00020210
         END;                                                           00020220
          CALL P99_ACC_LINJE(L01_UP_8_4_3A);                            00020230
    END;                                                                00020240
                                                                        00020250
    IF B01.UFØRPENS.SPT (IX)  > 0 THEN                                  00020260
       DO;                                                              00020270
          W01_UP_SPT       = B01.UFØRPENS.SPT (IX);                     00020280
          CALL P99_ACC_LINJE(L01_UP_SPT);                               00020290
       END;                                                             00020300
                                                                        00020310
    IF B01.UFØRPENS.OPT (IX)  > 0 THEN                                  00020320
       DO;                                                              00020330
            W01_UP_OPT       = B01.UFØRPENS.OPT (IX);                   00020340
            CALL P99_ACC_LINJE(L01_UP_OPT);                             00020350
       END;                                                             00020360
                                                                        00020370
    IF B01.UFØRPENS.PÅ (IX)  > 0 THEN                                   00020380
       DO;                                                              00020390
          W01_UP_PÅ        = B01.UFØRPENS.PÅ (IX);                      00020400
          CALL P99_ACC_LINJE(L01_UP_PÅ);                                00020410
       END;                                                             00020420
                                                                        00020430
                                                                        00020440
  END P030_UFØRPENS_BEHANDLING     ;                                    00020450
                                                                        00020460
                                                                        00020470
                                                                        00020480
  P030_UFØRHIST_BEHANDLING  : PROC ;                                    00020490
                                                                        00020500
      DO  UHIST = 1 TO 7;                                               00020510
                                                                        00020520
         IF B01.UFØRHIST.UFT_ÅM (IX, UHIST) > 0 THEN                    00020530
            DO;                                                         00020540
                                                                        00020550
               WÅRMND    =   B01.UFØRHIST.UFT_ÅM(IX, UHIST) ;           00020560
               CALL P99_DATOREVERSE;                                    00020570
               W01_UFØRHIST_UFT_ÅM =  WMNDÅR;                           00020580
               CALL P99_ACC_LINJE(L01_UFØRHIST_UFT_ÅM);                 00020590
                                                                        00020600
                                                                        00020610
               IF B01.UFØRHIST.UFG(IX, UHIST)  > 0 THEN                 00020620
                  DO;                                                   00020630
                     W01_UFØRHIST_UFG =  B01.UFØRHIST.UFG(IX, UHIST) ;  00020640
                     CALL P99_ACC_LINJE(L01_UFØRHIST_UFG);              00020650
                  END;                                                  00020660
                                                                        00020670
                                                                        00020680
               IF B01.UFØRHIST.BUP(IX, UHIST)  > 0     THEN             00020690
                  DO;                                                   00020700
                     W01_UFØRHIST_BUP = B01.UFØRHIST.BUP(IX, UHIST);    00020710
                     CALL P99_ACC_LINJE(L01_UFØRHIST_BUP);              00020720
                  END;                                                  00020730
                                                                        00020740
  /*YS*/      IF B01.UFØRHIST.UFKRITERIER (IX, UHIST)  > 0  THEN        00020750
                  DO;                                                   00020760
                     W01_UFØRHIST_UFKRITE   = 'JA ';                    00020770
                     CALL P99_ACC_LINJE(L01_UFØRHIST_UFKRTERIER);       00020780
                  END;                                                  00020790
               ELSE                                                     00020800
                                                                        00020810
                  DO;                                                   00020820
                     W01_UFØRHIST_UFKRITE   = 'NEI';                    00020830
                     CALL P99_ACC_LINJE(L01_UFØRHIST_UFKRTERIER);       00020840
                  END;                                                  00020850
                                                                        00020860
                                                                        00020870
                                                                        00020880
               IF B01.UFØRHIST.OPPHØRSDATO_ÅM(IX, UHIST)  > 0 THEN      00020890
                  DO;                                                   00020900
                     WÅRMND =                                           00020910
                             B01.UFØRHIST.OPPHØRSDATO_ÅM(IX, UHIST);    00020920
                     CALL P99_DATOREVERSE;                              00020930
                     W01_UFØRHIST_OPPH_ÅM =  WMNDÅR;                    00020940
                     CALL P99_ACC_LINJE(L01_UFØRHIST_OPPH_ÅM);          00020950
                  END;                                                  00020960
                                                                        00020970
            END;                                                        00020980
                                                                        00020990
      END;                                                              00021000
                                                                        00021010
                                                                        00021020
  END P030_UFØRHIST_BEHANDLING  ;                                       00021030
                                                                        00021040
                                                                        00021050
                                                                        00021060
  P030_ETTEPENS_BEHANDLING  : PROC ;                                    00021070
                                                                        00021080
    IF B01.ETTEPENS.GP_BRUTTO (IX)  > 0 THEN                            00021090
        DO;                                                             00021100
            W01_ET_GP_BRUTTO    = B01.ETTEPENS.GP_BRUTTO (IX);          00021110
            CALL P99_ACC_LINJE(L01_ET_GP_BRUTTO);                       00021120
        END;                                                            00021130
                                                                        00021140
     IF B01.ETTEPENS.GP_NETTO (IX)  > 0 THEN                            00021150
        DO;                                                             00021160
            W01_ET_GP_NETTO     = B01.ETTEPENS.GP_NETTO (IX);           00021170
            CALL P99_ACC_LINJE(L01_ET_GP_NETTO);                        00021180
        END;                                                            00021190
                                                                        00021200
     IF B01.ETTEPENS.ST (IX)   > 0 THEN                                 00021210
        DO;                                                             00021220
            W01_ET_ST           = B01.ETTEPENS.ST (IX);                 00021230
            CALL P99_ACC_LINJE(L01_ET_ST);                              00021240
        END;                                                            00021250
                                                                        00021260
     IF B01.ETTEPENS.KT (IX)   > 0 THEN                                 00021270
        DO;                                                             00021280
            W01_ET_KT           = B01.ETTEPENS.KT (IX);                 00021290
            CALL P99_ACC_LINJE(L01_ET_KT);                              00021300
        END;                                                            00021310
                                                                        00021320
     IF B01.ETTEPENS.TP_BRUTTO (IX)  > 0 THEN                           00021330
        DO;                                                             00021340
            W01_ET_TP_BRUTTO    = B01.ETTEPENS.TP_BRUTTO (IX);          00021350
            CALL P99_ACC_LINJE(L01_ET_TP_BRUTTO);                       00021360
        END;                                                            00021370
                                                                        00021380
     IF B01.ETTEPENS.TP_NETTO (IX)  > 0 THEN                            00021390
        DO;                                                             00021400
            W01_ET_TP_NETTO     = B01.ETTEPENS.TP_NETTO (IX);           00021410
            CALL P99_ACC_LINJE(L01_ET_TP_NETTO);                        00021420
        END;                                                            00021430
                                                                        00021440
      IF B01.ETTEPENS.SPT_AVD (IX)  > 0 THEN                            00021450
         DO;                                                            00021460
            W01_ET_SPT_AVD      = B01.ETTEPENS.SPT_AVD (IX);            00021470
            CALL P99_ACC_LINJE(L01_ET_SPT_AVD);                         00021480
         END;                                                           00021490
                                                                        00021500
      IF B01.ETTEPENS.OPT_AVD (IX)  > 0 THEN                            00021510
         DO;                                                            00021520
            W01_ET_OPT_AVD      = B01.ETTEPENS.OPT_AVD (IX);            00021530
            CALL P99_ACC_LINJE(L01_ET_OPT_AVD);                         00021540
         END;                                                           00021550
                                                                        00021560
      IF B01.ETTEPENS.PÅ_AVD  (IX)   > 0 THEN                           00021570
         DO;                                                            00021580
            W01_PÅ_AVD          = B01.ETTEPENS.PÅ_AVD  (IX);            00021590
            CALL P99_ACC_LINJE(L01_ET_PÅ_AVD);                          00021600
         END;                                                           00021610
                                                                        00021620
      IF B01.ETTEPENS.TP_PROSENT (IX)  > 0 THEN                         00021630
         DO;                                                            00021640
            W01_TP_PROSENT      = B01.ETTEPENS.TP_PROSENT (IX);         00021650
            CALL P99_ACC_LINJE(L01_ET_TP_PROSENT);                      00021660
         END;                                                           00021670
                                                                        00021680
      IF B01.ETTEPENS.FORVENTET (IX)  > 0 THEN                          00021690
         DO;                                                            00021700
            W01_FORVENTET       = B01.ETTEPENS.FORVENTET (IX);          00021710
            CALL P99_ACC_LINJE(L01_ET_FORVENTET);                       00021720
         END;                                                           00021730
                                                                        00021740
      IF B01.ETTEPENS.FRAMLEGGSDATO_ÅM (IX)  >  0  THEN                 00021750
         DO;                                                            00021760
           W01_FRAMLEGGSDATO  =  B01.ETTEPENS.FRAMLEGGSDATO_ÅM (IX);    00021770
           CALL P99_ACC_LINJE(L01_ET_FRAMLEGGSDATO);                    00021780
         END;                                                           00021790
                                                                        00021800
      IF B01.ETTEPENS.FRAMLEGGSKODE (IX)  > ' ' THEN                    00021810
         DO;                                                            00021820
           IF B01.ETTEPENS.FRAMLEGGSKODE (IX)  = 'A' THEN               00021830
              W01_FRAMLEGGSKODE   = 'REVISJON AV SAKEN';                00021840
           ELSE                                                         00021850
              W01_FRAMLEGGSKODE   = 'OPPFØRT          ';                00021860
            CALL P99_ACC_LINJE(L01_ET_FRAMLEGG);                        00021870
         END;                                                           00021880
                                                                        00021890
                                                                        00021900
  END P030_ETTEPENS_BEHANDLING    ;                                     00021910
                                                                        00021920
                                                                        00021930
                                                                        00021940
  P030_ETTEBARN_BEHANDLING  : PROC ;                                    00021950
                                                                        00021960
      IF B01.ETTEBARN.PENSJON_ETTER (IX)  > ' ' THEN                    00021970
         DO;                                                            00021980
           IF B01.ETTEBARN.PENSJON_ETTER (IX)  = 'M' THEN               00021990
              W01_PENSJON         = 'MOR';                              00022000
           ELSE                                                         00022010
              W01_PENSJON         = 'FAR';                              00022020
                                                                        00022030
            CALL P99_ACC_LINJE(L01_BP_PENSJON);                         00022040
         END;                                                           00022050
                                                                        00022060
                                                                        00022070
      IF B01.ETTEBARN.GP (IX)  > 0 THEN                                 00022080
         DO;                                                            00022090
            W01_BP_GP           = B01.ETTEBARN.GP (IX);                 00022100
            CALL P99_ACC_LINJE(L01_BP_GP);                              00022110
         END;                                                           00022120
                                                                        00022130
      IF B01.ETTEBARN.TP  (IX)  > 0 THEN                                00022140
         DO;                                                            00022150
            W01_BP_TP           = B01.ETTEBARN.TP  (IX);                00022160
            CALL P99_ACC_LINJE(L01_BP_TP);                              00022170
         END;                                                           00022180
                                                                        00022190
      IF B01.ETTEBARN.ST  (IX)  > 0 THEN                                00022200
         DO;                                                            00022210
            W01_BP_ST           = B01.ETTEBARN.ST  (IX);                00022220
            CALL P99_ACC_LINJE(L01_BP_ST);                              00022230
         END;                                                           00022240
                                                                        00022250
      IF B01.ETTEBARN.KT  (IX)  > 0 THEN                                00022260
        DO;                                                             00022270
            W01_BP_KT           = B01.ETTEBARN.KT  (IX);                00022280
            CALL P99_ACC_LINJE(L01_BP_KT);                              00022290
        END;                                                            00022300
                                                                        00022310
      IF B01.ETTEBARN.SPT_MOR (IX) > 0 THEN                             00022320
         DO;                                                            00022330
            W01_BP_SPT_MOR      = B01.ETTEBARN.SPT_MOR (IX);            00022340
            CALL P99_ACC_LINJE(L01_BP_SPT_MOR);                         00022350
         END;                                                           00022360
                                                                        00022370
      IF B01.ETTEBARN.OPT_MOR (IX)  > 0 THEN                            00022380
         DO;                                                            00022390
            W01_BP_OPT_MOR      = B01.ETTEBARN.OPT_MOR (IX);            00022400
            CALL P99_ACC_LINJE(L01_BP_OPT_MOR);                         00022410
         END;                                                           00022420
                                                                        00022430
      IF B01.ETTEBARN.PÅ_MOR  (IX)  > 0 THEN                            00022440
         DO;                                                            00022450
            W01_BP_PÅ_MOR       = B01.ETTEBARN.PÅ_MOR  (IX);            00022460
            CALL P99_ACC_LINJE(L01_BP_PÅ_MOR);                          00022470
         END;                                                           00022480
                                                                        00022490
      IF B01.ETTEBARN.SPT_FAR (IX) > 0 THEN                             00022500
         DO;                                                            00022510
            W01_BP_SPT_FAR      = B01.ETTEBARN.SPT_FAR (IX);            00022520
            CALL P99_ACC_LINJE(L01_BP_SPT_FAR);                         00022530
         END;                                                           00022540
                                                                        00022550
      IF B01.ETTEBARN.OPT_FAR (IX) > 0 THEN                             00022560
         DO;                                                            00022570
            W01_BP_OPT_FAR      = B01.ETTEBARN.OPT_FAR (IX);            00022580
            CALL P99_ACC_LINJE(L01_BP_OPT_FAR);                         00022590
         END;                                                           00022600
                                                                        00022610
      IF B01.ETTEBARN.PÅ_FAR  (IX)  > 0 THEN                            00022620
         DO;                                                            00022630
            W01_BP_PÅ_FAR       = B01.ETTEBARN.PÅ_FAR  (IX);            00022640
            CALL P99_ACC_LINJE(L01_BP_PÅ_FAR);                          00022650
         END;                                                           00022660
                                                                        00022670
                                                                        00022680
  END P030_ETTEBARN_BEHANDLING     ;                                    00022690
                                                                        00022700
                                                                        00022710
                                                                        00022720
  P030_END_REC :  PROC ;                                                00022730
                                                                        00022740
            CALL P99_ACC_LINJE(L01_END) ;        /* LAST REC   */       00022750
                                                                        00022760
                                                                        00022770
  END P030_END_REC ;                                                    00022780
                                                                        00022790
                                                                        00022800
  P200_DRAMMEN_PRINT: PROC;                                             00022810
                                                                        00022820
      DATO_M  = DATE;                                                   00022830
      DAG     = DAG_M;                                                  00022840
      MND     = MND_M;                                                  00022850
      ÅR      = ÅR_M;                                                   00022860
      FS_SIDE = 0 ;                                                     00022870
      S_SIDE = 2;                                                       00022880
                                                                        00022890
                                                                        00022900
      EXEC CICS ROUTE LIST (CHARLIST2);                                 00022910
                                                                        00022920
      CALL SEND_HEADING;                                                00022930
                                                                        00022940
                                                                        00022950
    /* *   MOVING DATA FRAM  WORKING OMR TO PRINT-LINJE BUFFER  */      00022960
                                                                        00022970
   /* LINJETELLER = 10;      */                                         00022980
                                                                        00022990
      DO PL = 1 TO ACC_SIDE;                                            00023000
         DO LIND = 1 TO 20   ;                                          00023010
                                                                        00023020
        AYY_LINE =  ACC_LINJE  (PL, LIND);                              00023030
                                                                        00023040
        IF T_END = '   '   THEN                                         00023050
           DO;                                                          00023060
              PL = ACC_SIDE;                                            00023070
              LIND = 20;                                                00023080
           END;                                                         00023090
                                                                        00023100
       ELSE DO;                                                         00023110
                                                                        00023120
              PRI_LINJE   = ACC_LINJE (PL, LIND);                       00023130
                                                                        00023140
              CALL SEND_UTLINJE( PRI_LINJE);                            00023150
              LINJETELLER = LINJETELLER + 1;                            00023160
              IF LINJETELLER > 73   THEN                                00023170
                 DO;                                                    00023180
                   CALL SEND_HEADING;                                   00023190
              END;                                                      00023200
            END;                                                        00023210
                                                                        00023220
                                                                        00023230
         END;                                                           00023240
      END;                                                              00023250
   /* EXEC CICS ENTER TRACEID(02) FROM (LINJETELLER);  */               00023260
                                                                        00023270
                                                                        00023280
      IF W01_SUM_KODE = 'J' THEN                                        00023290
         CALL SKRIV_BOND_TESKT;                                         00023300
                                                                        00023310
      ANT_GANGER =   73 - LINJETELLER;                                  00023320
      CALL SEND_BLANKLINJE(ANT_GANGER);                                 00023330
                                                                        00023340
                                                                        00023350
  END P200_DRAMMEN_PRINT;                                               00023360
                                                                        00023370
                                                                        00023380
  P210_DRIFT_PRINT: PROC;                                               00023390
                                                                        00023400
      DATO_M  = DATE;                                                   00023410
      DAG     = DAG_M;                                                  00023420
      MND     = MND_M;                                                  00023430
      ÅR      = ÅR_M;                                                   00023440
      FS_SIDE = 0 ;                                                     00023450
                                                                        00023460
                                                                        00023470
      CALL DF_DRIFT_HEAD;                                               00023480
                                                                        00023490
      DO PL = 1 TO ACC_SIDE;                                            00023500
         DO LIND = 1 TO 20   ;                                          00023510
                                                                        00023520
         AYY_LINE =  ACC_LINJE  (PL, LIND);                             00023530
                                                                        00023540
        IF T_END = '   '   THEN                                         00023550
           DO;                                                          00023560
              PL = ACC_SIDE;                                            00023570
              LIND = 20;                                                00023580
           END;                                                         00023590
                                                                        00023600
        ELSE DO;                                                        00023610
               DF_TEKST = '';                                           00023620
                                                                        00023630
               DF_TEKST = ACC_LINJE(PL, LIND);                          00023640
               DF_CC = ' ';                                             00023650
                                                                        00023660
               EXEC CICS WRITE FROM(DF_PRINT_LINE)                      00023670
                               DATASET('PRINTRX')                       00023680
                               RIDFLD(PRI_RBA)                          00023690
                               RBA;                                     00023700
                                                                        00023710
              DF_LINE = DF_LINE + 1;                                    00023720
              IF DF_LINE > 50   THEN                                    00023730
                 DO;                                                    00023740
                   CALL DF_DRIFT_HEAD;                                  00023750
                 END;                                                   00023760
             END;                                                       00023770
                                                                        00023780
                                                                        00023790
         END;                                                           00023800
      END;                                                              00023810
                                                                        00023820
                                                                        00023830
  END P210_DRIFT_PRINT;                                                 00023840
                                                                        00023850
  DF_DRIFT_HEAD: PROC;                                                  00023860
                                                                        00023870
      DF_LINE = 1;                                                      00023880
      DF_COMD = '';                                                     00023890
                                                                        00023900
      IF  FS_SIDE = 0  THEN                                             00023910
          DO;                                                           00023920
             DF_COMD = '';                                              00023930
             DF_COMD = '  DJDE  FORMS=AAFRM1,END;               ' !!    00023940
                        '                                      ';       00023950
             CALL DF_DRIFT_SKRIV;                                       00023960
             FS_SIDE = 1;                                               00023970
         END;                                                           00023980
                                                                        00023990
             DF_COMD = '';                                              00024000
                                                                        00024010
             DF_CC = '&';                                               00024020
             DF_LINE = DF_LINE + 1;                                     00024030
             CALL DF_DRIFT_SKRIV;                                       00024040
             DF_COMD = '';                                              00024050
                                                                        00024060
             DF_PCC = '1';                                              00024070
             DO DR = 1 TO 10;                                           00024080
               CALL DF_DRIFT_SKRIV;                                     00024090
               DF_PCC = ' ';                                            00024100
               DF_LINE = DF_LINE + 1;                                   00024110
             END;                                                       00024120
                                                                        00024130
                                                                        00024140
      DF_COMD= '';                                                      00024150
                                                                        00024160
  END DF_DRIFT_HEAD;                                                    00024170
                                                                        00024180
  SKRIV_BOND_TESKT: PROC;                                               00024190
                                                                        00024200
      ANT_GANGER =  2;                                                  00024210
      CALL SEND_BLANKLINJE(ANT_GANGER);                                 00024220
                                                                        00024230
      LINJETELLER = LINJETELLER + 8;                                    00024240
      IF LINJETELLER > 73   THEN                                        00024250
         DO;                                                            00024260
           CALL SEND_HEADING;                                           00024270
         END;                                                           00024280
                                                                        00024290
      DO TT = 1 TO 6;                                                   00024300
         PRI_LINJE = BOND_TESKT (TT);                                   00024310
                                                                        00024320
         CALL SEND_UTLINJE( PRI_LINJE);                                 00024330
      END;                                                              00024340
                                                                        00024350
  END SKRIV_BOND_TESKT;                                                 00024360
  DF_DRIFT_SKRIV: PROC;                                                 00024370
      EXEC CICS WRITE FROM(DF_PRINT_LINE)                               00024380
                      DATASET('PRINTRX')                                00024390
                      RIDFLD(PRI_RBA)                                   00024400
                      RBA;                                              00024410
  END DF_DRIFT_SKRIV;                                                   00024420
                                                                        00024430
  P060_TILBAKE: PROC;                                                   00024440
                                                                        00024450
     IF  MAP_SIDE > 1 THEN                                              00024460
        DO;                                                             00024470
           MAP_SIDE = MAP_SIDE - 1;                                     00024480
        END;                                                            00024490
      ELSE                                                              00024500
        DO;                                                             00024510
                                                                        00024520
           MAP_MELDING = 'DETTE ER FØRST SIDE      ';                   00024530
           FEILMELDING_SATT   = '1'B;                                   00024540
        END;                                                            00024550
                                                                        00024560
  END P060_TILBAKE;                                                     00024570
                                                                        00024580
  P070_NESTESIDE: PROC;                                                 00024590
                                                                        00024600
                                                                        00024610
     FEILMELDING_SATT   = '0'B;                                         00024620
     MAP_SIDE = MAP_SIDE + 1;                                           00024630
     IF MAP_SIDE > ACC_SIDE THEN                                        00024640
        DO;                                                             00024650
           MAP_MELDING = 'HAR IKKE MERE INFORMASJON';                   00024660
           FEILMELDING_SATT   = '1'B;                                   00024670
           MAP_SIDE = ACC_SIDE;                                         00024680
                                                                        00024690
        END;                                                            00024700
                                                                        00024710
                                                                        00024720
  END P070_NESTESIDE;                                                   00024730
                                                                        00024740
                                                                        00024750
  P090_SEND_BILDE: PROC;                                                00024760
                                                                        00024770
    /* *  TOMMING AV SKJERM   *  */                                     00024780
                                                                        00024790
         DO PL = 1 TO 20;                                               00024800
            S001A43O.STEKSTO(PL) =  '';                                 00024810
            S001A43I.STEKSTI(PL) =  '';                                 00024820
         END;                                                           00024830
                                                                        00024840
                                                                        00024850
    /* *   MOVING DATA FRAM  WORKING OMR TO SCREEN *  */                00024860
                                                                        00024870
      PP    = MAP_SIDE;                                                 00024880
                                                                        00024890
      DO PL = 1 TO 20;                                                  00024900
                                                                        00024910
        AYY_LINE =  ACC_LINJE  (PP, PL);                                00024920
                                                                        00024930
        IF T_END ^= '   '   THEN                                        00024940
           DO;                                                          00024950
           S001A43O.STEKSTO (PL)  = ACC_LINJE (PP, PL);                 00024960
           S001A43I.STEKSTI (PL)  = ACC_LINJE (PP, PL);                 00024970
           END;                                                         00024980
        ELSE DO;                                                        00024990
           PL = 20;                                                     00025000
                                                                        00025010
           END;                                                         00025020
      END;                                                              00025030
                                                                        00025040
                                                                        00025050
        S001A43I.AKSJONI  = AKSJONSKODE;                                00025060
        S001A43O.AKSJONO  = AKSJONSKODE;                                00025070
        S001A43I.AKSJONL  =  CURSOR_POS;       /* CURSOR POS */         00025080
        EXEC CICS SEND MAP('S001A43') MAPSET('S001A43')                 00025090
               CURSOR  DATAONLY;                                        00025100
   /*      FROM (S001A43O) CURSOR;                */                    00025110
                                                                        00025120
  END P090_SEND_BILDE;                                                  00025130
                                                                        00025140
                                                                        00025150
                                                                        00025160
                                                                        00025170
  P091_BLANKING_RUTIN:  PROC;                                           00025180
                                                                        00025190
      DO BLANK_P = 1 TO 4;                                              00025200
         DO BLANK_L = 1 TO 20;                                          00025210
                                                                        00025220
            ACC_LINJE (BLANK_P, BLANK_L)  =  '';                        00025230
         END;                                                           00025240
      END;                                                              00025250
                                                                        00025260
  END P091_BLANKING_RUTIN  ;                                            00025270
                                                                        00025280
                                                                        00025290
                                                                        00025300
                                                                        00025310
  P99_ACC_LINJE: PROC (P99_OMRD);                                       00025320
                                                                        00025330
                                                                        00025340
      DCL     P99_OMRD       CHAR (80),                                 00025350
              P99_DATA   DEF (P99_OMRD)  CHAR(25) POS(42);              00025360
                                                                        00025370
                                                                        00025380
              IF P99_DATA ^= ' ' THEN                                   00025390
                                                                        00025400
                 DO;                                                    00025410
                                                                        00025420
   /* * BUFFER FOR SCREEN                           */                  00025430
                                                                        00025440
                    ACC_LINJE (ACC_SIDE, LIND) = P99_OMRD;              00025450
                    LIND = LIND + 1;                                    00025460
                    IF LIND > 20 THEN DO;                               00025470
                       ACC_SIDE = ACC_SIDE + 1;                         00025480
                       LIND = 1;                                        00025490
                    END;                                                00025500
                    IF ACC_SIDE > 4  THEN ACC_SIDE = 4;                 00025510
                                                                        00025520
                    P99_DATA = '';                                      00025530
                                                                        00025540
                 END;                                                   00025550
                                                                        00025560
                                                                        00025570
  END P99_ACC_LINJE;                                                    00025580
                                                                        00025590
                                                                        00025600
  P110_FEILMELD: PROC;                                                  00025610
                                                                        00025620
        S001A43O.AKSJONO  = AKSJONSKODE;                                00025630
        S001A43I.AKSJONL   = CURSOR_POS;                                00025640
        S001A43O.AKSJONA   = 'I';                                       00025650
        S001A43O.MELDINGO  =  MAP_MELDING;                              00025660
                                                                        00025670
                                                                        00025680
        EXEC CICS SEND MAP  ('S001A43')  MAPSET('S001A43')              00025690
                                         CURSOR DATAONLY  ;             00025700
                                                                        00025710
                                                                        00025720
        FEILMELDING_SATT = '0'B;                                        00025730
        S001A43O.MELDINGO  =  '';                                       00025740
                                                                        00025750
  END P110_FEILMELD;                                                    00025760
                                                                        00025770
                                                                        00025780
                                                                        00025790
  SEND_HEADING: PROC;                                                   00025800
                                                                        00025810
                                                                        00025820
      IF FS_SIDE = 1 THEN                                               00025830
         DO;                                                            00025840
            ANT_GANGER = 6;                                             00025850
             CALL SEND_BLANKLINJE(ANT_GANGER);                          00025860
      /*     DR_SIDENR = DR_SIDENR + 1;            */                   00025870
      UTLINJE = '                                        ' !!           00025880
                '                 SIDE NR.   ' !! S_SIDE !!'  ';        00025890
      EXEC CICS SEND TEXT FROM(UTLINJE)  ACCUM PAGING L80 PRINT         00025900
                                       ERASE;                           00025910
      END;                                                              00025920
                                                                        00025930
      ANT_GANGER = 3;                                                   00025940
      CALL SEND_BLANKLINJE(ANT_GANGER);                                 00025950
                                                                        00025960
      UTLINJE = '        UTSKRIFT FRA RIKSTRYGDEVERKETS  ' !!           00025970
                'FOLKETRYGDREGISTER                    ';               00025980
                                                                        00025990
      EXEC CICS SEND TEXT FROM(UTLINJE)  ACCUM PAGING L80 PRINT         00026000
                                       ERASE;                           00026010
                                                                        00026020
                                                                        00026030
                                                                        00026040
      ANT_GANGER = 1;                                                   00026050
      CALL SEND_BLANKLINJE(ANT_GANGER);                                 00026060
                                                                        00026070
      UTLINJE = '                                        ' !!           00026080
                '                      DATO: ' !! DATO !! '  ';         00026090
                                                                        00026100
                                                                        00026110
      EXEC CICS SEND TEXT FROM(UTLINJE)  ACCUM PAGING L80 PRINT         00026120
                                              ERASE;                    00026130
      LINJETELLER = 10;                                                 00026140
      IF FS_SIDE = 1 THEN                                               00026150
         DO;                                                            00026160
            ANT_GANGER = 1;                                             00026170
            CALL SEND_BLANKLINJE(ANT_GANGER);                           00026180
            PRI_LINJE   = ACC_LINJE (1, 1);                             00026190
                                                                        00026200
            CALL SEND_UTLINJE( PRI_LINJE);                              00026210
            ANT_GANGER = 2;                                             00026220
            CALL SEND_BLANKLINJE(ANT_GANGER);                           00026230
             LINJETELLER = 15;                                          00026240
      END;                                                              00026250
                                                                        00026260
      ANT_GANGER = 3;                                                   00026270
      CALL SEND_BLANKLINJE(ANT_GANGER);                                 00026280
      FS_SIDE = 1 ;                                                     00026290
                                                                        00026300
  END SEND_HEADING;                                                     00026310
                                                                        00026320
  SEND_BLANKLINJE:  PROC(BI);                                           00026330
                                                                        00026340
   DCL BLANKLINJE       CHAR(78);                                       00026350
   DCL BI    PIC '99';                                                  00026360
   DCL BJ    PIC '99';                                                  00026370
                                                                        00026380
       DO BJ = 1 TO BI;                                                 00026390
                                                                        00026400
       BLANKLINJE = '                                        ' !!       00026410
                    '                                      ';           00026420
       EXEC CICS SEND TEXT FROM(BLANKLINJE)  ACCUM PAGING L80           00026430
                                        PRINT  ERASE;                   00026440
       END;                                                             00026450
  END SEND_BLANKLINJE;                                                  00026460
                                                                        00026470
  SEND_UTLINJE: PROC(SLINJE);                                           00026480
                                                                        00026490
   DCL  SLINJE CHAR(78);                                                00026500
                                                                        00026510
        EXEC CICS SEND TEXT FROM(SLINJE)  ACCUM PAGING L80              00026520
                                               PRINT  ERASE;            00026530
                                                                        00026540
        SLINJE = BLK_LINJE;                                             00026550
                                                                        00026560
  END SEND_UTLINJE;                                                     00026570
                                                                        00026580
                                                                        00026590
  P99_DATOREVERSE:  PROC;                                               00026600
                                                                        00026610
        WMNDÅR_DEF.WÅR     =  WÅRMND_DEF.WÅR;                           00026620
        WMNDÅR_DEF.WMND    =  WÅRMND_DEF.WMND;                          00026630
                                                                        00026640
  END P99_DATOREVERSE;                                                  00026650
                                                                        00026660
                                                                        00026670
 /*******      KALKULASJON AV P-POENG  *********************/           00026680
  P0301_INNTEKTS_P_POENG: PROC;                                         00026690
                                                                        00026700
                                                                        00026710
                                                                        00026720
  /*   IF NESTE_ÅR ^= W01_PINT_UT.W02_PI_ÅR THEN                        00026730
          DO;                                                 */        00026740
             /* SETTE INN I HJELPEVARIABLE FOR Å HENTE POENG  */        00026750
             FIXED_DEC9 = B01.PINNTEKT.PI(IX,IÅR) *    100;             00026760
             FIXED_BIN15 = IÅR;                                         00026770
             FIXED_DEC3 = 0;                                            00026780
             MAX_UFGO = 0;                                              00026790
                                                                        00026800
             CALL MAX_UFG (IÅR,FIXED_DEC3,MAX_UFGO);                    00026810
                                                                        00026820
                                                                        00026830
             FIXED_DEC5_4 = F_INNTEKT_POENG(FIXED_DEC9,FIXED_BIN15,     00026840
                            GV_TAB_ARRAY.G_V(IÅR),FIXED_DEC3);          00026850
                                                                        00026860
             FIXED_DEC5_4 = FIXED_DEC5_4 + 0.005;     /* FORHØYNING */  00026870
             W01_P_POENG  = FIXED_DEC5_4;                               00026880
                                                                        00026890
     /*   END;        */                                                00026900
                                                                        00026910
                                                                        00026920
                                                                        00026930
   END P0301_INNTEKTS_P_POENG;                                          00026940
                                                                        00026950
                                                                        00026960
                                                                        00026970
                                                                        00026980
   MAX_UFG:                                                             00026990
     PROC(INNT_ÅR,UFG_TIL_POENG,MAX_UFGX);                              00027000
       DCL                                                              00027010
         INNT_ÅR       PIC'99'  UNAL,                                   00027020
         MAX_UFGX      PIC'ZZZ' UNAL,                                   00027030
         UFG_TIL_POENG FIXED DEC(3),                                    00027040
         UFT_ÅM        PIC'(4)9',                                       00027050
         OPPH_ÅM       PIC'(4)9',                                       00027060
         UFT_Å         PIC'(2)9' DEF UFT_ÅM  POS(1),                    00027070
         UFT_M         PIC'(2)9' DEF UFT_ÅM  POS(3),                    00027080
         OPPH_Å        PIC'(2)9' DEF OPPH_ÅM POS(1),                    00027090
         OPPH_M        PIC'(2)9' DEF OPPH_ÅM POS(3);/*30.10.85 HL*/     00027100
                                                                        00027110
       MAX_UFGX      = 0;                                               00027120
       UFG_TIL_POENG = 999;                                             00027130
                                                                        00027140
       DO INDEX_1 = 1 TO 7 WHILE(B01.UFØRHIST.UFT_ÅM                    00027150
                                (IX,INDEX_1) > 0);                      00027160
         UFT_ÅM  = B01.UFØRHIST.UFT_ÅM        (IX,INDEX_1);             00027170
         OPPH_ÅM = B01.UFØRHIST.OPPHØRSDATO_ÅM(IX,INDEX_1);             00027180
                                                                        00027190
 /* ENDRING 30.10.85 HL - FEILRAPP 267                             */   00027200
                                                                        00027210
            IF OPPH_M = 1          THEN                                 00027220
               OPPH_Å = OPPH_Å - 1;                                     00027230
                                                                        00027240
 /* HIT 30.10.85                                                   */   00027250
                                                                        00027260
         IF UFT_Å = INNT_ÅR ! INNT_ÅR = OPPH_Å THEN                     00027270
            UFG_TIL_POENG = 0;                                          00027280
                                                                        00027290
         IF (UFT_Å <= INNT_ÅR) & (OPPH_Å = 0 ! INNT_ÅR <= OPPH_Å) THEN  00027300
                                                                        00027310
           DO;                                                          00027320
             IF MAX_UFGX < B01.UFØRHIST.UFG(IX,INDEX_1) THEN            00027330
               MAX_UFGX = B01.UFØRHIST.UFG(IX,INDEX_1);                 00027340
             DO INDEX_2 = 1 TO 7 WHILE(B01.UFØRHIST.UFØRGRAD.           00027350
                          UFG_DATO_ÅM(IX,INDEX_1,INDEX_2) > 0);         00027360
               UFT_ÅM  = B01.UFØRHIST.UFØRGRAD.UFG_DATO_ÅM              00027370
                                     (IX,INDEX_1,INDEX_2);              00027380
                                                                        00027390
               IF UFT_Å < INNT_ÅR              !                        00027400
                (UFT_M = 1 & UFT_Å = INNT_ÅR)  !                        00027410
                (UFT_Å = INNT_ÅR & B01.UFØRHIST.UFØRGRAD.UFG_ØVRIGE     00027420
                         (IX,INDEX_1,INDEX_2) > MAX_UFGX) THEN          00027430
                MAX_UFGX = B01.UFØRHIST.UFØRGRAD.UFG_ØVRIGE             00027440
                                   (IX,INDEX_1,INDEX_2);                00027450
             END;                                                       00027460
           END;                                                         00027470
       END;                                                             00027480
                                                                        00027490
       IF  UFG_TIL_POENG = 999 THEN                                     00027500
           UFG_TIL_POENG = MAX_UFGX;                                    00027510
                                                                        00027520
   END MAX_UFG;                                                         00027530
                                                                        00027540
                                                                        00027550
   /****************** F_INNTEKT_POENG *************************/       00027560
  F_INNTEKT_POENG:                                                      00027570
    PROC(INNTEKT,ÅR,GV,UFG) RETURNS(FIXED DEC(5,4));                    00027580
 %SKIP(2);                                                              00027590
    DCL                                                                 00027600
       INNTEKT       FIXED DEC(9),                                      00027610
       ÅR            FIXED BIN(15),                                     00027620
       GV            FIXED DEC(5),                                      00027630
       UFG           FIXED DEC(3),                                      00027640
       W_INNTEKT     FIXED DEC(9)   INIT(0),                            00027650
       INNTEKT_POENG FIXED DEC(5,4) INIT(0),                            00027660
       W_POENG       FIXED DEC(5,3) INIT(0);                            00027670
 %PAGE;                                                                 00027680
  IF ÅR    > 70 THEN                                                    00027690
     DO;                                                                00027700
 /* NYE REGLER FOR OPPTJENING FRA INNTEKTSÅRET 1992. MAX 7 OSV.       */00027710
 /* VAR GLEMT HER. TRUDE 03.01.94                                     */00027720
                                                                        00027730
     IF ÅR > 91 THEN                                                    00027740
        DO;                                                             00027750
 /*    NÅR INNTEKTSÅRET ER ETTER 1991, ER HØYESTE AKTUELLE INNTEKT 12 */00027760
 /*    GANGER VEIET GRUNNBELØP, MEN FOR DEN DELEN AV INNTEKTEN SOM    */00027770
 /*    OVERSTIGER 6 GANGER VEIET GRUNNBELØP BLIR EN BARE GODSKREVET   */00027780
 /*    EN TREDJEDEL. HØYESTE POENG BLIR DA 7.00                       */00027790
 /*                                                                   */00027800
           IF INNTEKT > (GV * 12) THEN                                  00027810
              W_INNTEKT = GV * 12;                                      00027820
           ELSE                                                         00027830
             W_INNTEKT = INNTEKT;                                       00027840
                                                                        00027850
           IF W_INNTEKT > (GV * 6) THEN                                 00027860
                                                                        00027870
           W_INNTEKT = (GV * 6) + ((INNTEKT - (GV * 6)) / 3) + 0.5;     00027880
                                                                        00027890
           W_POENG = (W_INNTEKT - (GV * (100 - UFG) / 100)) / GV;       00027900
                                                                        00027910
           IF W_POENG < 0    THEN                                       00027920
              W_POENG = 0;                                              00027930
           IF W_POENG > 7.00 THEN                                       00027940
              INNTEKT_POENG = 7.00;                                     00027950
           ELSE                                                         00027960
              INNTEKT_POENG = W_POENG;                                  00027970
        END;                                                            00027980
     ELSE                                                               00027990
        DO; /*HL0196*/                                                  00028000
                                     /* 1992 REGLER HIT TRUDE 030194  */00028010
                                                                        00028020
 /*                                                                   */00028030
 /*    NÅR INNTEKTSÅRET ER ETTER 1970, ER HØYESTE AKTUELLE INNTEKT 12 */00028040
 /*    GANGER VEIET GRUNNBELØP, MEN FOR DEN DELEN AV INNTEKTEN SOM    */00028050
 /*    OVERSTIGER 8 GANGER VEIET GRUNNBELØP BLIR EN BARE GODSKREVET   */00028060
 /*    EN TREDJEDEL. HØYESTE POENG BLIR DA 8,33                       */00028070
 /*                                                                   */00028080
       IF INNTEKT > (GV * 12) THEN                                      00028090
          W_INNTEKT = GV * 12;                                          00028100
       ELSE                                                             00028110
         W_INNTEKT = INNTEKT;                                           00028120
                                                                        00028130
       IF W_INNTEKT > (GV * 8) THEN                                     00028140
                                                                        00028150
 /* ENDRET 23.10.85 HL : AVRUNDING ER LAGT INN I W_INNTEKT :       */   00028160
                                                                        00028170
          W_INNTEKT = (GV * 8) + ((INNTEKT - (GV * 8)) / 3) + 0.5;      00028180
                                                                        00028190
       W_POENG = (W_INNTEKT - (GV * (100 - UFG) / 100)) / GV;           00028200
                                                                        00028210
       IF W_POENG < 0    THEN                                           00028220
          W_POENG = 0;                                                  00028230
       IF W_POENG > 8.33 THEN                                           00028240
          INNTEKT_POENG = 8.33;                                         00028250
       ELSE                                                             00028260
          INNTEKT_POENG = W_POENG;                                      00028270
     END;                                                               00028280
     END;                                                               00028290
  ELSE                                                                  00028300
     DO;                                                                00028310
 /*                                                                   */00028320
 /*    NÅR INNTEKTSÅRET ER FØR 1971 ER HØYESTE AKTUELLE INNTEKT 8     */00028330
 /*    GANGER VEIET GRUNNBELØP, HØESTE POENG BLIR DA 7,00             */00028340
 /*                                                                   */00028350
       W_POENG = (INNTEKT - (GV * (100 - UFG) / 100)) / GV;             00028360
       IF W_POENG < 0    THEN                                           00028370
          W_POENG = 0;                                                  00028380
       IF W_POENG > 7.00 THEN                                           00028390
          INNTEKT_POENG = 7.00;                                         00028400
       ELSE                                                             00028410
          INNTEKT_POENG = W_POENG;                                      00028420
     END;                                                               00028430
  RETURN(INNTEKT_POENG);                                                00028440
 %SKIP(2);                                                              00028450
  END F_INNTEKT_POENG;                                                  00028460
                                                                        00028470
                                                                        00028480
     %INCLUDE R0019904;     /*   F_GYLDIG_FNR                    */     00028490
     %INCLUDE R0019910;     /*   F_NUMERISK                      */     00028500
     %INCLUDE R0019956;     /*   P9956_BER_G_CICS                */     00028510
   /* %INCLUDE R0019958;    /*   P-9958_BEH_STRYK_REG(BEH;FAN;ÅR */     00028520
                                                                        00028530
                                                                        00028540
 END R001043;                                                           00028550
                                                                        00028560
                                                                        00028570
