 /*       SIST ENDRET 24/10-97 10.58.33 AV   SPA7339                  */00000000
 /*       SIST ENDRET 15/08-97 07.50.22 AV   HLA7339                  */00000010
 /*       SIST ENDRET 12/02-97 09.15.59 AV   JDA7339                  */00000020
 /*       SIST ENDRET 05/02-96 12.42.44 AV   JDA0310                  */00000030
 /*       SIST ENDRET 12/10-95 14.10.46 AV   JDA0310                  */00000040
 /*       SIST ENDRET 15/03-94 13.58.42 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 25/02-94 17.57.50 AV   HERMAN                   */00000060
 /*       SIST ENDRET 26/04-91 12.23.46 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 16/10-89 13.10.51 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 23/06-89 11.27.14 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 14/04-89 14.54.34 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 11/08-86 11.45.28 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 01/10-84 09.05.25 AV   LUNDEBY                  */00000120
 /*       SIST ENDRET 22/06-84 11.37.49 AV   LUNDEBY                  */00000130
 /*       SIST ENDRET 07/06-84 16.13.09 AV   LUNDEBY                  */00000140
 /*       SIST ENDRET 29/05-84 13.18.24 AV   LUNDEBY                  */00000150
                                                                        00000160
                                                                        00000170
  /* **************************************************************** */00000180
  /*IDENTIFIKASJON:                                                   */00000190
  /*    R0015201 - HOVEDPROGRAM I PLI                                 */00000200
  /*                                                                  */00000210
  /*    PROGRAMMERER: S. LUNDEBY , SFK , OKTOBER  1982                */00000220
  /*                                                                  */00000230
  /*HENSIKT:                                                          */00000240
  /*    LESER     T R A N S    FRA    DB.                             */00000250
  /*                                                                  */00000260
  /*PROGRAMTILKNYTNING:                                               */00000270
  /*                                                                  */00000280
  /*BRUKER                                                            */00000290
  /*                                                                  */00000300
  /* **************************************************************** */00000310
                                                                        00000320
  R001520:                                                              00000330
    PROC            (COMMAREA_PEKER)                                    00000340
           OPTIONS  (MAIN);                                             00000350
                                                                        00000360
    %PAGE;                                                              00000370
    %INCLUDE P0012001;                         /* TRANS_SEGM_OMR  (B) */00000380
                                                                        00000390
    %PAGE;                                                              00000400
    %INCLUDE P0019906;                         /* TRANS_OPPL_OMR  (B) */00000410
                                                                        00000420
    %PAGE;                                                              00000430
    %INCLUDE P0019908;                         /* KOM_OMR         (B) */00000440
                                                                        00000450
    %PAGE;                                                              00000460
    %INCLUDE P0019910;                         /* STYRINGS_OMR    (B) */00000470
                                                                        00000480
    %PAGE;                                                              00000490
    %INCLUDE P0019912;                         /* DIV_PARAM_OMR   (B) */00000500
                                                                        00000510
    %PAGE;                                                              00000520
    DCL 1    B01          BASED (B01_PEKER),                            00000530
    %INCLUDE P0019921;                         /* B 0 1           (B) */00000540
                                                                        00000550
    %PAGE;                                                              00000560
    DCL 1    B02          BASED (B02_PEKER),                            00000570
    %INCLUDE P0019921;                         /* B 0 2           (B) */00000580
                                                                        00000590
    %PAGE;                                                              00000600
    /* ************************************************************** */00000610
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00000620
    /* ************************************************************** */00000630
                                                                        00000640
       DCL                                                              00000650
         ( ADDR , CSTG , LOW , STG , SUBSTR )  BUILTIN;                 00000660
       DCL                                                              00000670
         PLITDLI ENTRY;                                                 00000680
                                                                        00000690
    /* ************************************************************** */00000700
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000710
    /* ************************************************************** */00000720
                                                                        00000730
    %INCLUDE DLIUIB;                                                    00000740
                                                                        00000750
       DCL                                                              00000760
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00000770
                                                                        00000780
       DCL                                                              00000790
         ( COMMAREA_PEKER , W01_HJELPE_PEKER , TRANS_SEGM_PEKER ,       00000800
           W01_TRANS_OPPL_PEKER )    POINTER;                           00000810
                                                                        00000820
    /* ************************************************************** */00000830
    /*   OPPTELINGS- OG LOOP-PARAMETRE M.M                            */00000840
    /* ************************************************************** */00000850
                                                                        00000860
       DCL 1  W01                       UNALIGNED,                      00000870
              2   MER_DATA                    BIT  (1)   INIT ('1'B),   00000880
              2   BARN_IKKE_LEST              BIT  (1)   INIT ('1'B),   00000890
              2   PERSON_IKKE_FUNNET          BIT  (1)   INIT ('1'B),   00000900
              2   TO_GRUNNBYP_LEST            BIT  (1)   INIT ('0'B),   00000910
              2   GRUNNBYP_IKKE_LEST          BIT  (1)   INIT ('1'B),   00000920
              2   TO_GRUNNEES_LEST            BIT  (1)   INIT ('0'B),   00000930
              2   GRUNNEES_IKKE_LEST          BIT  (1)   INIT ('1'B),   00000940
              2   NAVN                        CHAR (25)  INIT ((25)' '),00000950
              2   VIRK_DATO_ÅM                PIC '9999' INIT ( 0  ),   00000960
              2   VTP_ÅM_SISTE                PIC '9999' INIT ( 0  ),   00000970
              2   I                    FIXED  BIN  (15)  INIT (1),      00000980
              2   J                    FIXED  BIN  (15)  INIT (1);      00000990
                                                                        00001000
    /* ************************************************************** */00001010
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00001020
    /* ************************************************************** */00001030
                                                                        00001040
 /*    DCL 1  W01_DLI_PARAM,    OMRÅDET MÅ VÆRE UNALIGNED      */       00001050
 /*                             NY VERSJON AV IMS  120788 BF   */       00001060
                                                                        00001070
       DCL 1  W01_DLI_PARAM      UNALIGNED,                             00001080
              2   W02_GU                  CHAR (4)   INIT ('GU  '),     00001090
              2   W02_GN                  CHAR (4)   INIT ('GN  '),     00001100
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),     00001110
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00001120
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00001130
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),          00001140
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');  00001150
                                                                        00001160
       DCL    W01_IO                CHAR (280)       INIT ( (280) ' ' ),00001170
              W01_HJELPE_IO         CHAR (280) BASED (W01_HJELPE_PEKER);00001180
                                                                        00001190
    /* ************************************************************** */00001200
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00001210
    /* ************************************************************** */00001220
                                                                        00001230
       DCL    SSA_UQUAL                       CHAR (9) INIT ((9)' ');   00001240
                                                                        00001250
       DCL 1  SSA1_TRANHIST_CMD               ,                         00001260
              2    HDEL                       CHAR (19)  INIT           00001270
                                                ('TRANHIST*P(GRBLKODE'),00001280
              2    REL_OP_1                   CHAR (2)   INIT ('^='),   00001290
              2    GRBLKODE                   CHAR (2)   INIT ('US'),   00001300
              2    HP                         CHAR (1)   INIT (')');    00001310
                                                                        00001320
                                                                        00001330
                                                                        00001340
       DCL 1  SSA_UQUAL_CMD          UNALIGNED,                         00001350
              2   NAVN                        CHAR (8) INIT('TRANHIST'),00001360
              2   KODE                        CHAR (2) INIT('*P');      00001370
                                                                        00001380
       DCL 1  SSA1_RF0PERSN          UNALIGNED,                         00001390
              2    HDEL                       CHAR (17)  INIT           00001400
                                                  ('RF0PERSN(FNR     '),00001410
              2    REL_OP                     CHAR (2)   INIT (' ='),   00001420
              2    PKEY              FIXED    DEC  (11),                00001430
              2    HP                         CHAR (1)   INIT (')' );   00001440
                                                                        00001450
       DCL 1  SSA1_TRANHIST          UNALIGNED,                         00001460
              2    HDEL                       CHAR (19)  INIT           00001470
                                                ('TRANHIST*P(VIRKDATO'),00001480
              2    REL_OP_1                   CHAR (1)   INIT (' '),    00001490
              2    REL_OP_2                   CHAR (1)   INIT ('>'),    00001500
              2    VTP               FIXED    DEC  (4)   INIT ( 0 ),    00001510
              2    KONKAT                     CHAR (1)   INIT ('&'),    00001520
              2    MDEL                       CHAR (8)   INIT           00001530
                                                        ('GRBLKODE'),   00001540
              2    REL_OP_3                   CHAR (2)   INIT ('^='),   00001550
              2    GRBLKODE                   CHAR (2)   INIT ('US'),   00001560
              2    HP                         CHAR (1)   INIT (')');    00001570
                                                                        00001580
    /* ************************************************************** */00001590
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00001600
    /* ************************************************************** */00001610
                                                                        00001620
    %PAGE;                                                              00001630
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00001640
                                                                        00001650
    %PAGE;                                                              00001660
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                   00001670
    %INCLUDE P0012003;                         /* PCB                 */00001680
                                                                        00001690
                                                                        00001700
                                                                        00001710
    /* ************************************************************** */00001720
    /*                                                                */00001730
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00001740
    /*     ---------------------------------------------------        */00001750
    /*                                                                */00001760
    /*                                                                */00001770
    /*      INITIERING AV PARAMETRE TIL DIV_PARAM_OMR.                */00001780
    /*                                                                */00001790
    /*      SETTER UIBPTR = UIB_PEKER   SOM OVERFØRES ETTER           */00001800
    /*      INITIERINGS-KALL   I     R0012001 .                       */00001810
    /*                                                                */00001820
    /* ************************************************************** */00001830
                                                                        00001840
                                                                        00001850
                                                                        00001860
                                                                        00001870
    ALLOCATE  TRANS_SEGM_OMR;                                           00001880
    TRANS_SEGM_OMR                          =   ''                     ;00001890
    TRANS_OPPL_OMR                          =   ''                     ;00001900
    DB_STATUS_KODE                          =   '  '                   ;00001910
    PROGRAM_ID                              =   'R0015201'             ;00001920
    UIBPTR                                  =    UIB_PEKER             ;00001930
                                                                        00001940
    IF SUBSTR(CICS_NAVN,1,4) = 'HELP'     THEN                          00001950
             SSA1_TRANHIST_CMD.REL_OP_1 = ' =' ;                        00001960
                                                                        00001970
                                                                        00001980
    IF   SEARCH_FNR                         =    0                 THEN 00001990
      DO;                                                               00002000
         /* ********************************************** */           00002010
         /* NULL I FNR . KJØRING AVBRYTES                  */           00002020
         /* ********************************************** */           00002030
  L100:                                                                 00002040
         FEIL_MELD_NR                 =   498;                          00002050
         FEIL_VED_LABEL               =  '100';                         00002060
         GO TO L999;                                                    00002070
      END;                                                              00002080
                                                                        00002090
    DO   J=1 TO 14  WHILE   ( W01.PERSON_IKKE_FUNNET )  ;               00002100
                                                                        00002110
      /* ********************************************** */              00002120
      /* SJEKKER OM PESONEN ER LEST INN I  B01/B02 FØR. */              00002130
      /* ********************************************** */              00002140
                                                                        00002150
      IF  B01.RF0PERSN.FNR (J)         =    SEARCH_FNR     THEN         00002160
        DO;                                                             00002170
          W01.NAVN                     =    B01.RF0PERSN.NAVN (J);      00002180
          W01.PERSON_IKKE_FUNNET       =   '0'B;                        00002190
        END;                                                            00002200
                                                                        00002210
      IF  B02.RF0PERSN.FNR (J)         =    SEARCH_FNR     THEN         00002220
        DO;                                                             00002230
          W01.NAVN                     =    B02.RF0PERSN.NAVN (J);      00002240
          W01.PERSON_IKKE_FUNNET       =   '0'B;                        00002250
        END;                                                            00002260
   END;                                                                 00002270
                                                                        00002280
    /* ********************************************************** */    00002290
    /* SETTER INN VERDIENE I SSA'ENE.                             */    00002300
    /* ********************************************************** */    00002310
                                                                        00002320
    SSA1_RF0PERSN.PKEY              =   SEARCH_FNR                 ;    00002330
                                                                        00002340
                                                                        00002350
    SELECT  ( STATUS_TYPE );                                            00002360
                                                                        00002370
       WHEN ('C'          )                                             00002380
            SSA1_TRANHIST.VTP       =   0                          ;    00002390
                                                                        00002400
       WHEN ('D'          )                                             00002410
                                                                        00002420
         /* ***************************************************** */    00002430
         /* I ØNSKET_STATUS LIGGER IFOMASJON OM HVILKEN           */    00002440
         /* RELASJON-OPERATOR SOM SKAL BENYTTES .                 */    00002450
         /* ***************************************************** */    00002460
         DO;                                                            00002470
            SSA1_TRANHIST.REL_OP_2 =  ØNSKET_STATUS                ;    00002480
            SSA1_TRANHIST.VTP      =  B01.VIRK_DATO_ÅM (SØKER_IND) ;    00002490
         END;                                                           00002500
                                                                        00002510
       WHEN ('F'          )                                             00002520
                                                                        00002530
            /* ************************************************** */    00002540
            /* DENNE TYPE FÅS BARE VED FJERNING AV SISTE STATUS   */    00002550
            /* BRUKER VIRKDATOEN I : DIV_PARAM_OMR                */    00002560
            /* ************************************************** */    00002570
                                                                        00002580
            SSA1_TRANHIST.VTP   =  DIV_PARAM_OMR.TRANS_VIRKDATO_ÅM ;    00002590
                                                                        00002600
       OTHERWISE                                                        00002610
            SSA1_TRANHIST.VTP      =  B01.VIRK_DATO_ÅM (SØKER_IND) ;    00002620
                                                                        00002630
    END;  /*  SELECT  ( STATUS_TYPE )                             */    00002640
                                                                        00002650
                                                                        00002660
    /* ********************************************************** */    00002670
    /*  SJEKKER OM DET ER FØRSTE TRANS SOM ØNSKES LEST            */    00002680
    /*  HVIS ENDRING OG PERSONEN IKKE ER LEST INN FØR SPERRES HAN */    00002690
    /*  GJENNOM    CALL TIL R0015601 .                            */    00002700
    /*  ELLERS GJØRES ET VANLIG KALL (GU) MOT RF0PERSN .          */    00002710
    /* ********************************************************** */    00002720
                                                                        00002730
    IF DIV_PARAM_OMR.FØRSTE_CALL_LES_TRANS                     THEN     00002740
       DO;                                                              00002750
          IF STYRINGS_OMR.FUNKSJONSKODE  =    'E'   &                   00002760
             STYRINGS_OMR.STYREKODE      =    'AT'  &                   00002770
             W01.PERSON_IKKE_FUNNET                            THEN     00002780
             DO;                                                        00002790
                 POS_I_B01               =     14   ;                   00002800
                 EXEC CICS LINK PROGRAM ('R0015601') COMMAREA (KOM_OMR);00002810
                                                                        00002820
                 IF FEIL_MELD_NR         >     0               THEN     00002830
                    GO   TO   L999;                                     00002840
                                                                        00002850
                 IF B01.FNR (POS_I_B01)     >     0         THEN        00002860
                    W01.PERSON_IKKE_FUNNET  =    '0'B;                  00002870
                 ELSE                                                   00002880
                    MER_DATA                =    '0'B;                  00002890
             END;                                                       00002900
          ELSE                                                          00002910
             CALL P005_LES_ROT_GU;                                      00002920
       END;                                                             00002930
    ELSE                                                                00002940
       DO;                                                              00002950
          IF STYRINGS_OMR.FUNKSJONSKODE  =    'F'    !                  00002960
            (STYRINGS_OMR.FUNKSJONSKODE  =    'E'    &                  00002970
             STYRINGS_OMR.STYREKODE      =    'AT'   )         THEN     00002980
                                                                        00002990
             CALL P020_LES_NESTE_TRANHIST;                              00003000
          ELSE                                                          00003010
             CALL P030_LES_TRANHIST_GN_QUAL;                            00003020
       END;                                                             00003030
                                                                        00003040
        TO_GRUNNBYP_LEST   = '0'B;                                      00003050
        GRUNNBYP_IKKE_LEST = '1'B;                                      00003060
                                                                        00003070
 /*EE*/ TO_GRUNNEES_LEST   = '0'B;                                      00003080
 /*EE*/ GRUNNEES_IKKE_LEST = '1'B;                                      00003090
                                                                        00003100
        DO   WHILE  (W01.MER_DATA  &  W01.BARN_IKKE_LEST &              00003110
                     ^TO_GRUNNBYP_LEST & ^TO_GRUNNEES_LEST );           00003120
                                                                        00003130
      IF FEIL_MELD_NR                    >    0                THEN     00003140
         DO;                                                            00003150
           /* ********************************************** */         00003160
           /*  FEIL VED LES                                  */         00003170
           /* ********************************************** */         00003180
                                                                        00003190
           GO TO L999;                                                  00003200
         END;                                                           00003210
                                                                        00003220
                                                                        00003230
      SELECT ( RF1.SEGM_NAVN );                                         00003240
                                                                        00003250
        WHEN ( 'RF0PERSN' )                                             00003260
          /* **************************************************** */    00003270
          /*  FÅTT INN :    R F 0 P E R S N                       */    00003280
          /* **************************************************** */    00003290
          DO;                                                           00003300
                                                                        00003310
             IF W01.PERSON_IKKE_FUNNET                            THEN  00003320
                DO;                                                     00003330
                  SUBSTR (ADDR            (B01.RF0PERSN (14))           00003340
                  ->  W01_HJELPE_IO,1,STG (B01.RF0PERSN (14))) = W01_IO;00003350
                                                                        00003360
                  W01.NAVN           =     B01.RF0PERSN (14).NAVN      ;00003370
                END;                                                    00003380
                                                                        00003390
            TRANS_OPPL_OMR.FØDSNUMMER      =   SEARCH_FNR;              00003400
                                                                        00003410
            IF STYRINGS_OMR.FUNKSJONSKODE  =   'F'       !              00003420
              (STYRINGS_OMR.FUNKSJONSKODE  =   'E'       &              00003430
               STYRINGS_OMR.STYREKODE      =   'AT'      )         THEN 00003440
                                                                        00003450
               CALL P020_LES_NESTE_TRANHIST;                            00003460
            ELSE                                                        00003470
               CALL P030_LES_TRANHIST_GN_QUAL;                          00003480
          END;                                                          00003490
                                                                        00003500
        WHEN ( 'TRANHIST' )                                             00003510
          /* **************************************************** */    00003520
          /*  FÅTT INN :    T R A N H I S T                       */    00003530
          /* **************************************************** */    00003540
          DO;                                                           00003550
            SUBSTR (ADDR                (TRANHIST)                      00003560
                ->  W01_HJELPE_IO,1,STG (TRANHIST)) =  W01_IO;          00003570
            CALL    P010_LES_SEGM;                                      00003580
          END;                                                          00003590
                                                                        00003600
        WHEN ( 'GRUNNBAP' )                                             00003610
          /* **************************************************** */    00003620
          /*  FÅTT INN :    G R U N N B A P                       */    00003630
          /*  GRUNNBAP KAN VÆRE AVTALEFESTET PENSJON, DA SKAL     */    00003640
          /*  LESTE DATA LEGGES I OMRÅDET GRUNNBAF.               */    00003650
          /* **************************************************** */    00003660
          DO;                                                           00003670
            IF TRANHIST.GRBLKODE  = 'AP'  THEN                          00003680
               SUBSTR (ADDR             (GRUNNBAP)                      00003690
                ->  W01_HJELPE_IO,1,STG (GRUNNBAP)) =  W01_IO;          00003700
                                                                        00003710
                                                                        00003720
            IF TRANHIST.GRBLKODE  = 'AF'  THEN                          00003730
               SUBSTR (ADDR             (GRUNNBAF)                      00003740
                ->  W01_HJELPE_IO,1,STG (GRUNNBAF)) =  W01_IO;          00003750
                                                                        00003760
                                                                        00003770
            IF TRANHIST.GRBLKODE  = 'KF'  THEN                          00003780
               SUBSTR (ADDR             (GRUNNBKF)                      00003790
                ->  W01_HJELPE_IO,1,STG (GRUNNBKF)) =  W01_IO;          00003800
            CALL    P010_LES_SEGM;                                      00003810
                                                                        00003820
          END;                                                          00003830
                                                                        00003840
        WHEN ( 'GRUNNBA1' )                                             00003850
          /* **************************************************** */    00003860
          /*  FÅTT INN :    G R U N N B A 1                       */    00003870
          /*  GRUNNBAP KAN VÆRE AVTALEFESTET PENSJON, DA SKAL     */    00003880
          /*  LESTE DATA LEGGES I OMRÅDET GRUNNBAF.               */    00003890
          /* **************************************************** */    00003900
          DO;                                                           00003910
                                                                        00003920
            IF TRANHIST.GRBLKODE  = 'A1'  THEN                          00003930
               SUBSTR (ADDR             (GRUNNBA1)                      00003940
                ->  W01_HJELPE_IO,1,STG (GRUNNBA1)) =  W01_IO;          00003950
                                                                        00003960
            CALL    P010_LES_SEGM;                                      00003970
          END;                                                          00003980
        WHEN ( 'GRUNNBUP' )                                             00003990
          /* **************************************************** */    00004000
          /*  FÅTT INN :    G R U N N B U P                       */    00004010
          /* **************************************************** */    00004020
          DO;                                                           00004030
            IF TRANHIST.GRBLKODE     = 'UP'  THEN                       00004040
               SUBSTR (ADDR             (GRUNNBUP)                      00004050
                ->  W01_HJELPE_IO,1,STG (GRUNNBUP)) =  W01_IO;          00004060
                                                                        00004070
                                                                        00004080
            IF TRANHIST.GRBLKODE     = 'UF'  THEN                       00004090
 /*UF*/        SUBSTR (ADDR             (GRUNNBUF)                      00004100
 /*UF*/         ->  W01_HJELPE_IO,1,STG (GRUNNBUF)) =  W01_IO;          00004110
 /*UF*/    CALL    P010_LES_SEGM;                                       00004120
          END;                                                          00004130
                                                                        00004140
        WHEN ( 'GRUNNBU2' )                                             00004150
          /* **************************************************** */    00004160
          /*  FÅTT INN :    G R U N N B U 2                       */    00004170
          /* **************************************************** */    00004180
          DO;                                                           00004190
            IF TRANHIST.GRBLKODE     = 'U2'  THEN                       00004200
               SUBSTR (ADDR             (GRUNNBU2)                      00004210
                ->  W01_HJELPE_IO,1,STG (GRUNNBU2)) =  W01_IO;          00004220
                                                                        00004230
           CALL    P010_LES_SEGM;                                       00004240
          END;                                                          00004250
                                                                        00004260
                                                                        00004270
        WHEN ( 'GRUNNBU3' )                                             00004280
          /* **************************************************** */    00004290
          /*  FÅTT INN :    G R U N N B U 3                       */    00004300
          /* **************************************************** */    00004310
          DO;                                                           00004320
            IF TRANHIST.GRBLKODE     = 'U3'  THEN                       00004330
               SUBSTR (ADDR             (GRUNNBU3)                      00004340
                ->  W01_HJELPE_IO,1,STG (GRUNNBU3)) =  W01_IO;          00004350
                                                                        00004360
           CALL    P010_LES_SEGM;                                       00004370
          END;                                                          00004380
                                                                        00004390
                                                                        00004400
        WHEN ( 'GRBLFORS' )                                             00004410
          /* **************************************************** */    00004420
          /*  FÅTT INN :    G R B L F O R S                       */    00004430
          /* **************************************************** */    00004440
          DO;                                                           00004450
            SUBSTR (ADDR                (GRBLFORS)                      00004460
                ->  W01_HJELPE_IO,1,STG (GRBLFORS)) =  W01_IO;          00004470
            CALL    P010_LES_SEGM;                                      00004480
          END;                                                          00004490
                                                                        00004500
                                                                        00004510
        WHEN ( 'GRUNNBIF' )                                             00004520
          /* **************************************************** */    00004530
          /*  FÅTT INN :    G R B L F O R S                       */    00004540
          /* **************************************************** */    00004550
          DO;                                                           00004560
            SUBSTR (ADDR                (GRUNNBIF)                      00004570
                ->  W01_HJELPE_IO,1,STG (GRUNNBIF)) =  W01_IO;          00004580
            CALL    P010_LES_SEGM;                                      00004590
          END;                                                          00004600
                                                                        00004610
        WHEN ( 'GRUNNBFO' )                                             00004620
          /* **************************************************** */    00004630
          /*  FÅTT INN :    G R B L  FO                           */    00004640
          /* **************************************************** */    00004650
          DO;                                                           00004660
            SUBSTR (ADDR                (GRUNNBFO)                      00004670
                ->  W01_HJELPE_IO,1,STG (GRUNNBFO)) =  W01_IO;          00004680
            CALL    P010_LES_SEGM;                                      00004690
          END;                                                          00004700
                                                                        00004710
        WHEN ( 'GRUNNBEP' )                                             00004720
          /* **************************************************** */    00004730
          /*  FÅTT INN :    G R U N N B E P                       */    00004740
          /* **************************************************** */    00004750
          DO;                                                           00004760
            SUBSTR (ADDR                (GRUNNBEP)                      00004770
                ->  W01_HJELPE_IO,1,STG (GRUNNBEP)) =  W01_IO;          00004780
            CALL    P010_LES_SEGM;                                      00004790
          END;                                                          00004800
                                                                        00004810
        WHEN ( 'GRUNNBE3' )                                             00004820
          /* **************************************************** */    00004830
          /*  FÅTT INN :    G R U N N B E P                       */    00004840
          /* **************************************************** */    00004850
          DO;                                                           00004860
            SUBSTR (ADDR                (GRUNNBE3)                      00004870
                ->  W01_HJELPE_IO,1,STG (GRUNNBE3)) =  W01_IO;          00004880
            CALL    P010_LES_SEGM;                                      00004890
          END;                                                          00004900
                                                                        00004910
        WHEN ( 'GRUNNBEE' )                                             00004920
          /* **************************************************** */    00004930
          /*  FÅTT INN :    G R U N N B E P                       */    00004940
          /* **************************************************** */    00004950
          DO;                                                           00004960
            SUBSTR (ADDR                (GRUNNBEE)                      00004970
                ->  W01_HJELPE_IO,1,STG (GRUNNBEE)) =  W01_IO;          00004980
            CALL    P010_LES_SEGM;                                      00004990
          END;                                                          00005000
                                                                        00005010
        WHEN ( 'GRBLFAMP' )                                             00005020
          /* **************************************************** */    00005030
          /*  FÅTT INN :    G R B L F A M P                       */    00005040
          /* **************************************************** */    00005050
          DO;                                                           00005060
            SUBSTR (ADDR                (GRBLFAMP)                      00005070
                ->  W01_HJELPE_IO,1,STG (GRBLFAMP)) =  W01_IO;          00005080
            CALL    P010_LES_SEGM;                                      00005090
          END;                                                          00005100
                                                                        00005110
        WHEN ( 'GRBLFAE4' )                                             00005120
          /* **************************************************** */    00005130
          /*  FÅTT INN :    G R B L F A M P                       */    00005140
          /* **************************************************** */    00005150
          DO;                                                           00005160
            SUBSTR (ADDR                (GRBLFAE4)                      00005170
                ->  W01_HJELPE_IO,1,STG (GRBLFAE4)) =  W01_IO;          00005180
            CALL    P010_LES_SEGM;                                      00005190
          END;                                                          00005200
                                                                        00005210
        WHEN ( 'GRBLEBEN' )                                             00005220
          /* **************************************************** */    00005230
          /*  FÅTT INN :    G R B L E B E N                       */    00005240
          /* **************************************************** */    00005250
          DO;                                                           00005260
            SUBSTR (ADDR                (GRBLEBEN)                      00005270
                ->  W01_HJELPE_IO,1,STG (GRBLEBEN)) =  W01_IO;          00005280
            CALL    P010_LES_SEGM;                                      00005290
          END;                                                          00005300
                                                                        00005310
        WHEN ( 'GRBLEBB6' )                                             00005320
          /* **************************************************** */    00005330
          /*  FÅTT INN :    G R B L E B B 6                       */    00005340
          /* **************************************************** */    00005350
          DO;                                                           00005360
            SUBSTR (ADDR                (GRBLEBB6)                      00005370
                ->  W01_HJELPE_IO,1,STG (GRBLEBB6)) =  W01_IO;          00005380
            CALL    P010_LES_SEGM;                                      00005390
          END;                                                          00005400
                                                                        00005410
        WHEN ( 'GRBLEBBE' )                                             00005420
          /* **************************************************** */    00005430
          /*  FÅTT INN :    G R B L E B B E                       */    00005440
          /* **************************************************** */    00005450
          DO;                                                           00005460
            SUBSTR (ADDR                (GRBLEBBE)                      00005470
                ->  W01_HJELPE_IO,1,STG (GRBLEBBE)) =  W01_IO;          00005480
            CALL    P010_LES_SEGM;                                      00005490
          END;                                                          00005500
                                                                        00005510
                                                                        00005520
        WHEN ( 'GRBLF5BE' )                                             00005530
          /* **************************************************** */    00005540
          /*  FÅTT INN :    G R B L F 5 B E                       */    00005550
          /* **************************************************** */    00005560
          DO;                                                           00005570
            SUBSTR (ADDR                (GRBLF5BE)                      00005580
                ->  W01_HJELPE_IO,1,STG (GRBLF5BE)) =  W01_IO;          00005590
            CALL    P010_LES_SEGM;                                      00005600
          END;                                                          00005610
                                                                        00005620
        WHEN ( 'ENDRBLAN' )                                             00005630
          /* **************************************************** */    00005640
          /*  FÅTT INN :    E N D R B L A N                       */    00005650
          /* **************************************************** */    00005660
          DO;                                                           00005670
            SUBSTR (ADDR                (ENDRBLAN)                      00005680
                ->  W01_HJELPE_IO,1,STG (ENDRBLAN)) =  W01_IO;          00005690
            CALL    P010_LES_SEGM;                                      00005700
          END;                                                          00005710
                                                                        00005720
        WHEN ( 'ENBLAN1 ' )                                             00005730
          /* **************************************************** */    00005740
          /*  FÅTT INN :    E N _ B L A N                       */      00005750
          /* **************************************************** */    00005760
          DO;                                                           00005770
            SUBSTR (ADDR                (EN_BLAN)                       00005780
                ->  W01_HJELPE_IO,1,STG (EN_BLAN)) =  W01_IO;           00005790
            CALL    P010_LES_SEGM;                                      00005800
          END;                                                          00005810
                                                                        00005820
        WHEN ( 'OPPHBL1 ' )                                             00005830
          /* **************************************************** */    00005840
          /*  FÅTT INN :    O P P H B L 1                         */    00005850
          /* **************************************************** */    00005860
          DO;                                                           00005870
            SUBSTR (ADDR                (OPPHBL1)                       00005880
                ->  W01_HJELPE_IO,1,STG (OPPHBL1)) =  W01_IO;           00005890
            CALL    P010_LES_SEGM;                                      00005900
          END;                                                          00005910
                                                                        00005920
        WHEN ( 'OPPHBL2 ' )                                             00005930
          /* **************************************************** */    00005940
          /*  FÅTT INN :    O P P H B L 2                         */    00005950
          /* **************************************************** */    00005960
          DO;                                                           00005970
            SUBSTR (ADDR                (OPPHBL2)                       00005980
                ->  W01_HJELPE_IO,1,STG (OPPHBL2)) =  W01_IO;           00005990
            CALL    P010_LES_SEGM;                                      00006000
          END;                                                          00006010
                                                                        00006020
        WHEN ( 'BARN    ' )                                             00006030
          /* **************************************************** */    00006040
          /*  FÅTT INN :    B A R N                               */    00006050
          /* **************************************************** */    00006060
          DO;                                                           00006070
            W01.BARN_IKKE_LEST                  =  '0'B;                00006080
          END;                                                          00006090
                                                                        00006100
        WHEN ( 'GRUNNBYP' )                                             00006110
          /* **************************************************** */    00006120
          /*  FÅTT INN :    G R U N N B Y P                       */    00006130
          /* **************************************************** */    00006140
          DO;                                                           00006150
            IF GRUNNBYP_IKKE_LEST THEN                                  00006160
               DO;                                                      00006170
                  SUBSTR (ADDR                (GRUNNBYP)                00006180
                          ->  W01_HJELPE_IO,1,STG (GRUNNBYP)) =  W01_IO;00006190
                  CALL    P010_LES_SEGM;                                00006200
                  GRUNNBYP_IKKE_LEST = '0'B;                            00006210
               END;                                                     00006220
            ELSE                                                        00006230
               TO_GRUNNBYP_LEST = '1'B;                                 00006240
          END;                                                          00006250
                                                                        00006260
        WHEN ( 'GRUNNEES' )                                             00006270
          /* **************************************************** */    00006280
          /*  FÅTT INN :    G R U N N B Y P                       */    00006290
          /* **************************************************** */    00006300
          DO;                                                           00006310
            IF GRUNNEES_IKKE_LEST THEN                                  00006320
               DO;                                                      00006330
                  SUBSTR (ADDR                (GRUNNEES)                00006340
                          ->  W01_HJELPE_IO,1,STG (GRUNNEES)) =  W01_IO;00006350
                  CALL    P010_LES_SEGM;                                00006360
                  GRUNNEES_IKKE_LEST = '0'B;                            00006370
               END;                                                     00006380
            ELSE                                                        00006390
               TO_GRUNNEES_LEST = '1'B;                                 00006400
          END;                                                          00006410
                                                                        00006420
        WHEN ( 'GRBLUFST' )                                             00006430
          /* **************************************************** */    00006440
          /*  FÅTT INN :    G R B L  FO                           */    00006450
          /* **************************************************** */    00006460
          DO;                                                           00006470
            SUBSTR (ADDR                (GRBLUFST)                      00006480
                ->  W01_HJELPE_IO,1,STG (GRBLUFST)) =  W01_IO;          00006490
            CALL    P010_LES_SEGM;                                      00006500
          END;                                                          00006510
                                                                        00006520
                                                                        00006530
        OTHERWISE                                                       00006540
          /* **************************************************** */    00006550
          /*  FÅTT INN : ET UKJENT SEGMENT                        */    00006560
          /* **************************************************** */    00006570
          DO;                                                           00006580
  L105:                                                                 00006590
            FEIL_MELD_NR                        =  500;                 00006600
            FEIL_VED_LABEL                      = '105';                00006610
            GO TO L999;                                                 00006620
          END;                                                          00006630
                                                                        00006640
      END;/*   SELECT    :  RF1.SEGM_NAVN                       */      00006650
                                                                        00006660
    END;  /*   DO WHILE  (  W01.MER_DATA & W01.BARN_IKKE_LEST ) */      00006670
                                                                        00006680
                                                                        00006690
    /* ************************************************************** */00006700
    /*                                                                */00006710
    /* SJEKKER OM ET TRANHIST-SEGM. ER LEST INN .                     */00006720
    /* ER DET DET OVERFØRES OPPLYSNINGENE TIL BLANKETTEN .            */00006730
    /*                                                                */00006740
    /* HVIS IKKE SJEKKES OM DET LEST INN NOEN I POS 1,2,3 I B02       */00006750
    /* ER DET IKKE DET BLANKES DEN OPPDATERTE POS 14 I B01 .          */00006760
    /*                                                                */00006770
    /* ************************************************************** */00006780
                                                                        00006790
                                                                        00006800
    IF TRANHIST.VTP_KEY        >        0     THEN                      00006810
       CALL    P040_OVERFØR_TIL_BLANKETT;                               00006820
    ELSE                                                                00006830
       IF  B01.RF0PERSN.FNR (1)    =        0                           00006840
         & B01.RF0PERSN.FNR (2)    =        0                           00006850
         & B01.RF0PERSN.FNR (3)    =        0     THEN                  00006860
                                                                        00006870
           B01.RF0PERSN.FNR (14)   =        0;                          00006880
                                                                        00006890
                                                                        00006900
                                                                        00006910
                                                                        00006920
    /* ************************************************************** */00006930
    /* ************************************************************** */00006940
    /* ************************************************************** */00006950
                                                                        00006960
                                                                        00006970
    %PAGE;                                                              00006980
    /* ************************************************************** */00006990
    /*                                                                */00007000
    /* PROCEDURE FOR LESE ROT-SEGM              ( GHU   )             */00007010
    /*                                                                */00007020
    /* ************************************************************** */00007030
                                                                        00007040
    P005_LES_ROT_GU:                                                    00007050
      PROC;                                                             00007060
                                                                        00007070
      CALL PLITDLI                              (W02_PARM_CT_4,         00007080
                                                 W02_GU,                00007090
                                                 RF1,                   00007100
                                                 W01_IO,                00007110
                                                 SSA1_RF0PERSN);        00007120
                                                                        00007130
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00007140
        DO;                                                             00007150
          SELECT  ( RF1.STATUS_KODE );                                  00007160
                                                                        00007170
            WHEN  ( '  ' )                                              00007180
              W01.MER_DATA                 =    '1'B;                   00007190
                                                                        00007200
            WHEN  ( 'GE' )                                              00007210
              W01.MER_DATA                 =    '0'B;                   00007220
                                                                        00007230
            OTHERWISE                                                   00007240
              DO;                                                       00007250
                /* ************************************************** */00007260
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00007270
                /* ************************************************** */00007280
  L110:                                                                 00007290
                FEIL_MELD_NR               =     500;                   00007300
                FEIL_VED_LABEL             =    '110';                  00007310
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00007320
              END;                                                      00007330
          END;                                                          00007340
        END;                                                            00007350
      ELSE                                                              00007360
        DO;                                                             00007370
          /* ************************************************** */      00007380
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00007390
          /* ************************************************** */      00007400
  L120:                                                                 00007410
          FEIL_MELD_NR               =     500;                         00007420
          FEIL_VED_LABEL             =    '120';                        00007430
        END;                                                            00007440
    END P005_LES_ROT_GU;                                                00007450
                                                                        00007460
                                                                        00007470
                                                                        00007480
    /* ************************************************************** */00007490
    /*                                                                */00007500
    /* PROCEDURE FOR LESE NESTE SEGMENT UNDER TRANHIST                */00007510
    /*                                                                */00007520
    /* ************************************************************** */00007530
                                                                        00007540
    P010_LES_SEGM:                                                      00007550
      PROC;                                                             00007560
                                                                        00007570
      CALL PLITDLI                              (W02_PARM_CT_3,         00007580
                                                 W02_GNP,               00007590
                                                 RF1,                   00007600
                                                 W01_IO);               00007610
                                                                        00007620
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00007630
        DO;                                                             00007640
          SELECT ( RF1.STATUS_KODE );                                   00007650
            WHEN ( '  ' , 'GA' , 'GK' )                                 00007660
              W01.MER_DATA                 =    '1'B;                   00007670
            WHEN ( 'GE' , 'GB' )                                        00007680
              W01.MER_DATA                 =    '0'B;                   00007690
            OTHERWISE                                                   00007700
              DO;                                                       00007710
                /* ************************************************** */00007720
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00007730
                /* ************************************************** */00007740
  L130:                                                                 00007750
                FEIL_MELD_NR               =     500;                   00007760
                FEIL_VED_LABEL             =    '130';                  00007770
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00007780
              END;                                                      00007790
          END;                                                          00007800
        END;                                                            00007810
      ELSE                                                              00007820
        DO;                                                             00007830
          /* ************************************************** */      00007840
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00007850
          /* ************************************************** */      00007860
  L140:                                                                 00007870
          FEIL_MELD_NR               =     500;                         00007880
          FEIL_VED_LABEL             =    '140';                        00007890
        END;                                                            00007900
    END P010_LES_SEGM;                                                  00007910
                                                                        00007920
                                                                        00007930
                                                                        00007940
    /* ************************************************************** */00007950
    /*                                                                */00007960
    /* PROCEDURE FOR LESE NESTE TRANHIST (GN    UKVALIFISERT  )       */00007970
    /*                                                                */00007980
    /* ************************************************************** */00007990
                                                                        00008000
    P020_LES_NESTE_TRANHIST:                                            00008010
      PROC;                                                             00008020
                                                                        00008030
      CALL PLITDLI                              (W02_PARM_CT_5,         00008040
                                                 W02_GN,                00008050
                                                 RF1,                   00008060
                                                 W01_IO,                00008070
                                                 SSA1_RF0PERSN,         00008080
                                                 SSA1_TRANHIST_CMD);    00008090
                                                                        00008100
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00008110
        DO;                                                             00008120
          SELECT ( RF1.STATUS_KODE );                                   00008130
                                                                        00008140
            WHEN ( '  ' , 'GA' , 'GK' )                                 00008150
              W01.MER_DATA                 =    '1'B;                   00008160
                                                                        00008170
            WHEN ( 'GE' , 'GB' )                                        00008180
              W01.MER_DATA                 =    '0'B;                   00008190
                                                                        00008200
            OTHERWISE                                                   00008210
              DO;                                                       00008220
                /* ************************************************** */00008230
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00008240
                /* ************************************************** */00008250
  L150:                                                                 00008260
                FEIL_MELD_NR               =     500;                   00008270
                FEIL_VED_LABEL             =    '150';                  00008280
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00008290
              END;                                                      00008300
          END;                                                          00008310
        END;                                                            00008320
      ELSE                                                              00008330
        DO;                                                             00008340
          /* ************************************************** */      00008350
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00008360
          /* ************************************************** */      00008370
  L160:                                                                 00008380
          FEIL_MELD_NR               =     500;                         00008390
          FEIL_VED_LABEL             =    '160';                        00008400
        END;                                                            00008410
    END P020_LES_NESTE_TRANHIST;                                        00008420
                                                                        00008430
                                                                        00008440
                                                                        00008450
                                                                        00008460
                                                                        00008470
    /* ************************************************************ */  00008480
    /*                                                              */  00008490
    /*  LESER NESTE TRANS MED :                   VTP  >   VTP.NS   */  00008500
    /*                                                              */  00008510
    /* ************************************************************ */  00008520
                                                                        00008530
    P030_LES_TRANHIST_GN_QUAL:                                          00008540
      PROC;                                                             00008550
                                                                        00008560
      CALL PLITDLI                              (W02_PARM_CT_5,         00008570
                                                 W02_GN,                00008580
                                                 RF1,                   00008590
                                                 W01_IO,                00008600
                                                 SSA1_RF0PERSN,         00008610
                                                 SSA1_TRANHIST);        00008620
                                                                        00008630
                                                                        00008640
                                                                        00008650
      IF   UIBFCTR                        ^=     UIB_RC_OK    THEN      00008660
        DO;                                                             00008670
          /* ************************************************** */      00008680
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00008690
          /* ************************************************** */      00008700
  L170:                                                                 00008710
          FEIL_MELD_NR               =     500;                         00008720
          FEIL_VED_LABEL             =    '170';                        00008730
          GO   TO  RETUR;                                               00008740
        END;                                                            00008750
                                                                        00008760
      SELECT ( RF1.STATUS_KODE );                                       00008770
                                                                        00008780
        WHEN ( '  ' , 'GA' , 'GK' )                                     00008790
          DO;                                                           00008800
            /* ************************************** */                00008810
            /*  VTP LEST TRANS    >    VTP NST SISTE  */                00008820
            /* ************************************** */                00008830
                                                                        00008840
            W01.MER_DATA                   =    '1'B;                   00008850
          END;                                                          00008860
                                                                        00008870
        WHEN ( 'GE' , 'GB' )                                            00008880
          DO;                                                           00008890
            /* ************************************** */                00008900
            /*  FINNES INGEN TRANS                    */                00008910
            /* ************************************** */                00008920
                                                                        00008930
            W01.MER_DATA         =   '0'B;                              00008940
          END;                                                          00008950
                                                                        00008960
        OTHERWISE                                                       00008970
          DO;                                                           00008980
            /* ************************************************** */    00008990
            /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */    00009000
            /* ************************************************** */    00009010
                                                                        00009020
  L180:                                                                 00009030
            DB_STATUS_KODE             =     RF1.STATUS_KODE;           00009040
            FEIL_MELD_NR               =     500;                       00009050
            FEIL_VED_LABEL             =    '180';                      00009060
          END;                                                          00009070
                                                                        00009080
      END;  /*      SELECT  (RF1.STATUS_KODE)                      */   00009090
                                                                        00009100
  RETUR:                                                                00009110
    END P030_LES_TRANHIST_GN_QUAL;                                      00009120
                                                                        00009130
                                                                        00009140
                                                                        00009150
    /* ********************************************************* */     00009160
    /*                                                           */     00009170
    /* *****  PROC SOM KALLER RIKTIG BLANKETT-OMRÅDET  *******   */     00009180
    /*                                                           */     00009190
    /* ********************************************************* */     00009200
                                                                        00009210
    P040_OVERFØR_TIL_BLANKETT:                                          00009220
      PROC;                                                             00009230
                                                                        00009240
                                                                        00009250
      W01.VIRK_DATO_ÅM                  =  TRANHIST.VIRK_DATO_ÅM    ;   00009260
      TRANS_OPPL_OMR.FØDSNUMMER         =  SEARCH_FNR               ;   00009270
      TRANS_OPPL_OMR.BLANKETTYPE        =  TRANHIST.GRBLKODE        ;   00009280
      TRANS_OPPL_OMR.TRANS_RETURKODE    =  TRANHIST.TRANS_RETURKODE ;   00009290
      TRANS_OPPL_OMR.REG_DATO_ÅMD       =  TRANHIST.REGDATO_ÅMD     ;   00009300
      TRANS_OPPL_OMR.VIRKNINGSDATO      =  F_SNU_DATO                   00009310
                                            (W01.VIRK_DATO_ÅM)      ;   00009320
                                                                        00009330
      SELECT ( TRANHIST.GRBLKODE );                                     00009340
                                                                        00009350
        WHEN ( 'AP' )                                                   00009360
          /* **************************************************** */    00009370
          /*  ALDERSPENSJON                                       */    00009380
          /* **************************************************** */    00009390
          DO;                                                           00009400
             CALL P050_LES_AP_TRANS;                                    00009410
                                                                        00009420
             IF   FEIL_MELD_NR              >      0       THEN         00009430
               DO;                                                      00009440
                  /* ******************************************** */    00009450
                  /* FEIL VED SKRIV AV :  TRANS                   */    00009460
                  /* ******************************************** */    00009470
                                                                        00009480
                  GO TO RETUR;                                          00009490
               END;                                                     00009500
          END;                                                          00009510
                                                                        00009520
        WHEN ( 'A1' )                                                   00009530
          /* **************************************************** */    00009540
          /*  ALDERSPENSJON                                       */    00009550
          /* **************************************************** */    00009560
          DO;                                                           00009570
             CALL P050_LES_A1_TRANS;                                    00009580
                                                                        00009590
             IF   FEIL_MELD_NR              >      0       THEN         00009600
               DO;                                                      00009610
                  /* ******************************************** */    00009620
                  /* FEIL VED SKRIV AV :  TRANS                   */    00009630
                  /* ******************************************** */    00009640
                                                                        00009650
                  GO TO RETUR;                                          00009660
               END;                                                     00009670
          END;                                                          00009680
                                                                        00009690
        WHEN ( 'AF' )                                                   00009700
          /* **************************************************** */    00009710
          /*  AVTALEFESTET PENSJON   - AFP                        */    00009720
          /* **************************************************** */    00009730
          DO;                                                           00009740
             CALL P190_LES_AF_TRANS;                                    00009750
                                                                        00009760
             IF   FEIL_MELD_NR              >      0       THEN         00009770
               DO;                                                      00009780
                  /* ******************************************** */    00009790
                  /* FEIL VED LES AV :  TRANS                     */    00009800
                  /* ******************************************** */    00009810
                                                                        00009820
                  GO TO RETUR;                                          00009830
               END;                                                     00009840
          END;                                                          00009850
                                                                        00009860
                                                                        00009870
        WHEN ( 'KF' )                                                   00009880
                                                                        00009890
          /* **************************************************** */    00009900
          /*  AVTALEFESTET PENSJON   - AFP                        */    00009910
          /* **************************************************** */    00009920
          DO;                                                           00009930
             CALL P190_LES_KF_TRANS;                                    00009940
                                                                        00009950
             IF   FEIL_MELD_NR              >      0       THEN         00009960
               DO;                                                      00009970
                                                                        00009980
                  /* ******************************************** */    00009990
                  /* FEIL VED LES AV :  TRANS                     */    00010000
                  /* ******************************************** */    00010010
                                                                        00010020
                  GO TO RETUR;                                          00010030
               END;                                                     00010040
          END;                                                          00010050
                                                                        00010060
        WHEN ( 'UP' )                                                   00010070
          /* **************************************************** */    00010080
          /*  UFØREPENSJON                                        */    00010090
          /* **************************************************** */    00010100
          DO;                                                           00010110
             CALL P060_LES_UP_TRANS;                                    00010120
                                                                        00010130
             IF   FEIL_MELD_NR              >      0       THEN         00010140
               DO;                                                      00010150
                  /* ******************************************** */    00010160
                  /* FEIL VED SKRIV AV TRANS                      */    00010170
                  /* ******************************************** */    00010180
                                                                        00010190
                  GO TO RETUR;                                          00010200
               END;                                                     00010210
          END;                                                          00010220
        WHEN ( 'U2' )                                                   00010230
          /* **************************************************** */    00010240
          /*  UFØREPENSJON                                        */    00010250
          /* **************************************************** */    00010260
          DO;                                                           00010270
             CALL P060_LES_U2_TRANS;                                    00010280
                                                                        00010290
             IF   FEIL_MELD_NR              >      0       THEN         00010300
               DO;                                                      00010310
                  /* ******************************************** */    00010320
                  /* FEIL VED SKRIV AV TRANS                      */    00010330
                  /* ******************************************** */    00010340
                                                                        00010350
                  GO TO RETUR;                                          00010360
               END;                                                     00010370
          END;                                                          00010380
                                                                        00010390
        WHEN ( 'U3' )                                                   00010400
          /* **************************************************** */    00010410
          /*  UFØREPENSJON                                        */    00010420
          /* **************************************************** */    00010430
          DO;                                                           00010440
             CALL P060_LES_U3_TRANS;                                    00010450
                                                                        00010460
             IF   FEIL_MELD_NR              >      0       THEN         00010470
               DO;                                                      00010480
                  /* ******************************************** */    00010490
                  /* FEIL VED SKRIV AV TRANS                      */    00010500
                  /* ******************************************** */    00010510
                                                                        00010520
                  GO TO RETUR;                                          00010530
               END;                                                     00010540
          END;                                                          00010550
                                                                        00010560
 /*UF*/ WHEN ( 'UF' )                                                   00010570
 /*UF*/   /* **************************************************** */    00010580
 /*UF*/   /*  UNGE UFØRE FØR 1967                                 */    00010590
 /*UF*/   /* **************************************************** */    00010600
 /*UF*/   DO;                                                           00010610
 /*UF*/      CALL P183_LES_UF_TRANS;                                    00010620
 /*UF*/                                                                 00010630
 /*UF*/      IF   FEIL_MELD_NR              >      0       THEN         00010640
 /*UF*/        DO;                                                      00010650
 /*UF*/           /* ******************************************** */    00010660
 /*UF*/           /* FEIL VED SKRIV AV TRANS                      */    00010670
 /*UF*/           /* ******************************************** */    00010680
 /*UF*/                                                                 00010690
 /*UF*/           GO TO RETUR;                                          00010700
 /*UF*/        END;                                                     00010710
 /*UF*/   END;                                                          00010720
                                                                        00010730
        WHEN ( 'EP' )                                                   00010740
          /* **************************************************** */    00010750
          /*  ETTERLATT-PENSJON                                   */    00010760
          /* **************************************************** */    00010770
          DO;                                                           00010780
             CALL P080_LES_EP_TRANS;                                    00010790
                                                                        00010800
             IF   FEIL_MELD_NR              >      0       THEN         00010810
               DO;                                                      00010820
                  /* ******************************************** */    00010830
                  /* FEIL VED SKRIV AV TRANS                      */    00010840
                  /* ******************************************** */    00010850
                                                                        00010860
                  GO TO RETUR;                                          00010870
               END;                                                     00010880
          END;                                                          00010890
                                                                        00010900
        WHEN ( 'E3' )                                                   00010910
          /* **************************************************** */    00010920
          /*  ETTERLATT-PENSJON                                   */    00010930
          /* **************************************************** */    00010940
          DO;                                                           00010950
             CALL P080_LES_E3_TRANS;                                    00010960
                                                                        00010970
             IF   FEIL_MELD_NR              >      0       THEN         00010980
               DO;                                                      00010990
                  /* ******************************************** */    00011000
                  /* FEIL VED SKRIV AV TRANS                      */    00011010
                  /* ******************************************** */    00011020
                                                                        00011030
                  GO TO RETUR;                                          00011040
               END;                                                     00011050
          END;                                                          00011060
                                                                        00011070
        WHEN ( 'EE' )                                                   00011080
          /* **************************************************** */    00011090
          /*  ETTERLATT-PENSJON                                   */    00011100
          /* **************************************************** */    00011110
          DO;                                                           00011120
             CALL P080_LES_EE_TRANS;                                    00011130
                                                                        00011140
             IF   FEIL_MELD_NR              >      0       THEN         00011150
               DO;                                                      00011160
                  /* ******************************************** */    00011170
                  /* FEIL VED SKRIV AV TRANS                      */    00011180
                  /* ******************************************** */    00011190
                                                                        00011200
                  GO TO RETUR;                                          00011210
               END;                                                     00011220
          END;                                                          00011230
                                                                        00011240
        WHEN ( 'EF' )                                                   00011250
          /* **************************************************** */    00011260
          /*  ETTERLATT FAMILIEPLEIER                             */    00011270
          /* **************************************************** */    00011280
          DO;                                                           00011290
             CALL P090_LES_EF_TRANS;                                    00011300
                                                                        00011310
             IF   FEIL_MELD_NR              >      0       THEN         00011320
               DO;                                                      00011330
                  /* ******************************************** */    00011340
                  /* FEIL VED SKRIV AV TRANS                      */    00011350
                  /* ******************************************** */    00011360
                                                                        00011370
                  GO TO RETUR;                                          00011380
               END;                                                     00011390
          END;                                                          00011400
                                                                        00011410
        WHEN ( 'E4' )                                                   00011420
          /* **************************************************** */    00011430
          /*  ETTERLATT FAMILIEPLEIER                             */    00011440
          /* **************************************************** */    00011450
          DO;                                                           00011460
             CALL P090_LES_E4_TRANS;                                    00011470
                                                                        00011480
             IF   FEIL_MELD_NR              >      0       THEN         00011490
               DO;                                                      00011500
                  /* ******************************************** */    00011510
                  /* FEIL VED SKRIV AV TRANS                      */    00011520
                  /* ******************************************** */    00011530
                                                                        00011540
                  GO TO RETUR;                                          00011550
               END;                                                     00011560
          END;                                                          00011570
                                                                        00011580
        WHEN ( 'FB' )                                                   00011590
          /* **************************************************** */    00011600
          /*  FORELDRELØSE BARN                                   */    00011610
          /* **************************************************** */    00011620
          DO;                                                           00011630
             CALL P100_LES_FB_TRANS;                                    00011640
                                                                        00011650
             IF   FEIL_MELD_NR              >      0       THEN         00011660
               DO;                                                      00011670
                  /* ******************************************** */    00011680
                  /* FEIL VED SKRIV AV TRANS                      */    00011690
                  /* ******************************************** */    00011700
                                                                        00011710
                  GO TO RETUR;                                          00011720
               END;                                                     00011730
          END;                                                          00011740
                                                                        00011750
        WHEN ( 'BP' )                                                   00011760
          /* **************************************************** */    00011770
          /*  BANEPENSJONIST                                      */    00011780
          /* **************************************************** */    00011790
          DO;                                                           00011800
             CALL P110_LES_BP_TRANS;                                    00011810
                                                                        00011820
             IF   FEIL_MELD_NR              >      0       THEN         00011830
               DO;                                                      00011840
                  /* ******************************************** */    00011850
                  /* FEIL VED SKRIV AV TRANS                      */    00011860
                  /* ******************************************** */    00011870
                                                                        00011880
                  GO TO RETUR;                                          00011890
               END;                                                     00011900
          END;                                                          00011910
                                                                        00011920
        WHEN ( 'B6' )                                                   00011930
          /* **************************************************** */    00011940
          /*  BANEPENSJONIST                                      */    00011950
          /* **************************************************** */    00011960
          DO;                                                           00011970
             CALL P110_LES_B6_TRANS;                                    00011980
                                                                        00011990
             IF   FEIL_MELD_NR              >      0       THEN         00012000
               DO;                                                      00012010
                  /* ******************************************** */    00012020
                  /* FEIL VED SKRIV AV TRANS                      */    00012030
                  /* ******************************************** */    00012040
                                                                        00012050
                  GO TO RETUR;                                          00012060
               END;                                                     00012070
          END;                                                          00012080
                                                                        00012090
        WHEN ( 'FT' )                                                   00012100
          /* **************************************************** */    00012110
          /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */    00012120
          /* **************************************************** */    00012130
          DO;                                                           00012140
             CALL P120_LES_FT_TRANS;                                    00012150
                                                                        00012160
             IF   FEIL_MELD_NR              >      0       THEN         00012170
               DO;                                                      00012180
                  /* ******************************************** */    00012190
                  /* FEIL VED SKRIV AV TRANS                      */    00012200
                  /* ******************************************** */    00012210
                                                                        00012220
                  GO TO RETUR;                                          00012230
               END;                                                     00012240
          END;                                                          00012250
                                                                        00012260
        WHEN ( 'F7' )                                                   00012270
          /* **************************************************** */    00012280
          /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */    00012290
          /* **************************************************** */    00012300
          DO;                                                           00012310
             CALL P120_LES_F7_TRANS;                                    00012320
                                                                        00012330
             IF   FEIL_MELD_NR              >      0       THEN         00012340
               DO;                                                      00012350
                  /* ******************************************** */    00012360
                  /* FEIL VED SKRIV AV TRANS                      */    00012370
                  /* ******************************************** */    00012380
                                                                        00012390
                  GO TO RETUR;                                          00012400
               END;                                                     00012410
          END;                                                          00012420
                                                                        00012430
        WHEN ( 'FO' )                                                   00012440
          /* **************************************************** */    00012450
          /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */    00012460
          /* **************************************************** */    00012470
          DO;                                                           00012480
             CALL P120_LES_FO_TRANS;                                    00012490
                                                                        00012500
             IF   FEIL_MELD_NR              >      0       THEN         00012510
               DO;                                                      00012520
                  /* ******************************************** */    00012530
                  /* FEIL VED SKRIV AV TRANS                      */    00012540
                  /* ******************************************** */    00012550
                                                                        00012560
                  GO TO RETUR;                                          00012570
               END;                                                     00012580
          END;                                                          00012590
                                                                        00012600
        WHEN ( 'E1' )                                                   00012610
          /* **************************************************** */    00012620
          /*  ENDRINGSBLANKETT                                    */    00012630
          /* **************************************************** */    00012640
          DO;                                                           00012650
             CALL P140_LES_E1_TRANS;                                    00012660
                                                                        00012670
             IF   FEIL_MELD_NR              >      0       THEN         00012680
               DO;                                                      00012690
                  /* ******************************************** */    00012700
                  /* FEIL VED SKRIV AV TRANS                      */    00012710
                  /* ******************************************** */    00012720
                                                                        00012730
                  GO TO RETUR;                                          00012740
               END;                                                     00012750
          END;                                                          00012760
                                                                        00012770
        WHEN ( 'EN' )                                                   00012780
          /* **************************************************** */    00012790
          /*  ENDRINGSBLANKETT - EN                               */    00012800
          /* **************************************************** */    00012810
          DO;                                                           00012820
             CALL P140_LES_EN_TRANS;                                    00012830
                                                                        00012840
             IF   FEIL_MELD_NR              >      0       THEN         00012850
               DO;                                                      00012860
                  /* ******************************************** */    00012870
                  /* FEIL VED SKRIV AV TRANS                      */    00012880
                  /* ******************************************** */    00012890
                                                                        00012900
                  GO TO RETUR;                                          00012910
               END;                                                     00012920
          END;                                                          00012930
                                                                        00012940
        WHEN ( 'O1' )                                                   00012950
          /* **************************************************** */    00012960
          /*  OPPHØRSBLANKETT .   DØD                             */    00012970
          /* **************************************************** */    00012980
          DO;                                                           00012990
             CALL P160_LES_O1_TRANS;                                    00013000
                                                                        00013010
             IF   FEIL_MELD_NR              >      0       THEN         00013020
               DO;                                                      00013030
                  /* ******************************************** */    00013040
                  /* FEIL VED SKRIV AV TRANS                      */    00013050
                  /* ******************************************** */    00013060
                                                                        00013070
                  GO TO RETUR;                                          00013080
               END;                                                     00013090
          END;                                                          00013100
                                                                        00013110
        WHEN ( 'O2' )                                                   00013120
          /* **************************************************** */    00013130
          /*  ANDRE OPPHØRSÅRSAKER                                */    00013140
          /* **************************************************** */    00013150
          DO;                                                           00013160
             CALL P170_LES_O2_TRANS;                                    00013170
                                                                        00013180
             IF   FEIL_MELD_NR              >      0       THEN         00013190
               DO;                                                      00013200
                  /* ******************************************** */    00013210
                  /* FEIL VED SKRIV AV TRANS                      */    00013220
                  /* ******************************************** */    00013230
                                                                        00013240
                  GO TO RETUR;                                          00013250
               END;                                                     00013260
          END;                                                          00013270
        WHEN ( 'US' )                                                   00013280
          /* **************************************************** */    00013290
          /*  ANDRE OPPHØRSÅRSAKER                                */    00013300
          /* **************************************************** */    00013310
          DO;                                                           00013320
             CALL P070_LES_US_TRANS;                                    00013330
                                                                        00013340
             IF   FEIL_MELD_NR              >      0       THEN         00013350
               DO;                                                      00013360
                  /* ******************************************** */    00013370
                  /* FEIL VED SKRIV AV TRANS                      */    00013380
                  /* ******************************************** */    00013390
                                                                        00013400
                  GO TO RETUR;                                          00013410
               END;                                                     00013420
          END;                                                          00013430
        OTHERWISE                                                       00013440
          /* **************************************************** */    00013450
          /*  FÅTT EN UKJENT TRANS-TYPE . KJØRING AVBRYTES        */    00013460
          /* **************************************************** */    00013470
          DO;                                                           00013480
   L190:                                                                00013490
             FEIL_MELD_NR           =   497;                            00013500
             FEIL_VED_LABEL         =  '190';                           00013510
          END;                                                          00013520
                                                                        00013530
      END;   /* *****      SELECT ( TRANSTYPE )            ****** */    00013540
                                                                        00013550
  RETUR:                                                                00013560
                                                                        00013570
    END P040_OVERFØR_TIL_BLANKETT;                                      00013580
                                                                        00013590
                                                                        00013600
  %INCLUDE R0015205;             /*  P050_LES_AP_TRANS            */    00013610
                                                                        00013620
  %INCLUDE R00152N5;             /*  P050_LES_A1_TRANS            */    00013630
                                                                        00013640
  %INCLUDE R0015206;             /*  P060_LES_UP_TRANS            */    00013650
  %INCLUDE R00152N6;             /*  P060_LES_U2_TRANS            */    00013660
  %INCLUDE R00152U6;             /*  P060_LES_U3_TRANS            */    00013670
                                                                        00013680
  %INCLUDE R0015207;             /*  P070_LES_US_TRANS            */    00013690
                                                                        00013700
  %INCLUDE R0015208;             /*  P080_LES_EP_TRANS            */    00013710
  %INCLUDE R00152N8;             /*  P080_LES_E3_TRANS            */    00013720
  %INCLUDE R00152U8;             /*  P080_LES_EE_TRANS            */    00013730
                                                                        00013740
  %INCLUDE R0015209;             /*  P090_LES_EF_TRANS            */    00013750
  %INCLUDE R00152N9;             /*  P090_LES_E4_TRANS            */    00013760
                                                                        00013770
  %INCLUDE R0015210;             /*  P090_LES_FB_TRANS            */    00013780
                                                                        00013790
  %INCLUDE R0015211;             /*  P110_LES_BP_TRANS            */    00013800
  %INCLUDE R00152NB;             /*  P110_LES_B6_TRANS            */    00013810
                                                                        00013820
  %INCLUDE R0015212;             /*  P120_LES_FT_TRANS            */    00013830
  %INCLUDE R00152NC;             /*  P120_LES_F7_TRANS            */    00013840
  %INCLUDE R00152UC;             /*  P120_LES_FO_TRANS            */    00013850
                                                                        00013860
  %INCLUDE R0015214;             /*  P140_LES_E1_TRANS            */    00013870
  %INCLUDE R00152UE;             /*  P140_LES_EN_TRANS            */    00013880
                                                                        00013890
  %INCLUDE R0015216;             /*  P160_LES_O1_TRANS            */    00013900
                                                                        00013910
  %INCLUDE R0015217;             /*  P170_LES_O2_TRANS            */    00013920
                                                                        00013930
  %INCLUDE R0015219;             /*  P190_LES_AF_TRANS   */             00013940
  %INCLUDE R00152UJ;             /*   P190_LES_KF_TRANS   */            00013950
                                                                        00013960
                                                                        00013970
  %INCLUDE R0015220;             /*  P183_LES_UF_TRANS         UF*/     00013980
                                                                        00013990
                                                                        00014000
  %INCLUDE R0019913;             /*  F_SNU_DATO                   */    00014010
                                                                        00014020
  L999:                                                                 00014030
                                                                        00014040
    EXEC CICS RETURN;                                                   00014050
  END R001520;                                                          00014060
