 /*       SIST ENDRET 11/02-97 13.57.35 AV   JDA7339                  */00000000
 /*       SIST ENDRET 12/10-95 14.24.51 AV   JDA0310                  */00000010
 /*       SIST ENDRET 06/09-94 11.18.32 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 15/03-94 13.57.47 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 25/02-94 13.03.45 AV   HERMAN                   */00000040
 /*       SIST ENDRET 29/04-91 09.07.41 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 06/03-91 14.33.32 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 16/10-89 13.08.10 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 14/12-88 14.20.30 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 03/05-84 14.52.58 AV   FARVIK                   */00000090
 /*       SIST ENDRET 05/10-82 14.53.25 AV   OLSEN                    */00000100
 /*       SIST ENDRET 24/05-82 12.38.00 AV   KRISTENSEN               */00000110
 /* ***************************************************************** */00000120
 /*IDENTIFIKASJON:                                                    */00000130
 /*    R0013301 - HOVEDPROGRAM I CICS/PLI                             */00000140
 /*    PROGRAMMERER: KRISTENSEN, FEB 1982                             */00000150
 /*HENSIKT:                                                           */00000160
 /*    PROGRAMMET SJEKKER HVILKEN BLANKETTYPE EN HAR OG GIR KONTROLL  */00000170
 /*    TIL DET AKTUELLE DIALOGPROGRAM SOM SENDER UT TRANSAKSJONS-     */00000180
 /*    BILDET MED FEILMELDINGER.                                      */00000190
 /*PROGRAMTILKNYTNING:                                                */00000200
 /*    PROGRAMMET BLIR LINKET FRA R0013501 ELLER R0013601.            */00000210
 /*BRUK:                                                              */00000220
 /*    EXEC CICS LINK PROGRAM('R0013301') COMMAREA(KOM_OMR);          */00000230
 /* ***************************************************************** */00000240
 R001330:                                                               00000250
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000260
 %PAGE;                                                                 00000270
 %INCLUDE P0019906;         /*  TRANS-OPPL-OMR   */                     00000280
 %PAGE;                                                                 00000290
 %INCLUDE P0019908;         /*  KOM_OMR          */                     00000300
 %PAGE;                                                                 00000310
   DCL                                                                  00000320
        COMMAREA_PEKER       PTR;                                       00000330
                                                                        00000340
   DCL (SUSBTR )                  BUILTIN;                              00000350
 %SKIP(3);                                                              00000360
                                                                        00000370
                                                                        00000380
    TRANS_OPPL_OMR.TRANSKODE = TRANS_OPPL_OMR.TRANS_RETURKODE;          00000390
                                                                        00000400
      SELECT(TRANS_OPPL_OMR.BLANKETTYPE);                               00000410
         WHEN('AP')                                                     00000420
            EXEC CICS XCTL PROGRAM('R0010501') COMMAREA(KOM_OMR);       00000430
         WHEN('A1')                                                     00000440
                 EXEC CICS XCTL PROGRAM('R001N501') COMMAREA(KOM_OMR);  00000450
         WHEN('AF')                                                     00000460
            EXEC CICS XCTL PROGRAM('R0011901') COMMAREA(KOM_OMR);       00000470
         WHEN('KF')                                                     00000480
            EXEC CICS XCTL PROGRAM('R001UJ01') COMMAREA(KOM_OMR);       00000490
         WHEN('UF')                                                     00000500
            EXEC CICS XCTL PROGRAM('R0011831') COMMAREA(KOM_OMR);       00000510
         WHEN('UP')                                                     00000520
            EXEC CICS XCTL PROGRAM('R0010601') COMMAREA(KOM_OMR);       00000530
         WHEN('U2')                                                     00000540
            EXEC CICS XCTL PROGRAM('R001N601') COMMAREA(KOM_OMR);       00000550
         WHEN('U3')                                                     00000560
            EXEC CICS XCTL PROGRAM('R001U601') COMMAREA(KOM_OMR);       00000570
         WHEN('US')                                                     00000580
            EXEC CICS XCTL PROGRAM('R0010701') COMMAREA(KOM_OMR);       00000590
         WHEN('EP')                                                     00000600
            EXEC CICS XCTL PROGRAM('R0010801') COMMAREA(KOM_OMR);       00000610
         WHEN('E3')                                                     00000620
            EXEC CICS XCTL PROGRAM('R001N801') COMMAREA(KOM_OMR);       00000630
         WHEN('EE')                                                     00000640
            EXEC CICS XCTL PROGRAM('R001U801') COMMAREA(KOM_OMR);       00000650
         WHEN('EF')                                                     00000660
            EXEC CICS XCTL PROGRAM('R0010901') COMMAREA(KOM_OMR);       00000670
         WHEN('E4')                                                     00000680
            EXEC CICS XCTL PROGRAM('R001N901') COMMAREA(KOM_OMR);       00000690
         WHEN('FB')                                                     00000700
            EXEC CICS XCTL PROGRAM('R0011001') COMMAREA(KOM_OMR);       00000710
         WHEN('BP')                                                     00000720
            EXEC CICS XCTL PROGRAM('R0011101') COMMAREA(KOM_OMR);       00000730
         WHEN('B6')                                                     00000740
            EXEC CICS XCTL PROGRAM('R001NB01') COMMAREA(KOM_OMR);       00000750
         WHEN('FT')                                                     00000760
            EXEC CICS XCTL PROGRAM('R0011201') COMMAREA(KOM_OMR);       00000770
         WHEN('F7')                                                     00000780
            EXEC CICS XCTL PROGRAM('R001NC01') COMMAREA(KOM_OMR);       00000790
      /*  PROGRAM ER      FULSTENDIG   6.9.94 SP */                     00000800
         WHEN('FO')                                                     00000810
            EXEC CICS XCTL PROGRAM('R001UC01') COMMAREA(KOM_OMR);       00000820
                                                                        00000830
         WHEN('TG')                                                     00000840
            EXEC CICS XCTL PROGRAM('R0011301') COMMAREA(KOM_OMR);       00000850
         WHEN('E1')                                                     00000860
            EXEC CICS XCTL PROGRAM('R0011401') COMMAREA(KOM_OMR);       00000870
         WHEN('EN')                                                     00000880
            EXEC CICS XCTL PROGRAM('R001UE01') COMMAREA(KOM_OMR);       00000890
         WHEN('E2')                                                     00000900
            EXEC CICS XCTL PROGRAM('R0011501') COMMAREA(KOM_OMR);       00000910
         WHEN('O1')                                                     00000920
            EXEC CICS XCTL PROGRAM('R0011601') COMMAREA(KOM_OMR);       00000930
         WHEN('O2')                                                     00000940
            EXEC CICS XCTL PROGRAM('R0011701') COMMAREA(KOM_OMR);       00000950
         WHEN('NI')                                                     00000960
            EXEC CICS XCTL PROGRAM('R001I401') COMMAREA(KOM_OMR);       00000970
         OTHERWISE                                                      00000980
            ;                                                           00000990
        END;                                                            00001000
   END R001330;                                                         00001010
