 /*       SIST ENDRET 24/10-97 11.55.40 AV   JDA7339                  */00000000
 /*       SIST ENDRET 04/08-97 14.09.09 AV   JDA7339                  */00000010
 /*       SIST ENDRET 11/02-97 10.36.33 AV   JDA7339                  */00000020
 /*       SIST ENDRET 03/07-95 14.20.11 AV   JDA0310                  */00000030
 /*       SIST ENDRET 23/06-95 11.59.53 AV   JDA0310                  */00000040
 /*       SIST ENDRET 31/10-94 09.13.40 AV   JDA0310                  */00000050
 /*       SIST ENDRET 27/10-94 09.31.28 AV   JDA0310                  */00000060
 /*       SIST ENDRET 15/03-94 13.50.25 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 25/02-94 12.34.00 AV   HERMAN                   */00000080
 /*IDENTIFIKASJON:                                                    */00000090
 /*    R001UE06 - PROSEDYRE I PLI                                     */00000100
 /*    PROGRAMMERER:                                                  */00000110
 /*HENSIKT:                                                           */00000120
 /*    PROGRAMMET INNEHOLDER:                                         */00000130
 /*        PROSEDYRER FOR Å OVERFØRE DATA FRA EN_TRANS_OMR TIL        */00000140
 /*            SKJERMBILDE (MAP S001UE1 MAPSET S001UE3).              */00000150
 /*    PROSEDYRE FOR SKRIVING AV FEILMELDINGER.                       */00000160
 /*BRUK:                                                              */00000170
 /*    OVERFØR_ENSØKER_MAP:    OVERFØRING AV SØKERDELEN               */00000180
 /*    OVERFØR_ENKAP7_MAP:     OVERFØRING AV KAPITTEL 7               */00000190
 /*    OVERFØR_ENKAP8_MAP:     OVERFØRING AV KAPITTEL 8               */00000200
 /*    OVERFØR_ENKAP10_MAP:    OVERFØRING AV KAPITTEL 10              */00000210
 /*    OVERFØR_ENKAP11_MAP:    OVERFØRING AV KAPITTEL 11        */      00000220
 /*    OVERFØR_EN_INNTEKT_MAP:                                  */      00000230
 /*    OVERFØR_EN_SPES:                                         */      00000240
 /*                                                                   */00000250
 /*                                                                   */00000260
 %PAGE;                                /*   */                          00000270
 /* ***************************************************************** */00000280
 /*                                                                   */00000290
 /*   PROSEDYRA OVERFØRER DATA FRA EN_TRANS_OMR.ENS TIL               */00000300
 /*   SKJERMBILDE EN_SØKER DELEN.                                     */00000310
 /*   MAP: S001UE1                                                    */00000320
 /*   MAPSET: S001143                                                 */00000330
 /*                                                                   */00000340
 /* ***************************************************************** */00000350
 %SKIP(2);                                                              00000360
 OVERFØR_ENSØKER_MAP:                                                   00000370
   PROC;                                                                00000380
   DCL                                                                  00000390
      NORMAL  CHAR (1) INIT(' '),                                       00000400
      NOR_NUM CHAR (1) INIT('&'),                                       00000410
      BRI_NUM CHAR (1) INIT('Q');                                       00000420
 %SKIP(2);                                                              00000430
      S001UE1O.REGDATOO        =  F_FELT_PIC_CHAR6 (ENS.REGDATO);       00000440
      S001UE1O.TERMIDO         =  ENS.TERMID                    ;       00000450
      S001UE1O.FNRO            =  F_FELT_PIC_CHAR11 (ENS.FNR)   ;       00000460
      S001UE1O.TKNRO           =  (ENS.TKNR)   ;                        00000470
      S001UE1O.SPRÅKO          =  ENS.SPRÅK                     ;       00000480
      S001UE1O.VIRK_DATO_MÅO   =  ENS.VIRK_DATO_MÅ              ;       00000490
      S001UE1O.NAVN_NYTTO      =  ENS.NAVN_NYTT                 ;       00000500
      S001UE1O.NAVN_NYTT_EKO   =  ENS.NAVN_NYTT_EK              ;       00000510
                                                                        00000520
      IF F_FELT_PIC_CHAR11(ENS.FNR_EK) ^= (11)'0' THEN                  00000530
         DO;                                                            00000540
           S001UE1O.FNR_EKO         =  (ENS.FNR_EK);                    00000550
 /* **      IF ENS.FLYTTET_SAMMEN ^= ' '       THEN                     00000560
               IF F_KJØNN(ENS.FNR) = F_KJØNN(ENS.FNR_EK)    THEN        00000570
                  S001UE1O.SIVILSTANDO     =  'P';                      00000580
               ELSE                                                     00000590
                  S001UE1O.SIVILSTANDO     =  'W';                      00000600
            ELSE                                                        00000610
                  S001UE1O.SIVILSTANDO     =  'G';                      00000620
   ***************************************************** 0797 HL */     00000630
                                                                        00000640
         END;                                                           00000650
                                                                        00000660
      S001UE1O.NAVN_EKO        =  ENS.NAVN_EK                   ;       00000670
      S001UE1O.SKILSMISSEO     =  ENS.SKILSMISSE                ;       00000680
      S001UE1O.FLYTTET_FRAO    =  ENS.FLYTTET_FRA               ;       00000690
      S001UE1O.FLYTTET_SAMMENO =  ENS.FLYTTET_SAMMEN            ;       00000700
      S001UE1O.OPPHØR_SAMBOO   =  ENS.OPPHØR_SAMBO              ;       00000710
      S001UE1O.EK_INNT_OVER_2GO = ENS.EK_INNT_OVER_2G           ;       00000720
      S001UE1O.SIVILSTANDO     =  ENS.SIVILSTAND;    /*0797 HL*/        00000730
 %SKIP(3);                             /*    */                         00000740
                                                                        00000750
 /* FEILMELDINGER MARKERING AV  FELT (ATTRIBUTTENE) */                  00000760
                                                                        00000770
      S001UE1O.DUMMYA = '_';                                            00000780
                                                                        00000790
  /*DERSOM FEIL FRA BEHANDLE-TRANS OVERFØRES FEIL HER,BARE FØRSTE GANG*/00000800
       IF ^ FRA_CICS THEN                                               00000810
          DO;                                                           00000820
            IF FEIL_MELD_NR > 0 THEN                                    00000830
               CALL SKRIV_FEIL(FEIL_MELD_NR);                           00000840
             FEIL_MELD_NR = 0;                                          00000850
          END;                                                          00000860
                                                                        00000870
      S001UE1O.REGDATOA = DFHBMASK;                                     00000880
      S001UE1O.TERMIDA  = DFHBMASK;                                     00000890
                                                                        00000900
      IF ENS.FNRNR = 0 THEN                                             00000910
         S001UE1O.FNRA = NOR_NUM;                                       00000920
      ELSE                                                              00000930
         DO;                                                            00000940
            S001UE1O.FNRA = BRI_NUM;                                    00000950
            S001UE1I.FNRL = CURSOR_POS;                                 00000960
            IF ENS.FNRNR ^= 999 THEN                                    00000970
               CALL SKRIV_FEIL(ENS.FNRNR);                              00000980
         END;                                                           00000990
                                                                        00001000
      IF ENS.TKNRNR = 0 THEN                                            00001010
         S001UE1O.TKNRA = NOR_NUM;                                      00001020
      ELSE                                                              00001030
         DO;                                                            00001040
            S001UE1O.TKNRA = BRI_NUM;                                   00001050
            S001UE1I.TKNRL = CURSOR_POS;                                00001060
            IF ENS.TKNRNR ^= 999 THEN                                   00001070
               CALL SKRIV_FEIL(ENS.TKNRNR);                             00001080
         END;                                                           00001090
      IF ENS.SPRÅKNR = 0 THEN                                           00001100
         S001UE1O.SPRÅKA = NORMAL;                                      00001110
      ELSE                                                              00001120
         DO;                                                            00001130
            S001UE1O.SPRÅKA = DFHBMBRY;                                 00001140
            S001UE1I.SPRÅKL = CURSOR_POS;                               00001150
            IF ENS.SPRÅKNR ^= 999 THEN                                  00001160
               CALL SKRIV_FEIL(ENS.SPRÅKNR);                            00001170
         END;                                                           00001180
      IF ENS.VIRK_DATO_MÅNR = 0 THEN                                    00001190
         S001UE1O.VIRK_DATO_MÅA = NOR_NUM;                              00001200
      ELSE                                                              00001210
         DO;                                                            00001220
            S001UE1O.VIRK_DATO_MÅA = BRI_NUM;                           00001230
            S001UE1I.VIRK_DATO_MÅL = CURSOR_POS;                        00001240
            IF ENS.VIRK_DATO_MÅNR ^= 999 THEN                           00001250
               CALL SKRIV_FEIL(ENS.VIRK_DATO_MÅNR);                     00001260
         END;                                                           00001270
      IF ENS.NAVN_NYTTNR = 0 THEN                                       00001280
         S001UE1O.NAVN_NYTTA = NORMAL;                                  00001290
      ELSE                                                              00001300
         DO;                                                            00001310
            S001UE1O.NAVN_NYTTA = DFHBMBRY;                             00001320
            S001UE1I.NAVN_NYTTL = CURSOR_POS;                           00001330
            IF ENS.NAVN_NYTTNR ^= 999 THEN                              00001340
               CALL SKRIV_FEIL(ENS.NAVN_NYTTNR);                        00001350
         END;                                                           00001360
      IF ENS.NAVN_NYTT_EKNR = 0 THEN                                    00001370
         S001UE1O.NAVN_NYTT_EKA = NORMAL;                               00001380
      ELSE                                                              00001390
         DO;                                                            00001400
            S001UE1O.NAVN_NYTT_EKA = DFHBMBRY;                          00001410
            S001UE1I.NAVN_NYTT_EKL = CURSOR_POS;                        00001420
            IF ENS.NAVN_NYTT_EKNR ^= 999 THEN                           00001430
               CALL SKRIV_FEIL(ENS.NAVN_NYTT_EKNR);                     00001440
         END;                                                           00001450
      IF ENS.FNR_EKNR = 0 THEN                                          00001460
         S001UE1O.FNR_EKA = NOR_NUM;                                    00001470
      ELSE                                                              00001480
         DO;                                                            00001490
            S001UE1O.FNR_EKA = BRI_NUM;                                 00001500
            S001UE1I.FNR_EKL = CURSOR_POS;                              00001510
            IF ENS.FNR_EKNR ^= 999 THEN                                 00001520
               CALL SKRIV_FEIL(ENS.FNR_EKNR);                           00001530
         END;                                                           00001540
      IF ENS.NAVN_EKNR = 0 THEN                                         00001550
         S001UE1O.NAVN_EKA = NORMAL;                                    00001560
      ELSE                                                              00001570
         DO;                                                            00001580
            S001UE1O.NAVN_EKA = DFHBMBRY;                               00001590
            S001UE1I.NAVN_EKL = CURSOR_POS;                             00001600
            IF ENS.NAVN_EKNR ^= 999 THEN                                00001610
               CALL SKRIV_FEIL(ENS.NAVN_EKNR);                          00001620
         END;                                                           00001630
      IF ENS.SKILSMISSENR = 0 THEN                                      00001640
         S001UE1O.SKILSMISSEA = NORMAL;                                 00001650
      ELSE                                                              00001660
         DO;                                                            00001670
            S001UE1O.SKILSMISSEA = DFHBMBRY;                            00001680
            S001UE1I.SKILSMISSEL = CURSOR_POS;                          00001690
            IF ENS.SKILSMISSENR ^= 999 THEN                             00001700
               CALL SKRIV_FEIL(ENS.SKILSMISSENR);                       00001710
         END;                                                           00001720
 /*OPPHØR_SAMBO ER NYTT - HL*/                                          00001730
      IF ENS.OPPHØR_SAMBONR = 0 THEN                                    00001740
         S001UE1O.OPPHØR_SAMBOA = NORMAL;                               00001750
      ELSE                                                              00001760
         DO;                                                            00001770
            S001UE1O.OPPHØR_SAMBOA = DFHBMBRY;                          00001780
            S001UE1I.OPPHØR_SAMBOL = CURSOR_POS;                        00001790
            IF ENS.OPPHØR_SAMBONR ^= 999 THEN                           00001800
               CALL SKRIV_FEIL(ENS.OPPHØR_SAMBONR);                     00001810
         END;                                                           00001820
                                                                        00001830
      IF ENS.EK_INNT_OVER_2GNR = 0 THEN                                 00001840
         S001UE1O.EK_INNT_OVER_2GA = NORMAL;                            00001850
      ELSE                                                              00001860
         DO;                                                            00001870
            S001UE1O.EK_INNT_OVER_2GA = DFHBMBRY;                       00001880
            S001UE1I.EK_INNT_OVER_2GL = CURSOR_POS;                     00001890
            IF ENS.EK_INNT_OVER_2GNR ^= 999 THEN                        00001900
               CALL SKRIV_FEIL(ENS.EK_INNT_OVER_2GNR);                  00001910
         END;                                                           00001920
    /*     0797 HL */                                                   00001930
      IF ENS.SIVILSTANDNR = 0 THEN                                      00001940
         S001UE1O.SIVILSTANDA = NORMAL;                                 00001950
      ELSE                                                              00001960
         DO;                                                            00001970
            S001UE1O.SIVILSTANDA = DFHBMBRY;                            00001980
            S001UE1I.SIVILSTANDL = CURSOR_POS;                          00001990
            IF ENS.SIVILSTANDNR ^= 999 THEN                             00002000
               CALL SKRIV_FEIL(ENS.SIVILSTANDNR);                       00002010
         END;                                                           00002020
                                                                        00002030
                                                                        00002040
      IF ENS.FLYTTET_FRANR = 0 THEN                                     00002050
         S001UE1O.FLYTTET_FRAA = NORMAL;                                00002060
      ELSE                                                              00002070
         DO;                                                            00002080
           S001UE1O.FLYTTET_FRAA = DFHBMBRY;                            00002090
           S001UE1I.FLYTTET_FRAL = CURSOR_POS;                          00002100
           IF ENS.FLYTTET_FRANR ^= 999 THEN                             00002110
              CALL SKRIV_FEIL(ENS.FLYTTET_FRANR);                       00002120
         END;                                                           00002130
      IF ENS.FLYTTET_SAMMENNR = 0 THEN                                  00002140
         S001UE1O.FLYTTET_SAMMENA = NORMAL;                             00002150
      ELSE                                                              00002160
         DO;                                                            00002170
           S001UE1O.FLYTTET_SAMMENA = DFHBMBRY;                         00002180
           S001UE1I.FLYTTET_SAMMENL = CURSOR_POS;                       00002190
           IF ENS.FLYTTET_SAMMENNR ^= 999 THEN                          00002200
              CALL SKRIV_FEIL(ENS.FLYTTET_SAMMENNR);                    00002210
         END;                                                           00002220
                                                                        00002230
      /* VED GAMLE TRANS SKAL FNR OG VIRKNINGSDATO BLOKKERES   */       00002240
                                                                        00002250
      IF TRANS_OPPL_OMR.NY_GML_TRANS_IND = 'G' & FRA_MED_DIALOG THEN    00002260
         DO;                                                            00002270
           S001UE1O.FNRA            = DFHBMASK; /* PROT AND ASKIP */    00002280
           S001UE1O.VIRK_DATO_MÅA   = DFHBMASK;                         00002290
         END;                                                           00002300
                                                                        00002310
      ELSE IF FRA_UTEN_DIALOG THEN  /* BLOKKER ALT SAMMEN  */           00002320
                                                                        00002330
         DO;                                                            00002340
           S001UE1O.REGDATOA        = DFHBMASK;                         00002350
           S001UE1O.TERMIDA         = DFHBMASK;                         00002360
           S001UE1O.FNRA            = DFHBMASK;                         00002370
           S001UE1O.TKNRA           = DFHBMASK;                         00002380
           S001UE1O.SPRÅKA          = DFHBMASK;                         00002390
           S001UE1O.VIRK_DATO_MÅA   = DFHBMASK;                         00002400
           S001UE1O.NAVN_NYTTA      = DFHBMASK;                         00002410
           S001UE1O.NAVN_NYTT_EKA   = DFHBMASK;                         00002420
           S001UE1O.FNR_EKA         = DFHBMASK;                         00002430
           S001UE1O.NAVN_EKA        = DFHBMASK;                         00002440
           S001UE1O.SKILSMISSEA     = DFHBMASK;                         00002450
           S001UE1O.SIVILSTANDA     = DFHBMASK;                         00002460
           S001UE1O.FLYTTET_FRAA    = DFHBMASK;                         00002470
           S001UE1O.FLYTTET_SAMMENA = DFHBMASK;                         00002480
           S001UE1O.EK_INNT_OVER_2GA = DFHBMASK;                        00002490
           S001UE1O.OPPHØR_SAMBOA   = DFHBMASK;                         00002500
           S001UE1O.UNDER4GA        = DFHBMASK;                         00002510
           MELDING6O = 'TRYKK PF1 FOR OPPBEVAR, PF2 FOR FORKASTE.';     00002520
         END;                                                           00002530
                                                                        00002540
      IF ^ FRA_CICS THEN                                                00002550
         DO;                                                            00002560
           S001UE1O.STYRE_KODEA    = DFHBMASK;                          00002570
           S001UE1O.FUNKSJONSKODEA = DFHBMASK;                          00002580
         END;                                                           00002590
                                                                        00002600
   END OVERFØR_ENSØKER_MAP;                                             00002610
 %PAGE;                                /*   */                          00002620
 /* ***************************************************************** */00002630
 /*                                                                   */00002640
 /*   PROSEDYRA OVERFØRER DATA FRA EN_TRANS_OMR.ENK7 TIL              */00002650
 /*   SKJERMBILDE EN_KAPITTEL 7.                                      */00002660
 /*   MAP: S001UE1                                                    */00002670
 /*   MAPSET:                                                         */00002680
 /*                                                                   */00002690
 /* ***************************************************************** */00002700
 %SKIP(2);                                                              00002710
 OVERFØR_ENKAP7_MAP:                                                    00002720
   PROC;                                                                00002730
   DCL                                                                  00002740
      NORMAL  CHAR (1) INIT(' '),                                       00002750
      NOR_NUM CHAR (1) INIT('&'),                                       00002760
      BRI_NUM CHAR (1) INIT('Q');                                       00002770
 %SKIP(2);                                                              00002780
      S001UE1O.FAIO = (ENK7.FAI);                                       00002790
 %SKIP(3);                             /*  */                           00002800
 /*  MARKERING AV ATTRIBUTTER   */                                      00002810
 %SKIP;                                                                 00002820
      IF ENK7.FAINR = 0 THEN                                            00002830
         S001UE1O.FAIA = NOR_NUM;                                       00002840
      ELSE                                                              00002850
         DO;                                                            00002860
            S001UE1O.FAIA = BRI_NUM;                                    00002870
            S001UE1I.FAIL = CURSOR_POS;                                 00002880
            IF ENK7.FAINR ^= 999 THEN                                   00002890
               CALL SKRIV_FEIL(ENK7.FAINR);                             00002900
         END;                                                           00002910
      IF FRA_UTEN_DIALOG THEN       /* BLOKKER ALT SAMMEN   */          00002920
        DO;                                                             00002930
           S001UE1O.FAIA     = DFHBMASK;                                00002940
        END;                                                            00002950
                                                                        00002960
   END OVERFØR_ENKAP7_MAP;                                              00002970
 %PAGE;                                /*   */                          00002980
 /* ***************************************************************** */00002990
 /*                                                                   */00003000
 /*   PROSEDYRA OVERFØRER DATA FRA EN_TRANS_OMR.ENK8 TIL              */00003010
 /*   SKJERMBILDE EN_KAPITTEL 8.                                      */00003020
 /*   MAP: S001UE1                                                    */00003030
 /*   MAPSET:                                                         */00003040
 /*                                                                   */00003050
 /* ***************************************************************** */00003060
 %SKIP(2);                                                              00003070
 OVERFØR_ENKAP8_MAP:                                                    00003080
   PROC;                                                                00003090
   DCL                                                                  00003100
      NORMAL  CHAR (1) INIT(' '),                                       00003110
      NOR_NUM CHAR (1) INIT('&'),                                       00003120
      BRI_NUM CHAR (1) INIT('Q');                                       00003130
 %SKIP(2);                                                              00003140
  /*  IF F_FELT_PIC_CHAR3(ENK8.UFG) ^= '000' THEN */                    00003150
         S001UE1O.UFGO = F_FELT_PIC_CHAR3(ENK8.UFG);                    00003160
 %SKIP(3);                             /*  */                           00003170
 /*  MARKERING AV ATTRIBUTTER   */                                      00003180
 %SKIP;                                                                 00003190
      IF ENK8.UFGNR = 0 THEN                                            00003200
         S001UE1O.UFGA = NOR_NUM;                                       00003210
      ELSE                                                              00003220
         DO;                                                            00003230
            S001UE1O.UFGA = BRI_NUM;                                    00003240
            S001UE1I.UFGL = CURSOR_POS;                                 00003250
            IF ENK8.UFGNR ^= 999 THEN                                   00003260
               CALL SKRIV_FEIL(ENK8.UFGNR);                             00003270
         END;                                                           00003280
                                                                        00003290
      IF (ENK8.TIDSBEGR_ATTF) ^= ' ' THEN                               00003300
         S001UE1O.TIDSBEGR_ATTFO = (ENK8.TIDSBEGR_ATTF);                00003310
      IF ENK8.TIDSBEGR_ATTFNR = 0 THEN                                  00003320
         S001UE1O.TIDSBEGR_ATTFA = NORMAL ;                             00003330
      ELSE                                                              00003340
         DO;                                                            00003350
            S001UE1O.TIDSBEGR_ATTFA = DFHBMBRY;                         00003360
            S001UE1I.TIDSBEGR_ATTFL = CURSOR_POS;                       00003370
            IF ENK8.TIDSBEGR_ATTFNR ^= 999 THEN                         00003380
               CALL SKRIV_FEIL(ENK8.TIDSBEGR_ATTFNR);                   00003390
         END;                                                           00003400
                                                                        00003410
      IF ENK8.SKJERM_ATTF ^= ' ' THEN                                   00003420
         S001UE1O.SKJERM_ATTFO = ENK8.SKJERM_ATTF;                      00003430
      IF ENK8.SKJERM_ATTFNR = 0 THEN                                    00003440
         S001UE1O.SKJERM_ATTFA = NORMAL ;                               00003450
      ELSE                                                              00003460
         DO;                                                            00003470
            S001UE1O.SKJERM_ATTFA   = DFHBMBRY;                         00003480
            S001UE1I.SKJERM_ATTFL = CURSOR_POS;                         00003490
            IF ENK8.SKJERM_ATTFNR ^= 999 THEN                           00003500
               CALL SKRIV_FEIL(ENK8.SKJERM_ATTFNR);                     00003510
         END;                                                           00003520
                                                                        00003530
      IF ENK8.FRYSP_3ÅR_ARB ^= ' ' THEN                                 00003540
         S001UE1O.FRYSP_3ÅR_ARBO = ENK8.FRYSP_3ÅR_ARB;                  00003550
      IF ENK8.FRYSP_3ÅR_ARBNR = 0 THEN                                  00003560
         S001UE1O.FRYSP_3ÅR_ARBA = NORMAL ;                             00003570
      ELSE                                                              00003580
         DO;                                                            00003590
            S001UE1O.FRYSP_3ÅR_ARBA = DFHBMBRY;                         00003600
            S001UE1I.FRYSP_3ÅR_ARBL = CURSOR_POS;                       00003610
            IF ENK8.FRYSP_3ÅR_ARBNR ^= 999 THEN                         00003620
               CALL SKRIV_FEIL(ENK8.FRYSP_3ÅR_ARBNR);                   00003630
         END;                                                           00003640
                                                                        00003650
      IF ENK8.FRYSP_TIDSB ^= ' ' THEN                                   00003660
         S001UE1O.FRYSP_TIDSBO = ENK8.FRYSP_TIDSB;                      00003670
      IF ENK8.FRYSP_TIDSBNR = 0 THEN                                    00003680
         S001UE1O.FRYSP_TIDSBA = NORMAL ;                               00003690
      ELSE                                                              00003700
         DO;                                                            00003710
            S001UE1O.FRYSP_TIDSBA   = DFHBMBRY;                         00003720
            S001UE1I.FRYSP_TIDSBL = CURSOR_POS;                         00003730
            IF ENK8.FRYSP_TIDSBNR ^= 999 THEN                           00003740
               CALL SKRIV_FEIL(ENK8.FRYSP_TIDSBNR);                     00003750
         END;                                                           00003760
                                                                        00003770
                                                                        00003780
      IF ENK8.INNTEKT_FØR_UP  ^= 0     THEN                             00003790
         S001UE1O.INNTEKT_FØR_UPO = ENK8.INNTEKT_FØR_UP ;               00003800
                                                                        00003810
      IF ENK8.INNTEKT_FØR_UPNR = 0 THEN                                 00003820
         S001UE1O.INNTEKT_FØR_UPA = NOR_NUM;                            00003830
      ELSE                                                              00003840
         DO;                                                            00003850
            S001UE1O.INNTEKT_FØR_UPA = BRI_NUM;                         00003860
            S001UE1I.INNTEKT_FØR_UPL = CURSOR_POS;                      00003870
            IF ENK8.INNTEKT_FØR_UPNR ^= 999 THEN                        00003880
               CALL SKRIV_FEIL(ENK8.INNTEKT_FØR_UPNR);                  00003890
         END;                                                           00003900
                                                                        00003910
                                                                        00003920
                                                                        00003930
      IF ENK8.INNT_DATO_MÅ    ^= 0 THEN                                 00003940
         S001UE1O.INNT_DATO_MÅO = ENK8.INNT_DATO_MÅ ;                   00003950
                                                                        00003960
      IF ENK8.INNT_DATO_MÅNR = 0 THEN                                   00003970
         S001UE1O.INNT_DATO_MÅA = NOR_NUM;                              00003980
      ELSE                                                              00003990
         DO;                                                            00004000
            S001UE1O.INNT_DATO_MÅA = BRI_NUM;                           00004010
            S001UE1I.INNT_DATO_MÅL = CURSOR_POS;                        00004020
            IF ENK8.INNT_DATO_MÅNR ^= 999 THEN                          00004030
               CALL SKRIV_FEIL(ENK8.INNT_DATO_MÅNR);                    00004040
         END;                                                           00004050
                                                                        00004060
                                                                        00004070
                                                                        00004080
      IF FRA_UTEN_DIALOG THEN       /* BLOKKER ALT SAMMEN   */          00004090
         DO;                                                            00004100
            S001UE1O.UFGA = DFHBMASK;                                   00004110
            S001UE1O.FRYSP_TIDSBA = DFHBMASK;                           00004120
            S001UE1O.FRYSP_3ÅR_ARBA = DFHBMASK;                         00004130
            S001UE1O.SKJERM_ATTFA = DFHBMASK;                           00004140
            S001UE1O.TIDSBEGR_ATTFA = DFHBMASK;                         00004150
            S001UE1O.INNT_DATO_MÅA = DFHBMASK;                          00004160
            S001UE1O.INNTEKT_FØR_UPA = DFHBMASK;                        00004170
         END;                                                           00004180
                                                                        00004190
   END OVERFØR_ENKAP8_MAP;                                              00004200
 %PAGE;                                /*   */                          00004210
 /* ***************************************************************** */00004220
 /*                                                                   */00004230
 /*   PROSEDYRA OVERFØRER DATA FRA EN_TRANS_OMR.ENK10 TIL             */00004240
 /*   SKJERMBILDE EN_KAPITTEL 10.                                     */00004250
 /*   MAP: S001UE1                                                    */00004260
 /*   MAPSET:                                                         */00004270
 /*                                                                   */00004280
 /* ***************************************************************** */00004290
 %SKIP(2);                                                              00004300
 OVERFØR_ENKAP10_MAP:                                                   00004310
   PROC;                                                                00004320
   DCL                                                                  00004330
      NORMAL  CHAR (1) INIT(' '),                                       00004340
      NOR_NUM CHAR (1) INIT('&'),                                       00004350
      BRI_NUM CHAR (1) INIT('Q');                                       00004360
 %SKIP(2);                                                              00004370
      S001UE1O.FORVENTET_INNTO = (ENK10.FORVENTET_INNT);                00004380
      S001UE1O.O_TIL_PENSJONO = ENK10.O_TIL_PENSJON;                    00004390
      S001UE1O.TP_PROSENTO    = F_FELT_PIC_CHAR3(ENK10.TP_PROSENT);     00004400
      IF F_FELT_PIC_CHAR4(ENK10.FRAML_DATO_MÅ) ^= '0000' THEN           00004410
        S001UE1O.FRAML_DATO_MÅO = F_FELT_PIC_CHAR4(ENK10.FRAML_DATO_MÅ);00004420
      S001UE1O.OPPHØR_EOO = ENK10.OPPHØR_EO;                            00004430
 %SKIP(3);                             /*  */                           00004440
 /*  MARKERING AV ATTRIBUTTER   */                                      00004450
 %SKIP;                                                                 00004460
      IF ENK10.FORVENTET_INNTNR = 0 THEN                                00004470
         S001UE1O.FORVENTET_INNTA = NOR_NUM;                            00004480
      ELSE                                                              00004490
         DO;                                                            00004500
            S001UE1O.FORVENTET_INNTA = BRI_NUM;                         00004510
            S001UE1I.FORVENTET_INNTL = CURSOR_POS;                      00004520
            IF ENK10.FORVENTET_INNTNR ^= 999 THEN                       00004530
               CALL SKRIV_FEIL(ENK10.FORVENTET_INNTNR);                 00004540
         END;                                                           00004550
      IF ENK10.O_TIL_PENSJONNR = 0 THEN                                 00004560
         S001UE1O.O_TIL_PENSJONA = NORMAL;                              00004570
      ELSE                                                              00004580
         DO;                                                            00004590
            S001UE1O.O_TIL_PENSJONA = DFHBMBRY;                         00004600
            S001UE1I.O_TIL_PENSJONL = CURSOR_POS;                       00004610
            IF ENK10.O_TIL_PENSJONNR ^= 999 THEN                        00004620
               CALL SKRIV_FEIL(ENK10.O_TIL_PENSJONNR);                  00004630
         END;                                                           00004640
      IF ENK10.TP_PROSENTNR = 0 THEN                                    00004650
         S001UE1O.TP_PROSENTA = NOR_NUM;                                00004660
      ELSE                                                              00004670
         DO;                                                            00004680
            S001UE1O.TP_PROSENTA = BRI_NUM;                             00004690
            S001UE1I.TP_PROSENTL = CURSOR_POS;                          00004700
            IF ENK10.TP_PROSENTNR ^= 999 THEN                           00004710
               CALL SKRIV_FEIL(ENK10.TP_PROSENTNR);                     00004720
         END;                                                           00004730
      IF ENK10.FRAML_DATO_MÅNR = 0 THEN                                 00004740
         S001UE1O.FRAML_DATO_MÅA = NOR_NUM;                             00004750
      ELSE                                                              00004760
         DO;                                                            00004770
            S001UE1O.FRAML_DATO_MÅA = BRI_NUM;                          00004780
            S001UE1I.FRAML_DATO_MÅL = CURSOR_POS;                       00004790
            IF ENK10.FRAML_DATO_MÅNR ^= 999 THEN                        00004800
               CALL SKRIV_FEIL(ENK10.FRAML_DATO_MÅNR);                  00004810
         END;                                                           00004820
      IF ENK10.OPPHØR_EONR = 0 THEN                                     00004830
         S001UE1O.OPPHØR_EOA = NORMAL;                                  00004840
      ELSE                                                              00004850
         DO;                                                            00004860
            S001UE1O.OPPHØR_EOA = DFHBMBRY;                             00004870
            S001UE1I.OPPHØR_EOL = CURSOR_POS;                           00004880
            IF ENK10.OPPHØR_EONR ^= 999 THEN                            00004890
               CALL SKRIV_FEIL(ENK10.OPPHØR_EONR);                      00004900
         END;                                                           00004910
                                                                        00004920
      IF FRA_UTEN_DIALOG THEN        /* BLOKKER ALT SAMMEN    */        00004930
         DO;                                                            00004940
           S001UE1O.REGDATOA       = DFHBMASK;                          00004950
           S001UE1O.TERMIDA        = DFHBMASK;                          00004960
           S001UE1O.FORVENTET_INNTA = DFHBMASK;                         00004970
           S001UE1O.O_TIL_PENSJONA = DFHBMASK;                          00004980
           S001UE1O.TP_PROSENTA    = DFHBMASK;                          00004990
           S001UE1O.FRAML_DATO_MÅA = DFHBMASK;                          00005000
           S001UE1O.OPPHØR_EOA     = DFHBMASK;                          00005010
         END;                                                           00005020
                                                                        00005030
   END OVERFØR_ENKAP10_MAP;                                             00005040
 %PAGE;                                /*   */                          00005050
 /* *********************************************************** *//*YS*/00005060
 /*YS*//*   OBS - NY PROSEDYRE                                  *//*YS*/00005070
 /*   PROSEDYRA OVERFØRER DATA FRA EN_TRANS_OMR.ENK11 TIL       *//*YS*/00005080
 /*   SKJERMBILDE EN_KAPITTEL 11.                               *//*YS*/00005090
 /*   MAP: S001UE1                                              *//*YS*/00005100
 /*   MAPSET:                                                   *//*YS*/00005110
 /*                                                             *//*YS*/00005120
 /* *********************************************************** *//*YS*/00005130
                                                                        00005140
 OVERFØR_ENKAP11_MAP:                                             /*YS*/00005150
   PROC;                                                          /*YS*/00005160
   DCL                                                            /*YS*/00005170
      NORMAL  CHAR (1) INIT(' '),                                 /*YS*/00005180
      NOR_NUM CHAR (1) INIT('&'),                                 /*YS*/00005190
      BRI_NUM CHAR (1) INIT('Q');                                 /*YS*/00005200
                                                                        00005210
 /*   IF F_FELT_PIC_CHAR3(ENK11.YUG) ^= '000' THEN   */           /*YS*/00005220
         S001UE1O.YUFGO = F_FELT_PIC_CHAR3(ENK11.YUG);            /*YS*/00005230
                                                                        00005240
 /*  MARKERING AV ATTRIBUTTER   */                                /*YS*/00005250
                                                                        00005260
      IF ENK11.YUGNR = 0 THEN                                     /*YS*/00005270
         S001UE1O.YUFGA = NOR_NUM;                                /*YS*/00005280
      ELSE                                                        /*YS*/00005290
         DO;                                                      /*YS*/00005300
            S001UE1O.YUFGA = BRI_NUM;                             /*YS*/00005310
            S001UE1I.YUFGL = CURSOR_POS;                          /*YS*/00005320
            IF ENK11.YUGNR ^= 999 THEN                            /*YS*/00005330
               CALL SKRIV_FEIL(ENK11.YUGNR);                      /*YS*/00005340
         END;                                                     /*YS*/00005350
                                                                        00005360
      IF FRA_UTEN_DIALOG THEN       /* BLOKKER ALT SAMMEN   */    /*YS*/00005370
         S001UE1O.YUFGA = DFHBMASK;                               /*YS*/00005380
                                                                        00005390
   END OVERFØR_ENKAP11_MAP;                                       /*YS*/00005400
 %PAGE;                                /*   */                          00005410
 /* *********************************************************** *//*YS*/00005420
 /*   PROSEDYRA OVERFØRER DATA FRA EN_TRANS_OMR.EN_INNTEKT TIL  */      00005430
 /*   SKJERMBILDE EN_INNTEKT                                    */      00005440
 /*   MAP: S001UE1                                              */      00005450
 /*   MAPSET:                                                   */      00005460
 /*                                                             */      00005470
 /* *********************************************************** */      00005480
                                                                        00005490
 OVERFØR_EN_INNTEKT_MAP:                                                00005500
   PROC;                                                                00005510
   DCL                                                                  00005520
      NORMAL  CHAR (1) INIT(' '),                                       00005530
      NOR_NUM CHAR (1) INIT('&'),                                       00005540
      BRI_NUM CHAR (1) INIT('Q');                                       00005550
                                                                        00005560
         S001UE1O.PI_SØKERO =                                           00005570
                     F_FELT_PIC_CHAR6(EN_INNTEKT.PENSJONSINNT_SØKER);   00005580
         S001UE1O.PI_EKO =                                              00005590
                     F_FELT_PIC_CHAR6(EN_INNTEKT.PENSJONSINNT_EK);      00005600
         S001UE1O.AI_SØKERO =       (EN_INNTEKT.ARBEIDSINNT_SØKER);     00005610
                                                                        00005620
         S001UE1O.AI_EKO =          (EN_INNTEKT.ARBEIDSINNT_EK);        00005630
      IF EN_INNTEKT.MINST_4G   = 'N' THEN                               00005640
         S001UE1O.UNDER4GO =  'X';                                      00005650
      ELSE                                                              00005660
      IF EN_INNTEKT.MINST_4G   = 'J' THEN                               00005670
         S001UE1O.OVER4GO =  'X';                                       00005680
                                                                        00005690
                                                                        00005700
 /*  MARKERING AV ATTRIBUTTER   */                                      00005710
      IF EN_INNTEKT.ARBEIDSINNT_SØKERNR = 0 THEN                        00005720
         S001UE1O.AI_SØKERA = NOR_NUM;                                  00005730
      ELSE                                                              00005740
         DO;                                                            00005750
            S001UE1O.AI_SØKERA = BRI_NUM;                               00005760
            S001UE1I.AI_SØKERL = CURSOR_POS;                            00005770
            IF EN_INNTEKT.ARBEIDSINNT_SØKERNR ^= 999 THEN               00005780
               CALL SKRIV_FEIL(EN_INNTEKT.ARBEIDSINNT_SØKERNR);         00005790
         END;                                                           00005800
                                                                        00005810
      IF EN_INNTEKT.ARBEIDSINNT_EKNR = 0 THEN                           00005820
         S001UE1O.AI_EKA = NOR_NUM;                                     00005830
      ELSE                                                              00005840
         DO;                                                            00005850
            S001UE1O.AI_EKA = BRI_NUM;                                  00005860
            S001UE1I.AI_EKL = CURSOR_POS;                               00005870
            IF EN_INNTEKT.ARBEIDSINNT_EKNR ^= 999 THEN                  00005880
               CALL SKRIV_FEIL(EN_INNTEKT.ARBEIDSINNT_EKNR);            00005890
         END;                                                           00005900
                                                                        00005910
                                                                        00005920
      IF EN_INNTEKT.PENSJONSINNT_SØKERNR = 0 THEN                       00005930
         S001UE1O.PI_SØKERA = NOR_NUM;                                  00005940
      ELSE                                                              00005950
         DO;                                                            00005960
            S001UE1O.PI_SØKERA = BRI_NUM;                               00005970
            S001UE1I.PI_SØKERL = CURSOR_POS;                            00005980
            IF EN_INNTEKT.PENSJONSINNT_SØKERNR ^= 999 THEN              00005990
               CALL SKRIV_FEIL(EN_INNTEKT.PENSJONSINNT_SØKERNR);        00006000
         END;                                                           00006010
                                                                        00006020
      IF EN_INNTEKT.PENSJONSINNT_EKNR = 0 THEN                          00006030
         S001UE1O.PI_EKA = NOR_NUM;                                     00006040
      ELSE                                                              00006050
         DO;                                                            00006060
            S001UE1O.PI_EKA = BRI_NUM;                                  00006070
            S001UE1I.PI_EKL = CURSOR_POS;                               00006080
            IF EN_INNTEKT.PENSJONSINNT_EKNR ^= 999 THEN                 00006090
               CALL SKRIV_FEIL(EN_INNTEKT.PENSJONSINNT_EKNR);           00006100
         END;                                                           00006110
                                                                        00006120
                                                                        00006130
      IF EN_INNTEKT.MINST_4GNR = 0  THEN                                00006140
         DO;                                                            00006150
            S001UE1O.UNDER4GA = NOR_NUM;                                00006160
            S001UE1O.OVER4GA = NOR_NUM;                                 00006170
         END;                                                           00006180
      ELSE                                                              00006190
         DO;                                                            00006200
            S001UE1O.UNDER4GA = BRI_NUM;                                00006210
            S001UE1I.UNDER4GL = CURSOR_POS;                             00006220
            IF EN_INNTEKT.MINST_4GNR ^= 999 THEN                        00006230
               CALL SKRIV_FEIL(EN_INNTEKT.MINST_4GNR);                  00006240
         END;                                                           00006250
                                                                        00006260
      IF FRA_UTEN_DIALOG THEN       /* BLOKKER ALT SAMMEN   */          00006270
         DO;                                                            00006280
           S001UE1O.OVER4GA             = DFHBMASK;                     00006290
           S001UE1O.UNDER4GA            = DFHBMASK;                     00006300
           S001UE1O.PI_SØKERA = DFHBMASK;                               00006310
           S001UE1O.PI_EKA    = DFHBMASK;                               00006320
           S001UE1O.AI_SØKERA  = DFHBMASK;                              00006330
           S001UE1O.AI_EKA     = DFHBMASK;                              00006340
         END;                                                           00006350
   END OVERFØR_EN_INNTEKT_MAP;                                          00006360
                                                                        00006370
 /* *********************************************************** */      00006380
 /*   PROSEDYRA OVERFØRER DATA FRA EN_TRANS_OMR.EN_SPES TIL     */      00006390
 /*   SKJERMBILDE EN_SPES                                       */      00006400
 /*   MAP: S001UE1                                              */      00006410
 /*   MAPSET:                                                   */      00006420
 /*                                                             */      00006430
 /* *********************************************************** */      00006440
                                                                        00006450
 OVERFØR_EN_SPES_MAP:                                                   00006460
   PROC;                                                                00006470
   DCL                                                                  00006480
      NORMAL  CHAR (1) INIT(' '),                                       00006490
      NOR_NUM CHAR (1) INIT('&'),                                       00006500
      BRI_NUM CHAR (1) INIT('Q');                                       00006510
   DCL SYV_TIL_FEM     CHAR (7);                                        00006520
   DCL FEM DEF SYV_TIL_FEM POS(3) CHAR (5);                             00006530
                                                                        00006540
  /*  IF EN_SPES.STATSBORGER   ^= 0     THEN */                         00006550
         S001UE1O.STATSBORGERO =    EN_SPES.STATSBORGER ;               00006560
                                                                        00006570
  /*  IF EN_SPES.BOSTED   ^=  0    THEN           */                    00006580
         S001UE1O.BOSTEDO = EN_SPES.BOSTED ;                            00006590
                                                                        00006600
      IF F_FELT_PIC_CHAR7(EN_SPES.TP_NORDISK ) ^= '0000000' THEN        00006610
         S001UE1O.NORDISK_TPO =                                         00006620
                       F_FELT_PIC_CHAR7(EN_SPES.TP_NORDISK);            00006630
                                                                        00006640
                                                                        00006650
      IF F_FELT_PIC_CHAR3(EN_SPES.TP_NORDISK_LAND ) ^= '000' THEN       00006660
         S001UE1O.NORDISK_LANDO =                                       00006670
                         F_FELT_PIC_CHAR3(EN_SPES.TP_NORDISK_LAND);     00006680
                                                                        00006690
      IF F_FELT_PIC_CHAR7(EN_SPES.PENSJON_EØS ) ^= '0000000' THEN       00006700
         S001UE1O.EØS_PENSJONO =                                        00006710
                       F_FELT_PIC_CHAR7(EN_SPES.PENSJON_EØS);           00006720
                                                                        00006730
                                                                        00006740
 /*  MARKERING AV ATTRIBUTTER   */                                      00006750
      IF EN_SPES.STATSBORGERNR = 0 THEN                                 00006760
         S001UE1O.STATSBORGERA = NOR_NUM;                               00006770
      ELSE                                                              00006780
         DO;                                                            00006790
            S001UE1O.STATSBORGERA = BRI_NUM;                            00006800
            S001UE1I.STATSBORGERL = CURSOR_POS;                         00006810
            IF EN_SPES.STATSBORGERNR ^= 999 THEN                        00006820
               CALL SKRIV_FEIL(EN_SPES.STATSBORGERNR);                  00006830
         END;                                                           00006840
                                                                        00006850
      IF EN_SPES.BOSTEDNR = 0 THEN                                      00006860
         S001UE1O.BOSTEDA = NOR_NUM;                                    00006870
      ELSE                                                              00006880
         DO;                                                            00006890
            S001UE1O.BOSTEDA = BRI_NUM;                                 00006900
            S001UE1I.BOSTEDL = CURSOR_POS;                              00006910
            IF EN_SPES.BOSTEDNR ^= 999 THEN                             00006920
               CALL SKRIV_FEIL(EN_SPES.BOSTEDNR);                       00006930
         END;                                                           00006940
                                                                        00006950
      IF EN_SPES.TP_NORDISKNR = 0 THEN                                  00006960
         S001UE1O.NORDISK_TPA = NOR_NUM;                                00006970
      ELSE                                                              00006980
         DO;                                                            00006990
            S001UE1O.NORDISK_TPA = BRI_NUM;                             00007000
            S001UE1I.NORDISK_TPL = CURSOR_POS;                          00007010
            IF EN_SPES.TP_NORDISKNR ^= 999 THEN                         00007020
               CALL SKRIV_FEIL(EN_SPES.TP_NORDISKNR);                   00007030
         END;                                                           00007040
                                                                        00007050
      IF EN_SPES.TP_NORDISK_LANDNR = 0 THEN                             00007060
         S001UE1O.NORDISK_LANDA = NOR_NUM;                              00007070
      ELSE                                                              00007080
         DO;                                                            00007090
            S001UE1O.NORDISK_LANDA = BRI_NUM;                           00007100
            S001UE1I.NORDISK_LANDL = CURSOR_POS;                        00007110
            IF EN_SPES.TP_NORDISK_LANDNR ^= 999 THEN                    00007120
               CALL SKRIV_FEIL(EN_SPES.TP_NORDISK_LANDNR);              00007130
         END;                                                           00007140
                                                                        00007150
      IF EN_SPES.PENSJON_EØSNR = 0 THEN                                 00007160
         S001UE1O.EØS_PENSJONA = NOR_NUM;                               00007170
      ELSE                                                              00007180
         DO;                                                            00007190
            S001UE1O.EØS_PENSJONA = BRI_NUM;                            00007200
            S001UE1I.EØS_PENSJONL = CURSOR_POS;                         00007210
            IF EN_SPES.PENSJON_EØSNR ^= 9999999 THEN                    00007220
               CALL SKRIV_FEIL(EN_SPES.PENSJON_EØSNR);                  00007230
         END;                                                           00007240
                                                                        00007250
      IF FRA_UTEN_DIALOG THEN       /* BLOKKER ALT SAMMEN   */          00007260
         DO;                                                            00007270
           S001UE1O.STATSBORGERA        = DFHBMASK;                     00007280
           S001UE1O.BOSTEDA             = DFHBMASK;                     00007290
           S001UE1O.NORDISK_TPA         = DFHBMASK;                     00007300
           S001UE1O.NORDISK_LANDA       = DFHBMASK;                     00007310
           S001UE1O.EØS_PENSJONA        = DFHBMASK;                     00007320
         END;                                                           00007330
   END OVERFØR_EN_SPES_MAP;                                             00007340
                                                                        00007350
