 /*       SIST ENDRET 07/03-97 13.48.56 AV   JDA7339                  */00000000
 /*       SIST ENDRET 07/03-97 12.29.22 AV   JDA7339                  */00000010
 /*       SIST ENDRET 11/02-97 10.49.06 AV   JDA7339                  */00000020
 /*       SIST ENDRET 08/03-96 13.34.52 AV   JDA0310                  */00000030
 /*       SIST ENDRET 06/02-96 13.08.57 AV   JDA0310                  */00000040
 /*       SIST ENDRET 16/01-96 11.01.00 AV   TSB0310                  */00000050
 /*       SIST ENDRET 09/01-96 14.39.10 AV   JDA0310                  */00000060
 /*       SIST ENDRET 12/10-95 14.23.45 AV   JDA0310                  */00000070
 /*       SIST ENDRET 25/07-94 13.52.16 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 11/07-94 13.11.12 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 15/03-94 13.54.23 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 25/02-94 13.00.22 AV   HERMAN                   */00000110
 /*       SIST ENDRET 26/04-91 12.34.10 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 01/12-89 08.52.28 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 21/08-85 08.23.39 AV   FARVIK                   */00000140
 /*       SIST ENDRET 08/08-85 14.34.30 AV   FARVIK                   */00000150
 /*       SIST ENDRET 30/07-85 14.50.33 AV   FARVIK                   */00000160
 /*       SIST ENDRET 21/09-84 13.04.06 AV   FARVIK                   */00000170
 /*       SIST ENDRET 12/06-84 14.23.19 AV   FARVIK                   */00000180
 /* ***************************************************************** */00000190
 /*                                                                   */00000200
 /* ***************************************************************** */00000210
 /*IDENTIFIKASJON:                                                    */00000220
 /* **********************                                            */00000230
 /*  PROGRAM-IDENT : R0010470 - UTSKRIFT VED SPLITTING - HOVEDPROGRAM */00000240
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000250
 /*  PROGRAMMERER  : ROLF FARVIK                                      */00000260
 /*  PROGRAMMET BLE LAGET : MARS 1983                                 */00000270
 /*                                                                   */00000280
 /* ***************************************************************** */00000290
 /*HENSIKT:                                                           */00000300
 /* **********                                                        */00000310
 /*  PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETT-MAPENE    */00000320
 /*  DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT PÅ        */00000330
 /*  FORHÅND.                                                         */00000340
 /*                                                                   */00000350
 /* ***************************************************************** */00000360
 /*PROGRAMTILKNYTTING:                                                */00000370
 /* ********************                                              */00000380
 /*  PROGRAMMET BLIR AKTIVISERT VIA CICS FRA R0013001(BEHANDLE-TRANS) */00000390
 /*  OG FRA R0010480(VENTETRANSBEHANDLING) SLIK:                      */00000400
 /*    EXEC CICS XCTL PROGRAM ('R0010470') COMMAREA(KOM_OMR);         */00000410
 /*                                                                   */00000420
 /* ***************************************************************** */00000430
 /*PROGRAMMET LINKER A470, B470 OG C470 FOR BEHANDLING AV DE          */00000440
 /*           FORSKJELLIGE BLANKETTER                                 */00000450
 /* ***************************************************************** */00000460
                                                                        00000470
 R001047: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                          00000480
 %PAGE;                                                                 00000490
 %INCLUDE P0019906;  /* TRANS-OPPL-OMRÅDE (BASED) */                    00000500
 %PAGE;                                                                 00000510
 %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)        */                    00000520
 %PAGE;                                                                 00000530
 %INCLUDE P0019910;  /* STYRINGS - OMRÅDE (BASED) */                    00000540
 %PAGE;                                                                 00000550
 %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE(BASED)   */                    00000560
 %PAGE;                                                                 00000570
                                                                        00000580
                                                                        00000590
 DCL                                                                    00000600
    QUENAME                CHAR(8),                                     00000610
       QTERMID             CHAR(4) DEF QUENAME POS(1),                  00000620
       REST                CHAR(4) DEF QUENAME POS(5);                  00000630
                                                                        00000640
 DCL                                                                    00000650
    1 ROUTELIST,                                                        00000660
      2 PRINTER,                                                        00000670
        3 TERMID           CHAR(4),                                     00000680
        3 REST             CHAR(12),                                    00000690
      2 SISTE,                                                          00000700
        3 SLUTT            FIXED BIN(15),                               00000710
        3 REST             CHAR(14);                                    00000720
                                                                        00000730
 DCL                                                                    00000740
    CSTG                   BUILTIN,                                     00000750
    COMMAREA_PEKER         PTR,                                         00000760
    BMSMAPBR               PTR,                                         00000770
    MAPSET_PTR             PTR,                                         00000780
    I                      FIXED BIN(15),                               00000790
    START                  FIXED BIN(15) INIT(1),                       00000800
    LENGTH                 FIXED BIN(15),                               00000810
    LABEL_Y                LABEL,                                       00000820
    MELDING                CHAR(10) INIT('NOE ER GALT'),                00000830
    LOW_CHAR_BASED         CHAR(1000) BASED(BMSMAPBR),                  00000840
    ADDR                   BUILTIN;                                     00000850
                                                                        00000860
 /*----------------------------------------------------------------*/   00000870
 /* DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE                    */   00000880
 /*----------------------------------------------------------------*/   00000890
                                                                        00000900
 DCL                                                                    00000910
    CURSOR_POS     FIXED BIN  (15)   INIT (-1),                         00000920
    DFHBMUNP             CHAR (1)    INIT (' '),                        00000930
    DFHBMBRY             CHAR (1)    INIT ('H'),                        00000940
    DFHBMASK             CHAR (1)    INIT ('8'),/* H.INT + ASKIP  */    00000950
    FEIL_FUNNET          BIT  (1)    INIT ('1'B),                       00000960
    FORKASTES            BIT  (1)    INIT ('0'B),                       00000970
       W01_FAR_BEHANDLES BIT  (1)    INIT ('0'B),                       00000980
       W01_MOR_BEHANDLES BIT  (1)    INIT ('0'B),                       00000990
    MELDING6O            CHAR (78),                                     00001000
    YMELDING6O           CHAR (78);                                     00001010
                                                                        00001020
                                                                        00001030
         DCL  W01_YSKADE      BIT(1)         INIT  ('0'B);              00001040
         DCL  W01_NORSK_BOSATT     BIT(1)         INIT  ('0'B);         00001050
         DCL  W01_SIDE_ANTALL FIXED BIN(15)  INIT  ( 1  );              00001060
    QTERMID        = EIBTRMID;                                          00001070
    REST           = 'COMA';                                            00001080
    ROUTELIST      = '';                                                00001090
    PRINTER.TERMID = 'R41J';                                            00001100
    SISTE.SLUTT    = -1;                                                00001110
                                                                        00001120
                                                                        00001130
                                                                        00001140
                                                                        00001150
    SELECT(TRANS_OPPL_OMR.BLANKETTYPE);                                 00001160
       WHEN('AP','UP','US','EP','EF','FB','BP','FT','AF','UF',          00001170
            'E1','E2','O1','O2')                                        00001180
         EXEC CICS LINK PROGRAM('R001A470') COMMAREA ( KOM_OMR);        00001190
                                                                        00001200
       WHEN('A1','U2','E3','E4','B6','F7')                              00001210
         EXEC CICS LINK PROGRAM('R001B470') COMMAREA ( KOM_OMR);        00001220
                                                                        00001230
       WHEN('U3','FO','EN', 'EE','KF')                                  00001240
                                                                        00001250
         EXEC CICS LINK PROGRAM('R001C470') COMMAREA ( KOM_OMR);        00001260
                                                                        00001270
           OTHERWISE;                                                   00001280
        END;       /*   SELECT     */                                   00001290
                                                                        00001300
                                                                        00001310
    EXEC CICS RETURN;                                                   00001320
                                                                        00001330
                                                                        00001340
                                                                        00001350
 END R001047;                                                           00001360
