 /*       SIST ENDRET 21/04-97 11.29.47 AV   JDA7339                  */00000000
 /*       SIST ENDRET 13/10-94 13.36.29 AV   JDA0310                  */00000010
 /*       SIST ENDRET 24/08-94 09.31.55 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 13/12-91 12.51.14 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 10/09-91 12.42.34 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 06/09-91 09.11.25 AV   DYBVIK                   */00000050
 /*   +   SIST ENDRET 20/08-91 11.33.58 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 15/08-91 10.19.36 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 12/08-91 14.23.24 AV   DYBVIK                   */00000080
 /* ***************************************************************** */00000090
 /* IDENTIFIKASJON                                                    */00000100
 /*     R0010440 - PROGRAM SOM SENDER BILDE FOR RYDDING  AV SEGMENT   */00000110
 /*                                                                   */00000120
 /*              - AKSEPTERE BILDE                                    */00000130
 /*              - KONTROLLERE FNR                                    */00000140
 /*              - SPERE ROOT OG INNTEKKET SEG                        */00000150
 /*              - FJERENER ALL ANDRE SEGMENT                         */00000160
 /*                                                                   */00000170
 /*     PROGRAMMERER: PATHAK SATISH                  28.5.91          */00000180
 /* ***************************************************************** */00000190
                                                                        00000200
 R001R1: PROC(COMMAREA_PEKER)                  OPTIONS (MAIN);          00000210
                                                                        00000220
    %INCLUDE P0019906;            /* TRANS-OPPL_OMR                   */00000230
    %INCLUDE P0019908;            /* KOM_OMR                          */00000240
    %INCLUDE P0019910;            /* STYRE_OMR                        */00000250
    %INCLUDE P0019912;            /* DIV_PARAM_OMR                    */00000260
    %INCLUDE S0010R;              /* MAP FOR FJERNING AV SEGMENT      */00000270
                                                                        00000280
 %PAGE;                                                                 00000290
 %INCLUDE P0012002;   /* PCB - PEKER - OMR    */                        00000300
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                   00000310
 %INCLUDE P0012003;                         /* PCB                 */   00000320
                                                                        00000330
  DCL                                                                   00000340
     W01_PSB_NAVN                CHAR (8)       INIT('B001R00F');       00000350
  DCL                                                                   00000360
     PLITDLI ENTRY;                                                     00000370
                                                                        00000380
  %INCLUDE DFHBMSCA;                                                    00000390
    /* ************************************************************** */00000400
    /*                                                                */00000410
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000420
    /*                                                                */00000430
    /* ************************************************************** */00000440
                                                                        00000450
    %INCLUDE DLIUIB;                                                    00000460
                                                                        00000470
                                                                        00000480
                                                                        00000490
       DCL   W01_IO                  CHAR (290);                        00000500
                                                                        00000510
    /* ************************************************************** */00000520
    /*                                                                */00000530
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00000540
    /*                                                                */00000550
    /* ************************************************************** */00000560
                                                                        00000570
 DCL 1  W01_DLI_PARAM,                                                  00000580
              2   W02_GET                 CHAR (4)   INIT ('    '),     00000590
        2   W02_GHNP                CHAR (4)   INIT ('GHNP'),           00000600
        2   W02_DELT                CHAR (4)   INIT ('DLET'),           00000610
        2   W02_PARM_CT_1     FIXED BIN  (31)  INIT (1),                00000620
        2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),                00000630
        2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),                00000640
        2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5);                00000650
                                                                        00000660
                                                                        00000670
    /* ************************************************************** */00000680
    /*                                                                */00000690
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00000700
    /*                                                                */00000710
    /* ************************************************************** */00000720
                                                                        00000730
 DCL    SSA_UQUAL              STATIC      CHAR (9) INIT ((9)' ');      00000740
                                                                        00000750
 DCL 1  SSA1_RF0PERSN          STATIC,                                  00000760
        2    HDEL                          CHAR (17)  INIT              00000770
             ('RF0PERSN(FNR     '),                                     00000780
        2    REL_OP                        CHAR (2)   INIT (' ='),      00000790
        2    PKEY               FIXED      DEC  (11)  INIT ( 0  ),      00000800
        2    HP                            CHAR (1)   INIT (')' );      00000810
                                                                        00000820
                                                                        00000830
 DCL 01 TAB,                                                            00000840
       02 FNR (14)    PIC '(11)9';                                      00000850
                                                                        00000860
 DCL CURSOR                FIXED BIN(15) INIT (-1);                     00000870
 DCL                                                                    00000880
    DATE                   BUILTIN,                                     00000890
    VERIFY                 BUILTIN,                                     00000900
    CSTG                   BUILTIN,                                     00000910
    COMMAREA_PEKER         PTR,                                         00000920
    MAPSET_PTR             PTR,                                         00000930
    BMSMAPBR               PTR,                                         00000940
    OPPLYSNINGSTYPE        CHAR(1) INIT(' '),                           00000950
    SEGMENT                CHAR(8) INIT(' '),                           00000960
    ROT_SEGMENT            CHAR (1) INIT (' '),                         00000970
    FEIL_KODE              CHAR(1) INIT(' '),                           00000980
    RXX_STATUS_KODE        CHAR(1) INIT(' '),                           00000990
    MAP_MELDING (6)        CHAR(78) INIT((78)' '),                      00001000
    PIC_Z9_SLASH_Y9        PIC'Z9/Y9',                                  00001010
    PIC_3                  PIC'(3)9',                                   00001020
    PIC_ZZ9                PIC'ZZ9',                                    00001030
    PIC_9V99               PIC'9V.99',                                  00001040
    PIC_ZZ9V99             PIC'ZZ9V.99',                                00001050
    PIC_ZZZZ9              PIC'ZZZZ9',                                  00001060
    PIC_ZZZZZZZZ9          PIC'ZZZZZZZZ9',                              00001070
    PIC_4                  PIC'(4)9',                                   00001080
    PIC_6                  PIC'(6)9',                                   00001090
    PIC_11                 PIC'(11)9',                                  00001100
    FIXED_DEC3             FIXED DEC(3),                                00001110
    FIXED_DEC6             FIXED DEC(6) UNAL,                           00001120
    FIXED_DEC9             FIXED DEC(9),                                00001130
    FIXED_DEC5_4           FIXED DEC(5,4),                              00001140
    I                      PIC'Z9',                                     00001150
    K                      PIC'99',                                     00001160
    FJERN_IND              PIC'99' INIT   (1),                          00001170
    FJERN_OK               CHAR (1) INIT  (' ' ),                       00001180
    FJERN_KODE             CHAR (1) INIT  (' ' ),                       00001190
    ROOT_KODE              CHAR (1) INIT  (' ' ),                       00001200
    BEKREFT_KODE           CHAR (1) INIT  (' ' ),                       00001210
    W_FNR                  PIC '(11)9' INIT (0),                        00001220
    TB_S                   PIC'99',                                     00001230
    BARN_IND               PIC'99',                                     00001240
    L                      PIC'99',                                     00001250
    M                      PIC'99',                                     00001260
    X                      PIC'9',                                      00001270
    LOW_CHAR_BASED         CHAR(300) BASED(BMSMAPBR),                   00001280
    ADDR                   BUILTIN;                                     00001290
                                                                        00001300
 DCL 1 FNR_REG,                                                         00001310
       2 FNR1              FIXED DEC (11)     INIT ( 0 ),               00001320
       2 FNR2              FIXED DEC (11)     INIT ( 0 ),               00001330
       2 BRUKERID          CHAR      ( 4)     INIT ('' );               00001340
                                                                        00001350
 DCL CICSINFO           CHAR      (16);                                 00001360
                                                                        00001370
          KOM_OMR.DIV_PARAM_PEKER   =  ADDR (KOM_OMR.DIV_PARAM_OMR);    00001380
          KOM_OMR.STYRINGS_PEKER    =  ADDR (KOM_OMR.STYRINGS_OMR) ;    00001390
          KOM_OMR.TRANS_OPPL_PEKER   =  ADDR (KOM_OMR.TRANS_OPPL_OMR) ; 00001400
          CICSINFO= F_CICSINFO(DIV_PARAM_OMR.CICS_IND);                 00001410
         X = HENT_FRAM_MAP;                                             00001420
     IF ^HENT_FRAM_MAP THEN                                             00001430
        DO;                                                             00001440
          ALLOCATE S0010RO;                                             00001450
          HENT_FRAM_MAP ='1'B;                                          00001460
        END;                                                            00001470
                                                                        00001480
 RECEIVE_MAP:                                                           00001490
                                                                        00001500
     IF HENT_FRAM_MAP THEN                                              00001510
        DO;                                                             00001520
           EXEC CICS RECEIVE MAP('S0010R') MAPSET('S0010R3')            00001530
                                       SET(BMSMAPBR);                   00001540
          CALL TOME_MELD;                                               00001550
          FEIL_KODE    = ' ';                                           00001560
        END;                                                            00001570
                                                                        00001580
     IF S0010RI.FUNKSJONSKODEL > 0 THEN                                 00001590
        DO;                                                             00001600
           FUNKSJONSKODE = S0010RI.FUNKSJONSKODEI;                      00001610
                                                                        00001620
          IF FUNKSJONSKODE ^= 'Z' THEN                                  00001630
             DO;                                                        00001640
                FRA_CICS = '1'B;                                        00001650
                EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);   00001660
             END;                                                       00001670
        END;                                                            00001680
                                                                        00001690
     TRANS_RETURKODE = TRANSKODE;                                       00001700
     TRANS_OPPL_OMR.TRANSKODE = 'R0F0';                                 00001710
                                                                        00001720
     CALL KONTROLL_INPUT_HOVED_MAP;                                     00001730
     CALL OVERFOR_MELD;                                                 00001740
     CALL SJEKK_MELDING;                                                00001750
                                                                        00001760
     IF FEIL_KODE    = ' '  &                                           00001770
        ROT_SEGMENT  = ' '  &                                           00001780
        BEKREFT_KODE = ' ' THEN                                         00001790
        DO;                                                             00001800
          TRANS_OPPL_OMR.TRANSKODE = 'R0F1';                            00001810
        END;                                                            00001820
                                                                        00001830
                                                                        00001840
     IF FEIL_KODE    = ' '  &                                           00001850
        ROT_SEGMENT  = 'R'  &                                           00001860
        BEKREFT_KODE = ' ' THEN                                         00001870
        DO;                                                             00001880
          TRANS_OPPL_OMR.TRANSKODE = 'R0F2';                            00001890
        END;                                                            00001900
                                                                        00001910
     IF FEIL_KODE    = ' '  &                                           00001920
        ROT_SEGMENT  = 'R'  &                                           00001930
        BEKREFT_KODE = 'B' THEN                                         00001940
        DO;                                                             00001950
          TRANS_OPPL_OMR.TRANSKODE = 'R0F3';                            00001960
        END;                                                            00001970
                                                                        00001980
     SELECT (TRANSKODE);                                                00001990
        WHEN ('R0F1')                                                   00002000
           DO;                                                          00002010
              CALL FJERNING_SEGMENT;                                    00002020
           END;                                                         00002030
        WHEN ('R0F2')                                                   00002040
           DO;                                                          00002050
              CALL ROOT_BEKREFTALSE;                                    00002060
           END;                                                         00002070
        WHEN ('R0F3')                                                   00002080
           DO;                                                          00002090
              CALL FJERNING_SEGMENT;                                    00002100
           END;                                                         00002110
        OTHERWISE;                                                      00002120
     END;                                                               00002130
                                                                        00002140
      IF  FEIL_KODE    = 'J'  THEN                                      00002150
          DO;                                                           00002160
                CALL OVERFOR_MELD;                                      00002170
                EXEC CICS SEND MAP('S0010R') MAPSET('S0010R3')          00002180
                                    DATAONLY  CURSOR;                   00002190
          END;                                                          00002200
      ELSE                                                              00002210
         DO;                                                            00002220
            ALLOCATE S0010RO;                                           00002230
            CALL TOME_MAP;                                              00002240
            S0010RO.CICS_INFOO=DIV_PARAM_OMR.CICS_NAVN;                 00002250
            EXEC CICS SEND MAP('S0010R') MAPSET('S0010R3')              00002260
                                    ERASE;                              00002270
            HENT_FRAM_MAP ='0'B;                                        00002280
         END;                                                           00002290
                                                                        00002300
     IF TRANS_OPPL_OMR.TRANSKODE = 'R0F0' !                             00002310
        TRANS_OPPL_OMR.TRANSKODE = 'R0F3'  THEN                         00002320
        TRANS_OPPL_OMR.TRANSKODE = 'R0F1';                              00002330
                                                                        00002340
                                                                        00002350
  RETURN:                                                               00002360
                                                                        00002370
  EXEC CICS RETURN TRANSID(TRANS_OPPL_OMR.TRANSKODE)                    00002380
                                     COMMAREA(KOM_OMR);                 00002390
                                                                        00002400
 /* ******************************************************** */         00002410
 /*  KONTROLL SEC                                            */         00002420
 /* ******************************************************** */         00002430
 KONTROLL_INPUT_HOVED_MAP:                                              00002440
   PROC;                                                                00002450
                                                                        00002460
                                                                        00002470
     TB_S       =  0;                                                   00002480
     DO K = 1 TO 12 WHILE (S0010RI.FNRL(K) > 0 );                       00002490
        IF  S0010RI.FNRL (K) > 0       THEN                             00002500
           DO;                                                          00002510
             TAB.FNR(K)     = S0010RI.FNRI(K);                          00002520
             TB_S       = TB_S + 1;                                     00002530
           END;                                                         00002540
     END;                                                               00002550
                                                                        00002560
     L = 1;                                                             00002570
                                                                        00002580
     IF S0010RI.ROOT_SEGL > 0 THEN                                      00002590
        DO;                                                             00002600
          ROT_SEGMENT  = S0010RI.ROOT_SEGI;                             00002610
          IF ROT_SEGMENT ^= 'R' THEN                                    00002620
             DO;                                                        00002630
               MAP_MELDING (L) = 'ROT-KODE      ER FEIL             ';  00002640
               FEIL_KODE = 'J';                                         00002650
               L = L +  1;                                              00002660
             END;                                                       00002670
        END;                                                            00002680
                                                                        00002690
                                                                        00002700
   IF S0010RI.BEKREFTL > 0    THEN                                      00002710
      DO;                                                               00002720
         BEKREFT_KODE =  S0010RI.BEKREFTI;                              00002730
         IF BEKREFT_KODE = 'X'  THEN                                    00002740
            MAP_MELDING (L) =  '                                 ';     00002750
       ELSE                                                             00002760
         IF BEKREFT_KODE ^= ' ' &                                       00002770
            BEKREFT_KODE ^= 'B' THEN                                    00002780
            DO;                                                         00002790
               MAP_MELDING (L) = 'BEKREFT-KODE  ER FEIL             ';  00002800
               FEIL_KODE = 'J';                                         00002810
               L = L +  1;                                              00002820
           END;                                                         00002830
      END;                                                              00002840
                                                                        00002850
     IF TB_S = 0 THEN                                                   00002860
        DO;                                                             00002870
           MAP_MELDING (L) = 'FØDSELSNUMMER ER IKKE UTFILT      ';      00002880
           FEIL_KODE = 'J';                                             00002890
           GOTO KONTROL_999;                                            00002900
        END;                                                            00002910
                                                                        00002920
     DO K = 1 TO 14  WHILE (TAB.FNR(K) > 0);                            00002930
                                                                        00002940
          IF ^F_GYLDIG_FNR(TAB.FNR(K)  ) THEN                           00002950
              DO;                                                       00002960
                 MAP_MELDING (L) =                                      00002970
                                'UGYLDIG FØDSELSNUMMER ' !! TAB.FNR(K); 00002980
                 FEIL_KODE = 'J';                                       00002990
                 IF L < 6  THEN                                         00003000
                    L = L + 1;                                          00003010
                                                                        00003020
              END;                                                      00003030
     END;                                                               00003040
    /*                                                                  00003050
     IF FEIL_KODE = ' '  THEN                                           00003060
       DO;                                                              00003070
          DO K = 1 TO 14  WHILE (TAB.FNR (K) > 0);                      00003080
                                                                        00003090
             FNR_REG.FNR1       = TAB.FNR(K);                           00003100
                                                                        00003110
             EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);      00003120
                                                                        00003130
            IF FNR_REG.FNR2 > 0 THEN                                    00003140
               DO;                                                      00003150
                  MAP_MELDING (L) = TAB.FNR(K)   !!                     00003160
                           ' ER ET FØDSELSNUMMER SOM ER ENDRET' !!      00003170
                           ' TRYKK ENTER!';                             00003180
                  TAB.FNR (K) = FNR_REG.FNR2;                           00003190
                  IF L < 6  THEN                                        00003200
                   L = L + 1;                                           00003210
               END;                                                     00003220
          END;                                                          00003230
       END;                                                             00003240
   */                                                                   00003250
 KONTROL_999:                                                           00003260
                                                                        00003270
 END KONTROLL_INPUT_HOVED_MAP;                                          00003280
                                                                        00003290
 ROOT_BEKREFTALSE:                                                      00003300
   PROC;                                                                00003310
     S0010RO.MELDING6A  = DFHRED;                                       00003320
     FEIL_KODE = 'J';                                                   00003330
     IF  ROT_SEGMENT  ^= 'R' THEN                                       00003340
         DO;                                                            00003350
            S0010RO.MELDING6O  =                                        00003360
                               'FJERN-ROOT KODE ER FEIL *** *** ***';   00003370
         END;                                                           00003380
     ELSE                                                               00003390
         DO;                                                            00003400
            S0010RO.B_KTA    = DFHBMPRO;                                00003410
            S0010RO.BEKREFTA = DFHBMUNP;                                00003420
            S0010RI.BEKREFTL = CURSOR;                                  00003430
              S0010RO.MELDING6O  =                                      00003440
                           'VENNLIGST IKKE LA DETTE BILDET STÅ LENGDE'; 00003450
            MAP_MELDING(6)  =                                           00003460
                           'VENNLIGST IKKE LA DETTE BILDET STÅ LENGDE'; 00003470
                                                                        00003480
                                                                        00003490
         END;                                                           00003500
                                                                        00003510
 END ROOT_BEKREFTALSE;                                                  00003520
                                                                        00003530
                                                                        00003540
 TOME_MAP: PROC;                                                        00003550
          DO K = 1 TO 14;                                               00003560
            S0010RO.FNRO = 0;                                           00003570
          END;                                                          00003580
          S0010RO.BEKREFTO = ' ';                                       00003590
          S0010RO.ROOT_SEGO = ' ';                                      00003600
          S0010RO.MELDING1O = (78)' ';                                  00003610
          S0010RO.MELDING2O = (78)' ';                                  00003620
          S0010RO.MELDING3O = (78)' ';                                  00003630
          S0010RO.MELDING4O = (78)' ';                                  00003640
          S0010RO.MELDING5O = (78)' ';                                  00003650
          S0010RO.MELDING6O = (78)' ';                                  00003660
 END TOME_MAP;                                                          00003670
                                                                        00003680
 TOME_MELD: PROC;                                                       00003690
          MAP_MELDING(1)  = (78)' ';                                    00003700
          MAP_MELDING(2)  = (78)' ';                                    00003710
          MAP_MELDING(3)  = (78)' ';                                    00003720
          MAP_MELDING(4)  = (78)' ';                                    00003730
          MAP_MELDING(5)  = (78)' ';                                    00003740
          MAP_MELDING(6)  = (78)' ';                                    00003750
          S0010RO.MELDING1O = MAP_MELDING(1);                           00003760
          S0010RO.MELDING2O = MAP_MELDING(2);                           00003770
          S0010RO.MELDING3O = MAP_MELDING(3);                           00003780
          S0010RO.MELDING4O = MAP_MELDING(4);                           00003790
          S0010RO.MELDING5O = MAP_MELDING(5);                           00003800
          S0010RO.MELDING6O = MAP_MELDING(6);                           00003810
 END TOME_MELD;                                                         00003820
                                                                        00003830
 SJEKK_MELDING:                                                         00003840
   PROC;                                                                00003850
         S0010RO.MELDING6A  = DFHBMPRO;                                 00003860
         S0010RO.B_KTA      = DFHPROTN;                                 00003870
         S0010RO.BEKREFTA   = DFHPROTN;                                 00003880
                                                                        00003890
 END SJEKK_MELDING;                                                     00003900
                                                                        00003910
 OVERFOR_MELD:                                                          00003920
   PROC;                                                                00003930
                                                                        00003940
          S0010RO.MELDING1O = MAP_MELDING(1);                           00003950
          S0010RO.MELDING2O = MAP_MELDING(2);                           00003960
          S0010RO.MELDING3O = MAP_MELDING(3);                           00003970
          S0010RO.MELDING4O = MAP_MELDING(4);                           00003980
          S0010RO.MELDING5O = MAP_MELDING(5);                           00003990
          S0010RO.MELDING6O = MAP_MELDING(6);                           00004000
                                                                        00004010
 END OVERFOR_MELD;                                                      00004020
                                                                        00004030
 FJERNING_SEGMENT: PROC;                                                00004040
     EXEC CICS SYNCPOINT       ;                                        00004050
     CALL DATABASE ('OPEN ');                                           00004060
                                                                        00004070
    IF  FEIL_KODE    = 'J'  THEN                                        00004080
        GOTO FJERNING_99;                                               00004090
     DO I = 1 TO 6;                                                     00004100
        MAP_MELDING (I) = (68)' ';                                      00004110
     END;                                                               00004120
                                                                        00004130
     FJERN_IND =  1;                                                    00004140
                                                                        00004150
                                                                        00004160
     DO M = 1 TO 14   WHILE (TAB.FNR(M) > 0);                           00004170
                                                                        00004180
        ROOT_KODE       = ' ';                                          00004190
        RXX_STATUS_KODE = ' ';                                          00004200
        SSA1_RF0PERSN.PKEY = TAB.FNR (M);                               00004210
        W_FNR              = TAB.FNR (M);                               00004220
                                                                        00004230
        W02_GET = 'GHU ';                                               00004240
        CALL GHU_ROOT_SEGMENT;                                          00004250
        IF RXX_STATUS_KODE  = 'X'    THEN                               00004260
           DO;                                                          00004270
                CALL SJEKK_MELDING;                                     00004280
                CALL OVERFOR_MELD;                                      00004290
                EXEC CICS SEND MAP('S0010R') MAPSET('S0010R3')          00004300
                                    DATAONLY  CURSOR;                   00004310
                EXEC CICS RECEIVE MAP('S0010R') MAPSET('S0010R3')       00004320
                                       SET(BMSMAPBR);                   00004330
                                                                        00004340
                GOTO LES_NEXT;                                          00004350
           END;                                                         00004360
        W02_GET = 'GHNP';                                               00004370
                                                                        00004380
        DO WHILE ( RXX_STATUS_KODE  = ' ' );                            00004390
           SELECT (SEGMENT);                                            00004400
             WHEN ('RF0PERSN')                                          00004410
               DO;                                                      00004420
                  OPPLYSNINGSTYPE = 'J';                                00004430
                  FJERN_KODE = ' ';                                     00004440
                  IF ROT_SEGMENT = 'R' THEN                             00004450
                     DO;                                                00004460
                        CALL FJERN_SEGMENT;                             00004470
                        IF RXX_STATUS_KODE = ' ' THEN                   00004480
                           DO;                                          00004490
                                                                        00004500
                             ROOT_KODE       = 'J';                     00004510
                             RXX_STATUS_KODE = 'X';                     00004520
                             MAP_MELDING (FJERN_IND) =                  00004530
                             '* ** ROOT_SEGMENT FJERNES      FNR  : '   00004540
                                             !! W_FNR;                  00004550
                             FJERN_IND = FJERN_IND + 1;                 00004560
                           END;                                         00004570
                     END;                                               00004580
                                                                        00004590
               END;                                                     00004600
                                                                        00004610
             WHEN ('PINNTEKT')                                          00004620
               DO;                                                      00004630
                  OPPLYSNINGSTYPE = 'J';                                00004640
                                                                        00004650
               END;                                                     00004660
                                                                        00004670
             WHEN ('STATUS  ')                                          00004680
               DO;                                                      00004690
                                                                        00004700
                  CALL FJERN_STATUS_SEGMENT;                            00004710
               END;                                                     00004720
             WHEN ('TRANHIST')                                          00004730
               DO;                                                      00004740
                                                                        00004750
                  CALL FJERN_SEGMENT;                                   00004760
               END;                                                     00004770
             OTHERWISE;                                                 00004780
                                                                        00004790
           END;                                                         00004800
                                                                        00004810
          IF RXX_STATUS_KODE  = ' '  THEN                               00004820
             CALL LES_SEGMENT;                                          00004830
        END;                                                            00004840
           IF FJERN_IND > 5 THEN                                        00004850
              FJERN_IND  = 5   ;                                        00004860
                                                                        00004870
        IF FJERN_KODE = ' '    &                                        00004880
           ROOT_KODE  = ' '    THEN                                     00004890
           DO;                                                          00004900
              MAP_MELDING (FJERN_IND) =                                 00004910
               '* STATUS_SEGMENT FINNES IKKE  FNR  : ' !! W_FNR;        00004920
                                                                        00004930
              FJERN_IND = FJERN_IND + 1;                                00004940
           END;                                                         00004950
 LES_NEXT:                                                              00004960
     END;                                                               00004970
                                                                        00004980
     EXEC CICS SYNCPOINT       ;                                        00004990
     CALL DATABASE ('TERM');                                            00005000
     IF RXX_STATUS_KODE = ' ' THEN                                      00005010
        FJERN_OK = 'J';                                                 00005020
                                                                        00005030
 FJERNING_99:                                                           00005040
                                                                        00005050
 END FJERNING_SEGMENT;                                                  00005060
                                                                        00005070
                                                                        00005080
                                                                        00005090
                                                                        00005100
 DATABASE:                                                              00005110
   PROC(STYRING);                                                       00005120
                                                                        00005130
   DCL                                                                  00005140
     STYRING                               CHAR(5),                     00005150
     NULL                                  BUILTIN,                     00005160
     UNSPEC                                BUILTIN;                     00005170
                                                                        00005180
                                                                        00005190
     DCL                                                                00005200
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');         00005210
     DCL                                                                00005220
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00005230
  %PAGE;                                                                00005240
                                                                        00005250
     IF STYRING = 'OPEN' THEN                                           00005260
        DO;                                                             00005270
           CALL   PLITDLI                        (W02_PARM_CT_3,        00005280
                                                  W01_PCB_FUNCTION,     00005290
                                                  W01_PSB_NAVN,         00005300
                                                  UIBPTR);              00005310
                                                                        00005320
           IF DLIUIB.UIBFCTR                    =    '00000000'B THEN   00005330
             DO;                                                        00005340
               ALLOCATE PCB_UIB_PEKER_OMR;                              00005350
               PCB_UIB_PEKER_OMR.PCB_PEKER      =    UIBPCBAL;          00005360
               PCB_UIB_PEKER_OMR.UIB_PEKER      =    UIBPTR;            00005370
             END;                                                       00005380
           ELSE                                                         00005390
             DO;                                                        00005400
               FEIL_KODE    = 'J';                                      00005410
               MAP_MELDING (6) =                                        00005420
               'NOE ER GALT MED DATABASEN, KODE: ' !!                   00005430
               UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);               00005440
             END;                                                       00005450
        END;                                                            00005460
     ELSE                                                               00005470
        DO;                                                             00005480
           CALL   PLITDLI                        (W02_PARM_CT_1,        00005490
                                                  W01_TERM_FUNCTION);   00005500
           KOM_OMR.PCB_UIB_PEKER = NULL;                                00005510
        END;                                                            00005520
                                                                        00005530
 END DATABASE;                                                          00005540
                                                                        00005550
                                                                        00005560
 GHU_ROOT_SEGMENT: PROC;                                                00005570
                                                                        00005580
                                                                        00005590
                                                                        00005600
              CALL PLITDLI                         (W02_PARM_CT_4,      00005610
                                                    W02_GET,            00005620
                                                    RF1,                00005630
                                                    W01_IO ,            00005640
                                                    SSA1_RF0PERSN);     00005650
                                                                        00005660
              IF  UIBFCTR                    =     '00000000'B   THEN   00005670
                DO;                                                     00005680
                  SELECT ( RF1.STATUS_KODE );                           00005690
                    WHEN ( '  ', 'GK' )                                 00005700
                      DO;                                               00005710
                         RXX_STATUS_KODE = ' ';                         00005720
                         SEGMENT = RF1.SEGM_NAVN;                       00005730
                       END;                                             00005740
                    WHEN ( 'GE' )                                       00005750
                       DO;                                              00005760
                         MAP_MELDING(6) = 'FNR ' !! TAB.FNR(M) !!       00005770
                                            'ER IKKE I DATABASE ';      00005780
                         RXX_STATUS_KODE = 'X';                         00005790
                       END;                                             00005800
                                                                        00005810
                    OTHERWISE                                           00005820
                      DO;                                               00005830
                /* ************************************************** */00005840
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00005850
                /* ************************************************** */00005860
                                                                        00005870
                   RXX_STATUS_KODE = 'X';                               00005880
                   FEIL_KODE    = 'J';                                  00005890
                   MAP_MELDING (6) =                                    00005900
                        'NOE ER GALT MED DATABASEN PÅ GHU-ROOT-SEGMENT '00005910
                               !!' STATUS_KODE: '!!                     00005920
                                           RF1.STATUS_KODE ;            00005930
                      END;                                              00005940
                  END;                                                  00005950
                END;                                                    00005960
                                                                        00005970
                                                                        00005980
 END GHU_ROOT_SEGMENT;                                                  00005990
                                                                        00006000
 LES_SEGMENT: PROC;                                                     00006010
                                                                        00006020
                                                                        00006030
                                                                        00006040
              CALL PLITDLI                         (W02_PARM_CT_3,      00006050
                                                    W02_GET,            00006060
                                                    RF1,                00006070
                                                    W01_IO);            00006080
                                                                        00006090
                                                                        00006100
              IF  UIBFCTR                    =     '00000000'B   THEN   00006110
                DO;                                                     00006120
                  SELECT ( RF1.STATUS_KODE );                           00006130
                    WHEN ( '  ', 'GK' )                                 00006140
                      DO;                                               00006150
                         RXX_STATUS_KODE = ' ';                         00006160
                         SEGMENT = RF1.SEGM_NAVN;                       00006170
                       END;                                             00006180
                    WHEN ( 'GE' )                                       00006190
                       DO;                                              00006200
                         RXX_STATUS_KODE = 'X';                         00006210
                       END;                                             00006220
                                                                        00006230
                    OTHERWISE                                           00006240
                      DO;                                               00006250
                /* ************************************************** */00006260
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00006270
                /* ************************************************** */00006280
                                                                        00006290
                   RXX_STATUS_KODE = 'X';                               00006300
                   FEIL_KODE    = 'J';                                  00006310
                   MAP_MELDING (6) =                                    00006320
                      'NOE ER GALT MED DATABASEN PÅ LES_GNP_SEGMENT '   00006330
                               !!' STATUS_KODE: '!!                     00006340
                                           RF1.STATUS_KODE ;            00006350
                      END;                                              00006360
                  END;                                                  00006370
                END;                                                    00006380
                                                                        00006390
                                                                        00006400
 END LES_SEGMENT;                                                       00006410
                                                                        00006420
 %PAGE;                                                                 00006430
 FJERN_STATUS_SEGMENT: PROC;                                            00006440
                                                                        00006450
                                                                        00006460
              CALL PLITDLI                         (W02_PARM_CT_3,      00006470
                                                    W02_DELT,           00006480
                                                    RF1,                00006490
                                                    W01_IO);            00006500
                                                                        00006510
                                                                        00006520
              IF  UIBFCTR                    =     '00000000'B   THEN   00006530
                DO;                                                     00006540
                  SELECT ( RF1.STATUS_KODE );                           00006550
                    WHEN ( '  ' )                                       00006560
                      DO;                                               00006570
                          FJERN_KODE = 'J';                             00006580
                          RXX_STATUS_KODE = ' ';                        00006590
                         SEGMENT = RF1.SEGM_NAVN;                       00006600
                       END;                                             00006610
                    WHEN ( 'GE' )                                       00006620
                       DO;                                              00006630
                        RXX_STATUS_KODE = 'X';                          00006640
                       END;                                             00006650
                    OTHERWISE                                           00006660
                      DO;                                               00006670
                /* ************************************************** */00006680
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00006690
                /* ************************************************** */00006700
                                                                        00006710
                   RXX_STATUS_KODE = 'X';                               00006720
                   FEIL_KODE    = 'J';                                  00006730
                   MAP_MELDING (6) =                                    00006740
                      'NOE ER GALT MED DATABASEN PÅ DEL_STATUS_SEG'     00006750
                               !!' STATUS_KODE: '!!                     00006760
                                           RF1.STATUS_KODE ;            00006770
                      END;                                              00006780
                  END;                                                  00006790
                END;                                                    00006800
                                                                        00006810
                                                                        00006820
 END FJERN_STATUS_SEGMENT;                                              00006830
                                                                        00006840
 FJERN_SEGMENT: PROC;                                                   00006850
                                                                        00006860
                                                                        00006870
              CALL PLITDLI                         (W02_PARM_CT_3,      00006880
                                                    W02_DELT,           00006890
                                                    RF1,                00006900
                                                    W01_IO);            00006910
                                                                        00006920
                                                                        00006930
              IF  UIBFCTR                    =     '00000000'B   THEN   00006940
                DO;                                                     00006950
                  SELECT ( RF1.STATUS_KODE );                           00006960
                    WHEN ( '  ' )                                       00006970
                      DO;                                               00006980
                         RXX_STATUS_KODE = ' ';                         00006990
                         SEGMENT = RF1.SEGM_NAVN;                       00007000
                       END;                                             00007010
                    WHEN ( 'GE' )                                       00007020
                       DO;                                              00007030
                        RXX_STATUS_KODE = 'X';                          00007040
                       END;                                             00007050
                    OTHERWISE                                           00007060
                      DO;                                               00007070
                /* ************************************************** */00007080
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00007090
                /* ************************************************** */00007100
                                                                        00007110
                   RXX_STATUS_KODE = 'X';                               00007120
                   FEIL_KODE    = 'J';                                  00007130
                   MAP_MELDING (6) =                                    00007140
                          'NOE ER GALT MED DATABASEN PÅ DEL_ANT_SEG'    00007150
                               !!' STATUS_KODE: '!!                     00007160
                                           RF1.STATUS_KODE ;            00007170
                      END;                                              00007180
                  END;                                                  00007190
                END;                                                    00007200
            ELSE                                                        00007210
               DO;                                                      00007220
                   RXX_STATUS_KODE = 'X';                               00007230
                   FEIL_KODE    = 'J';                                  00007240
                   MAP_MELDING (6) =                                    00007250
                          'NOE ER GALT MED DATABASEN PÅ DEL_ANT_SEG'    00007260
                               !!' STATUS_KODE: '!!                     00007270
                                           RF1.STATUS_KODE ;            00007280
                                                                        00007290
               END;                                                     00007300
                                                                        00007310
 END FJERN_SEGMENT;                                                     00007320
 %INCLUDE R0019960;         /* F_CICSINFO        */                     00007330
                                                                        00007340
                                                                        00007350
 %INCLUDE R0019904;      /* FØSELSNUMMERKONTROLL            */          00007360
                                                                        00007370
 END R001R1;                                                            00007380
                                                                        00007390
