 /*       SIST ENDRET 11/04-83 14.35.35 AV   FARVIK                   */00000000
 /*IDENTIFIKASJON:                                                    */00000010
 /*    P0019907 PLI          HANSEMANN                                */00000020
 /*    FUNKSJONEN ER LAGET I APRIL 1981.                              */00000030
 /*HENSIKT:                                                           */00000040
 /*    SØKER BINÆRT ETTER ET GITT ELEMENT I EN GITT TABELL.           */00000050
 /*BRUKES:                                                            */00000060
 /*    IF F_TABSØKC_FUNNET(X,T_MAX,TAB) THEN...........               */00000070
 /*PARAMETRE INN:                                                     */00000080
 /*    ELEMENTNAVN,ANTALL ELEMENTER I TABELLEN,TABELLENS NAVN         */00000090
 /*PARAMETRE UT :                                                     */00000100
 /*    R_KODE                                                         */00000110
 /* ***************************************************************** */00000120
 %PAGE;                                /*   */                          00000130
 F_TABSØKC_FUNNET:                                                      00000140
   PROC(X,T_MAX,TAB) RETURNS(BIT(1));                                   00000150
   DCL                                                                  00000160
      TAB(*) CHAR(*);                                                   00000170
   DCL                                                                  00000180
      X CHAR(*);                                                        00000190
   DCL                                                                  00000200
      I FIXED BIN(15);                                                  00000210
   DCL                                                                  00000220
      (T_MAX,                                                           00000230
      MAX,                                                              00000240
      MIN) FIXED BIN(15);                                               00000250
   DCL                                                                  00000260
      R_KODE BIT(1);                                                    00000270
 %SKIP(2);                                                              00000280
      R_KODE = '0'B;                                                    00000290
      MIN    = 0;                                                       00000300
      MAX    = T_MAX;                                                   00000310
 %SKIP(1);                                                              00000320
      DO WHILE(MAX - MIN > 1 & ^R_KODE);                                00000330
                                                                        00000340
         I = (MAX + MIN) / 2;                                           00000350
                                                                        00000360
         IF TAB(I) = X THEN                                             00000370
            R_KODE = '1'B;                                              00000380
                                                                        00000390
         IF X < TAB(I) THEN                                             00000400
            MAX = I;                                                    00000410
         ELSE                                                           00000420
            MIN = I;                                                    00000430
      END;                                                              00000440
 %SKIP(1);                                                              00000450
      RETURN(R_KODE);                                                   00000460
   END F_TABSØKC_FUNNET;                                                00000470
