 /*       SIST ENDRET 08/10-82 14.08.02 AV   LUNDEBY                  */00000000
 /*       SIST ENDRET 23/08-82 09.58.29 AV   OLAV                     */00000010
  /* *************************************************************** */ 00000020
  /* IDENTIFIKASJON:  R0017501                                       */ 00000030
  /* PROGRAMMERER:    HELEN ,JULI  1982                              */ 00000040
  /* HENSIKT:                                                        */ 00000050
  /*         OPPRETTER EN MIDLERTIDIG OMRÅDE FOR                     */ 00000060
  /*         OPPBEVARING AV FNR. OG ROT INFORMASJON                  */ 00000070
  /*         SOM BRUKES I JUSTER_SB_ROT_SEGMENT (R0017601)           */ 00000080
  /* PROGRAM-TILKNYTNING:                                            */ 00000090
  /*         INKLUDES I LAG_STØNADSBREV_TRANSER (R0017001)           */ 00000100
  /*                                                                 */ 00000110
  /* *************************************************************** */ 00000120
 LAG_FNR_TAB:                                                           00000130
     PROC(PER_IND) ;                                                    00000140
 DCL  1  FNR_TABELL(14),                                                00000150
         2    FNR            FIXED DEC(11),                             00000160
         2    PENSJTYP             CHAR(1),                             00000170
         2    NAVN                CHAR(25),                             00000180
         2    TKNR            FIXED DEC(5),                             00000190
         2    SPRÅK                CHAR(1);                             00000200
 DCL   PER_IND               FIXED BIN(15);                             00000210
 DCL   F_IND                 FIXED BIN(15);                             00000220
  /* *************************************************************** */ 00000230
  /* PROGRAMMET BEGYNNER HER. VI FINNER FNR. I FNR_TABELL ELLER      */ 00000240
  /* FØRSTE LEDIGE PLASS I FNR_TABELL.                               */ 00000250
  /* *************************************************************** */ 00000260
    DO I = 1 TO 14 ;                                                    00000270
  /* *************************************************************** */ 00000280
  /* FNR. FINNES I TABELLEN FRA FØR.                                 */ 00000290
  /* *************************************************************** */ 00000300
       IF FNR_TABELL.FNR(I) = B02.PERSON.RF0PERSN.FNR(PER_IND)  THEN    00000310
          DO;                                                           00000320
             F_IND = I;                                                 00000330
             I = 14;                                                    00000340
          END;                                                          00000350
       ELSE                                                             00000360
  /* *************************************************************** */ 00000370
  /* FNR. FINNES IKKE I TABELLEN.                                    */ 00000380
  /* *************************************************************** */ 00000390
          IF FNR_TABELL.FNR(I) = 0   THEN                               00000400
             DO;                                                        00000410
                F_IND = I;                                              00000420
                FNR_TABELL.FNR(F_IND) =                                 00000430
                            B02.PERSON.RF0PERSN.FNR(PER_IND);           00000440
                I = 14;                                                 00000450
             END;                                                       00000460
          ELSE                                                          00000470
  /* *************************************************************** */ 00000480
  /* FNR_TABELLEN HAR IKKE LEDIGE PLASSER.                           */ 00000490
  /* *************************************************************** */ 00000500
             IF I = 14  THEN                                            00000510
             DO;                                                        00000520
 L110:          FEIL_MELD_NR = 1903;                                    00000530
                FEIL_VED_LABEL = 'L110';                                00000540
                GO TO L999;                                             00000550
             END;                                                       00000560
    END;                                                                00000570
    FNR_TABELL.PENSJTYP(F_IND)                                          00000580
                          = B02.PERSON.STATUS.PENSJONSTYPE1(PER_IND);   00000590
    FNR_TABELL.NAVN(F_IND)  = B02.PERSON.RF0PERSN.NAVN(PER_IND);        00000600
    FNR_TABELL.TKNR(F_IND)  = B02.PERSON.RF0PERSN.TKNR(PER_IND);        00000610
    FNR_TABELL.SPRÅK(F_IND) =  B02.PERSON.RF0PERSN.SPRÅK(PER_IND);      00000620
    END;                                                                00000630
 END LAG_FNR_TAB;                                                       00000640
