 /*       SIST ENDRET 28/07-98 12.51.42 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/07-98 12.30.33 AV   JDA7339                  */00000010
 /*       SIST ENDRET 17/02-98 12.30.46 AV   TSB7339                  */00000020
 /*       SIST ENDRET 17/02-98 12.25.59 AV   TSB7339                  */00000030
 /*       SIST ENDRET 28/07-94 13.23.07 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 09/11-92 13.48.39 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 30/10-92 13.29.40 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 25/11-91 10.48.29 AV   HERMAN                   */00000070
 /*       SIST ENDRET 17/10-90 13.40.15 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 10/10-90 13.00.21 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 12/05-87 09.21.02 AV   DYBVIK                   */00000100
 /* ***************************************************************** */00000110
 /*IDENTIFIKASJON:                                                    */00000120
 /* **********************                                            */00000130
 /*  PROGRAM-IDENT : R0019E04  FNR-ENDRING               HOVEDPROG    */00000140
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000150
 /*  PROGRAMMERER  : C.A.LARSEN KDØ                                   */00000160
 /*  PROGRAMMET BLE LAGET :   1983                                    */00000170
 /*  ENDRINGERSDATO :         13.02.1998                              */00000180
 /*  ENDRINGEN GJELDER:       ENDRET LOGIKK I FNRREC(FNRTIL) MELINGENE*/00000190
 /*                           LIGGER IKKE SORTERT PÅ FRAFNR.          */00000200
 /*                           TILFNR=LØPENR OG FÅR KEY. ENDRER LES I  */00000210
 /*                           PGM TIL OPPSLAG PÅ TILFNR FRA FRAFNR    */00000220
 /*  ENDRINGEN BLE UTFØRT AV: SVERRE LUNDEBY,DATA-UTVIKLING AS        */00000230
 /*                                                                   */00000240
 /* ***************************************************************** */00000250
 /*HENSIKT:                                                           */00000260
 /* **********                                                        */00000270
 /*  PROGRAMMET FORETAR FNR-ENDRING I P001-BASEN.                     */00000280
 /*   VIDERE FORETAS DET CALL TIL PROGRAM SOM FORETAR NØDVENDIGE      */00000290
 /*   NYE BEREGNINGER AV PENSJON PÅ GRUNNLAG AV ENDRINGENE.           */00000300
 /*  PROGRAMMET R0019E05 SKAL KJØRES ETTERPÅ FOR Å SKRIVE UT          */00000310
 /*   MELDINGER.                                                      */00000320
 /*  PROGRAM R0019001 SKAL OGSÅ KJØRES ETTERPÅ FOR UTSKRIVING AV      */00000330
 /*   STØNADSBREV.                                                    */00000340
 /*                                                                   */00000350
 /* ***************************************************************** */00000360
 /*PROGRAMTILKNYTTING:                                                */00000370
 /* ********************                                              */00000380
 /*  EXEC CICS LINK TIL :                                             */00000390
 /*                                                                   */00000400
 /*     R0013101   HENTER DATA TIL B01                                */00000410
 /*     R0014901   AUTOHENDELSE_BEREGNING                             */00000420
 /*     R0015401   SKRIV B02                                          */00000430
 /*     R0016001   STAT TRANS                                         */00000440
 /*     R0019921   HENT MELDING FRA FEIL-MELD-BASEN                   */00000450
 /*                                                                   */00000460
 /*  INCLUDE På FØLGENDE PROSEDYRER :                                 */00000470
 /*                                                                   */00000480
 /*     R0021201   FNR_ENDR I DSR, M/ PARAMETERLISTE                  */00000490
 /*     R0019961   OMREGNING_PGA_FNRENDRING                           */00000500
 /*     R0019956   BEREGNER GRUNNBELøP I ONLINE PROGRAM               */00000510
 /*     R0019913   F_SNUDATO                                          */00000520
 /*                                                                   */00000530
 /*  ARBEIDSOMRÅDER SOM BRUKES :                                      */00000540
 /*                                                                   */00000550
 /*          P0014009;                                 POENGREKKER    */00000560
 /*          P0019014;                                 FNR TAB/ST.BREV*/00000570
 /*          P0019906;                                 TRANS_OPPL_OMR */00000580
 /*          P0019908;                                 KOM_OMR        */00000590
 /*          P0019910;                                 STYRINGS_OMR   */00000600
 /*          P0019911;                                 TRANS_LISTE    */00000610
 /*          P0019912;                                 DIV_PARAM_OMR  */00000620
 /*          P0019921;                                 B00            */00000630
 /*          P0019924;                                 G_TAB          */00000640
 /*          P0019925;                                 G_V_TAB        */00000650
 /*          P0010601;                        TRANS_OMR FOR UFØRE     */00000660
 /*          P0019940;                                 TRANHIST       */00000670
 /*          P0019941;                                 GRUNNBAP       */00000680
 /*          P0019942;                                 GRUNNBUP       */00000690
 /*          P0019943;                                 GRBLUFST       */00000700
 /*          P0019944;                                 GRBLFORS       */00000710
 /*          P0019945;                                 GRUNNBEP       */00000720
 /*          P0019946;                                 GRBLFAMP       */00000730
 /*          P0019947;                                 GRBLEBEN       */00000740
 /*          P0019948;                                 GRBLEBBE       */00000750
 /*          P0019949;                                 ENDRBLAN       */00000760
 /*          P0019950;                                 OPPHBL1        */00000770
 /*          P0019951;                                 OPPHBL2        */00000780
 /*          P0019952;                                 BARN           */00000790
 /*          P0012002;                            PCB_UIB_PEKER_OMR   */00000800
 /*          P0012003;                            PCB                 */00000810
 /*                                                                   */00000820
 /* ***************************************************************** */00000830
 /*DATASETTOPPLYSNINGER:                                              */00000840
 /* ***********************                                           */00000850
 /*  INPUT-DATSETTET ER VSAM-FILEN P001.FNRTILG OG RF-BASEN           */00000860
 /*  OUTPUT ER VSAMFILEN P001.FNRENDR,                                */00000870
 /*            VSAMFILEN P001.MELD.TRANS,                             */00000880
 /*            OPPDATERT RF-BASE,                                     */00000890
 /*            TRANSAKSJONSBASE TIL STATISTIKK OG                     */00000900
 /*            STØNADSBREV-BASEN                                      */00000910
 /*                                                                   */00000920
 /* ***************************************************************** */00000930
 /*FEILMELDINGER:                                                     */00000940
 /* *******************                                               */00000950
 /*  LISTE OVER FEIL SKRIVES UT                                       */00000960
 /*                                                                   */00000970
 /* ***************************************************************** */00000980
                                                                        00000990
  R0019E4:                                                              00001000
    PROC            (COMMAREA_PEKER)                                    00001010
           OPTIONS  (MAIN);                                             00001020
                                                                        00001030
    %PAGE;                                                              00001040
    %INCLUDE P0014009;                              /* ????           */00001050
                                                                        00001060
    %PAGE;                                                              00001070
    %INCLUDE P0019014;                              /* FNR TAB/ST.BREV*/00001080
                                                                        00001090
    %PAGE;                                                              00001100
    %INCLUDE P0019906;                              /* TRANS_OPPL_OMR */00001110
                                                                        00001120
    %PAGE;                                                              00001130
    %INCLUDE P0019908;                              /* KOM_OMR        */00001140
                                                                        00001150
    %PAGE;                                                              00001160
    %INCLUDE P0019910;                              /* STYRINGS_OMR   */00001170
                                                                        00001180
    %PAGE;                                                              00001190
    DCL 1 TRANS_LISTE_OMR UNALIGNED BASED(TRANS_LISTE_PEKER),           00001200
        3 TRANS_LISTE_LINJE(5),                                         00001210
    %INCLUDE P0019911;                              /* TRANS_LISTE    */00001220
                                                                        00001230
    %PAGE;                                                              00001240
    DCL 1 WORK_TRANS_LISTE UNAL BASED(WORK_TRANS_LISTE_PEKER),          00001250
    %INCLUDE P0019911;                         /* WORK_TRANS_LISTE    */00001260
                                                                        00001270
    %PAGE;                                                              00001280
    %INCLUDE P0019912;                              /* DIV_PARAM_OMR  */00001290
                                                                        00001300
    %PAGE;                                                              00001310
    %INCLUDE P0019924;                              /* G_V_TAB        */00001320
                                                                        00001330
    %PAGE;                                                              00001340
    %INCLUDE P0019925;                              /*  G_TAB         */00001350
                                                                        00001360
    %PAGE;                                                              00001370
       DCL 1 B00              BASED (B00_PEKER),                        00001380
    %INCLUDE P0019921;                              /* B00            */00001390
                                                                        00001400
    %PAGE;                                                              00001410
       DCL 1 B01              BASED (B01_PEKER),                        00001420
    %INCLUDE P0019921;                              /* B01            */00001430
                                                                        00001440
    %PAGE;                                                              00001450
       DCL 1 B02              BASED (B02_PEKER),                        00001460
    %INCLUDE P0019921;                              /* B02            */00001470
                                                                        00001480
    %PAGE;                                                              00001490
       DCL 1 W02,                                   /* WORK-OMR FOR   */00001500
    %INCLUDE P0019921;                              /* B02            */00001510
                                                                        00001520
    %PAGE;                                                              00001530
    %INCLUDE P0010601;                              /* TRANS_OMR FOR  */00001540
                                                    /* UFØRE          */00001550
    %PAGE;                                                              00001560
       DCL 1 TRANH_S        BASED (IO_PEKER),                           00001570
    %INCLUDE P0019940;                              /* TRANHIST       */00001580
                                                                        00001590
    %PAGE;                                                              00001600
       DCL 1 ALDER_S        BASED (IO_PEKER),                           00001610
    %INCLUDE P0019941;                              /* GRUNNBAP       */00001620
                                                                        00001630
    %PAGE;                                                              00001640
       DCL 1 A1DER_S        BASED (IO_PEKER),                           00001650
    %INCLUDE P0019N41;                              /* GRUNNBA1       */00001660
                                                                        00001670
    %PAGE;                                                              00001680
       DCL 1 UFØRP_S        BASED (IO_PEKER),                           00001690
    %INCLUDE P0019942;                              /* GRUNNBUP       */00001700
                                                                        00001710
    %PAGE;                                                              00001720
       DCL 1 U2ØRP_S        BASED (IO_PEKER),                           00001730
    %INCLUDE P0019N42;                              /* GRUNNBU2       */00001740
                                                                        00001750
    %PAGE;                                                              00001760
       DCL 1 GRUNN_S        BASED (IO_PEKER),                           00001770
    %INCLUDE P0019943;                              /* GRBLUFST       */00001780
                                                                        00001790
    %PAGE;                                                              00001800
       DCL 1 FORSØ_S        BASED (IO_PEKER),                           00001810
    %INCLUDE P0019944;                              /* GRBLFORS       */00001820
                                                                        00001830
    %PAGE;                                                              00001840
       DCL 1 GRUIF_S        BASED (IO_PEKER),                           00001850
    %INCLUDE P0019N44;                              /* GRUNNBIF       */00001860
                                                                        00001870
    %PAGE;                                                              00001880
       DCL 1 ETT_E_S        BASED (IO_PEKER),                           00001890
    %INCLUDE P0019945;                              /* GRUNNBEP       */00001900
                                                                        00001910
    %PAGE;                                                              00001920
       DCL 1 ETT_E3_S        BASED (IO_PEKER),                          00001930
    %INCLUDE P0019N45;                              /* GRUNNBE3       */00001940
                                                                        00001950
    %PAGE;                                                              00001960
       DCL 1 ETT_F_S        BASED (IO_PEKER),                           00001970
    %INCLUDE P0019946;                              /* GRBLFAMP       */00001980
                                                                        00001990
    %PAGE;                                                              00002000
       DCL 1 ETT_F4_S        BASED (IO_PEKER),                          00002010
    %INCLUDE P0019N46;                              /* GRBLFAE4       */00002020
                                                                        00002030
    %PAGE;                                                              00002040
       DCL 1 ETT_B_S        BASED (IO_PEKER),                           00002050
    %INCLUDE P0019947;                              /* GRBLEBEN       */00002060
                                                                        00002070
    %PAGE;                                                              00002080
       DCL 1 ETT_B6_S        BASED (IO_PEKER),                          00002090
    %INCLUDE P0019N47;                              /* GRBLEBB6       */00002100
                                                                        00002110
    %PAGE;                                                              00002120
       DCL 1 FOREL_S        BASED (IO_PEKER),                           00002130
    %INCLUDE P0019948;                              /* GRBLEBBE       */00002140
                                                                        00002150
    %PAGE;                                                              00002160
       DCL 1 FOREL_F5_S        BASED (IO_PEKER),                        00002170
    %INCLUDE P0019N48;                              /* GRBLF5BE       */00002180
                                                                        00002190
    %PAGE;                                                              00002200
       DCL 1 ENDRB_S        BASED (IO_PEKER),                           00002210
    %INCLUDE P0019949;                              /* ENDRBLAN       */00002220
                                                                        00002230
    %PAGE;                                                              00002240
       DCL 1 OPPB1_S        BASED (IO_PEKER),                           00002250
    %INCLUDE P0019950;                              /* OPPHBL1        */00002260
                                                                        00002270
    %PAGE;                                                              00002280
       DCL 1 OPPB2_S        BASED (IO_PEKER),                           00002290
    %INCLUDE P0019951;                              /* OPPHBL2        */00002300
                                                                        00002310
    %PAGE;                                                              00002320
       DCL 1 BARN_S         BASED (IO_PEKER),                           00002330
    %INCLUDE P0019952;                              /* BARN           */00002340
                                                                        00002350
    %PAGE;                                                              00002360
       DCL 1 YRKEP_S        BASED (IO_PEKER),                           00002370
    %INCLUDE P0019960;                              /* GRUNNBYP       */00002380
                                                                        00002390
    /* ************************************************************** */00002400
    /*                                                                */00002410
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00002420
    /*                                                                */00002430
    /* ************************************************************** */00002440
                                                                        00002450
       DCL                                                              00002460
         ( ADDR , CSTG , LOW , STG , SUBSTR , DATE , VERIFY ,           00002470
           NULL , UNSPEC , STORAGE )  BUILTIN;                          00002480
                                                                        00002490
       DCL                                                              00002500
         PLITDLI                     ENTRY;                             00002510
                                                                        00002520
                                                                        00002530
    %PAGE;                                                              00002540
                                                                        00002550
    /* ************************************************************** */00002560
    /*                                                                */00002570
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00002580
    /*                                                                */00002590
    /* ************************************************************** */00002600
                                                                        00002610
    %INCLUDE DLIUIB;                                                    00002620
                                                                        00002630
       DCL                                                              00002640
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00002650
       DCL                                                              00002660
           COMMAREA_PEKER            POINTER;                           00002670
       DCL                                                              00002680
           W01_HJELPE_PTR            POINTER;                           00002690
       DCL                                                              00002700
           IO_PEKER                  POINTER;                           00002710
       DCL                                                              00002720
           ENDR_PEKER                POINTER;                           00002730
       DCL                                                              00002740
           MELD_PEKER                POINTER;                           00002750
       DCL KEY_TILNR_PEKER           POINTER,                           00002760
           OMR_FEIL_PEKER            POINTER;                           00002770
                                                                        00002780
                                                                        00002790
    /* ************************************************************** */00002800
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00002810
    /* ************************************************************** */00002820
                                                                        00002830
    %PAGE;                                                              00002840
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00002850
                                                                        00002860
    %PAGE;                                                              00002870
       DCL 1  PCB1             BASED (RF1_PCB_PEKER),                   00002880
    %INCLUDE P0012003;                         /* PCB                 */00002890
                                                                        00002900
                                                                        00002910
    %PAGE;                                                              00002920
       DCL 1  PCB2             BASED (RF2_PCB_PEKER),                   00002930
    %INCLUDE P0012003;                         /* PCB                 */00002940
                                                                        00002950
    %PAGE;                                                              00002960
       DCL 1  PCB3             BASED (RF3_PCB_PEKER),                   00002970
    %INCLUDE P0012003;                         /* PCB                 */00002980
                                                                        00002990
    /* ************************************************************** */00003000
    /*   DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-   */00003010
    /*   KALL                                                         */00003020
    /**************************************************************** */00003030
                                                                        00003040
                                                                        00003050
       DCL                                                              00003060
         W01_PSB_NAVN                CHAR (8)       INIT('B0019E04'),   00003070
         W01_PCB_FUNCTION            CHAR (4)       INIT('PCB '),       00003080
         W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');       00003090
                                                                        00003100
    /* ************************************************************** */00003110
    /*                                                                */00003120
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00003130
    /*                                                                */00003140
    /* ************************************************************** */00003150
                                                                        00003160
       DCL 1  W01_DLI_PARAM,                                            00003170
              2   W02_GU                  CHAR (4)   INIT ('GU  '),     00003180
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),     00003190
              2   W02_GHNP                CHAR (4)   INIT ('GHNP'),     00003200
              2   W02_GHU                 CHAR (4)   INIT ('GHU '),     00003210
              2   W02_DLET                CHAR (4)   INIT ('DLET'),     00003220
              2   W02_ISRT                CHAR (4)   INIT ('ISRT'),     00003230
              2   W02_REPL                CHAR (4)   INIT ('REPL'),     00003240
              2   W02_PARM_CT_1     FIXED BIN  (31)  INIT (1),          00003250
              2   W02_PARM_CT_2     FIXED BIN  (31)  INIT (2),          00003260
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00003270
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00003280
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),          00003290
              2   W02_PARM_CT_6     FIXED BIN  (31)  INIT (6);          00003300
       DCL    1   W02_PERSONEN_ER_SPERRET BIT  (1)   INIT ('1'B);       00003310
       DCL    1   W02_MER_DATA            BIT  (1)   INIT ('1'B);       00003320
       DCL    1   W02_ISRT_OK             BIT  (1)   INIT ('1'B);       00003330
       DCL    1   W02_REPL_OK             BIT  (1)   INIT ('1'B);       00003340
       DCL    1   W02_DLET_OK             BIT  (1)   INIT ('1'B);       00003350
       DCL    1   W02_SS_ER_DØD           BIT  (1)   INIT ('0'B);       00003360
       DCL    1   W02_OUT2                CHAR (20)  INIT ( (20) ' ');  00003370
                                                                        00003380
       DCL    W01_IO                 CHAR (150)      INIT ( '' );       00003390
       DCL    W01_HJELPE_IO          CHAR (150) BASED (W01_HJELPE_PTR); 00003400
                                                                        00003410
                                                                        00003420
    /* ************************************************************** */00003430
    /*                                                                */00003440
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00003450
    /*                                                                */00003460
    /* ************************************************************** */00003470
                                                                        00003480
       DCL    SSA_UQUAL              STATIC      CHAR (9) INIT ((9)' ');00003490
                                                                        00003500
       DCL    SSA3_TILKN_UQUAL       STATIC      CHAR (9)               00003510
                                                 INIT ('TILKN    ');    00003520
                                                                        00003530
       DCL    SSA3_STATUS_F          STATIC      CHAR (11)              00003540
                                                 INIT ('STATUS  *F ');  00003550
                                                                        00003560
       DCL    SSA3_STATUS_L          STATIC      CHAR (11)              00003570
                                                 INIT ('STATUS  *L ');  00003580
                                                                        00003590
       DCL    SSA3_TRANHIST_F        STATIC      CHAR (11)              00003600
                                                 INIT ('TRANHIST*F ');  00003610
                                                                        00003620
       DCL 1  SSA1_RF0PERSN          STATIC,                            00003630
              2    HDEL                          CHAR (17)  INIT        00003640
                   ('RF0PERSN(FNR     '),                               00003650
              2    REL_OP                        CHAR (2)   INIT (' ='),00003660
              2    PKEY               FIXED      DEC  (11)  INIT ( 0  ),00003670
              2    HP                            CHAR (1)   INIT (')' );00003680
                                                                        00003690
       DCL 1  SSA2_RF0PERSN          STATIC,                            00003700
              2    HDEL                          CHAR (17)  INIT        00003710
                   ('RF0PERSN(FNR     '),                               00003720
              2    REL_OP                        CHAR (2)   INIT (' ='),00003730
              2    PKEY               FIXED      DEC  (11)  INIT ( 0  ),00003740
              2    HP                            CHAR (1)   INIT (')' );00003750
                                                                        00003760
       DCL 1  SSA3_RF0PERSN          STATIC,                            00003770
              2    HDEL                          CHAR (17)  INIT        00003780
                   ('RF0PERSN(FNR     '),                               00003790
              2    REL_OP                        CHAR (2)   INIT (' ='),00003800
              2    PKEY               FIXED      DEC  (11)  INIT ( 0  ),00003810
              2    HP                            CHAR (1)   INIT (')' );00003820
                                                                        00003830
       DCL 1  SSA3_TILKN             STATIC,                            00003840
              2    HDEL                          CHAR (17)  INIT        00003850
                   ('TILKN   (FNRANDR '),                               00003860
              2    REL_OP                        CHAR (2)   INIT (' ='),00003870
              2    PKEY               FIXED      DEC  (11)  INIT ( 0  ),00003880
              2    HP                            CHAR (1)   INIT (')' );00003890
                                                                        00003900
       DCL 1  SSA3_STATUS            STATIC,                            00003910
              2    HDEL                          CHAR (17)  INIT        00003920
                   ('STATUS  (STATKODE'),                               00003930
              2    REL_OP                        CHAR (2)   INIT (' ='),00003940
              2    KODE                          CHAR (1)   INIT ('S'), 00003950
              2    HP                            CHAR (1)   INIT (')' );00003960
                                                                        00003970
       DCL 1  SSA4_STATUS            STATIC,                            00003980
              2    HDEL                          CHAR (17)  INIT        00003990
                   ('STATUS  (STATKODE'),                               00004000
              2    REL_OP                        CHAR (2)   INIT (' ='),00004010
              2    KODE                          CHAR (1),              00004020
              2    HP                            CHAR (1)   INIT (')' );00004030
                                                                        00004040
       DCL 1  SSA5_TRANHIST          STATIC,                            00004050
              2    HDEL                          CHAR (17)  INIT        00004060
                   ('TRANHIST(VTPBLKOD'),                               00004070
              2    REL_OP                        CHAR (2)   INIT (' ='),00004080
              2    VTP                FIXED      DEC  (4),              00004090
              2    KODE                          CHAR (2),              00004100
              2    HP                            CHAR (1)   INIT (')' );00004110
                                                                        00004120
       DCL                                                              00004130
           MAP_MELDING              CHAR(78)      INIT((78)' '),        00004140
           1  FEIL_STRUC,                                               00004150
              2  FEIL_NR               FIXED DEC(5),                    00004160
              2  FEIL_MELDING          CHAR     (78),                   00004170
              2  KOM_OMR_PEKER         POINTER;                         00004180
                                                                        00004190
    %PAGE;                                                              00004200
    /* ************************************************************** */00004210
    /*                                                                */00004220
    /*   INPUT RECORD                                                 */00004230
    /*                                                                */00004240
    /* ************************************************************** */00004250
    DCL 1 FNRREC,                                                       00004260
          2 LINKNR       FIXED DEC(11),                                 00004270
          2 FRANR        FIXED DEC(11),                                 00004280
          2 TILNR        FIXED DEC(11),                                 00004290
          2 REKKEF       PIC '(2)9',                                    00004300
          2 DATO         FIXED DEC(7),  /* ÅR , MND , DAG + 0  */       00004310
          2 KODE         CHAR(1),                                       00004320
          2 SISTENR      FIXED DEC(11);                                 00004330
                                                                        00004340
                                                                        00004350
    DCL KEY_PACK      FIXED DEC (11);                                   00004360
    DCL KEY_CHAR            CHAR (6);                                   00004370
    DCL KEY_TILNR           CHAR (6) BASED(KEY_TILNR_PEKER) ;           00004380
                                                                        00004390
                                                                        00004400
    %PAGE;                                                              00004410
    /* ************************************************************** */00004420
    /*                                                                */00004430
    /*   STYRERECORD FRA OPERATØR MED 3 FORSKJELLIGE START PROCED.    */00004440
    /*                                                                */00004450
    /*   1) HVIS FRANR = 0 , HELE INPUTFILE LESES                     */00004460
    /*   2) HVIS FRANR > 0 , LESER F.O.M. DETTE FNR OG                */00004470
    /*      RESTEN AV FILEN HVIS ANTALL ER FORSKJELLIG FRA 1          */00004480
    /*   3) HVIS FRANR > 0 , LESER BARE DETTE FNR NÅR                 */00004490
    /*      ANTALL = 1                                                */00004500
    /*                                                                */00004510
    /* ************************************************************** */00004520
                                                                        00004530
    DCL 1 TEST_OMR,                                                     00004540
          2 TRANS_KODE   CHAR(4),                                       00004550
          2 FILLER1      CHAR(1),                                       00004560
          2 FRANR        PIC '(11)9',                                   00004570
          2 FILLER2      CHAR(1),                                       00004580
          2 ANTALL       CHAR(1);                                       00004590
                                                                        00004600
    DCL TEST_IN_LENGDE   FIXED BIN (31) INIT (18);                      00004610
                                                                        00004620
                                                                        00004630
    %PAGE;                                                              00004640
    /* ************************************************************** */00004650
    /*                                                                */00004660
    /*   OUTPUT RECORD                                                */00004670
    /*                                                                */00004680
    /* ************************************************************** */00004690
    DCL 1 MELD_IO,                                                      00004700
          2 ADRESSAT     CHAR(1),                                       00004710
          2 SORTERINGSBEGREP,                                           00004720
            5 TKNR       PIC '(4)9',                                    00004730
            5 FNR        PIC '(11)9',                                   00004740
          2 ENDRINGSDATA,                                               00004750
            5 KODE       CHAR(1),                                       00004760
            5 FRANR      PIC '(11)9',                                   00004770
            5 SISTENR    PIC '(11)9',                                   00004780
            5 ENDR_DATO  PIC '(6)9',                                    00004790
            5 LINKNR     PIC '(11)9',                                   00004800
          2 NAVN         CHAR(25),                                      00004810
          2 TKNR         PIC '(4)9',                                    00004820
          2 VIRKDATO     PIC '(4)9',                                    00004830
          2 PK1          CHAR(1);                                       00004840
                                                                        00004850
    DCL 1 OMR_FEIL,                                                     00004860
          2 TEKST1       CHAR(43),                                      00004870
          2 FNR          PIC '(11)9',                                   00004880
          2 FILLER       CHAR(24) INIT(' ');                            00004890
                                                                        00004900
    DCL 1 ENDR_DSR,                                                     00004910
          2 FRANR        PIC '(11)9',                                   00004920
          2 FILLER1      CHAR (1) INIT(' '),                            00004930
          2 TILNR        PIC '(11)9',                                   00004940
          2 FILLER       CHAR (1) INIT(' '),                            00004950
          2 KODE         CHAR (1);                                      00004960
                                                                        00004970
    /* ************************************************************** */00004980
    /*                                                                */00004990
    /*  DATA FRA CICSPROGRAMMET TIL PRINTER R41J DVS. DRAMMENSVN. 60  */00005000
    /*                                                                */00005010
    /* ************************************************************** */00005020
                                                                        00005030
    DCL 1 ROUTLISTE,                                                    00005040
          2 PRINT,                                                      00005050
            3 TERMID          CHAR (4)  INIT('G11J'),                   00005060
            3 RESERV          CHAR (12) INIT(' '),                      00005070
          2 SLUTTLISTE,                                                 00005080
            3 SLUTT       FIXED BIN(15) INIT(-1),                       00005090
            3 RESERV          CHAR (14) INIT(' ');                      00005100
                                                                        00005110
                                                                        00005120
    /* ************************************************************** */00005130
    /*                                                                */00005140
    /*  DIV. DEKLARASJONER                                            */00005150
    /*                                                                */00005160
    /* ************************************************************** */00005170
                                                                        00005180
                                                                        00005190
    DCL ANT_LEST                               PIC '(5)9',              00005200
        ANT_LEST_CHAR      DEF   ANT_LEST      CHAR (5)  ,              00005210
        ANT_ENDR                               PIC '(5)9',              00005220
        ANT_ENDR_CHAR      DEF   ANT_ENDR      CHAR (5)  ,              00005230
        ANT_UFØRH                              PIC '(5)9',              00005240
        ANT_UFØRH_CHAR     DEF   ANT_UFØRH     CHAR (5)  ,              00005250
        ANT_OMR_4001                           PIC '(5)9',              00005260
        ANT_OMR_4001_CHAR  DEF   ANT_OMR_4001  CHAR (5)  ,              00005270
        ANT_OMR_4901                           PIC '(5)9',              00005280
        ANT_OMR_4901_CHAR  DEF   ANT_OMR_4901  CHAR (5)  ,              00005290
        ANT_STAT                               PIC '(5)9',              00005300
        ANT_STAT_CHAR      DEF   ANT_STAT      CHAR (5)  ,              00005310
        ANT_CALL_OMR                           PIC '(5)9',              00005320
        ANT_CALL_OMR_CHAR  DEF   ANT_CALL_OMR  CHAR (5)  ,              00005330
        ANT_CALL_MAN                           PIC '(5)9',              00005340
        ANT_CALL_MAN_CHAR  DEF   ANT_CALL_MAN  CHAR (5)  ,              00005350
        ANT_CALL_DØD                           PIC '(5)9',              00005360
        ANT_CALL_DØD_CHAR  DEF   ANT_CALL_DØD  CHAR (5)  ,              00005370
        PRINT_TELLER                           PIC '(2)9',              00005380
        W01_DUMMY_DATO                         DEC FIXED(4);            00005390
                                                                        00005400
                                                                        00005410
    DCL FATAL_FEIL       CHAR (1) INIT('5');                            00005420
                                                                        00005430
 %PAGE;                                                                 00005440
                                                                        00005450
                                                                        00005460
    /* ************************************************************** */00005470
    /*                                                                */00005480
    /*   FEILMELDINGS-LINJE .                                         */00005490
    /*                                                                */00005500
    /* ************************************************************** */00005510
                                                                        00005520
    DCL   W01_UTLINJE           CHAR (78)     INIT ( (78)' ' );         00005530
                                                                        00005540
    DCL DATO_DAGENS    CHAR (6);                                        00005550
                                                                        00005560
    DCL DAGENS_DATO_ÅR_MND DEF DATO_DAGENS POS(1) PIC '9999',           00005570
        DAGENS_DATO_DAG DEF DATO_DAGENS POS(5) PIC '99';                00005580
                                                                        00005590
    DCL DATO_ÅR_MND    PIC '9999';                                      00005600
    DCL DATO_ÅR DEF DATO_ÅR_MND POS(1) PIC '99';                        00005610
    DCL DATO_MND DEF DATO_ÅR_MND POS(3) PIC '99';                       00005620
                                                                        00005630
    DCL 1 WORK_TILKN_FNR(13),                                           00005640
         2 WORK_FNR_TILKN DEC FIXED(11);                                00005650
                                                                        00005660
    DCL WORK_BLANKETTYPE  CHAR(2);                                      00005670
                                                                        00005680
    DCL WORK_DØDSDATO  PIC '(6)9';                                      00005690
                                                                        00005700
    DCL DØD_DATO_ÅR  DEF WORK_DØDSDATO POS(1) PIC '99',                 00005710
        DØD_DATO_MND DEF WORK_DØDSDATO POS(3) PIC '99',                 00005720
        DØD_DATO_DAG DEF WORK_DØDSDATO POS(5) PIC '99';                 00005730
                                                                        00005740
    DCL WORK_VIRKDATO  PIC '9999';                                      00005750
                                                                        00005760
    DCL WORK_DATO      PIC '9999';                                      00005770
                                                                        00005780
    DCL WORK_FNR_ÅM_P  PIC '9999';                                      00005790
                                                                        00005800
    DCL 1 WORK_FNR_ÅM DEF WORK_FNR_ÅM_P,                                00005810
        2 WORK_FNR_Å   PIC '99',                                        00005820
        2 WORK_FNR_M   PIC '99';                                        00005830
                                                                        00005840
    DCL FØDSELSNR        PIC '(11)9';                                   00005850
    DCL FØD_DAG     DEF FØDSELSNR POS(1) PIC '99',                      00005860
        FØD_MND     DEF FØDSELSNR POS(3) PIC '99',                      00005870
        FØD_ÅR      DEF FØDSELSNR POS(5) PIC '99',                      00005880
        FØD_INDSIFF DEF FØDSELSNR POS(7) PIC '999',                     00005890
        FØD_KJØNN   DEF FØDSELSNR POS(9) PIC '9';                       00005900
                                                                        00005910
    DCL FNR_PIC                PIC '(11)9';                             00005920
    DCL FNR_CHAR DEF FNR_PIC   CHAR (11)  ;                             00005930
                                                                        00005940
    DCL FNR_PIC2               PIC '(11)9';                             00005950
    DCL FNR_CHAR2 DEF FNR_PIC2 CHAR (11)  ;                             00005960
                                                                        00005970
    DCL WORK_FRAALDER    PIC '99999';                                   00005980
    DCL FRAALDER DEF WORK_FRAALDER POS(1) PIC '999';                    00005990
                                                                        00006000
    DCL WORK_TILALDER    PIC '99999';                                   00006010
    DCL TILALDER DEF WORK_TILALDER POS(1) PIC '999';                    00006020
                                                                        00006030
    DCL W01_SUM_YTELSE       DEC FIXED (5) INIT ('0');                  00006040
    DCL W01_PENSJONSTYPE1                     CHAR(1);                  00006050
    DCL W01_STATUS_KODE_HIST                  CHAR(1);                  00006060
    DCL GRUNN_OMR1                            CHAR(1202);               00006070
    DCL GRUNN_OMR2                            CHAR(1202);               00006080
    DCL GRUNN_IDENT                           CHAR( 8);                 00006090
                                                                        00006100
    DCL STATUS_PT1       CHAR (1);                                      00006110
                                                                        00006120
    DCL EOF_FNRTILG      BIT (1) INIT('0'B),                            00006130
        TRANHIST_ENDRET  BIT (1) INIT('0'B),                            00006140
        FUNNET           BIT (1) INIT('0'B),                            00006150
        FUNNET_TNR       BIT (1) INIT('0'B),                            00006160
        PLI_ABEND        BIT (1) INIT('0'B),                            00006170
        TRUE             BIT (1) INIT('1'B),                            00006180
        FALSE            BIT (1) INIT('0'B),                            00006190
        FEIL_INPUT       BIT (1) INIT('0'B);                            00006200
                                                                        00006210
    DCL I                BIN FIXED (15),                                00006220
        RBAFELT          BIN FIXED (31) INIT ('0'),                     00006230
        J                BIN FIXED (15),                                00006240
        X                BIN FIXED (15);                                00006250
                                                                        00006260
    DCL TNAVN            CHAR (30),                                     00006270
        TTKNR            PIC '9999';                                    00006280
                                                                        00006290
    DCL OPPH_ÅM                         PIC '(4)9';                     00006300
    DCL OPPH_ÅR DEF OPPH_ÅM POS(1)      PIC '(2)9';                     00006310
    DCL OPPH_MN DEF OPPH_ÅM POS(3)      PIC '(2)9';                     00006320
                                                                        00006330
    /* ************************************************************** */00006340
    /*                                                                */00006350
    /*   SLUTT PÅ DEKLARASJONENE .   EKSEKVERINGEN STARTER            */00006360
    /*                                                                */00006370
    /* ************************************************************** */00006380
                                                                        00006390
    ON ERROR SNAP                                                       00006400
       BEGIN;                                                           00006410
          PLI_ABEND    = TRUE;                                          00006420
       END;                                                             00006430
                                                                        00006440
    ALLOCATE  KOM_OMR;                                                  00006450
    ALLOCATE  B00;                                                      00006460
    ALLOCATE  B01;                                                      00006470
    ALLOCATE  B02;                                                      00006480
    ALLOCATE  FNRTAB;                                                   00006490
    ALLOCATE  POTALL_OPPL;                                              00006500
    ALLOCATE  WORK_TRANS_LISTE;                                         00006510
    ALLOCATE  GV_TAB_RE;                                                00006520
    ALLOCATE  G_TAB_RE;                                                 00006530
                                                                        00006540
    ALLOCATE  PCB_UIB_PEKER_OMR;                                        00006550
                                                                        00006560
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER =                                00006570
                                 ADDR(KOM_OMR.STYRINGS_OMR);            00006580
                                                                        00006590
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =                              00006600
                                 ADDR(KOM_OMR.TRANS_OPPL_OMR);          00006610
                                                                        00006620
    KOM_OMR.PEKER_LISTE.TRANS_PEKER =                                   00006630
                                 ADDR(KOM_OMR.TRANS_OMR);               00006640
                                                                        00006650
    KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER =                               00006660
                                 ADDR(KOM_OMR.DIV_PARAM_OMR);           00006670
                                                                        00006680
    KOM_OMR.PEKER_LISTE.TRANS_LISTE_PEKER =                             00006690
                                 ADDR(KOM_OMR.TRANS_LISTE_OMR);         00006700
    KOM_OMR.GV_PEKER           = ADDR (GRUNN_OMR1             ) ;       00006710
    KOM_OMR.G_PEKER            = ADDR (GRUNN_OMR2             ) ;       00006720
                                                                        00006730
    STYRINGS_OMR = '';                                                  00006740
    TRANS_OPPL_OMR = '';                                                00006750
    TRANS_OMR = '';                                                     00006760
    DIV_PARAM_OMR = '';                                                 00006770
    FNRTAB = '';                                                        00006780
    POTALL_OPPL = '';                                                   00006790
    B00 = '';                                                           00006800
    B01 = '';                                                           00006810
    B02 = '';                                                           00006820
    GV_TAB_RE                       =  ''  ;                            00006830
    G_TAB_RE                        =  ''  ;                            00006840
                                                                        00006850
    TEST_OMR = '';                                                      00006860
    MELD_IO = '';                                                       00006870
    ENDR_DSR = '';                                                      00006880
    FØDSELSNR = '';                                                     00006890
    WORK_FRAALDER = '';                                                 00006900
    WORK_TILALDER = '';                                                 00006910
    WORK_VIRKDATO = '';                                                 00006920
    PROGRAM_ID = 'R0019E04';                                            00006930
                                                                        00006940
    EXEC CICS HANDLE CONDITION ENDFILE(ENDINP) ERROR(ERRBEH);           00006950
                                                                        00006960
                                                                        00006970
                                                                        00006980
                                                                        00006990
    GRUNN_IDENT                     = 'P0019924';                       00007000
                                                                        00007010
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                      00007020
    EXEC CICS ENTER TRACEID(01) FROM(FEIL_MELD_NR);                     00007030
                                                                        00007040
    IF FEIL_MELD_NR > 0 THEN                                            00007050
       DO;                                                              00007060
        /* ********************************* */                         00007070
        /*  FEIL I  R0019956.                */                         00007080
        /* ********************************* */                         00007090
  L100:                                                                 00007100
          FEIL_VED_LABEL                      = '100';                  00007110
          GO TO L999;                                                   00007120
       END;                                                             00007130
                                                                        00007140
    GRUNN_IDENT                     = 'P0019925';                       00007150
                                                                        00007160
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                      00007170
                                                                        00007180
                                                                        00007190
    IF FEIL_MELD_NR > 0 THEN                                            00007200
       DO;                                                              00007210
         /* ********************************* */                        00007220
         /*  FEIL I  R0019956.                */                        00007230
         /* ********************************* */                        00007240
  L105:                                                                 00007250
          FEIL_VED_LABEL                      = '105';                  00007260
          GO TO L999;                                                   00007270
       END;                                                             00007280
                                                                        00007290
                                                                        00007300
                                                                        00007310
    /*----------------------------------------------------*/            00007320
    /*  INITIERING DATABASEN                              */            00007330
    /*  HENTER DAGENS DATO                                */            00007340
    /*  HENTER STYRINGSRECORD FRA OPERATØR                */            00007350
    /*----------------------------------------------------*/            00007360
                                                                        00007370
    CALL                    INIT_PCB;                                   00007380
    DATO_DAGENS         =   DATE;                                       00007390
    DATO_ÅR_MND = DAGENS_DATO_ÅR_MND;                                   00007400
    IF DATO_MND = 12     THEN                                           00007410
       DO;                                                              00007420
          DATO_MND = 02;                                                00007430
          DATO_ÅR = DATO_ÅR + 1;                                        00007440
       END;                                                             00007450
    ELSE                                                                00007460
    IF DATO_MND = 11     THEN                                           00007470
       DO;                                                              00007480
          DATO_MND = 01;                                                00007490
          DATO_ÅR = DATO_ÅR + 1;                                        00007500
       END;                                                             00007510
    ELSE                                                                00007520
       DATO_MND = DATO_MND + 2;                                         00007530
    EXEC CICS IGNORE CONDITION LENGERR;                                 00007540
    EXEC CICS RECEIVE INTO (TEST_OMR) LENGTH(TEST_IN_LENGDE);           00007550
                                                                        00007560
                                                                        00007570
    IF VERIFY(TEST_OMR.FRANR,'0123456789') > 0 THEN                     00007580
      DO;                                                               00007590
         FEIL_INPUT     = TRUE;                                         00007600
      END;                                                              00007610
                                                                        00007620
    IF VERIFY(TEST_OMR.ANTALL,'0123456789') > 0 THEN                    00007630
      DO;                                                               00007640
         FEIL_INPUT     = TRUE;                                         00007650
      END;                                                              00007660
                                                                        00007670
    IF FEIL_INPUT THEN                                                  00007680
      DO;                                                               00007690
        EOF_FNRTILG = TRUE;                                             00007700
        W01_UTLINJE ='FEIL INPUT. FNR=' !! TEST_OMR.FRANR !!            00007710
                            '  ANTALL=' !! TEST_OMR.ANTALL;             00007720
                                                                        00007730
        EXEC CICS SEND TEXT FROM ( W01_UTLINJE ) ACCUM PAGING ERASE     00007740
                       JUSTIFY ( 12        )  ;                         00007750
                                                                        00007760
        EXEC CICS SEND PAGE RELEASE;                                    00007770
                                                                        00007780
        /*--------------------------------------------------------*/    00007790
        /* TERMINERINGSKALLET FOR PCB'ENE                         */    00007800
        /*--------------------------------------------------------*/    00007810
        CALL PLITDLI                       (W01_TERM_FUNCTION);         00007820
  L106:                                                                 00007830
        FEIL_VED_LABEL                        = '106';                  00007840
        GO TO L999;                                                     00007850
      END;                                                              00007860
                                                                        00007870
    ELSE DO;                                                            00007880
         IF TEST_OMR.FRANR > 0 THEN                                     00007890
            DO;                                                         00007900
               FNRREC.TILNR = TEST_OMR.FRANR;                           00007910
               KEY_PACK = FNRREC.TILNR;                                 00007920
               KEY_TILNR_PEKER = ADDR(KEY_PACK);                        00007930
            END;                                                        00007940
         ELSE DO;                                                       00007950
            KEY_CHAR  = LOW(6);                                         00007960
            KEY_TILNR_PEKER = ADDR(KEY_CHAR);                           00007970
            END;                                                        00007980
      END;                                                              00007990
                                                                        00008000
    FNRREC.FRANR = 0;                                                   00008010
                                                                        00008020
    /* ************************************************************** */00008030
    /*                                                                */00008040
    /*   TAR STARTBROWSE MED LOW(6) ELLER OPPGITT FNR                 */00008050
    /*                                                                */00008060
    /*   1) HVIS FRANR = 0 , HELE INPUTFILE LESES , FNR = LOW(6)      */00008070
    /*   2) HVIS FRANR > 0 , LESER F.O.M. DETTE FNR OG                */00008080
    /*      RESTEN AV FILEN HVIS ANTALL = 0                           */00008090
    /*   3) HVIS FRANR > 0 , LESER BARE DETTE FNR NÅR                 */00008100
    /*      ANTALL = 1                                                */00008110
    /*   4) HVIS FRANR > 0 OG ANTALL > 1 , LESER F.O.M. NESTE         */00008120
    /*      FNR OG RESTEN AV FILEN                                    */00008130
    /*                                                                */00008140
    /* ************************************************************** */00008150
                                                                        00008160
    EXEC CICS HANDLE CONDITION         NOTFND (L015NOTF);               00008170
    EXEC CICS STARTBR DATASET('FNRTILG') RIDFLD(KEY_TILNR);             00008180
                                                                        00008190
    /*----------------------------------------------------------------*/00008200
    /*     LESER 1. RECORD                                            */00008210
    /*----------------------------------------------------------------*/00008220
                                                                        00008230
    EXEC CICS READNEXT DATASET('FNRTILG') INTO(FNRREC)                  00008240
              RIDFLD(KEY_TILNR);                                        00008250
                                                                        00008260
    FNR_PIC2         =  FNRREC.FRANR;                                   00008270
                                                                        00008280
    OMR_FEIL.TEKST1 = 'R0019E04 START : ' !! DATO_DAGENS !! '  FNR=';   00008290
    OMR_FEIL.FNR    =  FNR_PIC2 ;                                       00008300
                                                                        00008310
    EXEC CICS WRITE DATASET('OMRFEIL') FROM(OMR_FEIL)                   00008320
                         RIDFLD(OMR_FEIL_PEKER) RBA;                    00008330
                                                                        00008340
    /*----------------------------------------------------------------*/00008350
    /*     LESER NESTE RECORD HVIS ANTALL > 1                         */00008360
    /*----------------------------------------------------------------*/00008370
                                                                        00008380
    IF TEST_OMR.ANTALL > 1 THEN                                         00008390
      DO;                                                               00008400
         EXEC CICS READNEXT DATASET('FNRTILG') INTO(FNRREC)             00008410
                   RIDFLD(KEY_TILNR);                                   00008420
                                                                        00008430
         FNR_PIC2         =  FNRREC.FRANR;                              00008440
      END;                                                              00008450
                                                                        00008460
    /*----------------------------------------------------------------*/00008470
    /*  INITSIERER TELLERE                                            */00008480
    /*----------------------------------------------------------------*/00008490
                                                                        00008500
    ANT_LEST     = 1;                                                   00008510
    ANT_ENDR     = 0;                                                   00008520
    ANT_UFØRH    = 0;                                                   00008530
    ANT_OMR_4001 = 0;                                                   00008540
    ANT_OMR_4901 = 0;                                                   00008550
    ANT_STAT     = 0;                                                   00008560
    ANT_CALL_OMR = 0;                                                   00008570
    ANT_CALL_MAN = 0;                                                   00008580
    ANT_CALL_DØD = 0;                                                   00008590
                                                                        00008600
    DO WHILE(^ EOF_FNRTILG);                                            00008610
        IF FNRREC.FRANR > 00000000000 THEN                              00008620
           DO;                                                          00008630
             FNRTAB = '';                                               00008640
             IF FNRREC.KODE = 'A' !                                     00008650
                FNRREC.KODE = 'B' !                                     00008660
                FNRREC.KODE = 'F' THEN                                  00008670
                DO;                                                     00008680
                   CALL TEST_MOT_BASEN;                                 00008690
                                                                        00008700
                   /*--------------------------------------------*/     00008710
                   /* TAR ENDBROWSE FØR SYNCPOINT                */     00008720
                   /* INITIERING SYNCPOINT                       */     00008730
                   /* INITIERING DATABASEN                       */     00008740
                   /* TAR STARTBROSE MED SIST LESTE NØKKEL       */     00008750
                   /*--------------------------------------------*/     00008760
                                                                        00008770
                   EXEC CICS ENDBR DATASET('FNRTILG');                  00008780
                   EXEC CICS SYNCPOINT;                                 00008790
                   CALL INIT_PCB;                                       00008800
                                                                        00008810
                   KEY_PACK = FNRREC.TILNR;                             00008820
                   KEY_TILNR_PEKER = ADDR(KEY_PACK);                    00008830
                                                                        00008840
                   EXEC CICS STARTBR DATASET('FNRTILG')                 00008850
                        RIDFLD(KEY_TILNR);                              00008860
                                                                        00008870
                   EXEC CICS READNEXT DATASET('FNRTILG') INTO(FNRREC)   00008880
                             RIDFLD(KEY_TILNR);                         00008890
                                                                        00008900
                   FNR_PIC2           =  FNRREC.FRANR;                  00008910
                                                                        00008920
                   IF TEST_OMR.ANTALL = '1' THEN                        00008930
                      EOF_FNRTILG = TRUE;                               00008940
                                                                        00008950
                END;                                                    00008960
                                                                        00008970
          END;                                                          00008980
                                                                        00008990
        IF TEST_OMR.ANTALL = '1' THEN                                   00009000
           EOF_FNRTILG     =  TRUE;                                     00009010
        ELSE                                                            00009020
           ANT_LEST        =  ANT_LEST + 1;                             00009030
                                                                        00009040
        EXEC CICS READNEXT DATASET('FNRTILG') INTO(FNRREC)              00009050
                  RIDFLD(KEY_TILNR);                                    00009060
                                                                        00009070
        FNR_PIC2           =  FNRREC.FRANR;                             00009080
                                                                        00009090
        GOTO READ_OK;                                                   00009100
                                                                        00009110
 ENDINP:                                                                00009120
        EOF_FNRTILG = TRUE;                                             00009130
                                                                        00009140
        IF ANT_LEST = 0 THEN                                            00009150
           DO;                                                          00009160
              W01_UTLINJE =   'INPUTFNREND-TILGANGSFILE ER TOM';        00009170
                                                                        00009180
              EXEC CICS SEND TEXT FROM (W01_UTLINJE) ACCUM PAGING ERASE 00009190
                       JUSTIFY ( 12        )  ;                         00009200
           END;                                                         00009210
                                                                        00009220
 READ_OK:                                                               00009230
                                                                        00009240
    END;                                                                00009250
                                                                        00009260
    /* ************************** */                                    00009270
    /*  SKRIVER UT TELLERE        */                                    00009280
    /* ************************** */                                    00009290
                                                                        00009300
    EXEC CICS ENTER TRACEID(02) FROM(FEIL_MELD_NR);                     00009310
    EXEC CICS  PURGE MESSAGE       ;                                    00009320
    CALL SKRIV_UT_TELLERE          ;                                    00009330
                                                                        00009340
                                                                        00009350
    /* ************************************************************** */00009360
    /*                                                                */00009370
    /*   TERMINERINGSKALLET FOR PCB'ENE                               */00009380
    /*                                                                */00009390
    /* ************************************************************** */00009400
                                                                        00009410
    CALL   PLITDLI                              (W01_TERM_FUNCTION);    00009420
                                                                        00009430
                                                                        00009440
    GO TO L999;                                                         00009450
                                                                        00009460
    /*  END STYREMODUL  */                                              00009470
                                                                        00009480
 TEST_MOT_BASEN: PROC;                                                  00009490
                                                                        00009500
    IF FNRREC.KODE = 'A' !                                              00009510
       FNRREC.KODE = 'B'  THEN                                          00009520
       DO;                                                              00009530
         /*  LESER ROT FRANR  */                                        00009540
                                                                        00009550
         SSA1_RF0PERSN.PKEY = FNRREC.FRANR;                             00009560
         CALL LESER_ROT_SEGM_GU;                                        00009570
                                                                        00009580
         IF FEIL_MELD_NR      >  0            THEN                      00009590
            DO;                                                         00009600
               /* **************************************** */           00009610
               /*  DATABASEFEIL                            */           00009620
               /* **************************************** */           00009630
                                                                        00009640
               GO TO L999;                                              00009650
            END;                                                        00009660
                                                                        00009670
         IF W02_MER_DATA THEN                                           00009680
            DO;                                                         00009690
                                                                        00009700
              SUBSTR(ADDR(B01.PERSON(1).RF0PERSN) -> W01_HJELPE_IO,1,   00009710
                     STORAGE(B01.PERSON(1).RF0PERSN)) = W01_IO;         00009720
                                                                        00009730
              MELD_IO.ADRESSAT = 'S'; /* MELDING TIL SSB */             00009740
              CALL MELDINGSREC;                                         00009750
                                                                        00009760
            END;                                                        00009770
                                                                        00009780
       END;                                                             00009790
                                                                        00009800
    ELSE                             /* FNRREC.KODE = 'F' */            00009810
                                                                        00009820
       DO;                                                              00009830
         /*  LESER ROT TILNR  */                                        00009840
                                                                        00009850
         SSA1_RF0PERSN.PKEY = FNRREC.SISTENR;                           00009860
                                                                        00009870
         CALL LESER_ROT_SEGM_GU;                                        00009880
                                                                        00009890
         IF FEIL_MELD_NR      >  0            THEN                      00009900
            DO;                                                         00009910
               /* **************************************** */           00009920
               /*  DATABASEFEIL                            */           00009930
               /* **************************************** */           00009940
                                                                        00009950
               GO TO L999;                                              00009960
            END;                                                        00009970
                                                                        00009980
         IF W02_MER_DATA THEN                                           00009990
            DO;                                                         00010000
                                                                        00010010
                                                                        00010020
                                                                        00010030
              SUBSTR(ADDR(B01.PERSON(1).RF0PERSN) -> W01_HJELPE_IO,1,   00010040
                     STORAGE(B01.PERSON(1).RF0PERSN)) = W01_IO;         00010050
                                                                        00010060
              FUNNET_TNR    = TRUE;                                     00010070
              TNAVN         = B01.PERSON(1).RF0PERSN.NAVN;              00010080
              TTKNR         = B01.PERSON(1).RF0PERSN.TKNR;              00010090
              ENDR_DSR.KODE = ' ';                                      00010100
            END;                                                        00010110
                                                                        00010120
         ELSE                                                           00010130
                                                                        00010140
            DO;                                                         00010150
              FUNNET_TNR = FALSE;                                       00010160
              /* ENDRE FNR I DSR OG TRANS-DSR */                        00010170
                                                                        00010180
              ANT_STAT = ANT_STAT + 1;                                  00010190
              ENDR_DSR.KODE = '0';                                      00010200
            END;                                                        00010210
                                                                        00010220
         /* LESER SISTE STATUS FOR Å TESTE PÅ VIRKNINGSDATO */          00010230
                                                                        00010240
         SSA3_RF0PERSN.PKEY = FNRREC.FRANR;                             00010250
                                                                        00010260
         CALL LESER_STATUS_GU;                                          00010270
                                                                        00010280
         IF FEIL_MELD_NR >  0            THEN                           00010290
            DO;                                                         00010300
               /* ************** */                                     00010310
               /*  DATABASEFEIL  */                                     00010320
               /* ************** */                                     00010330
                                                                        00010340
               GO TO L999;                                              00010350
            END;                                                        00010360
                                                                        00010370
         IF W02_MER_DATA THEN                                           00010380
            DO;                                                         00010390
                                                                        00010400
              SUBSTR(ADDR(B01.PERSON(1).STATUS) -> W01_HJELPE_IO,1,     00010410
                     STORAGE(B01.PERSON(1).STATUS)) = W01_IO;           00010420
              WORK_VIRKDATO = B01.PERSON(1).STATUS.VIRK_DATO_ÅM;        00010430
                                                                        00010440
            END;                                                        00010450
                                                                        00010460
         ELSE                                                           00010470
                                                                        00010480
            WORK_VIRKDATO = 0;                                          00010490
                                                                        00010500
                                                                        00010510
         /*  LESER ROT FRANR  */                                        00010520
                                                                        00010530
         SSA1_RF0PERSN.PKEY = FNRREC.FRANR;                             00010540
         CALL LESER_ROT_SEGM_GU;                                        00010550
                                                                        00010560
         IF FEIL_MELD_NR      >  0            THEN                      00010570
            DO;                                                         00010580
               /* **************************************** */           00010590
               /*  DATABASEFEIL                            */           00010600
               /* **************************************** */           00010610
                                                                        00010620
               GO TO L999;                                              00010630
            END;                                                        00010640
                                                                        00010650
         IF W02_MER_DATA THEN                                           00010660
            DO;                                                         00010670
                                                                        00010680
              SUBSTR(ADDR(B01.PERSON(1).RF0PERSN) -> W01_HJELPE_IO,1,   00010690
                     STORAGE(B01.PERSON(1).RF0PERSN)) = W01_IO;         00010700
                                                                        00010710
              IF B01.PERSON(1).RF0PERSN.SPERRE = ' ' THEN               00010720
                 DO;                                                    00010730
                                                                        00010740
                   FØDSELSNR = FNRREC.SISTENR;                          00010750
                   WORK_FNR_Å = FØD_ÅR;                                 00010760
                   WORK_FNR_M = FØD_MND;                                00010770
                                                                        00010780
                   IF FUNNET_TNR THEN                                   00010790
                      DO;                                               00010800
                         /* MELDING TIL RTV */                          00010810
                         MELD_IO.ADRESSAT = 'R';                        00010820
                         CALL MELDINGSREC;                              00010830
                      END;                                              00010840
                   ELSE                                                 00010850
                      IF ((FØD_INDSIFF < 500 !                          00010860
                         FØD_INDSIFF > 749 ) &                          00010870
                         WORK_VIRKDATO > 0 &                            00010880
                         WORK_VIRKDATO < WORK_FNR_ÅM_P) THEN            00010890
                         DO;                                            00010900
                            /* MELDING TIL RTV */                       00010910
                            MELD_IO.ADRESSAT = 'V';                     00010920
                            CALL MELDINGSREC;                           00010930
                         END;                                           00010940
                      ELSE                                              00010950
                         DO;                                            00010960
                            ENDR_DSR.KODE = '1';                        00010970
                            CALL FNR_SKAL_ENDRES;                       00010980
                         END;                                           00010990
                                                                        00011000
                 END;                                                   00011010
                                                                        00011020
              ELSE                                                      00011030
                                                                        00011040
                 /* DENNE PERSON ER SPERRET OG MÅ BEHANDLES SENERE */   00011050
                 /* MELDING PÅ OMRFEIL                           */     00011060
                                                                        00011070
                 DO;                                                    00011080
                                                                        00011090
                    /* OMR_FEIL.FNR = B01.PERSON(1).REF0PERSN.FNR; */   00011100
                    OMR_FEIL.FNR = FNRREC.FRANR;                        00011110
                    OMR_FEIL.TEKST1 =                                   00011120
                    '499 FRA FNR ENDRING. DETTE FNR ER SPERRET : ';     00011130
                                                                        00011140
                    /* RECORD FOR ENDRING AV FNR. I DSR / T-DSR: */     00011150
                                                                        00011160
                    EXEC CICS WRITE DATASET('OMRFEIL') FROM(OMR_FEIL)   00011170
                         RIDFLD(OMR_FEIL_PEKER) RBA;                    00011180
                                                                        00011190
                    ENDR_DSR.KODE = ' ';                                00011200
                                                                        00011210
                 END;                                                   00011220
                                                                        00011230
            END;                                                        00011240
                                                                        00011250
         IF ENDR_DSR.KODE ^= ' ' THEN                                   00011260
            DO;                                                         00011270
              ENDR_DSR.FRANR = FNRREC.FRANR;                            00011280
              ENDR_DSR.TILNR = FNRREC.SISTENR;                          00011290
                                                                        00011300
              /* RECORD FOR ENDRING AV FNR. I DSR / T-DSR: */           00011310
                                                                        00011320
              EXEC CICS WRITE DATASET('ENDRDSR') FROM(ENDR_DSR)         00011330
                   RIDFLD(ENDR_PEKER) RBA;                              00011340
            END;                                                        00011350
    END;                                                                00011360
                                                                        00011370
 END TEST_MOT_BASEN;                                                    00011380
                                                                        00011390
 FNR_SKAL_ENDRES: PROC;                                                 00011400
                                                                        00011410
 DCL FEIL   BIT (1) INIT('0'B);                                         00011420
                                                                        00011430
    /* ROTSEGMENT ER ALLEREDE LEST */                                   00011440
                                                                        00011450
    /* ENDRE FNR I BASEN */                                             00011460
                                                                        00011470
    STATUS_PT1 = ' ';                                                   00011480
    SSA2_RF0PERSN.PKEY = FNRREC.SISTENR;                                00011490
    SSA_UQUAL = PCB1.SEGM_NAVN;                                         00011500
                                                                        00011510
    B01.PERSON(1).RF0PERSN.FNR = FNRREC.SISTENR;                        00011520
                                                                        00011530
    W01_HJELPE_PTR = ADDR(B01.PERSON(1).RF0PERSN);                      00011540
    W01_IO = W01_HJELPE_IO;                                             00011550
                                                                        00011560
    CALL DANNE_ROT_SEGM_ISRT;                                           00011570
    IF FEIL_MELD_NR      >  0            THEN                           00011580
       DO;                                                              00011590
          /* **************************************** */                00011600
          /*  DATABASEFEIL                            */                00011610
          /* **************************************** */                00011620
                                                                        00011630
          GO TO L999;                                                   00011640
       END;                                                             00011650
                                                                        00011660
    /* LESER ALLE UNDERSEGMENT */                                       00011670
                                                                        00011680
    CALL LESER_RESTEN_GNP;                                              00011690
                                                                        00011700
    IF FEIL_MELD_NR        >  0            THEN                         00011710
       DO;                                                              00011720
          /* **************************************** */                00011730
          /*    DATABASEFEIL                          */                00011740
          /* **************************************** */                00011750
                                                                        00011760
          GO TO L999;                                                   00011770
       END;                                                             00011780
                                                                        00011790
    SSA_UQUAL = PCB1.SEGM_NAVN;                                         00011800
                                                                        00011810
    /* Så LENGE DET FINNES SEGMENTER UNDER DENNE ROT, ISRT */           00011820
                                                                        00011830
    DO WHILE( W02_MER_DATA  &  W02_ISRT_OK );                           00011840
                                                                        00011850
                                                                        00011860
         SELECT ( PCB1.SEGM_NAVN );                                     00011870
                                                                        00011880
           WHEN ('STATUS  ')                                            00011890
             DO;                                                        00011900
                                                                        00011910
                                                                        00011920
               /* SKAL FØRST LEGGE INN NEST_SISTE_STATUS */             00011930
                                                                        00011940
               SSA4_STATUS.KODE = 'N';                                  00011950
                                                                        00011960
               CALL LESER_NEST_SISTE_STATUS_GNP;                        00011970
                                                                        00011980
               IF FEIL_MELD_NR > 0         THEN                         00011990
                  DO;                                                   00012000
                     /* **************************************** */     00012010
                     /* DATABASEFEIL                             */     00012020
                     /* **************************************** */     00012030
                                                                        00012040
                     GO TO L999;                                        00012050
                  END;                                                  00012060
                                                                        00012070
               IF W02_MER_DATA THEN                                     00012080
                  CALL STATUS;                                          00012090
                                                                        00012100
               /* SKAL DERETETTER LEGGE INN SISTE_STATUS */             00012110
                                                                        00012120
               CALL LESER_SISTE_STATUS_GNP;                             00012130
                                                                        00012140
               IF FEIL_MELD_NR > 0         THEN                         00012150
                  DO;                                                   00012160
                     /* **************************************** */     00012170
                     /* DATABASEFEIL                             */     00012180
                     /* **************************************** */     00012190
                                                                        00012200
                     GO TO L999;                                        00012210
                  END;                                                  00012220
                                                                        00012230
               IF W02_MER_DATA THEN                                     00012240
                  DO;                                                   00012250
                                                                        00012260
              SUBSTR(ADDR(B01.PERSON(1).STATUS) -> W01_HJELPE_IO,1,     00012270
                     STORAGE(B01.PERSON(1).STATUS)) = W01_IO;           00012280
                                                                        00012290
                    STATUS_PT1 = B01.PERSON(1).STATUS.PENSJONSTYPE1;    00012300
                    WORK_DØDSDATO = B01.PERSON(1).STATUS.DØDSDATO_ÅMD;  00012310
                    SSA4_STATUS.KODE = 'S';                             00012320
                    CALL STATUS;                                        00012330
                  END;                                                  00012340
                                                                        00012350
               /* HVIS PROGRAMMET HAR TRANHIST I IO_OMR */              00012360
                                                                        00012370
               IF PCB1.SEGM_NAVN = 'TRANHIST' THEN                      00012380
                  CALL TRANHIST;                                        00012390
               ELSE                                                     00012400
                  IF PCB1.SEGM_NAVN = 'STATUS  ' THEN                   00012410
                     DO;                                                00012420
                       CALL LESER_TRANHIST_GNP;                         00012430
                                                                        00012440
                       IF FEIL_MELD_NR > 0 THEN                         00012450
                          DO;                                           00012460
                             /* *************** */                      00012470
                             /* DATABASEFEIL    */                      00012480
                             /* *************** */                      00012490
                             GO TO L999;                                00012500
                          END;                                          00012510
                                                                        00012520
                       IF W02_MER_DATA THEN                             00012530
                          CALL TRANHIST;                                00012540
                                                                        00012550
                     END;                                               00012560
             END;                                                       00012570
                                                                        00012580
           WHEN ('TRANHIST')                                            00012590
                                                                        00012600
             CALL TRANHIST;                                             00012610
                                                                        00012620
           OTHERWISE                                                    00012630
             DO;                                                        00012640
               /* INSERTER RESTEN AV SEGMENTENE */                      00012650
                                                                        00012660
               IF SSA_UQUAL ^= PCB1.SEGM_NAVN    THEN                   00012670
                  SSA_UQUAL = PCB1.SEGM_NAVN;                           00012680
                                                                        00012690
               CALL DANNE_SEGM_ISRT;                                    00012700
                                                                        00012710
               IF FEIL_MELD_NR  >  0            THEN                    00012720
                  DO;                                                   00012730
                     /* **************************************** */     00012740
                     /* DATABASEFEIL                             */     00012750
                     /* **************************************** */     00012760
                                                                        00012770
                     GO TO L999;                                        00012780
                  END;                                                  00012790
                                                                        00012800
               /* LESER ALLE UNDERSEGMENT */                            00012810
                                                                        00012820
               CALL LESER_RESTEN_GNP;                                   00012830
                                                                        00012840
               IF FEIL_MELD_NR > 0         THEN                         00012850
                  DO;                                                   00012860
                     /* ************ */                                 00012870
                     /* DATABASEFEIL */                                 00012880
                     /* ************ */                                 00012890
                                                                        00012900
                     GO TO L999;                                        00012910
                  END;                                                  00012920
                                                                        00012930
                                                                        00012940
             END;                                                       00012950
                                                                        00012960
         END;                                                           00012970
                                                                        00012980
    END;                                                                00012990
                                                                        00013000
                                                                        00013010
    IF W02_ISRT_OK THEN                                                 00013020
                                                                        00013030
       DO;                                                              00013040
                                                                        00013050
         CALL LESER_ROT_SEGM_GHU;                                       00013060
                                                                        00013070
         IF FEIL_MELD_NR >  0            THEN                           00013080
            DO;                                                         00013090
               /* ************ */                                       00013100
               /* DATABASEFEIL */                                       00013110
               /* ************ */                                       00013120
                                                                        00013130
               GO TO L999;                                              00013140
            END;                                                        00013150
                                                                        00013160
                                                                        00013170
         IF W02_MER_DATA THEN                                           00013180
           DO;                                                          00013190
                                                                        00013200
          /* FJERNER FRA-NUMMER */                                      00013210
                                                                        00013220
             CALL FJERNER_ALLE_SEGM_DLET;                               00013230
                                                                        00013240
                                                                        00013250
             IF FEIL_MELD_NR > 0           THEN                         00013260
                DO;                                                     00013270
                     /* ************ */                                 00013280
                     /* DATABASEFEIL */                                 00013290
                     /* ************ */                                 00013300
                                                                        00013310
                 GO TO L999;                                            00013320
                END;                                                    00013330
           END;                                                         00013340
                                                                        00013350
                                                                        00013360
                                                                        00013370
         B01 = '';                                                      00013380
         DIV_PARAM_OMR.SEARCH_FNR = FNRREC.SISTENR;                     00013390
                                                                        00013400
                                                                        00013410
         ANT_ENDR = ANT_ENDR + 1;                                       00013420
         IF STATUS_PT1 = 'D' THEN                                       00013430
            DO;                                                         00013440
                                                                        00013450
                  CALL DØD;                                             00013460
               ANT_CALL_DØD = ANT_CALL_DØD + 1;                         00013470
                                                                        00013480
            END;                                                        00013490
                                                                        00013500
         ELSE                                                           00013510
                                                                        00013520
            DO;                                                         00013530
               TRANS_OPPL_OMR.VIRKNINGSDATO = 9999;                     00013540
               TRANS_OPPL_OMR.FØDSNUMMER = FNRREC.SISTENR;              00013550
                                                                        00013560
               EXEC CICS LINK PROGRAM ('R0013101')                      00013570
                              COMMAREA (KOM_OMR);                       00013580
                                                                        00013590
                                                                        00013600
               IF FEIL_MELD_NR >  0            THEN                     00013610
                  DO;                                                   00013620
                    /* *************************** */                   00013630
                    /* FEIL VED SPERRE-BEHANDLING  */                   00013640
                    /* *************************** */                   00013650
                                                                        00013660
                    GO TO L999;                                         00013670
                  END;                                                  00013680
               ELSE                                                     00013690
                                                                        00013700
                  PROGRAM_ID = 'R0019E04';                              00013710
                                                                        00013720
               /*--------------------------------------------*/         00013730
               /* SISTE STATUS TIL B01 . FNR ER ENDRET       */         00013740
               /*--------------------------------------------*/         00013750
                                                                        00013760
               B02 = B01;                                               00013770
                                                                        00013780
                                                                        00013790
               DO I = 1 TO 14 WHILE(B02.PERSON(I).RF0PERSN.FNR ^=       00013800
                                    FNRREC.SISTENR);                    00013810
               END;                                                     00013820
                                                                        00013830
                                                                        00013840
               /*--------------------------------------------*/         00013850
               /* I = POS I B01 TIL ENDRET PERSOM            */         00013860
               /*--------------------------------------------*/         00013870
                                                                        00013880
               IF B02.STATUS.PENSJONSTYPE1 (I) ^= ' ' THEN              00013890
                  DO;                                                   00013900
                     MELD_IO.ADRESSAT = 'T';                            00013910
                     /* MELDING TIL TRYGDEKTR. */                       00013920
                     CALL MELDINGSREC;                                  00013930
                  END;                                                  00013940
                                                                        00013950
                                                                        00013960
               /* OMREGNING ELLER IKKE EGEN PERSON BESTEMMES: */        00013970
                                                                        00013980
               FØDSELSNR = FNRREC.FRANR;                                00013990
                                                                        00014000
               WORK_DATO = FØD_ÅR!!FØD_MND;                             00014010
                                                                        00014020
               WORK_FRAALDER = DAGENS_DATO_ÅR_MND -                     00014030
                               WORK_DATO;                               00014040
                                                                        00014050
               IF FØD_INDSIFF >= 500 &                                  00014060
                  FØD_INDSIFF <= 749 THEN                               00014070
                  FRAALDER = FRAALDER + 100;                            00014080
                                                                        00014090
                                                                        00014100
               FØDSELSNR = FNRREC.SISTENR;                              00014110
                                                                        00014120
               WORK_DATO = FØD_ÅR!!FØD_MND;                             00014130
                                                                        00014140
               WORK_TILALDER = DAGENS_DATO_ÅR_MND -                     00014150
                               WORK_DATO;                               00014160
                                                                        00014170
               IF FØD_INDSIFF >= 500 &                                  00014180
                  FØD_INDSIFF <= 749 THEN                               00014190
                  TILALDER = TILALDER + 100;                            00014200
                                                                        00014210
               CALL TESTVTP(FEIL);                                      00014220
                                                                        00014230
                                                                        00014240
               IF FEIL                                THEN              00014250
                  DO;                                                   00014260
                     CALL MANUELL;                                      00014270
                     FEIL          = '0'B;                              00014280
                  END;                                                  00014290
                                                                        00014300
               ELSE IF STATUS_PT1  = ' '              !                 00014310
                       STATUS_PT1  = 'G'                  THEN          00014320
                                                                        00014330
                  DO;                                                   00014340
                     /*---------------------------------------*/        00014350
                     /* IKKE EGNE YTELSER - TABELL 2          */        00014360
                     /*---------------------------------------*/        00014370
                                                                        00014380
                                                                        00014390
                     SELECT;                                            00014400
                                                                        00014410
                       WHEN (FRAALDER < 016)                            00014420
                         DO;                                            00014430
                                                                        00014440
                            SELECT;                                     00014450
                              WHEN (TILALDER >= 067)                    00014460
                                DO;                                     00014470
                                                                        00014480
                                   CALL MANUELL;                        00014490
                                END;                                    00014500
                              OTHERWISE;                                00014510
                            END;                                        00014520
                         END;                                           00014530
                                                                        00014540
                       WHEN (FRAALDER > 067)                            00014550
                         DO;                                            00014560
                                                                        00014570
                            SELECT;                                     00014580
                              WHEN (TILALDER < 016)                     00014590
                                DO;                                     00014600
                                                                        00014610
                                   CALL MANUELL;                        00014620
                                END;                                    00014630
                              OTHERWISE;                                00014640
                            END;                                        00014650
                         END;                                           00014660
                                                                        00014670
                       OTHERWISE;                                       00014680
                                                                        00014690
                     END;                                               00014700
                                                                        00014710
                  END;                                                  00014720
                                                                        00014730
               ELSE                                                     00014740
                                                                        00014750
               IF STATUS_PT1 = 'F' !                                    00014760
                  STATUS_PT1 = 'L' THEN                                 00014770
                  DO;                                                   00014780
                     IF (STATUS_PT1 = 'F' & TILALDER > 067) !           00014790
                        (STATUS_PT1 = 'L' & TILALDER > 018) THEN        00014800
                        DO;                                             00014810
                           CALL MANUELL;                                00014820
                        END;                                            00014830
                  END;                                                  00014840
                                                                        00014850
               ELSE                                                     00014860
                                                                        00014870
                  DO;                                                   00014880
                     /*-----------------------------------------------*/00014890
                     /* STATUS_PT1 ER ^= (' ' ! 'G' ! 'D' ! 'F' ! 'L')*/00014900
                     /* EGNE YTELSER TABELL 1                         */00014910
                     /*                                               */00014920
                     /* TESTEN PÅ 'F' ! 'L' 17 LINJER OPP ER NY       */00014930
                     /* LAGT INN AV O.G. 09.04.87                     */00014940
                     /*-----------------------------------------------*/00014950
                                                                        00014960
                                                                        00014970
                     SELECT;                                            00014980
                                                                        00014990
                       WHEN (FRAALDER < 016)                            00015000
                         DO;                                            00015010
                            SELECT;                                     00015020
                              WHEN (TILALDER < 016);                    00015030
                                                                        00015040
                              WHEN (TILALDER < 067)                     00015050
                                DO;                                     00015060
                                   CALL OMREGN;                         00015070
                                END;                                    00015080
                              OTHERWISE                                 00015090
                                DO;                                     00015100
                                   CALL MANUELL;                        00015110
                                END;                                    00015120
                            END;                                        00015130
                          END;                                          00015140
                       WHEN (FRAALDER < 067)                            00015150
                         DO;                                            00015160
                                                                        00015170
                            CALL OMREGN;                                00015180
                                                                        00015190
                         END;                                           00015200
                       WHEN (FRAALDER < 070)                            00015210
                         DO;                                            00015220
                            SELECT;                                     00015230
                              WHEN (TILALDER < 067)                     00015240
                                DO;                                     00015250
                                   CALL MANUELL;                        00015260
                                END;                                    00015270
                              OTHERWISE                                 00015280
                                DO;                                     00015290
                                   CALL OMREGN;                         00015300
                                END;                                    00015310
                            END;                                        00015320
                         END;                                           00015330
                       WHEN (FRAALDER >= 070)                           00015340
                         DO;                                            00015350
                            SELECT;                                     00015360
                                                                        00015370
                              WHEN (TILALDER < 070)                     00015380
                                   CALL MANUELL;                        00015390
                                                                        00015400
                              WHEN (WORK_TILALDER > WORK_FRAALDER)      00015410
                                   CALL MANUELL;                        00015420
                                                                        00015430
                              OTHERWISE                                 00015440
                                   CALL OMREGN;                         00015450
                             END;                                       00015460
                         END;                                           00015470
                       OTHERWISE;                                       00015480
                     END;                                               00015490
                  END;                                                  00015500
            END;                                                        00015510
                                                                        00015520
       END;                                                             00015530
                                                                        00015540
    ELSE                                                                00015550
                                                                        00015560
       DO;                                                              00015570
                                                                        00015580
                                                                        00015590
         SSA1_RF0PERSN.PKEY = FNRREC.SISTENR;                           00015600
         CALL LESER_ROT_SEGM_GHU;                                       00015610
                                                                        00015620
         IF FEIL_MELD_NR >  0            THEN                           00015630
            DO;                                                         00015640
               /* ************ */                                       00015650
               /* DATABASEFEIL */                                       00015660
               /* ************ */                                       00015670
                                                                        00015680
               GO TO L999;                                              00015690
            END;                                                        00015700
                                                                        00015710
                                                                        00015720
         IF W02_MER_DATA THEN                                           00015730
           DO;                                                          00015740
                                                                        00015750
             /*------------------------------------------------*/       00015760
             /* ADRESSERER B01 FOR MELDINGSREC                 */       00015770
             /* FJERNER ALLE OPPLYSNNINGER UNDER TIL-NR        */       00015780
             /*------------------------------------------------*/       00015790
                                                                        00015800
             SUBSTR(ADDR(B01.PERSON(1).RF0PERSN) -> W01_HJELPE_IO,1,    00015810
                    STORAGE(B01.PERSON(1).RF0PERSN)) = W01_IO;          00015820
                                                                        00015830
                                                                        00015840
             CALL FJERNER_ALLE_SEGM_DLET;                               00015850
                                                                        00015860
                                                                        00015870
             IF FEIL_MELD_NR > 0           THEN                         00015880
                DO;                                                     00015890
                     /* ************ */                                 00015900
                     /* DATABASEFEIL */                                 00015910
                     /* ************ */                                 00015920
                                                                        00015930
                 GO TO L999;                                            00015940
                END;                                                    00015950
           END;                                                         00015960
                                                                        00015970
         SSA1_RF0PERSN.PKEY = FNRREC.SISTENR;                           00015980
                                                                        00015990
         /* MELDING TIL SYTEMAVDELING OM FEIL PÅ BASEN */               00016000
                                                                        00016010
         MELD_IO.ADRESSAT = 'X';                                        00016020
         CALL MELDINGSREC;                                              00016030
                                                                        00016040
                                                                        00016050
       END;                                                             00016060
                                                                        00016070
 END FNR_SKAL_ENDRES;                                                   00016080
                                                                        00016090
                                                                        00016100
 TESTVTP:PROC(FEIL);                                                    00016110
                                                                        00016120
                                                                        00016130
 DCL W_GRENSEPASS   PIC '9999';                                         00016140
 DCL W_VDATO        PIC '9999';                                         00016150
 DCL FEIL           BIT (1);                                            00016160
                                                                        00016170
 DCL WORK_FNR_ÅM_P  PIC '9999';                                         00016180
                                                                        00016190
 DCL 1 WORK_FNR_ÅM DEF WORK_FNR_ÅM_P,                                   00016200
     2 WORK_FNR_Å   PIC '99',                                           00016210
     2 WORK_FNR_M   PIC '99';                                           00016220
                                                                        00016230
 DCL FØDSELSNR      PIC '(11)9';                                        00016240
 DCL FØD_DAG     DEF FØDSELSNR POS(1) PIC '99',                         00016250
     FØD_MND     DEF FØDSELSNR POS(3) PIC '99',                         00016260
     FØD_ÅR      DEF FØDSELSNR POS(5) PIC '99',                         00016270
     FØD_INDSIFF DEF FØDSELSNR POS(7) PIC '999',                        00016280
     FØD_KJØNN   DEF FØDSELSNR POS(9) PIC '9';                          00016290
                                                                        00016300
                                                                        00016310
  W_GRENSEPASS = 0;                                                     00016320
  W_VDATO      = B01.VIRK_DATO_ÅM(I);                                   00016330
  FØDSELSNR    = B01.FNR(I);                                            00016340
                                                                        00016350
                                                                        00016360
  WORK_FNR_Å = FØD_ÅR;                                                  00016370
  WORK_FNR_M = FØD_MND;                                                 00016380
                                                                        00016390
  DCL TEKST           CHAR(29);                                         00016400
                                                                        00016410
                                                                        00016420
                                                                        00016430
  IF (FRAALDER < 18 &                                                   00016440
      TILALDER > 18 ) !                                                 00016450
     (FRAALDER > 18 &                                                   00016460
      TILALDER < 18 ) THEN                                              00016470
     W_GRENSEPASS = WORK_FNR_ÅM_P + 1800;                               00016480
  ELSE                                                                  00016490
     IF (FRAALDER < 20 &                                                00016500
         TILALDER > 20 ) !                                              00016510
        (FRAALDER > 20 &                                                00016520
         TILALDER < 20 ) THEN                                           00016530
        W_GRENSEPASS = WORK_FNR_ÅM_P + 2000;                            00016540
     ELSE                                                               00016550
        IF (FRAALDER < 67 &                                             00016560
            TILALDER > 67 ) !                                           00016570
           (FRAALDER > 67 &                                             00016580
            TILALDER < 67 ) THEN                                        00016590
            W_GRENSEPASS = WORK_FNR_ÅM_P + 6700;                        00016600
        ELSE                                                            00016610
           IF (FRAALDER < 70 &                                          00016620
               TILALDER > 70 ) !                                        00016630
              (FRAALDER > 70 &                                          00016640
               TILALDER < 70 ) THEN                                     00016650
               W_GRENSEPASS = WORK_FNR_ÅM_P + 7000;                     00016660
  IF W_GRENSEPASS ^= 0 THEN                                             00016670
     IF W_VDATO > W_GRENSEPASS  THEN                                    00016680
        FEIL = '1'B;                                                    00016690
     ELSE                                                               00016700
        FEIL = '0'B;                                                    00016710
 END TESTVTP;                                                           00016720
                                                                        00016730
                                                                        00016740
                                                                        00016750
 OMREGN: PROC;                                                          00016760
                                                                        00016770
  /*---------------------------------------------------*/               00016780
  /* LOKALE DECLARASJONER                              */               00016790
  /*---------------------------------------------------*/               00016800
                                                                        00016810
  DCL Z            BIN FIXED    (15);                                   00016820
  DCL TEKST        CHAR         (29)   INIT ('')        ;               00016830
  DCL OMR_ÅMW      PIC          '9999'                  ;               00016840
  DCL FØDSELSNRW   PIC          '(11)9'                 ;               00016850
  DCL FØD_ÅRW      DEF FØDSELSNRW POS (5) PIC '99' ;                    00016860
  DCL FØD_MNDW     DEF FØDSELSNRW POS (3) PIC '99' ;                    00016870
  DCL FØD_INDW     DEF FØDSELSNRW POS (7) PIC '999';                    00016880
                                                                        00016890
                                                                        00016900
                                                                        00016910
                                                                        00016920
                                                                        00016930
    TEKST        =  'OMREGN';                                           00016940
    FØDSELSNRW   =  FNRREC.SISTENR;                                     00016950
    OMR_ÅMW      =  FØD_ÅRW!!FØD_MNDW;                                  00016960
                                                                        00016970
                                                                        00016980
    SØKER_IND    =  I;                                                  00016990
    ANT_CALL_OMR =  ANT_CALL_OMR + 1;                                   00017000
                                                                        00017010
    IF SØKER_IND =  1 THEN                                              00017020
       EKTEF_IND =  2;                                                  00017030
    ELSE                                                                00017040
       IF SØKER_IND = 2 THEN                                            00017050
          EKTEF_IND = 1;                                                00017060
                                                                        00017070
    IF (FRAALDER >= 16 & FRAALDER < 67) & TILALDER < 16 THEN            00017080
      DO;                                                               00017090
        /* FJERN UFØREPENSJON: */                                       00017100
                                                                        00017110
        IF B02.PERSON(I).STATUS.PENSJONSTYPE1 = 'U' THEN                00017120
          DO;                                                           00017130
            IF B02.PERSON(I).STATUS.PENSJONSTYPE2 = 'E' THEN            00017140
               B02.PERSON(I).STATUS.PENSJONSTYPE1 = 'E';                00017150
            ELSE                                                        00017160
               B02.PERSON(I).STATUS.VIRK_DATO_ÅM = 0;                   00017170
          END;                                                          00017180
                                                                        00017190
        B02.PERSON(I).UFØRPENS    = '';                                 00017200
        B02.PERSON(I).UFØRHIST(1) = '';                                 00017210
        B02.PERSON(I).UFØRHIST(2) = '';                                 00017220
        B02.PERSON(I).UFØRHIST(3) = '';                                 00017230
        B02.PERSON(I).UFØRHIST(4) = '';                                 00017240
        B02.PERSON(I).UFØRHIST(5) = '';                                 00017250
                                                                        00017260
        IF B02.PERSON(I).STATUS.VIRK_DATO_ÅM ^= 0 THEN                  00017270
          DO;                                                           00017280
            /* ANDRE YTELSER FINNES */                                  00017290
            /* AUTOHENDELSE BEREGNING */                                00017300
                                                                        00017310
            DIV_PARAM_OMR.KJØRINGS_TYPE = 'O';                          00017320
                                                                        00017330
  /*        NESTE_HENDELSE_DATO_ÅM = DAGENS_DATO_ÅR_MND; */             00017340
            NESTE_HENDELSE_DATO_ÅM = DATO_ÅR_MND;                       00017350
                                                                        00017360
            TRANS_OPPL_OMR.TRANSTYPE = 45;                              00017370
                                                                        00017380
            STØNADSBREV_ØNSKET_IND = '1'B;                              00017390
                                                                        00017400
                                                                        00017410
            W01_SUM_YTELSE =                                            00017420
                B01.SUM_YTELSE(I);                                      00017430
            W01_PENSJONSTYPE1 =                                         00017440
                B01.PENSJONSTYPE1(I);                                   00017450
            W01_STATUS_KODE_HIST =                                      00017460
                B01.STATUS_KODE_HIST(I);                                00017470
                                                                        00017480
            TRANS_OPPL_OMR.FØDSNUMMER =                                 00017490
                  B02.PERSON(I).RF0PERSN.FNR;                           00017500
                                                                        00017510
            EXEC CICS LINK PROGRAM ('R0014901')  COMMAREA (KOM_OMR);    00017520
                                                                        00017530
                                                                        00017540
            IF FEIL_MELD_NR      >  0            THEN                   00017550
              DO;                                                       00017560
                /* **************************************** */          00017570
                /*  FEIL VED R0014901(AUTOBEREGNING).       */          00017580
                /* **************************************** */          00017590
                                                                        00017600
                TERMINERINGS_IND = FATAL_FEIL;                          00017610
                                                                        00017620
                GO TO L999;                                             00017630
              END;                                                      00017640
                                                                        00017650
            ELSE                                                        00017660
                                                                        00017670
              PROGRAM_ID   =   'R0019E04';                              00017680
                                                                        00017690
            /* IF B02.PERSON(I).RF0PERSN.FNR > 0                        00017700
                    B00.PERSON(I).RF0PERSN.FNR =                        00017710
                               B02.PERSON(I).RF0PERSN.FNR;  */          00017720
                                                                        00017730
            B00.PERSON(I).STATUS.VIRK_DATO_ÅM = 0;                      00017740
                                                                        00017750
            /* DLET NEST SISTE STATUS */                                00017760
            /* HELE FAMILIEPAKKE      */                                00017770
                                                                        00017780
                                                                        00017790
                                                                        00017800
            IF (B02.STATUS_KODE_HIST(I) =                               00017810
                    W01_STATUS_KODE_HIST)            &                  00017820
               (B02.SUM_YTELSE(I) =                                     00017830
                    W01_SUM_YTELSE)                  &                  00017840
               (B02.PENSJONSTYPE1(I) =                                  00017850
                    W01_PENSJONSTYPE1)               THEN               00017860
                                                                        00017870
               DO;                                                      00017880
                                                                        00017890
                 W01_DUMMY_DATO = 0;                                    00017900
                 CALL OMREGNING_PGA_FNRENDRING;                         00017910
                                                                        00017920
                 IF FEIL_MELD_NR > 0              THEN                  00017930
                    DO;                                                 00017940
                  /* *********************************/                 00017950
                  /* FEIL VED OMREGNING              */                 00017960
                  /* *********************************/                 00017970
                                                                        00017980
                       TERMINERINGS_IND = FATAL_FEIL;                   00017990
                                                                        00018000
                       GO TO L999;                                      00018010
                    END;                                                00018020
                 ELSE                                                   00018030
                                                                        00018040
                    PROGRAM_ID = 'R0019E04';                            00018050
                                                                        00018060
                    ANT_OMR_4001 = ANT_OMR_4001 + 1;                    00018070
                                                                        00018080
                 /* PROC R0019961 OMREGNING_PGA_FNRENDRING              00018090
                    BRUKES HER FORDI DEN GIR ØNSKET RESULTAT VED        00018100
                    FØDSELNUMMERENDRING                          */     00018110
                                                                        00018120
               END;                                                     00018130
                                                                        00018140
            ELSE                                                        00018150
                                                                        00018160
               DO;                                                      00018170
                                                                        00018180
                 ANT_OMR_4901 = ANT_OMR_4901 + 1;                       00018190
                                                                        00018200
                 TRANS_OPPL_OMR.FØDSNUMMER =                            00018210
                                      B02.PERSON(I).RF0PERSN.FNR;       00018220
                                                                        00018230
                 EXEC CICS LINK PROGRAM ('R0016001')                    00018240
                                        COMMAREA (KOM_OMR);             00018250
                                                                        00018260
                                                                        00018270
                 IF FEIL_MELD_NR   >  0            THEN                 00018280
                    DO;                                                 00018290
                       /* *********************************/            00018300
                       /* FEIL VED R0016001(STATESTIKK).  */            00018310
                       /* *********************************/            00018320
                                                                        00018330
                       GO TO L999;                                      00018340
                    END;                                                00018350
                 ELSE                                                   00018360
                                                                        00018370
                    PROGRAM_ID =  'R0019E04';                           00018380
                                                                        00018390
                                                                        00018400
                 /*------------------------------------------------*/   00018410
                 /* SKRIV B02 MED NYE KRITTERIER På RF - DB        */   00018420
                 /*------------------------------------------------*/   00018430
                                                                        00018440
                 TRANS_OPPL_OMR.FØDSNUMMER =                            00018450
                       B02.PERSON(I).RF0PERSN.FNR;                      00018460
                                                                        00018470
                 EXEC CICS LINK PROGRAM ('R0015401')                    00018480
                                        COMMAREA (KOM_OMR);             00018490
                                                                        00018500
                                                                        00018510
                 IF FEIL_MELD_NR   >  0            THEN                 00018520
                    DO;                                                 00018530
                       /* *************************************/        00018540
                       /* FEIL VED R0015401(BASEUTSKRIVING).  */        00018550
                       /* *************************************/        00018560
                                                                        00018570
                       GO TO L999;                                      00018580
                    END;                                                00018590
                 ELSE                                                   00018600
                                                                        00018610
                    PROGRAM_ID =  'R0019E04';                           00018620
                                                                        00018630
               END;                                                     00018640
                                                                        00018650
          END;                                                          00018660
        ELSE                                                            00018670
          DO;                                                           00018680
             /*------------------------------------------------*/       00018690
             /* SKRIV B02 MED NYE KRITTERIER På RF - DB        */       00018700
             /*------------------------------------------------*/       00018710
                                                                        00018720
              TRANS_OPPL_OMR.FØDSNUMMER = B02.FNR (I)          ;        00018730
                                                                        00018740
              EXEC CICS LINK PROGRAM  ('R0015401')                      00018750
                             COMMAREA ( KOM_OMR  )             ;        00018760
                                                                        00018770
                                                                        00018780
              IF FEIL_MELD_NR      >  0            THEN                 00018790
                 DO;                                                    00018800
                    /* *************************************/           00018810
                    /* FEIL VED R0015401(BASEUTSKRIVING).  */           00018820
                    /* *************************************/           00018830
                                                                        00018840
                    GO TO L999;                                         00018850
                 END;                                                   00018860
              ELSE                                                      00018870
                 PROGRAM_ID =     'R0019E04';                           00018880
          END;                                                          00018890
      END;                                                              00018900
    ELSE                                                                00018910
      DO;                                                               00018920
        /*------------------------------------------------*/            00018930
        /* ANDRE YTELSER FINNES . ATOHENDELSE BEREGNING   */            00018940
        /*------------------------------------------------*/            00018950
                                                                        00018960
        W01_SUM_YTELSE              =   B01.SUM_YTELSE       (I);       00018970
        W01_PENSJONSTYPE1           =   B01.PENSJONSTYPE1    (I);       00018980
        W01_STATUS_KODE_HIST        =   B01.STATUS_KODE_HIST (I);       00018990
                                                                        00019000
        TRANS_OPPL_OMR.FØDSNUMMER   =   B01.RF0PERSN.FNR     (I);       00019010
                                                                        00019020
                                                                        00019030
        DIV_PARAM_OMR.KJØRINGS_TYPE = 'O';                              00019040
        STØNADSBREV_ØNSKET_IND      = '1'B;                             00019050
 /*     NESTE_HENDELSE_DATO_ÅM      =  DAGENS_DATO_ÅR_MND;   */         00019060
        NESTE_HENDELSE_DATO_ÅM      =  DATO_ÅR_MND;                     00019070
        TRANS_OPPL_OMR.TRANSTYPE    =  45;                              00019080
        TEKST                       = 'R0014901 FERDIG              ';  00019090
                                                                        00019100
        EXEC CICS LINK PROGRAM   ('R0014901') COMMAREA (KOM_OMR);       00019110
                                                                        00019120
        TEKST  = 'R0014901  FERDIG             ';                       00019130
                                                                        00019140
        IF FEIL_MELD_NR        >  0            THEN                     00019150
           DO;                                                          00019160
             /* **************************************** */             00019170
             /*    FEIL VED R0014901(AUTOBEREGNING).     */             00019180
             /* **************************************** */             00019190
                                                                        00019200
             TERMINERINGS_IND = FATAL_FEIL;                             00019210
                                                                        00019220
             GO TO L999;                                                00019230
           END;                                                         00019240
        ELSE                                                            00019250
                                                                        00019260
           PROGRAM_ID     =   'R0019E04';                               00019270
                                                                        00019280
        B00.PERSON(I).STATUS.VIRK_DATO_ÅM = 0;                          00019290
                                                                        00019300
        /* DLET NEST SISTE STATUS */                                    00019310
        /* HELE FAMILIEPAKKE      */                                    00019320
                                                                        00019330
                                                                        00019340
                                                                        00019350
                                                                        00019360
        IF (B02.STATUS_KODE_HIST(I) =                                   00019370
                 W01_STATUS_KODE_HIST)            &                     00019380
           (B02.SUM_YTELSE(I) =                                         00019390
                 W01_SUM_YTELSE)                  &                     00019400
           (B02.PENSJONSTYPE1(I) =                                      00019410
                 W01_PENSJONSTYPE1)               THEN                  00019420
                                                                        00019430
                                                                        00019440
           DO;                                                          00019450
                                                                        00019460
                 W01_DUMMY_DATO = 0;                                    00019470
                 CALL OMREGNING_PGA_FNRENDRING;                         00019480
                                                                        00019490
             IF FEIL_MELD_NR > 0                  THEN                  00019500
                DO;                                                     00019510
                   /* *********************************/                00019520
                   /* FEIL VED OMREGNING              */                00019530
                   /* *********************************/                00019540
                                                                        00019550
                   TERMINERINGS_IND = FATAL_FEIL;                       00019560
                                                                        00019570
                   GO TO L999;                                          00019580
                END;                                                    00019590
             ELSE                                                       00019600
                                                                        00019610
                PROGRAM_ID = 'R0019E04';                                00019620
                                                                        00019630
                ANT_OMR_4001 = ANT_OMR_4001 + 1;                        00019640
                                                                        00019650
             /* PROC R0019961 OMREGNING_PGA_FNRENDRING                  00019660
                BRUKES HER FORDI DEN GIR ØNSKET RESULTAT VED            00019670
                FØDSELNUMMERENDRING                          */         00019680
                                                                        00019690
           END;                                                         00019700
                                                                        00019710
        ELSE                                                            00019720
                                                                        00019730
           DO;                                                          00019740
                                                                        00019750
             ANT_OMR_4901 = ANT_OMR_4901 + 1;                           00019760
                                                                        00019770
             TRANS_OPPL_OMR.FØDSNUMMER =                                00019780
                   B02.PERSON(I).RF0PERSN.FNR;                          00019790
                                                                        00019800
             EXEC CICS LINK PROGRAM ('R0016001')                        00019810
                                    COMMAREA (KOM_OMR);                 00019820
                                                                        00019830
                                                                        00019840
             IF FEIL_MELD_NR   >  0            THEN                     00019850
                DO;                                                     00019860
                   /* **************************************** */       00019870
                   /* FEIL VED R0016001(STATESTIKK).           */       00019880
                   /* **************************************** */       00019890
                                                                        00019900
                   GO TO L999;                                          00019910
                END;                                                    00019920
             ELSE                                                       00019930
                                                                        00019940
                PROGRAM_ID =  'R0019E04';                               00019950
             /*------------------------------------------------*/       00019960
             /* SKRIV B02 MED NYE KRITTERIER På RF - DB        */       00019970
             /*------------------------------------------------*/       00019980
                                                                        00019990
                                                                        00020000
             TRANS_OPPL_OMR.FØDSNUMMER =                                00020010
                   B02.PERSON(I).RF0PERSN.FNR;                          00020020
                                                                        00020030
             EXEC CICS LINK PROGRAM ('R0015401')                        00020040
                                    COMMAREA (KOM_OMR);                 00020050
                                                                        00020060
                                                                        00020070
             IF FEIL_MELD_NR   >  0            THEN                     00020080
                DO;                                                     00020090
                   /* **************************************** */       00020100
                   /* FEIL VED R0015401(BASEUTSKRIVING).       */       00020110
                   /* **************************************** */       00020120
                                                                        00020130
                   GO TO L999;                                          00020140
                END;                                                    00020150
             ELSE                                                       00020160
                                                                        00020170
                PROGRAM_ID =  'R0019E04';                               00020180
                                                                        00020190
           END;                                                         00020200
                                                                        00020210
      END;                                                              00020220
                                                                        00020230
 END OMREGN;                                                            00020240
                                                                        00020250
 MANUELL: PROC;                                                         00020260
                                                                        00020270
    /* MELDING TIL RTV REG.SEKSJ. OM 'MANUELL' OMREGNING */             00020280
    MELD_IO.ADRESSAT = 'F';                                             00020290
    CALL MELDINGSREC;                                                   00020300
    ANT_CALL_MAN = ANT_CALL_MAN + 1;                                    00020310
                                                                        00020320
  DCL TEKST           CHAR(29);                                         00020330
  TEKST ='MANUELL';                                                     00020340
                                                                        00020350
 END MANUELL;                                                           00020360
                                                                        00020370
 DØD: PROC;                                                             00020380
                                                                        00020390
    DCL TEKST         CHAR(29);                                         00020400
                                                                        00020410
                                                                        00020420
    FØDSELSNR = FNRREC.SISTENR;                                         00020430
                                                                        00020440
    WORK_DATO = FØD_ÅR!!FØD_MND;                                        00020450
                                                                        00020460
    WORK_TILALDER = DAGENS_DATO_ÅR_MND -                                00020470
                    WORK_DATO;                                          00020480
                                                                        00020490
    IF (FØD_INDSIFF >= 500  &                                           00020500
        FØD_INDSIFF <= 749) !                                           00020510
        WORK_DATO   <  0601   THEN                                      00020520
                                                                        00020530
       DO;                                                              00020540
                                                                        00020550
         /*  LESER ROT TILNR  */                                        00020560
                                                                        00020570
         SSA1_RF0PERSN.PKEY = FNRREC.SISTENR;                           00020580
                                                                        00020590
         CALL LESER_ROT_SEGM_GU;                                        00020600
                                                                        00020610
         IF FEIL_MELD_NR      >  0            THEN                      00020620
            DO;                                                         00020630
               /* **************************************** */           00020640
               /*  DATABASEFEIL                            */           00020650
               /* **************************************** */           00020660
                                                                        00020670
               GO TO L999;                                              00020680
            END;                                                        00020690
                                                                        00020700
         IF W02_MER_DATA THEN                                           00020710
            DO;                                                         00020720
                                                                        00020730
              SUBSTR(ADDR(B01.PERSON(1).RF0PERSN) -> W01_HJELPE_IO,1,   00020740
                     STORAGE(B01.PERSON(1).RF0PERSN)) = W01_IO;         00020750
                                                                        00020760
            END;                                                        00020770
                                                                        00020780
         MELD_IO.ADRESSAT = 'U';                                        00020790
         CALL MELDINGSREC;                                              00020800
                                                                        00020810
       END;                                                             00020820
                                                                        00020830
    ELSE                                                                00020840
                                                                        00020850
       DO;                                                              00020860
                                                                        00020870
         WORK_BLANKETTYPE = TRANS_OPPL_OMR.BLANKETTYPE;                 00020880
         TRANS_OPPL_OMR.BLANKETTYPE = 'O1';                             00020890
         TRANS_OPPL_OMR.VIRKNINGSDATO = DØD_DATO_MND!!DØD_DATO_ÅR;      00020900
         TRANS_OPPL_OMR.FØDSNUMMER = FNRREC.SISTENR;                    00020910
                                                                        00020920
         EXEC CICS LINK PROGRAM ('R0013101') COMMAREA (KOM_OMR);        00020930
                                                                        00020940
                                                                        00020950
         IF FEIL_MELD_NR       >  0            THEN                     00020960
            DO;                                                         00020970
              /* ***************************** */                       00020980
              /*   FEIL VED SPERRE-BEHANDLING  */                       00020990
              /* ***************************** */                       00021000
                                                                        00021010
              GO TO L999;                                               00021020
            END;                                                        00021030
         ELSE                                                           00021040
                                                                        00021050
            PROGRAM_ID    =   'R0019E04';                               00021060
                                                                        00021070
         /* DATA M/ SISTE STATUS TIL B01 */                             00021080
         B02 = B01;                                                     00021090
                                                                        00021100
                                                                        00021110
         /* NB: FNR ER ENDRET */                                        00021120
                                                                        00021130
         DO I = 1 TO 14 WHILE(B02.PERSON(I).RF0PERSN.FNR ^=             00021140
                              FNRREC.SISTENR);                          00021150
                                                                        00021160
         /* I PEKER NÅ PÅ DET FELT (DEN PERSON) HVOR                    00021170
            FNR-ENDRING ER FORETATT              */                     00021180
                                                                        00021190
         END;                                                           00021200
                                                                        00021210
         WORK_DØDSDATO = B02.PERSON(I).STATUS.DØDSDATO_ÅMD;             00021220
         WORK_FNR_Å = DØD_DATO_ÅR;                                      00021230
         WORK_FNR_M = DØD_DATO_MND;                                     00021240
                                                                        00021250
         /* TESTER På FRAALDER MOT DØDSDATO */                          00021260
                                                                        00021270
         FØDSELSNR = FNRREC.FRANR;                                      00021280
                                                                        00021290
         WORK_DATO = FØD_ÅR!!FØD_MND;                                   00021300
                                                                        00021310
         WORK_FRAALDER = WORK_FNR_ÅM_P -                                00021320
                         WORK_DATO;                                     00021330
                                                                        00021340
         IF FØD_INDSIFF >= 500 &                                        00021350
            FØD_INDSIFF <= 749      THEN                                00021360
            FRAALDER = FRAALDER + 100;                                  00021370
                                                                        00021380
                                                                        00021390
         /* TESTER På TILALDER MOT DØDSDATO */                          00021400
                                                                        00021410
         FØDSELSNR = FNRREC.SISTENR;                                    00021420
                                                                        00021430
         WORK_DATO = FØD_ÅR!!FØD_MND;                                   00021440
                                                                        00021450
         WORK_TILALDER = WORK_FNR_ÅM_P -                                00021460
                         WORK_DATO;                                     00021470
                                                                        00021480
         IF FØD_INDSIFF >= 500 &                                        00021490
            FØD_INDSIFF <= 749      THEN                                00021500
            TILALDER = TILALDER + 100;                                  00021510
                                                                        00021520
                                                                        00021530
         SELECT;                                                        00021540
                                                                        00021550
           WHEN (FRAALDER < 067)                                        00021560
             DO;                                                        00021570
                                                                        00021580
                SELECT;                                                 00021590
                  WHEN (TILALDER >= 067)                                00021600
                    DO;                                                 00021610
                                                                        00021620
                       CALL ENDRE_UFØRH_ALDER;                          00021630
                       CALL SKRIV_6001_5401;                            00021640
                                                                        00021650
                    END;                                                00021660
                  OTHERWISE;                                            00021670
                END;                                                    00021680
             END;                                                       00021690
                                                                        00021700
           WHEN (FRAALDER >= 067)                                       00021710
             DO;                                                        00021720
                                                                        00021730
                SELECT;                                                 00021740
                  WHEN (TILALDER < 067)                                 00021750
                    DO;                                                 00021760
                                                                        00021770
                       CALL ENDRE_UFØRH_DØD;                            00021780
                       CALL SKRIV_6001_5401;                            00021790
                                                                        00021800
                    END;                                                00021810
                  OTHERWISE;                                            00021820
                END;                                                    00021830
             END;                                                       00021840
                                                                        00021850
           OTHERWISE;                                                   00021860
                                                                        00021870
         END;                                                           00021880
                                                                        00021890
         TRANS_OPPL_OMR.BLANKETTYPE = WORK_BLANKETTYPE;                 00021900
         WORK_TILKN_FNR(*) = '';                                        00021910
                                                                        00021920
         DO J = 1 TO 13 WHILE(B02.PERSON(I).TILKN(J).FNR_TILKN > 0);    00021930
                                                                        00021940
            /* LEGGER UT ALLE TILKN-FNR TIL DEN DØDE I WORK-TABELL */   00021950
            /* HVIS TILKNYTNINGSKODE = E ELLER B.                  */   00021960
                                                                        00021970
            IF B02.PERSON(I).TILKN(J).TILKNYTNINGSKODE = 'E' !          00021980
               B02.PERSON(I).TILKN(J).TILKNYTNINGSKODE = 'B' THEN       00021990
                                                                        00022000
                 WORK_TILKN_FNR(J).WORK_FNR_TILKN =                     00022010
                      B02.PERSON(I).TILKN(J).FNR_TILKN;                 00022020
                                                                        00022030
         END;                                                           00022040
                                                                        00022050
                                                                        00022060
         W02.PERSON(1) = B02.PERSON(I);                                 00022070
                                                                        00022080
         DO J = 1 TO 13 WHILE(WORK_TILKN_FNR(J).WORK_FNR_TILKN > 0);    00022090
                                                                        00022100
            /* KALLER R0013101 OG R0019961 FOR ALLE FNR I TABELL */     00022110
                                                                        00022120
            /* ENDRE OG REGNE OM TILKNYTTEDE PERSONER */                00022130
                                                                        00022140
            TRANS_OPPL_OMR.FØDSNUMMER =                                 00022150
                  WORK_TILKN_FNR(J).WORK_FNR_TILKN;                     00022160
            TRANS_OPPL_OMR.VIRKNINGSDATO = 9999;                        00022170
                                                                        00022180
            EXEC CICS LINK PROGRAM ('R0013101') COMMAREA (KOM_OMR);     00022190
                                                                        00022200
                                                                        00022210
            IF FEIL_MELD_NR     >  0            THEN                    00022220
               DO;                                                      00022230
                  /* **************************************** */        00022240
                  /* FEIL VED SPERRE-BEHANDLING               */        00022250
                  /* **************************************** */        00022260
                                                                        00022270
                  TERMINERINGS_IND = FATAL_FEIL;                        00022280
                                                                        00022290
                  GO TO L999;                                           00022300
               END;                                                     00022310
            ELSE                                                        00022320
                                                                        00022330
               PROGRAM_ID  =   'R0019E04';                              00022340
                                                                        00022350
            B01.PERSON(I) = W02.PERSON(1);                              00022360
            B02 = B01;                                                  00022370
            B00 = '';                                                   00022380
                                                                        00022390
            DO I = 1 TO 14 WHILE(B02.PERSON(I).RF0PERSN.FNR ^=          00022400
                                 WORK_TILKN_FNR(J).WORK_FNR_TILKN);     00022410
                                                                        00022420
               /* I PEKER NÅ PÅ DET FELT (DEN PERSON) I B02 */          00022430
               /* SOM ER TILKNYTTET DEN DØDE OG SOM HAR     */          00022440
               /* TILKNYTNINGSKODE = E ELLER B.             */          00022450
                                                                        00022460
            END;                                                        00022470
                                                                        00022480
            MELD_IO.ADRESSAT = 'T';                                     00022490
            CALL MELDINGSREC;       /* MELDING TRYGDEKTR. */            00022500
                                                                        00022510
                                                                        00022520
            SØKER_IND = I;                                              00022530
            ANT_CALL_OMR = ANT_CALL_OMR + 1;                            00022540
                                                                        00022550
            IF SØKER_IND = 1 THEN                                       00022560
               EKTEF_IND = 2;                                           00022570
            ELSE                                                        00022580
               IF SØKER_IND = 2 THEN                                    00022590
                  EKTEF_IND = 1;                                        00022600
                                                                        00022610
                                                                        00022620
            DIV_PARAM_OMR.KJØRINGS_TYPE = 'O';                          00022630
                                                                        00022640
  /*        NESTE_HENDELSE_DATO_ÅM = DAGENS_DATO_ÅR_MND;  */            00022650
            NESTE_HENDELSE_DATO_ÅM = DATO_ÅR_MND;                       00022660
                                                                        00022670
            TRANS_OPPL_OMR.TRANSTYPE = 45;                              00022680
                                                                        00022690
            STØNADSBREV_ØNSKET_IND = '1'B;                              00022700
                                                                        00022710
            FNR_PIC = B02.PERSON(I).RF0PERSN.FNR;                       00022720
            TEKST ='CALL 4001 I DØD ' !! FNR_CHAR;                      00022730
                                                                        00022740
            W01_DUMMY_DATO = 0;                                         00022750
            CALL OMREGNING_PGA_FNRENDRING;                              00022760
                                                                        00022770
            IF FEIL_MELD_NR > 0                 THEN                    00022780
               DO;                                                      00022790
                  /* ****************** */                              00022800
                  /* FEIL VED OMREGNING */                              00022810
                  /* ****************** */                              00022820
                                                                        00022830
                  TERMINERINGS_IND = FATAL_FEIL;                        00022840
                                                                        00022850
                  GO TO L999;                                           00022860
               END;                                                     00022870
            ELSE                                                        00022880
                                                                        00022890
               PROGRAM_ID = 'R0019E04';                                 00022900
                                                                        00022910
            ANT_OMR_4001 = ANT_OMR_4001 + 1;                            00022920
                                                                        00022930
            /* PROC R0019961 OMREGNING_PGA_FNRENDRING                   00022940
               BRUKES HER FORDI DEN GIR ØNSKET RESULTAT VED             00022950
               FØDSELNUMMERENDRING                          */          00022960
                                                                        00022970
         END;                                                           00022980
                                                                        00022990
       END;                                                             00023000
                                                                        00023010
 END DØD;                                                               00023020
                                                                        00023030
 SKRIV_6001_5401: PROC;                                                 00023040
                                                                        00023050
    /* STAT-TRANS */                                                    00023060
                                                                        00023070
    TRANS_OPPL_OMR.FØDSNUMMER =                                         00023080
          B02.PERSON(I).RF0PERSN.FNR;                                   00023090
                                                                        00023100
    EXEC CICS LINK PROGRAM ('R0016001')                                 00023110
                           COMMAREA (KOM_OMR);                          00023120
                                                                        00023130
                                                                        00023140
    IF FEIL_MELD_NR             >  0            THEN                    00023150
       DO;                                                              00023160
          /* **************************************** */                00023170
          /*         FEIL VED SPERRE-BEHANDLING       */                00023180
          /* **************************************** */                00023190
                                                                        00023200
          GO TO L999;                                                   00023210
       END;                                                             00023220
    ELSE                                                                00023230
                                                                        00023240
       PROGRAM_ID = 'R0019E04';                                         00023250
                                                                        00023260
                       /* SKRIV B02 M/ NYE KRITT */                     00023270
                       /* PÅ BASEN               */                     00023280
                                                                        00023290
    TRANS_OPPL_OMR.FØDSNUMMER =                                         00023300
          B02.PERSON(I).RF0PERSN.FNR;                                   00023310
                                                                        00023320
    EXEC CICS LINK PROGRAM ('R0015401') COMMAREA (KOM_OMR);             00023330
                                                                        00023340
                                                                        00023350
    IF FEIL_MELD_NR >         0            THEN                         00023360
       DO;                                                              00023370
          /* **************************************** */                00023380
          /* FEIL VED SPERRE-BEHANDLING               */                00023390
          /* **************************************** */                00023400
                                                                        00023410
          GO TO L999;                                                   00023420
       END;                                                             00023430
    ELSE                                                                00023440
                                                                        00023450
       PROGRAM_ID = 'R0019E04';                                         00023460
                                                                        00023470
    ANT_UFØRH = ANT_UFØRH + 1;                                          00023480
                                                                        00023490
 END SKRIV_6001_5401;                                                   00023500
                                                                        00023510
                                                                        00023520
 ENDRE_UFØRH_ALDER: PROC;                                               00023530
                                                                        00023540
    DO J = 1 TO 5 WHILE(B02.PERSON(I).UFØRHIST(J).UFT_ÅM > 0);          00023550
                                                                        00023560
    /* J PEKER NÅ PÅ DET 1. LEDIGE UFØRHIST SEGMENT   */                00023570
    /* ELLER DET SISTE HVIS ALLE ER BENYTTET.         */                00023580
    /* PROGRAMMET SKAL ENDRE På DET SIST OPPDATERTE.  */                00023590
                                                                        00023600
    END;                                                                00023610
                                                                        00023620
    IF B02.PERSON(I).UFØRHIST(J).UFT_ÅM = 0 THEN                        00023630
       J = J - 1;                                                       00023640
                                                                        00023650
    /* LEGGER TIL 67 ÅR PÅ FØDSELSÅR  */                                00023660
    /* LEGGER TIL 1 MND PÅ FØDSELSMND */                                00023670
  /*ETTER 1998 SKAL UP IKKE OPPHØRE I JANUAR - ENDRES TIL DESEMBER*/    00023680
                                                                        00023690
    OPPH_ÅR = FØD_ÅR + 67;                                              00023700
    OPPH_MN = FØD_MND;                                                  00023710
    FØD_ÅR  = FØD_ÅR + 67;                                              00023720
    FØD_MND = FØD_MND + 1;                                              00023730
                                                                        00023740
    IF FØD_MND > 12 THEN                                                00023750
                                                                        00023760
      DO;                                                               00023770
                                                                        00023780
        FØD_ÅR = FØD_ÅR + 1;                                            00023790
        FØD_MND = FØD_MND - 12;                                         00023800
                                                                        00023810
      END;                                                              00023820
                                                                        00023830
    IF OPPH_ÅR > 97       &                                             00023840
       OPPH_MN = 12       THEN                                          00023850
       WORK_DATO = OPPH_ÅM;                                             00023860
    ELSE                                                                00023870
       WORK_DATO = FØD_ÅR!!FØD_MND;                                     00023880
                                                                        00023890
    B02.PERSON(I).UFØRHIST(J).OPPHØRSDATO_ÅM = WORK_DATO;               00023900
    B02.PERSON(I).UFØRHIST(J).OPPHØRSKODE    = 'A';                     00023910
                                                                        00023920
 END ENDRE_UFØRH_ALDER;                                                 00023930
                                                                        00023940
                                                                        00023950
 ENDRE_UFØRH_DØD: PROC;                                                 00023960
                                                                        00023970
    DO J = 1 TO 5 WHILE(B02.PERSON(I).UFØRHIST(J).UFT_ÅM > 0);          00023980
                                                                        00023990
    /* J PEKER NÅ PÅ DET 1. LEDIGE UFØRHIST SEGMENT   */                00024000
    /* ELLER DET SISTE HVIS ALLE ER BENYTTET.         */                00024010
    /* PROGRAMMET SKAL ENDRE På DET SIST OPPDATERTE.  */                00024020
                                                                        00024030
    END;                                                                00024040
                                                                        00024050
    IF B02.PERSON(I).UFØRHIST(J).UFT_ÅM = 0 THEN                        00024060
       J = J - 1;                                                       00024070
                                                                        00024080
    /* LEGGER INN DØDSDATO FRA STATUS SEGMENT */                        00024090
                                                                        00024100
    /* LEGGER TIL 1 MND PÅ DøDSDATO MND */                              00024110
    OPPH_ÅR = WORK_FNR_Å;                                               00024120
    OPPH_MN = WORK_FNR_M;                                               00024130
                                                                        00024140
    WORK_FNR_M = WORK_FNR_M + 1;                                        00024150
                                                                        00024160
    IF WORK_FNR_M > 12 THEN                                             00024170
                                                                        00024180
      DO;                                                               00024190
                                                                        00024200
        WORK_FNR_Å = WORK_FNR_Å + 1;                                    00024210
        WORK_FNR_M = WORK_FNR_M - 12;                                   00024220
                                                                        00024230
      END;                                                              00024240
                                                                        00024250
  /*ETTER 1998 SKAL UP IKKE OPPHØRE I JANUAR - ENDRES TIL DESEMBER*/    00024260
    IF OPPH_ÅR > 97       &                                             00024270
       OPPH_MN = 12       THEN                                          00024280
       B02.PERSON(I).UFØRHIST(J).OPPHØRSDATO_ÅM = OPPH_ÅM;              00024290
    ELSE                                                                00024300
       B02.PERSON(I).UFØRHIST(J).OPPHØRSDATO_ÅM = WORK_FNR_ÅM_P;        00024310
    B02.PERSON(I).UFØRHIST(J).OPPHØRSKODE    = 'D';                     00024320
                                                                        00024330
 END ENDRE_UFØRH_DØD;                                                   00024340
                                                                        00024350
                                                                        00024360
 ENDRE_TILKN: PROC;                                                     00024370
                                                                        00024380
    DCL TEKST         CHAR(29);                                         00024390
                                                                        00024400
    /*  LESER ROT TILNR  */                                             00024410
                                                                        00024420
    SUBSTR(ADDR(B01.PERSON(1).TILKN(1)) -> W01_HJELPE_IO,1,             00024430
           STORAGE(B01.PERSON(1).TILKN(1))) = W01_IO;                   00024440
                                                                        00024450
    SSA3_RF0PERSN.PKEY = B01.PERSON(1).TILKN(1).FNR_TILKN;              00024460
    SSA3_TILKN.PKEY    = FNRREC.FRANR;                                  00024470
                                                                        00024480
    CALL LESER_TILKN_GHU;                                               00024490
                                                                        00024500
    IF FEIL_MELD_NR      >  0            THEN                           00024510
       DO;                                                              00024520
          /* **************************************** */                00024530
          /*  DATABASEFEIL                            */                00024540
          /* **************************************** */                00024550
                                                                        00024560
          GO TO L999;                                                   00024570
       END;                                                             00024580
                                                                        00024590
    IF W02_MER_DATA THEN                                                00024600
       DO;                                                              00024610
                                                                        00024620
       SUBSTR(ADDR(B01.PERSON(1).TILKN(1)) -> W01_HJELPE_IO,1,          00024630
              STORAGE(B01.PERSON(1).TILKN(1))) = W01_IO;                00024640
                                                                        00024650
       CALL FJERNER_SEGM_DLET;                                          00024660
                                                                        00024670
       IF FEIL_MELD_NR      >  0            THEN                        00024680
          DO;                                                           00024690
             /* **************************************** */             00024700
             /*  DATABASEFEIL                            */             00024710
             /* **************************************** */             00024720
                                                                        00024730
             GO TO L999;                                                00024740
                                                                        00024750
          END;                                                          00024760
                                                                        00024770
                                                                        00024780
       B01.PERSON(1).TILKN(1).FNR_TILKN = FNRREC.SISTENR;               00024790
                                                                        00024800
       W01_HJELPE_PTR = ADDR(B01.PERSON(1).TILKN(1));                   00024810
       W01_IO = W01_HJELPE_IO;                                          00024820
                                                                        00024830
                                                                        00024840
       TEKST ='TILKN';                                                  00024850
       FNR_PIC = SSA3_RF0PERSN.PKEY;                                    00024860
       TEKST ='TILKN: ' !! SSA4_STATUS.KODE !! ' FNR ' !! FNR_CHAR;     00024870
                                                                        00024880
       CALL DANNER_TILKN_ISRT;                                          00024890
                                                                        00024900
       IF FEIL_MELD_NR      >  0            THEN                        00024910
          DO;                                                           00024920
             /* **************************************** */             00024930
             /*  DATABASEFEIL                            */             00024940
             /* **************************************** */             00024950
                                                                        00024960
             GO TO L999;                                                00024970
          END;                                                          00024980
                                                                        00024990
    END;                                                                00025000
                                                                        00025010
 END ENDRE_TILKN;                                                       00025020
                                                                        00025030
                                                                        00025040
 STATUS: PROC;                                                          00025050
                                                                        00025060
                                                                        00025070
    SSA_UQUAL = PCB1.SEGM_NAVN;                                         00025080
                                                                        00025090
    CALL DANNE_SEGM_ISRT;                                               00025100
                                                                        00025110
    IF FEIL_MELD_NR             >  0            THEN                    00025120
       DO;                                                              00025130
          /* **************************************** */                00025140
          /* DATABASEFEIL                             */                00025150
          /* **************************************** */                00025160
                                                                        00025170
          GO TO L999;                                                   00025180
       END;                                                             00025190
                                                                        00025200
                                                                        00025210
    CALL LESER_UNDER_STATUS_GNP;                                        00025220
                                                                        00025230
    IF FEIL_MELD_NR        >  0            THEN                         00025240
       DO;                                                              00025250
          /* **************************************** */                00025260
          /* DATABASEFEIL                             */                00025270
          /* **************************************** */                00025280
                                                                        00025290
          GO TO L999;                                                   00025300
       END;                                                             00025310
                                                                        00025320
    DO WHILE( W02_MER_DATA  &  W02_ISRT_OK );                           00025330
                                                                        00025340
       /* DANNER RESTEN AV SEGMENTENE */                                00025350
                                                                        00025360
       SSA_UQUAL = PCB1.SEGM_NAVN;                                      00025370
                                                                        00025380
       CALL DANNE_UNDER_STATUS_ISRT;                                    00025390
                                                                        00025400
       IF FEIL_MELD_NR          >  0            THEN                    00025410
          DO;                                                           00025420
             /* **************************************** */             00025430
             /* DATABASEFEIL                             */             00025440
             /* **************************************** */             00025450
                                                                        00025460
             GO TO L999;                                                00025470
          END;                                                          00025480
                                                                        00025490
       /* FNR MÅ ENDRES I DE TILKNYTTEDE SEGMENT I                      00025500
          " FAMILIEPAKKEN "                                 */          00025510
                                                                        00025520
       IF PCB1.SEGM_NAVN = 'TILKN   ' THEN                              00025530
          DO;                                                           00025540
                                                                        00025550
             CALL ENDRE_TILKN;                                          00025560
             CALL TRANHIST_TILKN;                                       00025570
                                                                        00025580
          END;                                                          00025590
                                                                        00025600
       CALL LESER_UNDER_STATUS_GNP;                                     00025610
                                                                        00025620
       IF FEIL_MELD_NR          >  0            THEN                    00025630
          DO;                                                           00025640
             /* **************************************** */             00025650
             /* DATABASEFEIL                             */             00025660
             /* **************************************** */             00025670
                                                                        00025680
             GO TO L999;                                                00025690
          END;                                                          00025700
                                                                        00025710
    END;                                                                00025720
                                                                        00025730
 END STATUS;                                                            00025740
                                                                        00025750
 TRANHIST: PROC;                                                        00025760
                                                                        00025770
    /* DANNER TRANHIST OG SEGMENTENE UNDER */                           00025780
                                                                        00025790
    W02_MER_DATA = '1'B;                                                00025800
                                                                        00025810
    DO WHILE( W02_MER_DATA  &  W02_ISRT_OK );                           00025820
                                                                        00025830
       SELECT ( PCB1.SEGM_NAVN );                                       00025840
                                                                        00025850
         WHEN ( 'BARN    ' )                                            00025860
           /* ********************************* */                      00025870
           /* FÅTT INN :    B A R N          */                         00025880
           /* ********************************* */                      00025890
           DO;                                                          00025900
                                                                        00025910
             IO_PEKER = ADDR(W01_IO);                                   00025920
                                                                        00025930
             IF BARN_S.FNR = FNRREC.FRANR THEN                          00025940
                BARN_S.FNR = FNRREC.SISTENR;                            00025950
                                                                        00025960
                                                                        00025970
           END;                                                         00025980
                                                                        00025990
       OTHERWISE;                                                       00026000
                                                                        00026010
       END;                                                             00026020
                                                                        00026030
       SSA_UQUAL = PCB1.SEGM_NAVN;                                      00026040
       CALL DANNE_SEGM_ISRT;                                            00026050
                                                                        00026060
       IF FEIL_MELD_NR > 0                      THEN                    00026070
          DO;                                                           00026080
             /* ********************************* */                    00026090
             /* DATABASEFEIL                      */                    00026100
             /* ********************************* */                    00026110
                                                                        00026120
             GO TO L999;                                                00026130
          END;                                                          00026140
                                                                        00026150
       CALL LESER_RESTEN_GNP;  /* LES UNDERSEGMENT */                   00026160
        IF SSA_UQUAL = PCB1.SEGM_NAVN  THEN                             00026170
           W02_MER_DATA = '0'B;                                         00026180
                                                                        00026190
       IF FEIL_MELD_NR > 0                 THEN                         00026200
          DO;                                                           00026210
             /* **************************************** */             00026220
             /* DATABASEFEIL                             */             00026230
             /* **************************************** */             00026240
                                                                        00026250
             GO TO L999;                                                00026260
          END;                                                          00026270
                                                                        00026280
    END;                                                                00026290
                                                                        00026300
                                                                        00026310
 END TRANHIST;                                                          00026320
                                                                        00026330
 TRANHIST_TILKN: PROC;                                                  00026340
                                                                        00026350
    DCL TEKST         CHAR(29);                                         00026360
                                                                        00026370
    /*       LESER ROT FRANR  */                                        00026380
                                                                        00026390
    CALL LESER_ROT_SEGM_TRANH_GU;                                       00026400
                                                                        00026410
    IF FEIL_MELD_NR      >  0   THEN                                    00026420
       DO;                                                              00026430
          /* ********************************* */                       00026440
          /*  DATABASEFEIL                     */                       00026450
          /* ********************************* */                       00026460
                                                                        00026470
          GO TO L999;                                                   00026480
       END;                                                             00026490
                                                                        00026500
    IF W02_MER_DATA             THEN                                    00026510
       DO;                                                              00026520
                                                                        00026530
         CALL LESER_TRANHIST_F_GHNP;                                    00026540
                                                                        00026550
         IF FEIL_MELD_NR >  0   THEN                                    00026560
            DO;                                                         00026570
               /* ********************************* */                  00026580
               /* DATABASEFEIL                      */                  00026590
               /* ********************************* */                  00026600
                                                                        00026610
               GO TO L999;                                              00026620
            END;                                                        00026630
                                                                        00026640
         IO_PEKER = ADDR(W01_IO);                                       00026650
                                                                        00026660
       END;                                                             00026670
                                                                        00026680
    FNR_PIC = SSA3_RF0PERSN.PKEY;                                       00026690
    TEKST ='TRANHIST ' !! FNR_CHAR;                                     00026700
                                                                        00026710
    DO WHILE( W02_MER_DATA & W02_ISRT_OK );                             00026720
                                                                        00026730
      SELECT ( PCB3.SEGM_NAVN );                                        00026740
                                                                        00026750
        WHEN ( 'TRANHIST' )                                             00026760
          /* ********************************* */                       00026770
          /*  FÅTT INN :    T R A N H I S T    */                       00026780
          /* ********************************* */                       00026790
          DO;                                                           00026800
                                                                        00026810
             SSA5_TRANHIST.VTP = TRANH_S.VTP_KEY;                       00026820
             SSA5_TRANHIST.KODE = TRANH_S.GRBLKODE;                     00026830
                                                                        00026840
          END;                                                          00026850
                                                                        00026860
        WHEN ( 'GRUNNBAP' )                                             00026870
          /* ********************************* */                       00026880
          /*  FÅTT INN :    G R U N N B A P    */                       00026890
          /* ********************************* */                       00026900
          DO;                                                           00026910
                                                                        00026920
            IF ALDER_S.FNR_EK = FNRREC.FRANR THEN                       00026930
               DO;                                                      00026940
                 ALDER_S.FNR_EK = FNRREC.SISTENR;                       00026950
                 TRANHIST_ENDRET = TRUE;                                00026960
               END;                                                     00026970
                                                                        00026980
          END;                                                          00026990
                                                                        00027000
        WHEN ( 'GRUNNBA1' )                                             00027010
          /* ********************************* */                       00027020
          /*  FÅTT INN :    G R U N N B A P    */                       00027030
          /* ********************************* */                       00027040
          DO;                                                           00027050
                                                                        00027060
            IF A1DER_S.FNR_EK = FNRREC.FRANR THEN                       00027070
               DO;                                                      00027080
                 A1DER_S.FNR_EK = FNRREC.SISTENR;                       00027090
                 TRANHIST_ENDRET = TRUE;                                00027100
               END;                                                     00027110
                                                                        00027120
          END;                                                          00027130
                                                                        00027140
        WHEN ( 'GRUNNBUP' )                                             00027150
          /* **************************************************** */    00027160
          /* FÅTT INN :  G R U N N B U P  STYRER UTENOM 'GRUNNBUF'*/    00027170
          /* **************************************************** */    00027180
          DO;                                                           00027190
            IF SSA5_TRANHIST.KODE = 'UP'        THEN                    00027200
                                                                        00027210
               IF UFØRP_S.FNR_EK = FNRREC.FRANR THEN                    00027220
                  DO;                                                   00027230
                    UFØRP_S.FNR_EK = FNRREC.SISTENR;                    00027240
                    TRANHIST_ENDRET = TRUE;                             00027250
                  END;                                                  00027260
          END;                                                          00027270
                                                                        00027280
        WHEN ( 'GRUNNBU2' )                                             00027290
          /* ********************************* */                       00027300
          /*  FÅTT INN :    G R U N N B U P    */                       00027310
          /* ********************************* */                       00027320
          DO;                                                           00027330
                                                                        00027340
            IF U2ØRP_S.FNR_EK = FNRREC.FRANR THEN                       00027350
               DO;                                                      00027360
                 U2ØRP_S.FNR_EK = FNRREC.SISTENR;                       00027370
                 TRANHIST_ENDRET = TRUE;                                00027380
               END;                                                     00027390
                                                                        00027400
          END;                                                          00027410
                                                                        00027420
        WHEN ( 'GRBLUFST' );                                            00027430
          /* ********************************* */                       00027440
          /*  FÅTT INN :    G R B L U F S T    */                       00027450
          /* ********************************* */                       00027460
                                                                        00027470
        WHEN ( 'GRBLFORS' )                                             00027480
          /* ********************************* */                       00027490
          /*  FÅTT INN :    G R B L F O R S    */                       00027500
          /* ********************************* */                       00027510
          DO;                                                           00027520
                                                                        00027530
            IF FORSØ_S.FNR_EK = FNRREC.FRANR THEN                       00027540
               DO;                                                      00027550
                 FORSØ_S.FNR_EK = FNRREC.SISTENR;                       00027560
                 TRANHIST_ENDRET = TRUE;                                00027570
               END;                                                     00027580
                                                                        00027590
          END;                                                          00027600
                                                                        00027610
        WHEN ( 'GRUNNBEP' )                                             00027620
          /* ********************************* */                       00027630
          /*  FÅTT INN :    G R U N N B E P    */                       00027640
          /* ********************************* */                       00027650
          DO;                                                           00027660
                                                                        00027670
            IF ETT_E_S.FNR_EK = FNRREC.FRANR THEN                       00027680
               DO;                                                      00027690
                 ETT_E_S.FNR_EK = FNRREC.SISTENR;                       00027700
                 TRANHIST_ENDRET = TRUE;                                00027710
               END;                                                     00027720
                                                                        00027730
          END;                                                          00027740
                                                                        00027750
        WHEN ( 'GRUNNBE3' )                                             00027760
          /* ********************************* */                       00027770
          /*  FÅTT INN :    G R U N N B E P    */                       00027780
          /* ********************************* */                       00027790
          DO;                                                           00027800
                                                                        00027810
            IF ETT_E3_S.FNR_EK = FNRREC.FRANR THEN                      00027820
               DO;                                                      00027830
                 ETT_E3_S.FNR_EK = FNRREC.SISTENR;                      00027840
                 TRANHIST_ENDRET = TRUE;                                00027850
               END;                                                     00027860
                                                                        00027870
          END;                                                          00027880
                                                                        00027890
        WHEN ( 'GRBLFAMP' );                                            00027900
          /* ********************************* */                       00027910
          /*  FÅTT INN :    G R B L F A M P    */                       00027920
          /* ********************************* */                       00027930
                                                                        00027940
        WHEN ( 'GRBLEBEN' )                                             00027950
          /* ********************************* */                       00027960
          /*  FÅTT INN :    G R B L E B E N    */                       00027970
          /* ********************************* */                       00027980
          DO;                                                           00027990
                                                                        00028000
            IF ETT_B_S.FNR_DØD = FNRREC.FRANR THEN                      00028010
               DO;                                                      00028020
                 ETT_B_S.FNR_DØD = FNRREC.SISTENR;                      00028030
                 TRANHIST_ENDRET = TRUE;                                00028040
               END;                                                     00028050
                                                                        00028060
          END;                                                          00028070
                                                                        00028080
        WHEN ( 'GRBLEBB6' )                                             00028090
          /* ********************************* */                       00028100
          /*  FÅTT INN :    G R B L E B E N    */                       00028110
          /* ********************************* */                       00028120
          DO;                                                           00028130
                                                                        00028140
            IF ETT_B6_S.FNR_DØD = FNRREC.FRANR THEN                     00028150
               DO;                                                      00028160
                 ETT_B6_S.FNR_DØD = FNRREC.SISTENR;                     00028170
                 TRANHIST_ENDRET = TRUE;                                00028180
               END;                                                     00028190
                                                                        00028200
          END;                                                          00028210
                                                                        00028220
        WHEN ( 'GRBLEBBE' )                                             00028230
          /* ********************************* */                       00028240
          /*  FÅTT INN :    G R B L E B B E    */                       00028250
          /* ********************************* */                       00028260
          DO;                                                           00028270
                                                                        00028280
            IF FOREL_S.FNR_FAR = FNRREC.FRANR THEN                      00028290
               DO;                                                      00028300
                 FOREL_S.FNR_FAR = FNRREC.SISTENR;                      00028310
                 TRANHIST_ENDRET = TRUE;                                00028320
               END;                                                     00028330
                                                                        00028340
            IF FOREL_S.FNR_MOR = FNRREC.FRANR THEN                      00028350
               DO;                                                      00028360
                 FOREL_S.FNR_MOR = FNRREC.SISTENR;                      00028370
                 TRANHIST_ENDRET = TRUE;                                00028380
               END;                                                     00028390
                                                                        00028400
          END;                                                          00028410
                                                                        00028420
        WHEN ( 'GRBLF5BE' )                                             00028430
          /* ********************************* */                       00028440
          /*  FÅTT INN :    G R B L E B B E    */                       00028450
          /* ********************************* */                       00028460
          DO;                                                           00028470
                                                                        00028480
            IF FOREL_F5_S.FNR_F   = FNRREC.FRANR THEN                   00028490
               DO;                                                      00028500
                 FOREL_F5_S.FNR_F   = FNRREC.SISTENR;                   00028510
                 TRANHIST_ENDRET = TRUE;                                00028520
               END;                                                     00028530
                                                                        00028540
            IF FOREL_S.FNR_MOR   = FNRREC.FRANR THEN                    00028550
               DO;                                                      00028560
                 FOREL_S.FNR_MOR   = FNRREC.SISTENR;                    00028570
                 TRANHIST_ENDRET = TRUE;                                00028580
               END;                                                     00028590
                                                                        00028600
          END;                                                          00028610
                                                                        00028620
        WHEN ( 'GRUNNBIF' )                                             00028630
          /* ********************************* */                       00028640
          /*  FÅTT INN :    G R B L F O R S    */                       00028650
          /* ********************************* */                       00028660
          DO;                                                           00028670
                                                                        00028680
            IF GRUIF_S.FNR_EK = FNRREC.FRANR THEN                       00028690
               DO;                                                      00028700
                 GRUIF_S.FNR_EK = FNRREC.SISTENR;                       00028710
                 TRANHIST_ENDRET = TRUE;                                00028720
               END;                                                     00028730
                                                                        00028740
          END;                                                          00028750
                                                                        00028760
        WHEN ( 'ENDRBLAN' )                                             00028770
          /* ********************************* */                       00028780
          /*  FÅTT INN :    E N D R B L A N    */                       00028790
          /* ********************************* */                       00028800
          DO;                                                           00028810
                                                                        00028820
            IF ENDRB_S.FNR_EK = FNRREC.FRANR THEN                       00028830
               DO;                                                      00028840
                 ENDRB_S.FNR_EK = FNRREC.SISTENR;                       00028850
                 TRANHIST_ENDRET = TRUE;                                00028860
               END;                                                     00028870
                                                                        00028880
          END;                                                          00028890
                                                                        00028900
        WHEN ( 'OPPHBL1 ' )                                             00028910
          /* ********************************* */                       00028920
          /*  FÅTT INN :    O P P H B L 1      */                       00028930
          /* ********************************* */                       00028940
          DO;                                                           00028950
                                                                        00028960
            IF OPPB1_S.FNR_EK = FNRREC.FRANR THEN                       00028970
               DO;                                                      00028980
                 OPPB1_S.FNR_EK = FNRREC.SISTENR;                       00028990
                 TRANHIST_ENDRET = TRUE;                                00029000
               END;                                                     00029010
                                                                        00029020
          END;                                                          00029030
                                                                        00029040
        WHEN ( 'OPPHBL2 ' );                                            00029050
          /* ********************************* */                       00029060
          /*  FÅTT INN :    O P P H B L 2      */                       00029070
          /* ********************************* */                       00029080
                                                                        00029090
        WHEN ( 'BARN    ' )                                             00029100
          /* ********************************* */                       00029110
          /*  FÅTT INN :    B A R N            */                       00029120
          /* ********************************* */                       00029130
          DO;                                                           00029140
                                                                        00029150
            IF BARN_S.FNR = FNRREC.FRANR THEN                           00029160
               DO;                                                      00029170
                 CALL FJERNER_SEGM_DLET;                                00029180
                                                                        00029190
                 IF FEIL_MELD_NR > 0       THEN                         00029200
                    DO;                                                 00029210
                       /* ************************** */                 00029220
                       /* DATABASEFEIL               */                 00029230
                       /* ************************** */                 00029240
                                                                        00029250
                       GO TO L999;                                      00029260
                    END;                                                00029270
                                                                        00029280
                 SSA_UQUAL = PCB3.SEGM_NAVN;                            00029290
                                                                        00029300
                 BARN_S.FNR = FNRREC.SISTENR;                           00029310
                                                                        00029320
                 CALL DANNER_TRANH_BARN_ISRT;                           00029330
                                                                        00029340
                 IF FEIL_MELD_NR > 0       THEN                         00029350
                    DO;                                                 00029360
                       /* ************************** */                 00029370
                       /* DATABASEFEIL               */                 00029380
                       /* ************************** */                 00029390
                                                                        00029400
                       GO TO L999;                                      00029410
                    END;                                                00029420
                                                                        00029430
               END;                                                     00029440
                                                                        00029450
          END;                                                          00029460
                                                                        00029470
        WHEN ( 'GRUNNBYP' )                                             00029480
          /* ********************************* */                       00029490
          /*  FÅTT INN :    G R U N N B Y P    */                       00029500
          /* ********************************* */                       00029510
          DO;                                                           00029520
                                                                        00029530
            IF YRKEP_S.FNR_EK = FNRREC.FRANR THEN                       00029540
               DO;                                                      00029550
                 YRKEP_S.FNR_EK = FNRREC.SISTENR;                       00029560
                 TRANHIST_ENDRET = TRUE;                                00029570
               END;                                                     00029580
                                                                        00029590
          END;                                                          00029600
                                                                        00029610
        OTHERWISE                                                       00029620
          /* ********************************* */                       00029630
          /*  FÅTT INN : ET UKJENT SEGMENT     */                       00029640
          /* ********************************* */                       00029650
          DO;                                                           00029660
  L105:                                                                 00029670
            FEIL_MELD_NR                        =  500;                 00029680
            FEIL_VED_LABEL                      = '105';                00029690
            GO TO L999;                                                 00029700
          END;                                                          00029710
                                                                        00029720
      END;/*   SELECT    :  PCB3.SEGM_NAVN     */                       00029730
                                                                        00029740
      IF TRANHIST_ENDRET THEN                                           00029750
                                                                        00029760
         DO;                                                            00029770
                                                                        00029780
           CALL DANNER_TRANH_TILKN_REPL;                                00029790
                                                                        00029800
           IF FEIL_MELD_NR >  0            THEN                         00029810
              DO;                                                       00029820
                 /* ************************** */                       00029830
                 /* DATABASEFEIL               */                       00029840
                 /* ************************** */                       00029850
                                                                        00029860
                 GO TO L999;                                            00029870
              END;                                                      00029880
                                                                        00029890
           TRANHIST_ENDRET = FALSE;                                     00029900
                                                                        00029910
         END;                                                           00029920
                                                                        00029930
    CALL LESER_TRANH_TILKN_GHNP;                                        00029940
                                                                        00029950
    IF FEIL_MELD_NR      >  0            THEN                           00029960
       DO;                                                              00029970
          /* ********************************* */                       00029980
          /*  DATABASEFEIL                     */                       00029990
          /* ********************************* */                       00030000
                                                                        00030010
          GO TO L999;                                                   00030020
       END;                                                             00030030
                                                                        00030040
                                                                        00030050
    END;                                                                00030060
                                                                        00030070
 END TRANHIST_TILKN;                                                    00030080
                                                                        00030090
 MELDINGSREC: PROC;                                                     00030100
                                                                        00030110
                                                                        00030120
    IF MELD_IO.ADRESSAT = 'S' !                                         00030130
       MELD_IO.ADRESSAT = 'V' !                                         00030140
       MELD_IO.ADRESSAT = 'U' !                                         00030150
       MELD_IO.ADRESSAT = 'X' !                                         00030160
       MELD_IO.ADRESSAT = 'R' THEN                                      00030170
       DO;                                                              00030180
                                                                        00030190
          /* IKKE LAGT UT I B02. REF. TIL INPUT SEGMENT: */             00030200
                                                                        00030210
          MELD_IO.NAVN = B01.PERSON(1).RF0PERSN.NAVN;                   00030220
          MELD_IO.TKNR = B01.PERSON(1).RF0PERSN.TKNR;                   00030230
                                                                        00030240
          SSA3_RF0PERSN.PKEY = FNRREC.FRANR;                            00030250
                                                                        00030260
          CALL LESER_STATUS_GU;                                         00030270
                                                                        00030280
                                                                        00030290
          IF FEIL_MELD_NR      >  0            THEN                     00030300
             DO;                                                        00030310
                /* **************************************** */          00030320
                /*  DATABASEFEIL                            */          00030330
                /* **************************************** */          00030340
                                                                        00030350
                GO TO L999;                                             00030360
             END;                                                       00030370
                                                                        00030380
          IF W02_MER_DATA THEN                                          00030390
             DO;                                                        00030400
                                                                        00030410
               SUBSTR(ADDR(B01.PERSON(1).STATUS) -> W01_HJELPE_IO,1,    00030420
                      STORAGE(B01.PERSON(1).STATUS)) = W01_IO;          00030430
                                                                        00030440
               MELD_IO.PK1 = B01.PERSON(1).STATUS.PENSJONSTYPE1;        00030450
                                                                        00030460
               IF MELD_IO.ADRESSAT = 'V' THEN                           00030470
                  MELD_IO.VIRKDATO =                                    00030480
                          B01.PERSON(1).STATUS.VIRK_DATO_ÅM;            00030490
               ELSE                                                     00030500
                                                                        00030510
                  MELD_IO.VIRKDATO = 0;                                 00030520
                                                                        00030530
             END;                                                       00030540
                                                                        00030550
          ELSE                                                          00030560
                                                                        00030570
             IF MELD_IO.ADRESSAT = 'U' THEN                             00030580
                MELD_IO.PK1 = 'D';                                      00030590
                                                                        00030600
             ELSE                                                       00030610
                                                                        00030620
                MELD_IO.PK1 = ' ';                                      00030630
                                                                        00030640
       END;                                                             00030650
                                                                        00030660
    ELSE     /* MELD_IO.ADRESSAT = F ! T. B02 ER LAGT UT                00030670
                                             REF TIL B02: */            00030680
       DO;                                                              00030690
          MELD_IO.NAVN = B02.PERSON(I).RF0PERSN.NAVN;                   00030700
          MELD_IO.TKNR = B02.PERSON(I).RF0PERSN.TKNR;                   00030710
          MELD_IO.PK1  = B02.PERSON(I).STATUS.PENSJONSTYPE1;            00030720
       END;                                                             00030730
                                                                        00030740
    MELD_IO.ENDRINGSDATA.KODE        = FNRREC.KODE;                     00030750
    MELD_IO.ENDRINGSDATA.FRANR       = FNRREC.FRANR;                    00030760
    MELD_IO.ENDRINGSDATA.SISTENR     = FNRREC.SISTENR;                  00030770
    MELD_IO.ENDRINGSDATA.ENDR_DATO   = FNRREC.DATO / 10;                00030780
    MELD_IO.ENDRINGSDATA.LINKNR      = FNRREC.LINKNR;                   00030790
                                                                        00030800
    IF MELD_IO.ADRESSAT = 'T' THEN                                      00030810
       MELD_IO.SORTERINGSBEGREP.TKNR = MELD_IO.TKNR;                    00030820
    ELSE                                                                00030830
       MELD_IO.SORTERINGSBEGREP.TKNR = 0;                               00030840
                                                                        00030850
    IF MELD_IO.ADRESSAT = 'S' THEN                                      00030860
       MELD_IO.SORTERINGSBEGREP.FNR = MELD_IO.ENDRINGSDATA.LINKNR;      00030870
    ELSE                                                                00030880
       /* ADRESSAT = F , R  , V ELLER T */                              00030890
                                                                        00030900
       MELD_IO.SORTERINGSBEGREP.FNR = MELD_IO.ENDRINGSDATA.FRANR;       00030910
                                                                        00030920
    EXEC CICS WRITE DATASET('MELDREC') FROM(MELD_IO)                    00030930
         RIDFLD(MELD_PEKER) RBA;                                        00030940
                                                                        00030950
 END MELDINGSREC;                                                       00030960
                                                                        00030970
                                                                        00030980
    /* ************************************************************** */00030990
    /* ************************************************************** */00031000
    /* **********                                       ************* */00031010
    /* ******        INTERNE    PROCEDURER                  ********* */00031020
    /* **********                                       ************* */00031030
    /* ************************************************************** */00031040
    /* ************************************************************** */00031050
                                                                        00031060
                                                                        00031070
                                                                        00031080
                                                                        00031090
    INIT_PCB: PROC;                                                     00031100
                                                                        00031110
       CALL PLITDLI                       (W01_PCB_FUNCTION,            00031120
                                              W01_PSB_NAVN,             00031130
                                              UIBPTR);                  00031140
                                                                        00031150
                                                                        00031160
       IF DLIUIB.UIBFCTR         ^=    UIB_RC_OK       THEN             00031170
         DO;                                                            00031180
           /* ************************** */                             00031190
           /*  FEIL I INITIERINGKALL  */                                00031200
           /* ************************** */                             00031210
                                                                        00031220
           W01_UTLINJE = 'FEIL VED INITIERINGS-KALLET :'       !!       00031230
                         '     UIBFCTR = ' !! UNSPEC (UIBFCTR) !!       00031240
                         '     UIBDLTR = ' !! UNSPEC (UIBDLTR) ;        00031250
                                                                        00031260
           EXEC CICS SEND TEXT FROM ( W01_UTLINJE )                     00031270
                          ACCUM PAGING ERASE                            00031280
                          JUSTIFY ( 14         )  ;                     00031290
           EXEC CICS SEND PAGE;                                         00031300
           EXEC CICS   RETURN;                                          00031310
                                                                        00031320
         END;                                                           00031330
                                                                        00031340
    /* ********************************************************** */    00031350
    /*                                                            */    00031360
    /*  SETTER  PCB_PEKER  =  UIBPCBAL  FRA INITIERINGS-KALLET    */    00031370
    /*                                                            */    00031380
    /* ********************************************************** */    00031390
                                                                        00031400
         PCB_UIB_PEKER_OMR.UIB_PEKER     =    UIBPTR  ;                 00031410
         PCB_UIB_PEKER_OMR.PCB_PEKER     =    UIBPCBAL;                 00031420
                                                                        00031430
                                                                        00031440
    END INIT_PCB;                                                       00031450
                                                                        00031460
                                                                        00031470
                                                                        00031480
                                                                        00031490
     %PAGE;                                                             00031500
    /* ************************************************************** */00031510
    /*                                                                */00031520
    /* PROCEDURE FOR  Å LESE NESTE SEGMENT ( GNP   UKVALIFISERT  )    */00031530
    /*                                                                */00031540
    /* ************************************************************** */00031550
                                                                        00031560
    LESER_RESTEN_GNP:                                                   00031570
      PROC;                                                             00031580
                                                                        00031590
      CALL PLITDLI                              (W02_PARM_CT_3,         00031600
                                                 W02_GNP,               00031610
                                                 PCB1,                  00031620
                                                 W01_IO);               00031630
                                                                        00031640
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00031650
        DO;                                                             00031660
          SELECT ( PCB1.STATUS_KODE );                                  00031670
            WHEN ( '  ' , 'GA' , 'GK' )                                 00031680
             DO;                                                        00031690
              W02_MER_DATA                 =    '1'B;                   00031700
             END;                                                       00031710
            WHEN ( 'GE' , 'GB' )                                        00031720
             DO;                                                        00031730
              W02_MER_DATA                 =    '0'B;                   00031740
             END;                                                       00031750
            OTHERWISE                                                   00031760
              DO;                                                       00031770
                /* ************************************************** */00031780
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00031790
                /* ************************************************** */00031800
 L110:                                                                  00031810
                                                                        00031820
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;       00031830
                FEIL_MELD_NR               =     500;                   00031840
                FEIL_VED_LABEL             =    '110';                  00031850
              END;                                                      00031860
          END;                                                          00031870
        END;                                                            00031880
      ELSE                                                              00031890
        DO;                                                             00031900
          /* ************************************************** */      00031910
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00031920
          /* ************************************************** */      00031930
 L120:                                                                  00031940
                                                                        00031950
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;             00031960
          FEIL_MELD_NR               =     500;                         00031970
          FEIL_VED_LABEL             =    '120';                        00031980
        END;                                                            00031990
    END LESER_RESTEN_GNP;                                               00032000
                                                                        00032010
                                                                        00032020
    /* ************************************************************** */00032030
    /*                                                                */00032040
    /* PROCEDURE FOR LEGGE INN SEGMENT ( ISRT   UKVALIFISERT  )       */00032050
    /*                                                                */00032060
    /* ************************************************************** */00032070
                                                                        00032080
    DANNE_SEGM_ISRT:                                                    00032090
      PROC;                                                             00032100
                                                                        00032110
      CALL PLITDLI                              (W02_PARM_CT_5,         00032120
                                                 W02_ISRT,              00032130
                                                 PCB2,                  00032140
                                                 W01_IO,                00032150
                                                 SSA2_RF0PERSN,         00032160
                                                 SSA_UQUAL);            00032170
                                                                        00032180
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00032190
        DO;                                                             00032200
          SELECT ( PCB2.STATUS_KODE );                                  00032210
            WHEN ( '  ' )                                               00032220
              W02_ISRT_OK                  =    '1'B;                   00032230
            WHEN ( 'II' )                                               00032240
              W02_ISRT_OK                  =    '0'B;                   00032250
            OTHERWISE                                                   00032260
              DO;                                                       00032270
                /* ************************************************** */00032280
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00032290
                /* ************************************************** */00032300
 L130:                                                                  00032310
                                                                        00032320
                                                                        00032330
                DB_STATUS_KODE             =    PCB2.STATUS_KODE;       00032340
                FEIL_MELD_NR               =     500;                   00032350
                FEIL_VED_LABEL             =    '130';                  00032360
              END;                                                      00032370
          END;                                                          00032380
        END;                                                            00032390
      ELSE                                                              00032400
        DO;                                                             00032410
          /* ************************************************** */      00032420
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00032430
          /* ************************************************** */      00032440
 L140:                                                                  00032450
                                                                        00032460
          DB_STATUS_KODE             =    PCB2.STATUS_KODE;             00032470
          FEIL_MELD_NR               =     500;                         00032480
          FEIL_VED_LABEL             =    '140';                        00032490
        END;                                                            00032500
    END DANNE_SEGM_ISRT;                                                00032510
                                                                        00032520
                                                                        00032530
                                                                        00032540
     %PAGE;                                                             00032550
    /* ************************************************************** */00032560
    /*                                                                */00032570
    /* PROCEDURE FOR LESE ROT SEGMENT ( GU     KVALIFISERT  )         */00032580
    /*                                                                */00032590
    /* ************************************************************** */00032600
                                                                        00032610
    LESER_ROT_SEGM_GU:                                                  00032620
      PROC;                                                             00032630
                                                                        00032640
      CALL PLITDLI                              (W02_PARM_CT_4,         00032650
                                                 W02_GU,                00032660
                                                 PCB1,                  00032670
                                                 W01_IO,                00032680
                                                 SSA1_RF0PERSN);        00032690
                                                                        00032700
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00032710
        DO;                                                             00032720
          SELECT ( PCB1.STATUS_KODE );                                  00032730
            WHEN ( '  ' )                                               00032740
              W02_MER_DATA                 =    '1'B;                   00032750
            WHEN ( 'GE' )                                               00032760
              W02_MER_DATA                 =    '0'B;                   00032770
            OTHERWISE                                                   00032780
              DO;                                                       00032790
                /* ************************************************** */00032800
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00032810
                /* ************************************************** */00032820
 L150:                                                                  00032830
                                                                        00032840
                                                                        00032850
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;       00032860
                FEIL_MELD_NR               =     500;                   00032870
                FEIL_VED_LABEL             =    '150';                  00032880
              END;                                                      00032890
          END;                                                          00032900
        END;                                                            00032910
      ELSE                                                              00032920
        DO;                                                             00032930
          /* ************************************************** */      00032940
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00032950
          /* ************************************************** */      00032960
 L160:                                                                  00032970
                                                                        00032980
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;             00032990
          FEIL_MELD_NR               =     500;                         00033000
          FEIL_VED_LABEL             =    '160';                        00033010
        END;                                                            00033020
    END LESER_ROT_SEGM_GU;                                              00033030
                                                                        00033040
                                                                        00033050
     %PAGE;                                                             00033060
    /* ************************************************************** */00033070
    /*                                                                */00033080
    /* PROCEDURE FOR LESE ROT SEGMENT ( GHU    KVALIFISERT  )         */00033090
    /*                                                                */00033100
    /* ************************************************************** */00033110
                                                                        00033120
    LESER_ROT_SEGM_GHU:                                                 00033130
      PROC;                                                             00033140
                                                                        00033150
      CALL PLITDLI                              (W02_PARM_CT_4,         00033160
                                                 W02_GHU,               00033170
                                                 PCB1,                  00033180
                                                 W01_IO,                00033190
                                                 SSA1_RF0PERSN);        00033200
                                                                        00033210
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00033220
        DO;                                                             00033230
          SELECT ( PCB1.STATUS_KODE );                                  00033240
            WHEN ( '  ' )                                               00033250
              W02_MER_DATA                 =    '1'B;                   00033260
            WHEN ( 'GE' )                                               00033270
              W02_MER_DATA                 =    '0'B;                   00033280
            OTHERWISE                                                   00033290
              DO;                                                       00033300
                /* ************************************************** */00033310
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00033320
                /* ************************************************** */00033330
 L170:                                                                  00033340
                                                                        00033350
                                                                        00033360
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;       00033370
                FEIL_MELD_NR               =     500;                   00033380
                FEIL_VED_LABEL             =    '170';                  00033390
              END;                                                      00033400
          END;                                                          00033410
        END;                                                            00033420
      ELSE                                                              00033430
        DO;                                                             00033440
          /* ************************************************** */      00033450
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00033460
          /* ************************************************** */      00033470
 L180:                                                                  00033480
                                                                        00033490
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;             00033500
          FEIL_MELD_NR               =     500;                         00033510
          FEIL_VED_LABEL             =    '180';                        00033520
        END;                                                            00033530
    END LESER_ROT_SEGM_GHU;                                             00033540
                                                                        00033550
                                                                        00033560
     %PAGE;                                                             00033570
    /* ************************************************************** */00033580
    /*                                                                */00033590
    /* PROCEDURE FOR FJERNE ALLE SEGMENTER ( DLET )                   */00033600
    /*                                                                */00033610
    /* ************************************************************** */00033620
                                                                        00033630
    FJERNER_ALLE_SEGM_DLET:                                             00033640
      PROC;                                                             00033650
                                                                        00033660
      CALL PLITDLI                              (W02_PARM_CT_3,         00033670
                                                 W02_DLET,              00033680
                                                 PCB1,                  00033690
                                                 W01_IO);               00033700
                                                                        00033710
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00033720
        DO;                                                             00033730
          SELECT ( PCB1.STATUS_KODE );                                  00033740
            WHEN ( '  ' )                                               00033750
              W02_DLET_OK                  =    '1'B;                   00033760
            WHEN ( 'DJ' )                                               00033770
              W02_DLET_OK                  =    '1'B;                   00033780
            OTHERWISE                                                   00033790
              DO;                                                       00033800
                /* ************************************************** */00033810
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00033820
                /* ************************************************** */00033830
 L190:                                                                  00033840
                                                                        00033850
                                                                        00033860
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;       00033870
                FEIL_MELD_NR               =     500;                   00033880
                FEIL_VED_LABEL             =    '190';                  00033890
              END;                                                      00033900
          END;                                                          00033910
        END;                                                            00033920
      ELSE                                                              00033930
        DO;                                                             00033940
          /* ************************************************** */      00033950
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00033960
          /* ************************************************** */      00033970
 L200:                                                                  00033980
                                                                        00033990
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;             00034000
          FEIL_MELD_NR               =     500;                         00034010
          FEIL_VED_LABEL             =    '200';                        00034020
        END;                                                            00034030
    END FJERNER_ALLE_SEGM_DLET;                                         00034040
                                                                        00034050
                                                                        00034060
                                                                        00034070
     %PAGE;                                                             00034080
    /* ************************************************************** */00034090
    /*                                                                */00034100
    /* PROCEDURE FOR Å LESE ROT SEGMENT ( GHU    KVALIFISERT  )       */00034110
    /*                                                                */00034120
    /* ************************************************************** */00034130
                                                                        00034140
    LESER_TILKN_GHU:                                                    00034150
      PROC;                                                             00034160
                                                                        00034170
      CALL PLITDLI                              (W02_PARM_CT_6,         00034180
                                                 W02_GHU,               00034190
                                                 PCB3,                  00034200
                                                 W01_IO,                00034210
                                                 SSA3_RF0PERSN,         00034220
                                                 SSA4_STATUS,           00034230
                                                 SSA3_TILKN);           00034240
                                                                        00034250
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00034260
        DO;                                                             00034270
          SELECT ( PCB3.STATUS_KODE );                                  00034280
            WHEN ( '  ' )                                               00034290
              W02_MER_DATA                 =    '1'B;                   00034300
            WHEN ( 'GE' )                                               00034310
              W02_MER_DATA                 =    '0'B;                   00034320
            OTHERWISE                                                   00034330
              DO;                                                       00034340
                /* ************************************************** */00034350
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00034360
                /* ************************************************** */00034370
 L210:                                                                  00034380
                                                                        00034390
                                                                        00034400
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;       00034410
                FEIL_MELD_NR               =     500;                   00034420
                FEIL_VED_LABEL             =    '210';                  00034430
              END;                                                      00034440
          END;                                                          00034450
        END;                                                            00034460
      ELSE                                                              00034470
        DO;                                                             00034480
          /* ************************************************** */      00034490
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00034500
          /* ************************************************** */      00034510
 L220:                                                                  00034520
                                                                        00034530
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;             00034540
          FEIL_MELD_NR               =     500;                         00034550
          FEIL_VED_LABEL             =    '220';                        00034560
        END;                                                            00034570
                                                                        00034580
                                                                        00034590
    END LESER_TILKN_GHU;                                                00034600
                                                                        00034610
                                                                        00034620
                                                                        00034630
                                                                        00034640
     %PAGE;                                                             00034650
    /* ************************************************************** */00034660
    /*                                                                */00034670
    /* PROCEDURE FOR FJERNE TILKN. SEGM DLET                          */00034680
    /*                                                                */00034690
    /* ************************************************************** */00034700
                                                                        00034710
    FJERNER_SEGM_DLET:                                                  00034720
      PROC;                                                             00034730
                                                                        00034740
      CALL PLITDLI                              (W02_PARM_CT_3,         00034750
                                                 W02_DLET,              00034760
                                                 PCB3,                  00034770
                                                 W01_IO);               00034780
                                                                        00034790
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00034800
        DO;                                                             00034810
          SELECT ( PCB3.STATUS_KODE );                                  00034820
            WHEN ( '  ' )                                               00034830
              W02_DLET_OK                  =    '1'B;                   00034840
            WHEN ( 'DJ' )                                               00034850
              W02_DLET_OK                  =    '1'B;                   00034860
            OTHERWISE                                                   00034870
              DO;                                                       00034880
                /* ************************************************** */00034890
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00034900
                /* ************************************************** */00034910
 L230:                                                                  00034920
                                                                        00034930
                                                                        00034940
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;       00034950
                FEIL_MELD_NR               =     500;                   00034960
                FEIL_VED_LABEL             =    '230';                  00034970
              END;                                                      00034980
          END;                                                          00034990
        END;                                                            00035000
      ELSE                                                              00035010
        DO;                                                             00035020
          /* ************************************************** */      00035030
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00035040
          /* ************************************************** */      00035050
 L240:                                                                  00035060
                                                                        00035070
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;             00035080
          FEIL_MELD_NR               =     500;                         00035090
          FEIL_VED_LABEL             =    '240';                        00035100
        END;                                                            00035110
                                                                        00035120
                                                                        00035130
    END FJERNER_SEGM_DLET;                                              00035140
                                                                        00035150
                                                                        00035160
                                                                        00035170
     %PAGE;                                                             00035180
    /* ************************************************************** */00035190
    /*                                                                */00035200
    /* PROCEDURE FOR Å DANNE TILKN SEGM ISRT                          */00035210
    /*                                                                */00035220
    /* ************************************************************** */00035230
                                                                        00035240
    DANNER_TILKN_ISRT:                                                  00035250
      PROC;                                                             00035260
                                                                        00035270
      CALL PLITDLI                              (W02_PARM_CT_6,         00035280
                                                 W02_ISRT,              00035290
                                                 PCB3,                  00035300
                                                 W01_IO,                00035310
                                                 SSA3_RF0PERSN,         00035320
                                                 SSA4_STATUS,           00035330
                                                 SSA3_TILKN_UQUAL);     00035340
                                                                        00035350
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00035360
        DO;                                                             00035370
          SELECT ( PCB3.STATUS_KODE );                                  00035380
            WHEN ( '  ' )                                               00035390
              W02_ISRT_OK                  =    '1'B;                   00035400
            WHEN ( 'II' )                                               00035410
              W02_ISRT_OK                  =    '0'B;                   00035420
            OTHERWISE                                                   00035430
              DO;                                                       00035440
                /* ************************************************** */00035450
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00035460
                /* ************************************************** */00035470
 L250:                                                                  00035480
                                                                        00035490
                                                                        00035500
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;       00035510
                FEIL_MELD_NR               =     500;                   00035520
                FEIL_VED_LABEL             =    '250';                  00035530
              END;                                                      00035540
          END;                                                          00035550
        END;                                                            00035560
      ELSE                                                              00035570
        DO;                                                             00035580
          /* ************************************************** */      00035590
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00035600
          /* ************************************************** */      00035610
 L260:                                                                  00035620
                                                                        00035630
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;             00035640
          FEIL_MELD_NR               =     500;                         00035650
          FEIL_VED_LABEL             =    '260';                        00035660
        END;                                                            00035670
                                                                        00035680
                                                                        00035690
    END DANNER_TILKN_ISRT;                                              00035700
                                                                        00035710
                                                                        00035720
                                                                        00035730
                                                                        00035740
     %PAGE;                                                             00035750
    /* ************************************************************** */00035760
    /*                                                                */00035770
    /* PROCEDURE FOR Å LESE STATUS SEGM ( GU     KVALIFISERT  )       */00035780
    /*                                                                */00035790
    /* ************************************************************** */00035800
                                                                        00035810
    LESER_STATUS_GU:                                                    00035820
      PROC;                                                             00035830
                                                                        00035840
      CALL PLITDLI                              (W02_PARM_CT_5,         00035850
                                                 W02_GU,                00035860
                                                 PCB1,                  00035870
                                                 W01_IO,                00035880
                                                 SSA3_RF0PERSN,         00035890
                                                 SSA3_STATUS);          00035900
                                                                        00035910
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00035920
        DO;                                                             00035930
          SELECT ( PCB1.STATUS_KODE );                                  00035940
            WHEN ( '  ' )                                               00035950
              W02_MER_DATA                 =    '1'B;                   00035960
            WHEN ( 'GE' )                                               00035970
              W02_MER_DATA                 =    '0'B;                   00035980
            OTHERWISE                                                   00035990
              DO;                                                       00036000
                /* ************************************************** */00036010
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00036020
                /* ************************************************** */00036030
 L270:                                                                  00036040
                                                                        00036050
                                                                        00036060
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;       00036070
                FEIL_MELD_NR               =     500;                   00036080
                FEIL_VED_LABEL             =    '270';                  00036090
              END;                                                      00036100
          END;                                                          00036110
        END;                                                            00036120
      ELSE                                                              00036130
        DO;                                                             00036140
          /* ************************************************** */      00036150
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00036160
          /* ************************************************** */      00036170
 L280:                                                                  00036180
                                                                        00036190
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;             00036200
          FEIL_MELD_NR               =     500;                         00036210
          FEIL_VED_LABEL             =    '280';                        00036220
        END;                                                            00036230
                                                                        00036240
                                                                        00036250
    END LESER_STATUS_GU;                                                00036260
                                                                        00036270
                                                                        00036280
                                                                        00036290
     %PAGE;                                                             00036300
    /* ************************************************************** */00036310
    /*                                                                */00036320
    /* PROCEDURE FOR Å LESE ROT SEGMENT ( GHU    KVALIFISERT  )       */00036330
    /*                                                                */00036340
    /* ************************************************************** */00036350
                                                                        00036360
    LESER_TILKN_GNP:                                                    00036370
      PROC;                                                             00036380
                                                                        00036390
      CALL PLITDLI                              (W02_PARM_CT_4,         00036400
                                                 W02_GNP,               00036410
                                                 PCB1,                  00036420
                                                 W01_IO,                00036430
                                                 SSA3_TILKN);           00036440
                                                                        00036450
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00036460
        DO;                                                             00036470
          SELECT ( PCB1.STATUS_KODE );                                  00036480
            WHEN ( '  ' )                                               00036490
              W02_MER_DATA                 =    '1'B;                   00036500
            WHEN ( 'GE' )                                               00036510
              W02_MER_DATA                 =    '0'B;                   00036520
            OTHERWISE                                                   00036530
              DO;                                                       00036540
                /* ************************************************** */00036550
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00036560
                /* ************************************************** */00036570
 L290:                                                                  00036580
                                                                        00036590
                                                                        00036600
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;       00036610
                FEIL_MELD_NR               =     500;                   00036620
                FEIL_VED_LABEL             =    '290';                  00036630
              END;                                                      00036640
          END;                                                          00036650
        END;                                                            00036660
      ELSE                                                              00036670
        DO;                                                             00036680
          /* ************************************************** */      00036690
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00036700
          /* ************************************************** */      00036710
 L300:                                                                  00036720
                                                                        00036730
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;             00036740
          FEIL_MELD_NR               =     500;                         00036750
          FEIL_VED_LABEL             =    '300';                        00036760
        END;                                                            00036770
                                                                        00036780
                                                                        00036790
    END LESER_TILKN_GNP;                                                00036800
                                                                        00036810
                                                                        00036820
                                                                        00036830
     %PAGE;                                                             00036840
    /* ************************************************************** */00036850
    /*                                                                */00036860
    /* PROCEDURE FOR Å LESE STATUS SEGM ( GNP    KVALIFISERT  )       */00036870
    /*                                                                */00036880
    /* ************************************************************** */00036890
                                                                        00036900
    LESER_NEST_SISTE_STATUS_GNP:                                        00036910
      PROC;                                                             00036920
                                                                        00036930
      CALL PLITDLI                              (W02_PARM_CT_4,         00036940
                                                 W02_GNP,               00036950
                                                 PCB1,                  00036960
                                                 W01_IO,                00036970
                                                 SSA3_STATUS_L);        00036980
                                                                        00036990
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00037000
        DO;                                                             00037010
          SELECT ( PCB1.STATUS_KODE );                                  00037020
            WHEN ( '  ' )                                               00037030
              W02_MER_DATA                 =    '1'B;                   00037040
            WHEN ( 'GE' )                                               00037050
              W02_MER_DATA                 =    '0'B;                   00037060
            OTHERWISE                                                   00037070
              DO;                                                       00037080
                /* ************************************************** */00037090
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00037100
                /* ************************************************** */00037110
 L310:                                                                  00037120
                                                                        00037130
                                                                        00037140
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;       00037150
                FEIL_MELD_NR               =     500;                   00037160
                FEIL_VED_LABEL             =    '310';                  00037170
              END;                                                      00037180
          END;                                                          00037190
        END;                                                            00037200
      ELSE                                                              00037210
        DO;                                                             00037220
          /* ************************************************** */      00037230
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00037240
          /* ************************************************** */      00037250
 L315:                                                                  00037260
                                                                        00037270
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;             00037280
          FEIL_MELD_NR               =     500;                         00037290
          FEIL_VED_LABEL             =    '315';                        00037300
                                                                        00037310
        END;                                                            00037320
                                                                        00037330
    END LESER_NEST_SISTE_STATUS_GNP;                                    00037340
                                                                        00037350
                                                                        00037360
                                                                        00037370
     %PAGE;                                                             00037380
    /* ************************************************************** */00037390
    /*                                                                */00037400
    /* PROCEDURE FOR Å LESE STATUS SEGM ( GNP    KVALIFISERT  )       */00037410
    /*                                                                */00037420
    /* ************************************************************** */00037430
                                                                        00037440
    LESER_SISTE_STATUS_GNP:                                             00037450
      PROC;                                                             00037460
                                                                        00037470
      CALL PLITDLI                              (W02_PARM_CT_4,         00037480
                                                 W02_GNP,               00037490
                                                 PCB1,                  00037500
                                                 W01_IO,                00037510
                                                 SSA3_STATUS_F);        00037520
                                                                        00037530
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00037540
        DO;                                                             00037550
          SELECT ( PCB1.STATUS_KODE );                                  00037560
            WHEN ( '  ' )                                               00037570
              W02_MER_DATA                 =    '1'B;                   00037580
            WHEN ( 'GE' )                                               00037590
              W02_MER_DATA                 =    '0'B;                   00037600
            OTHERWISE                                                   00037610
              DO;                                                       00037620
                /* ************************************************** */00037630
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00037640
                /* ************************************************** */00037650
 L320:                                                                  00037660
                                                                        00037670
                                                                        00037680
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;       00037690
                FEIL_MELD_NR               =     500;                   00037700
                FEIL_VED_LABEL             =    '320';                  00037710
              END;                                                      00037720
          END;                                                          00037730
        END;                                                            00037740
      ELSE                                                              00037750
        DO;                                                             00037760
          /* ************************************************** */      00037770
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00037780
          /* ************************************************** */      00037790
 L330:                                                                  00037800
                                                                        00037810
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;             00037820
          FEIL_MELD_NR               =     500;                         00037830
          FEIL_VED_LABEL             =    '330';                        00037840
                                                                        00037850
        END;                                                            00037860
                                                                        00037870
    END LESER_SISTE_STATUS_GNP;                                         00037880
                                                                        00037890
                                                                        00037900
     %PAGE;                                                             00037910
    /* ************************************************************** */00037920
    /*                                                                */00037930
    /* PROCEDURE FOR  Å LESE NESTE SEGMENT ( GNP   UKVALIFISERT  )    */00037940
    /*                                                                */00037950
    /* ************************************************************** */00037960
                                                                        00037970
    LESER_UNDER_STATUS_GNP:                                             00037980
      PROC;                                                             00037990
                                                                        00038000
      CALL PLITDLI                              (W02_PARM_CT_3,         00038010
                                                 W02_GNP,               00038020
                                                 PCB1,                  00038030
                                                 W01_IO);               00038040
                                                                        00038050
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00038060
        DO;                                                             00038070
          SELECT ( PCB1.STATUS_KODE );                                  00038080
            WHEN ( '  ' , 'GA' , 'GK' )                                 00038090
              DO;                                                       00038100
                 W02_MER_DATA              =    '1'B;                   00038110
                                                                        00038120
                 SELECT ( PCB1.SEGM_NAVN );                             00038130
                   WHEN ( 'STATUS  ' )                                  00038140
                     W02_MER_DATA          =    '0'B;                   00038150
                   WHEN ( 'TRANHIST' )                                  00038160
                     W02_MER_DATA          =    '0'B;                   00038170
                   OTHERWISE;                                           00038180
                                                                        00038190
                 END;                                                   00038200
              END;                                                      00038210
                                                                        00038220
            WHEN ( 'GE' , 'GB' )                                        00038230
              W02_MER_DATA                 =    '0'B;                   00038240
            OTHERWISE                                                   00038250
              DO;                                                       00038260
                /* ************************************************** */00038270
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00038280
                /* ************************************************** */00038290
 L340:                                                                  00038300
                                                                        00038310
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;       00038320
                FEIL_MELD_NR               =     500;                   00038330
                FEIL_VED_LABEL             =    '340';                  00038340
              END;                                                      00038350
          END;                                                          00038360
        END;                                                            00038370
      ELSE                                                              00038380
        DO;                                                             00038390
          /* ************************************************** */      00038400
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00038410
          /* ************************************************** */      00038420
 L350:                                                                  00038430
                                                                        00038440
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;             00038450
          FEIL_MELD_NR               =     500;                         00038460
          FEIL_VED_LABEL             =    '350';                        00038470
        END;                                                            00038480
    END LESER_UNDER_STATUS_GNP;                                         00038490
                                                                        00038500
                                                                        00038510
    /* ************************************************************** */00038520
    /*                                                                */00038530
    /* PROCEDURE FOR LEGGE INN SEGMENT ( ISRT   UKVALIFISERT  )       */00038540
    /*                                                                */00038550
    /* ************************************************************** */00038560
                                                                        00038570
    DANNE_UNDER_STATUS_ISRT:                                            00038580
      PROC;                                                             00038590
                                                                        00038600
      CALL PLITDLI                              (W02_PARM_CT_6,         00038610
                                                 W02_ISRT,              00038620
                                                 PCB2,                  00038630
                                                 W01_IO,                00038640
                                                 SSA2_RF0PERSN,         00038650
                                                 SSA4_STATUS,           00038660
                                                 SSA_UQUAL);            00038670
                                                                        00038680
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00038690
        DO;                                                             00038700
          SELECT ( PCB2.STATUS_KODE );                                  00038710
            WHEN ( '  ' )                                               00038720
              W02_ISRT_OK                  =    '1'B;                   00038730
            WHEN ( 'II' )                                               00038740
              W02_ISRT_OK                  =    '0'B;                   00038750
            OTHERWISE                                                   00038760
              DO;                                                       00038770
                /* ************************************************** */00038780
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00038790
                /* ************************************************** */00038800
 L360:                                                                  00038810
                                                                        00038820
                                                                        00038830
                DB_STATUS_KODE             =    PCB2.STATUS_KODE;       00038840
                FEIL_MELD_NR               =     500;                   00038850
                FEIL_VED_LABEL             =    '360';                  00038860
              END;                                                      00038870
          END;                                                          00038880
        END;                                                            00038890
      ELSE                                                              00038900
        DO;                                                             00038910
          /* ************************************************** */      00038920
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00038930
          /* ************************************************** */      00038940
 L370:                                                                  00038950
                                                                        00038960
          DB_STATUS_KODE             =    PCB2.STATUS_KODE;             00038970
          FEIL_MELD_NR               =     500;                         00038980
          FEIL_VED_LABEL             =    '370';                        00038990
        END;                                                            00039000
    END DANNE_UNDER_STATUS_ISRT;                                        00039010
                                                                        00039020
    /* ************************************************************** */00039030
    /*                                                                */00039040
    /* PROCEDURE FOR Å LESE TRANH  SEGM ( GNP    KVALIFISERT  )       */00039050
    /*                                                                */00039060
    /* ************************************************************** */00039070
                                                                        00039080
    LESER_TRANHIST_GNP:                                                 00039090
      PROC;                                                             00039100
                                                                        00039110
      CALL PLITDLI                              (W02_PARM_CT_4,         00039120
                                                 W02_GNP,               00039130
                                                 PCB1,                  00039140
                                                 W01_IO,                00039150
                                                 SSA3_TRANHIST_F);      00039160
                                                                        00039170
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00039180
        DO;                                                             00039190
          SELECT ( PCB1.STATUS_KODE );                                  00039200
            WHEN ( '  ' )                                               00039210
              W02_MER_DATA                 =    '1'B;                   00039220
            WHEN ( 'GE' )                                               00039230
              W02_MER_DATA                 =    '0'B;                   00039240
            OTHERWISE                                                   00039250
              DO;                                                       00039260
                /* ************************************************** */00039270
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00039280
                /* ************************************************** */00039290
 L380:                                                                  00039300
                                                                        00039310
                                                                        00039320
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;       00039330
                FEIL_MELD_NR               =     500;                   00039340
                FEIL_VED_LABEL             =    '380';                  00039350
              END;                                                      00039360
          END;                                                          00039370
        END;                                                            00039380
      ELSE                                                              00039390
        DO;                                                             00039400
          /* ************************************************** */      00039410
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00039420
          /* ************************************************** */      00039430
 L390:                                                                  00039440
                                                                        00039450
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;             00039460
          FEIL_MELD_NR               =     500;                         00039470
          FEIL_VED_LABEL             =    '390';                        00039480
                                                                        00039490
        END;                                                            00039500
                                                                        00039510
    END LESER_TRANHIST_GNP;                                             00039520
                                                                        00039530
                                                                        00039540
                                                                        00039550
    /* ************************************************************** */00039560
    /*                                                                */00039570
    /* PROCEDURE FOR LEGGE INN SEGMENT ( ISRT   UKVALIFISERT  )       */00039580
    /*                                                                */00039590
    /* ************************************************************** */00039600
                                                                        00039610
    DANNE_ROT_SEGM_ISRT:                                                00039620
      PROC;                                                             00039630
                                                                        00039640
      CALL PLITDLI                              (W02_PARM_CT_4,         00039650
                                                 W02_ISRT,              00039660
                                                 PCB2,                  00039670
                                                 W01_IO,                00039680
                                                 SSA_UQUAL);            00039690
                                                                        00039700
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00039710
        DO;                                                             00039720
          SELECT ( PCB2.STATUS_KODE );                                  00039730
            WHEN ( '  ' )                                               00039740
              W02_ISRT_OK                  =    '1'B;                   00039750
            WHEN ( 'II' )                                               00039760
              W02_ISRT_OK                  =    '0'B;                   00039770
            OTHERWISE                                                   00039780
              DO;                                                       00039790
                /* ************************************************** */00039800
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00039810
                /* ************************************************** */00039820
 L400:                                                                  00039830
                                                                        00039840
                                                                        00039850
                DB_STATUS_KODE             =    PCB2.STATUS_KODE;       00039860
                FEIL_MELD_NR               =     500;                   00039870
                FEIL_VED_LABEL             =    '400';                  00039880
              END;                                                      00039890
          END;                                                          00039900
        END;                                                            00039910
      ELSE                                                              00039920
        DO;                                                             00039930
          /* ************************************************** */      00039940
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00039950
          /* ************************************************** */      00039960
 L410:                                                                  00039970
                                                                        00039980
          DB_STATUS_KODE             =    PCB2.STATUS_KODE;             00039990
          FEIL_MELD_NR               =     500;                         00040000
          FEIL_VED_LABEL             =    '410';                        00040010
        END;                                                            00040020
    END DANNE_ROT_SEGM_ISRT;                                            00040030
                                                                        00040040
                                                                        00040050
                                                                        00040060
    /* ************************************************************** */00040070
    /*                                                                */00040080
    /* PROCEDURE FOR  Å LESE NESTE SEGMENT ( GNP   UKVALIFISERT  )    */00040090
    /*                                                                */00040100
    /* ************************************************************** */00040110
                                                                        00040120
    LESER_TRANH_TILKN_GHNP:                                             00040130
      PROC;                                                             00040140
                                                                        00040150
      CALL PLITDLI                              (W02_PARM_CT_3,         00040160
                                                 W02_GHNP,              00040170
                                                 PCB3,                  00040180
                                                 W01_IO);               00040190
                                                                        00040200
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00040210
        DO;                                                             00040220
          SELECT ( PCB3.STATUS_KODE );                                  00040230
            WHEN ( '  ' , 'GA' , 'GK' )                                 00040240
              W02_MER_DATA                 =    '1'B;                   00040250
            WHEN ( 'GE' , 'GB' )                                        00040260
              W02_MER_DATA                 =    '0'B;                   00040270
            OTHERWISE                                                   00040280
              DO;                                                       00040290
                /* ************************************************** */00040300
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00040310
                /* ************************************************** */00040320
 L420:                                                                  00040330
                                                                        00040340
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;       00040350
                FEIL_MELD_NR               =     500;                   00040360
                FEIL_VED_LABEL             =    '420';                  00040370
              END;                                                      00040380
          END;                                                          00040390
        END;                                                            00040400
      ELSE                                                              00040410
        DO;                                                             00040420
          /* ************************************************** */      00040430
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00040440
          /* ************************************************** */      00040450
 L430:                                                                  00040460
                                                                        00040470
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;             00040480
          FEIL_MELD_NR               =     500;                         00040490
          FEIL_VED_LABEL             =    '430';                        00040500
        END;                                                            00040510
    END LESER_TRANH_TILKN_GHNP;                                         00040520
                                                                        00040530
                                                                        00040540
    /* ************************************************************** */00040550
    /*                                                                */00040560
    /* PROCEDURE FOR LEGGE INN SEGMENT ( ISRT   UKVALIFISERT  )       */00040570
    /*                                                                */00040580
    /* ************************************************************** */00040590
                                                                        00040600
    DANNER_TRANH_TILKN_REPL:                                            00040610
      PROC;                                                             00040620
                                                                        00040630
      CALL PLITDLI                              (W02_PARM_CT_3,         00040640
                                                 W02_REPL,              00040650
                                                 PCB3,                  00040660
                                                 W01_IO);               00040670
                                                                        00040680
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00040690
        DO;                                                             00040700
          SELECT ( PCB3.STATUS_KODE );                                  00040710
            WHEN ( '  ' )                                               00040720
              W02_REPL_OK                  =    '1'B;                   00040730
            OTHERWISE                                                   00040740
              DO;                                                       00040750
                /* ************************************************** */00040760
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00040770
                /* ************************************************** */00040780
 L440:                                                                  00040790
                                                                        00040800
                                                                        00040810
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;       00040820
                FEIL_MELD_NR               =     500;                   00040830
                FEIL_VED_LABEL             =    '440';                  00040840
              END;                                                      00040850
          END;                                                          00040860
        END;                                                            00040870
      ELSE                                                              00040880
        DO;                                                             00040890
          /* ************************************************** */      00040900
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00040910
          /* ************************************************** */      00040920
 L450:                                                                  00040930
                                                                        00040940
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;             00040950
          FEIL_MELD_NR               =     500;                         00040960
          FEIL_VED_LABEL             =    '450';                        00040970
        END;                                                            00040980
    END DANNER_TRANH_TILKN_REPL;                                        00040990
                                                                        00041000
                                                                        00041010
                                                                        00041020
     %PAGE;                                                             00041030
    /* ************************************************************** */00041040
    /*                                                                */00041050
    /* PROCEDURE FOR LESE ROT SEGMENT ( GU     KVALIFISERT  )         */00041060
    /*                                                                */00041070
    /* ************************************************************** */00041080
                                                                        00041090
    LESER_ROT_SEGM_TRANH_GU:                                            00041100
      PROC;                                                             00041110
                                                                        00041120
      CALL PLITDLI                              (W02_PARM_CT_4,         00041130
                                                 W02_GU,                00041140
                                                 PCB3,                  00041150
                                                 W01_IO,                00041160
                                                 SSA3_RF0PERSN);        00041170
                                                                        00041180
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00041190
        DO;                                                             00041200
          SELECT ( PCB3.STATUS_KODE );                                  00041210
            WHEN ( '  ' )                                               00041220
              W02_MER_DATA                 =    '1'B;                   00041230
            WHEN ( 'GE' )                                               00041240
              W02_MER_DATA                 =    '0'B;                   00041250
            OTHERWISE                                                   00041260
              DO;                                                       00041270
                /* ************************************************** */00041280
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00041290
                /* ************************************************** */00041300
 L460:                                                                  00041310
                                                                        00041320
                                                                        00041330
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;       00041340
                FEIL_MELD_NR               =     500;                   00041350
                FEIL_VED_LABEL             =    '460';                  00041360
              END;                                                      00041370
          END;                                                          00041380
        END;                                                            00041390
      ELSE                                                              00041400
        DO;                                                             00041410
          /* ************************************************** */      00041420
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00041430
          /* ************************************************** */      00041440
 L470:                                                                  00041450
                                                                        00041460
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;             00041470
          FEIL_MELD_NR               =     500;                         00041480
          FEIL_VED_LABEL             =    '470';                        00041490
        END;                                                            00041500
    END LESER_ROT_SEGM_TRANH_GU;                                        00041510
                                                                        00041520
                                                                        00041530
                                                                        00041540
     %PAGE;                                                             00041550
    /* ************************************************************** */00041560
    /*                                                                */00041570
    /* PROCEDURE FOR Å DANNE BARN UNDER TRANHIST                      */00041580
    /*                                                                */00041590
    /* ************************************************************** */00041600
                                                                        00041610
    DANNER_TRANH_BARN_ISRT:                                             00041620
      PROC;                                                             00041630
                                                                        00041640
      CALL PLITDLI                              (W02_PARM_CT_6,         00041650
                                                 W02_ISRT,              00041660
                                                 PCB3,                  00041670
                                                 W01_IO,                00041680
                                                 SSA3_RF0PERSN,         00041690
                                                 SSA5_TRANHIST,         00041700
                                                 SSA_UQUAL);            00041710
                                                                        00041720
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00041730
        DO;                                                             00041740
          SELECT ( PCB3.STATUS_KODE );                                  00041750
            WHEN ( '  ' )                                               00041760
              W02_ISRT_OK                  =    '1'B;                   00041770
            WHEN ( 'II' )                                               00041780
              W02_ISRT_OK                  =    '0'B;                   00041790
            OTHERWISE                                                   00041800
              DO;                                                       00041810
                /* ************************************************** */00041820
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00041830
                /* ************************************************** */00041840
 L480:                                                                  00041850
                                                                        00041860
                                                                        00041870
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;       00041880
                FEIL_MELD_NR               =     500;                   00041890
                FEIL_VED_LABEL             =    '480';                  00041900
              END;                                                      00041910
          END;                                                          00041920
        END;                                                            00041930
      ELSE                                                              00041940
        DO;                                                             00041950
          /* ************************************************** */      00041960
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00041970
          /* ************************************************** */      00041980
 L490:                                                                  00041990
                                                                        00042000
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;             00042010
          FEIL_MELD_NR               =     500;                         00042020
          FEIL_VED_LABEL             =    '490';                        00042030
        END;                                                            00042040
    END DANNER_TRANH_BARN_ISRT;                                         00042050
                                                                        00042060
                                                                        00042070
    /* ************************************************************** */00042080
    /*                                                                */00042090
    /* PROCEDURE FOR Å LESE TRANH  SEGM ( GHNP   KVALIFISERT  )       */00042100
    /*                                                                */00042110
    /* ************************************************************** */00042120
                                                                        00042130
    LESER_TRANHIST_F_GHNP:                                              00042140
      PROC;                                                             00042150
                                                                        00042160
      CALL PLITDLI                              (W02_PARM_CT_4,         00042170
                                                 W02_GHNP,              00042180
                                                 PCB3,                  00042190
                                                 W01_IO,                00042200
                                                 SSA3_TRANHIST_F);      00042210
                                                                        00042220
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00042230
        DO;                                                             00042240
          SELECT ( PCB3.STATUS_KODE );                                  00042250
            WHEN ( '  ' )                                               00042260
              W02_MER_DATA                 =    '1'B;                   00042270
            WHEN ( 'GE' )                                               00042280
              W02_MER_DATA                 =    '0'B;                   00042290
            OTHERWISE                                                   00042300
              DO;                                                       00042310
                /* ************************************************** */00042320
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00042330
                /* ************************************************** */00042340
 L492:                                                                  00042350
                                                                        00042360
                                                                        00042370
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;       00042380
                FEIL_MELD_NR               =     500;                   00042390
                FEIL_VED_LABEL             =    '492';                  00042400
              END;                                                      00042410
          END;                                                          00042420
        END;                                                            00042430
      ELSE                                                              00042440
        DO;                                                             00042450
          /* ************************************************** */      00042460
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00042470
          /* ************************************************** */      00042480
 L493:                                                                  00042490
                                                                        00042500
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;             00042510
          FEIL_MELD_NR               =     500;                         00042520
          FEIL_VED_LABEL             =    '493';                        00042530
                                                                        00042540
        END;                                                            00042550
                                                                        00042560
    END LESER_TRANHIST_F_GHNP;                                          00042570
                                                                        00042580
                                                                        00042590
  L015NOTF:                                                             00042600
      DO;                                                               00042610
        EOF_FNRTILG = TRUE;                                             00042620
        W01_UTLINJE ='FNR FINNES IKKE PÅ FNRTILG FNR=' !!               00042630
                                        TEST_OMR.FRANR !!               00042640
                         '  ANTALL=' !! TEST_OMR.ANTALL;                00042650
                                                                        00042660
        EXEC CICS SEND TEXT FROM ( W01_UTLINJE ) ACCUM PAGING ERASE     00042670
                       JUSTIFY ( 10        )  ;                         00042680
                                                                        00042690
        EXEC CICS SEND PAGE RELEASE;                                    00042700
                                                                        00042710
        /*--------------------------------------------------------*/    00042720
        /* TERMINERINGSKALLET FOR PCB'ENE                         */    00042730
        /*--------------------------------------------------------*/    00042740
        CALL PLITDLI                       (W01_TERM_FUNCTION);         00042750
        OMR_FEIL.TEKST1 = W01_UTLINJE;                                  00042760
        OMR_FEIL.FNR = FNR_PIC2 ;                                       00042770
                                                                        00042780
        EXEC CICS WRITE DATASET('OMRFEIL') FROM(OMR_FEIL)               00042790
                             RIDFLD(OMR_FEIL_PEKER) RBA;                00042800
                                                                        00042810
        OMR_FEIL.TEKST1='R0019E04 SLUTT : ' !! DATO_DAGENS !! '  FNR='; 00042820
        OMR_FEIL.FNR = FNR_PIC2 ;                                       00042830
                                                                        00042840
        EXEC CICS WRITE DATASET('OMRFEIL') FROM(OMR_FEIL)               00042850
                         RIDFLD(OMR_FEIL_PEKER) RBA;                    00042860
                                                                        00042870
        EXEC CICS RETURN;                                               00042880
        GO TO L999;                                                     00042890
      END;                                                              00042900
                                                                        00042910
                                                                        00042920
 L999:                                                                  00042930
                                                                        00042940
  IF FEIL_MELD_NR > 0 THEN                                              00042950
     CALL SKRIV_FEILMELDING;                                            00042960
  ELSE                                                                  00042970
     DO;                                                                00042980
        W01_UTLINJE =   'PROGRAMMET KJØRT------OK';                     00042990
                                                                        00043000
                                                                        00043010
        EXEC CICS SEND TEXT FROM ( W01_UTLINJE ) ACCUM PAGING ERASE     00043020
                      JUSTIFY ( 12        )  ;                          00043030
                                                                        00043040
        EXEC CICS SEND PAGE RELEASE;                                    00043050
     END;                                                               00043060
                                                                        00043070
                                                                        00043080
                                                                        00043090
                                                                        00043100
 ERRBEH:                                                                00043110
    EXEC CICS HANDLE   CONDITION ERROR;                                 00043120
                                                                        00043130
                                                                        00043140
    IF PLI_ABEND       THEN                                             00043150
       FEIL_MELDING = 'PLI-ABEND.   RESTART FNR ER :  ' !! FNR_CHAR2  ; 00043160
    ELSE                                                                00043170
       FEIL_MELDING = 'CICS-ABEND.  RESTART FNR ER :  ' !! FNR_CHAR2  ; 00043180
                                                                        00043190
    PLI_ABEND       =  FALSE                                          ; 00043200
                                                                        00043210
    EXEC CICS ENTER TRACEID(03) FROM(FEIL_MELD_NR);                     00043220
    EXEC CICS PURGE MESSAGE                                           ; 00043230
    EXEC CICS SEND  TEXT FROM (FEIL_MELDING) ACCUM ERASE PAGING         00043240
                                                         JUSTIFY ( 5) ; 00043250
                                                                        00043260
                                                                        00043270
    /******** NB!      NB! TASKEN BLIR KANSELERT  ********/             00043280
                                                                        00043290
    FEIL_MELDING = 'TASKEN BLIR KANSELERT !!!!     ' !!                 00043300
                               'INGEN OPPDATERING ER BLITT UTFØRT. ';   00043310
    EXEC CICS SEND TEXT FROM (FEIL_MELDING)     JUSTIFY(10)             00043320
                                                        ACCUM PAGING;   00043330
                                                                        00043340
    CALL SKRIV_UT_TELLERE;                                              00043350
                                                                        00043360
                                                                        00043370
    EXEC CICS ABEND ABCODE   ('FEIL');                                  00043380
                                                                        00043390
                                                                        00043400
                                                                        00043410
  SKRIV_FEILMELDING:                                                    00043420
     PROC;                                                              00043430
                                                                        00043440
  /* **************************************************************** */00043450
  /*HENSIKT:                                                          */00043460
  /*    GIR UT FEILMELDING.                                           */00043470
  /*                                                                  */00043480
  /*                                                                  */00043490
  /*BRUK:                                                             */00043500
  /*    CALL SJELL_FEILMELDING;                                       */00043510
  /*                                                                  */00043520
  /* **************************************************************** */00043530
                                                                        00043540
                                                                        00043550
     FNR_PIC      =    FNRREC.FRANR                                ;    00043560
     FEIL_MELDING = '  RESTART FNR ER :    ' !! FNR_CHAR           ;    00043570
    EXEC CICS ENTER TRACEID(04) FROM(FEIL_MELD_NR);                     00043580
     EXEC CICS PURGE MESSAGE;                                           00043590
     EXEC CICS SEND TEXT FROM (FEIL_MELDING) ACCUM ERASE PAGING         00043600
                                                        JUSTIFY(2);     00043610
                                                                        00043620
     FEIL_MELDING = 'PROGRAM ' !! DIV_PARAM_OMR.PROGRAM_ID !!           00043630
                            ' GÅR I FEIL VED LABEL NR. '           !!   00043640
                                     DIV_PARAM_OMR.FEIL_VED_LABEL;      00043650
     EXEC CICS SEND TEXT FROM (FEIL_MELDING) ACCUM PAGING JUSTIFY(4);   00043660
                                                                        00043670
                                                                        00043680
     FEIL_STRUC.KOM_OMR_PEKER = COMMAREA_PEKER;                         00043690
     FEIL_STRUC.FEIL_NR       = FEIL_MELD_NR;                           00043700
     EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC);           00043710
     EXEC CICS SEND TEXT FROM (FEIL_MELDING) JUSTIFY(6) ACCUM PAGING;   00043720
                                                                        00043730
     IF FEIL_MELD_NR          =     500              THEN               00043740
        DO;                                                             00043750
                                                                        00043760
           /* *************************************************** */    00043770
           /*        DATA-BASE FEIL . RETUR_KODEN LEGGES UT .     */    00043780
           /* *************************************************** */    00043790
                                                                        00043800
           FEIL_MELDING        =  '  RETUR_KODE   =  '                  00043810
                                    !! DIV_PARAM_OMR.DB_STATUS_KODE ;   00043820
           EXEC CICS SEND TEXT FROM     (FEIL_MELDING) ACCUM            00043830
                                            PAGING      JUSTIFY (8);    00043840
        END;                                                            00043850
                                                                        00043860
     ELSE                                                               00043870
        IF FEIL_MELD_NR      =     499              THEN                00043880
           DO;                                                          00043890
                                                                        00043900
            /* *************************************************** */   00043910
            /*        PERSON ER UNDER BEHANDLING AV EN ANNEN TRANS */   00043920
            /* *************************************************** */   00043930
                                                                        00043940
                                                                        00043950
              FNR_PIC             =  DIV_PARAM_OMR.SEARCH_FNR  ;        00043960
              FEIL_MELDING        =  '  FNR  =  ' !!  FNR_CHAR ;        00043970
              EXEC CICS SEND TEXT FROM     (FEIL_MELDING) ACCUM         00043980
                                               PAGING      JUSTIFY (8); 00043990
           END;                                                         00044000
                                                                        00044010
     FEIL_MELDING = 'TASKEN BLIR KANSELERT !!!!     ' !!                00044020
                               'INGEN OPPDATERING ER BLITT UTFØRT. ';   00044030
     EXEC CICS SEND TEXT FROM (FEIL_MELDING)     JUSTIFY(10)            00044040
                                                        ACCUM PAGING;   00044050
                                                                        00044060
     CALL SKRIV_UT_TELLERE;                                             00044070
                                                                        00044080
                                                                        00044090
                                                                        00044100
                                                                        00044110
     /******** NB!      NB! TASKEN BLIR KANSELERT  ********/            00044120
                                                                        00044130
     EXEC CICS ABEND                                                    00044140
                 ABCODE(STOP);                                          00044150
                                                                        00044160
  END SKRIV_FEILMELDING;                                                00044170
                                                                        00044180
                                                                        00044190
                                                                        00044200
  /* **************************************************************** */00044210
  /*                                                                  */00044220
  /*    SKRIVER UT TELLERNE PÅ SKJERM OG PÅ PRINTER .                 */00044230
  /*                                                                  */00044240
  /* **************************************************************** */00044250
                                                                        00044260
                                                                        00044270
  SKRIV_UT_TELLERE:                                                     00044280
     PROC;                                                              00044290
                                                                        00044300
                                                                        00044310
    PRINT_TELLER = 0;                                                   00044320
                                                                        00044330
    DO WHILE( PRINT_TELLER < 2 );                                       00044340
                                                                        00044350
       /* ****************************************** */                 00044360
       /*  HVIS PRINT_TELLER = 0 MELDING TIL SKJERM  */                 00044370
       /*  HVIS PRINT_TELLER = 1 MELDING TIL PRINTER */                 00044380
       /* ****************************************** */                 00044390
                                                                        00044400
       IF PRINT_TELLER = 1 THEN                                         00044410
          EXEC CICS ROUTE LIST (ROUTLISTE);                             00044420
                                                                        00044430
       W01_UTLINJE =    ANT_LEST_CHAR !! ' ENDRINGSRECORDS LEST';       00044440
                                                                        00044450
       EXEC CICS SEND TEXT FROM ( W01_UTLINJE ) ACCUM PAGING ERASE      00044460
                      L80 PRINT JUSTIFY ( 14         )  ;               00044470
                                                                        00044480
                                                                        00044490
       W01_UTLINJE =  ANT_ENDR_CHAR !! ' FØDSELSNUMMER ENDRET';         00044500
                                                                        00044510
       EXEC CICS SEND TEXT FROM ( W01_UTLINJE ) ACCUM PAGING            00044520
                      L80 PRINT JUSTIFY ( 16         )  ;               00044530
                                                                        00044540
                                                                        00044550
                                                                        00044560
       W01_UTLINJE =  ANT_OMR_4001_CHAR !! ' OMREGNINGER I R0014001';   00044570
                                                                        00044580
       EXEC CICS SEND TEXT FROM ( W01_UTLINJE ) ACCUM PAGING            00044590
                      L80 PRINT JUSTIFY ( 18         )  ;               00044600
                                                                        00044610
                                                                        00044620
                                                                        00044630
       W01_UTLINJE =  ANT_OMR_4901_CHAR !! ' OMREGNINGER I R0014901';   00044640
                                                                        00044650
       EXEC CICS SEND TEXT FROM ( W01_UTLINJE ) ACCUM PAGING            00044660
                      L80 PRINT JUSTIFY ( 20         )  ;               00044670
                                                                        00044680
                                                                        00044690
                                                                        00044700
       W01_UTLINJE =  ANT_STAT_CHAR !! ' FNR-ENDR. TIL STAT.BASEN';     00044710
                                                                        00044720
       EXEC CICS SEND TEXT FROM ( W01_UTLINJE ) ACCUM PAGING            00044730
                      L80 PRINT JUSTIFY ( 22         )  ;               00044740
                                                                        00044750
                                                                        00044760
       W01_UTLINJE =  ANT_CALL_OMR_CHAR !! ' ANTALL CALL OMREGN';       00044770
                                                                        00044780
       EXEC CICS SEND TEXT FROM ( W01_UTLINJE ) ACCUM PAGING            00044790
                      L80 PRINT JUSTIFY ( 24         )  ;               00044800
                                                                        00044810
                                                                        00044820
       W01_UTLINJE =  ANT_CALL_MAN_CHAR !! ' ANTALL CALL MANUELL';      00044830
                                                                        00044840
       EXEC CICS SEND TEXT FROM ( W01_UTLINJE ) ACCUM PAGING            00044850
                      L80 PRINT JUSTIFY ( 26         )  ;               00044860
                                                                        00044870
                                                                        00044880
       W01_UTLINJE =  ANT_CALL_DØD_CHAR !! ' ANTALL CALL DØD';          00044890
                                                                        00044900
       EXEC CICS SEND TEXT FROM ( W01_UTLINJE ) ACCUM PAGING            00044910
                      L80 PRINT JUSTIFY ( 28         )  ;               00044920
                                                                        00044930
                                                                        00044940
       W01_UTLINJE =  ANT_UFØRH_CHAR !! ' ANTALL ENDR PÅ UFØRHIST';     00044950
                                                                        00044960
       EXEC CICS SEND TEXT FROM ( W01_UTLINJE ) ACCUM PAGING            00044970
                      L80 PRINT JUSTIFY ( 30         )  ;               00044980
                                                                        00044990
                                                                        00045000
       EXEC CICS SEND PAGE;                                             00045010
                                                                        00045020
       PRINT_TELLER = PRINT_TELLER + 1;                                 00045030
                                                                        00045040
    END;                                                                00045050
                                                                        00045060
  END SKRIV_UT_TELLERE;                                                 00045070
                                                                        00045080
 %INCLUDE R0019961;      /* OMREGNING_PGA_FNRENDRING */                 00045090
                                                                        00045100
 %INCLUDE R0019913;      /* F_SNUDATO */                                00045110
                                                                        00045120
 %INCLUDE R0019956;      /* P9956_BER_G_CICS    */                      00045130
                                                                        00045140
 END R0019E4;                                                           00045150
