 /*       SIST ENDRET 21/08-85 08.14.14 AV   FARVIK                   */00000000
 /*       SIST ENDRET 15/02-85 15.01.10 AV   HERMAN                   */00000010
 /*       SIST ENDRET 12/01-83 11.54.32 AV   FARVIK                   */00000020
 /*       SIST ENDRET 07/01-83 13.46.53 AV   LUNDEBY                  */00000030
 /*       SIST ENDRET 24/11-82 09.33.48 AV   FARVIK                   */00000040
 /* ***************************************************************** */00000050
 /*IDENTIFIKASJON:                                                    */00000060
 /*    R0010920 - PROSEDYRE I PLI                                     */00000070
 /*    PROGRAMMERER: GEIR,JANUAR 1982                                 */00000080
 /*HENSIKT:                                                           */00000090
 /*    KONTROLL AV ETTERLATT FAMILIEPLEIER                            */00000100
 /*    RUTINEN KONTROLLERER TRANSAKSJONEN MOT INFO I REGISTERET       */00000110
 /*PROGRAMTILKNYTNING:                                                */00000120
 /*    KALLES OPP AV PROGRAM R0013520                                 */00000130
 /*BRUK:                                                              */00000140
 /*    EXEC CICS XCTL PROGRAM ('R0010920') COMMAREA (KOM_OMR)         */00000150
 /*                                                                   */00000160
 /* ***************************************************************** */00000170
 %SKIP(2);                                                              00000180
 KON_EF:                                                                00000190
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000200
 %SKIP;                                                                 00000210
      %INCLUDE P0019908;  /* KOM_OMR  BASED(COMMAREA_PEKER)          */ 00000220
      %INCLUDE P0019906;  /* TRANS_OPPL_OMR  BASED(TRANS_OPPL_PEKER) */ 00000230
      %INCLUDE P0010901;  /* TKNR_TAB(450)                           */ 00000240
      %INCLUDE P0019910;  /* STYRINGS_OMR  BASED(STYRINGS_PEKER)     */ 00000250
      %INCLUDE P0019912;  /* DIV_PARAM_OMR  BASED(DIV_PARAM_PEKER)   */ 00000260
                                                                        00000270
      DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                    00000280
      DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                    00000290
      DCL COMMAREA_PEKER PTR;                                           00000300
 %PAGE;                                                                 00000310
   DCL                                                                  00000320
      IND               FIXED BIN (15),                                 00000330
      I                 FIXED BIN (15),                                 00000340
      SEKSTISJU_ÅRSDATO PIC       '(5)9',                               00000350
      SYTTI_ÅRSDATO     PIC       '(5)9',                               00000360
      HJ_VIRK_DATO_ÅM   PIC       '(4)9';                               00000370
   DCL                                                                  00000380
      T_FNR             PIC      '(11)9';                               00000390
   DCL                                                                  00000400
      1 NR              DEF       T_FNR,                                00000410
        2 DG            PIC        '99',                                00000420
        2 MN            PIC        '99',                                00000430
        2 ÅR            PIC        '99',                                00000440
        2 PERSNR,                                                       00000450
           3 ÅRHUNDRE   PIC       '999',                                00000460
           3 REST       PIC        '99';                                00000470
 %PAGE;                                                                 00000480
 /* ***************************************************************** */00000490
 /* PROGRAMMET BEGYNNER HER                                           */00000500
 /* ***************************************************************** */00000510
      PROGRAM_ID      = 'R0010920';                                     00000520
      T_FNR           = EFS.FNR;                                        00000530
      HJ_VIRK_DATO_ÅM = 0;                                              00000540
      TRANSTYPE       = '34';                                           00000550
      HJ_VIRK_DATO_ÅM = F_SNU_DATO(TRANS_OMR.VIRK_DATO_MÅ);  /* 9912 */ 00000560
  %SKIP;                                                                00000570
 /* ***************************************************************** */00000580
 /* REGNER UT ÅR OG MND VEDKOMMENDE FYLLER 67 ÅR (ÅÅMM).  SIFFER      */00000590
 /* 7-9 ANGIR ÅRHUNDRE:  1800-TALLET 500-749, 1900-TALLET 000-499     */00000600
 /* ***************************************************************** */00000610
      IF ÅRHUNDRE <= '499' THEN                                         00000620
         DO;                                                            00000630
            SEKSTISJU_ÅRSDATO = (ÅR + 67) * 100 + MN;                   00000640
            SYTTI_ÅRSDATO     = (ÅR + 70) * 100 + MN;                   00000650
         END;                                                           00000660
      ELSE                                                              00000670
         DO;                                                            00000680
            SEKSTISJU_ÅRSDATO = ((ÅR + 67) - 100) * 100 + MN;           00000690
            SYTTI_ÅRSDATO     = ((ÅR + 70) - 100) * 100 + MN;           00000700
         END;                                                           00000710
 /* ***************************************************************** */00000720
 /* SØKEREN HAR PENSJONSSTATUS                                        */00000730
 /* **************************************************************** */ 00000740
                                                                        00000750
      IF STATUS_TYPE ^= 'A' &                                           00000760
         STATUS_TYPE ^= 'C' &                                           00000770
         STATUS_TYPE ^= 'I' &      /* TILLEGGSTEST PÅ 'I' OG 'K' */     00000780
         STATUS_TYPE ^= 'K' THEN   /* 14.2.85  HL                */     00000790
         DO;                                                            00000800
 /* ***************************************************************** */00000810
 /* SØKEREN HAR ENTEN ALDERS-,UFØRE-,ELLER ETTERLATTEPENSJON          */00000820
 /* ***************************************************************** */00000830
            IF B01.PENSJONSTYPE1(SØKER_IND) ^= 'J' THEN                 00000840
               DO;                                                      00000850
  L100:                                                                 00000860
                  FEIL_VED_LABEL = '100';                               00000870
                  FEIL_MELD_NR   = 1104;                                00000880
                  GO TO L999;                                           00000890
               END;                                                     00000900
            ELSE                                                        00000910
               DO;                                                      00000920
 /* ***************************************************************** */00000930
 /* SØKER ER REGISTRERT MED ET ANNET TKNR I STATUS ENN I TRANS        */00000940
 /* ***************************************************************** */00000950
                  IF B01.RF0PERSN.TKNR(SØKER_IND) > 0  THEN             00000960
                     IF B01.RF0PERSN.TKNR(SØKER_IND) ^= EFS.TKNR THEN   00000970
                        DO;                                             00000980
  L110:                                                                 00000990
                           FEIL_VED_LABEL = '110';                      00001000
                           FEIL_MELD_NR   = 1702;                       00001010
                           GO TO L999;                                  00001020
                        END;                                            00001030
                     ELSE                                               00001040
                        DO;                                             00001050
 /* ***************************************************************** */00001060
 /* HVIS SØKEREN ER REGISTRERT SOM GIFT                               */00001070
 /* ***************************************************************** */00001080
                           IF B01.SIVILSTAND(SØKER_IND) = 'G' THEN      00001090
                              DO;                                       00001100
  L120:                                                                 00001110
                                 FEIL_VED_LABEL = '120';                00001120
                                 FEIL_MELD_NR   = 1103;                 00001130
                                 GO TO L999;                            00001140
                              END;                                      00001150
                           ELSE                                         00001160
                              DO;                                       00001170
 /* ***************************************************************** */00001180
 /* SØKEREN ER UGIFT                                                  */00001190
 /* ***************************************************************** */00001200
                                 CALL                                   00001210
 /* 9926 */                             FLYTT_B01_TIL_B02(SØKER_IND);   00001220
                                 CALL                                   00001230
 /* 0922 */                             AJOURFØR_B02_MED_EF_TRANS;      00001240
                              END;                                      00001250
                        END;                                            00001260
                  ELSE                                                  00001270
                     DO;                                                00001280
                        B02.RF0PERSN.TKNR(SØKER_IND) = EFS.TKNR;        00001290
                        CALL                                            00001300
 /* 9926 */                  FLYTT_B01_TIL_B02(SØKER_IND);              00001310
                        CALL                                            00001320
 /* 0922 */                  AJOURFØR_B02_MED_EF_TRANS;                 00001330
                     END;                                               00001340
               END;                                                     00001350
         END;                                                           00001360
      ELSE                                                              00001370
         DO;                                                            00001380
 /* ***************************************************************** */00001390
 /* SØKEREN HAR IKKE PENSJONSSTATUS                                   */00001400
 /* ***************************************************************** */00001410
            IF B01.FNR(SØKER_IND) = 0 THEN                              00001420
 /* ***************************************************************** */00001430
 /* SØKEREN ER IKKE I BASEN                                           */00001440
 /* ***************************************************************** */00001450
               DO;                                                      00001460
                  B02.FNR    (SØKER_IND) = EFS.FNR;                     00001470
                  B02.NAVN   (SØKER_IND) = EFS.NAVN;                    00001480
                  B02.TKNR   (SØKER_IND) = EFS.TKNR;                    00001490
                  B02.SPRÅK  (SØKER_IND) = EFS.SPRÅK;                   00001500
                  CALL                                                  00001510
 /* 0921 */       OPPRETT_STATUS_EF_SØKER;                              00001520
               END;                                                     00001530
            ELSE                                                        00001540
               DO;                                                      00001550
 /* ***************************************************************** */00001560
 /* SØKEREN ER I BASEN                                                */00001570
 /* ***************************************************************** */00001580
                  CALL                                                  00001590
 /* 9926 */       FLYTT_B01_TIL_B02(SØKER_IND);                         00001600
                  CALL                                                  00001610
 /* 0921 */       OPPRETT_STATUS_EF_SØKER;                              00001620
               END;                                                     00001630
         END;                                                           00001640
 L999:                                                                  00001650
         EXEC CICS RETURN;                                              00001660
 %PAGE;                                                                 00001670
      %INCLUDE R0010921;   /* OPPRETT_STATUS_EF_SØKER            */     00001680
 %PAGE;                                                                 00001690
      %INCLUDE R0010922;   /* AJOURFØR_B02_MED_EF_TRANS          */     00001700
 %PAGE;                                                                 00001710
      %INCLUDE R0019905;   /* F_ALDER                            */     00001720
 %PAGE;                                                                 00001730
      %INCLUDE R0019913;   /* F_SNU_DATO                         */     00001740
 %PAGE;                                                                 00001750
      %INCLUDE R0019926;   /* FLYTT_B01_TIL_B02                  */     00001760
   END KON_EF;                                                          00001770
