 /*       SIST ENDRET 28/09-82 07.20.41 AV   FARVIK                   */00000000
 /*       SIST ENDRET 17/08-82 17.05.17 AV   PERB                     */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON                                                     */00000030
 /*     R0019901      FUNKSJON PLI                                    */00000040
 /*     PROGRAMMERT AV JAN I MARS 1981                                */00000050
 /*HENSIKT                                                            */00000060
 /*     TESTE GYLDIG DATO                                             */00000070
 /*     PARAMETER: INN: DATO_MÅ                                       */00000080
 /*     RETUR: '1'B - GYLDIG DATO                                     */00000090
 /*            '0'B _ UGYLDIG DATO                                    */00000100
 /* ***************************************************************** */00000110
 %SKIP(2);                                                              00000120
 F_GYLDIG_DATO:                                                         00000130
   PROC (DATO_MÅ) RETURNS(BIT (1));                                     00000140
   DCL                                                                  00000150
      DATO_MÅ PIC '9999';                                               00000160
   DCL                                                                  00000170
      1 DATO_MÅ1 DEF DATO_MÅ,                                           00000180
         2 MND PIC '99',                                                00000190
         2 ÅR PIC '99';                                                 00000200
   DCL                                                                  00000210
      KODE BIT (1);                                                     00000220
      IF (MND > 00 & MND < 13 & ÅR > 66) ! (MND = 12 & ÅR = 66) THEN    00000230
         KODE = '1'B;                                                   00000240
      ELSE                                                              00000250
         KODE = '0'B;                                                   00000260
      RETURN (KODE);                                                    00000270
   END F_GYLDIG_DATO;                                                   00000280
