 /*       SIST ENDRET 19/06-98 08.05.47 AV   JDA7339                  */00000000
 /*       SIST ENDRET 19/06-98 07.56.37 AV   JDA7339                  */00000010
 /*       SIST ENDRET 11/04-97 09.11.11 AV   JDA7339                  */00000020
 /*       SIST ENDRET 20/04-95 11.26.23 AV   JDA0310                  */00000030
 /*       SIST ENDRET 13/12-91 12.36.42 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 24/10-91 12.26.39 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 04/03-83 12.22.31 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 21/01-83 14.27.40 AV   OLSEN                    */00000070
 /* **************************************************************** */ 00000080
 /*IDENTIFIKASJON:                                                   */ 00000090
 /*    R0017045 - PROSEDYRE I PLI                                    */ 00000100
 /*    PROGRAMMERER: JAN, JANUAR 1983                                */ 00000110
 /*HENSIKT:                                                          */ 00000120
 /*    RUTINEN SETTER INN KODER FOR TEKSTTYPE V I TEKSTTABELLEN FOR  */ 00000130
 /*    STØNADSBREV.                                                  */ 00000140
 /*PROGRAMTILKNYTNING:                                               */ 00000150
 /*    KALLES OPP AV PROGRAM R0017001                                */ 00000160
 /*    INCLUDES I R0017001;                                          */ 00000170
 /*BRUK:                                                             */ 00000180
 /*   CALL PLASSER_TEKSTTYPE_V_KODE(IND)                             */ 00000190
 /*   OBS   KALLES BARE OPP NÅR TRANSTYPEN = 27  (SATSENDRING)       */ 00000200
 /*ENDRET 16.6.86 HL - FEILRAPP 348. DET SKAL TESTES På ST-PROSENT   */ 00000210
 /*                   OG IKKE PÅ BELØPENE.                           */ 00000220
 /* **************************************************************** */ 00000230
 %PAGE;                                                                 00000240
 PLASSER_TEKSTTYPE_V_KODE:                                              00000250
   PROC(IND);                                                           00000260
 %PAGE;                                                                 00000270
   DCL                                                                  00000280
      IND                     FIXED BIN (15);                           00000290
                                                                        00000300
   DCL                                                                  00000310
      INDEX                   FIXED BIN (15);                           00000320
   DCL                                                                  00000330
      W_HELP_MÅ               PIC '9999',                               00000340
      W_HELP_M  DEF W_HELP_MÅ POS (1) PIC '99',                         00000350
      W_HELP_Å  DEF W_HELP_MÅ POS (3) PIC '99',                         00000360
      W_VIRK_ÅM               PIC '9999',                               00000370
      W_VIRK_Å  DEF W_VIRK_ÅM POS (1) PIC '99',                         00000380
      W_VIRK_M  DEF W_VIRK_ÅM POS (3) PIC '99',                         00000390
      W_VIRK_ÅM_FIX           FIXED DEC (5);                            00000400
   DCL HUNDREDEL              FIXED DEC (7);                            00000410
                                                                        00000420
                                                                        00000430
 /* ***************************************************************** */00000440
 /* PROGRAMMET STARTER HER                                            */00000450
 /* ***************************************************************** */00000460
                                                                        00000470
   TEKSTTYPE_V1_KODE = '    ';                                          00000480
                                                                        00000490
   W_HELP_MÅ                 = TRANS_OPPL_OMR.VIRKNINGSDATO;            00000500
   W_VIRK_Å                  = W_HELP_Å;                                00000510
   W_VIRK_M                  = W_HELP_M;                                00000520
   W_VIRK_ÅM_FIX             = W_VIRK_ÅM;                               00000530
                                                                        00000540
 /* ***************************************************** */            00000550
 /*                                                       */            00000560
 /* ENDRING VED NY LOV 1.1.92                             */            00000570
 /*                                                       */            00000580
 /* ***************************************************** */            00000590
                                                                        00000600
   IF TRANS_OPPL_OMR.TRANSTYPE = 27         &                           00000610
      TRANS_OPPL_OMR.VIRKNINGSDATO = 0192   THEN                        00000620
      IF (B01.YRKEPENS.TP (IND)                                         00000630
        + B01.UFØRPENS.TP (IND)                                         00000640
        + B01.ETTEPENS.TP_NETTO(IND)                                    00000650
        + B01.ALDERSP.AP_TP_NETTO(IND)) ^=                              00000660
         (B02.YRKEPENS.TP (IND)                                         00000670
        + B02.UFØRPENS.TP (IND)                                         00000680
        + B02.ETTEPENS.TP_NETTO(IND)                                    00000690
        + B02.ALDERSP.AP_TP_NETTO(IND)) THEN                            00000700
         DO;                                                            00000710
           TEKSTTYPE_V1_KODE = 'V116';                                  00000720
       /*  TEKSTTYPE_V1_KODE = 'V082';        ENDRING I G */            00000730
           GOTO L999;                                                   00000740
         END;                                                           00000750
      ELSE                                                              00000760
      IF (B01.YRKEPENS.TP (IND)                                         00000770
        + B01.UFØRPENS.TP (IND)                                         00000780
        + B01.ETTEPENS.TP_NETTO(IND)                                    00000790
        + B01.ALDERSP.AP_TP_NETTO(IND)) =                               00000800
         (B02.YRKEPENS.TP (IND)                                         00000810
        + B02.UFØRPENS.TP (IND)                                         00000820
        + B02.ETTEPENS.TP_NETTO(IND)                                    00000830
        + B02.ALDERSP.AP_TP_NETTO(IND)) THEN                            00000840
         DO;                                                            00000850
           TEKSTTYPE_V1_KODE = 'V199';                                  00000860
           GOTO L999;                                                   00000870
         END;                                                           00000880
   DO I = 1 TO 60;                                                      00000890
                                                                        00000900
      HUNDREDEL = G_TAB_PERIODE(I).PERIODE_START_ÅMD/100;               00000910
      IF HUNDREDEL = W_VIRK_ÅM_FIX              THEN                    00000920
         DO;                                                            00000930
                                                                        00000940
            INDEX = I;                                                  00000950
            I     = 99;                                                 00000960
                                                                        00000970
         END;                                                           00000980
                                                                        00000990
   END;                                                                 00001000
                                                                        00001010
                                                                        00001020
   IF B02.PENSJONSTYPE2(IND) = 'O' THEN                                 00001030
      DO;                                                               00001040
                                                                        00001050
         IF (G_TAB_PERIODE.ST_PROSENT_E (INDEX) =                       00001060
             G_TAB_PERIODE.ST_PROSENT_E (INDEX - 1))     &              00001070
                                                                        00001080
            (G_TAB_PERIODE.ST_PROSENT_S (INDEX) =                       00001090
             G_TAB_PERIODE.ST_PROSENT_S (INDEX - 1))     THEN           00001100
                                                                        00001110
         /*SÆRTILLEGGET ER IKKE ENDRET*/                                00001120
                                                                        00001130
                TEKSTTYPE_V1_KODE = 'V082';      /*ENDRING I G */       00001140
                                                                        00001150
         ELSE                                                           00001160
                                                                        00001170
            IF G_TAB_PERIODE.GRUNNBELØP (INDEX)      =                  00001180
               G_TAB_PERIODE.GRUNNBELØP (INDEX - 1)      THEN           00001190
                                                                        00001200
                TEKSTTYPE_V1_KODE = 'V084';      /*ENDRING I ST */      00001210
                                                                        00001220
          ELSE                                                          00001230
                                                                        00001240
                TEKSTTYPE_V1_KODE = 'V086';    /*ENDRING I G OG ST*/    00001250
                                                                        00001260
      END;                                                              00001270
                                                                        00001280
   ELSE                                                                 00001290
                                                                        00001300
      DO;                                                               00001310
                                                                        00001320
         IF (G_TAB_PERIODE.ST_PROSENT_E (INDEX) =                       00001330
             G_TAB_PERIODE.ST_PROSENT_E (INDEX - 1))     &              00001340
                                                                        00001350
            (G_TAB_PERIODE.ST_PROSENT_S (INDEX) =                       00001360
             G_TAB_PERIODE.ST_PROSENT_S (INDEX - 1))     THEN           00001370
                                                                        00001380
         /*SÆRTILLEGGET ER IKKE ENDRET*/                                00001390
                                                                        00001400
                TEKSTTYPE_V1_KODE = 'V081';      /*ENDRING I G */       00001410
                                                                        00001420
         ELSE                                                           00001430
                                                                        00001440
            IF G_TAB_PERIODE.GRUNNBELØP (INDEX)      =                  00001450
               G_TAB_PERIODE.GRUNNBELØP (INDEX - 1)      THEN           00001460
                                                                        00001470
                TEKSTTYPE_V1_KODE = 'V083';      /*ENDRING I ST */      00001480
                                                                        00001490
          ELSE                                                          00001500
             DO;                                                        00001510
                IF TRANS_OPPL_OMR.VIRKNINGSDATO = 0598  &               00001520
                   B02.ANTALL_BARN(IND) > 0             THEN            00001530
                   TEKSTTYPE_V1_KODE = 'V126';                          00001540
                ELSE                                                    00001550
                   TEKSTTYPE_V1_KODE = 'V085'; /*ENDRING I G OG ST*/    00001560
             END;                                                       00001570
                                                                        00001580
      END;                                                              00001590
                                                                        00001600
                                                                        00001610
 /* ***************************************************************** */00001620
 /* HVIS PTYPE3 = 'A' ENDRES TEKSTKODE TIL Å GJELDE ATTFØRING         */00001630
 /* ***************************************************************** */00001640
                                                                        00001650
  IF B02.STATUS.PENSJONSTYPE3(IND) = 'A' THEN                           00001660
     DO;                                                                00001670
        SUBSTR(TEKSTTYPE_V1_KODE,2,1) = '6';                            00001680
     END;                                                               00001690
 L999:                                                                  00001700
                                                                        00001710
   END PLASSER_TEKSTTYPE_V_KODE;                                        00001720
