 /*       SIST ENDRET 09/02-88 13.22.11 AV   DYBVIK                   */00000000
 %SKIP(3);                                                              00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /* **********************                                            */00000040
 /*  PROGRAM-IDENT : R001NO15  UNDERPROGRAM SOM BRUKES AV R001NO10.   */00000050
 /*                            KONTROLL FT-BLANKETT.                  */00000060
 /*  PROGRAM-SPRÅK : PLI                                              */00000070
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */00000080
 /*  PROGRAMMET BLE LAGET : OKTOBER 1986                              */00000090
 /*  ENDRINGERSDATO :                                                 */00000100
 /*  ENDRINGEN GJELDER:                                               */00000110
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000120
 /*                                                                   */00000130
 /* ***************************************************************** */00000140
 /*BRUK:                                                              */00000150
 /* ********                                                          */00000160
 /*                                                                   */00000170
 /*  %INCLUDE R001NO15                                                */00000180
 /*                                                                   */00000190
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */00000200
 /*                                                                   */00000210
 /*    R0011202   BLANK FT TRANSOMR                                   */00000220
 /*    R0011203   KONTR FT SØKER                                      */00000230
 /*    R0011204   KONTR FT BARN                                       */00000240
 /*    FUNKSJONER SOM BRUKES ER INKLUDERT I HOVEDPROGRAMMET.          */00000250
 /*                                                                   */00000260
 /* ***************************************************************** */00000270
 /*                                                                   */00000280
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR FT OG FLYTTER DERETTER        */00000290
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */00000300
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */00000310
 /*  NUMRE TATT VARE PÅ.                                              */00000320
 /*                                                                   */00000330
 /* ***************************************************************** */00000340
                                                                        00000350
 P112_BEHANDLE_FT: PROC;                                                00000360
                                                                        00000370
                                                                        00000380
 %INCLUDE P0011201;                               /* TRANSOMR FT */     00000390
                                                                        00000400
                                                                        00000410
          CALL BLANK_FT_SØKER;                        /* R0011202 */    00000420
          CALL BLANK_FT_MELDNR;                       /* R0011202 */    00000430
          CALL BLANK_FT_BARN;                         /* R0011202 */    00000440
          CALL OVERFØR_FT_BLANKETT;                                     00000450
          CALL KONTROLL_FT_SØKER(FEIL_FUNNET);        /* R0011203 */    00000460
                                                                        00000470
          IF ^FEIL_FUNNET                         &                     00000480
             F_FELT_PIC_CHAR2(FTS.BT_ANT) ^= '00' THEN                  00000490
             DO;                                                        00000500
                CALL OVERF_FT_BARN;                                     00000510
                CALL KONTROLL_FT_BARN(FEIL_FUNNET);   /* R0011204 */    00000520
             END;                                                       00000530
                                                                        00000540
          IF FTS.BOSATT_UTL = 'J' THEN                                  00000550
             DO;                                                        00000560
                FEIL_I_BOSATT = '1'B;                                   00000570
                FEIL_FUNNET = '1'B;                                     00000580
             END;                                                       00000590
                                                                        00000600
          IF FEIL_FUNNET     THEN                                       00000610
             CALL FINN_FEIL_FT;                                         00000620
                                                                        00000630
                                                                        00000640
                                                                        00000650
 /* ***************************************************************** */00000660
 /*                                                                   */00000670
 /*   PROSEDYRE FOR Å OVERFØRE FELT FRA OVERFØRINGSRECORD TIL         */00000680
 /*   FT_TRANS_OMR I KOM_OMR FOR FT_SøKER.                            */00000690
 /*                                                                   */00000700
 /* ***************************************************************** */00000710
 OVERFØR_FT_BLANKETT:                                                   00000720
   PROC;                                                                00000730
                                                                        00000740
                                                                        00000750
          FTS.REGDATO      = BLANKETT_RECORD.TRANS_DATO_ÅMD;            00000760
          FTS.TERMID       = 'NORT';                                    00000770
          FTS.FNR          = BLANKETT_RECORD.FNR;                       00000780
          FTS.TKNR         = BLANKETT_RECORD.TKNR;                      00000790
          FTS.TILL_EK      = FT_BLANKETT.TILL_EK;                       00000800
                                                                        00000810
          IF F_FELT_PIC_CHAR2(FT_BLANKETT.BT_ANT) ^= '  '   THEN        00000820
             FTS.BT_ANT    = FT_BLANKETT.BT_ANT;                        00000830
                                                                        00000840
          FTS.VIRK_DATO_MÅ = FT_BLANKETT.VIRK_DATO_MÅ;                  00000850
                                                                        00000860
          IF F_FELT_PIC_CHAR11(FT_BLANKETT.FNR_EK) ^= (11)' '  THEN     00000870
             FTS.FNR_EK    = FT_BLANKETT.FNR_EK;                        00000880
                                                                        00000890
          FTS.EK_INNT      = FT_BLANKETT.EK_INNT;                       00000900
                                                                        00000910
                                                                        00000920
    END OVERFØR_FT_BLANKETT;                                            00000930
                                                                        00000940
 /* ***************************************************************** */00000950
 /*                                                                   */00000960
 /* PROSEDYREN OVERFØRER OPPL. OM BARN FRA SKJERMBILDET TIL           */00000970
 /*    FT_TRANS_OMR I KOM_OMR.                                        */00000980
 /*                                                                   */00000990
 /* ***************************************************************** */00001000
 OVERF_FT_BARN:                                                         00001010
   PROC;                                                                00001020
                                                                        00001030
                                                                        00001040
          DO I = 1 TO 8 WHILE(F_FELT_PIC_CHAR11                         00001050
                              (FT_BLANKETT.FNR_BARN(I)) ^= (11)' ');    00001060
                                                                        00001070
             FTB.FNR_BARN(I) = FT_BLANKETT.FNR_BARN(I);                 00001080
             FTB.RBT_BARN(I) = FT_BLANKETT.RBT_BARN(I);                 00001090
                                                                        00001100
          END;                                                          00001110
                                                                        00001120
                                                                        00001130
    END OVERF_FT_BARN;                                                  00001140
                                                                        00001150
                                                                        00001160
 /* ***************************************************************** */00001170
 /*  PROSEDYRE SOM FINNER OG TAR VARE PÅ FEILMELDINGSNUMRENE NÅR DET  */00001180
 /*  ER FEIL I DEN OVERFØRTE RECORDEN.                                */00001190
 /* ***************************************************************** */00001200
 FINN_FEIL_FT:PROC;                                                     00001210
                                                                        00001220
                                                                        00001230
    DCL ANT_BARN              FIXED BIN (15);                           00001240
                                                                        00001250
          FEIL_IND = 1;                                                 00001260
                                                                        00001270
          IF FTS.FNRNR ^= 0   &                                         00001280
             FTS.FNRNR ^= 999 THEN                                      00001290
             DO;                                                        00001300
                W01_FEIL_NR(FEIL_IND) = FTS.FNRNR;                      00001310
                FEIL_IND = FEIL_IND + 1;                                00001320
             END;                                                       00001330
                                                                        00001340
          IF FTS.TKNRNR ^= 0   &                                        00001350
             FTS.TKNRNR ^= 999 THEN                                     00001360
             DO;                                                        00001370
                W01_FEIL_NR(FEIL_IND) = FTS.TKNRNR;                     00001380
                FEIL_IND = FEIL_IND + 1;                                00001390
             END;                                                       00001400
                                                                        00001410
          IF FTS.TILL_EKNR ^= 0   &                                     00001420
             FTS.TILL_EKNR ^= 999 THEN                                  00001430
             DO;                                                        00001440
                W01_FEIL_NR(FEIL_IND) = FTS.TILL_EKNR;                  00001450
                IF FEIL_IND ^= 3  THEN                                  00001460
                   FEIL_IND = FEIL_IND + 1;                             00001470
             END;                                                       00001480
                                                                        00001490
          IF FTS.BT_ANTNR ^= 0   &                                      00001500
             FTS.BT_ANTNR ^= 999 THEN                                   00001510
             DO;                                                        00001520
                W01_FEIL_NR(FEIL_IND) = FTS.BT_ANTNR;                   00001530
                IF FEIL_IND ^= 3  THEN                                  00001540
                   FEIL_IND = FEIL_IND + 1;                             00001550
             END;                                                       00001560
                                                                        00001570
          IF FTS.VIRK_DATO_MÅNR ^= 0   &                                00001580
             FTS.VIRK_DATO_MÅNR ^= 999 THEN                             00001590
             DO;                                                        00001600
                W01_FEIL_NR(FEIL_IND) = FTS.VIRK_DATO_MÅNR;             00001610
                IF FEIL_IND ^= 3  THEN                                  00001620
                   FEIL_IND = FEIL_IND + 1;                             00001630
             END;                                                       00001640
                                                                        00001650
          IF FTS.FNR_EKNR ^= 0   &                                      00001660
             FTS.FNR_EKNR ^= 999 THEN                                   00001670
             DO;                                                        00001680
                W01_FEIL_NR(FEIL_IND) = FTS.FNR_EKNR;                   00001690
                IF FEIL_IND ^= 3  THEN                                  00001700
                   FEIL_IND = FEIL_IND + 1;                             00001710
             END;                                                       00001720
                                                                        00001730
          IF FTS.BOSATT_UTLNR ^= 0   &                                  00001740
             FTS.BOSATT_UTLNR ^= 999 THEN                               00001750
             DO;                                                        00001760
                W01_FEIL_NR(FEIL_IND) = FTS.BOSATT_UTLNR;               00001770
                IF FEIL_IND ^= 3  THEN                                  00001780
                   FEIL_IND = FEIL_IND + 1;                             00001790
             END;                                                       00001800
                                                                        00001810
          IF FTS.TT_F67_EKNR ^= 0   &                                   00001820
             FTS.TT_F67_EKNR ^= 999 THEN                                00001830
             DO;                                                        00001840
                W01_FEIL_NR(FEIL_IND) = FTS.TT_F67_EKNR;                00001850
                IF FEIL_IND ^= 3  THEN                                  00001860
                   FEIL_IND = FEIL_IND + 1;                             00001870
             END;                                                       00001880
                                                                        00001890
          IF FTS.TT_E66_Å_EKNR ^= 0   &                                 00001900
             FTS.TT_E66_Å_EKNR ^= 999 THEN                              00001910
             DO;                                                        00001920
                W01_FEIL_NR(FEIL_IND) = FTS.TT_E66_Å_EKNR;              00001930
                IF FEIL_IND ^= 3  THEN                                  00001940
                   FEIL_IND = FEIL_IND + 1;                             00001950
             END;                                                       00001960
                                                                        00001970
          IF FTS.TT_E66_M_EKNR ^= 0   &                                 00001980
             FTS.TT_E66_M_EKNR ^= 999 THEN                              00001990
             DO;                                                        00002000
                W01_FEIL_NR(FEIL_IND) = FTS.TT_E66_M_EKNR;              00002010
                IF FEIL_IND ^= 3  THEN                                  00002020
                   FEIL_IND = FEIL_IND + 1;                             00002030
             END;                                                       00002040
                                                                        00002050
          IF FTS.EK_INNTNR ^= 0   &                                     00002060
             FTS.EK_INNTNR ^= 999 THEN                                  00002070
             DO;                                                        00002080
                W01_FEIL_NR(FEIL_IND) = FTS.EK_INNTNR;                  00002090
                IF FEIL_IND ^= 3  THEN                                  00002100
                   FEIL_IND = FEIL_IND + 1;                             00002110
             END;                                                       00002120
                                                                        00002130
                                                                        00002140
          DO ANT_BARN = 1 TO 8;                                         00002150
                                                                        00002160
             IF FTB.FNR_BARNNR(ANT_BARN) ^= 0  &                        00002170
                FTB.FNR_BARNNR(ANT_BARN) ^= 999 THEN                    00002180
                DO;                                                     00002190
                   W01_FEIL_NR(FEIL_IND) = FTB.FNR_BARNNR(ANT_BARN);    00002200
                   IF FEIL_IND ^= 3 THEN                                00002210
                      FEIL_IND = FEIL_IND + 1;                          00002220
                END;                                                    00002230
                                                                        00002240
             IF FTB.RBT_BARNNR(ANT_BARN) ^= 0  &                        00002250
                FTB.RBT_BARNNR(ANT_BARN) ^= 999 THEN                    00002260
                DO;                                                     00002270
                   W01_FEIL_NR(FEIL_IND) = FTB.RBT_BARNNR(ANT_BARN);    00002280
                   IF FEIL_IND ^= 3 THEN                                00002290
                      FEIL_IND = FEIL_IND + 1;                          00002300
                END;                                                    00002310
                                                                        00002320
          END;                                                          00002330
                                                                        00002340
                                                                        00002350
    END FINN_FEIL_FT;                                                   00002360
                                                                        00002370
                                                                        00002380
                                                                        00002390
 %PAGE;                                                                 00002400
 /* ***************************************************************** */00002410
 /*          E K S T E R N E    P R O C E D U R E R                   */00002420
 /* ***************************************************************** */00002430
                                                                        00002440
                                                                        00002450
 %PAGE;                                                                 00002460
 %INCLUDE R0011202;          /*     BLANK FT TRANSOMR   */              00002470
 %PAGE;                                                                 00002480
 %INCLUDE R0011203;          /*     KONTR FT SØKER      */              00002490
 %PAGE;                                                                 00002500
 %INCLUDE R0011204;          /*     KONTR FT BARN       */              00002510
                                                                        00002520
                                                                        00002530
 END P112_BEHANDLE_FT;                                                  00002540
                                                                        00002550
                                                                        00002560
