 /*       SIST ENDRET 05/12-97 12.17.24 AV   JDA7339                  */00000000
 /*       SIST ENDRET 27/11-97 10.41.06 AV   JDA7339                  */00000010
 /*       SIST ENDRET 30/05-91 10.08.16 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 21/01-91 13.22.34 AV   DYBVIK                   */00000030
 /* ***************************************************************** */00000040
 /*                                                                   */00000050
 /* ***************************************************************** */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /* **********************                                            */00000080
 /*  PROGRAM-IDENT : R001N502 - SUBPROGRAM                            */00000090
 /*  PROGRAM-SPRÅK : PLI                                              */00000100
 /*  PROGRAMMERER  : HERMAN                                           */00000110
 /*  PROGRAMMET BLE LAGET : NOV 90                                    */00000120
 /* ***************************************************************** */00000130
 /*HENSIKT:                                                           */00000140
 /* **********                                                        */00000150
 /*  BLANKER AP_TRANS_OMR                                             */00000160
 /*                                                                   */00000170
 /* ***************************************************************** */00000180
 /*PROGRAMTILKNYTTING:                                                */00000190
 /* ********************                                              */00000200
 /*  PROGRAMMET INCLUDES AV R001N501 - KONTROLL_GRUNNBLANKETT_A1      */00000210
 /*  ALLE CICS-KOMMANDOS LIGGER I HOVEDPROG.                          */00000220
 /*  ARBEIDSOMRÅDET - P001N501 - ER INCLUDET I HOVEDPROG.             */00000230
 /*  DE INTERNE PROSEDYRER ER :                                       */00000240
 /*    BLANK_A1_SØKER:    BLANKER SØKERDELEN                          */00000250
 /*    BLANK_A1_BARN:     BLANKER BARNEDELEN                          */00000260
 /*    BLANK_A1_MELDNR:   SETTER 0 I MELDINGSNUMMERNE                 */00000270
 /*                                                                   */00000280
 /* ***************************************************************** */00000290
 /*DATASETTOPPLYSNINGER:                                              */00000300
 /* ***********************                                           */00000310
 /*    INGEN                                                          */00000320
 /* ***************************************************************** */00000330
 /*FEILMELDINGER:                                                     */00000340
 /* *******************                                               */00000350
 /*    INGEN                                                          */00000360
 /* ***************************************************************** */00000370
 %PAGE;                                /*   */                          00000380
 /* ***************************************************************** */00000390
 /*                                                                   */00000400
 /*    PROSEDYREN BLANKER A1_SØKERDELEN I A1_TRANS_OMR I              */00000410
 /*    KOM_OMR FOR ALDERPENSJONSSØKNADER.                             */00000420
 /*                                                                   */00000430
 /* ***************************************************************** */00000440
 %SKIP(2);                             /*   */                          00000450
 BLANK_A1_SØKER:                                                        00000460
   PROC OPTIONS(REENTRANT);                                             00000470
      A1S.REGDATO      = 0;                                             00000480
      A1S.TERMID       = '    ';                                        00000490
      A1S.VIRK_DATO_MÅ = 0;                                             00000500
      A1S.FNR          = 0;                                             00000510
      A1S.FNR_GML      = 0;                                             00000520
      A1S.NAVN         = (25)' ';                                       00000530
      A1S.TKNR         = 0;                                             00000540
      A1S.TILL_EK      = ' ';                                           00000550
      A1S.SIVILSTAND   = ' ';                                           00000560
      A1S.SPRÅK        = ' ';                                           00000570
      A1S.BT_ANT       = 0;                                             00000580
      A1S.NORSK_BOSATT = ' ';                                           00000590
      A1S.FAI          = 9999999;                                       00000600
      A1S.APD          = 999;                                           00000610
      A1S.EK_INNT_OVER_2G = ' ';                                        00000620
      A1S.FNR_EK       = 0;                                             00000630
      A1S.FNR_GML_EK   = 0;                                             00000640
      A1S.NAVN_EK      = (25)' ';                                       00000650
      A1S.MINST4G     = ' ';                                            00000660
      A1S.STATSBORGER   = 0;                                            00000670
      A1S.BOSATT        = 0;                                            00000680
      A1S.FRAVIK_FLYKT = ' ';                                           00000690
      A1S.OVERKOMP_UTL = ' ';                                           00000700
      A1S.IKKE_GP       = ' ';                                          00000710
      A1S.FRAVIK_TT_KONV   = 0;                                         00000720
      A1S.TT_16_66ÅR       = 0;                                         00000730
      A1S.TT_16_66MD       = 0;                                         00000740
      A1S.INNT_EK          = 0;                                         00000750
      A1S.PENSJON_BELØP    = 0;                                         00000760
   END BLANK_A1_SØKER;                                                  00000770
 %PAGE;                                /*   */                          00000780
 /* ***************************************************************** */00000790
 /*                                                                   */00000800
 /*    PROSEDYREN BLANKER A1_BARNEDELEN I A1_TRANS_OMR I              */00000810
 /*    KOM_OMR FOR ALDERPENSJONSSØKNADER.                             */00000820
 /*                                                                   */00000830
 /* ***************************************************************** */00000840
 %SKIP;                                                                 00000850
 BLANK_A1_BARN:                                                         00000860
   PROC;                                                                00000870
   DCL                                                                  00000880
      ANT_BARN FIXED BIN (15);                                          00000890
 %SKIP;                                                                 00000900
      DO ANT_BARN = 1 TO 12;                                            00000910
         A1B.FNR_BARN(ANT_BARN) = 0;                                    00000920
         A1B.FNR_GML_BARN(ANT_BARN) = 0;                                00000930
      END;                                                              00000940
   END BLANK_A1_BARN;                                                   00000950
 %PAGE;                                /* */                            00000960
 /* ***************************************************************** */00000970
 /*                                                                   */00000980
 /*    PROCEDURE FOR Å SETTE 0  MELDINGSNUMMERNE I A1_TRANS_OMR I     */00000990
 /*    KOM_OMR.                                                       */00001000
 /*                                                                   */00001010
 /* ***************************************************************** */00001020
 %SKIP(2);                                                              00001030
 BLANK_A1_MELDNR:                                                       00001040
   PROC;                                                                00001050
   DCL                                                                  00001060
      ANT_BARN FIXED BIN (15);                                          00001070
 %SKIP(2);                                                              00001080
      A1S.REGDATONR      = 0;                                           00001090
      A1S.TERMIDNR       = 0;                                           00001100
      A1S.FNRNR          = 0;                                           00001110
      A1S.NAVNNR         = 0;                                           00001120
      A1S.TKNRNR         = 0;                                           00001130
      A1S.TILL_EKNR      = 0;                                           00001140
      A1S.SIVILSTANDNR   = 0;                                           00001150
      A1S.SPRÅKNR        = 0;                                           00001160
      A1S.BT_ANTNR       = 0;                                           00001170
      A1S.NORSK_BOSATTNR = 0;                                           00001180
      A1S.FAINR          = 0;                                           00001190
      A1S.APDNR          = 0;                                           00001200
      A1S.EK_INNT_OVER_2GNR = 0;                                        00001210
      A1S.VIRK_DATO_MÅNR = 0;                                           00001220
      A1S.FNR_EKNR       = 0;                                           00001230
      A1S.NAVN_EKNR      = 0;                                           00001240
      A1S.MINST4GNR      = 0;                                           00001250
                                                                        00001260
      A1S.STATSBORGERNR   = 0;                                          00001270
      A1S.BOSATTNR        = 0;                                          00001280
      A1S.FRAVIK_FLYKTNR = 0;                                           00001290
      A1S.OVERKOMP_UTLNR = 0;                                           00001300
      A1S.IKKE_GPNR       = 0;                                          00001310
      A1S.FRAVIK_TT_KONVNR = 0;                                         00001320
      A1S.TT_16_66ÅRNR     = 0;                                         00001330
      A1S.TT_16_66MDNR     = 0;                                         00001340
      A1S.INNT_EKNR        = 0;                                         00001350
      A1S.PENSJON_BELØPNR  = 0;                                         00001360
                                       /*  */                           00001370
 /*  0 I MELDINGSNUMMERNE I  BARNEDELEN   */                            00001380
                                                                        00001390
      DO ANT_BARN = 1 TO 12;                                            00001400
         A1B.FNR_BARNNR(ANT_BARN) = 0;                                  00001410
      END;                                                              00001420
                                       /*  */                           00001430
   END BLANK_A1_MELDNR;                                                 00001440
