 /*       SIST ENDRET 19/05-98 13.04.06 AV   JDA7339                  */00000000
 /*       SIST ENDRET 19/05-98 12.51.03 AV   JDA7339                  */00000010
 /*       SIST ENDRET 04/02-91 14.02.11 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 12/01-88 09.59.21 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 21/04-86 10.07.18 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 22/01-85 10.45.41 AV   LUNDEBY                  */00000050
 /* ***************************************************************** */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /* **********************                                            */00000080
 /*  PROGRAM-IDENT : R0019H60  OMREGNING :  FNR-STYRT    HOVEDPROG    */00000090
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000100
 /*  PROGRAMMERER  : S. LUNDEBY DATA-UTVIKLING A/S                    */00000110
 /*  PROGRAMMET BLE LAGET : 1984                                      */00000120
 /*  ENDRINGERSDATO :                                                 */00000130
 /*  ENDRINGEN GJELDER:                                               */00000140
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000150
 /*                                                                   */00000160
 /* ***************************************************************** */00000170
 /*HENSIKT:                                                           */00000180
 /* **********                                                        */00000190
 /*  PROGRAMMET SAMMENLIGNER TILLEGGS-PENSJON OG POENGTALL FRA        */00000200
 /*  INFOTRYGD-KONTORENE .                                            */00000210
 /*  VED FORSKJELL SETTES TRANSKODE = 10 OG BEREGNING KALLES .        */00000220
 /*  DET FORETAS NY SAMMENLIGNING . ER DET FORTSATT FORSKJELL         */00000230
 /*  KALLES STØNADSBREV OG STATISTIKK-RUTINEN .                       */00000240
 /*  PROGRAM R0019001 SKAL OGSÅ KJØRES ETTERPÅ FOR UTSKRIVING AV      */00000250
 /*  STØNADSBREV.                                                     */00000260
 /*                                                                   */00000270
 /* ***************************************************************** */00000280
 /*PROGRAMTILKNYTTING:                                                */00000290
 /* ********************                                              */00000300
 /*  EXEC CICS LINK TIL :                                             */00000310
 /*                                                                   */00000320
 /*     R0013101   HENTER DATA TIL B01                                */00000330
 /*     R0014901   AUTOHENDELSE_BEREGNING                             */00000340
 /*     R0019H50   SKRIV B02                                          */00000350
 /*     R0016001   STAT TRANS                                         */00000360
 /*     R0019921   HENT MELDING FRA FEIL-MELD-BASEN                   */00000370
 /*                                                                   */00000380
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */00000390
 /*                                                                   */00000400
 /*     R0019913   F_SNUDATO                                          */00000410
 /*                                                                   */00000420
 /*  ARBEIDSOMRÅDER SOM BRUKES :                                      */00000430
 /*                                                                   */00000440
 /*          P0012002;                            PCB_UIB_PEKER_OMR   */00000450
 /*          P0014009;                            POENGREKKER         */00000460
 /*          P0019906;                            TRANS_OPPL_OMR      */00000470
 /*          P0019908;                            KOM_OMR             */00000480
 /*          P0019910;                            STYRINGS_OMR        */00000490
 /*          P0019911;                            TRANS_LISTE         */00000500
 /*          P0019912;                            DIV_PARAM_OMR       */00000510
 /*          P0019014;                            FNR TAB/ST.BREV     */00000520
 /*          P0019921;                            B00 , B01 , B02     */00000530
 /*          P0019925;                            GRUNNBELØPS-TABELL  */00000540
 /*                                                                   */00000550
 /* ***************************************************************** */00000560
 /*DATASETTOPPLYSNINGER:                                              */00000570
 /* ***********************                                           */00000580
 /*  INPUT-DATSETTET ER VSAM-FILEN P001.FNRSTYR OG RF-BASEN           */00000590
 /*  OUTPUT ER VSAMFILEN P001.FNRNOMR,                                */00000600
 /*            VSAMFILEN P001.OMRLOGG,                                */00000610
 /*            OPPDATERT RF-BASE,                                     */00000620
 /*            TRANSAKSJONSBASE TIL STATISTIKK OG                     */00000630
 /*            STØNADSBREV-BASEN                                      */00000640
 /*                                                                   */00000650
 /* ***************************************************************** */00000660
 /*FEILMELDINGER:                                                     */00000670
 /* *******************                                               */00000680
 /*  LISTE OVER FEIL SKRIVES UT                                       */00000690
 /*                                                                   */00000700
 /* ***************************************************************** */00000710
                                                                        00000720
  R0019H6:                                                              00000730
    PROC            (COMMAREA_PEKER)                                    00000740
           OPTIONS  (MAIN);                                             00000750
                                                                        00000760
    %PAGE;                                                              00000770
    %INCLUDE P0014009;                              /* POTALL_OPPL    */00000780
                                                                        00000790
    %PAGE;                                                              00000800
    %INCLUDE P0019906;                              /* TRANS_OPPL_OMR */00000810
                                                                        00000820
    %PAGE;                                                              00000830
    %INCLUDE P0019908;                              /* KOM_OMR        */00000840
                                                                        00000850
    %PAGE;                                                              00000860
    %INCLUDE P0019910;                              /* STYRINGS_OMR   */00000870
                                                                        00000880
    %PAGE;                                                              00000890
    %INCLUDE P0019912;                              /* DIV_PARAM_OMR  */00000900
                                                                        00000910
    %PAGE;                                                              00000920
    %INCLUDE P0019014;                              /* FNR TAB/ST.BREV*/00000930
                                                                        00000940
    %PAGE;                                                              00000950
       DCL 1 B00              BASED (B00_PEKER),                        00000960
    %INCLUDE P0019921;                              /* B00            */00000970
                                                                        00000980
    %PAGE;                                                              00000990
       DCL 1 B01              BASED (B01_PEKER),                        00001000
    %INCLUDE P0019921;                              /* B01            */00001010
                                                                        00001020
    %PAGE;                                                              00001030
       DCL 1 B02              BASED (B02_PEKER),                        00001040
    %INCLUDE P0019921;                              /* B02            */00001050
                                                                        00001060
    %PAGE;                                                              00001070
    %INCLUDE P0019924;                            /* GRUNNBELØPS VEIET*/00001080
    %PAGE;                                                              00001090
    %INCLUDE P0019925;                             /* GRUNNBELØPS-TAB */00001100
                                                                        00001110
    %PAGE;                                                              00001120
    %INCLUDE S0019H  ;                              /* MAP : OMREGNING*/00001130
                                                                        00001140
                                                                        00001150
    %PAGE;                                                              00001160
    /* ************************************************************** */00001170
    /*   INPUT RECORD                                                 */00001180
    /* ************************************************************** */00001190
                                                                        00001200
    DCL 1 FNRREC                         ,                              00001210
          2 FNR          FIXED DEC  ( 11),                              00001220
          2 TKNR         FIXED DEC  (  4),                              00001230
          2 VTP          FIXED DEC  (  4),                              00001240
          2 PT1          CHAR       (  1),                              00001250
          2 TP           FIXED DEC  (  5),                              00001260
          2 SPT          FIXED DEC  (3,2),                              00001270
          2 OPT          FIXED DEC  (3,2),                              00001280
          2 PÅ           FIXED DEC  (  3),                              00001290
          2 TT           FIXED DEC  (  3),                              00001300
          2 SPT_AVD      FIXED DEC  (3,2),                              00001310
          2 OPT_AVD      FIXED DEC  (3,2),                              00001320
          2 PÅ_AVD       FIXED DEC  (  3),                              00001330
          2 TT_AVD       FIXED DEC  (  3),                              00001340
          2 FILLER1      CHAR       ( 19);                              00001350
                                                                        00001360
                                                                        00001370
    /* ************************************************************** */00001380
    /*   OUTPUT RECORD                                                */00001390
    /* ************************************************************** */00001400
                                                                        00001410
    DCL 1 FNRKONT,                                                      00001420
          2 FNR          FIXED DEC  ( 11),                              00001430
          2 TKNR         FIXED DEC  (  4),                              00001440
          2 VTP          FIXED DEC  (  4),                              00001450
          2 PT1          CHAR       (  1),                              00001460
          2 SIVILST      CHAR       (  1),                              00001470
          2 TP           FIXED DEC  (  5),                              00001480
          2 SPT          FIXED DEC  (3,2),                              00001490
          2 OPT          FIXED DEC  (3,2),                              00001500
          2 PÅ           FIXED DEC  (  3),                              00001510
          2 TT           FIXED DEC  (  3),                              00001520
          2 TP_AVD       FIXED DEC  (  5),                              00001530
          2 SPT_AVD      FIXED DEC  (3,2),                              00001540
          2 OPT_AVD      FIXED DEC  (3,2),                              00001550
          2 PÅ_AVD       FIXED DEC  (  3),                              00001560
          2 TT_AVD       FIXED DEC  (  3),                              00001570
          2 TP_RF        FIXED DEC  (  5),                              00001580
          2 SPT_RF       FIXED DEC  (3,2),                              00001590
          2 OPT_RF       FIXED DEC  (3,2),                              00001600
          2 PÅ_RF        FIXED DEC  (  3),                              00001610
          2 TT_RF        FIXED DEC  (  3),                              00001620
          2 TP_AVD_RF    FIXED DEC  (  5),                              00001630
          2 SPT_AVD_RF   FIXED DEC  (3,2),                              00001640
          2 OPT_AVD_RF   FIXED DEC  (3,2),                              00001650
          2 PÅ_AVD_RF    FIXED DEC  (  3),                              00001660
          2 TT_AVD_RF    FIXED DEC  (  3);                              00001670
                                                                        00001680
    /* ************************************************************** */00001690
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00001700
    /* ************************************************************** */00001710
                                                                        00001720
       DCL                                                              00001730
         ( ADDR , CSTG , LOW , STG , SUBSTR , DATE , VERIFY , SYSPRINT ,00001740
           NULL , UNSPEC , STORAGE )  BUILTIN;                          00001750
                                                                        00001760
       DCL                                                              00001770
         PLITDLI                     ENTRY;                             00001780
                                                                        00001790
                                                                        00001800
    %PAGE;                                                              00001810
                                                                        00001820
    /* ************************************************************** */00001830
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00001840
    /* ************************************************************** */00001850
                                                                        00001860
    %INCLUDE DLIUIB;                                                    00001870
                                                                        00001880
       DCL                                                              00001890
           UIB_RC_OK                 BIT  (8)             INIT ( 0 ),   00001900
           COMMAREA_PEKER            POINTER,                           00001910
           ENDR_PEKER                POINTER,                           00001920
           MELD_PEKER                POINTER,                           00001930
           KEY_FNR_PEKER             POINTER,                           00001940
           OMR_FEIL_PEKER            POINTER;                           00001950
                                                                        00001960
                                                                        00001970
                                                                        00001980
                                                                        00001990
    /* ************************************************************** */00002000
    /*   PCB-PEKER-OMR                                                */00002010
    /* ************************************************************** */00002020
                                                                        00002030
    %PAGE;                                                              00002040
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00002050
                                                                        00002060
                                                                        00002070
                                                                        00002080
    DCL                                                                 00002090
        MELDING          CHAR      (78)     INIT ((78)' ')     ;        00002100
    DCL                                                                 00002110
      1 FEIL_STRUC,                                                     00002120
        2 FEIL_NR        FIXED DEC ( 5)     INIT (  0    )     ,        00002130
        2 FEIL_MELDING   CHAR      (78)     INIT ((78)' ')     ,        00002140
        2 KOM_OMR_PEKER  POINTER                               ;        00002150
    DCL                                                                 00002160
      1 FEIL_TAB,                                                       00002170
        2 MELD     (15)  CHAR      (78)                        ,        00002180
                                                                        00002190
        F_IND            FIXED BIN (15)     INIT  (0)          ;        00002200
                                                                        00002210
                                                                        00002220
    DCL KEY_PACK         FIXED DEC (11),                                00002230
        KEY_FNR_CHAR     CHAR      ( 6);                                00002240
                                                                        00002250
                                                                        00002260
    DCL DAGENS_DATO      CHAR (6)                              ;        00002270
                                                                        00002280
    DCL DAGENS_DATO_ÅR   DEF  DAGENS_DATO POS (1) PIC '99'     ,        00002290
        DAGENS_DATO_MND  DEF  DAGENS_DATO POS (3) PIC '99'     ,        00002300
        DAGENS_DATO_DAG  DEF  DAGENS_DATO POS (5) PIC '99'     ;        00002310
                                                                        00002320
    DCL W_DATO           CHAR (6)                              ;        00002330
                                                                        00002340
    DCL W_DATO_DAG       DEF  W_DATO      POS (1) PIC '99'     ,        00002350
        W_DATO_MND       DEF  W_DATO      POS (3) PIC '99'     ,        00002360
        W_DATO_ÅR        DEF  W_DATO      POS (5) PIC '99'     ;        00002370
                                                                        00002380
                                                                        00002390
    DCL FØDSELSNR                                  PIC '(11)9' ;        00002400
    DCL FØD_DAG            DEF FØDSELSNR   POS (1) PIC '99'    ,        00002410
        FØD_MND            DEF FØDSELSNR   POS (3) PIC '99'    ,        00002420
        FØD_ÅR             DEF FØDSELSNR   POS (5) PIC '99'    ,        00002430
        FØD_INDSIFF        DEF FØDSELSNR   POS (7) PIC '999'   ,        00002440
        FØD_KJØNN          DEF FØDSELSNR   POS (9) PIC '9'     ;        00002450
                                                                        00002460
    DCL FNR_PIC                            PIC '(11)9';                 00002470
    DCL FNR_CHAR DEF FNR_PIC               CHAR (11)  ;                 00002480
                                                                        00002490
                                                                        00002500
    DCL EOF_FNRSTYR            BIT  (1) INIT('0'B),                     00002510
        INGEN_FEIL             BIT  (1) INIT('1'B),                     00002520
        TRUE                   BIT  (1) INIT('1'B),                     00002530
        FALSE                  BIT  (1) INIT('0'B),                     00002540
        W_ANT_STATUS_OPPD      BIT  (1) INIT('0'B),                     00002550
        W_ANT_FØR_OMR_OPPD     BIT  (1) INIT('0'B),                     00002560
        W_ANT_ETTER_OMR_OPPD   BIT  (1) INIT('0'B),                     00002570
        FEIL_INPUT             BIT  (1) INIT('0'B);                     00002580
                                                                        00002590
    DCL KJØRE_SLUTT_TID_CHAR   CHAR (4),                                00002600
        KJØRE_SLUTT_TIM        PIC '99' DEF KJØRE_SLUTT_TID_CHAR,       00002610
        KJØRE_SLUTT_MIN        PIC '99' DEF KJØRE_SLUTT_TID_CHAR POS(3),00002620
                                                                        00002630
        KJØRE_SLUTT_TID_DEC    FIXED DEC ( 7);                          00002640
                                                                        00002650
                                                                        00002660
    DCL W_GRUNNBL_DATO         FIXED DEC ( 7);                          00002670
                                                                        00002680
    DCL DIFFERANSE         PIC'9999';                                   00002690
    DCL FORRIGE_TID        PIC'999B99B99'  INIT (0);                    00002700
    DCL NÅ_TID             PIC'999B99B99'  INIT (0);                    00002710
    DCL NÅ_TID_MIN         PIC'99'         DEF  NÅ_TID      POS(5);     00002720
    DCL NÅ_TID_TIM         PIC'999'        DEF  NÅ_TID;                 00002730
    DCL FORRIGE_TID_MIN    PIC'99'         DEF  FORRIGE_TID POS(5);     00002740
    DCL FORRIGE_TID_TIM    PIC'999'        DEF  FORRIGE_TID;            00002750
    DCL START_TID          PIC'999B99B99'  INIT (0);                    00002760
    DCL SLUTT_TID          PIC'999B99B99'  INIT (0);                    00002770
    DCL LES_TELLER         PIC'(7)9'       INIT (0);                    00002780
    DCL SPERRE_TELLER      PIC'(7)9'       INIT (0);                    00002790
    DCL BEH_TELLER         PIC'(7)9'       INIT (0);                    00002800
    DCL NEDRE_GR           PIC'(4)9'  INIT (0);                         00002810
    DCL OEVRE_GR           PIC'(4)9'  INIT (0);                         00002820
    DCL PIC4               PIC'(4)9'  INIT (0);                         00002830
    DCL PIC4_POS1          PIC'(2)9'  DEF PIC4 POS(1);                  00002840
    DCL PIC4_POS3          PIC'(2)9'  DEF PIC4 POS(3);                  00002850
                                                                        00002860
    DCL MAP_CHAR           CHAR(250)  BASED (BMSMAPBR);                 00002870
    DCL BRI_NUM_MDT        CHAR(1)    INIT  ('P');                      00002880
    DCL BRI_PROT_MDT       CHAR(1)    INIT  ('Z');                      00002890
    DCL NOR_NUM_MDT        CHAR(1)    INIT  ('J');                      00002900
    DCL NOR_NUM            CHAR(1)    INIT  ('&');                      00002910
    DCL FEIL_RBA           POINTER;                                     00002920
    DCL FNRKONT_RBA_PTR    POINTER;                                     00002930
    DCL RBA_PEKER          POINTER;                                     00002940
    DCL LOGG_RBA           POINTER;                                     00002950
    DCL BMSMAPBR           POINTER;                                     00002960
    DCL ANT_BEH            FIXED BIN (15) INIT (0);                     00002970
    DCL INTERVALL_TELL     FIXED BIN (15) INIT (1);                     00002980
    DCL FIXED_BIN15        FIXED BIN (15);                              00002990
    DCL LINJE_TELL         FIXED BIN (15);                              00003000
    DCL W_SØKER_IND        FIXED BIN (15);                              00003010
    DCL BARN_IND           FIXED BIN (15);                              00003020
    DCL TILKN_IND          FIXED BIN (15);                              00003030
    DCL PLASS_I_B02_IND    FIXED BIN (15);                              00003040
    DCL LOOP               FIXED BIN (15);                              00003050
    DCL I                  FIXED BIN (15);                              00003060
    DCL J                  FIXED DEC ( 3);                              00003070
    DCL K                  FIXED DEC ( 3);                              00003080
    DCL G_NÅ               FIXED DEC ( 5)  INIT ( 0 );                  00003090
    DCL G_FØR              FIXED DEC ( 5)  INIT ( 0 );                  00003100
    DCL W_PT1              CHAR      ( 1)  INIT (' ');                  00003110
    DCL W_PT2              CHAR      ( 1)  INIT (' ');                  00003120
    DCL TEKST              CHAR      (20)  INIT ((20)' ');              00003130
    DCL GRUNN_OMR1         CHAR      (1202);                            00003140
    DCL GRUNN_OMR2         CHAR      (1202);                            00003150
    DCL GRUNN_IDENT        CHAR      ( 8);                              00003160
                                                                        00003170
    DCL TIDS_PEKER         POINTER                      ,               00003180
        TIDS_TEST          CHAR (4)   BASED (TIDS_PEKER),               00003190
        TID_UTE            CHAR (4)                     ;               00003200
                                                                        00003210
                                                                        00003220
                                                                        00003230
                                                                        00003240
                                                                        00003250
                                                                        00003260
    /* ************************************************************** */00003270
    /*                                                                */00003280
    /*   SLUTT PÅ DEKLARASJONENE .   EKSEKVERINGEN STARTER            */00003290
    /*                                                                */00003300
    /* ************************************************************** */00003310
                                                                        00003320
                                                                        00003330
    EXEC CICS HANDLE CONDITION ERROR   (CICS_ABEND);                    00003340
                                                                        00003350
    ON ERROR SNAP                                                       00003360
       BEGIN;                                                           00003370
          ON ERROR SYSTEM;                                              00003380
          MELDING = 'STOPP P.G.A PLI - ABEND, FNR: '!!                  00003390
                     FNRREC.FNR  !! '  TA HARD-COPY !! TRYKK ENTER !!'; 00003400
          GOTO L999            ;                                        00003410
    END;                                                                00003420
                                                                        00003430
                                                                        00003440
                                                                        00003450
    ALLOCATE POTALL_OPPL                                              ; 00003460
    ALLOCATE PCB_UIB_PEKER_OMR                                        ; 00003470
    ALLOCATE B00,B01,B02                                              ; 00003480
    ALLOCATE GV_TAB_RE                                                ; 00003490
    ALLOCATE G_TAB_RE                                                 ; 00003500
                                                                        00003510
    KOM_OMR.STYRINGS_PEKER    = ADDR (KOM_OMR.STYRINGS_OMR   )        ; 00003520
    KOM_OMR.TRANS_OPPL_PEKER  = ADDR (KOM_OMR.TRANS_OPPL_OMR )        ; 00003530
    KOM_OMR.TRANS_PEKER       = ADDR (KOM_OMR.TRANS_OMR      )        ; 00003540
    KOM_OMR.TRANS_LISTE_PEKER = ADDR (KOM_OMR.TRANS_LISTE_OMR)        ; 00003550
    KOM_OMR.DIV_PARAM_PEKER   = ADDR (KOM_OMR.DIV_PARAM_OMR  )        ; 00003560
    KOM_OMR.GV_PEKER                = ADDR (GRUNN_OMR1             ) ;  00003570
    KOM_OMR.G_PEKER                 = ADDR (GRUNN_OMR2             ) ;  00003580
    FEIL_STRUC.KOM_OMR_PEKER  = COMMAREA_PEKER                        ; 00003590
    START_TID                 = EIBTIME                               ; 00003600
    FORRIGE_TID               = EIBTIME                               ; 00003610
    DAGENS_DATO               = DATE               ;/* ÅR MND DAG   */  00003620
    TID_UTE                   = ' @  '             ;/* X'40008000'  */  00003630
                                                                        00003640
                                                                        00003650
    B00                             =  '';                              00003660
    B01                             =  '';                              00003670
    B02                             =  '';                              00003680
    TRANS_LISTE_OMR                 =  '';                              00003690
    POTALL_OPPL                     =  '';                              00003700
    FNRREC                          =  '';                              00003710
    FEIL_TAB                        =  '';                              00003720
    I                               =   1;                              00003730
                                                                        00003740
    TRANS_OPPL_OMR.TRANSKODE        = 'AUTO'; /* IKKE AUTOBEREGNING   */00003750
    TRANS_OPPL_OMR.NY_GML_TRANS_IND = ' '   ;                           00003760
    TRANS_OPPL_OMR.FØDSNUMMER       =  0    ;                           00003770
    TRANS_OPPL_OMR.BLANKETTYPE      = '  '  ;                           00003780
    TRANS_OPPL_OMR.TRANS_RETURKODE  = '    ';                           00003790
    DIV_PARAM_OMR. FEIL_MELD_NR     =  0    ;                           00003800
    DIV_PARAM_OMR. KJØRINGS_TYPE    = 'S'   ;                           00003810
    GV_TAB_RE                       =  ''  ;                            00003820
    G_TAB_RE                        =  ''  ;                            00003830
                                                                        00003840
                                                                        00003850
                                                                        00003860
    /*------------------------------------------------------------*/    00003870
    /* KOMMER FRA R0010426 FØRSTE GANG VI KOMMER INN .            */    00003880
    /*------------------------------------------------------------*/    00003890
                                                                        00003900
                                                                        00003910
                                                                        00003920
    GRUNN_IDENT                     = 'P0019924';                       00003930
                                                                        00003940
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                      00003950
                                                                        00003960
    GRUNN_IDENT                     = 'P0019925';                       00003970
                                                                        00003980
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                      00003990
                                                                        00004000
                                                                        00004010
                                                                        00004020
    IF PROGRAM_ID    = 'R0010426' THEN                                  00004030
       DO;                                                              00004040
          PROGRAM_ID = 'R0019H60';                                      00004050
                                                                        00004060
          EXEC CICS HANDLE CONDITION NOTFND(NOTFND)  ENDFILE(NOTFND);   00004070
          EXEC CICS STARTBR  DATASET('OMRLOGG') RIDFLD(LOGG_RBA) RBA;   00004080
                                                                        00004090
          DO WHILE ('A' = 'A');                                         00004100
             EXEC CICS READNEXT DATASET('OMRLOGG') RIDFLD(LOGG_RBA) RBA 00004110
                                                   SET(BMSMAPBR);       00004120
          END;                                                          00004130
                                                                        00004140
          /*--------------------------------------------------------*/  00004150
          /* HENT FRA FILE                                          */  00004160
          /*--------------------------------------------------------*/  00004170
                                                                        00004180
  TILBAKE:                                                              00004190
                                                                        00004200
          EXEC CICS LOAD   PROGRAM ('S0019H3');                         00004210
          EXEC CICS SEND   MAP     ('S0019H6') MAPSET ('S0019H3')       00004220
                                               CURSOR   ERASE     ;     00004230
          EXEC CICS RETURN TRANSID ('RH60'   ) COMMAREA(KOM_OMR)  ;     00004240
                                                                        00004250
  NOTFND:                                                               00004260
          IF S0019H6O.FNRO        =  99999999999 THEN                   00004270
             DO;                                                        00004280
                MAP_CHAR          =  LOW (250);                         00004290
                S0019H6O.FNRO     =  0;                                 00004300
                S0019H6I.DATO_MÅL = -1;                                 00004310
                S0019H6O.DATO_MÅA =  BRI_NUM_MDT;                       00004320
                S0019H6O.MELDINGO = 'HER ER ALT I ORDEN FOR OPPSTART'   00004330
                                   !!' FRA BEGYNNELSEN AV BASEN';       00004340
             END;                                                       00004350
                                                                        00004360
          ELSE IF S0019H6O.RECORD_TYPEO ^= 'S' THEN                     00004370
             DO;                                                        00004380
                S0019H6O.FNRA          = BRI_NUM_MDT;                   00004390
                S0019H6I.FNRI          = LOW (11)   ;                   00004400
                S0019H6I.FNRL          = -1         ;                   00004410
                S0019H6O.STOPP_TIDA    = BRI_NUM_MDT;                   00004420
                S0019H6I.STOPP_TIDI    = LOW (4)    ;                   00004430
                S0019H6I.ANT_Ø_BEHI    = LOW (8)    ;                   00004440
                S0019H6O.ANT_Ø_BEHA    = BRI_NUM_MDT;                   00004450
                S0019H6I.ANT_FNR_INPUTI= LOW (7)    ;                   00004460
                S0019H6I.ANT_STATUSI   = LOW (7)    ;                   00004470
                S0019H6I.ANT_FØR_OMRI  = LOW (7)    ;                   00004480
                S0019H6I.ANT_ETTER_OMRI= LOW (7)    ;                   00004490
                S0019H6I.ANT_FEILI     = LOW (7)    ;                   00004500
                S0019H6O.MELDINGO   = 'HER HAR DET VÆRT UKONTROLLERT '!!00004510
                                     'AVBRUDD SJEKK START-FNR NØYE';    00004520
             END;                                                       00004530
                                                                        00004540
          ELSE    /*    S0019H6O.RECORD_TYPEO = 'S' */                  00004550
             DO;                                                        00004560
                S0019H6O.FNRA          =  NOR_NUM_MDT;                  00004570
                S0019H6O.STOPP_TIDA    =  BRI_NUM_MDT;                  00004580
                S0019H6I.STOPP_TIDI    =  LOW (4)    ;                  00004590
                S0019H6I.ANT_Ø_BEHL    =  -1         ;                  00004600
                S0019H6I.ANT_Ø_BEHI    =  LOW (8)    ;                  00004610
                S0019H6O.ANT_Ø_BEHA    =  BRI_NUM_MDT;                  00004620
                S0019H6I.ANT_FNR_INPUTI=  LOW (7)    ;                  00004630
                S0019H6I.ANT_STATUSI   =  LOW (7)    ;                  00004640
                S0019H6I.ANT_FØR_OMRI  =  LOW (7)    ;                  00004650
                S0019H6I.ANT_ETTER_OMRI=  LOW (7)    ;                  00004660
                S0019H6I.ANT_FEILI     =  LOW (7)    ;                  00004670
                S0019H6O.MELDINGO   = 'HER ER ALT I ORDEN FOR OPPSTART';00004680
             END;                                                       00004690
                                                                        00004700
                                                                        00004710
          /*--------------------------------------------------------*/  00004720
          /* SKRIVER START-INFO PÅ FEIL-LOGGEN .                    */  00004730
          /*--------------------------------------------------------*/  00004740
                                                                        00004750
          F_IND        =   1                                          ; 00004760
          PIC4         =   EIBTIME / 100                              ; 00004770
                                                                        00004780
          DAGENS_DATO  =   DATE                                       ; 00004790
          W_DATO_DAG   =   DAGENS_DATO_DAG                            ; 00004800
          W_DATO_MND   =   DAGENS_DATO_MND                            ; 00004810
          W_DATO_ÅR    =   DAGENS_DATO_ÅR                             ; 00004820
                                                                        00004830
                                                                        00004840
          MELDING      =  (78)' '                                     ; 00004850
          CALL P050_SKRIV_OMRFEIL                                     ; 00004860
                                                                        00004870
                                                                        00004880
          MELDING = ' OMREGNING : FNRSTYRT     START KL.: ' !! PIC4 !!  00004890
                    '   DATO : ' !! W_DATO                            ; 00004900
                                                                        00004910
          FEIL_STRUC.FEIL_MELDING  =   MELDING                        ; 00004920
          FEIL_TAB.MELD  (F_IND)   =   MELDING                        ; 00004930
          CALL P050_SKRIV_OMRFEIL                                     ; 00004940
                                                                        00004950
          F_IND                    =   F_IND        + 1               ; 00004960
          FEIL_STRUC.FEIL_MELDING  =   S0019H6O.MELDINGO              ; 00004970
          FEIL_TAB.MELD  (F_IND)   =   S0019H6O.MELDINGO              ; 00004980
          CALL P050_SKRIV_OMRFEIL                                     ; 00004990
                                                                        00005000
                                                                        00005010
          GOTO TILBAKE;                                                 00005020
       END;                                                             00005030
                                                                        00005040
                                                                        00005050
    EXEC CICS RECEIVE MAP ('S0019H6') MAPSET ('S0019H3')                00005060
                                      SET    (BMSMAPBR);                00005070
                                                                        00005080
                                                                        00005090
                                                                        00005100
                                                                        00005110
                                                                        00005120
    IF S0019H6I.FUNKSJONSKODEL        >  0   &                          00005130
       VERIFY(S0019H6I.FUNKSJONSKODEI,'RVEFIAX') = 0 THEN               00005140
       DO;                                                              00005150
          STYRINGS_OMR.FUNKSJONSKODE  = S0019H6I.FUNKSJONSKODEI ;       00005160
          EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR);       00005170
       END;                                                             00005180
                                                                        00005190
    ELSE                                                                00005200
       IF S0019H6I.STYRE_KODEL > 0 THEN                                 00005210
          DO;                                                           00005220
             STYRINGS_OMR.STYREKODE      = S0019H6I.STYRE_KODEI;        00005230
             EXEC CICS XCTL PROGRAM ('R0010420') COMMAREA (KOM_OMR);    00005240
          END;                                                          00005250
   /*                                                                   00005260
    IF S0019H6I.FUNKSJONSKODEL        >  0   &                          00005270
       S0019H6I.FUNKSJONSKODEI        = 'X'  THEN                       00005280
       DO;                                                              00005290
          STYRINGS_OMR.FUNKSJONSKODE  = 'X';                            00005300
          EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR);       00005310
       END;                                                             00005320
   */                                                                   00005330
                                                                        00005340
    KJØRE_SLUTT_TID_CHAR   = S0019H6I.STOPP_TIDI;                       00005350
                                                                        00005360
                                                                        00005370
    IF ^ F_NUMERISK (S0019H6I.DATO_MÅI) THEN                            00005380
       DO;                                                              00005390
          S0019H6I.DATO_MÅL = -1;                                       00005400
          MELDING           = 'TEGN SOM IKKE ER TALL I DATOFELT';       00005410
       END;                                                             00005420
                                                                        00005430
    ELSE IF ^ F_GYLDIG_DATO(S0019H6O.DATO_MÅO) THEN                     00005440
       DO;                                                              00005450
          S0019H6I.DATO_MÅL = -1;                                       00005460
          MELDING           = 'UGYLDIG DATO';                           00005470
       END;                                                             00005480
                                                                        00005490
    ELSE IF ^ F_NUMERISK(S0019H6I.FNRI) THEN                            00005500
       DO;                                                              00005510
          S0019H6I.FNRL = -1;                                           00005520
          MELDING       ='TEGN SOM IKKE ER TALL I FØDSELSNUMMER - FELT';00005530
       END;                                                             00005540
                                                                        00005550
    ELSE IF ^ F_GYLDIG_FNR(S0019H6O.FNRO) & S0019H6O.FNRO  > 0 THEN     00005560
       DO;                                                              00005570
          S0019H6I.FNRL = -1;                                           00005580
          MELDING       = 'UGYLDIG FØDSELSNUMMER ';                     00005590
       END;                                                             00005600
                                                                        00005610
    ELSE IF ^ F_NUMERISK(S0019H6I.ANT_Ø_BEHI) THEN                      00005620
       DO;                                                              00005630
          S0019H6I.ANT_Ø_BEHL = -1;                                     00005640
          MELDING             = 'TEGN SOM IKKE ER TALL I ANTALL - FELT';00005650
       END;                                                             00005660
                                                                        00005670
    ELSE IF  S0019H6O.ANT_Ø_BEHO = 1 & S0019H6I.FNRI = 0 THEN           00005680
       DO;                                                              00005690
          S0019H6I.ANT_Ø_BEHL    = -1;                                  00005700
          MELDING ='FEIL KOMBINASJON - KJØRE-ANTALL = 1 OG FNR = 0';    00005710
       END;                                                             00005720
                                                                        00005730
    ELSE IF ^ F_NUMERISK(S0019H6I.STOPP_TIDI) THEN                      00005740
       DO;                                                              00005750
          S0019H6I.STOPP_TIDL = -1;                                     00005760
          MELDING             = 'TEGN SOM IKKE ER TALL I TIDS - FELT';  00005770
       END;                                                             00005780
                                                                        00005790
    ELSE IF KJØRE_SLUTT_MIN   > 59 THEN                                 00005800
       DO;                                                              00005810
          S0019H6I.STOPP_TIDL = -1;                                     00005820
          MELDING             = 'URIKTIG TIDSANGIVELSE';                00005830
       END;                                                             00005840
    ELSE                                                                00005850
       DO;                                                              00005860
          KJØRE_SLUTT_TID_DEC  = S0019H6O.STOPP_TIDO * 100;             00005870
          EXEC CICS POST   TIME (KJØRE_SLUTT_TID_DEC) SET(TIDS_PEKER);  00005880
          EXEC CICS HANDLE CONDITION EXPIRED(EXPIRED);                  00005890
          EXEC CICS POST   TIME (KJØRE_SLUTT_TID_DEC) SET(TIDS_PEKER);  00005900
          LEAVE;                                                        00005910
  EXPIRED:                                                              00005920
           S0019H6I.STOPP_TIDL = -1;                                    00005930
           MELDING             = 'TIDSANGIVELSEN STOPPER TASKEN, '   !! 00005940
                                 'DEN ER MULIGENS FØR NÅ - TIDSPUNKT' ; 00005950
       END;                                                             00005960
                                                                        00005970
                                                                        00005980
                                                                        00005990
    /*----------------------------------------------------*/            00006000
    /*HVIS FEIL SENDES UT MELDING OG RETURN TIL CICS      */            00006010
    /*----------------------------------------------------*/            00006020
                                                                        00006030
    IF MELDING             ^= (78) ' '  THEN                            00006040
       CALL P040_MAP_UT_OG_RETUR;                                       00006050
                                                                        00006060
                                                                        00006070
                                                                        00006080
    /*----------------------------------------------------*/            00006090
    /*  INITIERING DATABASEN                              */            00006100
    /*----------------------------------------------------*/            00006110
                                                                        00006120
                                                                        00006130
    CALL P030_DATABASE    ('OPEN')                         ;            00006140
                                                                        00006150
    IF MELDING         ^= (78)' '                 THEN                  00006160
       GOTO L999;                                                       00006170
                                                                        00006180
                                                                        00006190
    IF S0019H6O.FNRO     >   0                     THEN                 00006200
       DO;                                                              00006210
          FNRREC.FNR    =   S0019H6O.FNRO                  ;            00006220
          KEY_PACK      =   FNRREC.FNR                     ;            00006230
          KEY_FNR_CHAR  =   KEY_PACK                       ;            00006240
        END;                                                            00006250
     ELSE                                                               00006260
       KEY_PACK         =   0                              ;            00006270
                                                                        00006280
    FNRREC.FNR          =   0                              ;            00006290
                                                                        00006300
                                                                        00006310
    /* ************************************************************** */00006320
    /*                                                                */00006330
    /*   TAR STARTBROWSE MED LOW(6) ELLER OPPGITT FNR                 */00006340
    /*                                                                */00006350
    /*   1) HVIS FNR   = 0 , HELE INPUTFILE LESES , FNR = LOW(6)      */00006360
    /*   2) HVIS FNR   > 0 , LESER F.O.M. DETTE FNR OG                */00006370
    /*      RESTEN AV FILEN HVIS ANTALL = 0                           */00006380
    /*   3) HVIS FNR   > 0 , LESER BARE DETTE FNR NÅR                 */00006390
    /*      ANTALL = 1                                                */00006400
    /*   4) HVIS FNR   > 0 OG ANTALL > 1 , LESER F.O.M. NESTE         */00006410
    /*      FNR OG RESTEN AV FILEN                                    */00006420
    /*                                                                */00006430
    /*      LESER 1. RECORD                                           */00006440
    /* ************************************************************** */00006450
                                                                        00006460
    EXEC CICS HANDLE   CONDITION ENDFILE          (ENDINP)            ; 00006470
                                                                        00006480
    EXEC CICS STARTBR  DATASET ('FNRSTYR') RIDFLD (KEY_FNR_CHAR)      ; 00006490
                                                                        00006500
    EXEC CICS READNEXT DATASET ('FNRSTYR') INTO   (FNRREC )             00006510
                                           RIDFLD (KEY_FNR_CHAR)      ; 00006520
                                                                        00006530
    FNR_PIC                   =  FNRREC.FNR                           ; 00006540
    CALL P070_FJERN_SIGN_F                                            ; 00006550
                                                                        00006560
                                                                        00006570
    /* ************************************************************** */00006580
    /*     LESER NESTE RECORD HVIS ANTALL > 1                         */00006590
    /* ************************************************************** */00006600
                                                                        00006610
    IF S0019H6O.ANT_Ø_BEHO   >   1   THEN                               00006620
       DO;                                                              00006630
          EXEC CICS READNEXT DATASET ('FNRSTYR') INTO (FNRREC)          00006640
                             RIDFLD  ( KEY_FNR_CHAR )                 ; 00006650
                                                                        00006660
          FNR_PIC         =  FNRREC.FNR                               ; 00006670
          CALL P070_FJERN_SIGN_F                                      ; 00006680
       END;                                                             00006690
                                                                        00006700
                                                                        00006710
    /*-------------------------------------------------------*/         00006720
    /* SENDER UT MAP MED BESKJED OM OPPSTART                 */         00006730
    /*-------------------------------------------------------*/         00006740
                                                                        00006750
    S0019H6O.MELDINGO     =  'BEHANDLINGEN FOREGÅR   '        ;         00006760
    S0019H6O.RECORD_TYPEO =  'O'                              ;         00006770
    S0019H6O.DATO_MÅA     =   BRI_PROT_MDT                    ;         00006780
    S0019H6O.FNRA         =   BRI_PROT_MDT                    ;         00006790
    S0019H6O.ANT_Ø_BEHA   =   BRI_PROT_MDT                    ;         00006800
    S0019H6O.STOPP_TIDA   =   BRI_PROT_MDT                    ;         00006810
    S0019H6O.START_TIDO   =   EIBTIME / 100                   ;         00006820
    S0019H6O.KLOKKE_LOGO  =   EIBTIME / 100                   ;         00006830
    S0019H6I.DATO_LOGI    =   DATE()                          ;         00006840
                                                                        00006850
    EXEC CICS SEND  MAP    ('S0019H6') MAPSET('S0019H3') WAIT DATAONLY; 00006860
    EXEC CICS WRITE DATASET('OMRLOGG') FROM  (MAP_CHAR )                00006870
                                      RIDFLD (LOGG_RBA ) RBA;           00006880
                                                                        00006890
    S0019H6O.RECORD_TYPEO =  'L';                                       00006900
                                                                        00006910
                                                                        00006920
                                                                        00006930
    DO ANT_BEH=1 TO S0019H6O.ANT_Ø_BEHO  WHILE (^EOF_FNRSTYR &          00006940
                                                 INGEN_FEIL  &          00006950
                                                 TIDS_TEST = LOW (4) ); 00006960
                                                                        00006970
                                                                        00006980
       IF FNRREC.FNR       >  00000000000 THEN                          00006990
          DO;                                                           00007000
                                                                        00007010
             W_ANT_STATUS_OPPD       =  FALSE                ;          00007020
             W_ANT_FØR_OMR_OPPD      =  FALSE                ;          00007030
             W_ANT_ETTER_OMR_OPPD    =  FALSE                ;          00007040
                                                                        00007050
             S0019H6O.ANT_FNR_INPUTO =  ANT_BEH              ;          00007060
             FNR_PIC                 =  FNRREC.FNR           ;          00007070
                                                                        00007080
             /*----------------------------------------------*/         00007090
             /* ENDBROWSE  . SYNCPOINT OG INIT PÅ BASENE TAS */         00007100
             /* HVIS SISTE BEHANDLING VAR FEILFRI .          */         00007110
             /*----------------------------------------------*/         00007120
                                                                        00007130
             EXEC CICS ENDBR DATASET    ('FNRSTYR')          ;          00007140
                                                                        00007150
             IF DIV_PARAM_OMR.FEIL_MELD_NR  = 0           THEN          00007160
                DO;                                                     00007170
                   EXEC CICS SYNCPOINT                       ;          00007180
                   CALL P030_DATABASE   ('OPEN'   )          ;          00007190
                END;                                                    00007200
                                                                        00007210
                                                                        00007220
             /*---------------------------------------------*/          00007230
             /* INITIERING FØR LES AV FAMILIEN. SISTE STATUS*/          00007240
             /*---------------------------------------------*/          00007250
                                                                        00007260
             B01                              =  ''          ;          00007270
             POTALL_OPPL                      =  ''          ;          00007280
             TRANS_OPPL_OMR.FØDSNUMMER        =  FNR_PIC     ;          00007290
             TRANS_OPPL_OMR.VIRKNINGSDATO     =  9999        ;          00007300
             DIV_PARAM_OMR. FEIL_MELD_NR      =  0           ;          00007310
                                                                        00007320
                                                                        00007330
             EXEC CICS LINK PROGRAM  ('R0013101')                       00007340
                            COMMAREA ( KOM_OMR  )            ;          00007350
                                                                        00007360
             IF FEIL_MELD_NR     =  602                   THEN          00007370
                DO;                                                     00007380
                   /*-----------------------------------------*/        00007390
                   /* PERSONEN ER DØD . HAN BEH. IKKE         */        00007400
                   /*-----------------------------------------*/        00007410
                                                                        00007420
                   FEIL_MELD_NR  =  0                          ;        00007430
                   GOTO LES_NESTE                              ;        00007440
                END;                                                    00007450
             ELSE                                                       00007460
                IF FEIL_MELD_NR     >  0                  THEN          00007470
                   DO;                                                  00007480
                      CALL P010_FEIL_I_BEH;                             00007490
                      GOTO LES_NESTE;                                   00007500
                   END;                                                 00007510
                ELSE                                                    00007520
                   PROGRAM_ID       = 'R0019H60';                       00007530
                                                                        00007540
             /*--------------------------------------------------*/     00007550
             /* SETTER B02 = B01 OG FINNER INDEKSER FØR BEREGNING*/     00007560
             /*--------------------------------------------------*/     00007570
                                                                        00007580
             B02               =  B01                             ;     00007590
                                                                        00007600
             DO I=1 TO 2  WHILE (B01.FNR (I) ^= FNRREC.FNR);            00007610
             END;                                                       00007620
                                                                        00007630
             SØKER_IND        =  I                                ;     00007640
                                                                        00007650
             IF SØKER_IND     =  1                             THEN     00007660
                EKTEF_IND     =  2                                ;     00007670
             ELSE                                                       00007680
                IF SØKER_IND  =  2                             THEN     00007690
                   EKTEF_IND  =  1                                ;     00007700
                                                                        00007710
             /*--------------------------------------------------*/     00007720
             /* TELLER ANT. MED LIK PENSJONSTYPE OG VTP          */     00007730
             /*--------------------------------------------------*/     00007740
                                                                        00007750
             IF FNRREC.VTP    =  B02.VIRK_DATO_ÅM (SØKER_IND)  &        00007760
                F510_GYLDIG_PENSTYPE                           THEN     00007770
                DO;                                                     00007780
                   S0019H6O.ANT_STATUSO  = S0019H6O.ANT_STATUSO + 1;    00007790
                   W_ANT_STATUS_OPPD     = TRUE                    ;    00007800
                END;                                                    00007810
                                                                        00007820
                                                                        00007830
             IF FNRREC.VTP    =  B01.VIRK_DATO_ÅM  (SØKER_IND) &        00007840
                F500_ULIKE_VERDIER                             &        00007850
                F510_GYLDIG_PENSTYPE                           THEN     00007860
                                                                        00007870
                DO;                                                     00007880
                   /*--------------------------------------------*/     00007890
                   /* TELLER ANT. MED ULIKE VERDIER FØR OMREGNING*/     00007900
                   /* TRANSTYPE = 27 FOR RIKTIG BEREGNING        */     00007910
                   /* CALL BEREGNING (B01,B02,SØKER_IND,         */     00007920
                   /*                 FAMILIE_IND,*TRANS*,       */     00007930
                   /*                 *POENREKKE,*POENGREKKE_EK, */     00007940
                   /*                 *FEIL_MELD_NR            ) */     00007950
                   /*--------------------------------------------*/     00007960
                                                                        00007970
                                                                        00007980
                   S0019H6O.ANT_FØR_OMRO = S0019H6O.ANT_FØR_OMRO + 1;   00007990
                   W_ANT_FØR_OMR_OPPD    = TRUE                     ;   00008000
                   TRANS_OPPL_OMR.TRANSTYPE   =  27                 ;   00008010
                                                                        00008020
                   CALL P020_BEREGNING;                                 00008030
                                                                        00008040
                                                                        00008050
                   IF FEIL_MELD_NR > 0       THEN                       00008060
                      DO;                                               00008070
                         CALL P010_FEIL_I_BEH;                          00008080
                         GOTO LES_NESTE;                                00008090
                      END;                                              00008100
                   ELSE                                                 00008110
                      PROGRAM_ID   =   'R0019H60';                      00008120
                                                                        00008130
                                                                        00008140
                   /*--------------------------------------------*/     00008150
                   /* ER DET FORTSATT ER ULIKE VERDIER   :       */     00008160
                   /*                                            */     00008170
                   /*    TRANSTYPE= 10. GIR RETT TEKST PÅ S-BREV.*/     00008180
                   /*    SKRIVES GAMLE OG NYE VERDIER PÅ         */     00008190
                   /*    EN KONTROLL-FIL                 ,       */     00008200
                   /*    HOVED-DB       (RF) OPPDATERES  ,       */     00008210
                   /*    STATISTIKK-DB  (SR) OPPDATERES  ,       */     00008220
                   /*    SKRIVES DET UT NYE STØNADSBREV  ,       */     00008230
                   /*    OMRSTAT-FILEN       OPPDATERES  ;       */     00008240
                   /*--------------------------------------------*/     00008250
                                                                        00008260
                   IF F500_ULIKE_VERDIER                 THEN           00008270
                      DO;                                               00008280
                         TRANS_OPPL_OMR.TRANSTYPE   =    10       ;     00008290
                         W_ANT_ETTER_OMR_OPPD       =    TRUE     ;     00008300
                         S0019H6O.ANT_ETTER_OMRO    =                   00008310
                                   S0019H6O.ANT_ETTER_OMRO + 1    ;     00008320
                                                                        00008330
                         CALL P060_SKRIV_KONTROLL_FILE            ;     00008340
                                                                        00008350
                      /* EXEC CICS LINK PROGRAM  ('R0019H50')           00008360
                       *                COMMAREA ( KOM_OMR  );          00008370
                                                                        00008380
                       * IF FEIL_MELD_NR > 0       THEN                 00008390
                       *    DO;                                         00008400
                       *       CALL P010_FEIL_I_BEH;                    00008410
                       *       GOTO LES_NESTE;                          00008420
                       *    END;                                        00008430
                       * ELSE                                           00008440
                       *    PROGRAM_ID   =        'R0019H60' ;          00008450
                                                                        00008460
                                                                        00008470
                       * EXEC CICS LINK PROGRAM  ('R0016001')           00008480
                       *                COMMAREA ( KOM_OMR  );          00008490
                                                                        00008500
                       * IF FEIL_MELD_NR > 0       THEN                 00008510
                       *    DO;                                         00008520
                       *       CALL P010_FEIL_I_BEH;                    00008530
                       *       GOTO LES_NESTE;                          00008540
                       *    END;                                        00008550
                       * ELSE                                           00008560
                       *    PROGRAM_ID   =        'R0019H60' ;          00008570
                                                                        00008580
                                                                        00008590
                       * EXEC CICS LINK PROGRAM  ('R0017001')           00008600
                       *                COMMAREA ( KOM_OMR  );          00008610
                                                                        00008620
                       * IF FEIL_MELD_NR > 0       THEN                 00008630
                       *    DO;                                         00008640
                       *       CALL P010_FEIL_I_BEH;                    00008650
                       *       GOTO LES_NESTE;                          00008660
                       *    END;                                        00008670
                       * ELSE                                           00008680
                       *    PROGRAM_ID   =        'R0019H60' ;          00008690
                      */                                                00008700
                      END;  /* IF F500_ULIKE_VERDIER        */          00008710
                                                                        00008720
                END;  /* IF LIK_PERIODE & F500_ULIKE_VERDIER*/          00008730
                                                                        00008740
                                                                        00008750
             IF INTERVALL_TELL * 10000 <=  ANT_BEH    THEN              00008760
                DO;                                                     00008770
                   EXEC CICS ASKTIME;                                   00008780
                   NÅ_TID               = EIBTIME;                      00008790
                   S0019H6O.KLOKKE_LOGO = EIBTIME / 100;                00008800
                   S0019H6I.DATO_LOGI   = DATE();                       00008810
                   DIFFERANSE           = NÅ_TID_TIM * 60 + NÅ_TID_MIN -00008820
                        FORRIGE_TID_TIM * 60         - FORRIGE_TID_MIN ;00008830
                   S0019H6O.MELDINGO    =                               00008840
                                        'MIN SISTE 10000 ER KJØRT PÅ: ' 00008850
                                   !! DIFFERANSE !! ',ANT:'!! ANT_BEH   00008860
                                   !! ' '        !!   FNRREC.FNR       ;00008870
                                                                        00008880
                   EXEC CICS SEND  MAP     ('S0019H6') MAPSET('S0019H3')00008890
                                                       WAIT    DATAONLY;00008900
                   EXEC CICS WRITE DATASET ('OMRLOGG') FROM  ( MAP_CHAR)00008910
                                   RIDFLD  ( LOGG_RBA) RBA;             00008920
                                                                        00008930
                   S0019H6O.ANT_FNR_INPUTO   = 0;                       00008940
                   S0019H6O.ANT_STATUSO      = 0;                       00008950
                   S0019H6O.ANT_FØR_OMRO     = 0;                       00008960
                   S0019H6O.ANT_ETTER_OMRO   = 0;                       00008970
                   S0019H6O.ANT_FEILO        = 0;                       00008980
                   INTERVALL_TELL            = INTERVALL_TELL + 1;      00008990
                   FORRIGE_TID               = NÅ_TID;                  00009000
                END;                                                    00009010
                                                                        00009020
                                                                        00009030
             /*-------------------------------------------------------*/00009040
             /* FAMILIE-BEH. OK . BLANKER FEILMELDINS-TABELLEN        */00009050
             /*-------------------------------------------------------*/00009060
                                                                        00009070
             FEIL_TAB            =   ''                              ;  00009080
          END;                                                          00009090
                                                                        00009100
  LES_NESTE:                                                            00009110
                                                                        00009120
       /*----------------------------------------*/                     00009130
       /* STARTBROWSE MED SIST LESTE NØKKEL      */                     00009140
       /*----------------------------------------*/                     00009150
                                                                        00009160
       KEY_PACK = FNRREC.FNR                                         ;  00009170
       KEY_FNR_CHAR = KEY_PACK;                                         00009180
                                                                        00009190
       EXEC CICS STARTBR  DATASET ('FNRSTYR')                           00009200
                          RIDFLD  ( KEY_FNR_CHAR )                   ;  00009210
                                                                        00009220
       EXEC CICS READNEXT DATASET ('FNRSTYR')                           00009230
            INTO (FNRREC) RIDFLD  ( KEY_FNR_CHAR )                   ;  00009240
                                                                        00009250
       FNR_PIC         =  FNRREC.FNR                                 ;  00009260
       CALL P070_FJERN_SIGN_F                                        ;  00009270
                                                                        00009280
                                                                        00009290
       IF S0019H6O.ANT_Ø_BEHO    >   1                         THEN     00009300
          DO;                                                           00009310
             EXEC CICS READNEXT DATASET ('FNRSTYR')   INTO   (FNRREC)   00009320
                                RIDFLD  (KEY_FNR_CHAR)               ;  00009330
                                                                        00009340
             FNR_PIC             =  FNRREC.FNR                       ;  00009350
             CALL P070_FJERN_SIGN_F                                  ;  00009360
          END;                                                          00009370
       ELSE                                                             00009380
          IF S0019H6O.ANT_Ø_BEHO = '1'                        THEN      00009390
             EOF_FNRSTYR         =  TRUE;                               00009400
                                                                        00009410
       GOTO  READ_OK;                                                   00009420
                                                                        00009430
  ENDINP:                                                               00009440
       EOF_FNRSTYR               =  TRUE;                               00009450
                                                                        00009460
       IF ANT_BEH                =  1            THEN                   00009470
          DO;                                                           00009480
             MELDING             = 'INPUT-FILEN ER TOM';                00009490
             CALL P040_MAP_UT_OG_RETUR;                                 00009500
          END;                                                          00009510
                                                                        00009520
  READ_OK:                                                              00009530
                                                                        00009540
    END;                                                                00009550
                                                                        00009560
    /*----------------------------------------------------------------*/00009570
    /*   SLUTT PÅ STYREMODUL .  INTERNE PROCEDURER FØLGER .           */00009580
    /*----------------------------------------------------------------*/00009590
                                                                        00009600
  L999:                                                                 00009610
    CALL   P999_SLUTT ;                                                 00009620
                                                                        00009630
                                                                        00009640
                                                                        00009650
                                                                        00009660
                                                                        00009670
    /* ************************************************************** */00009680
    /*                                                                */00009690
    /* PROCEDURE SOM SLETTER OPPDATERINGER , OG SKRIVER UT FEILMELD.  */00009700
    /*                                                                */00009710
    /* ************************************************************** */00009720
                                                                        00009730
                                                                        00009740
    P010_FEIL_I_BEH:                                                    00009750
      PROC;                                                             00009760
                                                                        00009770
                                                                        00009780
        /*------------------------------------------------------------*/00009790
        /* SLETTER OPPDATERINGER. SJEKKER OM TIDLIGERE SKREVNE FEIL   */00009800
        /* ER SLETTET (ROLLBACK). TAR VARE PÅ SISTE FEILMELDING .     */00009810
        /*------------------------------------------------------------*/00009820
                                                                        00009830
        S0019H6O.ANT_FEILO           =    S0019H6O.ANT_FEILO   +  1    ;00009840
        EXEC CICS SYNCPOINT ROLLBACK                                   ;00009850
                                                                        00009860
                                                                        00009870
        DO F_IND = 1 TO 15 WHILE    (FEIL_TAB.MELD (F_IND)^= (78)' ');  00009880
                                                                        00009890
           FEIL_STRUC.FEIL_MELDING = FEIL_TAB.MELD (F_IND);             00009900
           CALL P050_SKRIV_OMRFEIL;                                     00009910
        END;                                                            00009920
                                                                        00009930
                                                                        00009940
        IF F_IND               >  13           THEN                     00009950
           DO;                                                          00009960
              INGEN_FEIL       = '0'B                                 ; 00009970
              MELDING          = 'BEH. AV 7 FNR I SEKV. HAR ALLE ' !!   00009980
                                 'GITT FEIL . SJEKK FEILEN   !!! '    ; 00009990
              GOTO RETUR;                                               00010000
           END;                                                         00010010
                                                                        00010020
                                                                        00010030
        FEIL_STRUC.FEIL_MELDING = 'PROGRAM: '!! DIV_PARAM_OMR.PROGRAM_ID00010040
              !! ' FEIL VED LABEL: ' !! DIV_PARAM_OMR.FEIL_VED_LABEL  !!00010050
                 ' DB-STATUSKODE: '  !! DIV_PARAM_OMR.DB_STATUS_KODE  !!00010060
                 ' HOVEDFNR: '       !! FNR_PIC                        ;00010070
                                                                        00010080
                                                                        00010090
        FEIL_TAB.MELD (F_IND)    =   FEIL_STRUC.FEIL_MELDING           ;00010100
        CALL P050_SKRIV_OMRFEIL;                                        00010110
                                                                        00010120
                                                                        00010130
        F_IND                    =   F_IND        + 1                  ;00010140
        FEIL_STRUC.KOM_OMR_PEKER =   COMMAREA_PEKER                    ;00010150
        FEIL_STRUC.FEIL_NR       =   DIV_PARAM_OMR.FEIL_MELD_NR        ;00010160
        CALL P030_DATABASE         ('OPEN')                            ;00010170
                                                                        00010180
                                                                        00010190
        EXEC CICS  LINK PROGRAM    ('R0019921') COMMAREA(FEIL_STRUC)   ;00010200
                                                                        00010210
        FEIL_TAB.MELD (F_IND)    =   FEIL_STRUC.FEIL_MELDING           ;00010220
        CALL P050_SKRIV_OMRFEIL;                                        00010230
                                                                        00010240
                                                                        00010250
        F_IND                    =   F_IND        + 1                  ;00010260
        FEIL_STRUC.FEIL_MELDING  =   ' '                               ;00010270
        CALL P050_SKRIV_OMRFEIL                                        ;00010280
                                                                        00010290
  RETUR:                                                                00010300
        IF ^INGEN_FEIL                           THEN                   00010310
            CALL P040_MAP_UT_OG_RETUR                                  ;00010320
                                                                        00010330
 END P010_FEIL_I_BEH;                                                   00010340
                                                                        00010350
                                                                        00010360
                                                                        00010370
                                                                        00010380
    /* ************************************************************** */00010390
    /*                                                                */00010400
    /* PROCEDURE SOM JUSTERE FORV. INNTEKT,INDEXENE OG KALLER BEREGN  */00010410
    /*                                                                */00010420
    /* ************************************************************** */00010430
                                                                        00010440
    P020_BEREGNING:                                                     00010450
       PROCEDURE;                                                       00010460
                                                                        00010470
                                                                        00010480
       TRANS_OPPL_OMR.VIRKNINGSDATO  =  S0019H6O.DATO_MÅO ;             00010490
                                                                        00010500
                                                                        00010510
       PIC4 = F_SNU_DATO(S0019H6O.DATO_MÅO);                            00010520
                                                                        00010530
       DO I = 1 TO 60  UNTIL  (NEDRE_GR  <=    PIC4  &                  00010540
                               OEVRE_GR  >=    PIC4  );                 00010550
          NEDRE_GR  =  PERIODE_START_ÅMD (I) / 100    ;                 00010560
          OEVRE_GR  =  PERIODE_SLUTT_ÅMD (I) / 100    ;                 00010570
       END;                                                             00010580
                                                                        00010590
       G_NÅ         =  G_TAB_PERIODE.GRUNNBELØP(I);                     00010600
                                                                        00010610
                                                                        00010620
       PIC4 = B02.G_DATO_ÅM   (SØKER_IND)             ;                 00010630
                                                                        00010640
       DO I = 1 TO 60  UNTIL  (NEDRE_GR  <=    PIC4  &                  00010650
                               OEVRE_GR  >=    PIC4  );                 00010660
          NEDRE_GR  =  PERIODE_START_ÅMD (I) / 100    ;                 00010670
          OEVRE_GR  =  PERIODE_SLUTT_ÅMD (I) / 100    ;                 00010680
       END;                                                             00010690
                                                                        00010700
       G_FØR        =  G_TAB_PERIODE.GRUNNBELØP(I)    ;                 00010710
                                                                        00010720
                                                                        00010730
       IF B02.ETTEPENS.FORVENTET(SØKER_IND) >  0        THEN            00010740
                                                                        00010750
          B02.ETTEPENS.FORVENTET(SØKER_IND) =                           00010760
              B02.ETTEPENS.FORVENTET(SØKER_IND) * G_NÅ / G_FØR ;        00010770
                                                                        00010780
                                                                        00010790
                                                                        00010800
                                                                        00010810
       IF SØKER_IND                    =    3           THEN            00010820
          DO;                                                           00010830
             IF B02.FNR (1)            >    0           THEN            00010840
                FAMILIE_IND            =    1              ;            00010850
             ELSE                                                       00010860
                IF B02.FNR (2)         >    0           THEN            00010870
                   FAMILIE_IND         =    2              ;            00010880
          END;                                                          00010890
       ELSE                                                             00010900
          DO;                                                           00010910
             IF SØKER_IND              =    1           THEN            00010920
                DO;                                                     00010930
                   IF B02.FNR (2)      >    0           THEN            00010940
                      FAMILIE_IND      =    2              ;            00010950
                END;                                                    00010960
             ELSE                                                       00010970
                IF B02.FNR (1)         >    0           THEN            00010980
                   FAMILIE_IND         =    1              ;            00010990
          END;                                                          00011000
                                                                        00011010
                                                                        00011020
       EXEC CICS LINK PROGRAM  ('R0014001') COMMAREA (KOM_OMR);         00011030
                                                                        00011040
                                                                        00011050
    END  P020_BEREGNING;                                                00011060
                                                                        00011070
                                                                        00011080
                                                                        00011090
    /* ************************************************************** */00011100
    /*                                                                */00011110
    /* PROCEDURE SOM FORETAR INITIERINGS OG TERMINERINGS KALL         */00011120
    /*                                                                */00011130
    /* ************************************************************** */00011140
                                                                        00011150
    P030_DATABASE:                                                      00011160
      PROC  (STYRING);                                                  00011170
                                                                        00011180
      DCL                                                               00011190
        STYRING                               CHAR(5),                  00011200
        NULL                                  BUILTIN,                  00011210
        UNSPEC                                BUILTIN;                  00011220
                                                                        00011230
                                                                        00011240
     /* ************************************************************ */ 00011250
     /*DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-KALL*/ 00011260
     /* ************************************************************ */ 00011270
                                                                        00011280
     DCL                                                                00011290
       W01_PSB_NAVN                CHAR (8)       INIT('B001R001'),     00011300
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB '),         00011310
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00011320
                                                                        00011330
     /* ************************************************************ */ 00011340
     /* DLI CALL-PARAMETRE                                           */ 00011350
     /* ************************************************************ */ 00011360
                                                                        00011370
     DCL 1  W01_DLI_PARAM,                                              00011380
            2   W02_GU             CHAR (4)       INIT('GU  '),         00011390
            2   W02_PARM_CT_1      FIXED BIN(31)  INIT(1),              00011400
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT(3),              00011410
            2   W02_PARM_CT_4      FIXED BIN(31)  INIT(4);              00011420
                                                                        00011430
                                                                        00011440
      IF STYRING = 'OPEN' THEN                                          00011450
         DO;                                                            00011460
            CALL   PLITDLI                        (W02_PARM_CT_3,       00011470
                                                   W01_PCB_FUNCTION,    00011480
                                                   W01_PSB_NAVN,        00011490
                                                   UIBPTR);             00011500
                                                                        00011510
            IF DLIUIB.UIBFCTR                  =  '00000000'B THEN      00011520
               DO;                                                      00011530
                  PCB_UIB_PEKER_OMR.PCB_PEKER  =   UIBPCBAL;            00011540
                  PCB_UIB_PEKER_OMR.UIB_PEKER  =   UIBPTR;              00011550
               END;                                                     00011560
            ELSE                                                        00011570
               DO;                                                      00011580
                  MELDING  = 'NOE ER GALT ' !!                          00011590
                             'MED DATABASEN PÅ ÅPNINGSKALLET, KODE: ' !!00011600
                              UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);00011610
                  GOTO RETUR;                                           00011620
               END;                                                     00011630
         END;                                                           00011640
      ELSE                                                              00011650
         DO;                                                            00011660
            CALL   PLITDLI                        (W02_PARM_CT_1,       00011670
                                                   W01_TERM_FUNCTION);  00011680
            KOM_OMR.PCB_UIB_PEKER = NULL;                               00011690
         END;                                                           00011700
  RETUR:                                                                00011710
                                                                        00011720
    END P030_DATABASE;                                                  00011730
                                                                        00011740
                                                                        00011750
                                                                        00011760
    P040_MAP_UT_OG_RETUR:                                               00011770
      PROC;                                                             00011780
                                                                        00011790
         S0019H6O.MELDINGO      =   MELDING;                            00011800
         EXEC CICS SEND   MAP     ('S0019H6') MAPSET   ('S0019H3')      00011810
                                    DATAONLY CURSOR               ;     00011820
         EXEC CICS RETURN TRANSID ('RH60'  ) COMMAREA ( KOM_OMR ) ;     00011830
                                                                        00011840
    END P040_MAP_UT_OG_RETUR;                                           00011850
                                                                        00011860
                                                                        00011870
    P050_SKRIV_OMRFEIL:                                                 00011880
      PROC;                                                             00011890
                                                                        00011900
         EXEC CICS WRITE DATASET  ('OMRFEIL')                           00011910
              FROM (FEIL_STRUC.FEIL_MELDING )  RIDFLD (FEIL_RBA) RBA;   00011920
                                                                        00011930
    END P050_SKRIV_OMRFEIL;                                             00011940
                                                                        00011950
                                                                        00011960
                                                                        00011970
                                                                        00011980
                                                                        00011990
    /* ************************************************************** */00012000
    /*                                                                */00012010
    /* PROCEDURE SOM OVERFØRE OG SKRIVER UT GAMLE VERDIER             */00012020
    /*                                                                */00012030
    /* ************************************************************** */00012040
                                                                        00012050
                                                                        00012060
    P060_SKRIV_KONTROLL_FILE:                                           00012070
      PROC;                                                             00012080
                                                                        00012090
                                                                        00012100
      FNRKONT                  = ''                                 ;   00012110
                                                                        00012120
      FNRKONT.FNR              = FNRREC.FNR                         ;   00012130
      FNRKONT.TKNR             = FNRREC.TKNR                        ;   00012140
      FNRKONT.VTP              = FNRREC.VTP                         ;   00012150
      FNRKONT.PT1              = FNRREC.PT1                         ;   00012160
      FNRKONT.SIVILST          = B02.STATUS.SIVILSTAND (SØKER_IND)  ;   00012170
      FNRKONT.TP               = FNRREC.TP                          ;   00012180
      FNRKONT.SPT              = FNRREC.SPT                         ;   00012190
      FNRKONT.OPT              = FNRREC.OPT                         ;   00012200
      FNRKONT.PÅ               = FNRREC.PÅ                          ;   00012210
      FNRKONT.TT               = FNRREC.TT                          ;   00012220
      FNRKONT.SPT_AVD          = FNRREC.SPT_AVD                     ;   00012230
      FNRKONT.OPT_AVD          = FNRREC.OPT_AVD                     ;   00012240
      FNRKONT.PÅ_AVD           = FNRREC.PÅ_AVD                      ;   00012250
      FNRKONT.TT_AVD           = FNRREC.TT_AVD                      ;   00012260
                                                                        00012270
                                                                        00012280
                                                                        00012290
      SELECT  ( FNRREC.PT1);                                            00012300
                                                                        00012310
         WHEN ('A'   )                                                  00012320
            DO;                                                         00012330
               FNRKONT.TP_RF  = B02.ALDERSP.TP           (SØKER_IND) ;  00012340
               FNRKONT.SPT_RF = B02.ALDERSP.SPT          (SØKER_IND) ;  00012350
               FNRKONT.OPT_RF = B02.ALDERSP.OPT          (SØKER_IND) ;  00012360
               FNRKONT.PÅ_RF  = B02.ALDERSP.PÅ           (SØKER_IND) ;  00012370
               FNRKONT.TT_RF  = B02.STATUS.TT_ANV        (SØKER_IND) ;  00012380
            END;                                                        00012390
                                                                        00012400
         WHEN ('U'   )                                                  00012410
            DO;                                                         00012420
               FNRKONT.TP_RF  = B02.UFØRPENS.TP          (SØKER_IND) ;  00012430
               FNRKONT.SPT_RF = B02.UFØRPENS.SPT         (SØKER_IND) ;  00012440
               FNRKONT.OPT_RF = B02.UFØRPENS.OPT         (SØKER_IND) ;  00012450
               FNRKONT.PÅ_RF  = B02.UFØRPENS.PÅ          (SØKER_IND) ;  00012460
               FNRKONT.TT_RF  = B02.STATUS.TT_ANV        (SØKER_IND) ;  00012470
            END;                                                        00012480
                                                                        00012490
         WHEN ('E','J')                                                 00012500
            DO;                                                         00012510
               FNRKONT.SPT_AVD_RF  =                                    00012520
                                B02.ETTEPENS.SPT_AVD     (SØKER_IND) ;  00012530
               FNRKONT.OPT_AVD_RF  =                                    00012540
                                B02.ETTEPENS.OPT_AVD     (SØKER_IND) ;  00012550
               FNRKONT.PÅ_AVD_RF   =                                    00012560
                                B02.ETTEPENS.PÅ_AVD      (SØKER_IND) ;  00012570
               FNRKONT.TT_AVD_RF   =                                    00012580
                                B02.ETTEPENS.TP_PROSENT  (SØKER_IND) ;  00012590
            END;                                                        00012600
                                                                        00012610
         WHEN ('Æ'   )                                                  00012620
            DO;                                                         00012630
                                                                        00012640
               FNRKONT.TP_RF     = B02.ALDERSP.TP        (SØKER_IND) +  00012650
                                   B02.ETTEPENS.TP_NETTO (SØKER_IND) ;  00012660
               FNRKONT.SPT_RF    = B02.ALDERSP.SPT       (SØKER_IND) ;  00012670
               FNRKONT.OPT_RF    = B02.ALDERSP.OPT       (SØKER_IND) ;  00012680
               FNRKONT.PÅ_RF     = B02.ALDERSP.PÅ        (SØKER_IND) ;  00012690
               FNRKONT.TT_RF     = B02.STATUS.TT_ANV     (SØKER_IND) ;  00012700
                                                                        00012710
               FNRKONT.SPT_AVD_RF=                                      00012720
                                B02.ETTEPENS.SPT_AVD     (SØKER_IND) ;  00012730
               FNRKONT.OPT_AVD_RF=                                      00012740
                                B02.ETTEPENS.OPT_AVD     (SØKER_IND) ;  00012750
               FNRKONT.PÅ_AVD_RF =                                      00012760
                                B02.ETTEPENS.PÅ_AVD      (SØKER_IND) ;  00012770
               FNRKONT.TT_AVD_RF =                                      00012780
                                B02.ETTEPENS.TP_PROSENT  (SØKER_IND) ;  00012790
                                                                        00012800
            END;                                                        00012810
                                                                        00012820
         WHEN ('Y'   )                                                  00012830
            DO;                                                         00012840
               FNRKONT.TP_RF     = B02.UFØRPENS.TP       (SØKER_IND) +  00012850
                                   B02.ETTEPENS.TP_NETTO (SØKER_IND) ;  00012860
               FNRKONT.SPT_RF    = B02.UFØRPENS.SPT      (SØKER_IND) ;  00012870
               FNRKONT.OPT_RF    = B02.UFØRPENS.OPT      (SØKER_IND) ;  00012880
               FNRKONT.PÅ_RF     = B02.UFØRPENS.PÅ       (SØKER_IND) ;  00012890
               FNRKONT.TT_RF     = B02.STATUS.TT_ANV     (SØKER_IND) ;  00012900
                                                                        00012910
               FNRKONT.SPT_AVD_RF=                                      00012920
                                B02.ETTEPENS.SPT_AVD     (SØKER_IND) ;  00012930
               FNRKONT.OPT_AVD_RF=                                      00012940
                                B02.ETTEPENS.OPT_AVD     (SØKER_IND) ;  00012950
               FNRKONT.PÅ_AVD_RF =                                      00012960
                                B02.ETTEPENS.PÅ_AVD      (SØKER_IND) ;  00012970
               FNRKONT.TT_AVD_RF =                                      00012980
                                B02.ETTEPENS.TP_PROSENT  (SØKER_IND) ;  00012990
            END;                                                        00013000
                                                                        00013010
         OTHERWISE;                                                     00013020
      END;                                                              00013030
                                                                        00013040
                                                                        00013050
      EXEC CICS WRITE DATASET  ('FNRKONT')                              00013060
                          FROM ( FNRKONT ) RIDFLD (FNRKONT_RBA_PTR) RBA;00013070
                                                                        00013080
                                                                        00013090
    END P060_SKRIV_KONTROLL_FILE;                                       00013100
                                                                        00013110
                                                                        00013120
                                                                        00013130
                                                                        00013140
    /* ************************************************************** */00013150
    /*                                                                */00013160
    /* PROCEDURE FLYTTER DATA FREM OG TILBAKE GRUNNET NØYTRALT SIGN. */ 00013170
    /*                                                                */00013180
    /* ************************************************************** */00013190
                                                                        00013200
                                                                        00013210
    P070_FJERN_SIGN_F:                                                  00013220
      PROC                                                            ; 00013230
                                                                        00013240
      /* *********************************************************** */ 00013250
      /*   ARBEIDSOMR.                                               */ 00013260
      /* *********************************************************** */ 00013270
                                                                        00013280
      DCL 1 W01_REC                          ,                          00013290
            2 FNR          PIC       '( 11)9',                          00013300
            2 TKNR         PIC       '(  4)9',                          00013310
            2 VTP          PIC       '(  4)9',                          00013320
            2 PT1          CHAR       (  1)  ,                          00013330
            2 TP           PIC       '(  5)9',                          00013340
            2 SPT          PIC       '9V99'  ,                          00013350
            2 OPT          PIC       '9V99'  ,                          00013360
            2 PÅ           PIC       '(  3)9',                          00013370
            2 TT           PIC       '(  3)9',                          00013380
            2 SPT_AVD      PIC       '9V99'  ,                          00013390
            2 OPT_AVD      PIC       '9V99'  ,                          00013400
            2 PÅ_AVD       PIC       '(  3)9',                          00013410
            2 TT_AVD       PIC       '(  3)9',                          00013420
            2 FILLER1      CHAR       ( 19)  ;                          00013430
                                                                        00013440
                                                                        00013450
       W01_REC.FNR      =   FNRREC.FNR                              ;   00013460
       W01_REC.TKNR     =   FNRREC.TKNR                             ;   00013470
       W01_REC.VTP      =   FNRREC.VTP                              ;   00013480
       W01_REC.TP       =   FNRREC.TP                               ;   00013490
       W01_REC.SPT      =   FNRREC.SPT                              ;   00013500
       W01_REC.OPT      =   FNRREC.OPT                              ;   00013510
       W01_REC.PÅ       =   FNRREC.PÅ                               ;   00013520
       W01_REC.TT       =   FNRREC.TT                               ;   00013530
       W01_REC.SPT_AVD  =   FNRREC.SPT_AVD                          ;   00013540
       W01_REC.OPT_AVD  =   FNRREC.OPT_AVD                          ;   00013550
       W01_REC.PÅ_AVD   =   FNRREC.PÅ_AVD                           ;   00013560
       W01_REC.TT_AVD   =   FNRREC.TT_AVD                           ;   00013570
                                                                        00013580
       FNRREC.FNR       =   W01_REC.FNR                             ;   00013590
       FNRREC.TKNR      =   W01_REC.TKNR                            ;   00013600
       FNRREC.VTP       =   F_SNU_DATO (W01_REC.VTP)                ;   00013610
       FNRREC.TP        =   W01_REC.TP                              ;   00013620
       FNRREC.SPT       =   W01_REC.SPT                             ;   00013630
       FNRREC.OPT       =   W01_REC.OPT                             ;   00013640
       FNRREC.PÅ        =   W01_REC.PÅ                              ;   00013650
       FNRREC.TT        =   W01_REC.TT                              ;   00013660
       FNRREC.SPT_AVD   =   W01_REC.SPT_AVD                         ;   00013670
       FNRREC.OPT_AVD   =   W01_REC.OPT_AVD                         ;   00013680
       FNRREC.PÅ_AVD    =   W01_REC.PÅ_AVD                          ;   00013690
       FNRREC.TT_AVD    =   W01_REC.TT_AVD                          ;   00013700
                                                                        00013710
                                                                        00013720
    END P070_FJERN_SIGN_F;                                              00013730
                                                                        00013740
                                                                        00013750
                                                                        00013760
                                                                        00013770
    /* ************************************************************** */00013780
    /*                                                                */00013790
    /* PROCEDURE SOM FORETAR INITIERINGS OG TERMINERINGS KALL         */00013800
    /*                                                                */00013810
    /* ************************************************************** */00013820
                                                                        00013830
                                                                        00013840
    F500_ULIKE_VERDIER:                                                 00013850
      PROC                 RETURNS (BIT (1))                          ; 00013860
                                                                        00013870
      DCL RETUR                     BIT (1)    INIT   ('0'B)          ; 00013880
                                                                        00013890
                                                                        00013900
      SELECT  ( FNRREC.PT1);                                            00013910
                                                                        00013920
         WHEN ('A'   )                                                  00013930
            DO;                                                         00013940
              IF FNRREC.TP   ^= B02.ALDERSP.TP         (SØKER_IND) !    00013950
                 FNRREC.SPT  ^= B02.ALDERSP.SPT        (SØKER_IND) !    00013960
                 FNRREC.OPT  ^= B02.ALDERSP.OPT        (SØKER_IND) !    00013970
                 FNRREC.PÅ   ^= B02.ALDERSP.PÅ         (SØKER_IND) !    00013980
                 FNRREC.TT   ^= B02.STATUS.TT_ANV      (SØKER_IND) THEN 00013990
                                                                        00014000
                 RETUR        = '1'B                                  ; 00014010
            END;                                                        00014020
                                                                        00014030
         WHEN ('U'   )                                                  00014040
            DO;                                                         00014050
              IF FNRREC.TP   ^= B02.UFØRPENS.TP        (SØKER_IND) !    00014060
                 FNRREC.SPT  ^= B02.UFØRPENS.SPT       (SØKER_IND) !    00014070
                 FNRREC.OPT  ^= B02.UFØRPENS.OPT       (SØKER_IND) !    00014080
                 FNRREC.PÅ   ^= B02.UFØRPENS.PÅ        (SØKER_IND) !    00014090
                 FNRREC.TT   ^= B02.STATUS.TT_ANV      (SØKER_IND) THEN 00014100
                                                                        00014110
                 RETUR        = '1'B                                  ; 00014120
            END;                                                        00014130
                                                                        00014140
         WHEN ('E','J')                                                 00014150
            DO;                                                         00014160
              IF FNRREC.SPT_AVD ^=                                      00014170
                                B02.ETTEPENS.SPT_AVD    (SØKER_IND) !   00014180
                 FNRREC.OPT_AVD ^=                                      00014190
                                B02.ETTEPENS.OPT_AVD    (SØKER_IND) !   00014200
                 FNRREC.PÅ_AVD  ^=                                      00014210
                                B02.ETTEPENS.PÅ_AVD     (SØKER_IND)     00014220
                                                                        00014230
             /*  F501_ULIK_TP_PROS (FNRREC.TT_AVD,                      00014240
              *                     B02.STATUS.  SIVILSTAND(SØKER_IND), 00014250
              *                     B02.ETTEPENS.TP_PROSENT(SØKER_IND)) 00014260
             */                                                    THEN 00014270
                                                                        00014280
                 RETUR           = '1'B                               ; 00014290
            END;                                                        00014300
                                                                        00014310
         WHEN ('Æ'   )                                                  00014320
            DO;                                                         00014330
                                                                        00014340
              IF FNRREC.TP      ^= B02.ALDERSP.TP       (SØKER_IND) +   00014350
                                   B02.ETTEPENS.TP_NETTO(SØKER_IND) !   00014360
                 FNRREC.SPT     ^= B02.ALDERSP.SPT      (SØKER_IND) !   00014370
                 FNRREC.OPT     ^= B02.ALDERSP.OPT      (SØKER_IND) !   00014380
                 FNRREC.PÅ      ^= B02.ALDERSP.PÅ       (SØKER_IND) !   00014390
                 FNRREC.TT      ^= B02.STATUS.TT_ANV    (SØKER_IND) !   00014400
                                                                        00014410
                 FNRREC.SPT_AVD ^=                                      00014420
                                B02.ETTEPENS.SPT_AVD    (SØKER_IND) !   00014430
                 FNRREC.OPT_AVD ^=                                      00014440
                                B02.ETTEPENS.OPT_AVD    (SØKER_IND) !   00014450
                 FNRREC.PÅ_AVD  ^=                                      00014460
                                B02.ETTEPENS.PÅ_AVD     (SØKER_IND)     00014470
                                                                        00014480
              /* F501_ULIK_TP_PROS (FNRREC.TT_AVD,                      00014490
               *                    B02.STATUS.  SIVILSTAND(SØKER_IND), 00014500
               *                    B02.ETTEPENS.TP_PROSENT(SØKER_IND)) 00014510
              */                                                   THEN 00014520
                                                                        00014530
                 RETUR           = '1'B                               ; 00014540
            END;                                                        00014550
                                                                        00014560
         WHEN ('Y'   )                                                  00014570
            DO;                                                         00014580
              IF FNRREC.TP      ^= B02.UFØRPENS.TP      (SØKER_IND) !   00014590
                                   B02.ETTEPENS.TP_NETTO(SØKER_IND) !   00014600
                 FNRREC.SPT     ^= B02.UFØRPENS.SPT     (SØKER_IND) !   00014610
                 FNRREC.OPT     ^= B02.UFØRPENS.OPT     (SØKER_IND) !   00014620
                 FNRREC.PÅ      ^= B02.UFØRPENS.PÅ      (SØKER_IND) !   00014630
                 FNRREC.TT      ^= B02.STATUS.TT_ANV    (SØKER_IND) !   00014640
                                                                        00014650
                 FNRREC.SPT_AVD ^=                                      00014660
                                B02.ETTEPENS.SPT_AVD    (SØKER_IND) !   00014670
                 FNRREC.OPT_AVD ^=                                      00014680
                                B02.ETTEPENS.OPT_AVD    (SØKER_IND) !   00014690
                 FNRREC.PÅ_AVD  ^=                                      00014700
                                B02.ETTEPENS.PÅ_AVD     (SØKER_IND)     00014710
                                                                        00014720
              /* F501_ULIK_TP_PROS (FNRREC.TT_AVD,                      00014730
               *                    B02.STATUS.  SIVILSTAND(SØKER_IND), 00014740
               *                    B02.ETTEPENS.TP_PROSENT(SØKER_IND)) 00014750
              */                                                   THEN 00014760
                                                                        00014770
                 RETUR           = '1'B                               ; 00014780
            END;                                                        00014790
                                                                        00014800
                                                                        00014810
         OTHERWISE                                                      00014820
            RETUR                = '0'B                               ; 00014830
                                                                        00014840
      END;                                                              00014850
                                                                        00014860
                                                                        00014870
      RETURN  (RETUR);                                                  00014880
                                                                        00014890
                                                                        00014900
                                                                        00014910
      /*-------------------------------------------------------------*/ 00014920
      /*           I N T E R N   P R O C E D U R E                   */ 00014930
      /*          SOM SJEKKER OM TP_PROSENTEN ER LIK .               */ 00014940
      /*-------------------------------------------------------------*/ 00014950
                                                                        00014960
                                                                        00014970
      F501_ULIK_TP_PROS:                                                00014980
        PROC (W501_TP_PROS_INN , W501_SIVILST , W501_TP_PROS_RF )       00014990
                      RETURNS  (BIT       (1))                       ;  00015000
                                                                        00015010
        DCL W501_TP_PROS_INN    FIXED DEC (3)                        ,  00015020
            W501_SIVILST        CHAR      (1)                        ,  00015030
            W501_TP_PROS_RF     FIXED DEC (3)                        ,  00015040
            W501_RETUR          BIT       (1) INIT    ('0'B)         ;  00015050
                                                                        00015060
                                                                        00015070
                                                                        00015080
        IF W501_SIVILST                =  'S'                    THEN   00015090
                                                                        00015100
           IF W501_TP_PROS_INN         =   W501_TP_PROS_RF       THEN   00015110
              W501_RETUR               =  '0'B                       ;  00015120
           ELSE                                                         00015130
              W501_RETUR               =  '1'B                       ;  00015140
        ELSE                                                            00015150
           IF W501_TP_PROS_INN         =   W501_TP_PROS_RF       !      00015160
             (W501_TP_PROS_INN         =   55                &          00015170
              W501_TP_PROS_RF          =   0                  )  THEN   00015180
              W501_RETUR               =  '0'B                       ;  00015190
           ELSE                                                         00015200
              W501_RETUR               =  '1'B                       ;  00015210
                                                                        00015220
                                                                        00015230
        RETURN (W501_RETUR);                                            00015240
                                                                        00015250
      END F501_ULIK_TP_PROS;                                            00015260
                                                                        00015270
                                                                        00015280
    END F500_ULIKE_VERDIER;                                             00015290
                                                                        00015300
                                                                        00015310
                                                                        00015320
                                                                        00015330
                                                                        00015340
    /* ************************************************************** */00015350
    /*                                                                */00015360
    /* PROCEDURE SOM SJEKKER OM PENSJONTYPENE ER AKTUELLE             */00015370
    /*                                                                */00015380
    /* ************************************************************** */00015390
                                                                        00015400
                                                                        00015410
    F510_GYLDIG_PENSTYPE:                                               00015420
      PROC                 RETURNS (BIT (1))                          ; 00015430
                                                                        00015440
      DCL RETUR                     BIT (1)    INIT   ('0'B)          ; 00015450
                                                                        00015460
                                                                        00015470
                                                                        00015480
      IF FNRREC.PT1                    =  B01.PENSJONSTYPE1(SØKER_IND) !00015490
                                                                        00015500
        (FNRREC.PT1                    =  'Æ'                  &        00015510
         B01.PENSJONSTYPE1 (SØKER_IND) =  'A'                  &        00015520
         B01.PENSJONSTYPE2 (SØKER_IND) =  'E'                 )        !00015530
                                                                        00015540
        (FNRREC.PT1                    =  'Y'                  &        00015550
         B01.PENSJONSTYPE1 (SØKER_IND) =  'U'                  &        00015560
         B01.PENSJONSTYPE2 (SØKER_IND) =  'E'                 )     THEN00015570
                                                                        00015580
         RETUR                         =  '1'B                         ;00015590
                                                                        00015600
      RETURN  (RETUR);                                                  00015610
                                                                        00015620
    END F510_GYLDIG_PENSTYPE;                                           00015630
                                                                        00015640
                                                                        00015650
  /*----------------------------------------------------------------*/  00015660
  /*                                                                */  00015670
  /* DENNE KALLES VED NORMAL OG UNORMAL AVSLUTNING PÅ KJØRINGEN .   */  00015680
  /*                                                                */  00015690
  /*----------------------------------------------------------------*/  00015700
                                                                        00015710
                                                                        00015720
  P999_SLUTT:                                                           00015730
    PROC;                                                               00015740
                                                                        00015750
                                                                        00015760
    DCL UNORMAL_AVSLUTNING     BIT (1)     INIT ('0'B)               ;  00015770
                                                                        00015780
                                                                        00015790
    EXEC CICS HANDLE    CONDITION ERROR   (ABEND)                    ;  00015800
                                                                        00015810
    IF (S0019H6O.ANT_Ø_BEHO =  ANT_BEH   !                              00015820
        TIDS_TEST           =  TID_UTE      )   &                       00015830
                                                                        00015840
        MELDING             =  (78)' '              THEN                00015850
                                                                        00015860
        MELDING             =  'NORMALT AVSLUTTET PÅ FNR : ' !!         00015870
                                FNR_PIC !! '    TRYKK ENTER  !! '    ;  00015880
                                                                        00015890
    ELSE                                                                00015900
      IF MELDING                        =   (78)' '      &              00015910
         TIDS_TEST                     ^=   TID_UTE               THEN  00015920
         DO;                                                            00015930
            IF ANT_BEH                  =   0                     THEN  00015940
               DO;                                                      00015950
                  /*--------------------------------------------------*/00015960
                  /* INGEN RECORD BEHANDLET                           */00015970
                  /*--------------------------------------------------*/00015980
                                                                        00015990
                  S0019H6O.ANT_Ø_BEHA   =   BRI_PROT_MDT              ; 00016000
                  S0019H6O.STOPP_TIDA   =   BRI_PROT_MDT              ; 00016010
                  S0019H6O.START_TIDO   =   EIBTIME / 100             ; 00016020
                                                                        00016030
                  MELDING         =  'SISTE FNR PÅ FILEN ER FNR : ' !!  00016040
                                      FNR_PIC !! '    TRYKK ENTER   !!';00016050
               END;                                                     00016060
            ELSE                                                        00016070
                                                                        00016080
               MELDING            =  'NORMALT AVSLUTTET PÅ FNR : ' !!   00016090
                                      FNR_PIC !! '   TRYKK ENTER   !!'; 00016100
                                                                        00016110
         END;                                                           00016120
      ELSE                                                              00016130
         DO;                                                            00016140
                                                                        00016150
            /*--------------------------------------------------------*/00016160
            /* FEIL I BEH. OPPDATERINGENE FJERNES OG TELLERE RESTILLES*/00016170
            /*--------------------------------------------------------*/00016180
                                                                        00016190
            EXEC CICS SYNCPOINT ROLLBACK                               ;00016200
                                                                        00016210
            S0019H6O.ANT_FNR_INPUTO    =  S0019H6O.ANT_FNR_INPUTO  -  1;00016220
                                                                        00016230
            IF W_ANT_STATUS_OPPD                                    THEN00016240
               S0019H6O.ANT_STATUSO    =  S0019H6O.ANT_STATUSO     -  1;00016250
                                                                        00016260
            IF W_ANT_FØR_OMR_OPPD                                   THEN00016270
               S0019H6O.ANT_FØR_OMRO   =  S0019H6O.ANT_FØR_OMRO    -  1;00016280
                                                                        00016290
            IF W_ANT_ETTER_OMR_OPPD                                 THEN00016300
               S0019H6O.ANT_ETTER_OMRO =  S0019H6O.ANT_ETTER_OMRO  -  1;00016310
                                                                        00016320
            UNORMAL_AVSLUTNING         =  TRUE                         ;00016330
         END;                                                           00016340
                                                                        00016350
                                                                        00016360
    /*---------------------------------------------------------------*/ 00016370
    /* SKRIVER UT FEILMELDINGER FRA TAB. SOM TIDLIGERE ER FJERNET    */ 00016380
    /* VED  :     SYNCPOINT  ROLLBACK                                */ 00016390
    /*---------------------------------------------------------------*/ 00016400
                                                                        00016410
    DO F_IND = 1 TO 15 WHILE    (FEIL_TAB.MELD (F_IND) ^=  (78)' '    );00016420
                                                                        00016430
       FEIL_STRUC.FEIL_MELDING = FEIL_TAB.MELD (F_IND);                 00016440
       CALL P050_SKRIV_OMRFEIL;                                         00016450
    END;                                                                00016460
                                                                        00016470
                                                                        00016480
    EXEC CICS ASKTIME                                                 ; 00016490
    S0019H6O.KLOKKE_LOGO     =  EIBTIME / 100                         ; 00016500
    S0019H6I.DATO_LOGI       =  DATE()                                ; 00016510
    FEIL_STRUC.FEIL_MELDING  =  FNR_PIC    !! '   ' !!                  00016520
                               S0019H6O.KLOKKE_LOGO                   ; 00016530
    CALL P050_SKRIV_OMRFEIL;                                            00016540
                                                                        00016550
                                                                        00016560
    S0019H6O.MELDINGO        =   MELDING;                               00016570
    FEIL_STRUC.FEIL_MELDING  =   MELDING;                               00016580
    CALL P050_SKRIV_OMRFEIL;                                            00016590
                                                                        00016600
    /*------------------------------------------------------------*/    00016610
    /*    TERMINERER PSB'EN                                       */    00016620
    /*    SENDER UT MAP'EN OG SKRIVER PÅ LOGGEN .                 */    00016630
    /*    SIMULERER NY INNGANG FRA R0010426 HVIS ABEND            */    00016640
    /*------------------------------------------------------------*/    00016650
                                                                        00016660
    CALL P030_DATABASE    ('TERM')                                ;     00016670
                                                                        00016680
    EXEC CICS SEND MAP ('S0019H6') MAPSET ('S0019H3') WAIT              00016690
                                           DATAONLY;                    00016700
    S0019H6O.RECORD_TYPEO    = 'S';                                     00016710
    S0019H6O.FNRO            =  FNRREC.FNR;                             00016720
                                                                        00016730
                                                                        00016740
    IF ANT_BEH              >  0                      THEN              00016750
                                                                        00016760
       EXEC CICS WRITE DATASET ('OMRLOGG') FROM     ( MAP_CHAR)         00016770
                                           RIDFLD   ( LOGG_RBA) RBA;    00016780
                                                                        00016790
                                                                        00016800
    IF UNORMAL_AVSLUTNING                                      THEN     00016810
       DO;                                                              00016820
          DIV_PARAM_OMR.PROGRAM_ID  = 'R0010426'                   ;    00016830
          EXEC CICS RETURN TRANSID   ('RH60') COMMAREA ( KOM_OMR ) ;    00016840
       END;                                                             00016850
    ELSE                                                                00016860
       DO;                                                              00016870
          EXEC CICS RECEIVE MAP ('S0019H6') MAPSET ('S0019H3')          00016880
                                            SET    (BMSMAPBR);          00016890
                                                                        00016900
          /*------------------------------------------------------*/    00016910
          /* SIMULERER INGANG FRA R0010301                        */    00016920
          /*------------------------------------------------------*/    00016930
                                                                        00016940
          DIV_PARAM_OMR.PROGRAM_ID  = 'R0010301'                   ;    00016950
          TRANS_OPPL_OMR.TRANSKODE  = 'RA20'                       ;    00016960
          EXEC CICS XCTL PROGRAM ('R0010420') COMMAREA ( KOM_OMR ) ;    00016970
       END;                                                             00016980
                                                                        00016990
  END P999_SLUTT;                                                       00017000
                                                                        00017010
                                                                        00017020
                                                                        00017030
                                                                        00017040
  /* ********************************************************** */      00017050
  /* LABLER VED ABEND-SITUASJONER                               */      00017060
  /* ********************************************************** */      00017070
                                                                        00017080
                                                                        00017090
  CICS_ABEND:                                                           00017100
    MELDING = 'STOPP P.G.A CICS - ABEND, FNR: ' !!                      00017110
               FNR_PIC  !! ' TA HARD-COPY !! TRYKK ENTER !! '      ;    00017120
                                                                        00017130
    CALL P999_SLUTT ;                                                   00017140
                                                                        00017150
                                                                        00017160
  ABEND:                                                                00017170
    EXEC CICS ABEND ABCODE ('FEIL')                                ;    00017180
                                                                        00017190
                                                                        00017200
                                                                        00017210
  /* ********************************************************** */      00017220
  /*          E K S T E R N E    P R O C E D U R E R            */      00017230
  /* ********************************************************** */      00017240
                                                                        00017250
                                                                        00017260
                                                                        00017270
 %INCLUDE R0019901;          /*     F_GYLDIG_DATO       */              00017280
 %PAGE;                                                                 00017290
 %INCLUDE R0019902;          /*     F_KJØNN             */              00017300
 %PAGE;                                                                 00017310
 %INCLUDE R0019904;          /*     F_GYLDIG_FNR        */              00017320
 %PAGE;                                                                 00017330
 %INCLUDE R0019910;          /*     F_NUMERISK          */              00017340
 %PAGE;                                                                 00017350
 %INCLUDE R0019913;          /*     F_SNU_DATO          */              00017360
 %PAGE;                                                                 00017370
 %INCLUDE R0019956;          /*     P9956_BER_G_CICS    */              00017380
                                                                        00017390
                                                                        00017400
                                                                        00017410
 END R0019H6;                                                           00017420
