 /*       SIST ENDRET 26/02-97 09.48.50 AV   JDA7339                  */00000000
 /*       SIST ENDRET 25/02-97 11.47.45 AV   JDA7339                  */00000010
 /*       SIST ENDRET 05/02-96 12.30.14 AV   JDA0310                  */00000020
 /*       SIST ENDRET 09/01-96 14.27.34 AV   JDA0310                  */00000030
 /* ***************************************************************** */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /* **********************                                            */00000060
 /*  PROGRAM-IDENT : R001A412  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000070
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000080
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000090
 /*  PROGRAMMET BLE LAGET : DESEMBER 1982                             */00000100
 /*  ENDRINGSDATO : 31.08.89                                          */00000110
 /*  ENDRINGEN GJELDER: AFP - UNGE UFØRE FØR 1967                     */00000120
 /*  ENDRINGEN BLE UTFØRT AV : TRUDE                                  */00000130
 /*                                                                   */00000140
 /* ***************************************************************** */00000150
 /*HENSIKT:                                                           */00000160
 /* **********                                                        */00000170
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000180
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000190
 /*    FORHÅND.                                                       */00000200
 /*    ALLE MAPS HØRER INN UNDER MAPSET 'S001T1'.                     */00000210
 /*                                                                   */00000220
 /* ***************************************************************** */00000230
 /*PROGRAMTILKNYTTING:                                                */00000240
 /* ********************                                              */00000250
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010410 - FORESPØRSEL ELLER */00000260
 /*                                  FRA R0010450 - ENDRINGER.        */00000270
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000280
 /*    BRUK :                                                         */00000290
 /*    EXEC CICS XCTL PROGRAM ('R0010412') COMMAREA(KOM_OMR);         */00000300
 /*    PROGRAMMET INCLUDER :                                          */00000310
 /*               R0010506   FLYTT FRA ARB.OMRÅDE TIL MAP    AP       */00000320
 /*               R0010507   FORTEKSTER OG ATTRIBUTTER       AP       */00000330
 /*               R0010606   FLYTT FRA ARB.OMRÅDE TIL MAP    UP       */00000340
 /*               R0010607   FORTEKSTER OG ATTRIBUTTER       UP       */00000350
 /*               R0010706   FLYTT FRA ARB.OMRÅDE TIL MAP    ST       */00000360
 /*               R0010806   FLYTT FRA ARB.OMRÅDE TIL MAP    EP       */00000370
 /*               R0010807   FORTEKSTER OG ATTRIBUTTER       EP       */00000380
 /*               R0010906   FLYTT FRA ARB.OMRÅDE TIL MAP    EF       */00000390
 /*               R0010907   FORTEKSTER OG ATTRIBUTTER       EF       */00000400
 /*               R0011006   FLYTT FRA ARB.OMRÅDE TIL MAP    FB       */00000410
 /*               R0011106   FLYTT FRA ARB.OMRÅDE TIL MAP    BP       */00000420
 /*               R001NB06   FLYTT FRA ARB.OMRÅDE TIL MAP    B6       */00000430
 /*               R0011206   FLYTT FRA ARB.OMRÅDE TIL MAP    FT       */00000440
 /*               R0011207   FORTEKSTER OG ATTRIBUTTER       FT       */00000450
 /*               R0011406   FLYTT FRA ARB.OMRÅDE TIL MAP    E1       */00000460
 /*               R001UE06   FLYTT FRA ARB.OMRÅDE TIL MAP    EN       */00000470
 /*               R0011506   FLYTT FRA ARB.OMRÅDE TIL MAP    E2       */00000480
 /*               R0011606   FLYTT FRA ARB.OMRÅDE TIL MAP    O1       */00000490
 /*               R0011706   FLYTT FRA ARB.OMRÅDE TIL MAP    O2       */00000500
 /*               R0011836   FLYTT FRA ARB.OMRÅDE TIL MAP    UF       */00000510
 /*               R0019912   PIC TIL CHAR OG MOTSATT                  */00000520
 /*                                                                   */00000530
 /* ***************************************************************** */00000540
 /*DATASETTOPPLYSNINGER:                                              */00000550
 /* ***********************                                           */00000560
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000570
 /*                                                                   */00000580
 /* ***************************************************************** */00000590
 /*FEILMELDINGER:                                                     */00000600
 /* *******************                                               */00000610
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000620
 /*                                                                   */00000630
 /* ***************************************************************** */00000640
                                                                        00000650
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000660
                                                                        00000670
 %PAGE;                                                                 00000680
 %INCLUDE S001F1;    /* MAPPER FOR BLANKETTENE    */                    00000690
 %PAGE;                                                                 00000700
                                                                        00000710
 %INCLUDE P0019906;  /* TRANS-OPPL-OMRÅDE (BASED) */                    00000720
 %PAGE;                                                                 00000730
 %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)        */                    00000740
 %PAGE;                                                                 00000750
 %INCLUDE P0019910;  /* STYRINGS - OMRÅDE (BASED) */                    00000760
 %PAGE;                                                                 00000770
 %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE(BASED)   */                    00000780
 %PAGE;                                                                 00000790
 %INCLUDE P0019913;  /* LOKAL - KOM_OMR (BASED)   */                    00000800
 %PAGE;                                                                 00000810
 DCL  FORKASTES      BIT (1)  INIT ('0'B);                              00000820
                                                                        00000830
 DCL                                                                    00000840
    QUENAME                CHAR(8),                                     00000850
       QTERMID             CHAR(4) DEF QUENAME POS(1),                  00000860
       REST                CHAR(4) DEF QUENAME POS(5);                  00000870
                                                                        00000880
 DCL                                                                    00000890
    1 ROUTELIST,                                                        00000900
      2 PRINTER,                                                        00000910
        3 TERMID           CHAR(4),                                     00000920
        3 REST             CHAR(12),                                    00000930
      2 SISTE,                                                          00000940
        3 SLUTT            FIXED BIN(15),                               00000950
        3 REST             CHAR(14);                                    00000960
                                                                        00000970
 DCL      (CSTG,ADDR )                   BUILTIN;                       00000980
                                                                        00000990
 DCL  COMMAREA_PEKER         PTR,                                       00001000
      LOKAL_KOM_PTR          PTR,                                       00001010
                                                                        00001020
      LOW_CHAR_BASED        CHAR(1200)  BASED(BMSMAPBR),                00001030
      LENGTH                 FIXED BIN(15);                             00001040
                                                                        00001050
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00001060
 DCL                                                                    00001070
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00001080
    DFHBMUNP             CHAR(1) INIT(' '),                             00001090
    DFHBMBRY             CHAR(1) INIT('H'),                             00001100
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00001110
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00001120
    MELDING6O            CHAR(10),                                      00001130
    YMELDING6O           CHAR(10);                                      00001140
                                                                        00001150
                                                                        00001160
 QTERMID        = EIBTRMID;                                             00001170
 REST           = 'COMA';                                               00001180
 ROUTELIST      = '';                                                   00001190
 PRINTER.TERMID = 'R41J';                                               00001200
 SISTE.SLUTT    = -1;                                                   00001210
                                                                        00001220
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00001230
                                                                        00001240
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00001250
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00001260
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00001270
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00001280
                                                                        00001290
                                                                        00001300
 EXEC CICS LOAD PROGRAM('S001F13') SET(MAPSET_PTR); /* TRANS - MAPSET */00001310
 ALLOCATE  LOW_CHAR_BASED;                                              00001320
                                                                        00001330
 EXEC CICS HANDLE CONDITION OVERFLOW(OVERFLOW);                         00001340
                                                                        00001350
                                                                        00001360
                                                                        00001370
    IF FUNKSJONSKODE = 'E' & EIBAID = '8' THEN       /* PF8  */         00001380
       EXEC CICS ROUTE LIST(ROUTELIST);                                 00001390
                                                                        00001400
    /* **************** NY LOGIC DEL    **************** */             00001410
      KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =                            00001420
                                 TRANS_OPPL_PTR(W01_TRANS_IND);         00001430
      KOM_OMR.PEKER_LISTE.TRANS_PEKER = TRANS_PTR(W01_TRANS_IND);       00001440
                                                                        00001450
       CALL LOW_VALUES_TIL_MAP;                                         00001460
       CALL SELECT_BLANKETTYPE;                                         00001470
                                                                        00001480
       IF W01_LOOP  = W01_SIDE_ANTALL THEN                              00001490
              SISTE_SIDE = '1'B;                                        00001500
                                                                        00001510
       /* DETTE BARE FOR Å FÅ SATT OVERFLOW-CONDITION */                00001520
       EXEC CICS SEND MAP('ÅTTELI') MAPSET('S001F13') ACCUM PAGING      00001530
                                                        MAPONLY;        00001540
    /* **************** HITT TIL        **************** */             00001550
                                                                        00001560
    /** SLUTT PÅ EKSEKVERING I BYGG_TRANS  **/                          00001570
                                                                        00001580
    SELECT_BLANKETTYPE:                                                 00001590
      PROC;                                                             00001600
                                                                        00001610
                                                                        00001620
        HOVED_KOM_OMR_PTR  =    COMMAREA_PEKER;                         00001630
        SELECT(TRANS_OPPL_OMR.BLANKETTYPE);                             00001640
           WHEN('AP')                                                   00001650
              DO;                                                       00001660
                                                                        00001670
                                                                        00001680
                EXEC CICS LINK PROGRAM('R00104AP')                      00001690
                                         COMMAREA (LOKAL_KOM_OMR);      00001700
                EXEC CICS SEND MAP('S001051') MAPSET('S001F13') ACCUM   00001710
                                                  PAGING   ERASE;       00001720
              END;                                                      00001730
                                                                        00001740
           WHEN('AF')                                                   00001750
               DO;                                                      00001760
                EXEC CICS LINK PROGRAM('R00104AF')                      00001770
                                         COMMAREA (LOKAL_KOM_OMR);      00001780
                EXEC CICS SEND MAP('S001191') MAPSET('S001F13') ACCUM   00001790
                                                  PAGING   ERASE;       00001800
               END;                                                     00001810
                                                                        00001820
           WHEN('UF')                                                   00001830
               DO;                                                      00001840
                EXEC CICS LINK PROGRAM('R00104UF')                      00001850
                                         COMMAREA (LOKAL_KOM_OMR);      00001860
                EXEC CICS SEND MAP('S001831') MAPSET('S001F13') ACCUM   00001870
                                                  PAGING   ERASE;       00001880
               END;                                                     00001890
                                                                        00001900
           WHEN('UP')                                                   00001910
               DO;                                                      00001920
                EXEC CICS LINK PROGRAM('R00104UP')                      00001930
                                         COMMAREA (LOKAL_KOM_OMR);      00001940
                IF W01_MAP = 'S001061' THEN                             00001950
                      EXEC CICS SEND MAP('S001061') MAPSET('S001F13')   00001960
                                                 ACCUM  PAGING   ERASE; 00001970
                ELSE                                                    00001980
                IF W01_MAP = 'S001201' THEN                             00001990
                      EXEC CICS SEND MAP('S001201') MAPSET('S001F13')   00002000
                                                 ACCUM  PAGING   ERASE; 00002010
               END;                                                     00002020
                                                                        00002030
           WHEN('US')                                                   00002040
               DO;                                                      00002050
                EXEC CICS LINK PROGRAM('R00104US')                      00002060
                                         COMMAREA (LOKAL_KOM_OMR);      00002070
                EXEC CICS SEND MAP('S001071') MAPSET('S001F13') ACCUM   00002080
                                                  PAGING   ERASE;       00002090
               END;                                                     00002100
           WHEN('EP')                                                   00002110
              DO;                                                       00002120
                EXEC CICS LINK PROGRAM('R00104EP')                      00002130
                                         COMMAREA (LOKAL_KOM_OMR);      00002140
                IF W01_MAP = 'S001081' THEN                             00002150
                      EXEC CICS SEND MAP('S001081') MAPSET('S001F13')   00002160
                                                 ACCUM  PAGING   ERASE; 00002170
                ELSE                                                    00002180
                IF W01_MAP = 'S001201' THEN                             00002190
                      EXEC CICS SEND MAP('S001201') MAPSET('S001F13')   00002200
                                                 ACCUM  PAGING   ERASE; 00002210
              END;                                                      00002220
                                                                        00002230
                                                                        00002240
                                                                        00002250
           WHEN('EF')                                                   00002260
               DO;                                                      00002270
                EXEC CICS LINK PROGRAM('R00104EF')                      00002280
                                         COMMAREA (LOKAL_KOM_OMR);      00002290
                EXEC CICS SEND MAP('S001091') MAPSET('S001F13')         00002300
                                                 ACCUM  PAGING   ERASE; 00002310
              END;                                                      00002320
           WHEN('FB')                                                   00002330
               DO;                                                      00002340
                EXEC CICS LINK PROGRAM('R00104FB')                      00002350
                                         COMMAREA (LOKAL_KOM_OMR);      00002360
                IF W01_MAP = 'S001101' THEN                             00002370
                      EXEC CICS SEND MAP('S001101') MAPSET('S001F13')   00002380
                                                 ACCUM  PAGING   ERASE; 00002390
                ELSE                                                    00002400
                IF W01_MAP = 'S001201' THEN                             00002410
                      EXEC CICS SEND MAP('S001201') MAPSET('S001F13')   00002420
                                                 ACCUM  PAGING   ERASE; 00002430
               END;                                                     00002440
                                                                        00002450
           WHEN('BP')                                                   00002460
               DO;                                                      00002470
                EXEC CICS LINK PROGRAM('R00104BP')                      00002480
                                         COMMAREA (LOKAL_KOM_OMR);      00002490
                EXEC CICS SEND MAP('S001111') MAPSET('S001F13')         00002500
                                                 ACCUM  PAGING   ERASE; 00002510
              END;                                                      00002520
           WHEN('FT')                                                   00002530
              DO;                                                       00002540
                EXEC CICS LINK PROGRAM('R00104FT')                      00002550
                                         COMMAREA (LOKAL_KOM_OMR);      00002560
                EXEC CICS SEND MAP('S001121') MAPSET('S001F13')         00002570
                                                 ACCUM  PAGING   ERASE; 00002580
              END;                                                      00002590
                                                                        00002600
           WHEN('E1')                                                   00002610
               DO;                                                      00002620
                EXEC CICS LINK PROGRAM('R00104E1')                      00002630
                                         COMMAREA (LOKAL_KOM_OMR);      00002640
                EXEC CICS SEND MAP('S001141') MAPSET('S001F13')         00002650
                                                 ACCUM  PAGING   ERASE; 00002660
               END;                                                     00002670
           WHEN('E2')                                                   00002680
               DO;                                                      00002690
                EXEC CICS LINK PROGRAM('R00104E2')                      00002700
                                         COMMAREA (LOKAL_KOM_OMR);      00002710
                EXEC CICS SEND MAP('S001151') MAPSET('S001F13')         00002720
                                                 ACCUM  PAGING   ERASE; 00002730
               END;                                                     00002740
           WHEN('O1')                                                   00002750
               DO;                                                      00002760
                EXEC CICS LINK PROGRAM('R00104O1')                      00002770
                                         COMMAREA (LOKAL_KOM_OMR);      00002780
                                                                        00002790
                      EXEC CICS SEND MAP('S001161') MAPSET('S001F13')   00002800
                                                 ACCUM  PAGING   ERASE; 00002810
               END;                                                     00002820
           WHEN('O2')                                                   00002830
               DO;                                                      00002840
                EXEC CICS LINK PROGRAM('R00104O2')                      00002850
                                         COMMAREA (LOKAL_KOM_OMR);      00002860
                                                                        00002870
                      EXEC CICS SEND MAP('S001171') MAPSET('S001F13')   00002880
                                                 ACCUM  PAGING   ERASE; 00002890
               END;                                                     00002900
           OTHERWISE;                                                   00002910
        END;                         /*   SELECT     */                 00002920
                                                                        00002930
                                                                        00002940
                                                                        00002950
                                                                        00002960
    END SELECT_BLANKETTYPE;                                             00002970
                                                                        00002980
                                                                        00002990
                                                                        00003000
                                                                        00003010
 OVERFLOW:                                                              00003020
   CALL LOW_VALUES_TIL_MAP;                                             00003030
   TRAILERO.SIDEO            = TRANS_ANT;                               00003040
   TRAILERO.CICS_INFOO       = CICS_NAVN;                               00003050
   TRAILERO.BLADN_TEKSTO     = 'BLADNINGSKOMMANDO';                     00003060
   IF FUNKSJONSKODE = 'E' THEN                                          00003070
      TRAILERO.MELDINGO = 'DETTE ER FJERNET  !! '                       00003080
                        !!'VENNLIGST IKKE LA BILDET STå LENGE.';        00003090
   IF ^ SISTE_SIDE THEN                                                 00003100
     TRAILERO.BLADN_KOMMANDOO = 'P/N';                                  00003110
   ELSE                                                                 00003120
     DO;                                                                00003130
       TRAILERO.BLADN_KOMMANDOO = 'P/1';                                00003140
       /*                                                               00003150
       IF SIDE_TELL = 1 THEN                                            00003160
         DO;                                                            00003170
           TRAILERO.BLADN_TEKSTO    = (10)' ';                          00003180
           TRAILERO.BLADN_KOMMANDOO = '    ';                           00003190
           TRAILERO.BLADN_KOMMANDOA = '0';  **    ASKIP  **             00003200
         END;                                                           00003210
       */                                                               00003220
     END;                                                               00003230
                                                                        00003240
   EXEC CICS SEND MAP('TRAILER') MAPSET('S001F13') ACCUM PAGING;        00003250
   /***** HIT KOMMER EN BARE DERSOM DET ER MER INFO IGJEN  *****/       00003260
                                                                        00003270
                                                                        00003280
   EXEC CICS RETURN;                                                    00003290
   /********      SLUTT PÅ OVERFLOW - RUTINE     ***********/           00003300
                                                                        00003310
                                                                        00003320
 LOW_VALUES_TIL_MAP:                                                    00003330
   PROC;                                                                00003340
      LOW_CHAR_BASED = (1200)' ';   /* X'00'    */                      00003350
 END LOW_VALUES_TIL_MAP;                                                00003360
                                                                        00003370
                                                                        00003380
   %INCLUDE R0019912;               /* PIC TIL CHAR OG MOTSATT */       00003390
 END R001041;                                                           00003400
