 /*       SIST ENDRET 03/03-98 12.42.18 AV   JDA7339                  */00000000
 /*       SIST ENDRET 03/03-98 12.36.55 AV   JDA7339                  */00000010
 /*       SIST ENDRET 12/02-97 09.16.58 AV   JDA7339                  */00000020
 /*       SIST ENDRET 05/02-96 12.43.17 AV   JDA0310                  */00000030
 /*       SIST ENDRET 12/10-95 14.11.38 AV   JDA0310                  */00000040
  /* **************************************************************** */00000050
  /*IDENTIFIKASJON:                                                   */00000060
  /*    R0015301 - HOVEDPROGRAM I PLI                                 */00000070
  /*    PROGRAMMERER: LUNDEBY JUNI     1982                           */00000080
  /*                                                                  */00000090
  /*HENSIKT:                                                          */00000100
  /*    SKRIVER NY OG ENDRET TRANS TIL DB                             */00000110
  /*                                                                  */00000120
  /*PROGRAMTILKNYTNING:                                               */00000130
  /*                                                                  */00000140
  /*                                                                  */00000150
  /*    R005305  -->     SKRIV AP - TRANS                             */00000160
  /*    R005306  -->     SKRIV UP - TRANS                             */00000170
  /*    R0053N6  -->     SKRIV U2 - TRANS                             */00000180
  /*    R0053U6  -->     SKRIV U3 - TRANS                             */00000190
  /*    R005307  -->     SKRIV US - TRANS                             */00000200
  /*    R005308  -->     SKRIV EP - TRANS                             */00000210
  /*    R0053N8  -->     SKRIV E3 - TRANS                             */00000220
  /*    R005309  -->     SKRIV EF - TRANS                             */00000230
  /*    R0053N9  -->     SKRIV E4 - TRANS                             */00000240
  /*    R005310  -->     SKRIV FB - TRANS                             */00000250
  /*    R005311  -->     SKRIV BP - TRANS                             */00000260
  /*    R0053NB  -->     SKRIV B6 - TRANS                             */00000270
  /*    R005312  -->     SKRIV FT - TRANS                             */00000280
  /*    R0053NC  -->     SKRIV F7 - TRANS                             */00000290
  /*    R0053UC  -->     SKRIV FO - TRANS                             */00000300
  /*    R005314  -->     SKRIV E1 - TRANS                             */00000310
  /*    R0053UE  -->     SKRIV EN - TRANS                             */00000320
  /*    R005316  -->     SKRIV O1 - TRANS                             */00000330
  /*    R005317  -->     SKRIV O2 - TRANS                             */00000340
  /*    R005319  -->     SKRIV AF - TRANS                             */00000350
  /*    R0053UJ  -->     SKRIV KF - TRANS                             */00000360
  /*    R005320  -->     SKRIV UF - TRANS                             */00000370
  /*                                                                  */00000380
  /*BRUK:                                                             */00000390
  /*                                                                  */00000400
  /*                                                                  */00000410
  /* **************************************************************** */00000420
                                                                        00000430
  R001530 :                                                             00000440
    PROC            (COMMAREA_PEKER)                                    00000450
           OPTIONS  (MAIN);                                             00000460
                                                                        00000470
  %PAGE;                                                                00000480
  %INCLUDE P0012001;                          /*  TRANS_SEGM_OMR (B) */ 00000490
                                                                        00000500
  %PAGE;                                                                00000510
  %INCLUDE P0019906;                     /*   TRANS_OPPL_OMR (B) */     00000520
                                                                        00000530
  %PAGE;                                                                00000540
  %INCLUDE P0019908;                      /*   KOM_OMR        (B) */    00000550
                                                                        00000560
  %PAGE;                                                                00000570
  %INCLUDE P0019910;                      /*   STYRINGS_OMR   (B) */    00000580
                                                                        00000590
  %PAGE;                                                                00000600
  DCL                                                                   00000610
      1    TRANS_LISTE_OMR (5)  UNALIGNED  BASED (TRANS_LISTE_PEKER),   00000620
  %INCLUDE P0019911;                          /*  TRANS_LISTE_OMR(B)  */00000630
                                                                        00000640
  %PAGE;                                                                00000650
  %INCLUDE P0019912;                      /*   DIV_PARAM_OMR  (B) */    00000660
                                                                        00000670
  %PAGE;                                                                00000680
  /* **************************************************************** */00000690
  /*     INNEBYGDE PLI-FUNKSJONER  + PEKER-DEF.                       */00000700
  /* **************************************************************** */00000710
                                                                        00000720
     DCL                                                                00000730
       ( ADDR , LOW , CSTG , DATE )      BUILTIN;                       00000740
                                                                        00000750
     DCL                                                                00000760
       PLITDLI ENTRY;                                                   00000770
                                                                        00000780
     DCL                                                                00000790
         ( COMMAREA_PEKER   , W001_HJELPE_PEKER , TRANS_SEGM_PEKER ,    00000800
           W001_TRANS_PEKER , W001_TRANS_OPPL_PEKER                )    00000810
                                   POINTER;                             00000820
                                                                        00000830
  /* **************************************************************** */00000840
  /*     ARBEIDSFELTER SOM BRUKES AV UIB OG PCB  .                    */00000850
  /* **************************************************************** */00000860
                                                                        00000870
  %INCLUDE DLIUIB;                                                      00000880
                                                                        00000890
     DCL                                                                00000900
         UIB_RC_OK                 BIT (8)       INIT( 0 );             00000910
                                                                        00000920
  %INCLUDE  P0012002;                  /* UIB_PCB_PEKER_OMR (BASED)   */00000930
                                                                        00000940
     DCL  1 RF1                    BASED (RF1_PCB_PEKER),               00000950
  %INCLUDE  P0012003;                  /* PCB    (BASED)             */ 00000960
                                                                        00000970
  /* **************************************************************** */00000980
  /*     OPPTELINGS- OG LOOP-PARAMETRE M.M                            */00000990
  /* **************************************************************** */00001000
                                                                        00001010
     DCL 1  W001_OPPTELL_OMR,                                           00001020
            2   I                  FIXED    BIN   (15)   INIT ( 0 ),    00001030
            2   J                  FIXED    BIN   (15)   INIT ( 0 ),    00001040
            2   FEIL_MELDNR                 PIC '9'      INIT (0),      00001050
            2   B                           CHAR  (1)    INIT (' ');    00001060
                                                                        00001070
     DCL    W001_TERMID                     CHAR  ( 4 )  INIT ((4)' '), 00001080
            W001_DATO                       CHAR  ( 6 )  INIT ((6)' '), 00001090
            W001_REG_DATO  DEF W001_DATO    PIC   '(6)9';               00001100
                                                                        00001110
                                                                        00001120
  /* **************************************************************** */00001130
  /*     DLI CALL-PARAMETRE                                           */00001140
  /* **************************************************************** */00001150
                                                                        00001160
     DCL 1  W001_DLI               UNALIGNED,                           00001170
            2   FUNC               CHAR     (4)   INIT('    '),         00001180
            2   GHU                CHAR     (4)   INIT('GHU '),         00001190
            2   DLET               CHAR     (4)   INIT('DLET'),         00001200
            2   REPL               CHAR     (4)   INIT('REPL'),         00001210
            2   ISRT               CHAR     (4)   INIT('ISRT'),         00001220
            2   S_MELDNR           PIC '9'        INIT (0),             00001230
            2   PARM_CT_1          FIXED BIN(31)  INIT(1),              00001240
            2   PARM_CT_2          FIXED BIN(31)  INIT(2),              00001250
            2   PARM_CT_3          FIXED BIN(31)  INIT(3),              00001260
            2   PARM_CT_4          FIXED BIN(31)  INIT(4),              00001270
            2   PARM_CT_5          FIXED BIN(31)  INIT(5),              00001280
            2   PARM_CT_6          FIXED BIN(31)  INIT(6),              00001290
            2   PARM_CT_7          FIXED BIN(31)  INIT(7),              00001300
            2   OUT2               CHAR     (20)  INIT                  00001310
                        ('                    ');                       00001320
                                                                        00001330
     DCL    W001_IO                CHAR (280) INIT  (   ( 280 )  ' '  ),00001340
            W001_HJELPE_IO         CHAR (280) BASED (W001_HJELPE_PEKER);00001350
  %PAGE;                                                                00001360
  /* **************************************************************** */00001370
  /*     DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00001380
  /* **************************************************************** */00001390
                                                                        00001400
     DCL    SSA_UQUAL                            CHAR (9)  INIT((9)' ');00001410
                                                                        00001420
     DCL 1  SSA1_RF0PERSN          UNALIGNED,                           00001430
            2    HDEL                            CHAR (17) INIT         00001440
                 ('RF0PERSN(FNR     '),                                 00001450
            2    REL_OP                          CHAR (2)  INIT (' ='), 00001460
            2    PKEY               FIXED        DEC  (11) INIT ( 0 ),  00001470
            2    HP                              CHAR (1)  INIT (')');  00001480
                                                                        00001490
     DCL 1  SSA1_TRANHIST          UNALIGNED,                           00001500
            2    HDEL                            CHAR (17) INIT         00001510
                 ('TRANHIST(VTPBLKOD'),                                 00001520
            2    REL_OP                          CHAR (2)  INIT (' ='), 00001530
            2    VTP_KEY            FIXED        DEC  (4)  INIT ( 0 ),  00001540
            2    GRBLKODE                        CHAR (2)  INIT ('  '), 00001550
            2    HP                              CHAR (1)  INIT (')');  00001560
                                                                        00001570
                                                                        00001580
                                                                        00001590
  %PAGE;                                                                00001600
  /* **************************************************************** */00001610
  /*                                                                  */00001620
  /*        SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00001630
  /*       ---------------------------------------------------        */00001640
  /*                                                                  */00001650
  /*                                                                  */00001660
  /*        INITIERER VISSE DEFAULTVERDIER.                           */00001670
  /*                                                                  */00001680
  /* **************************************************************** */00001690
                                                                        00001700
    PROGRAM_ID                              =   'R0015301'       ;      00001710
    UIBPTR                                  =    UIB_PEKER       ;      00001720
    W001_TRANS_PEKER                        =    TRANS_PEKER     ;      00001730
    W001_TRANS_OPPL_PEKER                   =    TRANS_OPPL_PEKER;      00001740
                                                                        00001750
    ALLOCATE         TRANS_SEGM_OMR;                                    00001760
    TRANS_SEGM_OMR                          =    ''            ;        00001770
    W001_DATO                               =    DATE          ;        00001780
    W001_TERMID                             =    EIBTRMID      ;        00001790
                                                                        00001800
   /* ********************************************************** */     00001810
                                                                        00001820
    DO  I=1 TO ANTALL_TRANS_I_TRANS_LISTE;                              00001830
                                                                        00001840
      TRANS_OPPL_PEKER    =    ADDR (TRANS_LISTE_OMR.FAST_DEL (I));     00001850
      FEIL_MELD_NR        =    0;                                       00001860
      SSA1_RF0PERSN.PKEY  =    TRANS_OPPL_OMR.FØDSNUMMER;               00001870
                                                                        00001880
      SELECT   (TRANS_OPPL_OMR.BLANKETTYPE     );                       00001890
                                                                        00001900
          WHEN ( 'UA' )                                                 00001910
            /* **************************************************** */  00001920
            /*  BLANKETTEN ER FJERNET - SKAL IKKE SKRIVES OM ATT    */  00001930
            /* **************************************************** */  00001940
            DO;                                                         00001950
            END;                                                        00001960
          WHEN ( 'AP' )                                                 00001970
            /* **************************************************** */  00001980
            /*  OVRFØRER ALDERSPENSJONS-OPPLYSNINGER TIL DB         */  00001990
            /* **************************************************** */  00002000
            DO;                                                         00002010
               CALL P050_SKRIV_AP_TRANS;                                00002020
                                                                        00002030
               IF   FEIL_MELD_NR              >      0       THEN       00002040
                 DO;                                                    00002050
                    /* ******************************************** */  00002060
                    /* FEIL VED SKRIV AV :  TRANS                   */  00002070
                    /* ******************************************** */  00002080
                                                                        00002090
                    GO TO L999;                                         00002100
                 END;                                                   00002110
            END;                                                        00002120
                                                                        00002130
          WHEN ( 'A1' )                                                 00002140
            /* **************************************************** */  00002150
            /*  OVRFØRER ALDERSPENSJONS-OPPLYSNINGER TIL DB         */  00002160
            /* **************************************************** */  00002170
            DO;                                                         00002180
               CALL P050_SKRIV_A1_TRANS;                                00002190
                                                                        00002200
               IF   FEIL_MELD_NR              >      0       THEN       00002210
                 DO;                                                    00002220
                    /* ******************************************** */  00002230
                    /* FEIL VED SKRIV AV :  TRANS                   */  00002240
                    /* ******************************************** */  00002250
                                                                        00002260
                    GO TO L999;                                         00002270
                 END;                                                   00002280
            END;                                                        00002290
                                                                        00002300
 /*UF*/  WHEN ( 'UF' )                                                  00002310
 /*UF*/    /* **************************************************** */   00002320
 /*UF*/    /*  OVRFØRER OPPLYSNINGER TIL DB OM UNGE UFØRE FØR 1967 */   00002330
 /*UF*/    /*                                                      */   00002340
 /*UF*/    /* **************************************************** */   00002350
 /*UF*/    DO;                                                          00002360
 /*UF*/       CALL P183_SKRIV_UF_TRANS;                                 00002370
                                                                        00002380
 /*UF*/       IF   FEIL_MELD_NR              >      0       THEN        00002390
 /*UF*/         DO;                                                     00002400
 /*UF*/            /* ******************************************** */   00002410
 /*UF*/            /* FEIL VED SKRIV AV :  TRANS                   */   00002420
 /*UF*/            /* ******************************************** */   00002430
                                                                        00002440
 /*UF*/            GO TO L999;                                          00002450
 /*UF*/         END;                                                    00002460
 /*UF*/    END;                                                         00002470
                                                                        00002480
                                                                        00002490
          WHEN ( 'AF' )                                                 00002500
            /* **************************************************** */  00002510
            /*  OVRFØRER OPPLYSNINGER TIL DB OM AVTALEFESTET        */  00002520
            /*  PENSJON         -    AFP                            */  00002530
            /* **************************************************** */  00002540
            DO;                                                         00002550
               CALL P190_SKRIV_AF_TRANS;                                00002560
                                                                        00002570
               IF   FEIL_MELD_NR              >      0       THEN       00002580
                 DO;                                                    00002590
                    /* ******************************************** */  00002600
                    /* FEIL VED SKRIV AV :  TRANS                   */  00002610
                    /* ******************************************** */  00002620
                                                                        00002630
                    GO TO L999;                                         00002640
                 END;                                                   00002650
            END;                                                        00002660
                                                                        00002670
                                                                        00002680
          WHEN ( 'KF' )                                                 00002690
            /* **************************************************** */  00002700
            /*  OVRFØRER OPPLYSNINGER TIL DB OM AVTALEFESTET        */  00002710
            /*  PENSJON         -    AFP                            */  00002720
            /* **************************************************** */  00002730
            DO;                                                         00002740
               CALL P190_SKRIV_KF_TRANS;                                00002750
                                                                        00002760
               IF   FEIL_MELD_NR              >      0       THEN       00002770
                 DO;                                                    00002780
                                                                        00002790
                    /* ******************************************** */  00002800
                    /* FEIL VED SKRIV AV :  TRANS                   */  00002810
                    /* ******************************************** */  00002820
                    GO TO L999;                                         00002830
                 END;                                                   00002840
            END;                                                        00002850
                                                                        00002860
                                                                        00002870
          WHEN ( 'UP' )                                                 00002880
            /* **************************************************** */  00002890
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00002900
            /* **************************************************** */  00002910
            DO;                                                         00002920
               CALL P060_SKRIV_UP_TRANS;                                00002930
                                                                        00002940
               IF   FEIL_MELD_NR              >      0       THEN       00002950
                 DO;                                                    00002960
                    /* ******************************************** */  00002970
                    /* FEIL VED SKRIV AV TRANS                      */  00002980
                    /* ******************************************** */  00002990
                                                                        00003000
                    GO TO L999;                                         00003010
                 END;                                                   00003020
            END;                                                        00003030
                                                                        00003040
          WHEN ( 'U2' )                                                 00003050
            /* **************************************************** */  00003060
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00003070
            /* **************************************************** */  00003080
            DO;                                                         00003090
               CALL P060_SKRIV_U2_TRANS;                                00003100
                                                                        00003110
               IF   FEIL_MELD_NR              >      0       THEN       00003120
                 DO;                                                    00003130
                    /* ******************************************** */  00003140
                    /* FEIL VED SKRIV AV TRANS                      */  00003150
                    /* ******************************************** */  00003160
                                                                        00003170
                    GO TO L999;                                         00003180
                 END;                                                   00003190
            END;                                                        00003200
                                                                        00003210
          WHEN ( 'U3' )                                                 00003220
            /* **************************************************** */  00003230
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00003240
            /* **************************************************** */  00003250
            DO;                                                         00003260
               CALL P060_SKRIV_U3_TRANS;                                00003270
                                                                        00003280
               IF   FEIL_MELD_NR              >      0       THEN       00003290
                 DO;                                                    00003300
                    /* ******************************************** */  00003310
                    /* FEIL VED SKRIV AV TRANS                      */  00003320
                    /* ******************************************** */  00003330
                                                                        00003340
                    GO TO L999;                                         00003350
                 END;                                                   00003360
            END;                                                        00003370
                                                                        00003380
          WHEN ( 'US' )                                                 00003390
            /* **************************************************** */  00003400
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00003410
            /* **************************************************** */  00003420
            DO;                                                         00003430
               CALL P070_SKRIV_US_TRANS;                                00003440
                                                                        00003450
               IF   FEIL_MELD_NR              >      0       THEN       00003460
                 DO;                                                    00003470
                    /* ******************************************** */  00003480
                    /* FEIL VED SKRIV AV TRANS                      */  00003490
                    /* ******************************************** */  00003500
                                                                        00003510
                    GO TO L999;                                         00003520
                 END;                                                   00003530
            END;                                                        00003540
                                                                        00003550
          WHEN ( 'EP' )                                                 00003560
            /* **************************************************** */  00003570
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00003580
            /* **************************************************** */  00003590
            DO;                                                         00003600
               CALL P080_SKRIV_EP_TRANS;                                00003610
                                                                        00003620
               IF   FEIL_MELD_NR              >      0       THEN       00003630
                 DO;                                                    00003640
                    /* ******************************************** */  00003650
                    /* FEIL VED SKRIV AV TRANS                      */  00003660
                    /* ******************************************** */  00003670
                                                                        00003680
                    GO TO L999;                                         00003690
                 END;                                                   00003700
            END;                                                        00003710
                                                                        00003720
          WHEN ( 'E3' )                                                 00003730
            /* **************************************************** */  00003740
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00003750
            /* **************************************************** */  00003760
            DO;                                                         00003770
               CALL P080_SKRIV_E3_TRANS;                                00003780
                                                                        00003790
               IF   FEIL_MELD_NR              >      0       THEN       00003800
                 DO;                                                    00003810
                    /* ******************************************** */  00003820
                    /* FEIL VED SKRIV AV TRANS                      */  00003830
                    /* ******************************************** */  00003840
                                                                        00003850
                    GO TO L999;                                         00003860
                 END;                                                   00003870
            END;                                                        00003880
                                                                        00003890
          WHEN ( 'EE' )                                                 00003900
            /* **************************************************** */  00003910
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00003920
            /* **************************************************** */  00003930
            DO;                                                         00003940
               CALL P080_SKRIV_EE_TRANS;                                00003950
                                                                        00003960
               IF   FEIL_MELD_NR              >      0       THEN       00003970
                 DO;                                                    00003980
                    /* ******************************************** */  00003990
                    /* FEIL VED SKRIV AV TRANS                      */  00004000
                    /* ******************************************** */  00004010
                                                                        00004020
                    GO TO L999;                                         00004030
                 END;                                                   00004040
            END;                                                        00004050
                                                                        00004060
          WHEN ( 'EF' )                                                 00004070
            /* **************************************************** */  00004080
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00004090
            /* **************************************************** */  00004100
            DO;                                                         00004110
               CALL P090_SKRIV_EF_TRANS;                                00004120
                                                                        00004130
               IF   FEIL_MELD_NR              >      0       THEN       00004140
                 DO;                                                    00004150
                    /* ******************************************** */  00004160
                    /* FEIL VED SKRIV AV TRANS                      */  00004170
                    /* ******************************************** */  00004180
                                                                        00004190
                    GO TO L999;                                         00004200
                 END;                                                   00004210
            END;                                                        00004220
                                                                        00004230
          WHEN ( 'E4' )                                                 00004240
            /* **************************************************** */  00004250
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00004260
            /* **************************************************** */  00004270
            DO;                                                         00004280
               CALL P090_SKRIV_E4_TRANS;                                00004290
                                                                        00004300
               IF   FEIL_MELD_NR              >      0       THEN       00004310
                 DO;                                                    00004320
                    /* ******************************************** */  00004330
                    /* FEIL VED SKRIV AV TRANS                      */  00004340
                    /* ******************************************** */  00004350
                                                                        00004360
                    GO TO L999;                                         00004370
                 END;                                                   00004380
            END;                                                        00004390
                                                                        00004400
          WHEN ( 'FB' )                                                 00004410
            /* **************************************************** */  00004420
            /*  OVRFØRER ALDERSPENSJONS-OPPLYSNINGER TIL DB         */  00004430
            /* **************************************************** */  00004440
            DO;                                                         00004450
               CALL P100_SKRIV_FB_TRANS;                                00004460
                                                                        00004470
               IF   FEIL_MELD_NR              >      0       THEN       00004480
                 DO;                                                    00004490
                    /* ******************************************** */  00004500
                    /* FEIL VED SKRIV AV TRANS                      */  00004510
                    /* ******************************************** */  00004520
                                                                        00004530
                    GO TO L999;                                         00004540
                 END;                                                   00004550
            END;                                                        00004560
                                                                        00004570
                                                                        00004580
          WHEN ( 'BP' )                                                 00004590
            /* **************************************************** */  00004600
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00004610
            /* **************************************************** */  00004620
            DO;                                                         00004630
               CALL P110_SKRIV_BP_TRANS;                                00004640
                                                                        00004650
               IF   FEIL_MELD_NR              >      0       THEN       00004660
                 DO;                                                    00004670
                    /* ******************************************** */  00004680
                    /* FEIL VED SKRIV AV TRANS                      */  00004690
                    /* ******************************************** */  00004700
                                                                        00004710
                    GO TO L999;                                         00004720
                 END;                                                   00004730
            END;                                                        00004740
                                                                        00004750
          WHEN ( 'B6' )                                                 00004760
            /* **************************************************** */  00004770
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00004780
            /* **************************************************** */  00004790
            DO;                                                         00004800
               CALL P110_SKRIV_B6_TRANS;                                00004810
                                                                        00004820
               IF   FEIL_MELD_NR              >      0       THEN       00004830
                 DO;                                                    00004840
                    /* ******************************************** */  00004850
                    /* FEIL VED SKRIV AV TRANS                      */  00004860
                    /* ******************************************** */  00004870
                                                                        00004880
                    GO TO L999;                                         00004890
                 END;                                                   00004900
            END;                                                        00004910
                                                                        00004920
          WHEN ( 'FT' )                                                 00004930
            /* **************************************************** */  00004940
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00004950
            /* **************************************************** */  00004960
            DO;                                                         00004970
               CALL P120_SKRIV_FT_TRANS;                                00004980
                                                                        00004990
               IF   FEIL_MELD_NR              >      0       THEN       00005000
                 DO;                                                    00005010
                    /* ******************************************** */  00005020
                    /* FEIL VED SKRIV AV TRANS                      */  00005030
                    /* ******************************************** */  00005040
                                                                        00005050
                    GO TO L999;                                         00005060
                 END;                                                   00005070
            END;                                                        00005080
                                                                        00005090
          WHEN ( 'F7' )                                                 00005100
            /* **************************************************** */  00005110
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00005120
            /* **************************************************** */  00005130
            DO;                                                         00005140
               CALL P120_SKRIV_F7_TRANS;                                00005150
                                                                        00005160
               IF   FEIL_MELD_NR              >      0       THEN       00005170
                 DO;                                                    00005180
                    /* ******************************************** */  00005190
                    /* FEIL VED SKRIV AV TRANS                      */  00005200
                    /* ******************************************** */  00005210
                                                                        00005220
                    GO TO L999;                                         00005230
                 END;                                                   00005240
            END;                                                        00005250
                                                                        00005260
          WHEN ( 'FO' )                                                 00005270
            /* **************************************************** */  00005280
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00005290
            /* **************************************************** */  00005300
            DO;                                                         00005310
               CALL P120_SKRIV_FO_TRANS;                                00005320
                                                                        00005330
               IF   FEIL_MELD_NR              >      0       THEN       00005340
                 DO;                                                    00005350
                    /* ******************************************** */  00005360
                    /* FEIL VED SKRIV AV TRANS                      */  00005370
                    /* ******************************************** */  00005380
                                                                        00005390
                    GO TO L999;                                         00005400
                 END;                                                   00005410
            END;                                                        00005420
                                                                        00005430
          WHEN ( 'E1' )                                                 00005440
            /* **************************************************** */  00005450
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00005460
            /* **************************************************** */  00005470
            DO;                                                         00005480
               CALL P140_SKRIV_E1_TRANS;                                00005490
                                                                        00005500
               IF   FEIL_MELD_NR              >      0       THEN       00005510
                 DO;                                                    00005520
                    /* ******************************************** */  00005530
                    /* FEIL VED SKRIV AV TRANS                      */  00005540
                    /* ******************************************** */  00005550
                                                                        00005560
                    GO TO L999;                                         00005570
                 END;                                                   00005580
            END;                                                        00005590
                                                                        00005600
          WHEN ( 'EN' )                                                 00005610
            /* **************************************************** */  00005620
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00005630
            /* **************************************************** */  00005640
            DO;                                                         00005650
               CALL P140_SKRIV_EN_TRANS;                                00005660
                                                                        00005670
               IF   FEIL_MELD_NR              >      0       THEN       00005680
                 DO;                                                    00005690
                    /* ******************************************** */  00005700
                    /* FEIL VED SKRIV AV TRANS                      */  00005710
                    /* ******************************************** */  00005720
                                                                        00005730
                    GO TO L999;                                         00005740
                 END;                                                   00005750
            END;                                                        00005760
                                                                        00005770
          WHEN ( 'O1' )                                                 00005780
            /* **************************************************** */  00005790
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00005800
            /* **************************************************** */  00005810
            DO;                                                         00005820
               CALL P160_SKRIV_O1_TRANS;                                00005830
                                                                        00005840
               IF   FEIL_MELD_NR              >      0       THEN       00005850
                 DO;                                                    00005860
                    /* ******************************************** */  00005870
                    /* FEIL VED SKRIV AV TRANS                      */  00005880
                    /* ******************************************** */  00005890
                                                                        00005900
                    GO TO L999;                                         00005910
                 END;                                                   00005920
            END;                                                        00005930
                                                                        00005940
          WHEN ( 'O2' )                                                 00005950
            /* **************************************************** */  00005960
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */  00005970
            /* **************************************************** */  00005980
            DO;                                                         00005990
               CALL P170_SKRIV_O2_TRANS;                                00006000
                                                                        00006010
               IF   FEIL_MELD_NR              >      0       THEN       00006020
                 DO;                                                    00006030
                    /* ******************************************** */  00006040
                    /* FEIL VED SKRIV AV TRANS                      */  00006050
                    /* ******************************************** */  00006060
                                                                        00006070
                    GO TO L999;                                         00006080
                 END;                                                   00006090
            END;                                                        00006100
                                                                        00006110
          OTHERWISE                                                     00006120
            /* **************************************************** */  00006130
            /*  FÅTT EN UKJENT TRANS-TYPE . KJØRING AVBRYTES        */  00006140
            /* **************************************************** */  00006150
            DO;                                                         00006160
   L100:                                                                00006170
               FEIL_MELD_NR           =    497 ;                        00006180
               FEIL_VED_LABEL         =   '100';                        00006190
               GO TO L999;                                              00006200
            END;                                                        00006210
                                                                        00006220
        END;   /* *****      SELECT ( BLANKETTYPE )          ****** */  00006230
                                                                        00006240
    END;       /* *****      DO  I=1 TO ANTALL_TRANS_I_TRANS_LISTE  */  00006250
                                                                        00006260
                                                                        00006270
    /* ************************************************************** */00006280
    /* RESTILLER   TRANS_PEKERENE                                     */00006290
    /* ************************************************************** */00006300
                                                                        00006310
    TRANS_PEKER                    =  W001_TRANS_PEKER     ;            00006320
    TRANS_OPPL_PEKER               =  W001_TRANS_OPPL_PEKER;            00006330
                                                                        00006340
                                                                        00006350
    /* ************************************************************** */00006360
    /* SKRIV STATISTIKK REPORT FOR REGISTERING                        */00006370
    /* ************************************************************** */00006380
   /*  CALL UPDATE_STATISTIKK_REG ( TRANS_OPPL_OMR.BLANKETTYPE,         00006390
                                                FEIL_MELD_NR);    */    00006400
                                                                        00006410
                                                                        00006420
    %PAGE;                                                              00006430
    /* ************************************************************** */00006440
    /*                                                                */00006450
    /* PROCEDURE FOR Å LEGGE INN UNDERLIGGENDE SEGM. TIL ROT-SEGM.    */00006460
    /*                                                                */00006470
    /* ************************************************************** */00006480
                                                                        00006490
    P010_SKRIV_TRANHIST :                                               00006500
      PROC ;                                                            00006510
                                                                        00006520
                                                                        00006530
      W001_HJELPE_PEKER                =     ADDR ( TRANHIST ) ;        00006540
      W001_IO                          =     W001_HJELPE_IO    ;        00006550
      SSA_UQUAL                        =    'TRANHIST '        ;        00006560
      SSA1_TRANHIST.VTP_KEY            =     TRANHIST.VTP_KEY  ;        00006570
      SSA1_TRANHIST.GRBLKODE           =     TRANHIST.GRBLKODE ;        00006580
                                                                        00006590
      CALL PLITDLI                          (W001_DLI.PARM_CT_5,        00006600
                                             W001_DLI.ISRT,             00006610
                                             RF1,                       00006620
                                             W001_IO,                   00006630
                                             SSA1_RF0PERSN,             00006640
                                             SSA_UQUAL);                00006650
                                                                        00006660
                                                                        00006670
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN          00006680
        DO;                                                             00006690
           /* ******************************************** */           00006700
           /* FEIL VED SKRIV AV :  TRANHIST                */           00006710
           /* ******************************************** */           00006720
  L105:                                                                 00006730
           FEIL_MELD_NR                =    500 ;                       00006740
           FEIL_VED_LABEL              =   '105';                       00006750
           GO   TO  RETUR;                                              00006760
        END;                                                            00006770
                                                                        00006780
      IF   RF1.STATUS_KODE             =   'II'    THEN                 00006790
        DO;                                                             00006800
          /* ******************************************** */            00006810
          /* SAMME TRANHIST LIHGGER INNE FRA FØR          */            00006820
          /* DETTE FJERNES FØR DET NYE LEGGES INN         */            00006830
          /* ******************************************** */            00006840
                                                                        00006850
          CALL PLITDLI                        (W001_DLI.PARM_CT_5,      00006860
                                               W001_DLI.GHU,            00006870
                                               RF1,                     00006880
                                               W001_IO,                 00006890
                                               SSA1_RF0PERSN,           00006900
                                               SSA1_TRANHIST);          00006910
                                                                        00006920
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                00006930
            ! RF1.STATUS_KODE         ^=       '  '         THEN        00006940
            DO;                                                         00006950
              /* ******************************************** */        00006960
              /* FEIL VED LES   AV :  TRANHIST                */        00006970
              /* ******************************************** */        00006980
  L110:                                                                 00006990
              FEIL_MELD_NR             =       500 ;                    00007000
              FEIL_VED_LABEL           =      '110';                    00007010
              DB_STATUS_KODE           =       RF1.STATUS_KODE;         00007020
              GO   TO  RETUR;                                           00007030
            END;                                                        00007040
                                                                        00007050
                                                                        00007060
          /* ******************************************** */            00007070
          /* KALLET GHU GIKK OK . DELETER TRANHIST        */            00007080
          /* ******************************************** */            00007090
                                                                        00007100
          W001_IO                      =       W001_HJELPE_IO;          00007110
          CALL PLITDLI                        (W001_DLI.PARM_CT_3,      00007120
                                               W001_DLI.DLET,           00007130
                                               RF1,                     00007140
                                               W001_IO);                00007150
                                                                        00007160
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                00007170
            ! RF1.STATUS_KODE         ^=       '  '         THEN        00007180
            DO;                                                         00007190
              /* ******************************************** */        00007200
              /* FEIL VED DELETE  AV :  TRANHIST              */        00007210
              /* ******************************************** */        00007220
  L120:                                                                 00007230
              FEIL_MELD_NR             =       500 ;                    00007240
              FEIL_VED_LABEL           =      '120';                    00007250
              DB_STATUS_KODE           =       RF1.STATUS_KODE;         00007260
              GO   TO  RETUR;                                           00007270
            END;                                                        00007280
                                                                        00007290
                                                                        00007300
          /* ************************************************* */       00007310
          /* GML. TRANHIST ER FJERNET . DET NYE LEGGES INN     */       00007320
          /* ************************************************* */       00007330
                                                                        00007340
          W001_IO                      =       W001_HJELPE_IO;          00007350
          SSA_UQUAL                    =      'TRANHIST ';              00007360
          CALL PLITDLI                        (W001_DLI.PARM_CT_5,      00007370
                                               W001_DLI.ISRT,           00007380
                                               RF1,                     00007390
                                               W001_IO,                 00007400
                                               SSA1_RF0PERSN,           00007410
                                               SSA_UQUAL);              00007420
                                                                        00007430
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                00007440
            ! RF1.STATUS_KODE         ^=       '  '         THEN        00007450
            DO;                                                         00007460
              /* ******************************************** */        00007470
              /* FEIL VED SKRIV AV :  TRANS                   */        00007480
              /* ******************************************** */        00007490
  L130:                                                                 00007500
              FEIL_MELD_NR             =    500              ;          00007510
              FEIL_VED_LABEL           =   '130'             ;          00007520
              DB_STATUS_KODE           =    RF1.STATUS_KODE  ;          00007530
              GO   TO  RETUR;                                           00007540
            END;                                                        00007550
        END;                                                            00007560
      ELSE                                                              00007570
                                                                        00007580
        IF  RF1.STATUS_KODE           ^=       '  '         THEN        00007590
          DO;                                                           00007600
             /* ******************************************** */         00007610
             /* RF1.STATUS_KODE =/= 'II' OG '  '  ): DB-FEIL */         00007620
             /* ******************************************** */         00007630
  L140:                                                                 00007640
             FEIL_MELD_NR                =    500 ;                     00007650
             FEIL_VED_LABEL              =   '140';                     00007660
             DB_STATUS_KODE              =    RF1.STATUS_KODE;          00007670
             GO   TO  RETUR;                                            00007680
          END;                                                          00007690
  RETUR:                                                                00007700
                                                                        00007710
    END P010_SKRIV_TRANHIST;                                            00007720
                                                                        00007730
                                                                        00007740
                                                                        00007750
                                                                        00007760
    %PAGE;                                                              00007770
    /* ************************************************************** */00007780
    /*                                                                */00007790
    /* PROCEDURE FOR Å SKRIVE UT UNDERLIGGENDE SEGMENTER TIL TRANHIST */00007800
    /*                                                                */00007810
    /* ************************************************************** */00007820
                                                                        00007830
    P020_SKRIV_BARN_AV_TRANHIST :                                       00007840
      PROC;                                                             00007850
                                                                        00007860
      W001_IO                          =    W001_HJELPE_IO;             00007870
      CALL PLITDLI                         (W001_DLI.PARM_CT_6,         00007880
                                            W001_DLI.ISRT,              00007890
                                            RF1,                        00007900
                                            W001_IO,                    00007910
                                            SSA1_RF0PERSN,              00007920
                                            SSA1_TRANHIST,              00007930
                                            SSA_UQUAL);                 00007940
                                                                        00007950
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=    UIB_RC_OK                   00007960
        !  RF1.STATUS_KODE            ^=   '  '    THEN                 00007970
        DO;                                                             00007980
           /* ******************************************** */           00007990
           /* FEIL VED SKRIV AV :  TRANS                   */           00008000
           /* ******************************************** */           00008010
  L150:                                                                 00008020
           FEIL_MELD_NR                =    500 ;                       00008030
           FEIL_VED_LABEL              =   '150';                       00008040
           DB_STATUS_KODE              =    RF1.STATUS_KODE;            00008050
        END;                                                            00008060
    END P020_SKRIV_BARN_AV_TRANHIST;                                    00008070
                                                                        00008080
                                                                        00008090
    %INCLUDE R0015305; /* PROC. P050_SKRIV_AP_TRANS                  */ 00008100
                                                                        00008110
    %INCLUDE R00153N5; /* PROC. P050_SKRIV_A1_TRANS                  */ 00008120
                                                                        00008130
    %INCLUDE R0015306; /* PROC. P060_SKRIV_UP_TRANS                  */ 00008140
    %INCLUDE R00153N6; /* PROC. P060_SKRIV_U2_TRANS                  */ 00008150
    %INCLUDE R00153U6; /* PROC. P060_SKRIV_U3_TRANS                  */ 00008160
                                                                        00008170
    %INCLUDE R0015307; /* PROC. P070_SKRIV_US_TRANS                  */ 00008180
                                                                        00008190
    %INCLUDE R0015308; /* PROC. P080_SKRIV_EP_TRANS                  */ 00008200
    %INCLUDE R00153N8; /* PROC. P080_SKRIV_E3_TRANS                  */ 00008210
    %INCLUDE R00153U8; /* PROC. P080_SKRIV_EE_TRANS                  */ 00008220
                                                                        00008230
    %INCLUDE R0015309; /* PROC. P090_SKRIV_EF_TRANS                  */ 00008240
    %INCLUDE R00153N9; /* PROC. P090_SKRIV_E4_TRANS                  */ 00008250
                                                                        00008260
    %INCLUDE R0015310; /* PROC. P100_SKRIV_FB_TRANS                  */ 00008270
                                                                        00008280
    %INCLUDE R0015311; /* PROC. P110_SKRIV_BP_TRANS                  */ 00008290
    %INCLUDE R00153NB; /* PROC. P110_SKRIV_B6_TRANS                  */ 00008300
                                                                        00008310
    %INCLUDE R0015312; /* PROC. P120_SKRIV_FT_TRANS                  */ 00008320
    %INCLUDE R00153NC; /* PROC. P120_SKRIV_F7_TRANS                  */ 00008330
    %INCLUDE R00153UC; /* PROC. P120_SKRIV_FO_TRANS                  */ 00008340
                                                                        00008350
    %INCLUDE R0015314; /* PROC. P140_SKRIV_E1_TRANS                  */ 00008360
    %INCLUDE R00153UE; /* PROC. P140_SKRIV_EN_TRANS                  */ 00008370
                                                                        00008380
    %INCLUDE R0015316; /* PROC. P160_SKRIV_O1_TRANS                  */ 00008390
                                                                        00008400
    %INCLUDE R0015317; /* PROC. P170_SKRIV_O2_TRANS                  */ 00008410
                                                                        00008420
    %INCLUDE R0015319; /* PROC. P190_SKRIV_AF_TRANS        */           00008430
    %INCLUDE R00153UJ; /* PROC. P190_SKRIV_KF_TRANS       */            00008440
                                                                        00008450
    %INCLUDE R0015320; /* PROC. P183_SKRIV_UF_TRANS  */         /*UF*/  00008460
                                                                        00008470
   /*INCLUDE R0012004;      PROC. STASTIKK REPORT      */               00008480
                                                                        00008490
                                                                        00008500
                                                                        00008510
    %INCLUDE R0019913; /* PROC. FOR Å SNU DATO .     MMÅÅ -> ÅÅMM    */ 00008520
                                                                        00008530
                                                                        00008540
  L999:                                                                 00008550
                                                                        00008560
    TRANS_PEKER                    =  W001_TRANS_PEKER     ;            00008570
    TRANS_OPPL_PEKER               =  W001_TRANS_OPPL_PEKER;            00008580
    EXEC CICS RETURN;                                                   00008590
  END  R001530;                                                         00008600
