 /*       SIST ENDRET 14/04-89 13.33.52 AV   HERMAN                   */00000000
 /*       SIST ENDRET 12/05-87 08.35.07 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 13/05-86 10.23.55 AV   FARVIK                   */00000020
 /*       SIST ENDRET 30/07-85 08.54.50 AV   FARVIK                   */00000030
 /*       SIST ENDRET 30/07-85 07.50.40 AV   FARVIK                   */00000040
 /*       SIST ENDRET 04/06-84 09.49.20 AV   FARVIK                   */00000050
 /*       SIST ENDRET 07/12-82 15.07.10 AV   FARVIK                   */00000060
 /*       SIST ENDRET 28/10-82 12.17.11 AV   PERB                     */00000070
 /*IDENTIFIKASJON:                                                    */00000080
 /*    R0011409  -                                                    */00000090
 /*    PROGRAMMERER: JAN, AUGUST 81                                   */00000100
 /*HENSIKT:                                                           */00000110
 /*    R0011409 INNHOLDER:                                            */00000120
 /*      PROSEDYRE FOR BLANKING AV E1_MAP.                            */00000130
 /*      PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL        */00000140
 /*           E1_TRANS_OMR.                                           */00000150
 /*ENDRING:                                                           */00000160
 /*    PROSEDYRENE ER SKILT UT FRA R0011402.     070587  BRITT        */00000170
 /*PROGRAMTILKNYTNING:                                                */00000180
 /*    PROSEDYRENE INCLUDES I BEHANDLINGA AV ENDRINGSBLANKETTER TIL   */00000190
 /*    DET MASKINELLE FOLKETRYGDSYSTEMET.                             */00000200
 /*    ARBEIDSOMRÅDE: P0011401  (LIGGER I R001.TEST.COPYLIB)          */00000210
 /*BRUK:                                                              */00000220
 /*    %INCLUDE R0011409;                                             */00000230
 /*    BLANK_E1_MAP:      SETTE LOW VALUES TIL MAPEN OG               */00000240
 /*                       BLANKER MELDINGSFELTENE.                    */00000250
 /*    OVERFØR_E1_SØKER:  OVERFØRER SØKERDELEN MAP->ARBEIDSOMRÅDE     */00000260
 /*    OVERFØR_E1_KAP7:   OVERFØRER KAPITTEL 7 MAP->ARBEIDSOMRÅDE     */00000270
 /*    OVERFØR_E1_KAP8:   OVERFØRER KAPITTEL 8 MAP->ARBEIDSOMRÅDE     */00000280
 /*    OVERFØR_E1_KAP10:  OVERFØRER KAPITTEL 10 MAP-> ARBEIDSOMRÅDE   */00000290
 /*YS*//*OVERFØR_E1_KAP11:  OVERFØRER KAPITTEL 11 MAP-> ARBEIDSOMRÅDE */00000300
 %PAGE;                                /*   */                          00000310
 /* ***************************************************************** */00000320
 /*                                                                   */00000330
 /*   PROSEDYRE FOR Å SETTE LOW VALUES TIL MAP, SAMT                  */00000340
 /*   BLANKE MELDINGSFELTENE.                                         */00000350
 /*                                                                   */00000360
 /* ***************************************************************** */00000370
 %SKIP;                                                                 00000380
   BLANK_E1_MAP:                                                        00000390
      PROC;                                                             00000400
   DCL                                                                  00000410
     LOW BUILTIN;                                                       00000420
                                                                        00000430
       NAVN_NYTTO      = LOW(25);                                       00000440
       NAVN_NYTT_EKO   = LOW(25);                                       00000450
       FNR_EKO         = LOW(11);                                       00000460
       NAVN_EKO        = LOW(25);                                       00000470
       SKILSMISSEO     = LOW(1);                                        00000480
       FLYTTET_FRAO    = LOW(1);                                        00000490
       FLYTTET_SAMMENO = LOW(1);                                        00000500
       UNDER4GO        = LOW(1);                                        00000510
       MINST4GO        = LOW(1);                                        00000520
       FAIO            = LOW(7);                                        00000530
       APD_MAXO        = LOW(1);                                        00000540
       APDO            = LOW(3);                                        00000550
       UFGO            = LOW(3);                                        00000560
 /*YS*/YUFGO           = LOW(3);                                        00000570
       FORVENTETO      = LOW(7);                                        00000580
       O_TIL_PENSJONO  = LOW(1);                                        00000590
       TP_PROSENTO     = LOW(3);                                        00000600
       FRAML_DATO_MÅO  = LOW(4);                                        00000610
       OPPHØR_EOO      = LOW(1);                                        00000620
       MELDING1O       = (78)' ';                                       00000630
       MELDING2O       = (78)' ';                                       00000640
       MELDING3O       = (78)' ';                                       00000650
       MELDING4O       = (78)' ';                                       00000660
       MELDING5O       = (78)' ';                                       00000670
       MELDING6O       = (78)' ';                                       00000680
   END BLANK_E1_MAP;                                                    00000690
 %PAGE;                                /*   */                          00000700
 /* ***************************************************************** */00000710
 /*                                                                   */00000720
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,                    */00000730
 /*   EVENTUELT ENDRA PÅ SKJERMBILDET TIL E1_TRANS_OMR I              */00000740
 /*   KOM_OMR FOR E1_SØKER.                                           */00000750
 /*           MAPSET:  S001143   MAP S001141                          */00000760
 /*                                                                   */00000770
 /* ***************************************************************** */00000780
 %SKIP;                                                                 00000790
 OVERFØR_E1_SØKER:                                                      00000800
   PROC;                                                                00000810
      IF REGDATOL           > 0 THEN                                    00000820
         E1S.REGDATO        = F_FELT_CHAR_PIC6  (REGDATOI);             00000830
      IF TERMIDL            > 0 THEN                                    00000840
         E1S.TERMID         = TERMIDI;                                  00000850
      IF FNRL               > 0 THEN                                    00000860
         E1S.FNR            = F_FELT_CHAR_PIC11 (FNRI);                 00000870
      IF TKNRL              > 0 THEN                                    00000880
         E1S.TKNR           = F_FELT_CHAR_PIC4 (TKNRI);                 00000890
      IF SPRÅKL             > 0 THEN                                    00000900
         E1S.SPRÅK          = SPRÅKI;                                   00000910
      IF VIRK_DATO_MÅL      > 0 THEN                                    00000920
         E1S.VIRK_DATO_MÅ   = F_FELT_CHAR_PIC4 (VIRK_DATO_MÅI);         00000930
      IF NAVN_NYTTL         > 0 THEN                                    00000940
         E1S.NAVN_NYTT      = NAVN_NYTTI;                               00000950
      IF NAVN_NYTT_EKL      > 0 THEN                                    00000960
         E1S.NAVN_NYTT_EK   = NAVN_NYTT_EKI;                            00000970
      IF FNR_EKL            > 0 THEN                                    00000980
         E1S.FNR_EK         = F_FELT_CHAR_PIC11 (FNR_EKI);              00000990
      IF NAVN_EKL           > 0 THEN                                    00001000
         E1S.NAVN_EK        = NAVN_EKI;                                 00001010
      IF SKILSMISSEL        > 0 THEN                                    00001020
         E1S.SKILSMISSE     = SKILSMISSEI;                              00001030
      IF FLYTTET_FRAL       > 0 THEN                                    00001040
         E1S.FLYTTET_FRA    = FLYTTET_FRAI;                             00001050
      IF FLYTTET_SAMMENL    > 0 THEN                                    00001060
         E1S.FLYTTET_SAMMEN = FLYTTET_SAMMENI;                          00001070
      IF UNDER4GL           > 0 THEN                                    00001080
         E1S.EK_INNTU       = UNDER4GI;                                 00001090
      IF MINST4GL           > 0 THEN                                    00001100
         E1S.EK_INNTM       = MINST4GI;                                 00001110
   END OVERFØR_E1_SØKER;                                                00001120
 %PAGE;                                /*   */                          00001130
 /* ***************************************************************** */00001140
 /*                                                                   */00001150
 /*   PROSEDYRE FOR Å OVERFØRE OPPLYSNINGER FRA                       */00001160
 /*   SKJERMBILDET TIL E1_TRANS_OMR I KOM_OMR FOR E1_KAPITTEL 7       */00001170
 /*                 MAPSET S001143   MAP S001141                      */00001180
 /*                                                                   */00001190
 /* ***************************************************************** */00001200
 OVERFØR_E1_KAP7:                                                       00001210
   PROC;                                                                00001220
      IF FAIL         > 0 THEN                                          00001230
         E1K7.FAI     = F_FELT_CHAR_PIC7 (FAII);                        00001240
      IF APD_MAXL     > 0 THEN                                          00001250
         E1K7.APD_MAX = APD_MAXI;                                       00001260
      IF APDL         > 0 THEN                                          00001270
         E1K7.APD     = F_FELT_CHAR_PIC3 (APDI);                        00001280
   END OVERFØR_E1_KAP7;                                                 00001290
 %PAGE;                                /*   */                          00001300
 /* ***************************************************************** */00001310
 /*                                                                   */00001320
 /*   PROSEDYRE FOR Å OVERFØRE OPPLYSNINGER FRA                       */00001330
 /*   SKJERMBILDET TIL E1_TRANS_OMR I KOM_OMR FOR E1_KAPITTEL 8       */00001340
 /*                 MAPSET S001143   MAP S001141                      */00001350
 /*                                                                   */00001360
 /* ***************************************************************** */00001370
 OVERFØR_E1_KAP8:                                                       00001380
   PROC;                                                                00001390
      IF UFGL     > 0 THEN                                              00001400
         E1K8.UFG = F_FELT_CHAR_PIC3 (UFGI);                            00001410
   END OVERFØR_E1_KAP8;                                                 00001420
 %PAGE;                                /*   */                          00001430
 /* ***************************************************************** */00001440
 /*                                                                   */00001450
 /*   PROSEDYRE FOR Å OVERFØRE OPPLYSNINGER FRA                       */00001460
 /*   SKJERMBILDET TIL E1_TRANS_OMR I KOM_OMR FOR E1_KAPITTEL 10      */00001470
 /*                 MAPSET S001143   MAP S001141                      */00001480
 /*                                                                   */00001490
 /* ***************************************************************** */00001500
 OVERFØR_E1_KAP10:                                                      00001510
   PROC;                                                                00001520
      IF FORVENTETL          > 0 THEN                                   00001530
         E1K10.FORVENTET     = F_FELT_CHAR_PIC7 (FORVENTETI);           00001540
      IF O_TIL_PENSJONL      > 0 THEN                                   00001550
         E1K10.O_TIL_PENSJON = O_TIL_PENSJONI;                          00001560
      IF TP_PROSENTL         > 0 THEN                                   00001570
         E1K10.TP_PROSENT    = F_FELT_CHAR_PIC3 (TP_PROSENTI);          00001580
      IF FRAML_DATO_MÅL      > 0 THEN                                   00001590
         E1K10.FRAML_DATO_MÅ = F_FELT_CHAR_PIC4 (FRAML_DATO_MÅI);       00001600
      IF OPPHØR_EOL          > 0 THEN                                   00001610
         E1K10.OPPHØR_EO     = OPPHØR_EOI;                              00001620
                                                                        00001630
   END OVERFØR_E1_KAP10;                                                00001640
 %PAGE;                                /*   */                          00001650
 /* *********************************************************** *//*YS*/00001660
 /*YS*/ /* OBS - NY PROSEDYRE                                   *//*YS*/00001670
 /*   PROSEDYRE FOR Å OVERFØRE OPPLYSNINGER FRA                 *//*YS*/00001680
 /*   SKJERMBILDET TIL E1_TRANS_OMR I KOM_OMR FOR E1_KAPITTEL 11*//*YS*/00001690
 /*                 MAPSET S001143   MAP S001141                *//*YS*/00001700
 /*                                                             *//*YS*/00001710
 /* *********************************************************** *//*YS*/00001720
 OVERFØR_E1_KAP11:                                                /*YS*/00001730
   PROC;                                                          /*YS*/00001740
      IF YUFGL    > 0 THEN                                        /*YS*/00001750
         E1K11.YUG = F_FELT_CHAR_PIC3 (YUFGI);                    /*YS*/00001760
   END OVERFØR_E1_KAP11;                                          /*YS*/00001770
