 /*       SIST ENDRET 13/03-98 13.36.16 AV   JDA7339                  */00000000
 /*       SIST ENDRET 13/03-98 13.21.01 AV   JDA7339                  */00000010
 /*       SIST ENDRET 26/04-91 12.28.29 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 14/04-89 14.43.18 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 12/01-88 09.58.44 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 24/03-87 12.06.41 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 18/07-85 15.43.57 AV   HERMAN                   */00000060
 /*       SIST ENDRET 15/02-85 15.05.53 AV   HERMAN                   */00000070
 /*       SIST ENDRET 05/11-84 08.25.13 AV   LUNDEBY                  */00000080
 /*       SIST ENDRET 27/08-84 08.31.05 AV   HERMAN                   */00000090
 /*       SIST ENDRET 25/06-84 09.39.23 AV   KARIN                    */00000100
 /*       SIST ENDRET 25/04-84 14.11.35 AV   FARVIK                   */00000110
 /*       SIST ENDRET 22/12-83 08.56.48 AV   FARVIK                   */00000120
 /*       SIST ENDRET 01/03-83 12.46.26 AV   FARVIK                   */00000130
 /* ***************************************************************** */00000140
 /*IDENTIFIKASJON:                                                    */00000150
 /*    R0011220 - PROSEDYRE I PLI                                     */00000160
 /*    PROGRAMMERER: GEIR, JANUAR 1982                                */00000170
 /*HENSIKT:                                                           */00000180
 /*    FORSØRGINGSTILLEGG EKTEFELLE / BARN                            */00000190
 /*    RUTINEN KONTROLLERER ALLE PERSONER I TRANSAKSJONEN MOT         */00000200
 /*    INFORMASJON I REGISTERET.  NÅR DET OPPDAGES UOVERENSSTEMMELSER */00000210
 /*    BLIR FEIL-MELD_NR SATT OG VI GÅR UT AV PGR.FOR HVER FAMILIE-   */00000220
 /*    PERSON SOM GÅR FEILFRI GJENNOM KONTROLLENE BLIR DET OPPRETTET  */00000230
 /*    NY STATUS FOR PERSONEN, OG SØKERENS STATUS OPPDATERES.         */00000240
 /* ****************************************************************  */00000250
 /*     ENDRET 6/6-84 AV KARIN                                        */00000260
 /*    ENDRINGEN GJELDER REDUSERT BARNETILLEGG, GJ. FRA 1/7-84        */00000270
 /*    EKTEFELLENS PENSJONSTATUS OPPDATERES MED OPPLYSNINGER OM       */00000280
 /*    INNTEKT OVER ELLER UNDER 4G.                                   */00000290
 /*    BARNETS PENSJONSSTATUS OPPDATERE MED OPPLYSNINGER OM EV.       */00000300
 /*    REDUSERT BARNETILLEGG.                                         */00000310
 /* ***************************************************************** */00000320
 /* ENDRET 28.8.84 AV HERMAN.                                         */00000330
 /*    BARNA BLE LAGT OPPÅ HVERANDRE FORDI INDEKSEN BLE SATT VED      */00000340
 /*    TEST MOT B01 HELE TIDEN.                                       */00000350
 /* ***************************************************************** */00000360
 /* ENDRET 01.11.84 AV S. LUNDEBY                                     */00000370
 /*    SETTER  B02 = B01   NÅR PT2 = 'E' .                            */00000380
 /* ***************************************************************** */00000390
 /*PROGRAMTILKNYTNING:                                                */00000400
 /*    KALLES OPP AV PROGRAM R0013520                                 */00000410
 /*BRUK:                                                              */00000420
 /*    EXEC CICS XCTL PROGRAM ('R0011220') COMMAREA (KOM_OMR)         */00000430
 /*                                                                   */00000440
 /* ***************************************************************** */00000450
 %SKIP;                                                                 00000460
 KON_FT:                                                                00000470
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000480
 %SKIP;                                                                 00000490
      %INCLUDE P0019908;   /* KOM_OMR  BASED(COMMAREA_PEKER)        */  00000500
      %INCLUDE P0019906;   /* TRANS_OPPL_OMR BASED(TRANS_OPPL_PEKER)*/  00000510
      %INCLUDE P0011201;                                                00000520
      %INCLUDE P0019910;   /* STYRINGS_OMR  BASED(STYRINGS_PEKER)   */  00000530
      %INCLUDE P0019912;   /* DIV_PARAM_OMR  BASED(DIV_PARAM_PEKER) */  00000540
                                                                        00000550
      DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                    00000560
      DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                    00000570
      DCL COMMAREA_PEKER PTR;                                           00000580
                                                                        00000590
   DCL                                                                  00000600
      BARN_IND        FIXED    BIN (15),                                00000610
      I               FIXED    BIN (15),                                00000620
      J               FIXED    BIN (15),                                00000630
      CSTG            BUILTIN;                                          00000640
                                                                        00000650
 %PAGE;  /*    */                                                       00000660
 /* ************************************************************** */   00000670
 /* PROGRAMMET BEGYNNER HER                                        */   00000680
 /* ************************************************************** */   00000690
 %SKIP;                                                                 00000700
     PROGRAM_ID = 'R0011220';                                           00000710
     BARN_IND   = 0;                                                    00000720
      TRANSTYPE = '6';                                                  00000730
 %SKIP;                                                                 00000740
      IF B01.TKNR(SØKER_IND) > 0  THEN                                  00000750
         IF B01.TKNR(SØKER_IND) ^= FTS.TKNR THEN                        00000760
            DO;                                                         00000770
 L100:                                                                  00000780
               FEIL_VED_LABEL = '100';                                  00000790
               FEIL_MELD_NR   = 1702;                                   00000800
               GO TO L999;                                              00000810
            END;                                                        00000820
                                                                        00000830
 /* ***************************************************************** */00000840
 /* SØKEREN STÅR REGISTRERT SOM ALDERS- ELLER UFØREPENSJONIST         */00000850
 /* ELLER AFP-PENSJONIST                                              */00000860
 /* ***************************************************************** */00000870
                                                                        00000880
      IF (B01.PENSJONSTYPE1(SØKER_IND) = 'A' !                          00000890
 /*AFP*/ (B01.PENSJONSTYPE1(SØKER_IND) = 'K' &                          00000900
 /*AFP*/  B01.PENSJONSTYPE2(SØKER_IND)^= 'N') !                         00000910
 /*YS*/   B01.PENSJONSTYPE1(SØKER_IND) = 'U' !                          00000920
 /*YS*/   B01.PENSJONSTYPE1(SØKER_IND) = 'Y') THEN                      00000930
         DO;                                                            00000940
                                                                        00000950
 /* ***************************************************************** */00000960
 /* DERSOM DET ER EKTEFELLE I TRANSEN.                                */00000970
 /* ***************************************************************** */00000980
                                                                        00000990
            IF FTS.FNR_EK > 0 THEN                                      00001000
               DO;                                                      00001010
                                                                        00001020
 /* ***************************************************************** */00001030
 /* DERSOM SØKERS SIVILSTAND ER UGIFT.                                */00001040
 /* ***************************************************************** */00001050
                                                                        00001060
                  SELECT (B01.SIVILSTAND(SØKER_IND));                   00001070
                     WHEN ('U')                                         00001080
                        DO;                                             00001090
 L120:                                                                  00001100
                           FEIL_VED_LABEL = '120';                      00001110
                           FEIL_MELD_NR   = 1001;                       00001120
                           GO TO L999;                                  00001130
                        END;                                            00001140
                                                                        00001150
 /* ***************************************************************** */00001160
 /* DERSOM SØKER ER SKILT.                                            */00001170
 /* ***************************************************************** */00001180
                                                                        00001190
                     WHEN ('S')                                         00001200
                        DO;                                             00001210
 L130:                                                                  00001220
                           FEIL_VED_LABEL = '130';                      00001230
                           FEIL_MELD_NR   = 1002;                       00001240
                           GO TO L999;                                  00001250
                        END;                                            00001260
                                                                        00001270
 /* ***************************************************************** */00001280
 /* DERSOM SØKER ER ETTERLATT.                                        */00001290
 /* ***************************************************************** */00001300
                                                                        00001310
                     WHEN ('E')                                         00001320
                        DO;                                             00001330
 L140:                                                                  00001340
                           FEIL_VED_LABEL = '140';                      00001350
                           FEIL_MELD_NR   = 1003;                       00001360
                           GO TO L999;                                  00001370
                        END;                                            00001380
                                                                        00001390
 /* ***************************************************************** */00001400
 /* ELLERS ER SØKEREN GIFT.                                           */00001410
 /* ***************************************************************** */00001420
                                                                        00001430
                     OTHERWISE                                          00001440
                        DO;                                             00001450
                                                                        00001460
 /* ***************************************************************** */00001470
 /* DERSOM DET ER SAMME EKTEFELLE SOM I SØKERENS PESTATUS.            */00001480
 /* ***************************************************************** */00001490
                                                                        00001500
                           IF B01.FNR(EKTEF_IND) = FTS.FNR_EK THEN      00001510
                              DO;                                       00001520
                                                                        00001530
 /* 9926 */                      CALL FLYTT_B01_TIL_B02(SØKER_IND);     00001540
                                                                        00001550
                                 IF FEIL_MELD_NR > 0 THEN               00001560
                                    GO TO L999;                         00001570
                                 ELSE                                   00001580
                                    PROGRAM_ID = ' R0011220';           00001590
                                                                        00001600
 /* 9926 */                      CALL FLYTT_B01_TIL_B02(EKTEF_IND);     00001610
                                                                        00001620
                                 IF FEIL_MELD_NR > 0 THEN               00001630
                                    GO TO L999;                         00001640
                                 ELSE                                   00001650
                                    PROGRAM_ID = ' R0011220';           00001660
                                                                        00001670
 /* ***************************************************************** */00001680
 /* DERSOM DET SØKES OM TILLEGG FOR EKTEFELLE.                        */00001690
 /* ***************************************************************** */00001700
                                                                        00001710
                                 IF FTS.TILL_EK = 'J' THEN              00001720
                                                                        00001730
 /* ***************************************************************** */00001740
 /* DERSOM EKTEFELLE HAR PENSJON.                                     */00001750
 /* ***************************************************************** */00001760
                                                                        00001770
                                    IF B01.                             00001780
                                       PENSJONSTYPE1(EKTEF_IND) = 'A' ! 00001790
 /*YS*/                                B01.PENSJONSTYPE1(EKTEF_IND) =   00001800
 /*YS*/                                                       'U'     ! 00001810
 /*AFP*/                               B01.PENSJONSTYPE1(EKTEF_IND) =   00001820
 /*AFP*/                                                      'K'     ! 00001830
 /*YS*/                                B01.PENSJONSTYPE1(EKTEF_IND) =   00001840
 /*YS*/                                                       'Y' THEN  00001850
                                       DO;                              00001860
 L150:                                                                  00001870
                                          FEIL_VED_LABEL = '150';       00001880
                                          FEIL_MELD_NR   = 1011;        00001890
                                          GO TO L999;                   00001900
                                       END;                             00001910
                                                                        00001920
                                 CALL                                   00001930
 /* 1222 */                          AJOURFØR_B02_MED_FT_TRANS;         00001940
                                                                        00001950
                              END;                                      00001960
                                                                        00001970
 /* ***************************************************************** */00001980
 /* IKKE SAMME EKTEFELLE.                                             */00001990
 /* ***************************************************************** */00002000
                                                                        00002010
                           ELSE                                         00002020
                              DO;                                       00002030
 L160:                                                                  00002040
                                 FEIL_VED_LABEL = '160';                00002050
                                 FEIL_MELD_NR   = 1004;                 00002060
                                 GO TO L999;                            00002070
                              END;                                      00002080
                        END;                                            00002090
                  END;                                                  00002100
               END;                                                     00002110
                                                                        00002120
 /* ***************************************************************** */00002130
 /* INGEN EKTEFELLE I TRANS.                                          */00002140
 /* ***************************************************************** */00002150
                                                                        00002160
            ELSE                                                        00002170
               DO;                                                      00002180
                                                                        00002190
 /* ***************************************************************** */00002200
 /* DERSOM SØKEREN ER REGISTRERT SOM GIFT.                            */00002210
 /* ***************************************************************** */00002220
                                                                        00002230
                                                                        00002240
 /* ENDRET 16.7.87 BF:  HVIS EKTEFELLE IKKE ER MED I TRANSEN, MEN ER  */00002250
 /*                     REG I STATUS, LEGGES EKTEFELLES FØDSELSNUMMER */00002260
 /*                     INN I TRANSEN.  DETTE GJØRES FOR Å UNNGÅ AT   */00002270
 /*                     EKTEFELLES STATUS SKAL BLI FJERNET I R0015401.*/00002280
 /*                     FEILRAPP. 517.                                */00002290
                                                                        00002300
                  IF B01.SIVILSTAND(SØKER_IND) = 'G' !                  00002310
                     B01.SIVILSTAND(SØKER_IND) = 'A' THEN               00002320
                                                                        00002330
 /* FJERNET 18.7.85 HL  ! B01.SIVILSTAND(SØKER_IND) = 'A' THEN        */00002340
                                                                        00002350
                     DO;                                                00002360
                        IF B01.FNR(EKTEF_IND)  >  0  &                  00002370
                           FTS.TILL_EK        ^= 'J' THEN               00002380
                           DO;                                          00002390
                              FTS.FNR_EK = B01.FNR(EKTEF_IND);          00002400
 /* 9926 */                   CALL FLYTT_B01_TIL_B02(SØKER_IND);        00002410
                                                                        00002420
                              IF FEIL_MELD_NR > 0 THEN                  00002430
                                 GO TO L999;                            00002440
                              ELSE                                      00002450
                                 PROGRAM_ID = ' R0011220';              00002460
                                                                        00002470
 /* 9926 */                   CALL FLYTT_B01_TIL_B02(EKTEF_IND);        00002480
                                                                        00002490
                              IF FEIL_MELD_NR > 0 THEN                  00002500
                                 GO TO L999;                            00002510
                              ELSE                                      00002520
                                 PROGRAM_ID = ' R0011220';              00002530
                           END;                                         00002540
                        ELSE                                            00002550
                           DO;                                          00002560
 L170:                                                                  00002570
                              FEIL_VED_LABEL = '170';                   00002580
                              FEIL_MELD_NR = 1102;                      00002590
                              GO TO L999;                               00002600
                           END;                                         00002610
                     END;                                               00002620
                                                                        00002630
                                                                        00002640
 /* HIT    16.7.87 BF                                                 */00002650
                                                                        00002660
                  ELSE                                                  00002670
                     DO;                                                00002680
                                                                        00002690
 /* 9926 */             CALL FLYTT_B01_TIL_B02(SØKER_IND);              00002700
                                                                        00002710
                        IF FEIL_MELD_NR > 0 THEN                        00002720
                           GO TO L999;                                  00002730
                        ELSE                                            00002740
                           PROGRAM_ID = ' R0011220';                    00002750
                                                                        00002760
                        IF B01.PENSJONSTYPE2 (SØKER_IND) =  'E'    THEN 00002770
                          DO;                                           00002780
                           B02.PERSON(EKTEF_IND)= B01.PERSON(EKTEF_IND);00002790
                                                                        00002800
 /* RULLERING AV FORVENTET            - 9802 HL */                      00002810
                    IF B02.ETTEPENS.FORVENTET(SØKER_IND) > 0   THEN     00002820
                       CALL RULL_FORVENTET(B02.G_DATO_ÅM(SØKER_IND),    00002830
                                B02.VIRK_DATO_ÅM(SØKER_IND),            00002840
                                B02.ETTEPENS.FORVENTET(SØKER_IND));     00002850
                                                                        00002860
                          END;                                          00002870
                                                                        00002880
 /* 1222 */             CALL AJOURFØR_B02_MED_FT_TRANS;                 00002890
                                                                        00002900
                     END;                                               00002910
                END;                                                    00002920
         END;                                                           00002930
      ELSE                                                              00002940
         DO;                                                            00002950
 L175:                                                                  00002960
            FEIL_VED_LABEL = '175';                                     00002970
            FEIL_MELD_NR   = 1010;                                      00002980
            GO TO L999;                                                 00002990
         END;                                                           00003000
                                                                        00003010
 /* ***************************************************************** */00003020
 /* BARNEDELEN                                                        */00003030
 /* ***************************************************************** */00003040
                                                                        00003050
 /*AFP*/IF FTS.BT_ANT > 0 &                                             00003060
 /*AFP*/   B01.PENSJONSTYPE1(SØKER_IND) = 'K'  THEN                     00003070
                                                                        00003080
 /* ***************************************************************** */00003090
 /* SØKER HAR AVTALEFESTET PENSJON - BARNETILLEGG KAN IKKE TILSTÅS    */00003100
 /* ***************************************************************** */00003110
                                                                        00003120
 /*AFP*/   DO;                                                          00003130
 /*AFP*/L177:                                                           00003140
 /*AFP*/      FEIL_VED_LABEL = '177';                                   00003150
 /*AFP*/      FEIL_MELD_NR   = 1010;                                    00003160
 /*AFP*/      GO TO L999;                                               00003170
 /*AFP*/   END;                                                         00003180
                                                                        00003190
      DO I = 1 TO FTS.BT_ANT;                                           00003200
         BARN_IND = 0;                                                  00003210
                                                                        00003220
 /* ENDRET TESTEN NEDENFOR FRA B01 TIL B02 28.8.84    HL             */ 00003230
                                                                        00003240
         DO J = 3 TO 14 WHILE (B02.FNR(J) > 0);                         00003250
                                                                        00003260
 /* HIT 28.8.84                                                      */ 00003270
                                                                        00003280
            IF FTB.FNR_BARN(I) = B01.FNR(J) THEN                        00003290
               DO;                                                      00003300
                  BARN_IND = J;                                         00003310
                  J        = 14;                                        00003320
               END;                                                     00003330
         END;                                                           00003340
                                                                        00003350
 /* **************************************************************** */ 00003360
 /*  DERSOM BARNET ER I B01(TILKNYTTET SØKERENS FAMILIE).            */ 00003370
 /* **************************************************************** */ 00003380
                                                                        00003390
         IF BARN_IND > 0 THEN                                           00003400
            DO;                                                         00003410
                                                                        00003420
 /* **************************************************************** */ 00003430
 /* DERSOM BARNET ER TILKNYTTET EKTEFELLE.                           */ 00003440
 /* **************************************************************** */ 00003450
                                                                        00003460
               IF B01.FNR_TILKN(BARN_IND,1) = B01.                      00003470
                                                  FNR(EKTEF_IND) THEN   00003480
                  DO;                                                   00003490
                     IF B01.PENSJONSTYPE1(BARN_IND) = 'L' THEN          00003500
                        DO;                                             00003510
 L180:                                                                  00003520
                           FEIL_VED_LABEL = '180';                      00003530
                           FEIL_MELD_NR   = 1201;                       00003540
                           GO TO L999;                                  00003550
                        END;                                            00003560
                     ELSE                                               00003570
                                                                        00003580
 /* **************************************************************** */ 00003590
 /* TILKNYTNINGSKODE = NOE ANNET.                                    */ 00003600
 /* **************************************************************** */ 00003610
                                                                        00003620
                        DO;                                             00003630
 L190:                                                                  00003640
                           FEIL_VED_LABEL = '190';                      00003650
                           FEIL_MELD_NR   = 1208;                       00003660
                           GO TO L999;                                  00003670
                        END;                                            00003680
                  END;                                                  00003690
               ELSE                                                     00003700
                                                                        00003710
 /* **************************************************************** */ 00003720
 /* BARNET ER TILKNYTTET SØKER.                                      */ 00003730
 /* **************************************************************** */ 00003740
                                                                        00003750
                  DO;                                                   00003760
                     IF B01.PENSJONSTYPE1(BARN_IND) ^= 'L'              00003770
                     THEN                                               00003780
                        DO;                                             00003790
 L200:                                                                  00003800
                           FEIL_VED_LABEL = '200';                      00003810
                           FEIL_MELD_NR   = 1207;                       00003820
                           GO TO L999;                                  00003830
                        END;                                            00003840
                                                                        00003850
 /* ENDRET 280187 BF FRAPP 384  */                                      00003860
                                                                        00003870
                     IF FTB.RBT_BARN (I) = 'J' THEN                     00003880
                        B02.PENSJONSTYPE2(BARN_IND) = 'R';              00003890
                     ELSE                                               00003900
                        B02.PENSJONSTYPE2(BARN_IND) = ' ';              00003910
                                                                        00003920
 /* HIT    280187 BF            */                                      00003930
                                                                        00003940
                  END;                                                  00003950
            END;                                                        00003960
         ELSE                                                           00003970
                                                                        00003980
 /* *************************************************************** */  00003990
 /* BARNET ER IKKE I B01.                                           */  00004000
 /* *************************************************************** */  00004010
                                                                        00004020
            DO;                                                         00004030
               BARN_IND        = J;                                     00004040
               SEARCH_FNR      = FTB.FNR_BARN(I);                       00004050
               POS_I_B01       = BARN_IND;                              00004060
                                                                        00004070
               EXEC CICS LINK PROGRAM ('R0019928') COMMAREA             00004080
                                                     (KOM_OMR);         00004090
                                      /* OPPRETT_STATUS_FOR_PERSON */   00004100
                                                                        00004110
               IF FEIL_MELD_NR > 0 THEN                                 00004120
                  GO TO L999;                                           00004130
               ELSE                                                     00004140
                  PROGRAM_ID = 'R0011220';                              00004150
                                                                        00004160
 /* ************************************************************** */   00004170
 /* DERSOM BARNET ER I BASEN.                                      */   00004180
 /* ************************************************************** */   00004190
                                                                        00004200
               IF B01.FNR(BARN_IND) > 0 THEN                            00004210
                  DO;                                                   00004220
                                                                        00004230
 /* ************************************************************** */   00004240
 /* BARNET HAR IKKE PESTATUS.                                      */   00004250
 /* ************************************************************** */   00004260
                                                                        00004270
                     IF STATUS_TYPE = 'A' !                             00004280
                        STATUS_TYPE = 'C' !                             00004290
                        STATUS_TYPE = 'I' !     /* TILLEGGSTEST I,K */  00004300
                        STATUS_TYPE = 'K' THEN  /* 14.2.85  HL      */  00004310
                        DO;                                             00004320
                                                                        00004330
  /* 9926 */               CALL FLYTT_B01_TIL_B02(BARN_IND);            00004340
  /* KS 6/6-84   */                                                     00004350
                           IF FTB.RBT_BARN (I) = 'J' THEN               00004360
                              B02.PENSJONSTYPE2(BARN_IND) = 'R';        00004370
                           ELSE                                         00004380
                              B02.PENSJONSTYPE2(BARN_IND) = ' ';        00004390
                                                                        00004400
                           CALL                                         00004410
  /* 9923 */                   OPPRETT_STATUS_FORS_BARN(BARN_IND,       00004420
                                                       SØKER_IND);      00004430
                                                                        00004440
                           CALL                                         00004450
  /* 9924 */                   KOBLE_TO_PERSONER(SØKER_IND,BARN_IND);   00004460
                        END;                                            00004470
                     ELSE                                               00004480
                                                                        00004490
 /* ************************************************************** */   00004500
 /* BARNET HAR PESTATUS.                                           */   00004510
 /* ************************************************************** */   00004520
                                                                        00004530
                        DO;                                             00004540
                           IF STATUS_TYPE ^= 'F'                        00004550
                                                           THEN         00004560
                              DO;                                       00004570
                                                                        00004580
 /* ************************************************************** */   00004590
 /* BARNET ER FORSØRGET AV ANDRE.                                  */   00004600
 /* ************************************************************** */   00004610
                                                                        00004620
                                 IF B01.                                00004630
                                    PENSJONSTYPE1(BARN_IND) = 'L' THEN  00004640
                                    DO;                                 00004650
  L210:                                                                 00004660
                                       FEIL_VED_LABEL = '210';          00004670
                                       FEIL_MELD_NR   = 1203;           00004680
                                       GO TO L999;                      00004690
                                    END;                                00004700
                                 ELSE                                   00004710
                                                                        00004720
 /* ************************************************************** */   00004730
 /* BARNET ER TILKNYTTET ANDRE PÅ EN ANNEN MÅTE.                   */   00004740
 /* ************************************************************** */   00004750
                                                                        00004760
                                    IF B01.                             00004770
                                       FNR_TILKN(BARN_IND,1) > 0 THEN   00004780
                                       DO;                              00004790
  L220:                                                                 00004800
                                          FEIL_VED_LABEL = '220';       00004810
                                          FEIL_MELD_NR   = 1206;        00004820
                                          GO TO L999;                   00004830
                                       END;                             00004840
                                    ELSE                                00004850
                                                                        00004860
 /* ************************************************************** */   00004870
 /* BARNET HAR PENSJON.                                            */   00004880
 /* ************************************************************** */   00004890
                                                                        00004900
                                       DO;                              00004910
  L240:                                                                 00004920
                                          FEIL_VED_LABEL = '240';       00004930
                                          FEIL_MELD_NR   = 1204;        00004940
                                          GO TO L999;                   00004950
                                       END;                             00004960
                              END;                                      00004970
                           ELSE                                         00004980
                              DO;                                       00004990
  L250:                                                                 00005000
                                 FEIL_VED_LABEL = '250';                00005010
                                 FEIL_MELD_NR   = 0601;                 00005020
                                 GO TO L999;                            00005030
                              END;                                      00005040
                        END;                                            00005050
                  END;                                                  00005060
               ELSE                                                     00005070
                                                                        00005080
 /* *********************************************************** */      00005090
 /* BARNET ER IKKE I BASEN.                                     */      00005100
 /* *********************************************************** */      00005110
                                                                        00005120
                  DO;                                                   00005130
                     B02.FNR   (BARN_IND) = FTB.FNR_BARN(I);            00005140
                     B02.NAVN  (BARN_IND) = (25)' ';                    00005150
                     B02.TKNR  (BARN_IND) = FTS.TKNR;                   00005160
  /* KS 6/6-84   */                                                     00005170
                     IF FTB.RBT_BARN (I) = 'J' THEN                     00005180
                        B02.PENSJONSTYPE2(BARN_IND) = 'R';              00005190
                     ELSE                                               00005200
                        B02.PENSJONSTYPE2(BARN_IND) = ' ';              00005210
                                                                        00005220
                     CALL                                               00005230
                          OPPRETT_STATUS_FORS_BARN(BARN_IND,            00005240
                                                  SØKER_IND);           00005250
                          /* 9923 */                                    00005260
                                                                        00005270
  /* 9924 */         CALL KOBLE_TO_PERSONER(SØKER_IND,BARN_IND);        00005280
                                                                        00005290
                  END;                                                  00005300
            END;                                                        00005310
      END;                                                              00005320
                                                                        00005330
 /* *********************************************************** */      00005340
 /* BARN TILKNYTTET SØKER MED L (FORSØRGEDE BARN)               */      00005350
 /* *********************************************************** */      00005360
                                                                        00005370
      B02.ANTALL_BARN(SØKER_IND) = 0;                                   00005380
      DO I = 1 TO 13 WHILE                                              00005390
                       (B02.TILKN.FNR_TILKN(SØKER_IND,I) > 0);          00005400
         IF B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'L'   !           00005410
            B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'V'   !  /*HL*/   00005420
            B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'W'   THEN        00005430
            B02.ANTALL_BARN(SØKER_IND) =                                00005440
                                   B02.ANTALL_BARN(SØKER_IND) + 1;      00005450
      END;                                                              00005460
  L999:                                                                 00005470
      EXEC CICS RETURN;                                                 00005480
 %PAGE;                                                                 00005490
      %INCLUDE R0011222;  /* AJOURFØR_B02_MED_FT_TRANS          */      00005500
 %PAGE;                                                                 00005510
      %INCLUDE R0019905;  /* F_ALDER                            */      00005520
 %PAGE;                                                                 00005530
      %INCLUDE R0019913;  /* F_SNU_DATO                         */      00005540
 %PAGE;                                                                 00005550
      %INCLUDE R0019923;  /* OPPRETT_STATUS_FORS_BARN           */      00005560
 %PAGE;                                                                 00005570
      %INCLUDE R0019924;  /* KOBLE_TO_PERSONER                  */      00005580
 %PAGE;                                                                 00005590
      %INCLUDE R0019926;  /* FLYTT_B01_TIL_B02                  */      00005600
      %INCLUDE R0019954;   /*RULL_FORVENTET*/                           00005610
   END KON_FT;                                                          00005620
