 /*       SIST ENDRET 29/08-97 12.27.56 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/08-97 08.52.38 AV   SPA7339                  */00000010
 /*       SIST ENDRET 20/01-93 10.22.02 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 20/07-92 09.52.03 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 16/10-89 12.42.06 AV   DYBVIK                   */00000040
 /*               R 0 0 1 1 8 3 3                                     */00000050
 /* ***************************************************************** */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /* **********************                                            */00000080
 /*  PROGRAM-IDENT : R0011833  KONTROLL_UF         SUBPROGRAM         */00000090
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000100
 /*  PROGRAMMERER  : TRUDE SPONBERG                                   */00000110
 /*  PROGRAMMET BLE LAGET : JUNI 1989                                 */00000120
 /*  ENDRINGERSDATO :                                                 */00000130
 /*  ENDRINGEN GJELDER:                                               */00000140
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000150
 /*                                                                   */00000160
 /* ***************************************************************** */00000170
 /*HENSIKT:                                                           */00000180
 /* **********                                                        */00000190
 /*  FORETAR KONTROLL AV BLANKETT UF.                                 */00000200
 /*  RETURNERER FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RETT          */00000210
 /*                                                                   */00000220
 /*                                                                   */00000230
 /*                                                                   */00000240
 /* ***************************************************************** */00000250
 /*PROGRAMTILKNYTTING:                                                */00000260
 /* ********************                                              */00000270
 /*  PROGRAMMET INCLUDES AV R0011831 - KONTROLL_BANKETT_UF            */00000280
 /*  ARBEIDSOMRÅDET P0011831 ER INCLUDET I HOVEDPROG                  */00000290
 /*  BRUK :                                                           */00000300
 /*  CALL KONTROLL_UF_SØKER(FEIL_I_UP_SØKER);                         */00000310
 /*  EXEC CICS LINK TIL R0019906 - ER FNR ENDRET ?                    */00000320
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN ER INCLUDET I HOVEDPROG :    */00000330
 /*          R0019902 - F_KJØNN                                       */00000340
 /*          R0019904 - F_GYLDIG_FNR                                  */00000350
 /*          R0019905 - F_ALDER                                       */00000360
 /*          R0019910 - F_NUMERISK                                    */00000370
 /*          R0019912 - F_FELT_PIC_CHAR11                             */00000380
 /*          VERIFY   - BUILTIN-FUNCTION                              */00000390
 /* ***************************************************************** */00000400
 /*DATASETTOPPLYSNINGER:                                              */00000410
 /* ***********************                                           */00000420
 /*   FØDSELSNR-ENDRINGSREG. LESES VED EXEC LINK TIL R0019906.        */00000430
 /*                                                                   */00000440
 /* ***************************************************************** */00000450
 /*FEILMELDINGER:                                                     */00000460
 /* *******************                                               */00000470
 /*   MELDINGSNR LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM            */00000480
 /*   FEIL_FUNNET SETTES = '1'B.                                      */00000490
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDING PÅ SKJERMBILDET      */00000500
 /*                                                                   */00000510
 /* ***************************************************************** */00000520
 %PAGE;                                /*   */                          00000530
 /* ***************************************************************** */00000540
 KONTROLL_UF_SØKER:                                                     00000550
   PROC (FEIL_FUNNET);                                                  00000560
   DCL                                                                  00000570
      FEIL_FUNNET     BIT (1);                                          00000580
                                                                        00000590
   DCL                                                                  00000600
      W_FNR                                     PIC'(11)9';             00000610
   DCL                                                                  00000620
      1 FNR DEF W_FNR,                                                  00000630
        2 DAG                                   PIC'(2)9',              00000640
        2 MND                                   PIC'(2)9',              00000650
        2 AAR                                   PIC'(2)9',              00000660
        2 ÅRHUNDRE                              PIC'9',                 00000670
        2 REST                                  PIC'(4)9';              00000680
   DCL                                                                  00000690
      ALDER           FIXED DEC (5),                                    00000700
      ALDERSGRENSE    FIXED DEC (5),    /*HL*/                          00000710
      IÅR             FIXED BIN (15),                                   00000720
      J               FIXED BIN (15),                                   00000730
      TELL            FIXED BIN (15);                                   00000740
                                                                        00000750
 %SKIP;                                                                 00000760
   DCL                                                                  00000770
      HJ_UFT_MÅ                                 PIC '9999',             00000780
      HJ_UFT_M DEF HJ_UFT_MÅ POS(1)             PIC '99',               00000790
      HJ_UFT_Å DEF HJ_UFT_MÅ POS(3)             PIC '99';               00000800
 %SKIP;                                                                 00000810
   DCL                                                                  00000820
      1 FNR_REG,                                                        00000830
        2 FNR1      FIXED DEC(11),                                      00000840
        2 FNR2      FIXED DEC(11),                                      00000850
        2 BRUKERID  CHAR     ( 4);                                      00000860
 %PAGE;                                                                 00000870
    FNR_REG.BRUKERID =  DIV_PARAM_OMR.CICS_IND;                         00000880
    FEIL_FUNNET      =  '0'B           ;                                00000890
                                                                        00000900
                                                                        00000910
                                                                        00000920
    IF ^F_NUMERISK(F_FELT_PIC_CHAR11(UFS.FNR)) THEN                     00000930
       DO;                                                              00000940
          FEIL_FUNNET = '1'B;                                           00000950
          UFS.FNRNR   = 200;                                            00000960
       END;                                                             00000970
    ELSE                                                                00000980
        IF ^F_GYLDIG_FNR(UFS.FNR) THEN                                  00000990
          DO;                                                           00001000
             FEIL_FUNNET = '1'B;                                        00001010
             UFS.FNRNR   = 1;                                           00001020
          END;                                                          00001030
        ELSE                                                            00001040
            DO;                                                         00001050
              FNR_REG.FNR1 = UFS.FNR;                                   00001060
              W_FNR        = UFS.FNR;                                   00001070
              EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);     00001080
                                                                        00001090
                IF FNR_REG.FNR2 > 0 THEN                                00001100
                  DO;                                                   00001110
                     UFS.FNRNR   = 203;                                 00001120
                     UFS.FNR_GML = UFS.FNR;                             00001130
                     UFS.FNR     = FNR_REG.FNR2;                        00001140
                     W_FNR       = FNR_REG.FNR2;                        00001150
                  END;                                                  00001160
                                                                        00001170
                   IF FNR.AAR  < 23 !                                   00001180
                      FNR.AAR  > 44  THEN                               00001190
                     DO;                                                00001200
                        FEIL_FUNNET   = '1'B;                           00001210
                        UFS.FNRNR     = 293;                            00001220
                     END;                                               00001230
            END;                                                        00001240
                                                                        00001250
                                                                        00001260
    IF ^F_NUMERISK(F_FELT_PIC_CHAR4(UFS.UFT_MÅ)) THEN                   00001270
       DO;                                                              00001280
          FEIL_FUNNET  = '1'B;                                          00001290
          UFS.UFT_MÅNR = 200;                                           00001300
       END;                                                             00001310
    ELSE                                                                00001320
       IF UFT_MÅ = 0  THEN                                              00001330
       DO;                                                              00001340
          FEIL_FUNNET  = '1'B;                                          00001350
          UFS.UFT_MÅNR =  40;                                           00001360
       END;                                                             00001370
                                                                        00001380
                                                                        00001390
    IF UFS.UFT_MÅNR = 0   THEN                                          00001400
       DO;                                                              00001410
         HJ_UFT_MÅ    = UFS.UFT_MÅ;                                     00001420
                                                                        00001430
         IF HJ_UFT_M  > 0 &  HJ_UFT_M  <  13                            00001440
                       &  HJ_UFT_Å  <= 66  THEN;                        00001450
    /*      DO;                                                         00001460
               FEIL_FUNNET   = '0'B;                                    00001470
            END;                           SP 18.01.93      */          00001480
         ELSE                                                           00001490
            DO;                                                         00001500
              FEIL_FUNNET   = '1'B;                                     00001510
              UFS.UFT_MÅNR  =  40;                                      00001520
            END;                                                        00001530
       END;                                                             00001540
                                                                        00001550
    HJ_UFT_MÅ    = UFS.UFT_MÅ;                                          00001560
                                                                        00001570
    IF UFS.UFT_MÅNR = 0   THEN                                          00001580
         DO;                                                            00001590
           IF  HJ_UFT_Å !! HJ_UFT_M  > 6701   THEN                      00001600
             DO;                                                        00001610
               FEIL_FUNNET    = '1'B;                                   00001620
               UFS.UFT_MÅNR   = 294;                                    00001630
             END;                                                       00001640
         END;                                                           00001650
                                                                        00001660
    IF UFS.UFT_MÅNR = 0   THEN                                          00001670
         DO;                                                            00001680
           ALDER                = F_ALDER(UFS.FNR,HJ_UFT_MÅ);           00001690
                                                                        00001700
           IF ALDER        > 2600    THEN  /*FYLLER IKKE VILKÅRET:   */ 00001710
             DO;                           /*MÅ HA TAPT MINST 50% AV */ 00001720
                FEIL_FUNNET     = '1'B;    /*ERVERVSEVNEN FØR FYLTE  */ 00001730
                UFS.UFT_MÅNR    = 292;     /* 22 ÅR.                 */ 00001740
             END;                          /* ENDRET TIL 24 0592   */   00001750
                                           /* ENDRET TIL 26 0797   */   00001760
         END;                                                           00001770
                                                                        00001780
   END KONTROLL_UF_SØKER;                                               00001790
                                                                        00001800
