 /*       SIST ENDRET 28/07-94 13.10.51 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 03/03-94 13.14.37 AV   HERMAN                   */00000010
 /*       SIST ENDRET 25/02-94 12.22.06 AV   HERMAN                   */00000020
 /*       SIST ENDRET 06/01-93 12.28.56 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 03/01-92 13.52.18 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 02/01-92 11.03.17 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 13/12-91 12.18.59 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 10/10-91 13.57.05 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 01/08-91 14.15.39 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 26/03-91 13.11.30 AV   HERMAN                   */00000090
 /*       SIST ENDRET 11/12-90 13.20.36 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 16/05-88 12.26.23 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 11/11-86 11.27.41 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 28/06-84 08.33.15 AV   OLAV                     */00000130
 /*       SIST ENDRET 12/06-84 12.58.12 AV   FARVIK                   */00000140
 /*       SIST ENDRET 30/05-84 11.20.14 AV   FARVIK                   */00000150
 /*       SIST ENDRET 11/11-83 10.07.29 AV   KARIN                    */00000160
 /* ***************************************************************** */00000170
 %SKIP;                                /*  */                           00000180
 /* ***************************************************************** */00000190
 /*                                                                   */00000200
 /* ***************************************************************** */00000210
 /*IDENTIFIKASJON:                                                    */00000220
 /* **********************                                            */00000230
 /*  PROGRAM-IDENT : R0010503  KONTROLL_AP_SØKER   SUBPROGRAM         */00000240
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000250
 /*  PROGRAMMERER  : INGER SLOTTE                                     */00000260
 /*  PROGRAMMET BLE LAGET : MARS 1981                                 */00000270
 /*  ENDRINGERSDATO :                                                 */00000280
 /*  ENDRINGEN GJELDER:                                               */00000290
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000300
 /*                                                                   */00000310
 /* ***************************************************************** */00000320
 /*HENSIKT:                                                           */00000330
 /* **********                                                        */00000340
 /*  FORETAR KONTROLL AV GRUNNBLANKETT AP - SØKERDELEN.               */00000350
 /*  RETURNERER FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RETT          */00000360
 /*                                                                   */00000370
 /* ***************************************************************** */00000380
 /*PROGRAMTILKNYTTING:                                                */00000390
 /* ********************                                              */00000400
 /*  PROGRAMMET INCLUDES AV R0010501 - KONTROLL_GRUNNBLANKETT_AP      */00000410
 /*  ARBEIDSOMRÅDET P0010501 ER INCLUDET I HOVEDPROG                  */00000420
 /*  BRUK :                                                           */00000430
 /*  CALL KONTROLL_AP_SØKER(FEIL_I_AP_SØKER);                         */00000440
 /*  EXEC CICS LINK TIL R0019906 - ER FNR ENDRET ?                    */00000450
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN ER INCLUDET I HOVEDPROG :    */00000460
 /*          R0019901 - F_GYLDIG_DATO                                 */00000470
 /*          R0019902 - F_KJØNN                                       */00000480
 /*          R0019903 - F_EK_ALDER                                    */00000490
 /*          R0019904 - F_GYLDIG_FNR                                  */00000500
 /*          R0019905 - F_ALDER                                       */00000510
 /*          R0019907 - F_TABSØKC_FUNNET                              */00000520
 /*          R0019910 - F_NUMERISK                                    */00000530
 /*          R0019912 - F_FELT_PIC_CHAR11                             */00000540
 /*          R0019959 - F_2MDR                                        */00000550
 /*          VERIFY   - BUILTIN-FUNCTION                              */00000560
 /* ***************************************************************** */00000570
 /*DATASETTOPPLYSNINGER:                                              */00000580
 /* ***********************                                           */00000590
 /*   FØDSELSNR-ENDRINGSREG. LESES VED EXEC LINK TIL R0019906.        */00000600
 /*                                                                   */00000610
 /* ***************************************************************** */00000620
 /*FEILMELDINGER:                                                     */00000630
 /* *******************                                               */00000640
 /*   MELDINGSNR LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM            */00000650
 /*   FEIL_FUNNET SETTES = '1'B.                                      */00000660
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDING PÅ SKJERMBILDET      */00000670
 /*                                                                   */00000680
 /* ***************************************************************** */00000690
 /*ENDRET: 06.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000700
 /* ******                                                            */00000710
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000720
 /*    OM FNR ER ENDRET (R0019906).                                   */00000730
 /* ***************************************************************** */00000740
 %PAGE;                                /*   */                          00000750
 %SKIP(2);                                                              00000760
 KONTROLL_AP_SØKER:                                                     00000770
   PROC (FEIL_FUNNET) ;                                                 00000780
   DCL                                                                  00000790
      FEIL_FUNNET                               BIT (1);                00000800
   DCL                                                                  00000810
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00000820
      KEY_PEKER                  POINTER,                               00000830
      TK_RECL                    CHAR (101);                            00000840
 %SKIP;                                                                 00000850
   DCL                                                                  00000860
      1 FNR_REG,                                                        00000870
        2 FNR1                                  FIXED DEC(11),          00000880
        2 FNR2                                  FIXED DEC(11),          00000890
        2 BRUKERID                              CHAR     ( 4),          00000900
                                                                        00000910
      ALDER                                     FIXED DEC (5);          00000920
 %SKIP;                                                                 00000930
   DCL                                                                  00000940
      W_FNR                                     PIC'(11)9';             00000950
   DCL                                                                  00000960
      1 FNR DEF W_FNR,                                                  00000970
        2 DAG                                   PIC'(2)9',              00000980
        2 MND                                   PIC'(2)9',              00000990
        2 AAR                                   PIC'(2)9',              00001000
        2 ÅRHUNDRE                              PIC'9',                 00001010
        2 REST                                  PIC'(4)9';              00001020
                                                                        00001030
   DCL W_FNR_ÅM                                 PIC'(4)9';     /*NY92*/ 00001040
 %PAGE;                                /*   */                          00001050
 /*  HJELPE DCL FOR Å SNU DATO           */                             00001060
 %SKIP(1);                                                              00001070
   DCL                                                                  00001080
      HJ_VIRK_DATO_ÅM                           PIC '9999',             00001090
      VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅM POS(1)    PIC '99',               00001100
      VIRK_DATO_M DEF HJ_VIRK_DATO_ÅM POS(3)    PIC '99';               00001110
 %SKIP;                                                                 00001120
   DCL                                                                  00001130
      HJ_VIRK_DATO_MÅ                           PIC '9999',             00001140
      HJ_VIRK_DATO_M DEF HJ_VIRK_DATO_MÅ POS(1) PIC '99',               00001150
      HJ_VIRK_DATO_Å DEF HJ_VIRK_DATO_MÅ POS(3) PIC '99';               00001160
 %SKIP;                                                                 00001170
   DCL                                                                  00001180
      TT_FRAM_TIL                               PIC'99';                00001190
 %SKIP;                                                                 00001200
   W_FNR     = APS.FNR;                                                 00001210
   W_FNR_ÅM  = FNR.AAR!!FNR.MND;                              /*NY92*/  00001220
                                                                        00001230
   KEY_PEKER = ADDR(APS.TKNR);                                          00001240
 %PAGE;                                                                 00001250
   HJ_VIRK_DATO_MÅ = APS.VIRK_DATO_MÅ;                                  00001260
   VIRK_DATO_Å     = HJ_VIRK_DATO_Å;                                    00001270
   VIRK_DATO_M     = HJ_VIRK_DATO_M;                                    00001280
                                                                        00001290
   IF HJ_VIRK_DATO_ÅM < 9308 & (APS.SIVILSTAND = 'P') THEN              00001300
      DO;                                                               00001310
         FEIL_FUNNET = '1'B;                                            00001320
         APS.SIVILSTANDNR = 388;                                        00001330
      END;                                                              00001340
   IF HJ_VIRK_DATO_ÅM < 9401 & (APS.SIVILSTAND = 'W') THEN              00001350
      DO;                                                               00001360
         FEIL_FUNNET = '1'B;                                            00001370
         APS.SIVILSTANDNR = 389;                                        00001380
      END;                                                              00001390
 /*MIDLERTIDIG STOPP AV ALLE FORSØRGINGSTILLEGG - HL 26.3.91 */         00001400
                                                                        00001410
 /*IF HJ_VIRK_DATO_ÅM > 9104 & (APS.BT_ANT > 0)     THEN                00001420
      DO;                                                               00001430
         FEIL_FUNNET = '1'B;                                            00001440
         APS.BT_ANTNR  = 999;                                           00001450
      END;                                                              00001460
   IF HJ_VIRK_DATO_ÅM > 9104 & (APS.TILL_EK = 'J')   THEN               00001470
      DO;                                                               00001480
         FEIL_FUNNET = '1'B;                                            00001490
         APS.TILL_EKNR = 999;                                           00001500
      END;           */                                                 00001510
                                                                        00001520
                                                                        00001530
                                                                        00001540
 /*HIT 26.3.91 HL */                                                    00001550
                                                                        00001560
  /*  **********  ENDERING    FOR LOV92                                 00001570
                                                                        00001580
   IF HJ_VIRK_DATO_ÅM > 9112  THEN                                      00001590
      DO;                                                               00001600
         FEIL_FUNNET = '1'B;                                            00001610
         APS.VIRK_DATO_MÅNR = 299;                                      00001620
      END;                                                              00001630
    **TESTEN VAR IKKE FJERNET!!!  TRUDE, 0192   ****************** */   00001640
    IF ^F_NUMERISK(F_FELT_PIC_CHAR11(APS.FNR)) THEN                     00001650
       DO;                                                              00001660
          FEIL_FUNNET = '1'B;                                           00001670
          APS.FNRNR   = 200;                                            00001680
       END;                                                             00001690
    ELSE                                                                00001700
       IF ^F_GYLDIG_FNR(APS.FNR) THEN                                   00001710
          DO;                                                           00001720
             FEIL_FUNNET = '1'B;                                        00001730
             APS.FNRNR   = 1;                                           00001740
          END;                                                          00001750
       ELSE                                                             00001760
          DO;                                                           00001770
             FNR_REG.BRUKERID =   DIV_PARAM_OMR.CICS_IND;               00001780
             FNR_REG.FNR1     =   APS.FNR;                              00001790
                                                                        00001800
             EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);      00001810
                                                                        00001820
             IF FNR_REG.FNR2 > 0 THEN                                   00001830
                DO;                                                     00001840
                   APS.FNRNR   = 203;                                   00001850
                   APS.FNR_GML = APS.FNR;                               00001860
                   APS.FNR     = FNR_REG.FNR2;                          00001870
                END;                                                    00001880
          END;                                                          00001890
                                                                        00001900
    IF ^F_NUMERISK(F_FELT_PIC_CHAR4(APS.TKNR)) THEN                     00001910
       DO;                                                              00001920
          FEIL_FUNNET = '1'B;                                           00001930
          APS.TKNRNR  = 200;                                            00001940
       END;                                                             00001950
    ELSE                                                                00001960
       DO;                                                              00001970
            EXEC CICS HANDLE CONDITION NOTFND(NOTFND);                  00001980
            EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)          00001990
                                               INTO(TK_RECL);           00002000
            GOTO TKNR_UT;                                               00002010
        NOTFND:                                                         00002020
            FEIL_FUNNET = '1'B;                                         00002030
            APS.TKNRNR  = 3;                                            00002040
            LEAVE;                                                      00002050
        TKNR_UT:                                                        00002060
       /*     DIV_TKNR = APS.TKNR; */                                   00002070
              DIV_PARAM_OMR.DIV_TKNR = SUBSTR(TK_RECL,1,4);             00002080
       END;                                                             00002090
      IF APS.NAVN       = (25)' ' THEN                                  00002100
         DO;                                                            00002110
            FEIL_FUNNET = '1'B;                                         00002120
            APS.NAVNNR  = 2;                                            00002130
         END;                                                           00002140
      IF VERIFY(APS.SPRÅK,'NB ') ^= 0 THEN                              00002150
         DO;                                                            00002160
            FEIL_FUNNET = '1'B;                                         00002170
            APS.SPRÅKNR = 6;                                            00002180
         END;                                                           00002190
      IF VERIFY(APS.SIVILSTAND,'GASUEPW') ^= 0 THEN                     00002200
         DO;                                                            00002210
            FEIL_FUNNET      = '1'B;                                    00002220
            APS.SIVILSTANDNR = 5;                                       00002230
         END;                                                           00002240
      IF ^(APS.TILL_EK = 'J' ! APS.TILL_EK = ' ') THEN                  00002250
         DO;                                                            00002260
            FEIL_FUNNET   ='1'B;                                        00002270
            APS.TILL_EKNR = 4;                                          00002280
         END;                                                           00002290
      IF APS.NORSK_BOSATT = 'J' THEN                                    00002300
         DO;                                                            00002310
            IF FNR.ÅRHUNDRE < 5       THEN                              00002320
               DO;                                                      00002330
                  APSP.TT_F67  = 67 - (FNR.AAR + 16);                   00002340
                  TT_FRAM_TIL  = AAR + 67;                              00002350
                  IF FNR.AAR < 4       THEN                             00002360
                     TT_FRAM_TIL  = TT_FRAM_TIL + 3;                    00002370
                  ELSE                                                  00002380
                     IF FNR.AAR = 4       THEN                          00002390
                        TT_FRAM_TIL  = TT_FRAM_TIL + 2;                 00002400
                     ELSE                                               00002410
                        IF FNR.AAR = 5       THEN                       00002420
                           TT_FRAM_TIL  = TT_FRAM_TIL + 1;              00002430
               END;                                                     00002440
            ELSE                                                        00002450
               DO;                                                      00002460
                  APSP.TT_F67  = 67 - (FNR.AAR + 16 - 100);             00002470
                  TT_FRAM_TIL  = FNR.AAR + 70 - 100;                    00002480
               END;                                                     00002490
            IF TT_FRAM_TIL < 67 THEN                                    00002500
               DO;                                                      00002510
                  APSP.TT_E66_Å = 0;                                    00002520
                  APSP.TT_E66_M = 0;                                    00002530
               END;                                                     00002540
            ELSE                                                        00002550
               DO;                                                      00002560
                  APSP.TT_E66_Å = TT_FRAM_TIL - 67;                     00002570
                  APSP.TT_E66_M = FNR.MND;                              00002580
               END;                                                     00002590
         END;                                                           00002600
      ELSE                                                              00002610
         IF APS.NORSK_BOSATT ^= 'N' THEN                                00002620
            DO;                                                         00002630
               FEIL_FUNNET        = '1'B;                               00002640
               APS.NORSK_BOSATTNR = 8;                                  00002650
            END;                                                        00002660
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR2(APS.BT_ANT)) THEN                00002670
         DO;                                                            00002680
            FEIL_FUNNET  = '1'B;                                        00002690
            APS.BT_ANTNR = 200;                                         00002700
         END;                                                           00002710
      ELSE                                                              00002720
      IF APS.BT_ANT > 12 THEN                                           00002730
         DO;                                                            00002740
            FEIL_FUNNET  = '1'B;                                        00002750
            APS.BT_ANTNR = 7;                                           00002760
         END;                                                           00002770
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(APS.FAI)) THEN                   00002780
         DO;                                                            00002790
            FEIL_FUNNET = '1'B;                                         00002800
            APS.FAINR   = 200;                                          00002810
         END;                                                           00002820
      IF ^F_NUMERISK(F_FELT_PIC_CHAR3(APS.APD)) THEN                    00002830
         DO;                                                            00002840
            FEIL_FUNNET = '1'B;                                         00002850
            APS.APDNR   = 200;                                          00002860
         END;                                                           00002870
      ELSE                                                              00002880
         IF ^(APS.APD = 0 ! APS.APD = 25 ! APS.APD = 50 !               00002890
                                   APS.APD = 999 ! APS.APD = 75) THEN   00002900
            DO;                                                         00002910
               FEIL_FUNNET = '1'B;                                      00002920
               APS.APDNR   = 12;                                        00002930
            END;                                                        00002940
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(APS.VIRK_DATO_MÅ)) THEN          00002950
         DO;                                                            00002960
            FEIL_FUNNET        = '1'B;                                  00002970
            APS.VIRK_DATO_MÅNR = 200;                                   00002980
         END;                                                           00002990
      ELSE                                                              00003000
         DO;                                                            00003010
            IF ^F_GYLDIG_DATO(APS.VIRK_DATO_MÅ) THEN                    00003020
               DO;                                                      00003030
                  FEIL_FUNNET        = '1'B;                            00003040
                  APS.VIRK_DATO_MÅNR = 9;                               00003050
               END;                                                     00003060
            ELSE                                                        00003070
               IF HJ_VIRK_DATO_ÅM < 6701 THEN                           00003080
                  DO;                                                   00003090
                     FEIL_FUNNET        = '1'B;                         00003100
                     APS.VIRK_DATO_MÅNR = 9;                            00003110
                  END;                                                  00003120
         END;                                                           00003130
      IF F_FELT_PIC_CHAR11(APS.FNR_EK) ^= (11)'0' THEN                  00003140
         DO;                                                            00003150
            IF ^F_NUMERISK(F_FELT_PIC_CHAR11(APS.FNR_EK)) THEN          00003160
               DO;                                                      00003170
                  FEIL_FUNNET  = '1'B;                                  00003180
                  APS.FNR_EKNR = 200;                                   00003190
               END;                                                     00003200
            ELSE                                                        00003210
               IF ^F_GYLDIG_FNR(APS.FNR_EK) THEN                        00003220
                  DO;                                                   00003230
                     FEIL_FUNNET  = '1'B;                               00003240
                     APS.FNR_EKNR = 1;                                  00003250
                  END;                                                  00003260
               ELSE                                                     00003270
                  DO;                                                   00003280
                     FNR_REG.FNR1     = APS.FNR_EK;                     00003290
                                                                        00003300
                     EXEC CICS LINK PROGRAM('R0019906')                 00003310
                                                      COMMAREA(FNR_REG);00003320
                     IF FNR_REG.FNR2 > 0 THEN                           00003330
                        DO;                                             00003340
                           APS.FNR_EKNR   = 203;                        00003350
                           APS.FNR_GML_EK = APS.FNR_EK;                 00003360
                           APS.FNR_EK     = FNR_REG.FNR2;               00003370
                        END;                                            00003380
                  END;                                                  00003390
            IF APS.EK_INNT = 'J' THEN                                   00003400
               DO;                                                      00003410
                  IF F_SNU_DATO(APS.VIRK_DATO_MÅ) < 8407 THEN           00003420
                     DO;                                                00003430
                        FEIL_FUNNET = '1'B;                             00003440
                        APS.VIRK_DATO_MÅNR = 273;                       00003450
                     END;                                               00003460
                  ELSE                                                  00003470
                     IF  APS.SIVILSTAND ^= 'G' THEN                     00003480
                         DO;                                            00003490
                            FEIL_FUNNET = '1'B;                         00003500
                            APS.SIVILSTANDNR = 274;                     00003510
                         END;                                           00003520
               END;                                                     00003530
            ELSE                                                        00003540
               IF APS.EK_INNT  ^= 'N' THEN                              00003550
                  IF F_SNU_DATO(APS.VIRK_DATO_MÅ) < 9105 THEN           00003560
                  DO;                                                   00003570
                     FEIL_FUNNET = '1'B;                                00003580
                     APS.EK_INNTNR = 272;                               00003590
                  END;                                                  00003600
         END;                                                           00003610
 /* HER SETTES VERDIER INN I   M E N Y - O M R                        */00003620
      FØDSNUMMER    = APS.FNR;                                          00003630
      VIRKNINGSDATO = APS.VIRK_DATO_MÅ;                                 00003640
 %SKIP(3);                             /*  */                           00003650
 /*   K R Y S S - K O N T R O L L E R                               */  00003660
 %SKIP;                                                                 00003670
      IF ^FEIL_FUNNET THEN                                              00003680
         DO;                                                            00003690
            ALDER           = F_ALDER(APS.FNR,APS.VIRK_DATO_MÅ);        00003700
            IF APS.FNR_EK > 0 THEN                                      00003710
               DO;                                                      00003720
                  IF F_KJØNN(APS.FNR) = F_KJØNN(APS.FNR_EK) &           00003730
                     APS.SIVILSTAND ^= 'P' THEN                         00003740
                     DO;                                                00003750
                        FEIL_FUNNET  = '1'B;                            00003760
                        APS.FNRNR    = 999;                             00003770
                        APS.FNR_EKNR = 16;                              00003780
                     END;                                               00003790
                  IF F_KJØNN(APS.FNR) ^= F_KJØNN(APS.FNR_EK) &          00003800
                     APS.SIVILSTAND  = 'P' THEN                         00003810
                     DO;                                                00003820
                        FEIL_FUNNET  = '1'B;                            00003830
                        APS.FNRNR    = 999;                             00003840
                        APS.FNR_EKNR = 392;                             00003850
                     END;                                               00003860
               END;                                                     00003870
            IF ALDER < 6700 THEN                                        00003880
               DO;                                                      00003890
                  FEIL_FUNNET        = '1'B;                            00003900
                  APS.FNRNR          = 11;                              00003910
                  APS.VIRK_DATO_MÅNR = 999;                             00003920
               END;                                                     00003930
                                                                        00003940
 /*LOVENDRING FOR DEN SOM FYLLER 67 ETTER 1990 HL : */                  00003950
                                                                        00003960
            ELSE                                                        00003970
            IF FNR.AAR > 23             &                               00003980
               ALDER < 6701 THEN                                        00003990
               DO;                                                      00004000
                  FEIL_FUNNET        = '1'B;                            00004010
                  APS.FNRNR          = 11;                              00004020
                  APS.VIRK_DATO_MÅNR = 999;                             00004030
               END;                                                     00004040
            IF ^F_2MDR(HJ_VIRK_DATO_ÅM)             THEN                00004050
               DO;                                                      00004060
                  FEIL_FUNNET        = '1'B;                            00004070
                  APS.VIRK_DATO_MÅNR = 207;                             00004080
               END;                                                     00004090
            IF (HJ_VIRK_DATO_ÅM > 7212) & (ALDER > 7000) &              00004100
               ((APS.FAI > 0  & APS.FAI < 9999999) !                    00004110
                (APS.APD > 0  & APS.APD < 999)) THEN                    00004120
          /*    (W_FNR_ÅM > 2500 & APS.APD > 0 )   THEN     *NY92*/     00004130
               DO;                                                      00004140
                  FEIL_FUNNET = '1'B;                                   00004150
                  APS.FNRNR   = 62;                                     00004160
                  APS.FAINR   = 999;                                    00004170
                  APS.APDNR   = 999;                                    00004180
               END;                                                     00004190
            ELSE                                                        00004200
               IF ALDER < 7000 & HJ_VIRK_DATO_ÅM < 7300 THEN            00004210
                  DO;                                                   00004220
                     FEIL_FUNNET        = '1'B;                         00004230
                     APS.FNRNR          = 14;                           00004240
                     APS.VIRK_DATO_MÅNR = 999;                          00004250
                  END;                                                  00004260
               ELSE                                                     00004270
                  IF ^((APS.FNR_EK = 0 & APS.NAVN_EK = (25)' ') !       00004280
                        (APS.FNR_EK > 0 & APS.NAVN_EK ^= (25)' ')) THEN 00004290
                     DO;                                                00004300
                        FEIL_FUNNET   = '1'B;                           00004310
                        APS.NAVN_EKNR = 204;                            00004320
                        APS.FNR_EKNR  = 999;                            00004330
                     END;                                               00004340
                  ELSE                                                  00004350
                     IF APS.FNR_EK > 0  & (APS.SIVILSTAND = 'S' !       00004360
                       APS.SIVILSTAND = 'U' ! APS.SIVILSTAND = 'E') THEN00004370
                        DO;                                             00004380
                           FEIL_FUNNET      = '1'B;                     00004390
                           APS.SIVILSTANDNR = 123;                      00004400
                           APS.FNR_EKNR     = 999;                      00004410
                           APS.NAVN_EKNR    = 999;                      00004420
                        END;                                            00004430
            IF APS.TILL_EK = 'J' THEN                                   00004440
               DO;                                                      00004450
                  IF APS.NAVN_EK = (25)' ' THEN                         00004460
                     DO;                                                00004470
                        FEIL_FUNNET   = '1'B;                           00004480
                        APS.NAVN_EKNR = 19;                             00004490
                        APS.TILL_EKNR = 999;                            00004500
                     END;                                               00004510
                  ELSE                                                  00004520
                     IF APS.FNR_EK = 0 THEN                             00004530
                        DO;                                             00004540
                           FEIL_FUNNET   = '1'B;                        00004550
                           APS.FNR_EKNR  = 15;                          00004560
                           APS.TILL_EKNR = 999;                         00004570
                        END;                                            00004580
                     ELSE                                               00004590
                      IF ^F_EK_ALDER_GYLDIG(APS.FNR_EK,APS.VIRK_DATO_MÅ)00004600
                                                                    THEN00004610
                         DO;                                            00004620
                            FEIL_FUNNET        = '1'B;                  00004630
                            APS.FNR_EKNR       = 17;                    00004640
                            APS.VIRK_DATO_MÅNR = 999;                   00004650
                            APS.TILL_EKNR      = 999;                   00004660
                         END;                                           00004670
                      ELSE                                              00004680
                       IF ^(APS.SIVILSTAND = 'G' ! APS.SIVILSTAND = 'A')00004690
                                                                    THEN00004700
                          DO;                                           00004710
                             FEIL_FUNNET      = '1'B;                   00004720
                             APS.SIVILSTANDNR = 54;                     00004730
                             APS.TILL_EKNR    = 999;                    00004740
                          END;                                          00004750
               END;                                                     00004760
            ELSE                                                        00004770
               DO;                                                      00004780
               IF (APS.FNR_EK ^> 0 ! APS.NAVN_EK = (25)' ') &           00004790
               (APS.SIVILSTAND = 'G' ! APS.SIVILSTAND = 'A') THEN       00004800
                  DO;                                                   00004810
                     FEIL_FUNNET      = '1'B;                           00004820
                     APS.FNR_EKNR     = 18;                             00004830
                     APS.NAVN_EKNR    = 999;                            00004840
                     APS.SIVILSTANDNR = 999;                            00004850
                  END;                                                  00004860
               IF (APS.FNR_EK ^> 0 ! APS.NAVN_EK = (25)' ') &           00004870
               (APS.SIVILSTAND = 'W') THEN                              00004880
                  DO;                                                   00004890
                     FEIL_FUNNET      = '1'B;                           00004900
                     APS.FNR_EKNR     = 390;                            00004910
                     APS.NAVN_EKNR    = 999;                            00004920
                     APS.SIVILSTANDNR = 999;                            00004930
                  END;                                                  00004940
               IF (APS.FNR_EK ^> 0 ! APS.NAVN_EK = (25)' ') &           00004950
               (APS.SIVILSTAND = 'P') THEN                              00004960
                  DO;                                                   00004970
                     FEIL_FUNNET      = '1'B;                           00004980
                     APS.FNR_EKNR     = 391;                            00004990
                     APS.NAVN_EKNR    = 999;                            00005000
                     APS.SIVILSTANDNR = 999;                            00005010
                  END;                                                  00005020
               END;                                                     00005030
         END;                                                           00005040
   END KONTROLL_AP_SØKER;                                               00005050
