 /*       SIST ENDRET 25/02-97 11.53.23 AV   JDA7339                  */00000000
 /*       SIST ENDRET 06/02-96 13.21.12 AV   JDA0310                  */00000010
 /*       SIST ENDRET 10/01-96 10.59.04 AV   TSB0310                  */00000020
 /*       SIST ENDRET 13/06-95 10.54.26 AV   TSB0310                  */00000030
 /*       SIST ENDRET 29/09-94 14.14.15 AV   JDA0310                  */00000040
 /*       SIST ENDRET 19/09-94 12.47.53 AV   DYBVIK                   */00000050
                                                                        00000060
 /* ***************************************************************** */00000070
 /*IDENTIFIKASJON:                                                    */00000080
 /* **********************                                            */00000090
 /*  PROGRAM-IDENT : R00104E3  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000100
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000110
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000120
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000130
 /*                                                                   */00000140
 /* ***************************************************************** */00000150
 /*HENSIKT:                                                           */00000160
 /* **********                                                        */00000170
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000180
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000190
 /*    FORHÅND.                                                       */00000200
 /*    MAPS HØRER INN UNDER MAPSET 'S001F2'.                         */ 00000210
 /*                                                                   */00000220
 /* ***************************************************************** */00000230
 /*PROGRAMTILKNYTTING:                                                */00000240
 /* ********************                                              */00000250
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000260
 /*                                                                   */00000270
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000280
 /*    BRUK :                                                         */00000290
 /*    EXEC CICS XCTL PROGRAM ('R00104E3') COMMAREA(KOM_OMR);         */00000300
 /*    PROGRAMMET INCLUDER :                                          */00000310
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    E3       */00000320
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       E3       */00000330
 /* ***************************************************************** */00000340
 /*DATASETTOPPLYSNINGER:                                              */00000350
 /* ***********************                                           */00000360
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000370
 /*                                                                   */00000380
 /* ***************************************************************** */00000390
 /*FEILMELDINGER:                                                     */00000400
 /* *******************                                               */00000410
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000420
 /*                                                                   */00000430
 /* ***************************************************************** */00000440
                                                                        00000450
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000460
                                                                        00000470
          %INCLUDE P0019906;                                            00000480
          %INCLUDE P0019908;                                            00000490
          %INCLUDE P0019910;                                            00000500
          %INCLUDE P0019912;                                            00000510
          %INCLUDE P0019913;                                            00000520
                                                                        00000530
 DCL                                                                    00000540
      (CSTG, ADDR)                   BUILTIN;                           00000550
 DCL  COMMAREA_PEKER         PTR,                                       00000560
      LOKAL_KOM_PTR          PTR;                                       00000570
                                                                        00000580
                                                                        00000590
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000600
 DCL                                                                    00000610
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000620
    DFHBMUNP             CHAR(1) INIT(' '),                             00000630
    DFHBMBRY             CHAR(1) INIT('H'),                             00000640
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000650
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000660
    MELDING6O            CHAR(10),                                      00000670
    YMELDING6O           CHAR(10);                                      00000680
                                                                        00000690
          %INCLUDE S001F2  ;                                            00000700
          %INCLUDE P001N801;                                            00000710
                                                                        00000720
                                                                        00000730
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000740
                                                                        00000750
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000760
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000770
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000780
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000790
                                                                        00000800
                                                                        00000810
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000820
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000830
                                                                        00000840
           IF ^W01_YSKADE THEN                                          00000850
              DO;                                                       00000860
                 CALL OVERFØR_E3SØKER_MAP;             /* R001N806 */   00000870
                 IF E3S.NORSK_BOSATT = 'N' THEN                         00000880
                    DO;                                                 00000890
                       CALL TEKST_SPES_SØKER;          /* R001N807 */   00000900
                       CALL OVERFØR_E3SPES_SØKER_MAP;  /* R001N806 */   00000910
                    END;                                                00000920
                 IF E3S.NORSK_BOSATT_EK = 'N' THEN                      00000930
                    DO;                                                 00000940
                       CALL TEKST_SPES_AVDØDE;         /* R001N807 */   00000950
                       CALL OVERFØR_E3SPES_AVDØDE_MAP; /* R001N806 */   00000960
                    END;                                                00000970
                                                                        00000980
                 IF E3S.YSKADE_TILLEGG  = 'J' THEN                      00000990
                    DO;                                                 00001000
                       W01_YSKADE = '1'B;                               00001010
                       W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1;           00001020
                    END;                                                00001030
                                                                        00001040
                                                                        00001050
                 S001N81O.DUMMYA = 'Ø';           /* PROT,DARK  */      00001060
                 W01_MAP  = 'S001N81';                                  00001070
              END;                                                      00001080
           ELSE                                                         00001090
              DO;                                                       00001100
                                                                        00001110
                 CALL OVERFØR_E3Y_MAP;            /* R001N806 */        00001120
                                                                        00001130
                 W01_YSKADE     = '0'B;                                 00001140
                                                                        00001150
                 S001201O.DUMMYA = 'Ø';           /* PROT,DARK */       00001160
                 W01_MAP  = 'S001201';                                  00001170
                                                                        00001180
                                                                        00001190
              END;                                                      00001200
                                                                        00001210
                                                                        00001220
                                                                        00001230
      EXEC CICS RETURN;                                                 00001240
                                                                        00001250
                                                                        00001260
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00001270
      PROC(FIXED_DEC_5);                                                00001280
                                                                        00001290
      DCL                                                               00001300
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00001310
                                                                        00001320
   END SKRIV_FEIL;                                                      00001330
                                                                        00001340
        SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001350
                                                                        00001360
           DCL                                                          00001370
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001380
                                                                        00001390
        END SKRIV_FEIL_YP;                                              00001400
                                                                        00001410
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001420
                                                                        00001430
           DCL                                                          00001440
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001450
                                                                        00001460
        END SKRIV_FEIL_SP;                                              00001470
                                                                        00001480
          %INCLUDE R0019912;                                            00001490
          %INCLUDE R001N806;                                            00001500
          %INCLUDE R001N807;                                            00001510
                                                                        00001520
 END R001041;                                                           00001530
                                                                        00001540
