 /*       SIST ENDRET 20/10-89 13.55.34 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 16/10-89 12.42.17 AV   DYBVIK                   */00000010
 /*********************************************************************/00000020
 /*IDENTIFIKASJON :                                                   */00000030
 /****************                                                    */00000040
 /* PROGRAM-IDENT   : R0011836  OVERFØR_SØKER_TIL_MAP SUBPROGRAM      */00000050
 /* PROGRAMMERER    : TRUDE SPONBERG                                  */00000060
 /* PROGRAMMET BLE LAGET : OKTOBER 1989                               */00000070
 /* ENDRINGSDATO    :                                                 */00000080
 /* ENDRINGEN GJELDER    :                                            */00000090
 /* ENDRING UTFØRT AV    :                                            */00000100
 /*                                                                   */00000110
 /*********************************************************************/00000120
 /*HENSIKT:                                                           */00000130
 /*********                                                           */00000140
 /* OVERFØRER DATA FRA UP_TRANS_OMR TIL SKJERMBILDET.                 */00000150
 /* BRUKER MAP S001831 MAPSET S00183.                                 */00000160
 /*                                                                   */00000170
 /*********************************************************************/00000180
 /*PROGRAMTILKNYTNING:                                                */00000190
 /********************                                                */00000200
 /* PROGRAMMET INCLUDES AV R0010470  OG R0010412                      */00000210
 /*                                                                   */00000220
 /*********************************************************************/00000230
 /*                                                                   */00000240
                                                                        00000250
                                                                        00000260
                                                                        00000270
  OVERFØR_SØKER_TIL_MAP: PROC;                                          00000280
                                                                        00000290
   DCL NORMAL    CHAR (1)  INIT(' ');                                   00000300
                                                                        00000310
     S001831O.REGDATOO        =  F_FELT_PIC_CHAR6(UFS.REGDATO);         00000320
     S001831O.TERMIDO         =  UFS.TERMID;                            00000330
     S001831O.FNRO            =  F_FELT_PIC_CHAR11(UFS.FNR);            00000340
     S001831O.UFMÅO           =  F_FELT_PIC_CHAR4(UFS.UFT_MÅ);          00000350
                                                                        00000360
     /* FEILMELDINGER MARKERING AV FELT(ATTRIBUTTENE)  */               00000370
     S001831O.DUMMYA           = '_';                                   00000380
                                                                        00000390
     S001831O.REGDATOA         = NORMAL  ;                              00000400
     S001831O.TERMIDA          = NORMAL  ;                              00000410
     S001831O.FUNKSJONSKODEA   = NORMAL  ;                              00000420
     S001831O.STYRE_KODEA      = NORMAL  ;                              00000430
                                                                        00000440
     S001831O.FNRA             = DFHBMASK;                              00000450
     S001831O.UFMÅA            = DFHBMASK;                              00000460
     S001831O.FUNKSJONSKODEA   = DFHBMASK;                              00000470
     S001831O.STYRE_KODEA      = DFHBMASK;                              00000480
     S001831O.REGDATOA         = DFHBMASK;                              00000490
     S001831O.TERMIDA          = DFHBMASK;                              00000500
                                                                        00000510
  END OVERFØR_SØKER_TIL_MAP;                                            00000520
