 /*       SIST ENDRET 22/07-98 14.07.54 AV   JDA7339                  */00000000
 /*       SIST ENDRET 22/07-98 14.01.28 AV   MHA7339                  */00000010
 /*       SIST ENDRET 22/07-97 10.32.00 AV   JDA7339                  */00000020
 /*       SIST ENDRET 21/04-97 11.29.32 AV   JDA7339                  */00000030
 /*       SIST ENDRET 17/04-96 11.27.55 AV   JDA0310                  */00000040
 /*       SIST ENDRET 15/04-96 11.48.28 AV   JDA0310                  */00000050
 /*       SIST ENDRET 20/03-96 13.06.55 AV   JDA0310                  */00000060
 /*       SIST ENDRET 24/01-96 14.09.31 AV   JDA0310                  */00000070
 /*       SIST ENDRET 24/01-96 13.15.04 AV   JDA0310                  */00000080
 /*       SIST ENDRET 12/10-95 14.04.34 AV   JDA0310                  */00000090
 /*       SIST ENDRET 16/11-94 09.38.44 AV   JDA0310                  */00000100
 /*       SIST ENDRET 29/09-94 09.15.59 AV   JDA0310                  */00000110
 /*       SIST ENDRET 26/07-94 14.06.45 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 14/07-94 13.21.22 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 19/12-91 12.38.26 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 14/11-91 14.40.18 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 16/05-88 12.33.46 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 22/12-87 12.43.53 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 01/09-87 08.47.49 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 11/11-86 11.43.36 AV   DYBVIK                   */00000190
                                                                        00000200
                                                                        00000210
 R00102:                                                                00000220
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000230
 %SKIP;                                /*  */                           00000240
 /******************************************************************* */00000250
 /*IDENTIFIKASJON:                                                    */00000260
 /************************                                            */00000270
 /*  PROGRAM-IDENT : R0010201-KONTROLL AV BRUKER-ID-HOVEDPROGRAM      */00000280
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000290
 /*  PROGRAMMERER  :                                                  */00000300
 /*  PROGRAMMET BLE LAGET                                             */00000310
 /*  ENDRINGERSDATO :                                                 */00000320
 /*  ENDRINGEN GJELDER:                                               */00000330
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000340
 /*                                                                   */00000350
 /******************************************************************* */00000360
 /*HENSIKT:                                                           */00000370
 /************                                                        */00000380
 /*  PROGRAMMET ER MED I STYRINGEN AV MENYEN VED OPPSTARTINGEN        */00000390
 /*  AV FOLKETRYGDSYSTEMET. PROGRAMMET AKTIVISERES NÅR OPERATØREN     */00000400
 /*  HAR TASTET INN BRUKER-IDENTEN, MAP S001011 - MAPSET S001013.     */00000410
 /*  PROGRAMMET LESER INN BRUKER-IDENTEN OG KONTROLLERER DEN.         */00000420
 /*  ER DEN OK, SKRIVES NESTE BILDE FOR VALG AV FUNKSJON UT -         */00000430
 /*  MAP S001013 - MAPSET R001013, OG TRANSKODEN SETTES TIL R030.     */00000440
 /*  PROGRAMMET GIR BRUKEREN 3 SJANSER TIL Å REGISTRERE EN AKSEPTABEL */00000450
 /*  BRUKER-ID. VED FORTSATT FEIL, SKRIVES PAUSEBILDE UT OG           */00000460
 /*  OPPSTARTING MÅ SKJE PÅ NYTT (MAPS001012 - MAPSET S001013)        */00000470
 /*                                                                   */00000480
 /******************************************************************* */00000490
 /*PROGRAMTILKNYTTING:                                                */00000500
 /**********************                                              */00000510
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANS-ID = R020.         */00000520
 /*  DENNE TRANSID SETTES I R0010201:                                 */00000530
 /*   EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_NR)            */00000540
 /*  KONTROLLEN GÅR VIDERE VIA CICS TIL R0010301 FOR VALG AV FUNKSJON */00000550
 /*  OG KONTROLL AV FUNKSJONSKODE                                     */00000560
 /*  TRANSAKSJONSKODEN ER R030                                        */00000570
 /*  FUNKSJONER SOM BRUKES:                                           */00000580
 /*  R0019907   : SØKER BINÆRT ETTER ET GITT ELEMENT I EN GITT TABELL */00000590
 /******************************************************************* */00000600
 /*DATASETTOPPLYSNINGER:                                              */00000610
 /*************************                                           */00000620
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000630
 /*                                                                   */00000640
 /******************************************************************* */00000650
 /*FEILMELDINGER:                                                     */00000660
 /*********************                                               */00000670
 /* 'UGYLDIG BRUKERIDENT' SKRIVES PÅ SKJERMBILDE                      */00000680
 /*                                                                   */00000690
 /* ***************************************************************** */00000700
 %PAGE;                                                                 00000710
      %INCLUDE S00101;     /* MENY-MAPSETTET                       */   00000720
 %PAGE;                                                                 00000730
      %INCLUDE P0019908;   /* KOM_OMR (BASED) */                        00000740
 %PAGE;                                                                 00000750
      %INCLUDE P0019906;   /* TRANS_OPPL_OMRÅDE (BASED) */              00000760
 %PAGE;                                                                 00000770
      %INCLUDE P0019910;   /* STYRINGS_OMRÅDE (BASED) */                00000780
 %PAGE;                                                                 00000790
      %INCLUDE P0019912;   /* DIV_PARAM_OMRÅDE(BASED) */                00000800
 %PAGE;                                                                 00000810
      %INCLUDE P0019959;   /* COPYOMRÅDET FOR FUNKTAB */                00000820
 %PAGE;                                                                 00000830
                                                                        00000840
                                                                        00000850
    DCL GRUNN_OMR1                  CHAR (1202),                        00000860
        GRUNN_CICS  DEF GRUNN_OMR1  CHAR (   4) POS  (5),               00000870
        GRUNN_IDENT                 CHAR ( 8  );                        00000880
                                                                        00000890
   DCL                                                                  00000900
      W01_CICSINFO      CHAR(8) ,                                       00000910
  /*  W01_BRUKERID      CHAR(04)    , */                                00000920
      W01_AUTOKODE      CHAR(04)    ;                                   00000930
                                                                        00000940
                                                                        00000950
   DCL 01 W01_BRUKERID_DEF,                                             00000960
         02 W01_BRUKERID_1_4      CHAR(04)    ,                         00000970
         02 W01_BRUKERID_5         CHAR(01)    ,                        00000980
       01 W01_BRUKERID  DEF W01_BRUKERID_DEF  CHAR(5);                  00000990
                                                                        00001000
   DCL                                                                  00001010
      (COMMAREA_PEKER , W01_CWA_PTR , IDENT_PEKER,                      00001020
      BMSMAPBR)                        PTR     ;                        00001030
   DCL                                                                  00001040
      IDENT_BIT          BIT (32) BASED (IDENT_PEKER);                  00001050
   DCL                                                                  00001060
      (                                                                 00001070
       ADDR,                                                            00001080
       CSTG,                                                            00001090
       DATETIME,                                                        00001100
       LOW,                                                             00001110
       STG ,                                                            00001120
       SUBSTR                                                           00001130
      )       BUILTIN ;                                                 00001140
                                                                        00001150
                                                                        00001160
   /* *************************************************************** */00001170
   /* ****************                         ********************** */00001180
   /* **************     EKSEKVERING STARTER      ******************  */00001190
   /* ****************                         ********************** */00001200
   /* *************************************************************** */00001210
                                                                        00001220
      EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                        00001230
                                                                        00001240
      GRUNN_IDENT                     = 'P001CICS';                     00001250
      CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                    00001260
                                                                        00001270
      EXEC CICS RECEIVE MAP ('S001011') MAPSET ('S001013')              00001280
                            SET(BMSMAPBR)                ;              00001290
                                                                        00001300
      STYRINGS_PEKER        = ADDR  (KOM_OMR.STYRINGS_OMR)  ;           00001310
      TRANS_OPPL_PEKER      = ADDR  (KOM_OMR.TRANS_OPPL_OMR);           00001320
      DIV_PARAM_PEKER       = ADDR  (KOM_OMR.DIV_PARAM_OMR) ;           00001330
      KOM_OMR.DIV_PARAM_OMR = ''                            ;           00001340
                                                                        00001350
      EXEC CICS ASSIGN  APPLID (  DIV_PARAM_OMR.CICS_NAVN );            00001360
                                                                        00001370
      W01_CICSINFO    =  DIV_PARAM_OMR.CICS_NAVN;                       00001380
      GRUNN_CICS      =    SUBSTR(DIV_PARAM_OMR.CICS_NAVN,5,4);         00001390
                                                                        00001400
      DIV_PARAM_OMR.DATO_2000 = F_FELT_CHAR_PIC8(SUBSTR(DATETIME,1,8)); 00001410
                                                                        00001420
      W01_BRUKERID_1_4    =  S001011I.BRUKER_IDI;                       00001430
      W01_BRUKERID_5      =  ' ';                                       00001440
      IF S001011I.AUTO_KODEI = 'HELP' THEN                              00001450
              W01_BRUKERID_5      =  'H';                               00001460
                                                                        00001470
      DIV_PARAM_OMR.BRUKER_ID = W01_BRUKERID;                           00001480
      IF W01_BRUKERID_1_4     =  'TEST'  THEN                           00001490
         W01_BRUKERID_1_4     =  'T001' ;                               00001500
      IF W01_BRUKERID_1_4     =  'T001' &                               00001510
         GRUNN_CICS          ^=  'P001' THEN                            00001520
         CALL UNLOCK_FILE; /* STOPPER FRA MIGRERES AV REG  */           00001530
                                                                        00001540
      EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                        00001550
      IDENT_PEKER     = ADDR (W01_BRUKERID);                            00001560
                                                                        00001570
      IF W01_BRUKERID_1_4      ^= 'T001' THEN                           00001580
         DO;                                                            00001590
            EXEC CICS READ DATASET ('FUNKTAD')                          00001600
                INTO (FUNKTAD)                                          00001610
                RIDFLD (IDENT_BIT);                                     00001620
         END;                                                           00001630
                                                                        00001640
                                                                        00001650
                                                                        00001660
      IF W01_BRUKERID_1_4         = 'T001' THEN                         00001670
         BRUKERID                 =  W01_BRUKERID_1_4;                  00001680
      ELSE                                                              00001690
         BRUKERID             =  FUNKTAD.IDENT;                         00001700
         DIV_PARAM_OMR.BRUKER_ID   = FUNKTAD.BRUKER_ID;                 00001710
                                                                        00001720
                                                                        00001730
      W01_AUTOKODE   =    'CICS';                                       00001740
      IF S001011I.AUTO_KODEL > 0        THEN                            00001750
         DO;                                                            00001760
            IF S001011I.AUTO_KODEI = 'AUTO' !                           00001770
               S001011I.AUTO_KODEI = 'HIST' !                           00001780
               S001011I.AUTO_KODEI = 'HELP' THEN                        00001790
               DO;                                                      00001800
                  W01_AUTOKODE   =    S001011I.AUTO_KODEI;              00001810
                  IF GRUNN_CICS                    = 'P001' THEN        00001820
                     DIV_PARAM_OMR.CICS_IND        = 'PA' ;             00001830
                  ELSE                                                  00001840
                  IF GRUNN_CICS                    = 'T001' !           00001850
                     GRUNN_CICS                    = 'TA01' THEN        00001860
                     DIV_PARAM_OMR.CICS_IND        = 'TA' ;             00001870
                  ELSE                                                  00001880
                     DIV_PARAM_OMR.CICS_IND        = 'RA' ;             00001890
               END;                                                     00001900
            ELSE                                                        00001910
               IF S001011I.AUTO_KODEI                   = 'GFNR' THEN   00001920
                  DO;                                                   00001930
                     W01_AUTOKODE   =    S001011I.AUTO_KODEI;           00001940
                     IF GRUNN_CICS                      = 'P001' THEN   00001950
                        DIV_PARAM_OMR.CICS_IND          = 'PG' ;        00001960
                     ELSE                                               00001970
                        IF GRUNN_CICS                   = 'T001' !      00001980
                           GRUNN_CICS                   = 'TA01' THEN   00001990
                           DIV_PARAM_OMR.CICS_IND = 'TG' ;              00002000
                        ELSE                                            00002010
                           DIV_PARAM_OMR.CICS_IND = 'RG' ;              00002020
                  END;                                                  00002030
                  /* NY KODE REG UTEN AT PENSJONSBREVTRANS BLIR LAGET*/ 00002040
               ELSE                                                     00002050
                IF S001011I.AUTO_KODEI                   = 'IKKE' THEN  00002060
                  DO;                                                   00002070
                     W01_AUTOKODE   =    S001011I.AUTO_KODEI;           00002080
                     IF GRUNN_CICS                      = 'P001' THEN   00002090
                        DIV_PARAM_OMR.CICS_IND          = 'PI' ;        00002100
                     ELSE                                               00002110
                        IF GRUNN_CICS                   = 'T001' !      00002120
                           GRUNN_CICS                   = 'TA01' THEN   00002130
                           DIV_PARAM_OMR.CICS_IND = 'TI' ;              00002140
                        ELSE                                            00002150
                           DIV_PARAM_OMR.CICS_IND = 'RI' ;              00002160
                  END;                                                  00002170
                ELSE                                                    00002180
                  DO;                                                   00002190
                     S001011O.MELDINGO = 'UGYLDIG KODE' ;               00002200
                     EXEC CICS SEND MAP('S001011')                      00002210
                                    MAPSET('S001013') ;                 00002220
                     TRANSKODE = 'R020' ;                               00002230
                     EXEC CICS RETURN TRANSID        (TRANSKODE)        00002240
                                       COMMAREA (KOM_OMR        );      00002250
                  END ;                                                 00002260
         END;                                                           00002270
                                                                        00002280
      ELSE                                                              00002290
         DO;                                                            00002300
            IF GRUNN_CICS                   = 'P001' THEN               00002310
               DIV_PARAM_OMR.CICS_IND = 'P ' ;                          00002320
            ELSE                                                        00002330
            IF GRUNN_CICS                   = 'T001' !                  00002340
               GRUNN_CICS                   = 'TA01' THEN               00002350
               DIV_PARAM_OMR.CICS_IND = 'T ' ;                          00002360
            ELSE                                                        00002370
               DIV_PARAM_OMR.CICS_IND = 'R ' ;                          00002380
         END;                                                           00002390
                                                                        00002400
  /*  IF DIV_PARAM_OMR.CICS_IND = 'PA'  !                               00002410
         DIV_PARAM_OMR.CICS_IND = 'TA'  THEN                            00002420
  */                                                                    00002430
           SUBSTR(DIV_PARAM_OMR.CICS_NAVN,1,4)  = W01_AUTOKODE;         00002440
      /*-------------------------------------------------------*/       00002450
      /*   VALG AV DATABASE HISTORIKK -DATABASE ELLER VANLIDG  */       00002460
      /*-------------------------------------------------------*/       00002470
         DIV_PARAM_OMR.PSB_NAVN  = 'B001R001';                          00002480
         IF S001011I.AUTO_KODEI = 'HIST' THEN                           00002490
            DO;                                                         00002500
               DIV_PARAM_OMR.PSB_NAVN  = 'B001H001';                    00002510
               SUBSTR(DIV_PARAM_OMR.CICS_NAVN,1,4)  = 'HIST' ;          00002520
            END;                                                        00002530
        ELSE                                                            00002540
         IF S001011I.AUTO_KODEI = 'HELP' THEN                           00002550
            DO;                                                         00002560
               DIV_PARAM_OMR.PSB_NAVN  = 'B001P001';                    00002570
            END;                                                        00002580
                                                                        00002590
      /*-------------------------------------------------------*/       00002600
      /*   SKRIVER SKJERMBILDE MED SPØRSMÅL OM FUNKSJONSKODE   */       00002610
      /*-------------------------------------------------------*/       00002620
                                                                        00002630
                                                                        00002640
                                                                        00002650
      IF GRUNN_CICS               = 'T001'   !                          00002660
         GRUNN_CICS               = 'TA01'      THEN                    00002670
         DO;                                                            00002680
            ALLOCATE S001013O ;                                         00002690
            S001013O.FUNKSJONSKODEO = LOW(1) ;                          00002700
            S001013O.CICS_INFOO     = DIV_PARAM_OMR.CICS_NAVN ;         00002710
                                                                        00002720
            EXEC CICS SEND MAP('S001013') MAPSET('S001013')             00002730
                                          ERASE ;                       00002740
            TRANSKODE = 'R030';                                         00002750
            EXEC CICS RETURN TRANSID        (TRANSKODE)                 00002760
                             COMMAREA (KOM_OMR        )         ;       00002770
         END         ;                                                  00002780
      ELSE                                                              00002790
         IF GRUNN_CICS               = 'P001'          THEN             00002800
            DO;                                                         00002810
                                                                        00002820
            IF ^(BRUKERID          = 'T001' ) THEN                      00002830
               DO;                                                      00002840
                                                                        00002850
                  ALLOCATE S001013O ;                                   00002860
                  S001013O.FUNKSJONSKODEO = LOW(1) ;                    00002870
                  S001013O.CICS_INFOO     = DIV_PARAM_OMR.CICS_NAVN ;   00002880
                                                                        00002890
                  EXEC CICS SEND MAP('S001013') MAPSET('S001013')       00002900
                                             MAPONLY        ERASE  ;    00002910
                                                                        00002920
                  TRANSKODE = 'R030';                                   00002930
                  EXEC CICS RETURN TRANSID        (TRANSKODE)           00002940
                             COMMAREA (KOM_OMR        )         ;       00002950
              END;                                                      00002960
            END;                                                        00002970
         ELSE                                                           00002980
            DO;                                                         00002990
               EXEC CICS SEND MAP('S001013') MAPSET('S001013')          00003000
                                          MAPONLY        ERASE  ;       00003010
                                                                        00003020
               TRANSKODE = 'R030';                                      00003030
               EXEC CICS RETURN TRANSID        (TRANSKODE)              00003040
                             COMMAREA (KOM_OMR        )         ;       00003050
            END;                                                        00003060
                                                                        00003070
                                                                        00003080
      IF ANT_FORSØK = 2 THEN                                            00003090
         DO;                                                            00003100
            EXEC CICS SEND MAP('S001012') MAPSET('S001013')             00003110
                                                    MAPONLY ERASE;      00003120
            /* SKRIVER PAUSEBILDET */                                   00003130
                                                                        00003140
            EXEC CICS RETURN;                                           00003150
         END;                                                           00003160
      ELSE                                                              00003170
         DO;                                                            00003180
            ANT_FORSØK = ANT_FORSØK + 1;                                00003190
            S001011O.MELDINGO = 'UGYLDIG BRUKERIDENT';                  00003200
            EXEC CICS SEND MAP('S001011') MAPSET('S001013');            00003210
                                                                        00003220
            /* SKRIVER FEILMELDING */                                   00003230
                                                                        00003240
            TRANSKODE = 'R020';                                         00003250
         END;                                                           00003260
                                                                        00003270
                                                                        00003280
      EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);            00003290
                                                                        00003300
                                                                        00003310
                                                                        00003320
 FEILBEH:                                                               00003330
      EXEC CICS SEND MAP('S001012') MAPSET('S001013')                   00003340
                                                    MAPONLY ERASE;      00003350
      /* SKRIVER PAUSEBILDET */                                         00003360
                                                                        00003370
      EXEC CICS RETURN;                                                 00003380
                                                                        00003390
    %INCLUDE R0019907;    /* SØKER BINÆRT ETTER ET GITT ELEMENT   */    00003400
                          /* I EN GITT TABELL                     */    00003410
    %INCLUDE R0019956;    /* P9956_BER_G_CICS                     */    00003420
    %INCLUDE R0019960;    /* F_CICSINFO                           */    00003430
    %INCLUDE R0010202;    /* UNLOCK-FILE                          */    00003440
    %INCLUDE R0019912;    /* CHAR->PIC ! PIC->CHAR                */    00003450
                                                                        00003460
                                                                        00003470
   END R00102;                                                          00003480
