 /*       SIST ENDRET 25/09-96 15.00.53 AV   JDA0310                  */00000000
 /*       SIST ENDRET 18/10-94 15.12.38 AV   JDA0310                  */00000010
 /*       SIST ENDRET 13/12-91 12.34.24 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 04/09-90 12.52.56 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 29/03-88 13.14.34 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 12/01-87 09.18.12 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 11/07-85 14.01.06 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 08/07-85 09.46.53 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 19/06-85 09.35.25 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 23/10-83 13.01.37 AV   OLAV                     */00000090
 /*       SIST ENDRET 20/10-83 12.33.56 AV   OLAV                     */00000100
 /*       SIST ENDRET 14/10-83 01.21.41 AV   OLAV                     */00000110
 /* **************************************************************** */ 00000120
 /* IDENTIFIKASJON:   R0017023                                       */ 00000130
 /* PROGRAMMERER:  HELEN    JULI, 1982                              */  00000140
 /* HENSIKT:                                                         */ 00000150
 /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT     */ 00000160
 /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER         */ 00000170
 /*        HVER AJOURFØRT TRANSAKSJON.                               */ 00000180
 /* PROGRAMTILKNYTNING:                                              */ 00000190
 /*        PROGRAMMET KALLES OPP AV R0017001                         */ 00000200
 /*                                                                  */ 00000210
 /* **************************************************************** */ 00000220
 LAG_BARNEP_BEGGE_HEND:                                                 00000230
      PROC (BA_IND) ;                                                   00000240
  EXEC CICS ADDRESS EIB(DFHEIPTR);                                      00000250
 DCL  BA_IND       FIXED BIN(15);                                       00000260
 DCL  MOR_IND      FIXED BIN(15);                                       00000270
 DCL  FAR_IND      FIXED BIN(15);                                       00000280
 DCL  IND          FIXED BIN(15);                                       00000290
 DCL  Y_BARN_IND   FIXED BIN(15);                                       00000300
                                                                        00000310
 /* **************************************************************** */ 00000320
 /* PROGRAMMET BEGYNNER HER.                                         */ 00000330
 /* VI BLANKER W_HENDELSE OG  FINNER YNGSTE BARN.                    */ 00000340
 /* **************************************************************** */ 00000350
                                                                        00000360
    W_HENDELSE            =  '';                                        00000370
    MOR_IND               = 1;                                          00000380
    FAR_IND               = 2;                                          00000390
    DO IND = 3 TO 14;                                                   00000400
                                                                        00000410
  /*  ENDRET 09.02.88  SATISH                                 */        00000420
  /*   IF B02.PERSON.STATUS.PENSJONSTYPE2(IND) = 'Y' THEN     */        00000430
  /*   HIT TIL 09.02.88                                       */        00000440
                                                                        00000450
       IF B02.PERSON.STATUS.PENSJONSTYPE2(IND) = 'P' &                  00000460
         (B02.PERSON.STATUS.PENSJONSTYPE1(IND) = 'B' !                  00000470
          B02.PERSON.STATUS.PENSJONSTYPE1(IND) = 'N') THEN              00000480
          DO;                                                           00000490
             Y_BARN_IND = IND;                                          00000500
             IND = 14;                                                  00000510
          END;                                                          00000520
    END;                                                                00000530
                                                                        00000540
    OMR_DATO                = F_SNU_DATO(TRANS_OPPL_OMR.VIRKNINGSDATO); 00000550
                                                                        00000560
    IF TRANS_OPPL_OMR.TRANSTYPE = 27 THEN                               00000570
                                                                        00000580
       DO;                                                              00000590
          HENDDATO  =  OMR_DATO;                                        00000600
       END;                                                             00000610
                                                                        00000620
    ELSE                                                                00000630
       DO;                                                              00000640
          IF DIV_PERIODE.INTENDR_ÅM > 0 THEN                            00000650
             HENDDATO     = DIV_PERIODE.INTENDR_ÅM;                     00000660
          ELSE                                                          00000670
             DO;                                                        00000680
                R_HENDDATO_D =  B02.PERSON.STATUS.VIRK_DATO_ÅM(BA_IND); 00000690
                HENDDATO     =  R_HENDDATO.AAR !!R_HENDDATO.MND;        00000700
             END;                                                       00000710
       END;                                                             00000720
    W_HENDELSE.VERSJON    =    W_ROT.NESTE_SB_VERSJON_NR;               00000730
    W_HENDELSE.TERMINAL   =    EIBTRMID;                                00000740
    W_HENDELSE.PENSJONSTYPE1 = B02.STATUS.PENSJONSTYPE1(BA_IND);        00000750
    W_HENDELSE.PENSJONSTYPE2 = B02.STATUS.PENSJONSTYPE2(BA_IND);        00000760
    W_HENDELSE.PENSJONSTYPE3 = B02.STATUS.PENSJONSTYPE3(BA_IND);        00000770
                                                                        00000780
    IF B02.PERSON.STATUS.PENSJONSTYPE3(BA_IND) = 'U'     THEN           00000790
                                                                        00000800
       DO;                                                              00000810
                                                                        00000820
       W_HENDELSE.GP_BRUTTO = B02.PERSON.UFØRPENS.GP(BA_IND);           00000830
       W_HENDELSE.GP_NETTO  = B02.PERSON.UFØRPENS.GP(BA_IND);           00000840
       W_HENDELSE.TP_BRUTTO = B02.PERSON.UFØRPENS.TP(BA_IND);           00000850
       W_HENDELSE.TP_NETTO  = B02.PERSON.UFØRPENS.TP(BA_IND);           00000860
       W_HENDELSE.ST        = B02.PERSON.UFØRPENS.ST(BA_IND);           00000870
       W_HENDELSE.KT        = B02.PERSON.UFØRPENS.KT(BA_IND);           00000880
       W_HENDELSE.UF_GRAD   = B02.PERSON.UFØRPENS.UFG(BA_IND);          00000890
                                                                        00000900
       END;                                                             00000910
                                                                        00000920
    ELSE                                                                00000930
                                                                        00000940
       DO;                                                              00000950
                                                                        00000960
       W_HENDELSE.GP_BRUTTO  =    B02.PERSON.ETTEBARN.GP(BA_IND);       00000970
       W_HENDELSE.GP_NETTO   =    B02.PERSON.ETTEBARN.GP(BA_IND);       00000980
       W_HENDELSE.TP_BRUTTO  =    B02.PERSON.ETTEBARN.TP(BA_IND);       00000990
       W_HENDELSE.TP_NETTO   =    B02.PERSON.ETTEBARN.TP(BA_IND);       00001000
       W_HENDELSE.ST         =    B02.PERSON.ETTEBARN.ST(BA_IND);       00001010
       W_HENDELSE.KT         =    B02.PERSON.ETTEBARN.KT(BA_IND);       00001020
                                                                        00001030
       END;                                                             00001040
                                                                        00001050
    W_HENDELSE.ANTALL_BARN = B02.PERSON.STATUS.ANTALL_BARN(Y_BARN_IND); 00001060
    W_HENDELSE.ANTALL_BARN_TIDL = B01.PERSON.STATUS.ANTALL_BARN(3);     00001070
    W_HENDELSE.TT               = B02.PERSON.STATUS.TT_ANV(BA_IND);     00001080
    W_HENDELSE.BOSATT           = B02.BOSATT   (BA_IND); /*JD 08.90 */  00001090
                                                                        00001100
                                                                        00001110
  /* *************************************************************** */ 00001120
  /* NY LOV 0192     JD 11.91                                        */ 00001130
  /* *************************************************************** */ 00001140
                                                                        00001150
    W_HENDELSE.GT_LOV92    =  B02.STATUS.GT_LOV92(BA_IND);              00001160
    W_HENDELSE.GT_TILLEGG_LOV92 = B02.STATUS.GT_TILLEGG_LOV92(BA_IND);  00001170
    W_HENDELSE.GARANTI_DATO_ÅM  = B02.STATUS.GARANTI_DATO_ÅM(BA_IND);   00001180
    W_HENDELSE.SPT_1291_EK      = B02.ALDERSP.SPT_1291      (BA_IND);   00001190
    W_HENDELSE.OPT_1291_EK      = B02.ALDERSP.OPT_1291      (BA_IND);   00001200
    W_HENDELSE.PÅ_1291_EK      = B02.ALDERSP.PÅ_1291      (BA_IND);     00001210
    W_HENDELSE.PÅ_ETTER91_EK   = B02.ALDERSP.PÅ_ETTER91   (BA_IND);     00001220
             /* HIT JD 1191 */                                          00001230
 /* ENDRET 031286 BF: YNGSTE BARNS FNR LEGGES INN I HENDELSES-       */ 00001240
 /*                   SEGMENTET. (DETTE SKAL BRUKES I R001NO20)      */ 00001250
                                                                        00001260
    W_HENDELSE.FNR_B(1)         = B02.FNR (Y_BARN_IND);                 00001270
                                                                        00001280
                                                                        00001290
 /* **************************************************************** */ 00001300
 /* FØLGENDE FELT HENTES FRA P0014009                                */ 00001310
 /* **************************************************************** */ 00001320
                                                                        00001330
                                                                        00001340
  /*IF B02.SPT_MOR(BA_IND) >= B02.SPT_FAR(BA_IND) THEN   */             00001350
  /* POENGREKKE BLIR FEIL . TRUDE  25.09.96*/                           00001360
                                                                        00001370
    IF B02.PENSJON_ETTER(BA_IND) = 'M' THEN                             00001380
       DO;                                                              00001390
          IND                      = MOR_IND;                           00001400
          W_HENDELSE.PÅ_EK         = B02.ETTEBARN.PÅ_MOR (BA_IND);      00001410
          W_HENDELSE.OPT_EK        = B02.ETTEBARN.OPT_MOR(BA_IND);      00001420
          W_HENDELSE.SPT_EK        = B02.ETTEBARN.SPT_MOR(BA_IND);      00001430
          W_HENDELSE.ÅR_BUP_FPP_EK = POREKKE.BUP_FPP_ÅR(MOR_IND);       00001440
          W_HENDELSE.FNR_EKTEF     = B02.FNR           (MOR_IND);       00001450
          W_HENDELSE.NAVN_EKTEF    = B02.NAVN          (MOR_IND);       00001460
          W_HENDELSE.SPT_1291_EK = B02.ETTEBARN.SPT_1291_MOR (BA_IND);  00001470
          W_HENDELSE.OPT_1291_EK = B02.ETTEBARN.OPT_1291_MOR (BA_IND);  00001480
          W_HENDELSE.PÅ_1291_EK  = B02.ETTEBARN.PÅ_1291_MOR (BA_IND);   00001490
         W_HENDELSE.PÅ_ETTER91_EK = B02.ETTEBARN.PÅ_ETTER91_MOR(BA_IND);00001500
                                                                        00001510
       END;                                                             00001520
                                                                        00001530
    ELSE                                                                00001540
       DO;                                                              00001550
          IND                      = FAR_IND;                           00001560
          W_HENDELSE.PÅ_EK         = B02.ETTEBARN.PÅ_FAR (BA_IND);      00001570
          W_HENDELSE.OPT_EK        = B02.ETTEBARN.OPT_FAR(BA_IND);      00001580
          W_HENDELSE.SPT_EK        = B02.ETTEBARN.SPT_FAR(BA_IND);      00001590
          W_HENDELSE.ÅR_BUP_FPP_EK = POREKKE.BUP_FPP_ÅR(FAR_IND);       00001600
          W_HENDELSE.FNR_EKTEF     = B02.FNR           (FAR_IND);       00001610
          W_HENDELSE.NAVN_EKTEF    = B02.NAVN          (FAR_IND);       00001620
          W_HENDELSE.BOSATT        = B02.BOSATT        (FAR_IND);       00001630
          W_HENDELSE.SPT_1291_EK = B02.ETTEBARN.SPT_1291_FAR (BA_IND);  00001640
          W_HENDELSE.OPT_1291_EK = B02.ETTEBARN.OPT_1291_FAR (BA_IND);  00001650
          W_HENDELSE.PÅ_1291_EK  = B02.ETTEBARN.PÅ_1291_FAR (BA_IND);   00001660
         W_HENDELSE.PÅ_ETTER91_EK = B02.ETTEBARN.PÅ_ETTER91_FAR(BA_IND);00001670
                                                                        00001680
       END;                                                             00001690
                                                                        00001700
    CALL PLASSER_TEKST(BA_IND,IND);                                     00001710
                                                                        00001720
 /* **************************************************************** */ 00001730
 /* HENDELSE SEGMENT SKRIVES UT.                                     */ 00001740
 /* **************************************************************** */ 00001750
                                                                        00001760
    CALL INSERT_HENDELSE;                                               00001770
                                                                        00001780
  /* *************************************************************** */ 00001790
  /*   HVIS BARNET SKAL HA BEREGNINGSGRUNNLAG                        */ 00001800
  /* *************************************************************** */ 00001810
                                                                        00001820
    IF  B02.PENSJONSTYPE1(BA_IND) = 'B' &                               00001830
        (W_HENDELSE.SPT_EK > 0 !                                        00001840
         W_HENDELSE.OPT_EK > 0 ) THEN                                   00001850
        DO;                                                             00001860
                                                                        00001870
  /* *************************************************************** */ 00001880
  /*   AVDØDE ER FAR                                                 */ 00001890
  /* *************************************************************** */ 00001900
                                                                        00001910
           IF B02.PENSJON_ETTER(BA_IND) = 'F' THEN                      00001920
              DO;                                                       00001930
                 CALL BYGG_OPP_BERGRUNL_SEGMENT_DØD(FAR_IND);           00001940
              END;                                                      00001950
                                                                        00001960
  /* *************************************************************** */ 00001970
  /*   AVDØDE ER MOR                                                 */ 00001980
  /* *************************************************************** */ 00001990
                                                                        00002000
           IF B02.PENSJON_ETTER(BA_IND) = 'M' THEN                      00002010
              DO;                                                       00002020
                 CALL BYGG_OPP_BERGRUNL_SEGMENT_DØD(MOR_IND);           00002030
              END;                                                      00002040
        END;                                                            00002050
                                                                        00002060
  END LAG_BARNEP_BEGGE_HEND;                                            00002070
